{"user_rating": 5.0, "review_count": 382, "name": "1889 WhiteGate Inn & Cottage", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "Frank and Ralph have done a wonderful job making guests feel welcomed! Their staff was professional and courteous. The Inn and our room, Dorothy Parker, was perfect. We were unsure if we wanted the formal nature of the sit down breakfast, but loved the conversation and entertainment. Very nice touch. Ralph gave us dedicated time in the garden where we shared plant stories and interests. We will come back to Whitegate.", "title": "Exactly what we wanted!", "user": "four-from-nc", "date": "October 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 181036693}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "We loved everything about our stay at the White Gate Inn. The room was gorgeous and super-comfortable. The house is beautiful, and the gardens are amazing. The staff is very friendly and helpful, and the food is delicious --they were kind enough to accomodate our special dietary requirements. The location is also great -- walking distance to downtown and restaurants. The adorable corgis are a delight (the come for brief visit after breakfast). We've stayed at a lot of B&Bs and White Gate Inn is right up at the top of the list. We'd definitely stay there again.", "title": "A Fabulous Inn", "helpfulness": 1, "user": "thyme2g0", "date": "September 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 177232921}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "We were in Asheville for our 50th anniversary, and opted to stay in a B&B. We couldn't have selected a better place to stay for 3 nights. The company was congenial and the rooms were excellent, albeit on the older side. The rooms had all the amenities of home, and maybe even moreso. The three breakfasts we ate were all fixed with great care, well cooked and presented by Frank and his staff. The afternoon gatherings in the garden with wine and snacks also were excellent. The location, within walking distance of down town Asheville, also was perfect for our interests for this weekend.", "title": "We give it top marks", "user": "gthayer", "date": "September 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 176309714}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "We will be back.", "title": "A lovely, warm Inn.", "user": "Debbie O", "date": "August 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 172955504}, {"rating": 5.0, "stay_parameters": "Stayed August 2013", "text": "Don't hesitate to book this lovely accommodation as your home away from home. Even if you're passing through and it's only for one night. Very clean, well priced, and the staff were very accommodating.", "title": "Great experience!", "user": "Waboof", "date": "August 17, 2013", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 172712821}], "location": {"country": "United States"}, "variance": {"poor": 4, "average": 10, "very good": 33, "terrible": 5, "excellent": 330}, "aka": "1889 Whitegate Inn & Cottage Hotel", "slim_ranking": 0.47619047619, "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.5, "rooms": 5.0, "location": 5.0}, "description": "Escape to our Four Diamond, romantic Asheville bed and breakfast offering majestic Blue Ridge Mountain views only steps from downtown. Our charming Asheville, NC B&B features amazing rooms and private garden cottages with Jacuzzis, fireplaces, flat screen TVs & luxurious amenities. Don’t miss out on unforgettable gourmet breakfasts, afternoon refreshments & award winning gardens our Inn in Asheville, and reawaken your senses with amazing treatments at our on-site Asheville spa."}