{"user_rating": 5.0, "review_count": 647, "name": "1896 O'Malley House Bed and Breakfast", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed April 2006", "text": "Well, by reading the posts here, you'll get a pretty good idea of how great the place is, how friendly and helpful Brad and Larry are, and the welcome you'll get from the boss, Cody.", "title": "It really is this good!", "helpfulness": 1, "user": "MagicRat", "date": "May 14, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 5067319}, {"rating": 5.0, "stay_parameters": "Stayed March 2006, traveled on business", "text": "Let me just add a comment about our stay - when it came to the day we left, we returned to the house after a morning in the city. There was the sound of gospel music coming from the street as we walked back from the trolley stop to pick up the car. Two doors down from the O'Malley House, there was a street party going on! We were given a drink and a cookie, and stayed to enjoy the atmosphere for a little while longer.", "title": "(Much better) home away from home!", "helpfulness": 3, "user": "nwsue", "date": "April 26, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 5010769}, {"rating": 5.0, "title": "Only 2700 restaurants re-opened!", "text": "It probably won't happen when you stay, but who knows? But do yourself a favour and enjoy the hospitality in what must be one of the friendlest B+Bs in America....", "helpfulness": 3, "user": "PSW", "date": "April 24, 2006", "id": 4999272}, {"rating": 5.0, "stay_parameters": "Stayed March 2006", "text": "I had the pleasure of getting to know my exceptional hosts, Brad and Larry, for over 2 months at the O'Malley House. I was the business traveler who just couldn't leave! I'm still thinking about that beautiful home, my new friends...I wish I could bring them with me on all my travels. Before finding the O'Malley House, I had quite the tour of other accomodations (major and \"fine\" hotels). Now, having found the jewel of B and Bs (or hotels for that matter), there is no other place for me in New Orleans. I can't wait to get back and take the Canal Street Streetcar...just a few steps from the door!", "title": "Top 10 Things to Love About the 1896 O'Malley House", "helpfulness": 4, "user": "LaraMc", "date": "March 21, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4722922}, {"rating": 5.0, "title": "The best B&B in New Orleans", "text": "There are some basic points that make the stay so very comfortable: all the rooms have private baths. If you haven't considered a bathroom as a romantic spot...you haven't been to the O'Malley House. There's a great cup of coffee at the ready early in the morning. Want your privacy? You could tuck yourself away for the entire stay. Want to sit around the living room or on the front porch swing discussing the latest NO news or culture or learn about some guests' own home? That's an option....that is if you can get yourself out of that cozy bed!", "helpfulness": 2, "user": "A TripAdvisor user", "date": "March 8, 2006", "id": 4594499}, {"rating": 5.0, "title": "Wonderful Experieince", "text": "I think this visit changed our view of B&B’s forever. What a marvelous place, a perfect blend of elegance and casual friendliness. The room was large enough to feel comfortable in for a week, and the bathroom was huge. Every morning offered a hot breakfast, fresh baked muffins, and cinnamon rolls as well as fresh fruit. Snacks and wine were available in the afternoons and evenings. Our hosts were delightful and Cody, a beautiful golden retriever, gave us our “animal fix” away from home. This is a great, safe location, in an historic neighborhood that is coming back with hope and strength, convenient to the noisier French Quarter by a short streetcar or cab ride, and quiet. It is one of the loveliest places in which we have ever stayed—exactly what a bed & breakfast experience is supposed to be!", "helpfulness": 5, "user": "journeytales", "date": "July 7, 2006", "id": 5438016}, {"rating": 5.0, "title": "Fantastic!! No more hotels!", "text": "This B&B is a destination on it's own. From the time I arrived, I was taken on a tour of the home and was made to feel like pampered guests by our hostess Angela, owner Brad and Cody the dog!", "user": "A TripAdvisor user", "date": "June 19, 2006", "id": 5362043}, {"rating": 5.0, "title": "The Gem of Mid City NOLA!", "text": "The home has been completely restored and each room is tastefully decorated, and very private. The jacuzzi tub in the Consultant Suite was wonderful.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "June 13, 2006", "id": 5337786}, {"rating": 5.0, "title": "Beautiful house, gracious hosts", "text": "Breakfast in the formal dining room was a real treat. Fresh fruit, and cinnamon rolls are always on the menu, as well as a variety of main courses from eggs stratta to fresh waffles. You definitely won't go hungry! There are even several local residents that stop by for breakfast while their homes are under construction, which adds to the tight-knit neighborhood feel.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "May 31, 2006", "id": 5287062}, {"rating": 5.0, "title": "The way to stay!", "text": "MUCH better than a hotel & cheaper too! I'll definitely return.", "user": "A TripAdvisor user", "date": "May 30, 2006", "id": 5236772}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled solo", "text": "I was able to spend 5 days at O'Malley House in Feb and thoroughly enjoyed my stay as usual. I have stayed here for the past 4 years whenever I am in New Orleans and it is a pleasure each time. Larry is a wonderful, helpful host, the food is great and the ambiance of the home is very charming. The location in Mid City is perfect, out of the hustle and bustle of the French Quarter but only a block from the Canal Street streetcar. I would not stay anywhere else. Oh yes... and Cody is a perfect greeter when you come back at the end of a long day.", "title": "Another excellant stay", "user": "chicagoite", "date": "March 3, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 57661665}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "The O' Malley House has a special charm and is a very beautiful place to stay in while visiting New Orleans. Larry is a great host, enjoyed his company. Ron is a wonderful cook. Cody is a very well behaved gorgeous golden retriever. The street cars are close by the house and we used them frequently. The O'Malley House made our stay in New Orleans unforgettable. Jason & Sabrina Byrom", "title": "We felt very welcomed and part of a family.", "user": "jabmamaBandera_Tx", "date": "March 1, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 57440594}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "Bandera,Tx.", "title": "Our home away from home in NOLA", "user": "KASKAM7", "date": "February 19, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 56524632}, {"rating": 5.0, "stay_parameters": "Stayed January 2009, traveled as a couple", "text": "I cannot say enough positive things about 1896 O'Malley House B & B. My husband and I have stayed there on five separate occasions in the last year and every time it has been a true pleasure. Upon arrival, always a warm welcome from innkeeper Larry (along with the house mascot Cody). Rooms are very comfortable, well-decorated. Beds are heavenly: I always sleep like a baby on those mattresses. Mid-City location very convenient to Canal St. street car makes getting to French Quarter a breeze. Every morning, I look forward to enjoying a well-prepared breakfast in the elegant dining room. Later in the day, a cold soda or an Abita amber ale with a snack-sized bag of Zapp's potato chips hits the spot. An all-around great experience whenever we come to New Orleans! It's hard to imagine staying anywhere else.", "title": "What a wonderful experience!", "user": "HappyARTraveler", "date": "February 14, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 55952582}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled with friends", "text": "My husband and I stayed at the O'Malley house last January over a long weekend. We had such a wonderful time there and are planning on returning this Spring. The rooms were beautiful, and the service was fantastic. Larry gave us great recommendations on dining as well as jazz clubs, and breakfast was amazing!", "title": "Can't wait to visit the O'Malley House again...and New Orleans!", "user": "DivaNorthCarolina", "date": "February 11, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 55721973}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "My first BNB experience, and I have to say it was superb. The \"house\" was like an antique store/museum, but I wasn't afraid to touch the gorgeous decor. The food was like a 5 star restaurant, but I wasn't intimidated to wear full on dress clothes for breakfast. Loved the open bar each night...", "title": "Exquisite Staff, Food, Accomodations & Vacation", "user": "NOLABedandBreakfast", "date": "January 19, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 53896449}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "I wish I could live there full time and be taken care of by Larry and his team. What a great experience and I can't wait to go back!", "title": "Wonderful place - would return in a heartbeat!", "user": "2Bunnies", "date": "January 18, 2010", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 53790934}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "BNB Convert!", "title": "Felt like I was visiting old friends", "user": "donna1atl", "date": "January 15, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 53544873}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "My husband and I stayed here during the cold snap that hit the South. While we did not have warm weather for our stay, we had a very warm welcome at the 1896 O'Malley House! It felt like staying at an old friend's house. Larry was very welcoming and entertaining as well as being a wealth of knowledge about the city. And, of course, we loved visiting with doggies-in-residence, Cody and Porter (newest addition to the household).", "title": "Very elegant, very clean, close to town. Definitely recommend!", "user": "terabyte240", "date": "January 5, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 52683361}, {"rating": 5.0, "stay_parameters": "Stayed December 2009", "text": "We stayed in the O'Malley room, which was very large and nice. The B&B itself was decorated in a stunning fashion from our guest room to the common rooms. It was great having access to complimentary refreshments in the kitchen area. And, breakfast every morning was wonderful!", "title": "a perfect new years eve in new orleans", "helpfulness": 1, "user": "Fiche", "date": "January 5, 2010", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 52663327}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "This lovely B&B lives up to its five-star reputation in every category. Despite our late arrival we were warmly welcomed by the fantastic manager, Angela. After a cold beer and much-needed shower, we climbed into the luxurious sheets of our queen-size bed.", "title": "The Jewel of New Orleans", "helpfulness": 4, "user": "lemoncino", "date": "August 30, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5728465, "likes": {"liked": "— The atmosphere", "disliked": "— Leaving!"}}, {"rating": 5.0, "title": "Like staying with friends", "text": "The breakfast each day was fabulous and enormous. The warm 'entrees' varied from waffles to crawfish casserole - all served fresh from the oven. It was also very interesting chatting with the various local \"personalities\", who would drop in for a bite or two and a cup of the delicious coffee.", "helpfulness": 4, "user": "austintripper", "date": "August 11, 2006", "id": 5600403}, {"rating": 5.0, "title": "Very fine B&B", "text": "The B&B itself is beautifully decorated and each room has its own character. It is located in a quiet street, within a minute’s walk of the Canal Street Car. Angela and the owners, Cody, Larry & Brad are welcoming hosts and are always happy to provide information and tips about their gracious city.", "helpfulness": 1, "user": "clm2006", "date": "August 3, 2006", "id": 5542841}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled with family", "text": "Staying at 1896 O'Malley House is a true Orlean experience in itself and should not be missed!", "title": "Timeless Hospitality", "user": "EVP", "date": "July 31, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5534187, "likes": {"liked": "— Hospitality of the hosts and beautiful furnishings", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2006", "text": "We just returned from a two-night stay at the O'Mally House. What a fabulous experience! The house itself is gorgeous and serves as a symbol of the rebirth of New Orleans. It sustained a great deal of damage during the hurricane, but owners Brad and Larry have lovingly restored it with great attention to detail, modern touches, and beautiful antiques and period reproductions.", "title": "Amazing B&B in a Terrific Neighborhood", "helpfulness": 2, "user": "jalex75", "date": "July 7, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 5438355}, {"rating": 5.0, "title": "Traveler's Dream Come True", "text": "All the words that I can write can not explain how much of a joy it was to stay at the O'Malley House. I travel very frequently and this was by far the best stay I have ever had. It not just a hotel...it is so much more. Brad and Larry are terrific hosts! The house is in beautiful condition, and the breakfasts are fantastic. Anyone, whether they be couples, singles, or families, should stay at this establishment. Brad and Larry are always there to help if you have any questions or concerns. The rooms are quite spacious. All and all, I plan to go back to New Orleans next Mardi Gras, and I will be staying there again!", "user": "A TripAdvisor user", "date": "March 5, 2006", "id": 4585048}, {"rating": 5.0, "title": "Highly recommended!!!!!!!!", "text": "My friends and I just got back from New Orleans (this afternoon, in fact), where we were doing some post-Katrina volunteer work. We stayed at the 1896 O Malley House for 5 nights, and it was hands down the best B&B or hotel I've ever stayed in. The house is spectacular and the owners have done an amazing job restoring it after the hurricane. In addition to the fabulous decor, I felt that I got to experience true Southern hospitality here. Two of us were Canadian and we were surprised to see that the day after our arrival, the hosts had put up the Canadian flag. This is just one example out of many of how accomodating and hospitable they were. Another being their going out of their way to accomodate me, a vegetarian, during breakfast - a communal, almost familial, affair that gave us a chance to talk with other visitors to the B&B as well as locals from the area. After long days volunteering, it was great to come back to this home away from home. Great food, knowledgeable, gracious hosts and beautiful surroundings describe this B&B and I was sad to have to leave!!!. Oh, and Cody, the hosts' Golden Retriever who has to be the most loved dog in New Orleans (there is a framed picture of him in every room at the B&B).", "helpfulness": 1, "user": "A TripAdvisor user", "date": "February 26, 2006", "id": 4522232}, {"rating": 5.0, "title": "Enjoy your stay in New Orleans", "text": "My wife and I recently came back from a trip to New Orleans. New Orleans is definitely on the road to revovery following Katrina and of course the famous French Quarter is very much \"open for business\" in spite of the great amount of recovery work that remains to be done elsewhere in the City. We had a great time and we stayed at the most wonderful place - a bed and breakfast called 1896 O'Malley House run by two enterprising and wonderful hosts. Go and enjoy this remarkable old home which is fully restored vintage home located near the downtown at 120 S. Pierce Street. Toll free at 1-866-226-1896 or [--]. If New Orleans is on your mind go there and be charmed by this charming and hospitable environment.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "February 6, 2006", "id": 4418367}, {"rating": 3.0, "title": "Word of caution about the area", "text": "Sincerley, Lynn and Steve, Toronto", "helpfulness": 3, "user": "A TripAdvisor user", "date": "January 29, 2006", "id": 4394974}, {"rating": 5.0, "title": "perfect comfort, terrific hosts", "text": "The O'Malley B&B is beautiful. I stayed in one of the second floor rooms for a few days and really enjoyed it. I did want to note for travellers though that the area around the Bed and Breakfast is devastated. No restaurants, no stores, no streetcars and no signs of life at night. This is changing slowly and I am not saying not to visit but just to be prepared. All of New Orleans is like this at the moment so be ready!", "helpfulness": 1, "user": "A TripAdvisor user", "date": "January 28, 2006", "id": 4393907}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "My husband and I very much enjoyed our visit to O'Malley House the last weekend in February. The house is beautiful! Our room was beautifully appointed and the bed comfortable. The breakfasts were yummy. The location was perfect as we wanted a quieter NOLA experience. The Canal Street street car was convienently located and we used it several times. Probably would've used it more often if we hadn't had our car. I will absolutely recommend O'Malley House to any and all who are planning a trip to New Orleans. I would also recommend Theo's Pizza (in the next block) and Mandino's (a couple blocks away) for a terrific meal. We spent a day at the WWII Museum, which was a very moving experience. We also visited two plantations..... Oak Alley and Laura.... very interesting (they were both on the same road approx. 30 miles west of New Orleans).", "title": "Lovely stay", "user": "KarenSMichigan", "date": "March 23, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 59344207}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "We loved our room, lovely and warm. We enjoyed the different people we met there to shared our stories and tours with. Larry was wonderful and very informed on things to do and what his favorite places were to do and see. Very quiet location as well as a relaxing environment. We loved our stay and can't wait to return!", "title": "Absolutely fabulous!", "user": "gdaycherio", "date": "March 22, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 59282031}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "My husband and I just got home from our first trip to New Orleans. We couldn't have picked a better place to stay! The O'Malley House, was incredibly beautiful, welcoming, and had great breakfasts! Although it's not in the French Quarter, we were glad to be away from the hustle and bustle of \"touristy\" areas. The streetcar just half a block away from the house offers a convenient, affordable way to get to the French Quarter and other areas. Larry was a great host, with excellent suggestions on where to go and where to eat. The complimentary wine, beer, and soft drinks were an added touch; something I've not seen at a bed and breakfast before! We loved the charm of this house and that it allowed us to see more of New Orleans than just the \"touristy\" things. Oh--if you're looking for the best pizza in New Orleans, eat at Theo's, just down the block from the house!", "title": "Fabulous place to stay in New Orleans", "user": "wisconsinbadgers", "date": "March 21, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 59137486}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "Larry we would like to think you for letting us stay in your wonderful house. This was our first experience in a B&B and it exceeded all of our expectations. We arrived and was taken on a tour of the house; all aspects to this place bring out the best in southern/NOLA culture. We booked the cheapest room in the house and was surprised at how big and detailed it was. Downstairs tea, coffee, beer, wine (red & white), cokes, sprite, and water is offered at all hours. Breakfast, in the morning (7-10), is formal but is kind of like a family get together where everyone in the house tells what they liked and didnt like from the night before around the town. From this you get ideas of what to do or not to do. The street car runs a block form the house and is only $1.25 per ride compared to parking at $20 in the quarter. Some quick recommendations: Mandino's (cajun/italian) restaurant is just two blocks away and was great, and also the WWII museum which will blow your mind. Cant wait to come back.", "title": "Amazing", "user": "timfullen", "date": "March 17, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 58799543}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled with friends", "text": "House is as nice or nicer than photos on website. Breakfast is excellent. Quiet at night which we wanted or we would have stayed in the Quarter. Good mattresses. Beautiful old house. Street car 1/2 block away and taxi very affordable to/from Quarter.", "title": "Excellent!", "user": "CarolBLosAngeles", "date": "March 8, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 58077623}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled with friends", "text": "Another great stay at the O'Malley!", "title": "WHO DAT?!", "user": "DallasBigTex", "date": "February 8, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 55513122}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "Great location for the Mardi Gras parades and the", "title": "Elegance and comfort at its best was enjoyed at the O'Malley House.", "user": "Quinch", "date": "January 28, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 54630898}, {"rating": 5.0, "title": "The Perfect \"Home Away from Home\"!", "text": "NEW ORLEAN SAINTS WORLD CHAMPIONINGS!", "user": "A TripAdvisor user", "date": "January 26, 2010", "id": 54415968}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "Four days of wonderful enjoyment and the RED Canal Street Cars are back!", "title": "The Big Ease in the Big Easy", "user": "Pynn46", "date": "January 25, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 54318569}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "If you haven't experienced NOLA and want to experience the City, make your", "title": "Fantastic, Quality B&B for a Great Price", "user": "Megbabem", "date": "January 21, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 3.0, "service": 5.0, "rooms": 5.0}, "id": 54042577}], "location": {"country": "United States", "city": "New Orleans"}, "variance": {"poor": 3, "average": 5, "very good": 21, "terrible": 1, "excellent": 617}, "aka": "1896 o`Malley House Hotel", "slim_ranking": 0.0134228187919, "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.5}, "description": "The 1896 O’Malley House Bed & Breakfast is located in historic Mid-City New Orleans. We are just a 10 to 15 minute STREETCAR RIDE DOWN CANAL ST. to the French Quarter and Convention Center. The Colonial Revival residence is nestled in a neighborhood that boasts great food, music and culture."}