{"user_rating": 5.0, "review_count": 102, "name": "19th Green Motel", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "As previously reviewed, the 19th Green Motel is an older highway-side motel that has been kept up well. Unlike some, it is set back from the main road enough so that traffic noise was not particularly obtrusive. The office staff were pleasant, efficient, and approachable. The grounds are very well kept and the cleanliness of our rooms was impeccable.", "title": "A Good Choice in Old Forge, NY", "user": "Rags2006", "date": "September 3, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 175371871}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "The TVs, as a previous reviewer indicated, are older analogue CRT sets; ours was low in contrast and brightness, though watchable. I do not know if adjusting the set's controls might have helped as, not actually interested in watching at the time, I did not try this. There was a wide range of channels available.", "title": "Great Weekend Stop", "helpfulness": 1, "user": "Kathy S", "date": "August 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 174185954}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "The walls were not thick enough to isolate loud noises from neighbors, but certainly no more so than at many mid to upper range chain properties we've stayed in.", "title": "Friendly owners and good location", "user": "Lisa M", "date": "August 26, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 174141158}, {"rating": 5.0, "stay_parameters": "Stayed August 2013", "text": "Our mattress was comfortable and the bed linens clean and pleasant. The wireless internet in our room, #1, worked reasonably well; the connection was not the fastest we've ever had, but was fast enough to be useful; our relatives in room #4, even closer to the office where the router is situated, experienced similar performance.", "title": "Great place to stay!", "user": "MrsColleenBailey", "date": "August 26, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 174091829}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "Unlike many properties in he area, no breakfast was included; rooms are equipped with coffee makers and supplies, and the office staff distributed extra supplies when asked. Rooms are equipped with refrigerators and microwaves, both worked well. Our refrigerator was the largest mini refrigerator we've had in any property, but it did not have any freezer compartment. Ice cubes were available in the office, but were not \"self-serve\", so filling full-size ice chests will require an alternate source. There are a number of restaurants within walking distance and additional ones short car rides away.", "title": "Nancy is the best", "helpfulness": 2, "user": "geoff o", "date": "August 17, 2013", "detail_rating": {"service": 5.0}, "id": 172735937}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled on business", "text": "My colleagues and I have been on tour for the past 6 months and we have stayed in every chain 'budget' hotel you can think of. 19th Green was by far one of the most friendly, clean, and customer-focused experience that I have ever had. The owners were extremely accomodating and when we left something they took the time to drive it over to where we were performing the next day. I would recommend the motel to anyone. It felt like I was staying with family.", "title": "Felt Like Family", "user": "collegek", "date": "June 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 163402879}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled solo", "text": "Friends of ours suggested this motel to me and they are very picky. The owners were very nice. I was looking for a quiet and quick place to eat dinner and the owners made several suggestions. The room was clean and had a fridge which was helpful because it was hot so I was able to re freeze my ice packs for the next day. The bathroom even had shampoo which most of these small places rarely have.", "title": "friendly owners, clean room", "user": "Sue K", "date": "June 5, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 163124210}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "We are snowmobilers and go up to Old Forge, NY every year. In all the times we have stayed at the 19th Green we have nothing but good things to say. Pat & Nancy are so nice, the room is always clean. We have stayed in many place over the years and this is the place we choose first. We call before we come to check conditions for riding and they are honest. Not like some others. Its a place to go in the winter. Also I've heard its popular in the summer months with all the lakes and water activities. Thanks for a great place to stay while riding.", "title": "Great Place, nice people", "helpfulness": 2, "user": "Doug - Patti S", "date": "March 22, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 155361623}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "Patti & Doug Smith", "title": "Another Great Stay at Pat and Nancy's", "helpfulness": 2, "user": "ChrisB48345", "date": "March 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 154232311}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with friends", "text": "We have been coming to Old Forge for several years and without hesitation we call Pat and Nancy to reserve our favorite spot in the heart of Old Forge. We always find them to be very friendly and helpful what ever our needs or questions. The rooms are very up to date and comfortable and the attention to detail and room cleanliness is beyond compare. Great price, great room, and more importantly...great people. Don't look any further, this is the place to stay in Old Forge!", "title": "The Best Motel in NY", "helpfulness": 1, "user": "Ruben A", "date": "March 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 153812566}, {"rating": 5.0, "title": "Weekend stay", "text": "Stayed at 19 th Green while visiting family. Very well kept property and the room was as advertised. The owners were very friendly and concerned about their customers. Would certainly stay here again.", "user": "Michael C", "date": "July 16, 2013", "id": 167787749}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "A second trip to the 19th Green Motel, and what a pleasant place to stay. Easy to find. Easy to park. Beautiful surroundings. Spacious, comfortable room with a large bathroom. Fridge and microwave. Friendly and helpful hosts. Nothing at all to dislike about this place! Glad they had a room for us.", "title": "Very nice place to stay", "user": "Moniquepeep", "date": "July 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 167197870}, {"rating": 5.0, "stay_parameters": "Stayed July 2013", "text": "We have stayed in three other motels in Old Forge and this is our favorite. The room was spotless. Free wifi, fridge, coffee in room, microwave all great extras. The beds were very comfy, the best of all the places we have stayed here. What others have said about the owners being helpful and welcoming is true! Thanks for a great stay. We will be back!", "title": "Our favorite", "user": "sewilder", "date": "July 3, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 166173214}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "First time to the Nineteenth Green, but it wont be the last. Had a wonderful stay. Very friendly owners Pat and Nancy. A very nice greeting from Chance their pet Golden-Doodle. The rooms were awesome and well kept. I loved the Knotty Pine ceilings. We felt like we were staying with family. Also the food places they recommended were awesome. if you go to Old Forge Stay with Family at The Nineteenth Green.", "title": "We will be back Pat , Nancy and Chance", "user": "Terry C", "date": "June 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 165677222}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "Terry", "title": "Friendly, clean and up to date motel", "helpfulness": 1, "user": "BobNepean", "date": "June 16, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 164199618}, {"rating": 5.0, "title": "A nice comfortable place", "text": "My first time in the Adirondack's, but it will not be the last, and when I return it will be back to the 19th Green Motel. It isn't the Ritz, but Old Forge is not the Big City - which is exactly the way it ought to be.", "user": "georgewp", "date": "August 10, 2013", "id": 171632860}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "Everything (A/C, TV, the John) worked and was sparkling clean and comfortable. Fridge, microwave and in-room coffee maker. I wish there had been de-cafe coffee available but I bet if I asked some would have been forthcoming. Lots of big towels which made me happy. Why do places at this price point give you towels that remind me of the ones in high school gyms?", "title": "Awesome Motel", "user": "Trina D", "date": "August 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 171112653}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "The owners (Pat and Nancy) and their very friendly labrapoodle \"Chance\" are on the premises. They gave good suggestions as to where to eat.", "title": "Outstanding Motel", "user": "paul l", "date": "August 1, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 170304237}, {"rating": 1.0, "stay_parameters": "Stayed July 2013, traveled on business", "text": "My husband, 2 children and mother-in-law just returned from Old Forge last Thursday. This motel is an excellent place to stay. It is a perfect spot to be. The kids enjoyed the family dog greeting us every time we arrived back at the motel. The owners are wonderful people. Our room was wonderful, lots of space for everyone. We had no problems with anything. See you next year, we will be back.", "title": "Experience", "helpfulness": 2, "user": "60763Jac", "date": "July 21, 2013", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 3.0, "sleep": 2.0, "rooms": 2.0, "location": 3.0}, "id": 168437502}, {"rating": 4.0, "stay_parameters": "Stayed July 2013", "text": "This motel is by far my favorite. My family recently stayed here for our vacation. My wife and daughters loved it too! The accomodations are excellent and the owners treat you like family. Who could possibly ask for more? Thanks so much Pat & Nancy. We'll be back next summer to go to Water Safari and see Chance(their dog) as my daughters loved him.", "title": "What a great place to stay!", "user": "ladybugg325", "date": "July 17, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 167955318}], "location": {"country": "United States", "city": "Old Forge"}, "variance": {"poor": 0, "average": 3, "very good": 14, "terrible": 1, "excellent": 84}, "aka": "19th Green Hotel Old Forge", "slim_ranking": 0.166666666667}