{"user_rating": 4.5, "review_count": 460, "name": "213 Carlton Toronto Townhouse", "reviews": [{"rating": 5.0, "title": "Beautiful Home - Great Location", "text": "My wife and I had the pleasure of staying at the Toronto Townhouse for three nights. The home is beautiful and the rooms are very clean, airy, and comfortable. Our host, Tan, served us a delicious home-made granola, fresh fruit, yogurt, crossisants, etc. for breakfast. Also, the location is very convenient -- the public bus (#506) passes by the home every ten minutes and drops you off right at the subway. Overall, this B&B is one of the very best my wife and I have stayed at, and we highly recommend it.", "helpfulness": 359, "user": "A TripAdvisor user", "date": "February 27, 2006", "id": 4559231}, {"rating": 4.0, "title": "Overall good B&B", "text": "Pros: The house is very nice, clean and well kept with interesting architecture. Tan (the host) is very friendly and makes a great breakfast (omelets, french toast, fruit, croissants and more). The garden looks nice but we visited in winter so didn't get to see it in blooom. The house was quiet, felt very safe and the location is decent.", "helpfulness": 355, "user": "A TripAdvisor user", "date": "February 27, 2006", "id": 4523657}, {"rating": 5.0, "title": "Great Location, Great Prices", "text": "Cons: Our particular room, the 'Upper Deck Suite' was very small for being a 'Suite'. We didn't get to see other rooms, but they look larger in the pictures. Price was a little high for such a small room. Other than the kithen, there really are no common spaces to speak of.", "helpfulness": 378, "user": "A TripAdvisor user", "date": "February 13, 2006", "id": 4458155}, {"rating": 5.0, "title": "Convienent, cozy, congenial", "text": "Overall we enjoyed our stay and its a good choice if all you need is a nice room and a good breakfast.", "helpfulness": 410, "user": "A TripAdvisor user", "date": "February 10, 2006", "id": 4450453}, {"rating": 5.0, "title": "Tan's the man", "text": "I stayed here for a weekend getaway by myself. The proximity to Church Street is a huge plus. The townhouse itself is very well kept, with a peaceful atmosphere that's certainly helped by the sunlight that shines through the place during the day. I highly recommend this establishment and will certainly stay there again on my next trip to Toronto.", "helpfulness": 538, "user": "A TripAdvisor user", "date": "January 27, 2006", "id": 4392756}, {"rating": 5.0, "title": "We Really Enjoyed Our Stay", "text": "The Toronto Townhouse B&B and it's manager Frank made for a pleasant first visit to Toronto. We stayed at the new house in the Annex area this past September. Frank made us right at home. Our room was spacious, clean and comfortable and best of all, overlooked a gem of a little garden where at times we enjoyed breakfast in the morning or a sip of wine at twilight. It is especially convenient to hop the subway or get to a bus line. We had no need for an automobile. We would definitely go back to this place on our return to Toronto.", "helpfulness": 784, "user": "A TripAdvisor user", "date": "January 6, 2006", "id": 4328644}, {"rating": 4.0, "stay_parameters": "Stayed December 2005", "text": "Again thanks for being a special host!", "title": "Wonderful Birthday Surprise!!!!", "helpfulness": 774, "user": "Amybyrd35", "date": "January 5, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 4327206}, {"rating": 5.0, "title": "good value and comfortable", "text": "Mary and Pat", "helpfulness": 747, "user": "A TripAdvisor user", "date": "January 3, 2006", "id": 4320961}, {"rating": 4.0, "title": "Most comfortable bed ever!", "text": "My first time in Toronto was excellent!!! The room was beautiful with a private balcony and a lovely view of downtown Toronto. Frank and Tan were wonderful hosts and the breakfast was delicious. We will definitely be back soon...", "helpfulness": 708, "user": "A TripAdvisor user", "date": "January 2, 2006", "id": 4316895}, {"rating": 5.0, "title": "Toronto Townhouse Worth the Trip", "text": "Mr. Tan, the owner, showed warm hospitality making our stay in Toronto for New Years 2006 memorable and fun. Upon arrival, he greeted us with a map and some suggestions on where to go around town. The Oasis Suite was perfect for a couple on a romantic vacation. The house itself was kept perfectly clean and the other guests were friendly. The central location of the house makes it a convenient place to stay. We will return here when we visit Toronto again.", "helpfulness": 717, "user": "A TripAdvisor user", "date": "December 22, 2005", "id": 4279910}, {"rating": 5.0, "title": "Great place to stay!!!", "text": "I stayed here for a weekend getaway to Toronto. Tan, the owner, was a great host, and prices were quite reasonable.", "helpfulness": 674, "user": "A TripAdvisor user", "date": "November 17, 2005", "id": 4123084}, {"rating": 4.0, "title": "Quiet sanctuary in a busy city", "text": "Our room was on the second floor of the bed and breakfast. It was clean and well decorated, and the view of Toronto from our balcony/porch was outstanding. Did I mention that Tan is a great chef? Breakfast was prepared for me when I got to the table and was delicious, including freshly cut fruit, yogourt and pancakes or french toast.", "helpfulness": 682, "user": "karinaz", "date": "November 14, 2005", "id": 4111649}, {"rating": 5.0, "title": "Has It All", "text": "All in all this was a fantastic escape. I would recommend this location to anyone!!!", "helpfulness": 761, "user": "SwedeJ", "date": "October 25, 2005", "id": 4051951}, {"rating": 5.0, "stay_parameters": "Stayed October 2005", "text": "If you want to absorb the 'feel' of Toronto without being overwhelmed or swallowed by it, I recommend the Toronto Townhouse B&B at 213 Carlton Street, located right in the heart of the historic district. It is squeaky clean, quiet and warm and convenient to everything a tourist could possibly need. Tan, your host prepares wonderful breakfasts with hearty coffee, fresh fruit and yogurt followed by delicious omelettes, French toast, pancakes and more. This B&B is affordable and charming and there is off street parking available, so no worries about being ticketed or towed away if you drove your car. A plethora of great places to dine are all within a short walking distance. After a busy day in the city this place feels as welcoming as an old friend's.", "title": "Nice & cozy B&B", "helpfulness": 813, "user": "FrancescoLondonUK", "date": "October 12, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4018211}, {"rating": 5.0, "title": "Toronto's Finest Guesthouse!", "text": "My husband and I spent the weekend of October 13 at this wonderful place. It had everything we were looking for: easy access to the subway; an iteresting and vibrant part of town (Koreatown, near the Annex); comfortable and pleasnt rooms; a great continental breakfast with fresh fruit and wonderful granola; and lastly, but certainly importantly, a pleasant and professional host who made the stay thoroughly enjoyable. It was a great experience and we will be returning again and again.", "helpfulness": 859, "user": "A TripAdvisor user", "date": "September 30, 2005", "id": 3979688}, {"rating": 5.0, "stay_parameters": "Stayed April 2006", "text": "It was a wonderful place. We were happy to find a super clean and nice place.", "title": "Wonderful place and warm welcome in Toronto", "helpfulness": 212, "user": "AnnetteAnnette", "date": "April 27, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 5014559}, {"rating": 4.0, "title": "A friendly and convenient place to stay", "text": "Tan, the owner, is a very nice and helpful man. We had a healthy breakfast everyday with cereals and fruits.", "helpfulness": 195, "user": "A TripAdvisor user", "date": "April 23, 2006", "id": 4998601}, {"rating": 5.0, "title": "It has to be good for me to write a review", "text": "The room was large and clean. Eventhough we had to share the bathroom, it was fine because there were not too many people on the same floor (only one room).", "helpfulness": 187, "user": "Peter0088", "date": "April 21, 2006", "id": 4994280}, {"rating": 4.0, "title": "Wonderful Experience", "text": "The location is quite good as well. We are close to all amenities and the College station. If you prefer not to walk so much, you also have the Street car very close to the B&B.", "helpfulness": 347, "user": "A TripAdvisor user", "date": "March 19, 2006", "id": 4692053}, {"rating": 3.0, "title": "Nice but Strange", "text": "I strongly recommend this place. Not expensive, nice and clean. Anne & Carolina (from Spain).", "helpfulness": 184, "user": "A TripAdvisor user", "date": "March 11, 2006", "id": 4599871}], "location": {"country": "Canada", "city": "Toronto"}, "variance": {"poor": 8, "average": 8, "very good": 63, "terrible": 5, "excellent": 376}, "aka": "213 Carlton Toronto Townhouse Hotel", "slim_ranking": 0.0683760683761, "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "Welcome! We offer a beautiful and grand heritage home. Air conditioned, centrally located - with quiet, pleasant surroundings in a non-smoking environment in the heart of Downtown Toronto. We're within easy access of many of the tourist attractions & walking distance to the subway. Guests rave about our breakfasts, service, and home cleanliness! We offer FREE Wi-FI Internet access for your laptop, smart phone, or PDA. We also offer FREE LOCAL & FREE LONG DISTANCE telephone use within North America to our in-house guests."}