{"user_rating": 4.0, "review_count": 163, "name": "35 Rooms", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed January 2011, traveled with friends", "text": "Our room was very clean and quite spacious. Everything was new and it was pleasant to be there. The hotel staff was very helpful. Although we were charged a slightly bigger amount than the one agreed upon booking, we were immediately offered a refund.", "title": "Modern Design", "helpfulness": 1, "user": "irz", "date": "October 4, 2011", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 3.0}, "id": 118923290}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "The ventilation is not sufficient. We had to keep the window open at all times because the room was smelling a bit musty. The wi - fi is almost non existent.", "title": "Best Location in Beirut...Trust me we scoured the city!", "user": "MoroMatador", "date": "October 4, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 118918301}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled solo", "text": "After being picked up by the airport by the waiting taxi driver which was arranged with the hotel. (They responded to emails quickly and clearly). we arrived at the chic city hotel and were very happily upgraded from a standard room to a Junior Suite. The room was spacious and very clean (didn't find any bad carpets or towels as other reviews say?). With free WiFi, nice powerful shower and a DVD player (borrow movies from reception).", "title": "Cool, boutique hotel.", "user": "DelphinaScott", "date": "October 2, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 118856334}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "The location is perfect a stones throw from Hamra Street with all the food places you could ask for and 'Servees' taxi's abound.", "title": "Very good city hotel", "helpfulness": 1, "user": "AndreaN1", "date": "September 27, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 118639490}, {"rating": 3.0, "stay_parameters": "Stayed April 2011, traveled with family", "text": "My ONLY gripe with this hotel is the breakfast, I went down on the first day to check it out and found the selection good but it did not look appetising at all. (DIY crepes? Come on I'm on holiday!) - BUT, Butter Mint restaurant is around the corner and 'Bread Republic' where we had one of the most amazing brunches is a 5 minute walk away.", "title": "Very Average", "helpfulness": 1, "user": "dina-dxb", "date": "September 24, 2011", "detail_rating": {"service": 3.0, "cleanliness": 1.0, "value": 3.0, "sleep": 2.0, "rooms": 2.0, "location": 2.0}, "id": 118524696}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "We stayed in the hotel for 3 nights in our second trip to this lovely city. The location of the hotel is just amazing, just a few meters from the Costa Coffee on Hamra Street so you can get to any close by attraction just on foot. The hotel was clean, staff were very helpful and caring , breakfast was a mix of western and classical and we found it to be quite adequate. We stayed in an executive suite and the room were nicely decorated, large enough, with even a kitchenette in it . The room was facing the street but when the windows are closed, we barely heard noises. They have pickup from the airport at 30 $ while you can find more cheaper alternatives, at low as 15 $.", "title": "Very good location and value for the money", "user": "Eaudecologne", "date": "September 3, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 4.0}, "id": 117630730}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "We found the hotel a good value for the money and definitely recommend.", "title": "Great place to stay in Beirut with a family - excellent value for money", "user": "KinsellaLebanon", "date": "August 25, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117219842}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled with friends", "text": "I stayed in a 2 bedroom apartment with a friend and my son. It was very clean and modern and the staff were wonderful and very service oriented. If you want to enjoy the bars of Hamra - the location is excellent. The breakfast was awful, it does not matter because there are plenty of good places to eat close by (buttermint is great). Also the towels were very worn and the carpet a little old. But, when you consider what you pay elsewhere in Beirut, it is hard to beat this place. If you want a good place to stay, and not a 'hotel experience', this is it.", "title": "Upgraded to the penthouse - yipeee!", "user": "Sparkly_Kitty", "date": "August 25, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 4.0}, "id": 117210548}, {"rating": 1.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "Went to Beirut with a couple of friends and we’d booked two rooms. On arrival, they let us exchange our two rooms for the penthouse, with an amazing wraparound terrace. Up there, you really feel part of a Beirut neighbourhood. The décor and furnishings are simple – quite Ikea-like, but clean. 35 Rooms is in a great spot, with all the bars of Hamra really close by. There’s a really good kebab place just up the road from the hotel that seems to be open 24 hours – great after a night of partying! Staff were very helpful but to be honest I can’t remember a great deal about our trip. It was quite decadent!", "title": "Nice hotel but not so nice staff", "helpfulness": 2, "user": "Nathan D", "date": "August 22, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 1.0, "value": 1.0, "service": 1.0}, "id": 117091451}, {"rating": 3.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "Well, the rooms look nice, the bathrooms always clean, the hotel modern and comfortable. What will ruin your experience here is the staff. Awful at best, thieves at worst. They play all kinds of money related tricks on you. If you want to enjoy your stay in Beirut, I suggest to choose another hotel. The service in this hotel is not 4 star it's less than one star. My stay there was the pure horror!!!", "title": "Nice, trendy and clean hotel with relaxed staff", "user": "DasHans", "date": "August 21, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 3.0, "value": 4.0, "service": 3.0}, "id": 117026364}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "If you're looking for a well appointed, well located place in central Beirut that doesn't break the bank - this is it. I went with my wife for my birthday recently. Having read the reviews on tripadvisor we chose this hotel. We were pleased and impressed by 35 Rooms from the outset. I emailed to ensure we would have a double room, not a twin, and because I mentioned it was my birthday they upgraded us to an executive room. That was followed up with a lovely basket of fruit when we checked in. The staff are really friendly and very helpful. All in all, we really got the impression that these guys cared about making us feel welcome, and they cared about what we thought of the hotel. Which is good, because I feel compelled to give them an excellent write up on here. They had good recommendations of where to go for meals and drinks, and because I couldn't get my phone to work, they helped us make reservations. The decor is sleek, modern and quirky in a good way but not flashy. The breakfast buffet is really good too. A couple of other nice touches - later check-out is standard (12pm-1pm) and the wifi, I think, is free (though we didn't use it). If you're looking for top end luxury and all the facilities under the sun, then 35 Rooms might not be for you, but as a comfortable, laid back, modern city hotel at a reasonable price, I wouldn't hesitate to recommend it to friends or strangers.", "title": "Great value, friendly staff, highly recommended", "helpfulness": 2, "user": "BonnerGate", "date": "August 21, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117019120}, {"rating": 1.0, "stay_parameters": "Stayed July 2011, traveled on business", "text": "The staff is trying to rip you off wherever they can.", "title": "Stay away!", "helpfulness": 3, "user": "Manuela M", "date": "August 21, 2011", "detail_rating": {"cleanliness": 1.0, "sleep": 1.0, "value": 1.0, "service": 1.0}, "id": 117018639}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with friends", "text": "e.g.: I had a hotel bill of 730 Dollars, gave them 800, got 50 back... one example out of many. Similar tricks with the taxis in front of the hotel.", "title": "All the basics in a SUPER modern brand new hotel", "helpfulness": 1, "user": "ThePhoenix0", "date": "August 19, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 116932675}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled with friends", "text": "Service is supposed to help customers, at this place, they didn't get that. There are plenty of nice hotels in beirut, 35 rooms is not one of them! So be smart and stay away!", "title": "Good hotel in a good location", "user": "andrewsco", "date": "August 8, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 4.0}, "id": 116438048}, {"rating": 3.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "Brand new hotel, building is 2 yrs old, funky modern design, each room has a different colour and theme. The lobby is small, and the front desk too, but when you are in Beirut its not to enjoy the HUGE LOBBY; the important thing is that you have a comfortable, friendly, CLEAN, well priced and well located place to stay. CLEANLINESS is the most important thing for me, an this hotel is pretty good.", "title": "We have expected more", "user": "Tatiana_Leyn", "date": "August 5, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 3.0, "value": 3.0, "service": 4.0}, "id": 116291453}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "We stayed at 35 Rooms during our vacation in Beirut. The trip was for the honour of my birthday so I and my partner wanted to stay in a special place. 35 Rooms proved to be a great choice.", "title": "Funky Stay- great breakfast, amazing location but dont forget to bring your own slippers!", "helpfulness": 1, "user": "TravellerAyish", "date": "July 29, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 5.0, "value": 5.0, "service": 4.0}, "id": 115979363}, {"rating": 3.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "Location-wise it was right in the middle of Beirut, walking distance to everywhere! Very close to shopping centers, historical district, American University of Beirut's campus and to Corniche, Pigeon Rocks...", "title": "Good but average", "user": "boof5454", "date": "July 25, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 3.0, "service": 4.0}, "id": 115775528}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with friends", "text": "We had a huge poster of a 70s style green Mercedes Benz as a headboard for the bed, in fact we found it amusing as some of the taxis we used were the same old Mercedeses.", "title": "Lovely hotel in great location", "helpfulness": 1, "user": "nellamay", "date": "July 20, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 4.0}, "id": 115557562}, {"rating": 3.0, "stay_parameters": "Stayed July 2011, traveled with friends", "text": "The hotel had only one elevator so it took a while for us the reach to the ground floor where the amazing breakfast was served. Breakfast was legendary, it was open buffet style with really rich choices, it is even possible to make fresh crepes with fruit and chocolate spread.", "title": "A smile would be nice", "user": "KarienJ", "date": "July 14, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 3.0, "service": 1.0}, "id": 115344139}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled with friends", "text": "The only negative thing about the hotel was that there were no slippers in the room. But the management told us that they were working on the issue.", "title": "Fab hotel, friendly staff, perfect for a girlie weekend", "helpfulness": 1, "user": "P1onkz", "date": "July 13, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 4.0, "service": 5.0}, "id": 115326085}], "location": {"country": "Lebanon", "continent": "Middle East"}, "stars": 4, "variance": {"poor": 5, "average": 17, "very good": 80, "terrible": 7, "excellent": 54}, "aka": "35 Rooms Hotel Beirut", "slim_ranking": 0.220183486239, "description": "Located in Hamra-Beirut, 35 Rooms is the perfect mix of comfort and originality."}