{"user_rating": 4.5, "review_count": 145, "name": "3 Explorers Motel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with friends", "text": "I have chosen this motel because of the good reviews. My expectations were high and I was not disappointed. Furthermore, I was impressed by the quality of the service and the room. We have been welcomed by the owner who was particularly helpful, caring and friendly. The room was clean and cozy. The breakfast served at room without extra charge was a great start of the day. There are plenty of nice walks and falls to see from there. It is walking distance from the train station. I dont normally write reviews, but everything was so great, I thought the least I can do is share my enthusiasm for the 3 Explorers Motel!", "title": "Outstanding service, great value for money!", "helpfulness": 2, "user": "MarieC1234", "date": "August 7, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116368002}, {"rating": 3.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "We stayed here for the weekend. Admittedly the weather was miserable, but we didn’t have a great time here. The Hotel was okay, just not as nice as what we were expecting. It was lacking an atmosphere. Well that’s what we put it down to. My wife and I are sports mad & there were no cable channels to watch. We thought everybody had cable TV these days. The room was modest and the bathroom was a bit dated. Also, the room was very damp so there was a bad smell. You could hear the people in the adjacent rooms on both sides of us most of the night. Not sure if this is because of the walls or if they were really loud. If you are expecting a lot then this is not the place for you. The gentlemen that check us in Jason was nice and knew the area.", "title": "Not Bad... Not Great...", "user": "Barneys040", "date": "July 27, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 1.0, "value": 1.0, "service": 4.0}, "id": 115828927}, {"rating": 3.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "The motel has just been refurbished so the rooms are modern - exactly what you see in the internet. We got ourselves a luxurious spa room at around S$326, which i thought pricey for a motel. Well not much choice as it was a last minute booking & we were left with little choice, esp we were staying for a night on Sat. 3 explorers motel offers one of the nicest rooms amongst the hotels/motels available in Katoomba.", "title": "Like: spacious & modern room. Great location. Turn off: poor customer service by one black sheep.", "helpfulness": 3, "user": "icypen", "date": "July 20, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 3.0, "service": 3.0}, "id": 115597783}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "Upon arrival, we were greeted by a friendly & polite lady receptionist.", "title": "We loved it and we will defiantly be back", "user": "Elanor_graham", "date": "July 13, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115314389}, {"rating": 4.0, "stay_parameters": "Stayed July 2011", "text": "Room: Luxurious spa suite has a main bedroom and another bedroom with 2 single beds. Jacuzzi tub with shower. Bathroom wasn't cold (3 deg that night) like it was mentioned in another review. Electric blanket and heater kept us warm throughout the cold night.", "title": "Great Value", "user": "Scottym1", "date": "July 1, 2011", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 114931731}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled with friends", "text": "Location was foremost. Mere blocks away from Scenic World and 3 SIsters lookout....and esay walking distance from the Katoomba main street and train station. Right across the street from Blue Mountains Chocolate Company and Explorer Bus (as well as) local Bus stops. Superior Room was nice size and equipped with all that was needed; mini frig, microwave and all necessary for a nice afternoon or evening coffee or tea break. Owners were friendly and accomodating; willing and able to assist us with directions, recommendations and holding our luggage so we could hike and pick up right before going back on the bus to the train.", "title": "Everything I needed...in the BEST location", "helpfulness": 1, "user": "PPTA", "date": "September 19, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 118341327}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled with friends", "text": "Stayed in a neat room with a queen & 3 singles (2 of them were bunk beds). Quiet, clean, with nice owners and decent breakfast. Comfortable bed with undisturbed sleep, although our friend who slept in the bunk bed said it was not long enough to fully accommodate an adult. Convenient location, 2 min drive from town centre. I will happily recommend this place as a decent and affordable accommodation.", "title": "Clean, quiet, all round adequate", "helpfulness": 1, "user": "boolnz", "date": "September 18, 2011", "detail_rating": {"value": 4.0, "location": 4.0, "service": 5.0, "rooms": 3.0}, "id": 118265131}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "Arrived in Sydney around 6am then drove straight to Katoomba. It took us 2 hours as it was peak traffic from airport to M4.The weather was rather miserable but luckily enough, we were allowed early check in. There was not much to see as it was covered in thick mist, very cold temperature with heavy rain. We managed to see the 3 sisters on our last day.", "title": "what a gem!", "helpfulness": 1, "user": "nonique99", "date": "September 17, 2011", "detail_rating": {"value": 4.0, "location": 4.0, "service": 4.0, "rooms": 5.0}, "id": 118229368}, {"rating": 3.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "The motel was comfortable, very clean and the caretakers were friendly and helpful. There is a reverse cycle air cond and electric blanket to keep us warm but the bathroom was very cold. Good location and value for money. We were within walking distance to all the major attractions. Must try the hot chocolate across the road!!", "title": "OK stay.", "helpfulness": 1, "user": "CatherineEnfield", "date": "August 15, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 3.0, "value": 3.0, "service": 3.0}, "id": 116749442}, {"rating": 5.0, "stay_parameters": "Stayed August 2011", "text": "Stayed for one night with our two teenage boys in the family room. No complaints. Room was OK. Bathroom a little dated but all adequate. Very convenient for the sights. The owners were away, but a very nice lady welcomed us and advised us on where to eat.", "title": "Great location, nice and warm, nicely updated needs a few little finishing touches.", "user": "Mummaoftwo", "date": "August 9, 2011", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 116459884}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "we stayed here as we were horse riding nearby. The service was amazing the couple who own it were so friendly and the breakfast was amazing! baked beans and bacon. So reasonable. The rooms were not only clean but very modern. Perfect for two people. The bathrooms were older but this didn’t matter as they were in great condition and clean!", "title": "Great place - Friendly, Clean, Great BREAKFAST", "user": "louise_m2011", "date": "June 15, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 113575891}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled with friends", "text": "The heating was great, and the bed was very comfortable.", "title": "Very Happy and would stay again", "user": "Dididi11", "date": "May 31, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 3.0, "value": 4.0, "service": 5.0}, "id": 110850785}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled with family", "text": "Would defiantly recommend to anyone.", "title": "Very Good Value for Money!", "user": "HotMama168", "date": "April 29, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 106092137}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled on business", "text": "Accomodation was what they had described, rooms were very clean and comfortable. Room was heated prior to our arrival, milk in fridge for a cuppa. Staff were very friendly and accomodating. We will definately stay there again. Cheers.", "title": "Great location and friendly service", "user": "Brucebdlphoto", "date": "March 20, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 100787227}, {"rating": 4.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "The Kiwi couple, Anne and Robyn, running the place is 3 Explorers' best asset. They were kind, warm, hospitable and friendly. Robyn even fixed the GPS we rented from Budget! He went out of his way to help us and for that we are grateful. We were in a middle of a road trip from Sydney, Blue Mountains and Hunter Valley and we didn't know where we could get a replacement GPS! They also suggested good restaurants for our family. (We loved the Swiss Cottage restaurant. )", "title": "Nice stay.....", "user": "IzzzyHampshire", "date": "March 8, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 99337715}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "We stayed for two nights recently at this recently renovated motel. The staff were friendly and the rooms were very comfortable and welcoming. Location was terrific with everything we wished to see in walking distance. Would highly recommend this motel to those that want value for their money with a great location", "title": "Great location, nice rooms, great service", "user": "SydneyDianeC", "date": "March 3, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 98735433}, {"rating": 4.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "the 3 explorers is an old hotel on the outside however the inside of the rooms are clean modern with a new telly, fridge and microwave. everything you hope to get in a hotel room and seldom do! i would come back any time.", "title": "lovely and clean", "helpfulness": 1, "user": "wrenbird88", "date": "February 12, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 96312593}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled with family", "text": "We recently stayed at the 3 Explorers with our 2 children and were very pleased with the newly renovated family rooms- extremely comfortable and stylish. Matthew the manager was very helpful telling us great things to see and do in the beautiful Blue Mts. We had a wonderful 3 night stay and will definitely return.", "title": "Great family rooms", "helpfulness": 3, "user": "nomad301", "date": "January 28, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 94788171}, {"rating": 4.0, "stay_parameters": "Stayed January 2011, traveled with family", "text": "We have stayed here priot to the renovations and it was good, it is much better now with new paint, carpet, furniture and furnishings although new bathroom finishes would have completed the transformation. Nevertheless we weren't dissapointed. We had two rooms which were very well appointed and renovated with clean functional bathrooms. The proximity to the echo point and scenic world is excellent. I would definately consider staying here again.", "title": "Good then better now", "helpfulness": 4, "user": "cromwell-o", "date": "January 19, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 93688250}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "Excellent value in Katoomba. Brief walk to Three Sisters and many walking trails of various difficulty. Beautiful setting in an interesting town. Accommodation is extremely clean with bar fridge, morning coffee supplies and lots of towels. Property has been recently refurbished including air conditioning, brand new beds and lovely bedding. Matthew, the owner, is informative and helpful. We absolutely recommend this property.", "title": "3 Explorers is welcoming and clean", "helpfulness": 6, "user": "SylvanLakeGirl", "date": "January 9, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 92327250}], "location": {"country": "Australia", "continent": "South Pacific"}, "stars": 4, "variance": {"poor": 1, "average": 18, "very good": 60, "terrible": 1, "excellent": 65}, "aka": "3 Explorers Hotel Katoomba", "slim_ranking": 0.0625}