{"user_rating": 4.0, "review_count": 64, "name": "44 Curzon Street Apartments", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled with friends", "text": "The location could not be better. In Mayfair and steps from numerous restaurants, pubs, shops and the tube. A short walk to Buckingham Palace, Fortnum & Mason and the high end stores on Bond Street. For the price of a hotel room, you get a sitting room, bedroom, and a kitchen. Granted, you will not have all of the amenities of a full service hotel, but you do have a nice, cozy flat all to yourself. Some of the furnishings could do with a little updating, but all in all, we thought it was perfect for our needs. We stayed for 2 days, left our big suitcases with them for storage and went off for 3 days in Paris. When we came back, the luggage had already been placed in our new rooms and Terri, the manager was there to let us in for our late arrival. Both Ruth and Terri, on the desk were lovely and very helpful to us. This is where I will stay on my next visit.", "title": "Wonderful!", "helpfulness": 2, "user": "SloKnitR", "date": "October 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 143382700}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "We stayed in the 3bd apartment in 10 Charles street for five nights. The apartment was very well located to major attractions, plenty of places to eat and transport. We had plenty of room as a family of 5 with three kids under 10. The apartment was well presented but it needed to be a little tidier in the kitchen. We would certainly stay there again on a trip to London.", "title": "Mayfair magic", "helpfulness": 4, "user": "teamtanner", "date": "September 20, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 140773065}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "We stayed here for our first ever visit to London.", "title": "Perfect Location", "helpfulness": 5, "user": "Boater81", "date": "September 13, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 140184778}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "It is perfectly placed in Mayfair. There are 5 floors, 12 apartments and is literally right next to Shephards Market which is full of restaurants and very close to Buckingham Palace, Hyde Park, Piccadilly etc (all walkimg distance).", "title": "Great place, brilliantly located, would stay at again.", "helpfulness": 2, "user": "dan1255", "date": "August 24, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 138169467}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with friends", "text": "It's not too far to walk to Harrods, Regent Street, Bond Street either.", "title": "Old Fashioned English Charm in a First Class Location", "helpfulness": 3, "user": "wildflowerb", "date": "August 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 137167894}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "Stayed with our two kids (12 & 9) in their walk-up building across the street (10 Curzon). Creaky floors, but fit the character of the place. Full kitchen with mini-Tesco a block away. Worked really well to give is that British vibe. Friendly/fast service. Great centrally located neighborhood with easy access to Green Park Underground. Right across from Shepherds Market great pubs and restaurants without the traffic or crowds. Used www.expressways.com for excellent airport transport both ways.", "title": "Perfect Stay in Perfect Locale", "helpfulness": 1, "user": "BeachChair", "date": "April 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 157740512}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "We stayed here for six nights. The accommodation, whilst older, is very good. Great location - close to restaurants, tube and not many stops from central London. The heating is great for such an older building. The drainage of the bath tub/etc is a little slow, but it is an old property. Definitely would stay here again.", "title": "Great location", "helpfulness": 3, "user": "Parn04", "date": "April 12, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 157518620}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "Go for the location and the size of the unit.", "title": "33 Charles Street Unit # 2 ,Mayfair,London Property", "helpfulness": 1, "user": "imskaribas", "date": "March 30, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 156091863}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "We stayed in March in a 3 bedroom 2 bath apartment located in this upscale neighborhood,with attractions and theater/shopping in walking distance.For the price the accommodation was superb.There were some minor issues with windows not closing all the way which presented a bit of a problem since London was experiencing a very cold front these days.The only other negative that I can think of is the carpet which was a bit aged ( I am sure so is these units) and the creaky floor.We had breakfast every day in the unit and we could buy all the necessary from a small market just 5 min walking distance.Some silverware was missing from kitchen ( cereal bowls).Unit has also a washer/drier that we used.WI-fi available and reliable.Concierge was fine,and the unit clean.The location again great.I would recommend strongly and advice to book early.", "title": "Excellent Location", "helpfulness": 2, "user": "Paul D", "date": "February 25, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 153142547}, {"rating": 3.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "3 Star , 6 /10.", "title": "Unit 3 10 curzon st mayfair", "helpfulness": 1, "user": "OZG-S", "date": "January 24, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 150538593}, {"rating": 2.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "We stayed in one of these apartments at the end of June for 5 nights,our travel agent said it was an excellent location and this is true. It was.However the service and quality of the apartments was very poor. There is no parking in front of the apartments and we had to lug our suitcases up 4 steps ourselves to the tiny lobby as there was no porter. Similarly no porter to get your luggage to the room. The room we had was on the 5th floor. There was an antiquated, steel cage lift but it was tiny ,it held one person with luggage.Anyone with claustrophobic issues would do best to avoid it. The stairs shook everytime anyone did use the lift.", "title": "No luxury here!", "helpfulness": 4, "user": "Pat905", "date": "July 21, 2012", "detail_rating": {"service": 2.0, "cleanliness": 1.0, "value": 1.0, "sleep": 3.0, "rooms": 1.0, "location": 5.0}, "id": 135021905}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "We would have put up with this except that our apartment was really shabby and cramped, The \"kitchen\" was in the tiny space between the living room & the bedroom, directly as you opened the entrance door. The bedroom had a queen bed quite comfortable but you had to sidle round it to get into it. Going by the state of the rest of the apartment I seriously wondered if the sheets had even been changed. The apartment was crammed with old cast- off furniture.", "title": "Location Location", "helpfulness": 3, "user": "BetterFlyingNow", "date": "July 17, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 134626605}, {"rating": 5.0, "title": "Has anyone stayed at a studio apartment t at4 Curzon Street", "text": "The bathroom was a disgrace.The tooth mugs still had the spit in them from previous guests!The bath & basin were filthy. The taps and fittings were encrusted with crud.The living room was extremely shabby and again the sofas and cushions were stained and dirty. Student flatters would turn their noses up at them.", "helpfulness": 5, "user": "Roxyandrew", "date": "July 13, 2012", "id": 134247672}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "Some sort of paranoia was operating as the hideous china swan ornaments were glued down!", "title": "Location is the luxury", "helpfulness": 2, "user": "StuChristie", "date": "June 13, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 131914261}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "Luxury apartments my eye! There was not even any electronic card means of access just a key which didn't always work in the front door as the lock was loose.", "title": "Great room, but other things let it down", "helpfulness": 1, "user": "Cindy L", "date": "June 11, 2012", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 131718531}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "We rented a 3B2Bath apartment at 44 Curzon (family of six). Check in / out was smooth. The property was well kept (although not luxurious) and all the apllyances worked well. As it is located in Mayfair, it is an exceptional base to explore London.", "title": "Good base to explore London", "user": "acukiert", "date": "January 23, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 150429261}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "We stayed in a one bedroom apartment and couldn't have been happier. The apartment was spacious and comfortable. The kitchen and bathrooms were fairly new and had all the comforts of home...we particularly appreciated the Nespresso coffee machine! The apartments are centrally located and we could walk to Buckingham Palace and Hyde Park. Green Park station was literally around the corner too! The apartments were very clean and were serviced daily. Would definitely stay again!", "title": "Recommended", "helpfulness": 3, "user": "Becky B", "date": "January 21, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 150216032}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "We stayed at these apartments for 4 nights and were very impressed with the experience. Very clean and well presented with a kitchenette including a stove and microwave. The room was serviced daily if we wanted it {except Sunday} Bathroom had a good sized bath with shower over bath, was very clean and heated. Comfy bed lots of wardrobe space. The lounge area had everything that you would need including a table and chairs for eating meals. Also a safe for valuables..The staff were very friendly and very helpfull. Plenty of places to eat within 5 minutes walking time. All in all we would recommend these apartments as good value and a very central place to stay in London with taxis available all the time day or night.", "title": "Recommended", "helpfulness": 3, "user": "Becky B", "date": "January 20, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 150087504}, {"rating": 4.0, "title": "Spacious and comfortable. Great location.", "text": "We stayed with our family of five including three teenagers in a 3 bedroom unit. The apartment was spacious and very comfortable. The kitchen was large and had everything we needed. We felt very secure in the area and many things are within walking distance. Cabs are readily available if needed. It would have been helpful if the concierge was more knowledgeable.", "helpfulness": 3, "user": "Bakeacake28", "date": "December 6, 2012", "id": 146866679}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled on business", "text": "I spent 8 nights in a 1 bedroom at 44 Curzon Street - in the 44 Curzon Street block. The apartment is more than adequate for 1 or 2 people sharing and having a separate lounge and the kitchenette is just so much better than being squashed in a hotel room. The flats are comfortable and it was easy to feel very much at home very quickly. The antique lift is a bit cramped, but it's part of the character of the building and I used the stairs most of the time anyway.", "title": "Home from Home", "user": "SMT152", "date": "November 19, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 145724327}], "location": {"country": "United Kingdom (UK)", "continent": "Europe", "city": "London"}, "variance": {"poor": 2, "average": 4, "very good": 34, "terrible": 2, "excellent": 22}, "aka": "44 Curzon Street Apartments Hotel London", "slim_ranking": 0.25023255814}