{"user_rating": 4.5, "review_count": 155, "name": "525 Hotel", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "My wife and I stayed here for two nights at the start of our holiday in Murcia. We arrived after 11pm, due to a delayed flight and problems with hire car pick-up (don't use Auriga Crown car hire!), and were delighted that the hotel was only a 10 minute drive from San Javier airport. The staff were friendly and helpful.", "title": "Quality Hotel close to airport and beach", "helpfulness": 1, "user": "DavidT1", "date": "April 2, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 14732394, "likes": {"liked": "— Proximity to airport and beach. Clean spacious room. Breakfast.", "disliked": "— No tea/coffee facilities"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "Our room and bathroom were clean, pleasant and of a reasonable size. Free secure parking was a bonus as we paid 16 euros/night in Murcia city. The buffet breakfast was very good and worth the 10 euro cost though there are several good cafes nearby where good (cheaper) alternatives can be had. There are also 4 or 5 good restaurants adjacent to the hotel. The only disappointment was the absence of tea/coffee making facilities in our room.", "title": "an unexpectedly great hotel", "user": "sheila_tyrrell", "date": "March 12, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 14241540, "likes": {"liked": "— room and location", "disliked": "— snack bar not open so no casual area for daytime food and drink"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "Los Alcazares beach is about 5 minutes walk away. It is a relatively quiet beach with no high-rise buildings.", "title": "Stylish hotel with great breakfast", "user": "Seadog68", "date": "February 4, 2008", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 4.0}, "id": 13252697, "likes": {"liked": "— Room style & furnishings.", "disliked": "— Views (lack of)"}}, {"rating": 3.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "For those (like us) who like to get away from the crowds, I'd recommend the Calabranque regional Parque - a coastal stretch with unspoilt beaches and excellent walks. In contrast, we were disappointed with Cartagena, further along the coast, where poor planning controls have allowed ancient buildings to be blighted by ugly modern developments.", "title": "More style than substance", "helpfulness": 1, "user": "JoeAtiyah", "date": "December 20, 2007", "detail_rating": {"cleanliness": 3.0, "front_desk": 4.0, "location": 4.0, "value": 3.0, "rooms": 3.0}, "id": 11707226, "likes": {"liked": "— location", "disliked": "— room temperature"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "we stayed here last week after leaving ahotel in Archena which was ahuge disapointment. (see review on Hotel levante). I had stayed in Los Alcazares 3 years ago in an apartment and was not overly impressed but as we needed to find somewhere to stay at short notice and fancied a coastal resort we decided to give it a try. The hotel 525 was not built last ime I was there but found it on trip advisor and it far outweighed my expectations!The location is excellant near to airport {not too near} 5mins from beach area good local restaurants (try the El Patio} The hotel rooms are well appointed modern decor we had a suite worth the extra cost. The staff were helpful . The bar was stylish and comfortable we did not try the restaurant and we didnt see anyone else in there (it was early and had just opened}.The spa was fine my husband had amassage which was good Altogether avery enjoyable stay we hope to return! (Secure parking).", "title": "Too Up Market", "helpfulness": 2, "user": "carbut", "date": "September 5, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 8659251, "likes": {"liked": "— free mini bar", "disliked": "— breakfast"}}, {"rating": 5.0, "title": "Very Good Hotel", "text": "Stayed at Hotel 525 for 5 nights in the middle of September. Checkin process was very quick and easy, staff plesant.", "user": "clairey20", "date": "September 26, 2008", "id": 20389379}, {"rating": 5.0, "title": "fantastic hotel", "text": "Hotel is in a good location being a 10 min drive from the airport and a 5 min walk from the beach. There are plenty of Restaurants, Cafes and English bars just outside of the hotel. The only thing we disliked was that these all catered for British people and we couldn't find an authentic Spanish place anywhere. Not the hotels fault though! As it happens, their own food was delicicious and very reasonably priced.", "user": "APRICOTStaffs", "date": "July 26, 2008", "id": 18283317}, {"rating": 3.0, "title": "hotel fantastic staff need to be more friendly not very happy people", "text": "We stayed on a room only basis, this was fine as there are lots of places to eat breakfast for around 3-10 Euros depending what you want to eat.", "user": "sarahpatt", "date": "July 12, 2008", "id": 17804915}, {"rating": 4.0, "title": "good hotel", "text": "Hotel facilities are excellent - there is a lovely roof top spa for over 18's only which is really peaceful. There is a small pool (not big enough for swiming) and an outdoor hot tub. Also, if your flight leaves after you have checked out, you can stay and use these facilities all day - including showers.", "user": "risingsun", "date": "May 22, 2008", "id": 16318645}, {"rating": 5.0, "title": "Great Hotel", "text": "The rooms are large and clean, new towels are given every day and there is a minibar fridge which you can put your own bits in if you need to. Only negative on the room is lack of tea and coffee making facilities.", "user": "RunnerDuck", "date": "May 20, 2008", "id": 16228087}, {"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled on business", "text": "I needed somewhere clean and convenient for visiting/finalising Roda Golf property purchase. This hotel was immaculately clean and had staff who were very willing to help out (all good English speaking). Abundance of decent restaurants within short walking distance. Don't miss out on the free steam room and sauna on the top floor. There is also a small pool on the top floor, but so shallow you won't be able to swim in it - good for cooling off though. Also the sun beds on the top of the roof beside the pool looked good, but definitely not comfortable. There is also an outdoor jacuzzi beside the pool and a smart indoor one with a great view - it is the tallest building in the area. Beach is a few minutes walk away. Bar is modern and spacious with lots of large sofas etc. Bedrooms are also large, modern with flat screen TV and digisat. Bed was extremely comfortable. Underground parking was free in the hotel, although off season (I visited in May), there weren't any issues with finding parking.", "title": "Put on your short list", "helpfulness": 6, "user": "drillrep", "date": "May 25, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 4.0}, "id": 7697308}, {"rating": 4.0, "title": "Spotlessly clean and Conveniently placed.", "text": "Just a few quick lines.", "helpfulness": 13, "user": "JetJockey", "date": "March 24, 2007", "id": 7214464}], "location": {"country": "Spain", "region": "Region of Murcia", "continent": "Europe", "city": "Los Alcazares"}, "stars": 4, "variance": {"poor": 0, "average": 8, "very good": 76, "terrible": 2, "excellent": 69}, "aka": "525 Hotel Los Alcazares", "slim_ranking": 0.333333333333}