{"user_rating": 5.0, "review_count": 176, "name": "627 on King Bed and Breakfast", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "We visited this bed and breakfast for the first time last year and now I don't want to stay anywhere else! It truly is a great experience and Maurice and Ann are such great hosts. I highly recommend it for anybody looking for a relaxing stay, a great breakfast and it's all within walking distance of downtown. Cheers!!", "title": "Another beautiful stay!", "user": "Jurnee7", "date": "October 15, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119334393}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "We stayed at 627 on King for one night during the Thanksgiving weekend. When I first booked we had a mix-up with the date but Maurice kindly offered to honour the booking and gave us the night we had wanted. He was so accommodating.", "title": "The mini-vacation we needed", "user": "keffie68", "date": "October 11, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 119187567}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "The B&B isn't right on the main drag, it's a quick 5 min drive to the shops & theatres, but I think it offered great value and was a better price than the B&Bs that are closer to the centre of town. Our room featured a king sized bed, kitchenette stocked with lots of complimentary snacks & beverages, a jacuzzi for two and a gas fireplace. Breakfast is served in your room at a time of your choosing before check out. We're not really morning people so that appealed to us. And breakfast was fantastic - homemade porridge, delicious french toast, perfect eggs Benedict, fresh baked croissants...we could not have asked for better. Maurice is a talented chef.", "title": "Thank You", "user": "Terry D", "date": "September 18, 2011", "detail_rating": {"value": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 118280033}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "Overall it was a great experience and we would definitely consider staying at 627 King again.", "title": "We'll be back....and sending friends and family, too!", "user": "Ashley E", "date": "September 15, 2011", "detail_rating": {"value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 118148215}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "Maurice,", "title": "One of the nicest B&B's we've ever stayed at", "user": "SueMentor", "date": "September 6, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117752735}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "We stayed at 627 on King for 3 nights in May 2012 and loved it. Here's why:", "title": "The Perfect Bed & Breakfast!", "helpfulness": 1, "user": "pixiesnake", "date": "June 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 132104039}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with friends", "text": "Location: The location was ideal for us. We need quiet for sleeping and this B&B is just far enough outside of town to be very quiet yet it was close enough that we were able to leave the car and walk into town for dinner, etc.", "title": "The best B & B I have ever stayed in!", "helpfulness": 1, "user": "Bev D", "date": "June 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 131971445}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "Room: We stayed in Suite 3 - Writers & Co. The room was very clean. Although small it is very well arranged. Nice electric fireplace that can be used for heat or just for atmosphere. Ceiling fan with remote control. TV for catching up on the news & weather as we got ready in the morning. Fresh flowers and chocolates on the table. All these little things made for a cozy room with everything we needed. We also liked that there is a separate entrance to the rooms.", "title": "Excellent service and accomodations", "helpfulness": 1, "user": "Beachlover499109", "date": "June 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 131937987}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with friends", "text": "Breakfast: In a word . . . perfection! The fact that you got to choose your own breakfast and what time you wanted it served was one of the things that attracted us to this B&B. It was very convenient to be able decide if we wanted an early breakfast so we could get out and do some sightseeing or if we wanted a more relaxed morning with a later breakfast. We liked the little kitchenette in the room. We could have our coffee/tea as soon as we got up and not have to wait until we were dressed for our caffeine fix. There was also juice, water, fruit, milk, cereal, and snacks available for whenever you might need a little something. Maurice's breakfasts are amazing. Best eggs benedict I've ever had! Best porridge (oatmeal) too. Everything was delicious, well prepared and well presented. Although we enjoy meeting new people over breakfast when we stay at B&Bs it was wonderful to just have a beautiful breakfast in the privacy of our room with just the two of us. Especially nice option when you want a romantic getaway.", "title": "My Stay In Niagara On The Lake, Canada", "helpfulness": 1, "user": "MicheleT166", "date": "June 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 131914327}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "The host: Maurice is wonderful. Always available when you needed him. Gave us great advice & tips for whatever we wanted to do that day. Made dinner reservations for us when needed it. He really spoiled us keeping the room spotless & well stocked. We would usually come back to the room to freshen up before dinner. When we came back from dinner Maurice had been in and straightened up the room (again) and we would find either the fireplace going or some romantic music on the radio. It's all the small touches that really put this B&B over the top.", "title": "Treated like Royalty", "helpfulness": 1, "user": "Mojitogringo", "date": "May 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 129977638}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "This was our 7th stay at 627 King Street, and our 4th with Maurice qand Ann. Unfortunately Ann as back home in Great Brittain tending to business there. Why do we keep coming back? Stay one time and you will answer your own question. Lovely setting., close to town, comfortable ckean rooms and Maurice and Ann. Like staying with old friends and we DO consider them friends. This year we were there for our 35th anniversary and Maurice suprised us with a bottle of champagne! You are NOT going to get that at the Holiday Inn. Maurices breakfasts are to die for, and to be able to eat in your room in your PJ's is great. We booked next years dates when we left today.", "title": "Back again!", "user": "Kinosh", "date": "August 29, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117427913}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "Maurice and Ann, we love you!!!!!!!!!!!!!!", "title": "Will Definitely be back!!", "user": "travelh027", "date": "August 29, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117398806}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "Steve and Marilyn Kinosh", "title": "The best B&B experience we've ever had.", "user": "Jeremy J", "date": "August 23, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117153647}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "Lorain Ohio", "title": "Five Star", "user": "Michael P", "date": "August 23, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117130997}, {"rating": 3.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "My parents stayed here in july for thier anniversary and absolutley loved it. Since they had a great experience my boyfriend and i decided to stay here during a wedding we had to attend.", "title": "Not what we expected", "user": "MMMichigan", "date": "August 21, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 2.0, "value": 2.0, "service": 3.0}, "id": 117045004}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "My wife and I visited Niagra on the Lake for the first time and found the bed and breakfast you always hope to find. Maurice was an impeccable host (Sadly we did not meet Ann as she was away). He provided us with delicious breakfasts, a comfortable and spotless room and detailed information on everything in the local area.", "title": "What you hope to find", "user": "TonynSue", "date": "May 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 129873023}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "My girlfriend and I stayed there last weekend (December 2-3, 2011). Its couldn't have been better. Maurice was an excellent host and serves up a delicious breakfast. From the oatmeal to the omelets to the fresh fruit, Maurice caters to the finest detail. The room was sparkling clean and the bedding and towels were nice and fresh. It is in a nice location ( a good walk to the main strip, but not too far). We would definitely stay there again.", "title": "Great Stay!", "helpfulness": 1, "user": "g s", "date": "December 5, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121434314}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "My husband and I stayed at 627 on King this past spring, and we thoroughly enjoyed every moment. The rooms were lovely and clean, the hospitality superb. During our trip to the Niagara on the Lake region we ate at some very nice restaurants but my husband remembers the breakfast that Maurice prepared as the best food on our trip. Thank you so much Maurice and Anne!", "title": "Perfect", "helpfulness": 1, "user": "ShannonandLen", "date": "November 14, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120569937}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "We got into Niagara on the Lake after a long Friday at week a little later than expected (around 730-8pm). It was our first romantic weekend as a couple and first time at a bed and breakfast. Despite all of this we had such a beautiful weekend. Maurice was so hospitable and personable, showed us our room and gave us a real run down of what was going on in town. The room was great, clean, cozy, private, and felt very comfortable. We had a great night out on the town but have to say my favorite part of the weekend was the breakfast. I had the traditional english breakfast which was unbelievable. Top of the line ingredients and was not only ornately presented but was delicious as well. We left the next day around 11 and got to meet Ann as well who was also a really good person. They were so happy we had a great time. Overall it was really fun and a great first experience at a bed and breakfast. I anticipate coming back sometime very soon!", "title": "Short stay, great time", "user": "bcorsaro22", "date": "October 18, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119455685}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "We decided to stay at 627 on King for our 25th Wedding Anniversary. We took advantage of Maurice's help to make advance reservations for various dining and wine touring offered on his site. All of our arrangements were seamless, and most enjoyable! We stayed in the \"Auberge\" suite, and found it to be comfortable, quiet all with a lovely double jucuzzi.", "title": "Perfect Anniversary Stay!", "user": "Flowergirl48", "date": "October 15, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119336787}], "location": {"country": "Canada"}, "variance": {"poor": 0, "average": 1, "very good": 13, "terrible": 0, "excellent": 162}, "slim_ranking": 0.110465116279, "description": "Romantic Getaway in Niagara on the Lake. Comfortable King beds, jacuzzis, fabulous 'en suite' full a la Carte breakfast choice, fireplaces in all rooms and more.. Private, romantic and comfortable air conditioned rooms each having a full bath ensuite, tea & coffee making facilities, cable TV, wireless internet, iPod docks, radio, CD/DVD players with movie selection, fireplace, romantic lighting and more... Separate private guest entrance. King beds and jacuzzi tubs in 2 of our 3 spacious ground floor rooms. Convenience and comfort with an in-room kitchenette stocked with fruit, yogurt, bottled water, cereals, fruit juices and milk."}