{"user_rating": 4.5, "review_count": 171, "name": "88 Xintiandi, Shanghai", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled on business", "text": "fantastic hotel - rooms are awesome - ask for lake facing room though as back side gets noisy from niteclubs.", "title": "great hotel", "helpfulness": 1, "user": "DLmelb", "date": "August 17, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 19033882}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled with friends", "text": "breakie is basic", "title": "Great modern boutique hotel", "helpfulness": 1, "user": "Dion S", "date": "June 26, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 17250390}, {"rating": 3.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "perfect location though", "title": "It was just OK", "helpfulness": 2, "user": "familytravelors", "date": "June 23, 2008", "detail_rating": {"front_desk": 3.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 2.0, "location": 5.0, "rooms": 5.0}, "id": 17142931, "likes": {"liked": "— free internet"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled with friends", "text": "always stay there when i'm in town", "title": "Exceeds all expectations", "helpfulness": 1, "user": "Jen-Singapore", "date": "May 17, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 16126278, "likes": {"liked": "— Everything", "disliked": "— Just the coffee"}}, {"rating": 4.0, "title": "Good value, good location, good surroundings", "text": "This is a really nice place to stay in Shanghai.", "user": "beijau", "date": "May 15, 2008", "id": 16058695}, {"rating": 5.0, "title": "Simply suberb", "text": "Based on previous reviews in Trip Advisor, my friend and I stayed in a suite with a terrace overlooking the lake. We agreed that we could probably live here. Everything about his hotel was near perfect. The room was exquisitely turned out without being overdone; the staff and service was quite, understated, and professional; the library/dining room/bar served a remarkable Chinese/western buffet breakfast, and at other times the room, with its adjoining terrace, was a calm haven from the Shanghai bustle. The location is within walking distance to many historic and contemporary sites, and is adjacent to wonderful shopping and al fresco dining sites, which can be rare in China. It is expensive, but we felt we got good value for the money spent. Internet note: the laminated advisory sheet left on the desk in our room advised us that the local authorities would be monitoring our internet use.", "user": "mkatzmann", "date": "July 27, 2011", "id": 115870462}, {"rating": 5.0, "title": "Truly a \"Heaven on Earth\" hotel experience", "text": "I spent two nights (Dec 28- 29, 2010) at Xintiandi Shangahi and it was truly a memorable experience. Our first impression of the room was \"WOW\", and surprises pile on one after another (warm hospitality at front desk, amazing deco, lovely touch with a fruit basket, convenient kitchennete, stunning view of downtown Xintiandi, etc.) Ms Jocelyn Yu (Manager) and her staff were pleasant, warm and very receptive to guests' needs.", "user": "A TripAdvisor user", "date": "January 8, 2011", "id": 92232859}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "We will not hesitate to visit Shanghai again, and 888 Boutique Xintiandi Shanghai will certainly be our first choice of a hotel there! Service is superb and convenience is indisputable. A big Kudos to Jocelyn and her staff.", "title": "FABULOUS Hotel, AMAZING Rooms and GREAT Location!", "helpfulness": 1, "user": "Shell4Andy", "date": "December 28, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 90888905}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "This place was a real gem of a surprise.", "title": "An outstanding place to hang out in Shanghai", "user": "marekw", "date": "December 27, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 90842115}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "I would definitely recommend it to anyone looking to stay in Shanghai. It was immaculate and the attention to detail was superb. The rooms we're just beautiful and reminded be of some of the smaller suites one would find in las Vegas. They were expertly decorated, had wonderful fixtures and fittings, linens and if we were heading back to Shanghai anytime soon I would stay here in a heartbeat.", "title": "A wonderful location for our introduction to China", "user": "PennyH2009", "date": "December 20, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 90318023}, {"rating": 5.0, "stay_parameters": "Stayed January 2009, traveled with family", "text": "I stayed at Xintiandi last December to watch the new years celebration. This hotel is pretty fantastic, the rooms are spacious and well maintained. The rooms with the view of the lake were a great place to watch the fireworks from. The hotel was impeccably clean with contemprorary furnishings and the hotel staff is extremely helpful. The location is also ideal, since it is right next to a main shopping area. While the hotel was a little more expensive, it was worth it for the view. This hotel also has executive residences for the frequent business traveller. I can’t imagine a much better place to stay if I were travelling for work.", "title": "Fantastic Hotel but comes with a premium", "user": "Kevin C", "date": "October 12, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 46664589}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled on business", "text": "We spent five days in Shanghai and went all over the city. We felt very lucky to come back to the 88Xintiandi at the end of each day. This is the best area and neighborhood. Very convenient to everything. We walked to the Yuyuan Gardens, the Peoples Park and the French Concession. The two blocks around the hotel are filled with great cafes and restaurants, including a wonderful bakery. Unlike large, busy hotels this hotel is a quiet, peaceful place. Our room had a large living area with a separate kitchen and bed area. The best part of the room were the large windows and glass door that opened out to a balcony overlooking a beautiful park and lake with the city skyline in the distance. What a great view! It was so interesting watching all of the park activities with people coming and going. The room was very clean and comfortable with free internet, a music system, leg&foot massager, a bowl of fruit (that is filled each day), comfortable bed with all the different pillows you want, and free water bottles. Also included is a great breakfast buffet with Chinese dishes and Dim sum that was delicious. They also had typical American breakfast foods (cereal, fruit, eggs cooked anyway you want) and European foods (meat & cheese and other salads, with the best homemade bread and jam.)", "title": "Best area in Shanghai", "helpfulness": 1, "user": "N0rCalfamily", "date": "October 11, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 46586859}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled on business", "text": "We did use the pool and fitness center and were the only ones there. The workers were very nice and helpful and most spoke English. They had no problem getting us a taxi whenever we needed one. We would definitely stay at the 88Xintiandi again. If you want a great experience in Shanghai you should stay here!", "title": "great location, great service", "user": "TokyoGlobetrotter", "date": "September 9, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 40286171}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled on business", "text": "Have stayed at 88 Xintiandi three times in past year and overall had a good experience.", "title": "Upscale Alternative", "helpfulness": 1, "user": "SwedeClark", "date": "August 19, 2009", "detail_rating": {"cleanliness": 5.0, "value": 2.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 38193007}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "The rooms are great with cool design and furnishings. For a boutique hotel, it is a very good place for business travelers as the desk accessories and fax / phone communication system are first rate.", "title": "An Oasis of Calm and Elegance in bustling Shanghai", "user": "JubiladoSingapore", "date": "October 19, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 21013002, "likes": {"liked": "— Spacious elegant room and attentive service", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2005", "text": "88 Xintiandi is an absolute gem! Rooms are enormous, staff is wonderful & service couldn't be better. On previous visit to Shanghai we had stayed at (and enjoyed) the Portman Ritz Carlton -- but 88 Xintiandi is our new Shanghai home! Location is excellent. You can walk out the door and be moments from good shopping, great restaurants and a fabulous massage at the Green Door Spa (for a whopping $12!). We had the 2 bedroom suite which was fabulous. 2 big bedrooms. One with attached bath. A 2nd full bath was located near living room. Big living room area with dining & kitchenette. Small balcony overlooking the park.", "title": "An absolute Gem", "helpfulness": 6, "user": "TEEVEE", "date": "October 19, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4036120}, {"rating": 4.0, "title": "Nice Boutique", "text": "We were not bothered by any street noise, but had requested rooms on higher floors with park view. A fellow traveler had one of the deluxe rooms/park view. It too was huge with living/dining/kitchenette.", "helpfulness": 8, "user": "Judge11", "date": "June 5, 2005", "id": 3530816}, {"rating": 4.0, "stay_parameters": "Stayed March 2005, traveled on business", "text": "Service was excellent for everything from meeting us at airport, bringing a laptop to the room & hooking us up to internet to recommending spas/restaurants/shops & good car/driver for hire to take us around. Ask for Iverson - he's a delight!", "title": "Pricey but location location location....", "helpfulness": 14, "user": "Hawaii_Girl", "date": "March 13, 2005", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "rooms": 4.0, "service": 4.0}, "id": 3269853}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled solo", "text": "More problems occured after the first night when my room had no hot water. We had to use another room to take a shower. Then, when we returned to the hotel in the same afternoon, my brother's room had no water at all! So, they had to move him to another room. When I went to the front desk to complain, they assured me that the replacement room was larger. It wasn't. My brother then had to move to yet another room.", "title": "Awesome location", "helpfulness": 1, "user": "kaz_from_oz", "date": "December 11, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 2.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 11489649, "likes": {"liked": "— Great location", "disliked": "— Inability to provide basics like milk for coffee"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "The staff was very apologetic, but water problems in 2 separate rooms were simply not acceptable for how expensive the rooms were. I'm starting to think I should stick to American chain hotels instead of these independent boutique places.", "title": "Boutique alternative to 5* Tourist Traps - Loved it.", "helpfulness": 2, "user": "GAAN", "date": "October 3, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 10034224, "likes": {"liked": "— Could live here comfortably. Luxury without the 1000 impersonal hotel rooms.", "disliked": "— Bed too small. No inhouse dining but restaurants are 1 minute away and open till 1am."}}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled on business", "text": "This is excellent hotel. Number one: it is in the best section of Shanghai, in tourist section on walking mall with blend of Chinese and western style restaurants, pubs, and clubs. Famous shopping nearby, 4 blocks off, and Nanjing Road can be walked to in about 16 minutes. Hotel is modern and elegantly styled, detailed woodwork, detailed trickets in room, mini kitchenette, high speed internet, impeccably clean, bathroom very nice. It is a small boutique style hotel, not a monster chain hotel. The only draw back is noise through windows at night as this is tourist walking area, personally I slept very good, but I can see if you were trying to go to sleep at 9:00 pm there may be background noise [you could always put on cd, they provide many cd's in room]. I have now staye twice, and am booking again for October trip. Very nice breakfast buffet included. Highly reccomend, especially due to location, I have stayed at very nice hotels in Pudong area, but isolated, you need to take 20 minute taxi into City, here you just walk out your door.", "title": "First Class, Excellent Location", "helpfulness": 4, "user": "gtpatton", "date": "October 3, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5902065, "likes": {"liked": "— Cleanliness and location"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2006", "text": "Decided to stay at 88 Xintiandi after months of research and deliberation. Our first visit to Shanghai, part business part pleasure, and wanted a hotel that was well located but with character, atmosphere and a sense that you were in shaghai; afterall, who wants to stay in a nameless \"cookie cutter'\" designed chain hotel that feels like it could anywhere? This place absolutely lived up to expectations and have no hesitation in recommending it to anyone looking for personal service, and a sense of intimacy. The staff were incredibly professional and went out of their way to assist with our needs.", "title": "Very highly recommeded", "helpfulness": 8, "user": "Neophytos", "date": "September 30, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 5894296, "likes": {"liked": "— Ambience, location, service", "disliked": "— Take a room facing the park"}}, {"rating": 3.0, "stay_parameters": "Stayed February 2006, traveled on business", "text": "Our two rooms overlooking the park were fantastic: huge size, with kitchen, dining and lounge areas, decorated with a combination of chinese antiques, carved screens and '60s modernist funriture that gave you a sense that you could only be in china; we loved the antithesis to the glitz, formality and pretentiousness of the usual business hotel suspects eg Shangrila, Four Seasons, Westin etc. Whist the rooms at the back foverlooking the lively redeveloped Xintiandi precint may be noisy, ours were completely quite.", "title": "Trendy but Noisy", "helpfulness": 7, "user": "Patricia W", "date": "March 15, 2006", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "service": 2.0}, "id": 4619750}, {"rating": 5.0, "title": "Watch out Ian Shraeger!", "text": "You can't do better in terms of a central location. Xintiandi may be newly developed, but the character has been beutifully retiained, providing countless top-notch restuarants, bars and shops; Shanghai can be intimidating for fisrt time visitors and the area provides a welcome respite. Since everything in Shanghai is so spread out, walking around is not usually an option. Taxis being so cheap and pletiful I feel it is more important to choose a locating with an interseting immediate environment, rather than its relative position in the city: I would never stay, say, Pudong (sterile), The Bund (stunning buildings but traffic like highway) or Renmin Square (massive and bleak). If elegant, chic and authentic sophistication is what you are after, another gorgeous option is the Ruijin guesthouse, set in quiet lush gardens within the French Concession.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "January 29, 2006", "id": 4395545}, {"rating": 5.0, "stay_parameters": "Stayed December 2005", "text": "Agree with the other reviewers that the hotel is fun & trendy and you can't beat the location, BUT after three stays there I'm not going back because I can't take any more nights of noise until 1 AM. The hotel is right above the bar district of Xintiandi and no matter how hard you try to shut the street noises out, you can't. The music plays until 1 AM, revelers are sometimes still on the street even later. If you're out yourself, hey, no sweat! But if you're in town for meetings or work, you need your sleep and this isn't the hotel to stay in.", "title": "Impeccable", "helpfulness": 7, "user": "agumonster", "date": "January 4, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 4323811}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled solo", "text": "I just spent the weekend (or one night) at 88 Xintiandi and I am happy to report I have found my new home in Shanghai. The strange thing is that I decided to stay here almost by accident. I am in China for the entire month of December staying at a town that is a two hour drive from Shanghai. When I flew in last weekend I stayed at the Four Seasons thinking that after a 16-hour trip I’d want only “the best.” For my second stay in Shanghai I wanted to save a little bit of money and was originally going to book a night at the Okura Garden Hotel b/c I had heard that the French Concession is the happening place to stay in Shanghai. At 1430 RMB a night – a rate I found on the LHW site -- the Okura was considerably cheaper than the Four Seasons. However, the reviews on Tripadviser for the Okura mentioned that the rooms were not exactly of the highest standard and a quick look at the Okura website confirmed my suspicions. In the photos, the rooms looked pretty basic.", "title": "my new home in shanghai", "helpfulness": 11, "user": "cmm.", "date": "December 10, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6357896, "likes": {"liked": "— location and room size"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2006, traveled with friends", "text": "I decided to take a look at the CN Traveller site to look for other recommendations. First on the list was 88 Xintiandi. I clicked over to the website and found a quoted rate of USD 283, which is roughly what the B&B rate at the four seasons comes out to. Still, I thought I’d check their online reservations system for availability.", "title": "convenient location", "user": "anilegna", "date": "December 5, 2006", "detail_rating": {"front_desk": 3.0, "service": 3.0, "business": 4.0, "cleanliness": 4.0, "rooms": 4.0, "location": 5.0}, "id": 6333926, "likes": {"liked": "— the location", "disliked": "— room felt small"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2006, traveled on business", "text": "To my surprise, I found a weekend rate of USD 210++ which, while not as cheap as the Okura, was definitely a savings from the four seasons. I figured I’d give it a go.", "title": "My two cents...", "helpfulness": 3, "user": "ahghiz", "date": "November 19, 2006", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6153908, "likes": {"liked": "— Location and terrific service.", "disliked": "— Internet connection is slow--but that's Shanghai."}}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled on business", "text": "Stayed here recently on a business trip and this hotel definetely tops as one of the best boutique properties. I always find boutique properties as either hit or miss kind of place and this one stood up to its expectations. The reception is fairly small and was not impressive, but once you walk inside the rooms, the whole feel of the place changes in a pleasant manner.", "title": "Boutique Hotel!!", "user": "global_traveller112", "date": "August 25, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 76767036}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "The rooms are very spacious for a city hotel, nice lounge sofa's and a big work table. For frequent business travellers to Shanghai who is tired of the small city room, this could be a ideal fit. Bedroom is tucked away from the living room and the room is decorated quiet fashionably with chinese paintings and contemprorary furnishings.", "title": "Beautiful Hotel", "user": "Margaret5510", "date": "August 16, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 75435726}, {"rating": 4.0, "stay_parameters": "Stayed May 2010, traveled on business", "text": "The only one small defect I found in the room will be the small bathroom, compared to the size of the room bathroom is relatively small without a seperate shower. Apart from that rooms was very nice.", "title": "Beautiful Boutique Hotel Close to Nightlife", "user": "HKPlum_Bum", "date": "May 11, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 63806750}, {"rating": 4.0, "stay_parameters": "Stayed November 2009, traveled on business", "text": "Overall service was quiet good, tried room service a few times which was quick.", "title": "Nice hotel in one of the best place in shanghai", "user": "AntLomb", "date": "December 12, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 51109108}, {"rating": 5.0, "title": "LOVELOVELOVE THIS HOTEL!!!", "text": "Location of the hotel is ideal, close to the night life area with so many bars and restaurants in close by proximity.", "user": "Kyminasia", "date": "November 24, 2009", "id": 50004485}], "location": {"country": "China", "continent": "Asia"}, "stars": 5, "variance": {"poor": 0, "average": 7, "very good": 41, "terrible": 0, "excellent": 123}, "aka": "88 Xintiandi Executive Residence Hotel Shanghai", "slim_ranking": 0.00142612664005, "description": "Perfectly positioned in the heart of Shanghai's lively Xintiandi community, 88 Xintiandi is at the centre of style. Surrounded by exclusive boutiques, chic restaurants and historic buildings, guests can indulge in a host of dining, entertainment and shopping options.Stay in one of the property's 53 spacious rooms and suites and enjoy understated luxury and engaging pleasures, including the full-service Club Lounge including daily breakfast, afternoon tea and evening cocktail, and state-of-the-art gym. 88 Xintiandi guests can also access the spa and indoor pool within the adjacent The Langham Xintiandi.With its subtle style and alluring ambience, 88 Xintiandi boasts the intimacy and comfort of a private residence and the efficient, personal service you expect from a premium property."}