{"user_rating": 5.0, "review_count": 221, "name": "A Butler's Manor", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "Chris and Kim, the owners of this charming home are 100% committed to your comfort. Chris is even a real butler, so he knows how to really run a professional home.", "title": "Delightful Sea Side B&B", "user": "j4metoo", "date": "May 28, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 16474754, "likes": {"liked": "— Location, landscaping and the great sheets! The hosts are lovely too.", "disliked": "— The random dolls and all the over the top flowery decor."}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "At this retreat, fabulous Egyptian cotton sheets and cosy beds are waiting for you. Large rooms. Fresh flowers, home made cookies and two glasses of sherry—greet you. It's very welcoming. And of course, the rooms come with the usual B&B touches: lots of flowered prints, patterns and dolls.", "title": "Great Little B&B", "user": "tdlevy", "date": "May 28, 2008", "detail_rating": {"business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 16469867}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "The grounds and the pool are AMAZING! It's truly england on the East Coast. Come later in the summer and you'll actually be able to swim. IT was a little too cold in May.", "title": "Could NOT have been nicer", "user": "anonymous064", "date": "May 20, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 16258435, "likes": {"liked": "— Chris and Kim's thoughtfulness and attention to detail", "disliked": "— Having to leave!"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "Breakfast isn't over the top, and if you don't like something...go ahead and be specific. They want to make you happy. I didn't think we'd be eating zuccini and mushrooms for breakfast so didn't mention I'm not big on those veggies, well guess what was in the baked cheese eggs ? My bad. Thank god for the delicious coffee bread and fruit salad.", "title": "Great relaxing retreat", "helpfulness": 1, "user": "Moose99", "date": "May 19, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 16211313, "likes": {"liked": "— The hospitality and warmth of the place"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "We arrived late, but Chris and Kim were very accomodating. And there was port and cookies waiting for us in our room. Kim makes excellent breakfasts (fresh fruit, fresh squeezed juice, muffins and stuffed french toast or quiche) and on nice days you can sit outside and enjoy them too. It was too cold for us to swim, but the pool looked nice and we enjoyed walking around the garden.", "title": "The Best B&B in the Hamptons!", "user": "mrs_globetrotter", "date": "May 7, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 15766537, "likes": {"liked": "— The Innkeepers", "disliked": "— Having to leave"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "While the house, grounds and location of this B&B are truly beautiful and convenient, it is the service that make this place beyond compare. Owner's Chris and Kim will make you feel like Royal Family Members. Chris's background as a Professional English Butler for 20 years bestowed on him the knowledge to cater to their guests in true English Fashion. And like most Englishmen, his pride in his garden is dramatically evident. The pool and outside dining areas are surrounded by blooming rose gardens and many other varieties of blooming flowers, trees, and singing birds. The home is equally as beautiful, clean enough to eat off the floors, and within walking distance to South Hampton. This couple has thought of every single thing a traveler could desire. One example of their level of service: Offering to drive us to the local beach (using their beach chairs and towels) and pick us up at our desired time, so we wouldn't have to pay the $20 parking fee. I've stayed at too many 5 Star hotels and B&Bs to list, Ritz Carltons, Four Seasons, etc. This B&B is over the top and is my new barometer to judge all others.", "title": "6 Star Service", "user": "petealan", "date": "June 29, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 17343488, "likes": {"liked": "— Service, location, amenities, room, food"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "Chris and Kim offer a level of service that exceeds that of even some of the best hotels. The rooms are comfortable, tradtionally furnished, and kept to a very high standard. There is a spacious shared lounge and beautiful garden with a pool. Breakfast is creative and delicious and cooked with fresh ingredients (some from the garden) each day. We were a little doubtful about eating at a shared table each morning (not being morning people) but Butler's Manor has such a relaxed and friendly atmosphere that we found we enjoyed it. Everything we could possibly want or need, Chris and Kim had thought of, and they were willing to really put themselves out to make our stay there (our honeymoon) truly special. Nothing ever felt like it was too much trouble.", "title": "Outstanding service", "helpfulness": 1, "user": "MrsH8", "date": "June 23, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 17145907, "likes": {"liked": "— The level of service", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "This was my first time staying at a Bed and Breakfast and I could honestly say that it was fabulous! From the moment, we arrived in the driveway, Kim and Chris's warm welcome was delightful and were eager to make our stay memorable. It felt like we were home! They were so chill and the grounds were beautiful! The room was impeccably clean and cozy.... and yes...we had home made cookies for us when we arrived! They even made us a little beach basket for us to use!! Breakfast in the morning was delicious and as we sat outside, I thought to myself, this could not be more perfect! It was sad to leave but I know where I am staying the next time we're in the hamptons!!", "title": "A delightful experience!", "user": "molinal37", "date": "June 22, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 17122017, "likes": {"liked": "— Clean and Cozy", "disliked": "— nothing!!"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled with friends", "text": "We spent two nights at The Butler Manor and can't wait to return. Chris anf Kim are top notch at running their B and B. I have never experienced such attention to detail. Sitting in their beautiful gardens enjoying the fabulous breakfasts was a highlight of our trip. The pool was great as well. Our room was lovely and every amenity you could wish for was supplied. A truly unique experience!", "title": "absolute best B and B", "helpfulness": 1, "user": "RIGrandmama", "date": "June 20, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 17089193, "likes": {"liked": "— Everything!", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled on business", "text": "We stayed for just two nights (Saturday and Sunday) and next time we'll definitely stay longer!", "title": "Loved the hosts!", "user": "UCLaw98", "date": "June 19, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 17058129, "likes": {"liked": "— The hosts were fantastic"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "Kim and Chris provide a level of service that rivals any five star hotel. In fact, I'm sure the competition is very glad that Kim and Chris only run one B&B! From the food, to the hospitality, and the attention to detail nothing is over-looked here. This B&B is all about catering to their guests and maximizing their experience.", "title": "World Class! Your home in Southampton.", "helpfulness": 1, "user": "novatravelreview", "date": "March 29, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 27068669}, {"rating": 5.0, "stay_parameters": "Stayed January 2009, traveled as a couple", "text": "After arriving from a long exhausting drive Chris could sense we needed a drink and was quick to offer us a complementary glass of wine. I don't remember the last time any one still offered this, but from that moment my wife and I knew we were in for a real treat. The following morning Chris and Kim had prepared a complimentary pre-planned itinerary with a map and everything we could possibly need to explore the area! We took their advice and it was spot-on. What a great time saver! It's unfortunate we only had two nights to enjoy the Butler's Manor, and I'm certain the property is even more stunning in the summer time.", "title": "Truly Wonderful", "user": "posmanti", "date": "January 8, 2009", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 23389908, "likes": {"liked": "— the loving attention from the owners", "disliked": "— thin walls"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "Chris brings his wealth of knowledge from his career in the service industry and Kim only complements it with a warm smile and nurturing heart.", "title": "The best that the Hamptons has to offer!", "user": "Capybara22", "date": "October 2, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 20566759, "likes": {"liked": "— It felt like a real home; very warm, and welcoming.", "disliked": "— I don't care for shared seating at meal time, because I feel uncomfortable making small-talk with strangers."}}, {"rating": 5.0, "title": "Bed and Breakfast at its best.", "text": "If we ever return to the Hamptons, this one's a no-brainer. One of the best B&B experiences we've ever had.", "user": "nurse1980", "date": "August 17, 2008", "id": 19051464}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "We knew we were in for a good stay when Chris came jogging outside to meet our arrival at A Butler's Manor on a blustery January afternoon. He graciously welcomed us and asked to carry our bags inside. Once inside, a wonderfully energetic Kim immediately met us at the door and whisked us away on a tour of the house while Chris carried our bags up to our room. The smell of a delicious stew (not for us) filled the air, and the fireplace was ablaze with a recently lit fire.", "title": "What a LOVELY place!!", "user": "flyingdutchie", "date": "August 10, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 18796186, "likes": {"liked": "— Everything!", "disliked": "— Nothing!"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "This sweet treasure is like nothing I've ever seen. The kindness and thought that Chris and Kim put into every detail of the accomadations and their service is truly remarkable. When you speak to one of them on the phone, it's as if you have known them for years. They have a unique way of making you feel special, yet not uncomfortable. If you are new to traveling to the Hamptons like my husband and I were, then this is the place to go because they will sit down with you and help you figure out the best sights to suit your time constraints. We would definitely go back if we were to return to Long Island.", "title": "Perfect!", "user": "HappyCaliforniaDinks", "date": "August 8, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 18742846, "likes": {"liked": "— Chris and Kim", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "We recently stayed for 3 nights at A Butler's Manor, a bed and breakfast located in Southampton, N.Y. What a beautiful place to stay! The owners, Chris and Kim, made us feel welcome from the moment we pulled into the driveway. Chris was at our car immediately and insisted on carrying our bags to our room. Kim met us right at the front door and gave us a personal tour of their gorgeous home, filled with comfortable furnishings, books, and cozy nooks to relax in. We were blown away once we went outside into the beautiful, lush backyard, overflowing gardens, and pristine swimming pool. Kim had even made us fresh iced tea that was waiting for us at the pool.", "title": "A Butler's Manor was an amazing place to stay!", "helpfulness": 1, "user": "brettbug", "date": "August 6, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 18674750, "likes": {"liked": "— Service, food, location", "disliked": "— I loved it all, nothing to complain about at all"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "Our room was Goose Creek. It was spacious, comfortable, elegantly furnished, and the bed was like sleeping on a cloud!! Freshly baked cookies were in our room to enjoy with our iced tea. We asked for beach and restaurant recommendations, as well as ideas for fun things to do, and Kim provided us with all that we asked for, including letting us know about a secluded (free!) beach that was absolutely gorgeous and so private and unpopulated. There was even a fully packed beach bag in our room with towels, sunblock, and a book to take with us. We spent much of our time on that beach after enjoying the incredible breakfasts made by Kim, each day better than the last. The muffins and scones she bakes are worth the trip alone. Each morning, a full gourmet breakfast is served at either the dining room table or outside (weather permitting) on the patio, surrounded by those beautiful gardens. The company was also great as well, as we met some wonderful people from another state and truly enjoyed sharing conversations over our delicious breakfast.", "title": "A special get away", "user": "rosemary00", "date": "August 3, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 18576798, "likes": {"liked": "— the pool and garden"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "I would return to A Butler's Manor in a heartbeat. We didn't have to lift a finger the entire time we were there. Chris and Kim were the most incredible hosts and generously provided for our every wish and whim.", "title": "The best tea in the United States", "user": "GrettonHalt", "date": "July 30, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 18437604, "likes": {"liked": "— Friendliness", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "We absolutely loved our stay at the butlers manor. It is a wonderful escape from the city life, the garden is amazing and both Kim and Chrs make you feel special during your stay. We have been staying at A Butlers Manor for the last few summers and even have given gift certificates to our friends and family because it is always a gift that people talk about for months. Can't wait until our next trip!", "title": "Fantastic Experience", "user": "jsriggio", "date": "July 2, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 17424369, "likes": {"liked": "— The cleanliness, comfort and caring attention of the owners.", "disliked": "— It is a little off the beaten track ... but not so far as to make a difference overall."}}], "location": {"country": "United States"}, "variance": {"poor": 1, "average": 0, "very good": 7, "terrible": 0, "excellent": 213}, "aka": "a Butler`s Manor Hotel", "slim_ranking": 0.142857142857, "description": "Welcome to A Butler's Manor, your elegant 1860 Colonial \"home in the Hamptons.\" A Butler's Manor takes its name from Christopher's profession. A proper British butler for over 20 years, Chris ran estates in both Europe and America before \"retiring\" to welcome guests to our luxurious bed and breakfast. The personal service that is the hallmark of his profession, along with Kim's attention to detail, will make your stay at A Butler's Manor an experience in hospitality you won't soon forget. Bring your swim suit as we have a great salt-water swimming pool in our English garden!!"}