{"user_rating": 4.5, "review_count": 190, "name": "ABaC Barcelona", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "The service is unbelievable, the rooms large and confortable. We had a great time.", "title": "Great Hotel with a Great Restaurant", "helpfulness": 4, "user": "BobRiodeJaneiro", "date": "July 16, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115416620}, {"rating": 2.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "Note: It's not far from the touristic areas, but you have to get a transportation to get there.", "title": "Great 5 star hotel with the 3 star service!", "helpfulness": 5, "user": "khalid_11", "date": "June 27, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 3.0, "service": 1.0}, "id": 114810426}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "I was in my anniversary when I spent a night in ABAC. The restaurant was closed (as it was Sunday). So we wanted to go to a romantic restaurant. I asked the concierge to get us a booking in a Michelin star restaurant, they got me in the worst restaurants in Barcelona (thanks to my knowledge of the city's restaurants). so we decided to order room service. The menu was too limited to 10-15 dishes and when i called to order they ran out of food, so I only had 2 choices!", "title": "Beautiful, Luxurious Hotel", "helpfulness": 1, "user": "DiscerningTraveler99", "date": "June 22, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 114650033}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "summary, the rooms are great but the service sucks!", "title": "Luxury 5* deluxe retreat in Barcelona", "helpfulness": 1, "user": "HannahVT", "date": "June 20, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 114581169}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "Our room at the ABaC was spectacular. The design was gorgeous, the bed linens incredible and the shower was fabulous. The room also had a lovely window seat that could be enclosed by curtains and looked out into the garden. The room was incredibly quiet and we looked out on a wall of green (we were concerned when we arrived because the street is quite busy). It was like having our own private apartment in Barcelona. The staff was wonderful and recommended fabulous restaurants and tapas bars. Our only issue was that it is a bit far from the Gothic quarter--we would have liked to be in walking distance.", "title": "Absolutely Wonderful!", "user": "GEMD_1996", "date": "June 16, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 113946357}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "A super modern hotel with luxurious touches such as Bang and Olufsen electronics, Hermes products, and there even is a cartridge coffee maker in the room. Since the hotel premise was locked, we actually had difficulty checking in at 1300. This was due to a malfunction of the doorbell at both entrances. The staff were super apologetic about the incident and from there our stay was good. We stayed in the Superior Room with our own large private balcony. The balcony square footage might have been bigger than the room itself. The bathroom had a separate bath with rain shower. And when I say rain shower I mean a 2 ft x 2 ft gush of water coming down from the ceiling! We did have some difficulty figuring out how to adjust the temperature, but once that was resolved it was heaven.", "title": "Gorgeous Boutique Hotel with Excellent Service", "user": "dnumgis02", "date": "January 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 122710742}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "We ate at the newly upgraded 2 Michelin star restaurant and it was absolutely divine. I have eaten at many Michelin rated restaurants, including the 3 star Per Se in New York and the ABAC restaurant might have been out best dining experience ever. In addition to the whimsical delicious food, the restaurant was able to fully accommodate my girlfriend's dietary restrictions.", "title": "Excellent hotel. Awesome staff.", "helpfulness": 2, "user": "purple_dots", "date": "November 28, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 121176754}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "We only had one minor gripe that ironically has to do with the heavy sound-proofing of the hotel. The heavy and numerous doors that it takes to get to your room really isolate the sound well, however, they slam and make a loud noise after each one is opened. This means that when another guest leaves their room, especially with at an adjacent floor, we hear every door slam on their way out. I don't know how much the hotel can do to fix this but again it's just a minor detail.", "title": "Incredible hotel and a fabulos restaurant !", "helpfulness": 1, "user": "Maria263", "date": "November 8, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120351496}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "All in all we had a wonderful stay and we will definitely be back to the ABAC for both the stay, the warm, friendly, excellent staff, and the food.", "title": "Absolutely outstanding", "helpfulness": 1, "user": "Yarro", "date": "November 8, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120345285}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled with friends", "text": "I stayed at ABACat the end of September for 6 days and although this review is a little late I think it is worth mentioning how wondering the experience of staying there was. I left thinking that, service is excellent, hotel is unique, small but comfortable, luxurious, quiet and location, convenient and peaceful. Truly a modern boutique hotel with an excellent restaurant and awesome and attentive staff.", "title": "Not a five and not memorable", "helpfulness": 3, "user": "coffeebar", "date": "November 3, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 1.0}, "id": 120118712}, {"rating": 5.0, "stay_parameters": "Stayed common_month_year0", "text": "Wonderful small hotel off the beaten track. A Greta refuge from the masses and mobs in central Barcelona. We just returned and loved it. The dinner was magical! The hosts were wonderful. It's refreshing to order ice and have it delivered in minutes. Free wi-fi also. About a 10 minute ride to central Barcelona. I would go back.", "title": "Great, quiet", "user": "Timkate", "date": "October 6, 2011", "detail_rating": {"value": 4.0, "service": 5.0}, "id": 119009901}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "This is a very nice hotel, the kitchen is open so you can walk through it,", "title": "Great place wonderfull view", "user": "IssyE", "date": "September 22, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 3.0}, "id": 118440342}, {"rating": 5.0, "stay_parameters": "Stayed August 2011", "text": "we didn't eat there as the res is closed sun mon", "title": "First class stylish hotel", "helpfulness": 1, "user": "Travel_Lion_10", "date": "September 2, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 4.0, "rooms": 5.0}, "id": 117571017}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with friends", "text": "the location is a 10m drive from major atractions.", "title": "modern,perfect and my tip for barca!", "helpfulness": 1, "user": "unikat77", "date": "August 29, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117402935}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "reception was very helpfull and pointed great places to eat as", "title": "Perfect for us", "helpfulness": 2, "user": "mij", "date": "August 19, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 116962990}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "Having experienced four nights at the ABaC, being looked after by Marien and her team, we would not consider staying anywhere else on our return to Barcelona.", "title": "\"Sublime\"", "user": "19tessa60", "date": "August 18, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116888050}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "The tasting menu exceeded all expectations as did the whole experience of this unique establishment.", "title": "Nice modern hotel, little out of the centre", "user": "lovesholidays2009", "date": "August 12, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 3.0, "service": 4.0}, "id": 116619550}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "Faultless!", "title": "Intimate. Luxurious. 1st Class Michelin starred Restaurant.", "helpfulness": 1, "user": "AJCG", "date": "August 10, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 116512653}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "We stayed in one of the standard rooms, it was gorgeous so id love to see the more expensive rooms. Very modern, had a huge walk in shower and jacuzzi bath in room. We were met with a cocktail and shown around the hotel which is a nice change to being herded in to check in. The spa area was really nice too.", "title": "Magnificient small luxury hotel", "helpfulness": 2, "user": "jimmy61Madrid", "date": "August 2, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116146766}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "The restaurant was expensive (as expected) and all night of a job (lots of little dishes & matching of wines etc), nice for a treat but wouldnt want to do it every night as it took hours. Food was good.", "title": "Lovely, intimate boutique hotel and fantastic restaurant", "helpfulness": 2, "user": "Jubejubebe", "date": "July 29, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115962399}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "We came back to Abac, after three years, and we found everything perfect. Again we stayed at room 812, which enjoys a beatiful terrace. My wife also enjoyed the spa, which is small but really chic. Special greetings to Pilar, the women in charge of breakfast, who makes you feel like at home. And the rest of the staff is simply fantastic. In my view, Abac is the best urban hotel in Spain.", "title": "Best urban hotel in Spain", "helpfulness": 2, "user": "jimmy61Madrid", "date": "July 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 135239068}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "Most enjoyable stay, great room and all the staffs in the hotel are very friendly and accommodating. Highly recommended to try the restaurant in the hotel - it will be one of the best meals you ever had.", "title": "Outstanding service", "helpfulness": 3, "user": "Alexander W", "date": "July 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 135133692}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "Luxury boutique hotel, we got a free room upgrade - bonus! Clean, well appointed rooms. The hotel is not near the main attractions like Ra Lambla, etc. but we loved the area anyway. Used the Metro (across the road from the hotel) to get around which was a pleasure - clean, efficient & cheap. The huge breakfasts were a treat as well.", "title": "Beautiful hotel", "helpfulness": 1, "user": "kevanee", "date": "July 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 133491023}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "My husband and I were looking for a quiet but conveniently located hotel with luxurious amenities to spend our week in Barcelona. ABaC a luxury boutique hotel far exceeded our expectations. The hotel staff were very friendly and looked into all our needs promptly by booking tickets for popular sights, recommending places to visit, dine and chill. Our room overlooked lush greenery which was very soothing to wake up to in the mornings. I just loved the bed and bedding the best. You could just sink into the bed after a long day out and have a very restful and peaceful night. The shower and mood lighting was also amazing and modern.", "title": "A Memorable Luxurious Stay", "helpfulness": 1, "user": "Shalini D", "date": "July 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 133218861}, {"rating": 5.0, "stay_parameters": "Stayed June 2012", "text": "And finally I would like to recommend the ABaC Restaurant. You should go for the degustation menu. We were serenaded with the most exotic flavours throughout the evening, and cava and wines to match. It was indeed a very memorable experience. Thanks to the very professional and friendly staff.", "title": "Outstanding, no words", "user": "Danielte", "date": "June 28, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 132943198}, {"rating": 4.0, "stay_parameters": "Stayed May 2012", "text": "We spent 2 nighs and were upgrated to a room with a terrace. very nice room very quiet inside but no way to spend time in the lovelly terrace...far too noisy because of cars. The hotel is a bit far from the center but in Barcelona you find taxis anytime everywhere. worst thing was the breakfeast. in a hotel with a 2 michelin restaurant you expect more than some terrible Danish pastries and croissants obviously industrial. the service was extremely helpfull very nice decoration and confortanle bed and a top diner at the restaurant.", "title": "A design hotel with lots of good features", "user": "Turenne", "date": "May 26, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 3.0, "service": 4.0, "rooms": 5.0}, "id": 130638348}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled on business", "text": "Wow. I stayed here with some colleagues for 1 night on a business trip, and we were simply amazed.", "title": "A gastronomic delight", "user": "TravellingMouthPiece", "date": "May 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 129774847}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled with friends", "text": "The staff were polite, attentive, and personable, the rooms contemporary, comfortable, and well equipped (bang & olufson tv's, rain shower, jacuzzi tub), and the restaurant simply amazing.", "title": "Fantastic", "helpfulness": 1, "user": "JuwariahBristol", "date": "May 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 129263591}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with friends", "text": "I cannot say enough good things about the restaurant. I am fortunate enough to have eaten in quite a few Michelin starred restaurants over the years, and so have a reasonable sense of what to expect; but the meal here was off the chart, simply the best dining experience I've ever had, anywhere, and that is saying something.", "title": "Great retreat", "helpfulness": 3, "user": "Pickyfellow", "date": "April 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 127506049}, {"rating": 3.0, "stay_parameters": "Stayed April 2012", "text": "If I was to try and be super critical and find faults, then I'd maybe say that the corridors approaching the bedrooms are not to the standard of the rest of the hotel, the bedroom doors lack privacy locks or \"do not disturbe\" signs, and it could do with a gym. But these did not take away from this being a fantastic experience for me.", "title": "Not worth it", "helpfulness": 3, "user": "rolexgozo", "date": "April 5, 2012", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 2.0, "service": 5.0, "rooms": 4.0}, "id": 127326326}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "We went there to celebrate New Year's eve and my son's birthday and that was an unforgettable night. The staff was most helpful and courteous, food and drinks were far beyond anything that one could wish, so were the music and the decorations. The hotel is far from the crowded centre and provides an ultimate intimacy and enough space for feeling at home.", "title": "A great new year's eve to remember", "helpfulness": 2, "user": "Milena P", "date": "June 18, 2012", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 132242992}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "This ultra modern hotel is conveniently located near a metro station (just across the street). Located in a neighborhood, away from the main tourist area which was not a big deal for us since we had a car and with the metro being so close. The neighborhood does not have many restaurants, but there is a nice bakery/cafe across the street that makes excellent cappuccinos, bread, croissants, pastries, and ready made sandwiches. Although the hotel offers breakfast with a nice selection of breakfast items, we preferred the cafe across the street for having coffee, croissants and fresh squeezed OJ every morning. There are also several small markets within a 5 minute walk for picking up fruit, wine, gourmet goodies, etc. I would HIGHLY recommend making a reservation for dinner at the hotel restaurant. It's a bit pricey, but well worth the experience. There is seating available inside or outside on the garden patio. Although the patio garden is a beautiful setting, I would advise sitting inside due to loud traffic noise that somewhat distracted from the whole culinary experience. Also, we did get surprised by a rain shower later in the evening and had to be moved inside to finish our dessert course. Our room was very quiet despite the fact it was facing a busy street. The accommodations are quite modern with tastefully appointed, generously sized rooms and bathrooms. The bed and down filled pillows were very comfortable and dressed in quality bed linens. The hotel is very private and secure with several gated entrances and a gated underground garage. Most importantly the staff was extremely nice and very helpful.", "title": "Quality, luxury and comfort", "helpfulness": 1, "user": "Kristina H", "date": "June 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 132122652}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "Booked 2 rooms, the deluxe and the superior. Superior had a nice size terrace. Upon arrival, we were met by 2 bellmen who took our baggage and escorted us upstairs to check-in. This hotel has only 15 rooms. The staff were personable and worked hard to make sure that we were taken care of. The hotel is housed in the former location of the United States embassy, which is why the location is so secluded. The hotel is not in the center of Barcelona, but Plaça Catalunya and the city center are a 5 minute metro or taxi ride away. Rooms were stylish and neat and the hotel is very contemporary. Breakfast does not have a huge variety, but it does suffice. Everything that comes out of that kitchen is handmade from scratch. Make sure to have dinner at the Restaurant. Having been to Barcelona three times, this hotel has been one the best I've ever had the pleasure of staying in. Their website has many pictures and information that helped us choose it. Amazing Amazing Amazing!", "title": "Amazing in every way possible", "user": "Gib T", "date": "June 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 2.0}, "id": 132091694}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "Let's get two things out of the way. 1. This hotel is not, by any stretch of the imagination, cheap. 2. It is not in the centre of Barcelona. If you can cope with the short tube or taxi journey, and want to support the Spanish economy, it's a great, stylish choice.", "title": "Worth it if you've got the money", "helpfulness": 3, "user": "MirandaMEJ", "date": "May 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 130964759}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "The hotel is in a modern, apparently purpose-built building, in 2 distinct blocks, and also houses a Michelin starred restaurant. This review refers to the hotel only and not the restaurant. We had a warm welcome from the staff (who appeared slightly amazed we didn't need help with our luggae; clearly we were under-baggaged by their well-heeled standards, but really, who needs more than a rucksack for a sunny weekend away?). There was a welcome glass of Cava while they explained a little about the city and gave us a map, making recommendations about where we should go when they heard it was our first time in Barcelona. All of their recommendations that we had time to try, e.g. where to get good paella, were worthwhile. One especially good piece of service was that they recommended booking online for La Sagrada Familia (i.e. the Gaudi church) and even booked online for us and printed out the tickets at no cost. We were able to waltz past the enormous queue and go straight in. It would have beenworth going just for the pleasure of walking past the queue!", "title": "Brilliant little gem", "helpfulness": 1, "user": "galavantersAustralia", "date": "May 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130711911}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled with friends", "text": "I agree with the reviews above about the hotel and accommodation and just want to add that its a really nice place I have found near the hotel - its a night disco called as Atlantic Disco.", "title": "Celebrating BD =))))", "user": "roz a", "date": "March 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 126918399}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "I made surprise for my couple to celebrate her Birthday with our friends))) She was extremely happy and liked the evening there! Everything was amazing! We do love it!", "title": "The perfect relaxing weekend retreat in Barcelona", "user": "NeilChapman", "date": "March 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 126288164}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled solo", "text": "My wife and I had the pleasure of being looked after by the team at ABaC in March 2012. Everything about our stay was absolutely perfect, from the warmest of welcomes, through pampering spa treatments to the exquisite food.", "title": "The best you can do in Europe trousers on!", "helpfulness": 2, "user": "Dr_Aaltonen", "date": "March 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 126286913}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "ABac really is an oasis of calm and relaxation to which we found ourselves retreating several times a day from the hustle and bustle of the city.", "title": "Wonderfully accurate reviews!", "user": "ANF1111", "date": "March 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 126261023}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled solo", "text": "Oh, and Marien ... you are an angel!", "title": "Wonderful setting and very relaxing.", "user": "Eduardo O", "date": "March 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 126055929}], "location": {"country": "Spain", "region": "Catalonia", "continent": "Europe"}, "stars": 5, "variance": {"poor": 2, "average": 6, "very good": 31, "terrible": 2, "excellent": 149}, "aka": "Abac Barcelona Hotel Barcelona", "slim_ranking": 0.021113243762, "description": "5*GL Monument, 15 luxurious rooms, 2** Michelin, Spa, Bang & Olufsen TV, gourmet experience, jacuzzi with chromo therapy, gastronomy, architecture, design, Zen garden, terrace, Lounge Bar, Hermes, meetings, technology, professional. ABaC Restaurant Hotel is a unique gastronomic experience surrounded with gardens, in the heart of the city. The restaurant awarded with 2** Michelin, and nominated by The Best Restaurant 2011 in Catalonia by the Catalan Academy of Gastronomy, can seat up to 56 diners. Offers 15 luxurious rooms, including suites. All rooms enjoy a stylish, contemporary decor, are completely soundproofed, and are fitted with state of the art technical features to ensure maximum comfort. Amenities: Hermes. \"Nespresso\" coffee machine.Completes hotel facilities: Spa completely equipped: Jacuzzi with underwater, sunbeds, Cold pool, Hammam, Two treatment cabins, Tatami, Heated sunbeds. Lounge bar. Kitchen of 200 m2 and the bodega, can be visited by our hotel guests. Other services: Internet wifi free, room service 24h, Parking, Limousine service and luxury car service."}