{"user_rating": 4.5, "review_count": 174, "name": "Aberdunant Hall Holiday Park & Hotel", "reviews": [{"rating": 4.0, "title": "A nice surprise!", "text": "I wasn't sure what to expect at this hotel, as we drove through the holiday park, past loads of mobile homes (all lovely). Hotel was very clean, the staff extremely friendly and breakfast very varied and filling! Rate was extremely inexpensive, as we stayed off-peak (23-24 Apr). Would recommend, if just for the ridiculously large double shower in our twin-bedded room!", "user": "dmac72", "date": "May 13, 2013", "id": 160616926}, {"rating": 5.0, "title": "Aberdunant Experience", "text": "Superb accomodation, staff and food, a wonderful place to stay for a peaceful break and the rooms quality is excellent, especially the four poster room. Ideal location for Snowdonia national park touring.", "user": "VALANALL", "date": "May 8, 2013", "id": 160028936}, {"rating": 5.0, "title": "May bank holiday break", "text": "Just back from a three night stay at the Aberdunant Hall Holiday Park.", "user": "SnommisHoddesdon", "date": "May 7, 2013", "id": 159893948}, {"rating": 5.0, "title": "Lovely site, lovely grounds in lovely part of Wales", "text": "Four of us stayed in a three bedroom caravan situated in the zone named Orchard. The caravans are very clean and spacious with excellent facilities. The kitchen is well kitted out with all you need. There are two separate toilets and one with a good size shower.", "user": "tradtionalltraveller", "date": "May 6, 2013", "id": 159822899}, {"rating": 5.0, "title": "Caravan break", "text": "The park has a few pleasant country walks through the woods and for those a bit more adventurous can follow the national routes up and around the mountains, which offer spectacular views.", "user": "Diane B", "date": "May 5, 2013", "id": 159701551}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "A nice quiet location, with plenty of walks around the area. We went in April 2013 and stayed in a caravan in the walled garden area, the weather was reasonable but quiet cold at night. Had the main living area heater on, but the small heater in the main bedroom didn't keep us that warm. Had two duvets on bed, pity we didn't take a spare blanket, had to double up on socks to keep feet warm! A bit limited on table mats, utensils in kitchen, eg other cooking dishes, pots for microwave etc. At least they had a vacuum cleaner so we could clean up after our week there.", "title": "A week in Aberdunant Country Park", "user": "CMPB7", "date": "April 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 157629595}, {"rating": 5.0, "stay_parameters": "Stayed April 2013", "text": "However, we put a lot into a week, Snowden, Ffestiniog Railway, Corris Mine, Porthmerion and a couple of castles, all but to name a few. Overall, good staff and friendly place.", "title": "Relaxing", "helpfulness": 1, "user": "Marymummy", "date": "April 12, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 157514003}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "Aberdunant is the perfect place to get away from the hustle and bustle of everyday life. It was also one of the few places that we could take our small dogs. They loved going on the long walks through the woods Our son and grandchildren did not want to come home if you want peace and quiet this is the ideal place to go.", "title": "What a beauty!", "user": "JacksonShenton", "date": "April 8, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "location": 5.0, "service": 5.0}, "id": 157111171}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "Just returned from a three night stay with 9 year old and dog in tow, staying in a 'Walled garden' caravan. The park is fantastic, beautiful surroundings and helpful and kind hosts. A perfect base for Snowdon, Beddgelert etc with beaches galore nearby. The woods surrounding the site were ideal for morning and evening dog runs, and with rope swings and fallen trees it made a great play area for us all. We sat outside the hotel to have a relaxing drink and ended up ordering three carvery dinners, the smell was that good. And it didn't disappoint. Delicious. We had a hot water problem which was promptly dealt with, it took less than an hour but we were offered use of the hotel room facilities whilst we waited. We highly recommend Aberdunant holiday park.", "title": "Easter Weekend 2013", "user": "adrian_paul_kent", "date": "March 31, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 156175617}, {"rating": 5.0, "stay_parameters": "Stayed March 2013", "text": "We booked good friday to monday and the first night we ate at the hotel and i am writing this because i ordered the beef stroganoff and i'm not joking it was the best i've ever tasted in my life, seriously, if its on the menu you must try it!!!! The staff are amazing, all of them cannot do enough for you and so pleasant. Breakfast was great, beds comfortable, only observation was the TV on the wall was too small. Room 8. Would definitely recommend this hotel lovely.", "title": "Back again!", "user": "jrjonesGwynedd", "date": "March 18, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 154977369}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "This stay was chosen and booked for us by a family member, We stayed in the room with a four poster bed. Lovely room and the views were fantastic.", "title": "Fantastic place", "user": "bobclops", "date": "January 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 149753803}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "The well appointed bathroom had a very posh bath, and all the trimmings. ( no shower though)", "title": "Fabulous place to stay", "user": "Sam V", "date": "November 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 145086552}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "Staff were very friendly and helpful, good selection of wine and a very nice real ale.", "title": "Lovely hotel in nice surroundings.", "user": "Landonmyfeet2", "date": "September 26, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 141308320}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "The food was exellent.", "title": "Wooded bliss", "user": "Alex L", "date": "September 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 141155700}, {"rating": 3.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "I want to go back.!", "title": "mixed feelings", "helpfulness": 2, "user": "Jon2905", "date": "September 24, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 2.0, "rooms": 2.0, "location": 4.0}, "id": 141128469}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "Just spent one night at the hotel whilst visiting family staying in the holiday park. We had a standard room which was ideal for such a short stay. Everything was very good from our welcome on arrival to the cleanliness and facilities in the room. We had a meal in the restaurant in the evening which was very good. The breakfast was one of the best we have had with a good choice and served piping hot. We will certainly return for a longer stay next time.", "title": "Will be Back", "user": "lloydy46", "date": "May 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 159418901}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "Well, Let me first say that this is a magnificent hidden gem, we had a two night stay in the hotel which was amazing, right from the start we were made to feel welcome from all staff and what a great hotel it is, the room was brilliant with lovely views, very clean, great food at very reasonable prices with fantastic staff who could not do enough for us. Overall we were very impressed with the park as a whole and plenty to do within the local area. We shall return soon for sure. Thank You.", "title": "Hotel Break", "user": "Robin C", "date": "April 22, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 158473821}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "Had a three night caravan break here over Easter. Weather was cold but heating and fire had been put on in caravan before our arrival which was much appreciated. Caravan was basic but clean and location was handy for Porthmadog and the heritage steam railways. We were in the the \"Walled Garden\" with only 5 or 6 other caravans so this was very quiet - don't know what it would be like in the \"main park\" during the summer!", "title": "Caravan break", "user": "MuggleB", "date": "April 21, 2013", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "location": 4.0, "service": 4.0}, "id": 158344848}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "Very impressed with our \"basic\" caravan. It had every comfort, including central heating and all mod cons. The staff were friendly and helpful, especially Jean. Nothing too much trouble. The site is pretty and has a number of mini waterfalls.....so peaceful!", "title": "Fresh air with areas of beauty all around.", "helpfulness": 1, "user": "Patricia W", "date": "April 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 157903246}, {"rating": 5.0, "stay_parameters": "Stayed April 2013", "text": "We took a trip on a steam train from Portmadog, walked on the beach at Cricciieth, saw lots of little lambs, climbed to the top of Harlech castle (wonderful views) and enjoyed a delicious Welsh cream tea. Another highlight was a visit to beautiful Portmeiron, A trip on their train was fun and gave us time to rest our tired legs before walking down to the Estuary.", "title": "Excellent Short Break", "helpfulness": 1, "user": "Alyssa0006", "date": "April 15, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 157762401}], "location": {}, "variance": {"poor": 7, "average": 8, "very good": 34, "terrible": 2, "excellent": 123}, "slim_ranking": 1.0, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "Aberdunant Hall Hotel is set in the Snowdonia National Park and within an upmarket static holiday home park. Perfectly situated, this Victorian Manor House and grounds has far reaching views of the Snowdonia mountains and is an ideal location to explore the whole of Snowdonia and the LLyn Peninsula and being within easy reach of the harbour town of Porthmadog (4 miles) and the market towns of Pwllheli and Criccieth.The world famous walking village of Beddgelert (Gelerts grave) is just 3 miles from Aberdunant Hall. The grounds offer nature trails through the woods and boast waterfalls, streams and rock features. From the hotel you will find a number of scenic walks ranging from gentle strolls to more adventurous hill walks."}