{"user_rating": 5.0, "review_count": 498, "name": "Abigail's Hotel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "This hotel has the feel of a first rate B & B. The rooms are impeccably furnished and includes a flat screen TV/VCR. They offer DVD movies in their library that guests can borrow. The Staff are incredibly friendly and helpful. They can't do enough to assure that your stay is memorable! They don't offer dinner or lunch but DO have an incredible 3 course breakfast as well as appetizers in the evening which are included in the room rate. (Ask Chef Matt to show you a pic of \"Rocky\"). Unlike many upscale Chains; they offer free wi-fi and parking! The hotel is within walking distance of the harbor and other points of interest. We WILL be returning!", "title": "One of the best hotels I've ever stayed at!", "helpfulness": 1, "user": "BudHansen", "date": "June 28, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 114831077}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "My wife and I stayed at Abigails at the beginning of a two week holiday in Canada, our first visit to this amazing country. The hotel is set in a quiet part of this fascinating city and fronted by a lush but compact garden, where there were seats for outside drinks etc.. Our welcome was warm and genuine, the service beyond reproach and the room delightful and spotless. Breakfast was substantial and the Chef, in common with all staff we met, always prepared to go the extra mile to make our stay so memorable. Around 5pm there is an excellent and free buffet of canapes; cheeses, pastries etc. Our room (Sunflower) whilst charming and well equipped was a little small for us but as we were only there for three nights it was more than adequate.", "title": "Charming stay in Victoria BC.", "helpfulness": 1, "user": "bobandmanda", "date": "June 20, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 114449577}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled solo", "text": "First time staying at Abigail's Hotel - a wonderful weekend! Having stayed at many B&B's and Inns throughout the Northwest I would place Abigail's near, if not at the top of my list.", "title": "Beautiful hotel and outstanding hospitality = Memorable!", "helpfulness": 1, "user": "riakat4", "date": "June 19, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 114356730}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "Amazing hospitality and friendliness, delicious and creative breakfasts/afternoon appetizers and exceptional housekeeping. If you are looking for a memorable accommodation for your stay in Victoria, this is it!", "title": "Small enough to feel like home, but big enough to have all the ammenities you need.", "helpfulness": 3, "user": "hoohiki", "date": "June 19, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 114293455}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "The reviews for Abigail's Hotel persuaded me to reserve a room there on our first time to Victoria, BC. My family and I were pleasantly surprised. The customer service was impeccable, starting with a greeting from the manager who also helped bring our heavy luggages up to our room. Their complimentary gourmet breakfasts were amazing which included Dungeness crab and local brie omelette supplemented with rosemary and olive oil roast potatoes on one day to smoked salmon, grilled asparagus and poached farm fresh egg with white truffle oil with whole baby red potatoes braised with fresh thyme on another day. However, the chef may be able to accomomdate any other request not on the menu, which they did for my son who wanted a simple hard boiled egg. The hotel also offered snacks in the afternoons from a variety of international cheeses and smoked tuna with various salads to fruits and chocolate covered strawberries. They had a quaint garden patio where one could read a book or play chess.", "title": "well done", "helpfulness": 1, "user": "bear2336", "date": "June 16, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 5.0, "service": 5.0}, "id": 113916763}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "I stayed at the Abigail on my first night of a 9 day trip across Vancouver Island. The hotel is beautiful and very well taken care of. Nice historical property with beautiful gardens. Our room was amazing with lovely views and extremely comfortable bed. The location of the Abigail is a little off the beaten path....however an easy 15 minute walk to the downtown harbour area. Our room was on the 4th floor with no elevator so older people should be aware of a lot of stair to climb for the nicer upper level rooms. Luckily they brought our luggage up because that would have been quite a job! The complementary breakfast the next morning was the biggest surprise. Absolutely delicious. I'm a big fan of tea biscuits and the freshly baked one I had at the Abigail was the best I've ever had. The waitress was very gracious and brought me the recipe which was a nice touch! The tub in the room was lovely with jets however the shower was kind of weak and you had to stand in the tub to use it. Overall I would highly recommend this hotel for it's beauty, comfort and historical value.", "title": "Lovely hotel.........amazing breakfast!", "user": "lorril7", "date": "June 13, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 113333383}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "I choose this hotel for my birthday getaway because of the reviews from this site, and I was not disappointed! When we first arrived we were welcomed by an unbelievably friendly staff member. She gave us a tour, came outside and helped with the bags, and made us feel really welcomed. The room was beautiful! Comfortable beds, quiet surroundings, and a very romantic feel. We booked through Expedia, so the breakfast wasn't included in the room price, but it was no problem. If we wanted breakfast we could just wander into the dining area and take a seat, no reservations required. They would just add it to our room tab. The staff was always very professional and friendly, and made really great restaurant recommendations with reservations if we wanted. Everything we needed was within walking distance, downtown being just a few blocks away. We had an amazing experience and will most definitely be back!", "title": "Great place to stay!", "user": "breazee", "date": "June 13, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 113119639}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "Abigail's was the perfect venue for our small destination wedding in Victoria in June last year. The relaxed and friendly staff had arranged all that was needed for the occasion while we were still at home in Australia, and for an impromptu tea ceremony with the parents in a beautiful ground floor room before the wedding, they even lent us a lovely Asian tea set (we would have been happy with any) that really completed the event.", "title": "Delightful place for an intimate wedding, wish we'd stayed for more breakfasts!", "user": "HazeAus", "date": "June 12, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "service": 5.0}, "id": 112829542}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "The several rooms our party stayed in were all superbly appointed. We'd read comments about the breakfasts before we booked, and having experienced them all we can say is that we wish we'd stayed longer to enjoy more of the eggs!", "title": "We will definitely go back!", "helpfulness": 2, "user": "happycampercusick", "date": "June 8, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 112281676}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "Everyone at Abigail's was so warm and inviting! This was my first experience at a bed & breakfast/boutique hotel type property. I have to say getting to meet the folks I made the reservations with was a treat. There were no nameless or faceless encounters at Abigail's. The room accommodations were immaculate and the ensuite bath was a huge plus.", "title": "This Hotel/bb is absolutely GREAT, but the Staff is even better.", "user": "LMotto", "date": "May 29, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 110425946}, {"rating": 5.0, "title": "Really fantastic place to stay.", "text": "By the time we arrived at Abigails, we had stayed in seven other places in Canada which were all very good. Apart from one other which was on an equal, Abigail's was brilliant. It has all been said in other reviews but from the moment you walk in the staff are so helpful and friendly, the room was delightful (It was at the front which was good), the breakfast was very tasty with 3 courses and not the usual choices at all. We loved the library and the fact that we could sit in there and eat scrumptious little hors d'oeuvres made by Matt, the chef was a bonus. What a lovely way to chat to other fellow travellers and share experiences. It was on the edge of town which meant it was a bit quieter but you could walk to the main area in about 10 minutes.", "user": "City-Break-Lover", "date": "July 27, 2011", "id": 115860238}, {"rating": 5.0, "title": "Pure comfort", "text": "Just returned from 3 nights at Abigail's. We had a lovely room with a fireplace and sitting area. The staff were very friendly and accommodating . Abigail's has their own chef who creates delicious breakfasts each day included in the price if booked direct. Wonderful appetizers are provided each day at 5. We felt so comfortable and relaxed at Abigail's .", "user": "eileen675", "date": "July 23, 2011", "id": 115702128}, {"rating": 5.0, "title": "Eloquence at its best", "text": "This is a lovely victorian B & B with outstanding service from all of the staff....from the moment you set foot on the property, you are made to feel like they have been awaiting your arrival for days....the afternoon \"tea\" is well presented and could pass as a mini-meal...lovely hor d'oeuvres with cheeses, soups, breads, etc. and the rooms are exquisite....we stayed in the Foxglove on the front end of our vacation and went back on the last leg of our trip and was upgraded to the honeymoon suite, the Canterbury Belle....and although we have been married 30 years, we felt giddy in the lovely well appointed suite....fireplace, whirlpool tub for two and a four poster bed fit for the queen....it was spectacular.....and the breakfasts each morning prepared by a gifted chef were outstanding....could eat al fresco or inside a quaint dining area or in the library where guests were often congregated with plenty of spirits, food and gab....a truly welcoming respite in these times of hurry and go....thank you to all of the staff at the Abigail...", "user": "meellie", "date": "July 18, 2011", "id": 115470314}, {"rating": 5.0, "title": "LOVELY PLACE, GOOD LOCATION, VERY ATTENTIVE, GOOD BREAKFASTS", "text": "We stayed in a Country Room in the main house at Abagails on the ground floor. The room was decorated very nicely - the linens were beautiful. The bathroom was a good size and the bathtub/shower was modern. The service is excellent at Abagails - everyone is friendly & attentive to your needs. The breakfast was always wonderful and beautifully presented and Chef Matt was friendly. He occasionally went to each table talking with guests and making them feel at home. The common room is like an English library - with a fireplace and book-lined walls. I always felt comfortable going into it and sitting down with a book to read. They also have a small selection of DVD's that guest may borrow and watch in their rooms. The location is perfect - a short walk to town, and walking distance to many other things. I walked to the Government House and Craigdorrach Castle, as well as Beacon Hill Park and Emily Carr's house. Abagails makes you feel very welcome and comfortable. Oh - and I loved that they have Free Parking! I would definitely stay here again when in Victoria.", "user": "jainsea", "date": "July 11, 2011", "id": 115257963}, {"rating": 5.0, "title": "Beautiful hotel!!", "text": "Love this place! It is soooooo romantic. I great place to wind down from a day of site seeing! When we arrived, there was wine and chocolate covered strawberries!! Yummmm!!! Best hotel in Victoria!!", "user": "dknychick15", "date": "July 5, 2011", "id": 115062453}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "We awoke at 5:00 a.m. to get to the ferry by 7:00, and felt cranky and out of sorts. As soon as we arrived at our hotel in Victoria, everything looked bright and beautiful. Our room was", "title": "the highlight of the trip was the hotel", "user": "hisim", "date": "August 9, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 116493734}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "cozy and comfortable with lots of amenities and treats on our welcome. As a gluten free eater, the breakfast was complete with the most delicious chocolate chip cake and omelette worthy of a great restaurant.", "title": "great spot/better service", "user": "love2travel4242", "date": "August 6, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 116352575}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "The staff ( and all the folks in Victoria ) were helpful and pleasant. Even if Butchart Gardens weren't quite as good as Longwood Gardens, the hotel was worth another visit to Victoria.", "title": "Breakfast - brilliant. Perfect room", "user": "Georgefromtamworth", "date": "August 1, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116117497}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with friends", "text": "this place is an overgrown bed & breakfast 3 blocks from the inner harbour downtown.", "title": "LOVED LOVED LOVED", "helpfulness": 1, "user": "cznana", "date": "July 31, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116072797}, {"rating": 3.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "the room was clean & comfortable.", "title": "Nice but way overpriced and inconvenient for seniors.", "helpfulness": 1, "user": "ltgov", "date": "July 28, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 1.0, "value": 3.0, "service": 4.0}, "id": 115912324}], "location": {"country": "Canada"}, "stars": 3.5, "variance": {"poor": 5, "average": 14, "very good": 40, "terrible": 1, "excellent": 438}, "aka": "Abigails Hotel Victoria", "slim_ranking": 0.0175438596491, "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.5}, "description": "Located in romantic downtown Victoria, British Columbia, Abigail's Hotel is an adult oriented boutique bed-and-breakfast hotel that offers a distinctive and charming experience. Abigail’s is an intimate 23-room property that is housed in a 1930's heritage Tudor mansion. Its special atmosphere blends the romance and charm of the past with the comfort and convenience of modern accommodation. We are known internationally for our cozy ambiance, dynamic three course gourmet breakfasts and personalized attention to details. Ideally situated for romantic getaways, uninterrupted business travel, or an exciting Victoria outdoor weekend, Abigail's has something for everyone and is in close proximity to all the best that Victoria has to offer, located just three blocks from the downtown inner harbour."}