{"user_rating": 5.0, "review_count": 62, "name": "Abigail's Inn", "reviews": [{"rating": 5.0, "title": "Its about the beds", "text": "Abigail's Inn is a slice of heaven.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "January 2, 2006", "id": 4317368}, {"rating": 5.0, "stay_parameters": "Stayed December 2005", "text": "I have traveled the world over stayng in accommodations that run the gamut from five star luxury to hostel-like and only once, in a Four Seasons, did I find a bed as comfortable and linens as fine as those on my bed in Abigail's Copper Beech Suite. It was tough to decide whether to take in the postcard-perfect town of Camden and the beautiful Maine coastline or just to stay in that high thread count, oversized, down filled nest and read.", "title": "A Wonderful Experience", "helpfulness": 2, "user": "cfwillia", "date": "January 2, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 4317169}, {"rating": 5.0, "title": "Abigail's Inn is a great place to be", "text": "The Inn is a gem- small but with plenty of space for privacy and pure relaxation. My room and at least one other feature cast iron stoves that heat the suite and cast a romantic glow. The Copper Beech also has a large jacuzzi tub.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "December 19, 2005", "id": 4250352}, {"rating": 5.0, "title": "great choice for camden", "text": "The terrific, likeable innkeepers, Beth and Kipp, are urban transplants who seem to have made the transition to country innkeeping with natural ease. Eschewing country kitsch for clean lines and warm, simple decor, they have made Abigail's a respite for the sophisticated traveler.", "user": "A TripAdvisor user", "date": "December 19, 2005", "id": 4250286}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "This was my fiances and my first time in Camden, let alone Maine and it was FANTASTIC. From the moment we pulled up, we were taken care of by Beth and Kip. They clearly put their hearts and souls in to their business and it shows by the carefully appointed rooms and knowledge of the Camden community. Beth gave us a list of activities to do on Saturday and each recommendation was perfect. The Lobster Roll at the Bayview was outstanding as was the Clam Chowder at Cappy's. Abigail's Inn is located right in front of Mt Batie, which upon reaching the top will wash away all your stress. Abigail's Inn is within walking distance to the Penobscot Bay, sailing tours and the quaint town.", "title": "A Breath of Fresh Air", "helpfulness": 1, "user": "KPop", "date": "October 2, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5900504, "likes": {"liked": "— Cleanliness and Location"}}, {"rating": 5.0, "title": "A Wonderful Alternative to Victorian!", "text": "Beth's afternoon treats are exactly that! Mmm, brownies! I can't comment on breakfast as we're not huge breakfast people, but I will say that we did not feel pressure by Beth and Kip, as we do in most inns about skipping breakfast.", "helpfulness": 5, "user": "glover", "date": "September 18, 2006", "id": 5814631}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "Abigail's Inn is well worth the visit-Beth and Kip get it. As former city dwellers they understand why people are retreating to Maine and they offer the highest quality without pretentiousness.", "title": "Sad to Leave!", "helpfulness": 3, "user": "JMR5122", "date": "July 23, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 5500515}, {"rating": 5.0, "stay_parameters": "Stayed May 2006", "text": "Abigail's Inn is truely a breath of fresh air.", "title": "A Charming Inn", "helpfulness": 2, "user": "crisgo", "date": "July 16, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 5470099}, {"rating": 5.0, "title": "A little slice of heaven", "text": "This was our favorite of all the inns we stayed in on our trip to Maine. It's beautiful inside and out, and we liked that it WASN'T", "helpfulness": 2, "user": "A TripAdvisor user", "date": "January 4, 2006", "id": 4324173}], "location": {"country": "United States"}, "variance": {"poor": 0, "average": 0, "very good": 3, "terrible": 0, "excellent": 59}, "aka": "Abigail's Inn Camden, Maine", "slim_ranking": 0.6, "description": "Come stay at one of Camden, Maine's most intimate Bed & Breakfasts with private off-street parking in a great location - just steps from the center of town and the harbor. Choose from one of our 4 well appointed guest rooms, enjoy a delicious breakfast and then start off on your daily adventure - sailing, hiking, kayaking, shopping, dining, or just kicking back on our large front porch. Come rest, relax, and leave the car behind."}