{"user_rating": 4.5, "review_count": 61, "name": "Abitazione Pigneto", "reviews": [{"rating": 5.0, "title": "Abitazione Pigneto - Bed & Breakfast", "text": "I have just came back from Rome. If you want to sleep well, good services, hospitable hostes and a real italian atmosphere and you want to pay a very good price, I hardly reccomend to you Abitazione Pigneto! It is not in the centre of Rome, but from there is easy to reach all the hot points to visit in Rome. The relation between quality and prices is excellent!", "helpfulness": 9, "user": "dina_dee", "date": "June 21, 2005", "id": 3588594}, {"rating": 4.0, "title": "Like a Roman homestay", "text": "We stayed here for 3 nights in August 2008. The owners, who live on the same floor, were very accommodating but also gave us our space. The room and bathroom were VERY large and decorated according to their local tastes. They also run an antique store next to the apartment. They very generously washed our clothes for us and we could nominate what time we desired breakfast. What hospitality! We were a little confused as to whether we were allowed to use their computer or not but snuck in a short session or two on the internet late at night. We did find one of them in the apartment one day, which was not a problem after the initial shock as we hadn't been introduced to that co-owner. The area is easy to navigate by tram but since we did clearly witness pickpocketing first hand, we would suggest you don't carry your wallet in your back pocket! The area is multicultural and probably safe.", "helpfulness": 2, "user": "xelar8", "date": "October 26, 2008", "id": 21214794, "likes": {"liked": "— homely feel", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled on business", "text": "My husband and I stayed in this B&B for five nights in July while my husband took a mosaic class around the corner. We had alot of fun! Giorgio and Fulvio are great hosts! Once we figured out the bus and subway system(which is easy) we were able to get around Rome with no problem. The room and bathroom were extremly clean. We also were able to use the computer that is in the apartment, which is a nice touch. Breakfast was good. Giorgio has great reccomendations of places to see while in Rome. I would highly reccomend this Bed&Breakfast!", "title": "Very Nice!", "helpfulness": 2, "user": "cinnyNewJersey", "date": "August 3, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 3.0, "rooms": 5.0}, "id": 8284060, "likes": {"liked": "— Staying in a real Roman neighborhood"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "The Abitazione Pigneto is located in an apartment building in a beautiful tree-lined neighbourhood in the suburbs of Rome. It about twenty minutes from the Colosseum by bus, which you can catch at a bus stop just a two minute walk away (a line on that stop also takes you directly to Termini station). The bed and breakfast is run by Giorgio and his business partner Fulvio, who are gracious hosts. We stayed here three nights and had a great experience.", "title": "Want a slice of real Roman life? Stay at the Pigneto . . .", "helpfulness": 9, "user": "vershaz", "date": "April 22, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 3.0, "rooms": 5.0}, "id": 7414877, "likes": {"liked": "— service and the rooms", "disliked": "— breakfast"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2006, traveled solo", "text": "The B&B is actually an apartment with three bedrooms, a shared bath, a kitchen, a dining room, and an entrance hall. Giorgio and Fulvio live across the hall on the same floor, but the B&B was originally Giorgio's home and he still treats it as such. He loves the flat and the dynamic interplay of eclectic and colorful furnishings in each room, especially the artwork and artifacts littered everywhere, reflects it; it truly feels like a home and feels very \"Roman.\"", "title": "Great little B&B", "helpfulness": 4, "user": "tarahsbudd", "date": "October 22, 2006", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 3.0, "rooms": 4.0}, "id": 5983840, "likes": {"liked": "— Price and cleanliness", "disliked": "— View from the room"}}, {"rating": 2.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "Our room was large and had an extra day-bed in it. Our bed was low to the ground, but comfortable. There is a shared balcony for some of the rooms, which looks over the street and the neighbourhood. We didn't find it noisy at all, except for a few cars gunning their engines around mid-evening. It's a real neighbourhood, so your view and experience will be of a real neighbourhood, but this is not a drawback. You'll truly believe you're living in Rome instead of just visiting.", "title": "room next to shared bath was noisy with other people using it at night", "helpfulness": 2, "user": "Hemant_Saraswat", "date": "October 17, 2006", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 2.0, "rooms": 2.0, "location": 3.0}, "id": 5965736}], "location": {"country": "Italy", "region": "Lazio", "continent": "Europe", "city": "Rome"}, "variance": {"poor": 3, "average": 2, "very good": 18, "terrible": 2, "excellent": 36}, "aka": "Abitazione Pigneto Hotel", "slim_ranking": 0.329303876615}