{"user_rating": 4.0, "review_count": 81, "name": "Acanthe Hotel", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "We stayed here for one night of our honeymoon mainly to eat at La Tupina restaurant. As mentioned on this site the room was basic but the hotel is very well situated and the man on the front desk was charm itself.", "title": "Great value for a short stay", "helpfulness": 1, "user": "janiedelang", "date": "June 18, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 2.0}, "id": 32595644}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled solo", "text": "The main drawback was roadworks right outside our bedroom window which started early and were ridiculously loud!", "title": "Exactly what I was looking for in Bordeaux", "helpfulness": 2, "user": "7mary4", "date": "March 8, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 25787975}, {"rating": 4.0, "stay_parameters": "Stayed October 2008, traveled with family", "text": "I'm giving this hotel five stars. It was cheap, great location, friendly, clean, efficient, and perfect for a night in Bordeaux. It's what all two star hotels should hope to be.", "title": "Very central & reasonably priced", "helpfulness": 2, "user": "JJOR", "date": "October 28, 2008", "detail_rating": {"front_desk": 4.0, "business": 1.0, "service": 3.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 2.0}, "id": 21332013, "likes": {"liked": "— location", "disliked": "— Bedrooms"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled with friends", "text": "The rooms have recently been remodeled and the top two floors were closed for renovations. The beds were comfortable as well as the pillows. I'll come back if I find myself in Bordeaux again.", "title": "Great Hotel", "helpfulness": 2, "user": "LBC80", "date": "July 12, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 17821519, "likes": {"liked": "— Location, balcony and room size", "disliked": "— Nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "the wifi works with a simple login. This lets you use it on your iPhone as well.", "title": "Cheap and well located", "helpfulness": 3, "user": "docdanz", "date": "May 6, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 7550614, "likes": {"liked": "— location", "disliked": "— dated decor"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "Hotel has great location, a block from the river, in the pedestrian old town. Room was very clean and large by Europeon standards. The mattress was soft for our taste. Staff was helpful and breakfast was a real value compared to other hotels. Would stay there again.", "title": "Good, inexpensive, great location", "helpfulness": 3, "user": "MPH", "date": "September 30, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 81635705}, {"rating": 3.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "We stayed in this hotel for one night upon arriving in Bordeaux. We got the Jetbus from the airport and this hotel is a straight ten minute walk from the jet bus stop - very handy. The hotel room itself was clean and basic. The bathroom is small but adequate. The location of this hotel really is the selling point. It is right beside the river and is located on Rue St Remi which has plenty of restaurants and shops. It is also beside the metro stop which takes you directly to the trAIn station. I would have to comment though on the abruptness of the reception staff. I booked over the phone direct with the hotel itsef (68euro) and when I enquired about a confirmation email I was very rudely told \"I'll do it when I get time\". All in all it was perfect for a short stay, although it could be quite noisy during the night and very warm without air conditioning.", "title": "Basic hotel which is very well located to amenities/transport links", "helpfulness": 2, "user": "Miss_L_Ireland", "date": "July 21, 2010", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 3.0, "sleep": 2.0, "rooms": 2.0, "location": 5.0}, "id": 71739827}, {"rating": 4.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "We stayed two nights in this hotel and could really recommend this hotel for everyone, who prefer a hotel with a perfect location in the heart of the city, very clean and spacious rooms and a pleasant welcome for a low price. The hotel is located in a side street, therefore there was no complaint about noise.", "title": "Perfect stay", "user": "LucerneCity", "date": "July 2, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 69407178}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "I would rate this hotel not as a two but a three star hotel and would defintitely stay again there.", "title": "Lovely hotel, great location", "user": "ripandread", "date": "September 1, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 3.0, "rooms": 4.0}, "id": 39528223}, {"rating": 3.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "My wife and I spent three nights at the Acanthe. The location is excellent, near major sights and close to the river. The staff was friendly and helpful. The rooms are small but clean and more than adequate. We loved Bordeaux and the Acanthe added to our pleasurable experience.", "title": "Very basic, fine for one night", "user": "Cappyjuju", "date": "July 23, 2009", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 5.0, "service": 3.0, "rooms": 3.0}, "id": 35581921}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "A few steps away for the most famous Bordeaux postcard, the location of the Acanthe Hotel is perfect for exploring the city. The price is very good and the rooms, at that price, are more than correct. Do not expect luxury but everything is fine and spotlessly clean. We went for a \"superior\" (or comfort, do not remember the name) that has air conditioning, a must in summer. Wifi works well.", "title": "Simple, correct, central.", "helpfulness": 1, "user": "ARUANO", "date": "August 29, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 138784901}, {"rating": 2.0, "stay_parameters": "Stayed August 2012", "text": "We are big fans of Bordeaux, especially the lovely waterfront area, but this hotel is very basic. Yes the location is great, and it's clean. But that's it.", "title": "Serviceable at best.", "user": "BubbaDinMD", "date": "August 21, 2012", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 5.0, "service": 2.0, "rooms": 2.0}, "id": 137950627}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "Security was a concern. You leave the key in plain sight when you go out, and often the desk was unmanned while the front desk guy was doing an errand.", "title": "Acanthe is ace", "user": "MLF1955", "date": "July 15, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 134419888}, {"rating": 3.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "Before our trip we had difficulty finding a reasonable lodging choice for our family of four. We had 2 rooms here, and the price was right. Just don't expect too much.", "title": "Nice Room, Shabby Hotel", "user": "TravelinFuel_3", "date": "July 13, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 134278559}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with friends", "text": "This very clean hotel is good value for those looking a central base in Bordeaux. We have stayed here twice and both times were very impressed. I would recommend a comfort room on the top floor. They are quite roomy for a European hotel. Located right behind the Bourse in the old part of the city. Excellent restaurants are abundant in this area.", "title": "Loved it! Location, Location, Location", "helpfulness": 1, "user": "ChrissieBPerth", "date": "July 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 134181125}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled solo", "text": "Tops for price and location, just behind the Place de la Bourse, the rooms are clean, the beds very comfortable and the bathrooms are modern and functional. The 'comfort' rooms have air conditioning which is necessary in summer but perhaps the cheaper rooms would be good in the off season. Fair breakfast. My first choice for value in Bordeaux.", "title": "Great location, great price.", "user": "Jonoln", "date": "July 8, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 133741965}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled with friends", "text": "Stayed here just before Christmas 2011 and was very impressed. The hotel which is very central, just behind the Place de la Bourse, has recently been refurbished and has a very nice reception lounge area with breakfast room. The room we had on the 1st floor (No 4) was very large and quiet with decent-sized bathroom. A friend occupied Room No 2 which although smaller had a French windows and a balcony. There is a lift and the reception staff were efficient and helpful.The room was 69€ and with breakfast for two the bill came to 82.90€; great value for the city centre. I definitely recommend it for its position, cleanliness and for the restaurants and bars close at hand.", "title": "Great value", "helpfulness": 2, "user": "David R", "date": "January 20, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 123353854}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "this hotel was recommended by friends and was quite a good find. the room was basic, but had been renovated and was clean. the bathroom quite spacious and our room was not on the front so no noise from the street. by far the main reason to stay here is the location, you can't beat the street its on, pedestrian, full of restaurants and shops! and if you need to go further, the tram stops just on the waterway, very handy to get to and from the station. we thought it was pretty good value for money and would go back.", "title": "very central", "user": "serena99", "date": "December 25, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 122085322}, {"rating": 3.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "Hotel Acanthe is in a perfect spot for visiting Bordeaux, located right near the riverfront and the coolest areas in the city. My room was clean and had a small balcony from which I could lean over and see the waterfront and the beautiful fountain in the Bourse plaza, so that was really cool. However the bathroom doors are wooden louvered shutters so don't expect a lot of privacy. Also, we were there in hot weather and the room was stifling. We asked for a fan and the indifferent desk man said it was \"impossible.\" Our traveling companion was also bothered by the temperature so it wasn't just our room. I guess if you could keep your windows open at night it would be better, but the rooms on that side of the hotel are VERY noisy, with people coming and going until very late as well as trash trucks, recycle trucks, etc. The good news is that there are very few cars there as the street is a mostly pedestrianized one. I do know that my friend stayed in one of the upper floors, which she enjoyed; those have been upgraded and have A/C and she was on the small side street and said it was quiet. They call those rooms by a different name (\"deluxe\" or something like that) so that would've helped a lot in our case. The price is decent for the location but I wish that they would just upgrade all of the rooms and have a bit better of an attitude and it could be a charming place.", "title": "Could be a great little hotel...", "user": "ChipTravel", "date": "September 18, 2011", "detail_rating": {"value": 4.0, "location": 5.0, "service": 2.0, "rooms": 3.0}, "id": 118275284}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "The best thing about this hotel is it's central location. Located right in the middle of the pedestrain area of the city, only a block away from Place de la Bourse and the boardwalk, close to lots of great restaurants, a short walk to the Tourist Bureau and trams - definitely can't complain about the location! The staff were friendly and helpful, the room was simple but had everything we needed, and the price was right! Would definitely recommend this hotel for travelers to Bordeaux!", "title": "Clean Hotel in Central Location", "helpfulness": 3, "user": "ejstar79", "date": "March 11, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 99819108}], "location": {"country": "France", "region": "Aquitaine", "continent": "Europe"}, "variance": {"poor": 4, "average": 14, "very good": 38, "terrible": 4, "excellent": 21}, "aka": "Acanthe Hotel Bordeaux", "slim_ranking": 0.154285714286}