{"user_rating": 4.5, "review_count": 131, "name": "Accademia House", "reviews": [{"rating": 5.0, "title": "Fantastic B & B!", "text": "My husband and I LOVED our stay at Accademia House in Florence. Marco, the owner, was SO helpful, offering restaurant recommendations and giving us lots of info about the city. Our room was HUGE, especially after coming from Paris, where the rooms are microscopic. We had our own litte patio (not much of a view) and a large private bathroom (ensuite). Breakfast is actually a voucer for the cafe directly across the street, which was pretty good. It's only about a 3 minute walk to the Accademia Gallery, and maybe a 10 minute walk to the Uffizzi and other sites. There's a great bike rental shop about 3 blocks away.", "helpfulness": 5, "user": "want2binitaly", "date": "September 10, 2006", "id": 5787677}, {"rating": 4.0, "stay_parameters": "Stayed June 2006", "text": "My only complaint was that there was no A/C, but we did have a fan in the room, which helped. We were there during the big heat wave of the summer though, so it would probably be ok during \"normal\" weather. Again, Marco is a great guy, and will make sure you have a great stay in Florence. He even let us borrow his own wine glasses. I would highly recommend staying here!", "title": "Value, Location, Friendliness", "helpfulness": 7, "user": "themanmathias", "date": "June 26, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 5.0, "service": 4.0}, "id": 5383453}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "My girlfriend and I just spend a whole week in Firenze and lived at this great B & B. We had high expectation due to good reviews, pictures showing nice rooms and very friendly email contact with the owner. Luckily all our expectations were fulfill. The host was extremely friendly and immediately made us a map with information about places to eat, alternative places to visit and much more. We had the large Antiq room with beautiful vaulted ceilings, a large bed and view to Via San Gallo. For us it was a perfect place to stay. It was like staying at our own apartment, and therefore more relaxing, while at the same we just had to ask the host in the morning to clean the room, change the sheets or the towels and it would be done when we came back in the afternoon. The place is also situated in an area not full of tourist, which is also very nice in my book.", "title": "A great place to stay", "helpfulness": 1, "user": "HansWest", "date": "March 14, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 7161933, "likes": {"liked": "— The large room with a fantastic bed and an extremely frienly owner", "disliked": "— Nothing it was hust great"}}, {"rating": 5.0, "title": "Great place", "text": "Thanks Marco for a great stay!", "helpfulness": 1, "user": "JBS70", "date": "March 13, 2007", "id": 7155195}, {"rating": 4.0, "title": "Great stay!", "text": "Hans and Anne Louise", "user": "Mocabi", "date": "January 12, 2007", "id": 6582442}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "Didn't know what to expect. I had seen the photos and i thought it looked great. It looked MUCH better in reality. AMAZINGLY decorated rooms, great location (close to everywhere, markets, shops, sights etc.) Marco (the owner) goes out of his way to accomodate you and is very very helpful throwing in suggestions where to go, where to avoid etc. He recommended some splendid restaurants amongst other things. I recommend the Accademia House to anyone who wants a pleasant stay in Florence. I have to say that the rooms add that extra special Florence feel to the entire holiday.", "title": "Don't stay anywhere else", "helpfulness": 1, "user": "Barbless1", "date": "December 8, 2006", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6349472, "likes": {"liked": "— The room.", "disliked": "— Nothing wrong with this place..."}}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "The hotel is perfectly situated close to the Duomo and 15 min. walk to the Ponte Vecchio. Rooms (Antiq and Classic)are incredibly clean, spacious and heated (even the Classic room, that looks little in the Accademia site fotos!) Bed is very confortable; private bathrooms all modern and new, plenty of towels. If you would like to have total quiteness you should ask for modern or classic room. The owner is planning to put double glass windows in the Antiq room to avoid street noise and cold/heat to get into it. The stairs to go to the first floor where rooms are located are a bit narrow and stiff, but even my folks got up the stairs without problem. There is no parking, but be careful if you rent a car: first, parkinglots cost about 35,00€/day and are a bit away from center; second, it's prohibited to circulate with your car in the center of Florence, they have cameras that records your car license! So be advised! Better to take the public transports, which will take to any place in Florence (or taxi). Or just walk, Florence is a beautiful city, enjoy it!", "title": "Loved Accademia", "helpfulness": 2, "user": "Cicilord", "date": "September 26, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5877534}], "location": {"country": "Italy", "region": "Tuscany", "continent": "Europe"}, "variance": {"poor": 6, "average": 3, "very good": 32, "terrible": 1, "excellent": 89}, "slim_ranking": 0.378378378378}