{"user_rating": 5.0, "review_count": 254, "name": "Accueil Chez Francois B&B", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled solo", "text": "Accueil Chez Francois is located in a beautiful, safe neighborhood across the street from an extensive park, and Francois (owner) and his sidekick Laurence were both very welcoming, fun and helpful. Breakfasts were delightful - crepes, French Toast, clafoutis - and the room was lovely! There's easy access to the bus system and nearby metro stop - can't say enough good things about this great B&B!", "title": "Loved this B&B!", "helpfulness": 1, "user": "Heidi K", "date": "October 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 181485141}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "The owner Francois and his assistant Laurence take turns running the B&B. They are both very nice people that make you feel at home from the minute you arrive. Breakfast is served on a big table in the small kitchen which creates a great opportunity to talk to the other guests. The B&B is located in the Plateau Mont-Royal area with many nice restaurants within walking distance. There is free parking in the backyard. If you plan to use public transport you should notice that the nearest metro station is quite far away but bus stops are nearby. You should be aware that the B&B is on the second floor and you have to climb a steep Montreal style staircase to get to the front door.", "title": "Nice hosts, nice place, nice area", "helpfulness": 1, "user": "frch-Denmark", "date": "October 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 180770819}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled solo", "text": "I spent 3 nights in October - the location is quite a way from downtown or old town but it is easy to catch a bus from across the road and then the metro to just about anywhere - including the botanic gardens - 30 minutes to most places. For dinner it is a 10-15 min walk to a couple of different streets with many restaurant options.", "title": "Great location and hospitality", "helpfulness": 1, "user": "Ilona K", "date": "October 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 179922810}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled with friends", "text": "Francois is very hospitable and makes great breakfasts of waffles/french toast/crepes. He is also a great font of information regarding how to get around.", "title": "great place", "user": "Shiraaaa", "date": "October 1, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 179327612}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "Taxi from the train station is about $15-20 depending on traffic.", "title": "The Best!", "user": "Gary S", "date": "September 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 178646072}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled with friends", "text": "Montreal is a special place and Chez Francois is quite special as well. Francois is a warm and welcoming host as is Laurence, his talented second-in-command. My husband and I (from Toronto) and friends from Massachusetts have been staying with them each June for years. Their breakfasts are always something to look forward to as are the conversations around trhe table. Chez Francois is located right across from a large beautiful park which you can walk through without any concerns coming home from evenings out. (Chez Fancois also has free parking, a major plus in a large city.) Rue Saint-Denis with its many restaurants, shops and clubs is not far, as well as rue Duluth with its good selection of \"bring your own wine\" restaurants.", "title": "A Very Special Place In Montreal", "user": "Diana S", "date": "August 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 172676263}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "My wife and I stayed at Accueil Chez Francois during our honeymoon in Montreal, from July 13 - 18. Met with two gracious hosts, delicious breakfasts each morning (except for the day we decided to sleep in late!), and as much hospitality as could ever be asked for, we would not hesitate to stay again should we make a trip back to the city. Montreal is a fantastic place in general, but our experience was made truly outstanding through the great stay we had at this bed & breakfast. Highly recommended!", "title": "Honeymoon was perfect!", "user": "Adam B", "date": "August 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 172444210}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "Francois really took care of the place. The B&B was immaculate, and well organized. Service excellent. Not only did our host guided us well, his advise and his personally served breakfast are great!", "title": "Easy to find location directly across from a great park!", "user": "DannielNYC", "date": "August 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 171409694}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled solo", "text": "I have 2 strikes against the B&B! (1) Coming from New York City, getting to a Metro (subway) stop was a long 15 minute walk. (2) He had room for us for one night, but was not able to accommodate us for a second night. He did help us to find another B&B though!", "title": "A nice place to say in Montreal", "user": "Hightechto", "date": "July 22, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 168636809}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "I stayed at Accueil Chez Francois B&B from July 11 to July 13 and really enjoyed my stay. I stayed in Room 3 at the back of the building and it was very quiet, clean, SILENT air conditioning, ample parking in the rear of the building and a great shower. The meals were excellent as was the hospitality. I would not hesitate to recommend Accueil Chez Francois B&B to my family and friends and this will be my go to place whenever I visit Montreal.", "title": "Perfect choice", "helpfulness": 1, "user": "somuchtosee8_4", "date": "July 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 168353209}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled with friends", "text": "Superb accommodation which lead to a superb experience. Picked this B&B because of the terrific breakfasts as I need to eat a good meal before a full day of sightseeing and the breakfasts were fantastic. But what really made the stay fabulous was Francois and his attention to detail such as providing bus/subway suggestions, giving us a heads up on \"bring your own wine\" on Avenue Duluth and leaving juice and pastry for our early departure to catch our flight. Most of all, Francois was full of lively conversation and made our stay feel like more visiting an old friend rather than staying in a hotel. Highly recommend.", "title": "Lisa P", "user": "Lisa P", "date": "September 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 178496374}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "This B & B was terrific! Lovely, safe neighborhood and the building was right across the street from a beautiful park! Room was spacious, very clean and comfortable (the bed was too firm for us). Very convenient to the bus, restaurants, bakery, shopping of all kinds. Francois was our host and he could not have been nicer; accommodating, always ready with suggestions for restaurants, things to do and directions. The breakfasts that he made were great! We had Francois's substitute for the weekend, Laurence, and she was a sweetheart & a wonderful cook. There is a full kitchen available for use while staying here which was great for storing drinks, cheese, etc. We loved staying here and would stay again in a heartbeat!", "title": "Very Clean, Comfortable & Convenient-Excellent!", "user": "heavypaws23", "date": "September 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 177315406}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with friends", "text": "Found this B&B on tripadvisor and was not disappointed. We arrived late and were greeted warmly. With a quick orientation, we were provided a map and directions to a wonderful restaurant right around the corner. The next morning, breakfast was amazing - crepes with fruit the first day and omelets the second. We were directed to sidewalk sales and other points of interest and steered away from \"tourist traps\" when exploring the city. Only wish we could have stayed longer. Definitely felt welcome and will stay here again if in the area.", "title": "Perfect B&B in the middle of everything!", "user": "Michelle M", "date": "September 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 175808927}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "arrived in montreal after travelling by train from Toronto. the initial reaction was the winding staircase from the front street to the first floor accommodation .the room had air con which was a blessing in the muggy hot nights. the breakfasts were fixed very heavy on the carbs ,but set us up for the day ahead .the train and bus service is superb .a bus to the underground and a short journey to the city .do the city bus tour we bought a 2 day ticket .great value", "title": "good location for the city", "user": "holidaysareus21", "date": "September 1, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 175121451}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with friends", "text": "I found this gem in 2005 and have been returning annually ever since. Francois' warm welcome, the stylish guest rooms & the amazing mouth watering breakfasts with home-made preserves each morning are a real treat...and then the location: Across the street from Lafontaine Park which always has something going on and there is a bus stop to the metro from where you can go anywhere...or free parking at the rear if you drive. Francois & Laurence always have the insidescoop on what there is to see & do in Montreal and have many suggestions so you'll have a fun trip.", "title": "FANTASTIC AND EASY TO FIND/ACCESS", "user": "sharongraves", "date": "August 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 173045874}, {"rating": 5.0, "title": "Excellent value and location", "text": "We spent 5 nights at Accueil CF and it was just what we wanted and lived up to expectations. We were in Room 3 which is really quiet so perfect if you are a light sleeper. It is on a mainish road but in a good location - has a nice neighbourhood feel and is close to some very good restaurants (see my two recommendations - both about 10 mins walk away). I'm pleased we stayed in this area and not downtown or in the French Quarter. The nearest Metro stations are a good 15 mins walk away or a bus ride, but we walked into the centre most of the time as once you have reached the metro, you might as well carry on for another 10 mins.", "user": "RATSOMATIC", "date": "November 6, 2013", "id": 183739184}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "Francois and Laurent were very helpful with suggestions and maps and their cooked breakfasts were delicious! ACF is homely and would definitely recommend to others.", "title": "High praise for Accueil Chez Francois B&B", "helpfulness": 1, "user": "Rebecca G", "date": "November 1, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 183213807}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "We recently spent a magical fall weekend in Montreal and it all started at the Accueil Chez Francois B&B. Our room was bright and clean with a private bathroom. The breakfasts were nutritious and hearty - giving us enough energy to explore Montreal on foot. Laurence is a cheerful host and is very knowledgeable about places to explore and eat in Montreal. The B&B is located across from a huge and glorious park and is close to great shopping and inexpensive and delicious restaurants. We ate at three restaurants suggested to us by Laurence - they were all delicious and really reasonably priced. They were all very different from restaurants in Toronto. Laurence supplied us with a map and marked restaurants and tourist sites for us. We took about an hour to walk to Old Montreal where we spent several hours at the archeological museum. There is a fun exhibit to commemorate the Beatles 1964 Montreal concert. We joined a guided tour in the lower level of the museum that explained how Montreal came to be settled. I would highly recommend the museum and both tours. The young man who led the guided tour was informative and entertaining. He took what could have been a dry subject and made it into an educational and memorable hour-long tour. The museum is well worth the $20 admission. I would recommend having lunch at the museum. The restaurant has a beautiful view and offers healthy, delicious lunches. On our second day we walked from Chez Francois to the top of Mount Royal. The views are magnificent. All in all we had a very memorable weekend in Montreal. When we arrived we had no plans for how we would spend the next 36 hours however Laurence played a significant role in helping us plan our precious hours. We were not disappointed with a single aspect of the B&B or the time we spent exploring. We hope to return in the spring to see Montreal in a different season.", "title": "Montreal - Something Different", "user": "ianrichards8", "date": "November 1, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 183128897}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled on business", "text": "Rebecca & Mark", "title": "Lovely B&B in a great neighbourhood", "user": "MaggieMae95", "date": "October 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 182864998}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "To start my review, when we arrived the traffic was chaotic due to road works.That said Francois was there to help take the bags up the steps to our room which was No 3. This was quickly followed by a local beer which i really appreciated. The room was great, clean and very quiet. We had our own ensuite and in the common room there was PC which if you didnt have a device could be used for free. Francois also let us use the washer and dryer, which after travelling for almost five weeks was excellent. Francois also gave us extremely good directions and advice on using public transport, which we used extensively. During the weekend Lauren took over the role of host and she did also a wonderful job of making you feel very welcom. The only thing with Montreal is the timing, when we arrived Autumn was in full swing and some of the tourist areas ie the Botanical Gardens were being prepared for the winter and a number of the plant beds were empty.", "title": "This place is a real gem!", "helpfulness": 1, "user": "LeslieMN", "date": "October 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 181627110}], "location": {"country": "Canada", "city": "Montreal"}, "variance": {"poor": 0, "average": 0, "very good": 24, "terrible": 0, "excellent": 230}, "slim_ranking": 0.0135135135135}