{"user_rating": 4.0, "review_count": 853, "name": "Ace Hotel NYC", "reviews": [{"rating": 5.0, "title": "Noisy, happening and fun!", "text": "I loved this hotel, from the vibe, the friendliness of service and overall look, it was great from the beginning. You can`t miss a cup of coffee from Stumptown on the main floor or the great burger at the Breslin. It`s great service all around and a perfect place to spend a few days in a great location.", "user": "Cyngtz", "date": "May 28, 2013", "id": 162168789}, {"rating": 5.0, "title": "Extraordinary service.", "text": "The only downside (if you would call it that) is that it can get noisy with the plumbing, but it`s part of staying in such an old building and for us it was definitely part of the experience.", "user": "dhs1LosAngeles", "date": "May 28, 2013", "id": 162161652}, {"rating": 5.0, "title": "Fun", "text": "The medium king room is perfectly sized and super comfortable, the beds are the best, so much I had trouble getting up in the morning..", "user": "PatsySeattle", "date": "May 27, 2013", "id": 162044419}, {"rating": 5.0, "title": "Friendly, hip, and great service at the Ace Hotel!", "text": "As anyone who has read my reviews, I am a tough cookie to impress. I travel constantly and seem to spend half my life in hotels. That the Ace is getting 5 stars from me means that they are absolutely at the top of the hotel food chain.", "user": "Edward H", "date": "May 27, 2013", "id": 161978246}, {"rating": 5.0, "title": "Absolutely Ace", "text": "My first impression was not so good. A dark packed lobby that was more like a nightclub. I thought, oh no, another Ian Schrager wanna-be disaster. That fear lasted as long as it took me to meet the front desk people. Lovely, professional and on the ball. The room was excellent. It was clean, quiet, and extremely comfortable for a working professional. I was instantly in love. The attention to detail and comfort was pitch perfect. Immediately I didn't ever want to check out. I loved it there.", "user": "JLM235", "date": "May 25, 2013", "id": 161764441}, {"rating": 5.0, "title": "Too old to be a hipster (and too lazy to find out what it means)", "text": "I'm 45. I like music. I like a nice bar. I like good service. I like to be where I need to be without car service, subway changes, pleading for cabs etc. I like a place that likes to be cool but isn't looking up its own least photogenic orifice to achieve that.", "user": "9triphop9", "date": "June 5, 2013", "id": 163117583}, {"rating": 3.0, "title": "Hipster Hotel", "text": "The Ace Hotel achieves everything important to me effortlessly, made me feel relaxed and valued as a guest, let me feel that I was really in Manhattan and not in a tourist enclave and managed to not rip me off in the process.", "user": "patrickwNewYork_NY", "date": "June 3, 2013", "id": 162860402}, {"rating": 5.0, "title": "Ace is awesome !", "text": "Location is perfect. Chelsea is relaxed and has every bar and restaurant you could wish for. The subway is near (6) which gets you up and downtown quickly and cheaply, and miraculously for Manhattan, it always seems to be easy to get a cab on 29th.", "user": "parsichick", "date": "June 1, 2013", "id": 162595836}, {"rating": 4.0, "title": "Hipsters without the attitude", "text": "The staff are excruciatingly hip... But not one was dismissive, rude or less than perfectly helpful.", "user": "KingMoonJoe", "date": "May 31, 2013", "id": 162578726}, {"rating": 5.0, "title": "Amazing!", "text": "Sitting at the John Dory sidewalk tables is as close to bliss as I've experienced in NYC. The whole world passes by and the beer is no more blindingly expensive than 95% of New York bars.", "user": "Elena R", "date": "May 30, 2013", "id": 162431837}, {"rating": 4.0, "title": "Hipster Paradise", "text": "My beau took me here to celebrate my birthday weekend in my fave city – NYC. He chose the ACE for a variety of reasons, mainly it was one of the hot new hotels, its proximity to the fashion district and its proximity to Broadway. When we arrived, there was a photo shoot going on in the main entrance, so we had to use the side entrance – the entire lobby was already buzzing at 3PM on a Friday. I am heavily accustomed to the hipster parade in places like Portland, New Orleans and good ol’ Williamsburg (Brooklyn), but Ace makes it clear that the movement has made it’s presence to Manhattan. The lobby is the ultimate of coolness – a great mix of a coffee shop, study hall and lounge. In the foreground, there is are sumptuous tufted, vintage leather couches and long wooden tables swamped with guests who look like they are part of the décor, punching away on their Macs while drinking their Stumptom coffees or craft beers – all bathing in light dimmed to candle setting even though the sun is shining outside. Go further in and you'll find a bar that serves sexy cocktails or whatever is your choice of poison. Be warned that this is NYC and you are in the Flatiron district so drinks at this bar average $15 (which is average for my hometown too).", "user": "pinxitluc", "date": "May 23, 2013", "id": 161606528}, {"rating": 4.0, "title": "Rocking the records!", "text": "The check in process is not exactly fast, but not exactly slow – it looks like the front desk also doubles as a gift shop where you can buy all the ACE paraphernalia your little hipster heart desires. Although the folks at the front don’t make eye contact easily – they are nice and offer friendly smiles as well as instructions on how to navigate to the room through the lobby as well as how to use the elevator. Even the room keys and envelopes are cool and scrap book worthy here.", "user": "ownuniverse", "date": "May 23, 2013", "id": 161582273}, {"rating": 5.0, "title": "Best Boutique Hotel", "text": "Funky hotel with funkier rooms. When was the last time I saw a guitar, a record player, and a short stack of vinyl in a hotel room. Ah, the answer would be never...Our room also came equipped with an old school pencil sharpener (straight out of elementary school) and a 50’s era Smeg fridge filled with very cool goods (as well as a nice selection of hip reading material). I have stayed in some very swanky places (like the Thompson properties in NYC) and some very economical properties in NYC (like Pod) – I have to say this is probably one of the cooler places I’ve stayed, the folks who put this place together did not miss any little detail and everything here is decidedly very, very cool. Yes, maybe I do not need those things for a good night’s sleep but for some reason they make the experience a lot more of an escape from the status quo of what one is used to in a 'normal' hotel room. For me, this was very much appreciated! I am not sure what size room by beau booked – but we had a king size bed with flannel top sheets and I had to say this was one of the largest rooms I had ever been in in NYC, and I have stayed in a variety of rooms in this town at a variety of price points.", "user": "Tomtbjj", "date": "May 23, 2013", "id": 161576334}, {"rating": 5.0, "title": "Fun and Funky Hotel in Trendy Location!", "text": "I loved the pivoting flat-screen TV – not so much the view of the alley (it is NYC). That said, I heard the street side comes with LOTS of street noise (but in old buildings you should ALWAYS expect noise). I was here in December and the room has an old school heater – it was difficult to get the room to a suitable temperature where I ever felt warm, and since this is NYC it’s not like we were spending a whole lot of time hanging out in the room – but it was a bit problematic when sleeping. The flannel sheet is just a flannel sheet, so winter felt chilly here. If I could make one suggestion – it would be to put an actual fluffy, warm comforter under that flannel sheet so guests could stay warmer (we requested an extra blanket, never got one). Our room also had a really, really funky odor to it – musky mold smell. We had requested candles, deodorizer – anything to get rid of it, but the hotel didn’t have anything. Finally, I went to Duane Reed and bought a few candles and a plug-in deodorizer to mask and hopefully burn off the smell (it worked a little, but that smell still overpowered anything we used to try and combat it).", "user": "wcastleman", "date": "May 17, 2013", "id": 160982165}, {"rating": 4.0, "title": "Trendy hotel, nice rooms", "text": "Our room had a stall like shower that was all very steam punk with very cool toiletries and cool slogans on the toiletry holder and mirror. The shower curtain was odd and water definitely got out on to the floor, but whatever – that’s what towels are for. What is worth mentioning here is our room only had a shower (which is typical for an NYC hotel room) and it was a rain shower head. My beau LOVED this – I on the other hand, being a girl who doesn’t get her hair wet every day, had to work out some odd bathing logistics. So, I am noting this as something for the hair-minded to be aware of. I am not sure if every room has a shower like this, so if you don’t want to get your head wet (or bend like a contortionist when you shower to avoid getting your head wet) – you may want to call ahead and see if there are any alternate options (otherwise make friends with a good quality shower cap). My only other “girlie” observation is that the rooms (and bathroom) are a bit dark with very few lighting options – which is all very fine and awesome up until the moment when you want to get dressed and maybe even apply some make-up. I was fine with it until I was getting ready. Even during the day the rooms are pretty dark.", "user": "gordor10", "date": "May 15, 2013", "id": 160847958}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "We had a four night city break in NYC for my lovely Jen's Burpday... we rocked up to the ACE and there had been a hitch with the booking... (we had gone through lastmnute, who had arranged the ACE through travelocity.... and they had us booked into a bunk bed room.", "title": "We Loved NYC... and a big part of this was our love of the ACE!", "user": "StillJustJones", "date": "January 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 150651612}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "whollop. sinking feeling.", "title": "Lives up to the Hype", "user": "arcadelt7777", "date": "January 24, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 150526012}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "Absolutely gutted. I'd even bought a heap of special records with me to play to my lovely Jen on her Burpday as I'd heard there was a record player or guitar in every room. Not so for the budget options I'm guessing.", "title": "Really enjoyed my stay", "user": "LareinaK", "date": "January 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 150376957}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled solo", "text": "We thought we'd booked a double room.... Oh that horrid sinking feeling....", "title": "Ace In The Pack", "helpfulness": 4, "user": "TrevorHall", "date": "January 22, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 150279147}, {"rating": 3.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "Then Ta-Da!..... Ace staff to the rescue. Jenny on the desk pulled out all the stops to (a) sort us a different room that suited our needs as a fresh young couple, although she could not arrange a room with a record player (which was a shame) and (b) provide outstanding and genuinely personal customer service our whole trip... (Jenny, clearly good at her job, remembered our names, paid attention to us and went the extra mile at every opportunity. )", "title": "Great image & decor, poor costumer service!!!", "helpfulness": 2, "user": "mgmpg", "date": "January 21, 2013", "detail_rating": {"service": 1.0, "cleanliness": 2.0, "value": 4.0, "sleep": 2.0, "rooms": 3.0, "location": 4.0}, "id": 150235653}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled on business", "text": "Love love love this hotel. It has such unique character from the minute you walk in the door. The lobby is buzzing all hours of the day with people sipping coffee and working on their laptops during the day and people cocktailing and listening to a DJ at night. Each little piece you are given has a lot of thought and design in it, from the room key, the internet access notes, the mirror in the bathroom of your room and the stationary. The room I stayed in was a bit small, but totally fine for 1 person or 2. It felt like a little comfy studio apartment in NYC. It's pretty close to walk to Harald Square and Times Square or Rockefeller - like a 15 - 20 minute walk. I felt safe, comfortable and totally a New Yorker for my 2 night stay there. I really can't wait to go back and want to stay there again. If you like staying in a fun, unique, young and typical NYC hotel this is the place. Forget the Hilton or Hyatt. Ace is the place!", "title": "NYC Ace's!", "user": "Mamitaumita", "date": "January 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 150198288}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled with family", "text": "Had the most wonderful 5 days in New York, treating my mum for her birthday as a surprise! And wow what a stay. From the guys greeting you outside, to the concierge staff... they all went over and beyond for the best service in every way. Upgraded room on arrival, flowers and a Happy birthday card awaited my mother in the room. We had the most fantastic view of the Empire State Building from our window. They granted my earlier request of a higher room, and away from the elevators (noise reasons) couldn't hear a thing!! Perfect location too, away from the hustle and bustle of midtown, but close enough to walk in if you want along 5th Ave and to flatiron. The room even had a LP deck and Guitar! The bed was even comfier than mine back at home!The bathroom had fantastic products as well as a rain head shower and big bath. As most people know rooms in NYC are usually that spacious but this was huge in comparison to previous hotels I have stayed in. I have stayed in many many hotels in New York and so far this has been my favourite. The lobby is full of people on a daily basis and has a real 'lived in feel' and from our floor (9th) we could not hear a thing. Can't wait to return to the ace!", "title": "Couldn't want for a better stay! Becomes an instant Favourite in NYC", "helpfulness": 1, "user": "Laurendyer", "date": "January 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 150164123}, {"rating": 3.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "Echo positive comments - cool hotel, great bar/lounge/lobby/restaurant. All why I came back again for second time in 6 months. The rooms are comfortable though poorly lit (form over function here) they are very clean - kudos to housekeeping. WALLS AND WINDOWS ARE VERY THIN. Could hear every conversation in the hallway and every car horn outside. But it's NYC - I was willing to overlook since it comes with the territory though soft -close doors wouldnt hurt- easy fix.", "title": "Better the first time", "helpfulness": 1, "user": "Izems", "date": "January 21, 2013", "detail_rating": {"service": 2.0, "cleanliness": 5.0, "value": 3.0, "sleep": 1.0, "rooms": 4.0, "location": 4.0}, "id": 150155758}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled with friends", "text": "Biggest complaint is that the customer service is inconsistent. Guy checking us in couldn't even get our room number right sending us all over the hotel. Complained about a very loud party down the hall and got attitude when called the front desk - at 2am- and security \"tried\" to quiet the partiers down but as soon as they left the noise went up again with no follow through. Finally at 3 am party stopped. What did I get under my door, a single coupon for a cup of coffee and an apology note. The hotel needs to remember it is a hotel not just a cool \"scene\" and not tolerate this kind of disturbance. I wish I could stay here again but cannot - hopefully the Ace will go back and revisit how it can better handle its noise policy and remind staff that over -attentiveness goes a long way in making guests feel comfortable.", "title": "Loved it", "user": "milenadj", "date": "January 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 150129249}, {"rating": 2.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "Great location, happening place, very clean room as extremely nice staff. We stayed there just before hurricane Sandy hit New York. We were trying to change our flights and staff was completely understandable of situation, booking extra days and then canceling it after we found earlier flight. Although I was expecting very small rooms, actually medium room was quite OK. Don't miss Stumptown coffee shop downstairs!", "title": "Too noisy", "helpfulness": 4, "user": "TNEG", "date": "January 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 1.0, "rooms": 4.0, "location": 4.0}, "id": 150066400}, {"rating": 4.0, "stay_parameters": "Stayed February 2013", "text": "Coming from PDX, AceNYC was like a home away from home. You know what I'm referring to: modern lodge cool, up-cycled and found accessories, hipster graphic culture, put-a-pig-on-it food...it's all there. It's lively downstairs, it's pose-y, and a wee pretentious by trying hard NOT to be pretentious...but a cool scene none the less. I remember back in the day when the Soho Grand was where all my designer colleagues stayed. Nope, now it's here - how things have changed!", "title": "Portlandia in NYC", "user": "keryninbali", "date": "February 11, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 151936580}, {"rating": 4.0, "title": "Trendy, cool, but crowded.", "text": "In a place like this, you don't expect 'corporate business travel' amenities and service - it's a boutique hotel after all. But I was a bit miffed by my first cramped room, dismal view and broken TV set in room 506. Both my colleagues were upgraded to medium rooms, so I asked to be moved and I was given another available (though slightly bigger) Small room. It was an easy ask and pleasant experience, once I got past the faint smokey smell in the hallway, the room key that kept demagnetizing, another non-functioning TV, and equally depressing \"view\" of Room 528. Ugh. But, whatever, it's still a comfy bed and bigger room than I had ever had at the Soho Grand, the Hudson, or Hotel on Rivington. It's just that those small annoying inconveniences are a drag when you've been on the road for two weeks.", "user": "PHenryxx", "date": "February 9, 2013", "id": 151777889}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled with friends", "text": "Anyhow, would I stay again? Probably, because I enjoy the vibe and aesthetic. But I suppose you don't necessarily stay at a hotel like this expecting an impeccably polished 5-star experience.", "title": "The coolest hotel", "helpfulness": 1, "user": "bpal12us", "date": "February 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 151485337}, {"rating": 4.0, "title": "Hipsters unite", "text": "This place is too cool for school! Arrived and was upgraded to the loft room. This was awesome and unexpected. Staff super friendly and very attentive to detail otherwise leave you alone to enjoy the place. The oyster bar called \" the john dory\" was great and both resturants do room service in the hotel. Location is nicely located with a surplus of things to see and do within a 10 minute walking radius. Only negative was the lack of seating space in the hotel lobby.... People just show up and use the free wifi to run their business, in a nice setting of trendiness for the entire day... Which means its near impossible at times to use the lobby facilities as a paying customer at the hotel. Nice place and great location that we enjoyed for our 10 days stay.", "helpfulness": 1, "user": "Christy L", "date": "February 5, 2013", "id": 151467785}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "Cool hotel, you basically don't need to leave the building: two great restaurants, great bar with beautiful people and amazing coffee shop!!", "title": "its different", "helpfulness": 1, "user": "retiree72", "date": "February 3, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 151301847}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled on business", "text": "This is my 5th trip to NYC, some for business and some for pleasure. This particular trip was for business and my boss recommended I stay here. I am a female sales professional in my late 20's and I stayed at the ace for 5 nights in late January 2013. My reviews aren't usually this long, but I will tell you about my stay because I have mixed feeling about the hotel and it will really depend on what's important to you as there are great things and not so great things.", "title": "The Good and Bad-Mixed Feelings, but still 4 stars", "helpfulness": 1, "user": "Winter G", "date": "February 2, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 151241859}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "The location is really good, I would just head more towards 5th and Broadway. The lobby and check-in desk are really cool, they even have a photo booth in the lobby. I arrived on Sunday afternoon and was placed on the 8th floor, I believe in room 821. The room is small, but you're in NYC so expect it. It is however, the smallest NYC room I have ever stayed in, but to ACE's credit there are bigger rooms. The space was fine for me as I was alone. The rooms are definitely different, almost like a 1920's-40's army chic is what I kept calling it. The color scheme is black, white and army green...somehow it works! They are great at paying attention to detail; for example, they have restored the old faucets and other characteristics from when the hotel was originally built or renovated a long time ago. One thing to note is if you have a lot of clothes to hang, there is not a wardrobe or closet, so your clothes do hang from a extending bar on the wall. The shower is small because you can really only use one end due to the rain shower; however, the rain shower and water pressure are great! But,I am 5'3\" and petite and even my arms kept hitting the shower curtain and water would spray out onto the floor as I was washing my hair, so I can't imagine being a bigger person in the shower. Minor, but something to note. Then that night, I had one of the worst nights of sleep ever! The walls are VERY thin and you can hear every single noise outside and in the hallway. I have stayed in Manhattan all five times I have been to NYC and some have been on the street side and I have never heard noise like this before. I slept with my pillow over my ears the entire night and didn't fall asleep until about 3:30am. It sounded like dump trucks and garbage trucks having a party outside of my room all night, cars honking even at 3:00am and I could hear every conversation clearly from the workers outside...it was miserable. I am a lighter sleeper, but I think this would have kept almost anyone up! Also, I was 2 doors down from the elevator and it chimes fairly loud as well.", "title": "An interesting find", "user": "pop1990", "date": "January 30, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 151050047}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "The next morning, I went downstairs and nicely explained what happened and the staff were very nice and said I could change rooms whenever it was best for me, which was at my lunch break. They helped me with my bags and moved me to the 11th floor to a VERY interior room. What a difference, it was like night and day! I was far from the elevator and facing the \"courtyard\", which means you're facing other parts of the hotel and the view is terrible. But, I was totally fine with this because this room was quiet and the rest of my stay I slept like a baby (even better than I do at home). There is complimentary internet, which was very convenient. There is a flat screen TV on a swivel, but only 30-40 channels. I don't watch much TV, so it wasn't a huge factor for me, but it would have been nice to have HGTV or TLC or something, but I did have food network. The desk is small, but was plenty for me...it depends how much work you would be doing.", "title": "nice, original and affordable in one", "user": "Hanshja", "date": "January 27, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 150747205}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled solo", "text": "The lobby is packed all of the time and has a fun, young vibe that I really enjoyed. During the day there are people having casual business meetings (some of co-workers do this here) and people on their laptops. At night time, it turns into a hispter happy hour. On Thursday night, there was even a line outside of the hotel for non-guests to come and drink...it's packed! There is a coffee shop that I never had the chance to enjoy, but there is always a line. I heard the coffee is great from several people and again, it's unique and always busy. I had room service 3 times for an appetizer and thoroughly enjoyed it. The restaurant attached to the hotel, The John Dory Oyster Bar, is also delicious...I have written a separate review for there. In short, some of the best oysters I have ever had! When you walk into the hotel, there is a place to buy flowers...cute, unique touch. I did not have the pleasure of having an empire state building view, but it may have been the room type/price I selected, but I have some really cool pictures from people that have stayed here. Even if you don't have that view, walk a couple blocks towards 26th and 5th Ave and you can see it everyday! In the end, I enjoyed my stay!", "title": "Great stay, looked after well as single traveller", "helpfulness": 2, "user": "HeartTravelUK", "date": "January 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 150730034}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled solo", "text": "Having been to New York before I was so excited to be going back and spent along time reviewing and reading up on different hotels.", "title": "great ace hotel stay", "user": "utt959", "date": "January 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 150709026}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled on business", "text": "I ended a business trip to NYC with a one night stay at the Ace on 29th & Broadway. I usually stay more in midtown near Columbus Circle area which is close to my company's building, but I was curious about the neighborhood around the Ace after going to a party at the NoMad Hotel on my last biz trip.", "title": "Aces for the Ace", "user": "Farmerica", "date": "June 8, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 163404906}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled solo", "text": "I arrived around 430pm and was greeted by a doorman as I entered the foyer. The lobby is setup like a comfortable coffeehouse lounge with mismatched sofas, loveseats and chairs and long wooden tables. The coffehouse vibe was reinforced as a scanned the room and noticed it was mostly 30-somethings with faces buried in laptops and iphones populating the area. There is also a vibrant Stumptown coffee off the lobby providing the supply of hot liquid.", "title": "Very fancy but don't forget your wallet", "user": "fripouille715", "date": "June 8, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 163393673}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled with friends", "text": "It took me about a minute to determine exactly where the check in desk was-to the right in a nook as you enter. Check in was smooth and friendly. I asked for an upgrade and was given a medium king ( I'd booked a small king for $242) for an additional $35.", "title": "Truly Unique NYC hotel", "user": "Travelboi87", "date": "June 8, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 2.0}, "id": 163374863}, {"rating": 2.0, "title": "Too cool for school .....", "text": "My room was on the sixth floor and was a pleasant surprise. The room was decorated in dark brick and gray walls with a black carpet. There was an acoustic guitar in the corner! It had a nearly full sized refrigerator as the \"mini-bar\"; full of beer, wine, and liquors. There was huge window for lots of light and it had sturdy wood shutters ( no shades or curtains) Seating was two desk style chairs a recycled wood table. There was no closet but a long metal cabinet and a clothes rack with good wood hangers near the door and a horizontal cabinet on the wall facing the bed with the TV.", "helpfulness": 3, "user": "Jukka77", "date": "June 7, 2013", "id": 163270547}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled solo", "text": "The size of the TV would be one of my three complaints about the room; it was, I believe, a 24\" or 27\" screen, which seems tiny compared to what you get in most hotel rooms these days. My other complaint would be with the bathroom shower. It took nearly five minutes to get hot water and the showerhead was a rainshower type model; just not my favorite as a personal preference. And finally, the ventiliation in the room was not great. It was good that the window opened ( though not completely). The room was a little humid when I arrived and the a/c didnt really have an impact until I dropped it to 65-degrees. It was also a bit noisy.", "title": "Cool", "helpfulness": 1, "user": "rscottwallace", "date": "June 6, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 2.0}, "id": 163221928}], "location": {}, "stars": 3, "variance": {"poor": 37, "average": 82, "very good": 318, "terrible": 17, "excellent": 399}, "aka": "Ace Hotel New York City", "slim_ranking": 0.273137697517, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.5}, "description": "Deluxe room at the Ace Hotel. Spacious room with high ceilings, large windows and large bathroom."}