{"user_rating": 5.0, "review_count": 27, "name": "Achaleven Byre", "reviews": [{"rating": 5.0, "title": "Achaleven Byre", "text": "We were given a wonderful welcome from Mrs Povey, we arrived later in the evening than we had planned and were delighted and relived that after our long journey, that there was milk and juice in the fridge and a excellent selection of muesli's, cereals, nuts and fruits, as well as various jams, tea and coffee.", "user": "keencyclists", "date": "July 21, 2009", "id": 35345012}, {"rating": 5.0, "stay_parameters": "Stayed February 2009, traveled with family", "text": "The Byre was well decorated and beautifully clean.", "title": "Great self-catering accommodation in a beautifully rural setting.", "user": "BoriVanFamily", "date": "March 3, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 25534728}, {"rating": 5.0, "title": "Excellent Self Catering facility in Connel", "text": "As for the area, very beautiful and tranquil. My daughter and I are keen cyclists and armed with our '25 cycle routes Argyll and Bute' Erl B. Wilkie, we spent everyday on some of the most stunning rides we have ever had, along roads where cars rarely passed us. We were very sorry to leave and look forward to returning.", "helpfulness": 1, "user": "Trolleybus622", "date": "October 1, 2008", "id": 20533724}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "Mrs Localshopper & myself had a 3 night stay at the byre in early July. We can only agree with the positive comments everyone else has made - the accommodation is bright, clean, well equipped and comfortable and Beata was a lovely host.", "title": "Excellent accommodation at a reasonable price", "user": "Localshopper", "date": "August 12, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 74880567}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "Garmin sat nav users should beware - your unit will not guide you to turn under the narrow railway bridge, it will lead you to an unmanned level crossing. This way will still lead you to the property, but it's not the recommended route! Apparently TomTom units direct you correctly.", "title": "Really nice place, peaceful and everything you need", "user": "calumrobertson", "date": "April 6, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 60506672}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "The Byre is a lovely place to stay. It has been lovingly converted and a lot of care, attention and pride has obviously been put into it and into making sure guests have a really nice stay. Perfect for a couple, of a small family (as there is a sofabed in the livingroom) it has all that you need for either a weekend stay or longer. The owners and taken the time and effort to provide things like cereal, nuts, seeds etc as well as tea, coffee and lots of fresh milk. There is a nice flatscreen tv, sky and dvd player, the bathroom is very clean with a good shower and toiletaries provided. The bedroom is comfy and has plenty storage. The kitchen has everything you could need to make a full meal and really everything has been catered for. The setting is great, very peaceful and only a 10/15 minute drive to Oban. Would certainly recommend and go again.", "title": "'Home from Home'", "user": "bencorlew", "date": "February 14, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 55927929}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "I would definately recommend a visit to Auchaleven Byre. My husband and 12 year old son stayed for a week-end. It was very clean and comfortable. It was also nice and warm, despite the weather! Beata was very welcoming and provided us with fresh milk and cereal, also tea and coffee. Much appreciated! Beautiful location and good base for Oban. I hope to return and have recommended it to all my family and friends.", "title": "Best Self Catering Ever!", "user": "foosty", "date": "January 17, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 53678804}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "This is probably the best self catering accomodation I have ever used.", "title": "hidden gem", "user": "robmac13", "date": "November 16, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 49362896}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "variance": {"poor": 0, "average": 0, "very good": 1, "terrible": 0, "excellent": 26}, "aka": "Achaleven Byre Connel, Scotland - Oban", "slim_ranking": 1.0}