{"user_rating": 4.5, "review_count": 386, "name": "Acqualina Resort & Spa on the Beach", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "Great rooms, great space, wonderful beach and service on the beach. Average food at the restaurants, but a small point. Few issues with housekeeping - we noticed broken glass on our carpet when we checked in, and it took them 2 days to vacuum it out, but in other ways housekeeping was on point and answered our requests promptly and eagerly!", "title": "Wonderful Stay, somewhat overpriced", "user": "NYCtravel", "date": "January 12, 2010", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 53277542}, {"rating": 3.0, "stay_parameters": "Stayed December 2009, traveled with family", "text": "We really loved the beach. Never sat at the pool, as it was overrun by tweens out of control (but we are not pool people so that was not an issue). They require you to wear bracelets to the beach which I thought was a bit tacky, but I just asked them to make it loose, took it off and affixed it to my beach bag.", "title": "lovely hotel and staff but not equipped for busy periods", "helpfulness": 3, "user": "Adele44", "date": "January 11, 2010", "detail_rating": {"cleanliness": 5.0, "value": 2.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 53187556}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled solo", "text": "We really liked Sunny Isles, as we did not want to be in the middle of South Beach, and liked the quietness.", "title": "Incredible!", "helpfulness": 1, "user": "bestbed", "date": "November 24, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 49980728}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled with friends", "text": "Is it worth the price??? I thought it was on the expensive side, but for us, the rooms and especially the beach service were really important, so we would definitely stay again. In fact I have tried to make reservations twice again, but they were booked up, so we decided on another venue than Miami. (If anyone knows of another similar property please let me know!)", "title": "Can't fault it!", "user": "Batti66", "date": "November 24, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 49960836}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "We went to a few restaurants, one memorable one was Tatiana! If you are looking for an interesting experience, I urge you to go - preferably with a group of people. If you like to dance, eat and drink, you will have a good time (it is really loud, so be prepared).", "title": "Absolute Perfection found at the Acqualina!", "helpfulness": 1, "user": "sunkissed518", "date": "October 14, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 46810903}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "I just returned from my third stay at the Acqualina, and I am pleased to report that the resort is as beautiful as ever, and the level of service remains high. By now there are newer (and perhaps trendier) spots in the area, but the Acqualina is still the one to beat -- gorgeous rooms, lovely common areas, a great pool & beach, and excellent service.", "title": "Third Stay, Still Excellent", "user": "DrewBill", "date": "July 9, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 3.0, "service": 5.0, "rooms": 5.0}, "id": 34330594}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "A particular attraction for me is that one of their three pools is an adults only space, somewhat isolated from the other pool areas. I appreciate that they offer a nice, quiet alternative to the usually \"family friendly\" world of Florida resorts.", "title": "one of the best hotels of the world", "helpfulness": 1, "user": "firstclassflyer007", "date": "July 3, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 33814558}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "The only drawback of the resort is the location -- it's somewhat distant from the glitzy nightlife of South Beach and the party scene of Ft. Lauderdale. Beyond the hotel's own (excellent) restaurants, there are very few dining/nightlife options in the immediate area. And I would say the main bar at the Acqualina is rather sedate at best. So if a vibrant nightlife is important to you, this might not be your best choice ... but if you're looking for a relaxing vacation in an elegant resort setting, this hotel cannot be beat.", "title": "True Five Star Facility and Service", "user": "BertilleBun", "date": "July 1, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 33647093}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "absolutely true, usually four seasons, mandarin, ritz , LHW, etc , im used to this type of resorts worldwide , acquaelina beats all , trust me.", "title": "True Luxury...great change from South Beach Scene", "user": "ATLHotelLuva", "date": "June 4, 2009", "detail_rating": {"cleanliness": 5.0, "value": 2.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 31597798}, {"rating": 4.0, "stay_parameters": "Stayed February 2009, traveled with family", "text": "When you arrive to this condo hotel of 45 floors ( the hotel is only 100 rooms )the palatial entrance is full parking with masserati, ferrari, rolls, lamborghini etc, you start to know the type of resort you are in.", "title": "Finally a resort that measures up!", "user": "rknatty", "date": "May 21, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 3.0, "rooms": 5.0}, "id": 30477905}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "Acqualina is amazing, the service is very good, the room was gorgeous. I have stayed at many hotels in Miami but this one can not be compared. But you won´t enjoy the hotel if you are looking for party, its a calm, peacefull place.", "title": "Just perfect", "helpfulness": 1, "user": "maribr", "date": "October 7, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 46101366}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "We booked an intercoastal room for our Septemer stay at the Acqualina. The room was lovely & spacious, offering great views of the city/intercoastal waterway. All aspects of service were superb, including valet, housekeeping and pool/bar service.", "title": "Loved the Acqualina!", "helpfulness": 1, "user": "Huddy99", "date": "September 28, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 45221962}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "The location is perfect for people who want a quiet beach environment, yet close enough to shops/restaurants in the area. We enjoyed lunches at the pool restaurant and opted to try area restaurants for dinner. Although we did order room service for dinner once & it was great.", "title": "Absolutely Beautiful!", "helpfulness": 2, "user": "Loloan", "date": "August 24, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 38655785}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled with friends", "text": "The Acqualina excels in service and overall atmosphere. We wouldn't hesitate to return.", "title": "Good for the family or couple vacation.", "helpfulness": 3, "user": "tkujimmylee", "date": "August 19, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 5.0}, "id": 38188494}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "We just returned from a long weekend at Acqualina and it was fabulous! We stayed in a 1-bedroom ocean front suite, which was spectacular!!! I had spent the previous week at the Fontainebleau in Miami, which is none too shabby after it’s billion dollar renovation but it’s huge so that’s what I liked the most about Acqualina…its size. It’s small, compact and very manageable.", "title": "Elegant first class hotel", "user": "87LSC", "date": "August 9, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 5.0}, "id": 37107005}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "Beyond impeccable! Everything there is meant to make you comfortable. We had one of the cheapest rooms, low floor, no view, yet it was one of the finest rooms I've ever stayed in! Service is perfect from the minute you pull over your car until you leave. Pricey, but this place is in a class of its own", "title": "Everything you might expect", "user": "ABD119", "date": "April 17, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 28194446}, {"rating": 4.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "I stayed here as a \"weekend getaway\" with my husband on March 21. First I went to the spa. The spa had beautiful, clean facilities - steam room ,sauna, special showers, changing areas, relaxation rooms. However, it soon became clear that the overcharging of spa services paid for the large overhead. I had a $225 Balinese 90 minute massage. Honestly, worth every penny. Unlike any massage I have ever had. But, the facial, for $150 was vey disjointed and poorly given. There were a lot of stops between next steps and my face felt like Ralph Macchio in the Karate Kid - wax on the product and then wax off. Not very relaxing and my skin didn't look like I just had a facial. Lastly, I had a \"time saver\" manicire and pedicure for a combined $150. The room was beautiful, and it looked out over the ocean - you even laid down while your feet were soaking and manicure. You were also alone in the room - another bonus. But the treatment ended up being nothing more than a polish change - and for $150 it was not worth the money.", "title": "BEAUTIFUL - BUT A BIT OVER-PRICED", "user": "ExperiencedTrvlr13", "date": "March 23, 2009", "detail_rating": {"cleanliness": 5.0, "value": 2.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 26671585}, {"rating": 4.0, "title": "Very beautiful grounds!", "text": "We then checked into our super clean, spacious room. We had a \"Deluxe Intercoastal\", which I picked over the \"Intercoastal\". if you really want a water view, spring for oceanfront. The extra $100 paid for the \"Deluxe Intercoastal\" failed to mention that you would be looking over gas stations and the strip before your intercoastal view. That particular upgrade was not worth it. The room itself was great, but no different than what you would find at most Four Seasons or Peninsula hotels. I think for $775 I was expecting a bit more - maybe a TV in the bathroom, a better bed? I don't know. In this economy, I couldn't really explain why this room was worth $775 + tax.", "user": "PearlCrystal", "date": "March 22, 2009", "id": 26594979}, {"rating": 4.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "We also dined at Il Mulino New York. This exceeded my expectations. Although pricey, the service was outstanding and the true Italian food sublime. Definitely worth a return visit.", "title": "gorgeous place, good service, a bit isolated, spa is only okay", "user": "manoonthego", "date": "March 3, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 25522742}, {"rating": 5.0, "stay_parameters": "Stayed January 2009, traveled as a couple", "text": "This hotel is definitely luxurious, and great service. However, I think their price points are exceeding what you actually get for the money - so I would say the value is not there. If value is of no importance, then this is the place for you. If you want to spend $775 on a room and not wonder why you are paying the $775 - the benefits are clearly visible - then I would not recommend this hotel. The choice is yours.", "title": "Heaven on the beach", "helpfulness": 1, "user": "jennaray", "date": "January 26, 2009", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 23918260, "likes": {"liked": "— Luxury"}}], "location": {"country": "United States", "city": "Sunny Isles Beach"}, "stars": 5, "variance": {"poor": 7, "average": 14, "very good": 49, "terrible": 5, "excellent": 311}, "aka": "Acqualina Resort & Spa On The Beach Hotel Sunny Isles Beach", "slim_ranking": 0.125, "detail_rating": {"service": 4.5, "cleanliness": 5.0, "value": 4.5, "sleep": 4.5, "rooms": 5.0, "location": 4.5}, "description": "Acqualina Resort & Spa on the Beach is a place where the charm of a Mediterranean villa meets elegance on the beach and a recipient of the coveted 2013 Forbes Travel Guide Five Star Award, 2013 AAA Five Diamond Award for four consecutive years and 2012 Andrew Harper's Reader's Choice Award for Top 20 Beach and Family Resorts. A seaside luxury haven located on 4.5 beachfront acres in pristine Sunny Isles Beach, Acqualina Resort & Spa features 98 impeccably appointed guest rooms and suites and 188 residencies with breathtaking views of Atlantic Ocean. Step into a world of luxury with unprecedented accommodations and service, world-class dining destinations, including Piazzetta Marketplace and Restaurant and Il Mulino New York, three oceanfront swimming pools, spacious boardrooms, and an innovative marine biology-based children’s program. A variety of lavish interior and exterior venues provide an ideal background for opulent weddings and memorable events on the lush property grounds boasting 400 feet of stunning Atlantic coastline. Acqualina Spa by ESPA, the first ESPA-branded spa in the United States, provides guests with an exquisite 20,000-square-foot, two-story tranquil sanctuary of excellence and relaxation set in a class of its own offering eleven multi-functional treatment rooms, four spa treatment rooms, and an extravagant private spa suite for two, along with the opportunity to enjoy the beautiful outdoor terrace complete with a spa pool, heated jet pool, and Roman waterfall – all set against the gorgeous backdrop of the Atlantic Ocean."}