{"user_rating": 4.0, "review_count": 688, "name": "Adaaran Select Hudhuranfushi", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled with family", "text": "We've just come back from spending a week on this beautiful island & like others who have commented before, we were slightly worried about some negative responses. We needn't have worried - we had an amazing time. The staff we came in to contact with were friendly & helpful. Our beach bungalows (225 & 224) were kept beautifully clean & were nicely painted. We had satelite TV if we wanted to watch it (we didn't), the airconditioning unit was operated by a remote control that you could keep alongside your bed incase you wanted to turn the temperature up or down overnight. Every night when we returned to our rooms the top sheet had been created into an attractive shape, a really nice touch & the bedside lights turned on. We only needed a sheet on the bed as we would often turn off the air con at night. The towels were changed regularly & the outside shower was great. No signs of ants or rats, just the odd mosquito at night. The beds were firm & comfortable and we found they were a very good size with crisp linen. We were supplied with regular bottles of water, replenished with tea, coffee & powdered creamer. A mini bar was available but we knew this was at an additional cost & the main bar was not far away to walk when the other bars had stopped serving all inclusive drinks. It would have been nice to have had all inclusive drinks served all the time at all of the bars but we enjoyed our gin & tonic at the beach bar just before 'last orders'. Fresh fruit juice was not included but the mango juice was delicious. Alongside our room we were slightly aware of the generator providing power for the island but this didn't spoil our stay & is a necessity for the island. We thought the choice of food was amazing & very delicious. Breakfast included a choice of full english style, a freshly made omlette you could watch being made, some fresh fruit as well as tinned, cereal, porridge, continental cheese & meats, croissants & danish pastries, lunch & dinner were equally delicious & the choice was varied, having a theme most nights. Our waiter for the week, Afrah, was attentive & fun. It was my birthday whilst we were away & the waiters sang, a cake was provided & the table was beautifully decorated with flowers & a happy birthday. We didn't use the gym but the watersports team were fantastic & very helpful & lots of fun. The beach bungalows look amazing & they organise a tour but you obviously pay more for an exclusive area to live & eat in & it is gated with a security guard. We saw no obvious signs of rubbish other than the occasional bottle being thrown to one side by an ignorant tourist or passing boats & the beaches & paths were swept twice a day. We enjoyed a wonderful massage at the coconut spa & a trial dive. The snorkelling was wonderful, particularly at the reef 'drop off'. You were able to snorkel off of the jetty & this was particularly impressive but you needed to check with the diving school re timings & current. We swam with turtles, eagle rays & a spectacular array of the most beautiful coloured fish. All around the island there is a variety of scenery & choice of depths of water to swim, snorkel or dive in; from a very safe sandy bottomed lagoon, to fantastic reef & drop off. Like everywhere else in the world, the tide comes in twice a day so you may have to walk through more shallow water in order to swim or snorkel. We found the pool refreshing & clean with a swim up bar which we used on occasions. This was intended as a dream holiday & it delivered on every level. It was a pleasure to stay there & a wonderful introduction to the Maldive islands.", "title": "A beautiful introduction to the indian ocean. A dream holiday.", "helpfulness": 9, "user": "Cap52", "date": "February 28, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 98435762}, {"rating": 1.0, "stay_parameters": "Stayed February 2011, traveled with family", "text": "The reception staff are rude and nobody can make a decision, it goes from 'manager' to 'manager' and nothing happens!", "title": "A Grotty hole to be avoided if possible", "helpfulness": 12, "user": "catherine8888", "date": "February 27, 2011", "detail_rating": {"service": 1.0, "cleanliness": 2.0, "value": 1.0, "sleep": 2.0, "rooms": 1.0, "location": 3.0}, "id": 98264055}, {"rating": 1.0, "stay_parameters": "Stayed June 2010, traveled with family", "text": "On arrival after a 10 hour flight, one hour wait at the airport for the sea taxi and a 50 minute boat ride, we arrived at the hotel. We wheeled our luggage down the pier to the foyer, a dingy even at 10am open plan area with bar and pool. A very surly woman took our details and gave us a key to our beach villa rooms 152-153, and then walked off. I called her back to ask her where the rooms where, and she pointed in a direction.", "title": "Extremely poor and unsympathetic management", "helpfulness": 6, "user": "rjmenzo", "date": "February 19, 2011", "detail_rating": {"service": 1.0, "cleanliness": 2.0, "value": 1.0, "sleep": 2.0, "rooms": 2.0, "location": 3.0}, "id": 97236278}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "The rooms were a bit of a walk form the reception, by which time our luggage had been taken, we assumed to our room. Unfortunately the luggage must have taken the long way around as it didn't arrive for an hour or more.", "title": "Ignore the negative reviews - this place is great", "helpfulness": 10, "user": "Lindylou1801", "date": "January 31, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 95054234}, {"rating": 4.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "The room was badly pained in mustard yellow, the paint on the ceiling was peeling off. The beds are small and hard, so if you're a bigish guy it will be too small. There are no home comforts just a sheet on the bed and a very small cover. There is free tea and coffee with powdered creamer and a minibar that is NOT INCLUDED- $6.50 -$8.50 for a miniture plus 13.5% tax.", "title": "Great atmosphere, friendly service", "helpfulness": 3, "user": "Tropicstraveller_11", "date": "January 27, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 94578825}, {"rating": 4.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "There is no question that Hudhuran Fushi delivers a wonderfully picturesque tropical coral atoll beach experience and that alone comes close to justifying its acceptability as a holiday destination.", "title": "Delivers on what is promised - met or bettered our expectations", "helpfulness": 2, "user": "Li_and_Vi", "date": "January 24, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 94285688}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled with family", "text": "The villas are quite spacious and are reasonably furnished and equipped - they are certainly not spartan, but neither are they luxurious. There were some elements of the room that were getting a bit tired and in need of redecoration, but this is hardly material since one spends the majority of the day outside the room. The air-conditioner was very effective, the room was clean and serviced daily.", "title": "It's a wondwerful place for relax-beautiful nature,friendly people-that's all we need!", "helpfulness": 2, "user": "BoykoShumen_Bulgaria", "date": "January 11, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 92544598}, {"rating": 3.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "At check-in we were initially allocated room 121, but following the advice of other reviews we requested and were allocated a room on the lagoon side of the island - villas around 180 - 220 face the lagoon. This very much suited our preferences, with easy access to the shallower water and coral formations and very close to the wider beach area with open views. The majority of the villas, however, are near the water and some offer other advantages like more secluded beach areas or closer to the central facilities.", "title": "boring like in any paradise", "user": "sutyrin", "date": "January 3, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 91489190}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "We opted for the all-inclusive food and drinks option and were happy with this choice. That restricted us to eating in the large buffet service restaurant - which is where the majority of people were eating, and to be able to drink beer only at the central and beach bar. If there was one change to this, I'd like to see wine available at the bars. Wine is available at lunch and dinner, and although it's a single unidentified variety each of white and red which I suspect is provided to the resort in bulk containers, both are pleasant and acceptable if not overly inspiring.", "title": "Great Resort, first time in Maldives", "helpfulness": 1, "user": "TIA&DIBBLE1", "date": "December 27, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 90790656}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "The buffet food restaurant is a challenge in more ways than one. While there are changes in what is offered day to day, the overall appearance of the arrayed food is much the same. We quickly figured out that random selection did not produce a good result, but careful choices resulted in a good variety such as curry and rice one day, meat and cooked vegetables the next, fish and chips, pasta and salad, etc. Even for a buffet restaurant, the quality of some of the food was unsatisfactory - the meat and fish was overdone, scrambled eggs were not good, and the roast and fried potatoes were disappointing. Some of the food was quite good particularly when freshly prepared at the counter such as the omelettes. The desserts generally offered a good range and the cooked pudding each night was often worth selection. There was plentiful fresh fruit every day.", "title": "Beautiful island, good infrastructure, great waves. Recommended!", "user": "Dani_Cera", "date": "December 13, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 89733706}, {"rating": 2.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "The 5-star claim is laughable. This is highly regimented, mass package tourism - a tropical ClubMed. Fine if you want that sort of thing, but for something that publicises itself as a luxury destination it is sadly wanting. Staff (with a few exceptions) were not very friendly and at times quite obstructive. Food is based on the principle of quantity over quality. I even had to argue about a mysterious bar bill that appeared on my room number when I hadn't even entered the bar all week. But it was also an indication of the sort of people the place attracts.", "title": "Very poor value", "helpfulness": 6, "user": "Bluftut", "date": "April 30, 2011", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 1.0, "sleep": 3.0, "rooms": 2.0, "location": 3.0}, "id": 106251526}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "We have just returned from this island - having spent 2 weeks, what can I say \"amazing a real paradise\". Having read the reviews and a couple being rather negative I was concerned so I emailed the resort directly who promptly answered my questions, having returned now I can only assume these reviews were written about another resort as not reflective of this one.", "title": "A fantastic resort - nothing too much trouble for the staff", "helpfulness": 10, "user": "casmary", "date": "April 17, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 104381809}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "We spent our first week in a beach bungalow, which was clean, spacious and in a wonderful location (211) the outside bathroom is an experience.", "title": "Wow what a Holiday", "helpfulness": 4, "user": "renred", "date": "April 12, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 103798930}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "We spent our second week in a water villa which was pure luxury, a huge thanks to Sundar who was our butler - nothing was too much trouble for him, an asset to any employer.", "title": "Perfect honeymoon", "helpfulness": 1, "user": "AiPphoto", "date": "April 7, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 103203549}, {"rating": 3.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "The food was varied and well presented (I hope you like fish as always on the menu) the restaurant has a sand floor which is quite unique. You are allocated a waiter for the duration of your stay who again could not help us enough (Hassam) and his chatter through dinner was always welcome.", "title": "Fantastic Holiday, but not 5*", "helpfulness": 6, "user": "82pinklady", "date": "April 6, 2011", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 103029737}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled with family", "text": "We were lucky enough to stay in the oceans villas, These are just paradise. Personal Butler, personal deck, stairs into the ocean, gorgeous decor plus supper at the Sunset Restaurant.", "title": "Awesome Holiday", "user": "Exp_Traveller_83", "date": "March 31, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 102278820}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "Special mention should go out to our Butler-SUNDAR who was absolutely awesome, nothing was too much of a trouble for him. Also the staff at breakfast and Sunset restaurant were really friendly. Food was brilliant, Breakfast could be taken anytime of the day, including on your sundeck. We travelled with an infant (6 months) which was not a problem. The beach is nice and clean, enough sun chairs for all. We unfortunately did not do any watersports so cannot comment on that. The fish feed at 9pm is also nice, witness a few small sharks. We requested a sunset facing villa and was accomadated on arrival.", "title": "Great Holiday! ignore negative reviews", "helpfulness": 7, "user": "petenchrisdover", "date": "March 15, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 100291513}, {"rating": 4.0, "stay_parameters": "Stayed December 2010", "text": "We had a brilliant holiday and would most definately return.", "title": "Mixed blessings but more good than bad.", "helpfulness": 1, "user": "Topatntails", "date": "March 13, 2011", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 100001781}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "Flight and Transfer - No problems straight off plane through customs onto speedboat 20 mins arrived at Hudhuranfushi", "title": "Superb Holiday experience", "helpfulness": 3, "user": "l_mhoward", "date": "March 6, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 99124530}, {"rating": 1.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "Reception - Sat in bar had cold drink and towel while Madi (thomson rep) sorted out room (187) 5 minute walk to room cases followed couple of minutes later", "title": "Hell on earth", "helpfulness": 9, "user": "aquarmarine44", "date": "March 1, 2011", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 2.0, "rooms": 1.0, "location": 1.0}, "id": 98586488}], "location": {"continent": "Asia"}, "stars": 4, "variance": {"poor": 50, "average": 99, "very good": 234, "terrible": 44, "excellent": 261}, "aka": "Adaaran Select Hudhuranfushi Hotel North Male Atoll", "slim_ranking": 0.397058823529, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.5}}