{"user_rating": 4.0, "review_count": 233, "name": "Adagio Muenchen City", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "This was a great stay in Munich. The hotel is only a few blocks from the main train station (Hbf) and we had no problems even though we were rolling suitcases. It is true that you pass by some sports betting and adult entertainment, but it was not seedy and we had no issues. I was surprised how large the rooms were and it was nice to have the small kitchen (which even had a dishwasher). There are 2 grocery stores within a few blocks so it was easy to get food. We stayed 4 nights and therefore did not have daily maid service (only get that for 3 nights and below) so we just left the Murphy bed down the entire time. The bed was comfortable which surprised me. There was a closet and plenty of space to store things and it seems like we even had extra room available. Our room was right outside the elevator but we never heard anyone the entire time we were there so don't worry if you get that room.", "title": "Great price, location, and stay", "user": "robstrash", "date": "January 16, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 149790705}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with friends", "text": "The room does not have wifi but does have an ethernet jack and the front desk offered us a cable but I brought my own. The lobby does have free wifi so we were able to connect our phones in the lobby and the laptop in the room. We skipped the expensive breakfast in the lobby and just bought food from the grocery store and had it in the room for breakfast. Unlike the US, stores are actually closed on Sunday so we couldn't get groceries until Monday. The Hbf is only blocks away with many food choices so that's also an option for any meal of the day.", "title": "Conveniently located clean and well equipped apartments", "user": "kanbi", "date": "January 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 148784669}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "The only weird thing I noticed was that the thermostat would go down to 18C at night even though it was set for 22 when we went to bed. I like it cold when I sleep so it was not a problem but if you don't you may want to ask the front desk how to get it to stay at 22 or whatever you prefer. Also, I was told the self service laundry was €6 for washer and €3 for dryer which seemed very high to me. Luckily we did not need to do laundry.", "title": "Great Stay x 2", "user": "Divediva22", "date": "January 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 148764124}, {"rating": 3.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "The front desk was helpful and helped us get to the various Christmas Markets. There were some employees that were definitely more helpful than others but nobody was bad. If I were to come back to Munich again the Adagio would be at the top of my list!!", "title": "Good location, poor breakfast", "helpfulness": 1, "user": "kuzcotravel", "date": "January 3, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 148732981}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "The location of these apartments is brilliant as they are walking distance from the main train station, restaurants, grocery shops and Marien Platz. The reception staff is very polite, pleasant and helpful in answering all our questions. Customer service is what a lot of hotels lack so I was very impressed! They gave us a detailed city map as soon as we got to the hotel so don’t bother queuing up for one at the tourist centre and paying for it. There were lots of sightseeing leaflets opposite reception. The apartment was very modern and clean. Kitchen was very clean and equipped with fridge, microwave, cooker and dishwasher. The kitchenette was also very well equipped with utensils which came in handy as we were in Munich for New Years Eve and New year’s day and most food venues were closed. The bedroom also had an ipod dock which was fantastic!", "title": "Great for young family", "user": "MDNTraveler100", "date": "December 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 148047926}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled solo", "text": "A service apartment comcept - nice, clean, modern. Well equipped kitchenette. A bit smaller room than other Adagios I have stayed at, but did not need the extra space. Cabled Internet only in rooms - wi-fi in lobby. Very convenient to Train station, but away from the congested, seedy, areas. 15 minute walk to old town. Overall, very nice.", "title": "Convenient to Train Station", "user": "Bob4378", "date": "October 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 143959610}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "We stayed in a Studio Apartment x 5 nights. Booked on-line from Australia ourselves. Great value for money. Staying in an apartment provides greater flexibility, and more cost effective than hotel stay. Clean, well appointed room. Staff helpful and friendly. Location fantastic - 5 Minute walk to Munchen HBF (main train station). Also convenient being close to train station for EuRail travel, Tourist Information Office, and tour collection. Would highly recommend Adagio to friends.", "title": "APARTMENT VERSUS HOTEL STAY", "user": "Europe25days", "date": "October 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 143404063}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled with friends", "text": "Booked a one bedroom apartment with a sofa bed in lounge. The sofa could be two singles as one is a trundle bed and when out not a great deal of room, however there was only two of us and therefore one got the large bed in the small separate bedroom while the other made up the sofa bed. The kitchen is only big enough for one person but that was fine and it served our purposes. Bathroom was separate and off a small walkway near the door. We ordered a back apartment away from the main street as we arrived after a 21 hour flight and needed to sleep.As it was, we were out early every day of our remaining three and back late so the size did not concern us. Everything worked fine and the shower was hot, the building is reasonably new...We expected no turn down service or linen change and we had to take our rubbish out, but that was just down the hall. Small sitting area downstairs and dining room but we didn't require either...best thing was it was only a block away from the south entrance to the main train station and a bit further to get our two day tour buses out to Bavaria and Salzberg...plenty of shopping as the Aldstadt is in walking distance straight down the end of the street..Aldi in the street, shops in the main station and takeaway eateries and this also meant we were away easily on foot with luggage to the station to head to Innsbruck. Consider the size for a family though and prices went up in the week before the Octoberfest. Fortunately we booked well in advance and got a good price. For a short stay I'd recommend it, especially if you want to flit in and out and about.", "title": "Small, convenient, but tidy and quiet", "user": "Niec", "date": "October 19, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 143180561}, {"rating": 4.0, "stay_parameters": "Stayed October 2012", "text": "We stayed in a studio apartment and the room had heaps of space and a decent little kitchen. The bed pulls out of the wall meaning that during the day you have a little lounge which to me is nicer than having to sit on the bed all the time. The hotel was really close to the train station and also to the main pedestrian centre of Munich (an easy walk). Unfortunately no wifi in rooms only wired (the hotel can provide you with a network cable). Wifi is available free in the lobby though. The hotel also provides 2 washing machines and a dryer but there is a laundromat around the corner that is half the price and very easy to use so I wouldn't bother with the hotel. Other negative was the cleaning service, if you stay 1 - 3 nights you get daily cleaning but between 4 - 7 you get nothing, not even a towel change or extra toilet paper. They say this is how they keep prices down, but I stayed 5 nights in Berlin for less and got daily cleaning so... However, I would absolutely recommend this hotel purely on good rooms and great location.", "title": "Close to train station and nice big rooms", "user": "flicky_s", "date": "October 15, 2012", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 142895446}, {"rating": 4.0, "title": "pleasant stay", "text": "Adagio aparthotel in Munich was located within easy walking distance of the town center and train station. The kitchen was a great asset to the room and was well stocked with utinsels. Breakfast is overpriced and cheaper to eat elsewhere. Room was a good size, clean, and comfortable. Staff was helful.", "user": "A TripAdvisor user", "date": "December 24, 2012", "id": 148000605}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "Nice spacious studio with all necessary equipment, with good soundproof. At night it was a little hot, but we did not open the windows because they were looking at the road. Proximity to the central train station has its pros and cons. As a whole, my wife and I were very pleased.", "title": "Sergey G", "user": "sergul", "date": "December 21, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 147839734}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "My husband, son and I stayed in a studio room herein December. It was perfect for us. We had a queen bed and a cot in the room and there was plenty of space. Mostly due to the fact the bed folds down from the wall. This sounds ridiculous but actually worked perfectly for us. It meant during the day my son had plenty of space to play. We put his cot in the kitchen area as you could close it off. The rooms are obviously very new. The whole hotel is very well designed and nicely decorated.", "title": "Great apartment hotel", "user": "Julia N", "date": "December 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 147650196}, {"rating": 5.0, "stay_parameters": "Stayed December 2012", "text": "Location is great. Right near the main train station and shopping area of town. Lots of cheap restaurants and two supermarkets near by.", "title": "Great location", "user": "SamanthaNEngland", "date": "December 10, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 147153631}, {"rating": 3.0, "stay_parameters": "Stayed November 2012, traveled on business", "text": "Only negative is wifi is only in the lobby and restaurant.. I was happy to sit in the restaurant and use the wifi though.", "title": "Good value, if a little odd", "helpfulness": 1, "user": "The-Elusive-Thnith", "date": "December 10, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 147133712}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled with friends", "text": "Stayed at this aparthotel during Oktoberfest. The room was the studio which was adequate for two people. The bathroom was large enough, there was a cute little kitchen for cooking (although you are up for 1500 euro if you set the firealarm off - which could be done easily) and the beds were very comfortable (save for not enough pillows). There was an iron and safe in the room. The staff at the hotel were lovely and were happy to give you directions and suggestions. The street was a little noisy so a room at the back would be suggested. On the day I checked in the Oktoberfest parade was on so could not gain access to the hotel. After sitting for a while, I managed to see a lady on the street who worked at the hotel and who managed to get me and my luggage across the road. They also let me checkin early which was great. There is no wifi in rooms, only in public areas. The room is only cleaned daily if you stay LESS than 4 days which is odd, but we are clean people and happy to pick up after ourselves. You do have to pay for fresh towels if required.", "title": "Perfect Oktoberfest location", "user": "sydcarnie", "date": "October 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 142360293}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "The hotel is located near Haufbanhof train station which goes direct to airport. There is also an underground stop very close.", "title": "Great stay - again!", "user": "winwander", "date": "September 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 141416470}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "For those looking for Oktoberfest accommodation, I couldnt recommend it higher. It was less than a ten minute walk to the grounds which is great so you dont have to battle all the commuters on the underground. I also found that the room was cheaper per night for two people than paying for two at a hostel at that time of the year. Would def stay here again.", "title": "Cute and quirky with a great location!", "user": "Morjen", "date": "September 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 139477667}], "location": {"country": "Germany", "continent": "Europe"}, "stars": 3.5, "variance": {"poor": 8, "average": 38, "very good": 116, "terrible": 8, "excellent": 63}, "aka": "Adagio Muenchen City Hotel Munich", "slim_ranking": 0.240208877285}