{"user_rating": 4.5, "review_count": 18, "name": "Adelaide's Levi Park", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "We stayed in the Vale house for 10 nights. The management is great! They are very helpful and polite and will help you with area attractions. The park is near the bus stop, which makes it easy to get to the CBD. The room is nice. Bathroom is a bit dark. Would stay there again.", "title": "Good value!", "helpfulness": 1, "user": "ChristchurchKevin", "date": "March 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 126617819}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "We stayed at Levi Park in January 2013 for a week. We booked one of their cabins and were very happy with it. It was comfortable and had everything we needed. It did cost $165 a night which is really the price of a hotel/motel, but we felt having the cooking facilities and the extra room made up for this cost. The air conditioning was great in the main room (it was during the stinking hot time in Adelaide-over 44 degrees), but it did not go into the bedroom and this did make it unpleasant at night as the fan did not really cool us down. The view from the verandah was terrific over the river Torrens and the bike paths. This park is very close to the city and the main roads to the Barossa, Victor Harbour and McLaren Vale. There is a supermarket and small shopping centre a short drive away. Noise from the road could be heard late at night but was not really a major concern. The managers were very friendly and helpful. Would recommend it if you want to have quick access to the city's main attraction-only 10 minute drive to the zoo!", "title": "Close to city!", "user": "Aussie8", "date": "February 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 152842979}, {"rating": 3.0, "title": "Great location.", "text": "We stayed for 10 days over the Christmas and New Year period. The best feature of this park is its location... Handy to the North of the city, the Adelaide Hills, and Adelaide City; in addition to this is the great walking /cycling path along the River Torrens that is accessible from the park. The sites are mostly gravel, however they are shaded. We found the sites to be rather small with little room to park the car. Amenities were clean, old, but well maintained. Staff are very friendly and helpful. We noted a lot of mosquitos during our stay, and along with the noise and density of the park we were glad to be moving on.", "helpfulness": 1, "user": "Coralfish", "date": "January 8, 2013", "id": 149145977}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "This is a great caravan park. We stayed 3 nights in our camper trailer, family of 5. Amenities were very clean. The park is secure and has good sized sites. Lots of shady trees to park the camper under. Multiple BBQ's and the Moreton Bay Fig tree is amazing. Close to the CBD and a Woolies just up the road. The staff were accommodating and friendly. Assistance Dog friendly park which is great. No pool which would have been good but beautiful large park beside the camping area. We will be back.", "title": "Great Park - Will be back", "user": "Mike C", "date": "January 3, 2013", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "location": 5.0, "service": 4.0}, "id": 148741977}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "Our family of 4 stayed for 2 nights in a Riverside Cabin. We were lucky enough to get a deal on Scoopon.com.au pay for 1 night get 1 night free including 2 kids. I can not speak highly enough of this park - it was the first time we had stayed there, the staff were very friendly and helpful, the park/grounds were immaculate - so clean and beautiful gardens, our cabin was great. It had everything we needed, a really nice view and very peaceful. A bit noisy with the airplanes going over but during the night it was so quiet we all slept so well, no traffic noise. The only thing I would like to see in a better location is the playground - this is at the entrance to the park and we were right at the back of the park. But apart from that we will definately be back!", "title": "Fantastic park, will be back!", "helpfulness": 1, "user": "RivazChick", "date": "September 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 141635779}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "We were caravanning around Australia and stayed at this park for 3 nights. Nice park with good clean facilities. Check in was efficient and staff friendly. We stayed there when the park was completely full. The only negative I would say was that 3 washing machines and 2 driers are not enough for this size park when full. Bus outside the door and very easy to get in and out of the City. Would stay there again.", "title": "Great Park", "user": "Lee G", "date": "September 23, 2012", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "location": 4.0, "service": 4.0}, "id": 141034817}], "location": {"country": "Australia", "continent": "South Pacific"}, "variance": {"poor": 0, "average": 2, "very good": 3, "terrible": 1, "excellent": 12}, "slim_ranking": 1.0, "description": "Nestled on the banks of the River Torrens, Levi Park is a leafy 4 star AAAT rated holiday park only 5 kms (10 mins) from the heart of Adelaide and all it has to offer. Levi Park is a perfect base from which to explore Adelaide and surrounding attractions. There is excellent public transport from the front of the park to allow easy access straight into the city. Our cabins and villas are fully self-contained with en-suite bathrooms, aircon/heating, TV, microwave. Linen is provided on the main beds. We have shady grass and gravel sites, our main amenities block also has disabled and children's bathrooms."}