{"user_rating": 4.0, "review_count": 407, "name": "Adina Apartment Hotel Melbourne", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "Medina Grand, Melbourne", "title": "Good Location, good sized room, good value.", "helpfulness": 3, "user": "Yorkie_Traveller", "date": "July 29, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 72873798}, {"rating": 4.0, "stay_parameters": "Stayed June 2010", "text": "After much searching on the internet and looking at reviews on TA we decided on the Medina Grand, it looked to be well located and was a good price.", "title": "Very spacious modernroom with great views.", "helpfulness": 2, "user": "Kelsmf", "date": "June 5, 2010", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 66510498}, {"rating": 3.0, "stay_parameters": "Stayed May 2010, traveled with friends", "text": "We flew in to Melbourne from Hong Kong, we got the Sky bus to the city, but unfortunately we were too late in the day for the free hotel transfer, so we got a short taxi taxi ride from Southern Cross Station to the hotel. It still worked out much cheaper than a taxi from the airport, and didn’t take very long. I’d use the Skybus again on a return visit.", "title": "70% A O K!!", "user": "JANDAL_101", "date": "May 31, 2010", "detail_rating": {"service": 2.0, "cleanliness": 5.0, "value": 3.0, "sleep": 2.0, "rooms": 5.0, "location": 5.0}, "id": 65981905}, {"rating": 4.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "Upon arrival the guy on the desk who checked us in was really friendly and helpful. We had a one bed apartment. The bedroom was a good size, with a desk and plenty of storage space for clothes etc. The main area was also big with a sofa and chair. There was plenty of stuff in the kitchen, though we didn’t really use it. There was a hob, oven, dishwasher and pots and pans etc. In the bathroom, there was a top loading washer and separate dryer, this was really handy for us, and they both worked well.", "title": "Good Location, Average Rooms", "helpfulness": 1, "user": "TravelCork", "date": "May 26, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 65359680}, {"rating": 3.0, "title": "Was ok.. nothing bad and nothing soo great", "text": "The beds were comfy and all linen was clean, similarly the towels. Some of furniture had a few scrapes but nothing to worry about and was generally in good condition.", "user": "SyedA2", "date": "May 9, 2010", "id": 63654650}, {"rating": 3.0, "title": "Centrally located, but average hotel", "text": "Good location and moderately priced, the hotel is clean, but somewhat dreary. The pool area was not very inviting. Basically a value play, don't expect anything great. Recommendation is luke warm.", "user": "anton60", "date": "March 18, 2010", "id": 58903320}, {"rating": 3.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "This is located in a great location, Serviced daily and very clean rooms. The penthouse was booked for our Anniversary, although beware as all you can hear in the suites are the lift motors above the rooms. This is extremely noisy and goes all night. Other then that if you had another type of room, the location is easy to walk to most areas of interest.", "title": "Great Location, but beware of the Penthouse Suites!", "user": "zoomzoom99", "date": "March 2, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 1.0, "rooms": 3.0, "location": 5.0}, "id": 57503257}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "Our second stay at a Medina apartment (we previously stayed in Sydney). Loads of space for living and sleeping and great location for the city.", "title": "Space, value, location and consistent quality", "user": "LittleJo_K", "date": "February 21, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 56632819}, {"rating": 4.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "Particularly like the laundry facilities, kitchen area and living room space. Great value.", "title": "Nice Large Rooms", "user": "AlunHassall", "date": "February 19, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 56531028}, {"rating": 4.0, "stay_parameters": "Stayed January 2010, traveled on business", "text": "We stayed for 3 nights at this hotel in February 2010. We had booked a studio room and it was nice and large with a separate bedroom. The kitchen was good but we did not use it other than for making cups of tea. There was a clothes washer and dryer in a cupboard off the bathroom. Everything was clean and tidy and our room was serviced daily.", "title": "great location!!!", "helpfulness": 2, "user": "iflynrvtoronto", "date": "January 15, 2010", "detail_rating": {"cleanliness": 4.0, "location": 5.0, "value": 4.0, "rooms": 4.0}, "id": 53505509}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled on business", "text": "I stay at this hotel 4 to 5 times per year. My last occasion involved a room upgrade to the Penthouse suite. The room was huge, two level with a balcony. Just the sort of place you'd want to stay. However the noise from the lifts motors seems to be concentrated in the Penhouse rooms. With the A/c on the lift noise is not so obvious. If I was paying full rate for this room I wouldn't have been happy. But to get an upgrade the stay was very pleasent.", "title": "Good rooms, but watch the Penthouse suits", "helpfulness": 1, "user": "WellingtonChumbles", "date": "January 12, 2010", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 53245829}, {"rating": 3.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "At first glance this seemed to be a really good value for money option in Melbourne city. We booked a one bedroom unit which was on the 9th floor, very spacious and had great amenities like a full kitchen and laundry in the unit. The location of the hotel is also really fantastic. BUT.... the airconditioning didn't work, in fact I think it heated the room rather than cooling it. Thankfully the windows opened, and we actually prefer fresh air anyway. The laneway which the windows opened onto was a little bit noisy at times but not too bad. The bathroom was not very clean, the vent in the ceiling was full of dirt and dust. The shower was terrible, spraying every where but down. The cleaners were supposed to service the apartment, but this only involved making the bed. One day the cleaner didn't arrive until 4:30pm, then when we asked for 5 mins so that we could go out while they cleaned, they said they couldn't wait because they were finished for the day. Then at the end of the stay, they tried to charge us for two in-house movies that we didn't watch, when we weren't even in the hotel at the time - when we disputed this the manager waived the cost, but the person on reception treated like we were being dishonest. It was a shame because the location was really fantastic, but we won't be staying here again. There are better serviced apartments in the Melbourne CBD.", "title": "There are better serviced apartments in the Melbourne CBD.", "user": "Erika C", "date": "January 1, 2010", "detail_rating": {"cleanliness": 2.0, "value": 3.0, "location": 4.0, "service": 2.0, "rooms": 4.0}, "id": 52283879}, {"rating": 4.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "We stayed at the Medina Grand for 2 nights just before xmas. The location is fantastic! Only a short stroll to Bourke street Mall and I didnt find it noisy at night time.The hotel is great. (& and im quite fussy!) It was clean and modern and hotel staff were very friendly. We had a 1 bedroom apartment which had plenty of room, full kitchen, seperate lounge, even laundry facilities. We will be back again!!", "title": "No problems at all!", "user": "BKV84", "date": "December 29, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 52138767}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "We stayed in a suite here over Christmas and it was perfect. The room was spacious and well appointed (although it could've done with a DVD player) and was perfect for us. We were at the rear of the hotel, so we didn't have any view to speak of out of the windows, but the suite itself was great.", "title": "Great hotel, great location", "user": "Gaz_Aus", "date": "December 29, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 4.0, "rooms": 5.0}, "id": 52118267}, {"rating": 4.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "The staff were very friendly and helpful and the hotel is situated about a five minute walk from Bourke Street and there is a tram stop about a half-minute walk away at the end of the street. Perfect!", "title": "Studio small but adequate.", "user": "loral", "date": "December 18, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 3.0, "rooms": 3.0}, "id": 51487228}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled with friends", "text": "I stayed here for 5 days with 7 girlfriends in 2 x 2 bedroom/ 2 bathroom apts. As mentioned in previous posts the location is excellent and the apartments are a decent size. The staff at reception were helpful and overall the experience was positive. The one issue was the showers had no water pressure and it was difficult to keep an even temperature when standing under the trickle- it was mostly cold if I'm honest! As you can appreciate when there are 8 of us trying to get ready to go out this was a nightmare as we could only shower in one bathroom in each apt at a time. I also had a room next to the lift. This wasn't a problem for me as living up north I am used to constant noise from industrial a/c. You would have to be a very light sleeper for it to be a nuisance. I would stay here again if it was a good price but probably not with a group as the shower issue wasn't fun.", "title": "Pretty good with a few hiccups.", "user": "L.Northam", "date": "October 26, 2010", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 84967291}, {"rating": 3.0, "stay_parameters": "Stayed October 2010, traveled with friends", "text": "We stayed for three nights in a one bedroom apartment (Oct 2010). The apartment was spacious, clean and furniture was in good condition, not particularly exciting but decent for the money paid", "title": "Good mid range CBD option", "helpfulness": 1, "user": "Deltasmelta", "date": "October 24, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 84688815}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled on business", "text": "Pros - Great central CBD location and also quiet. Apartment was spacious enough for two people. Good value for money", "title": "Apartment hotel with large rooms in a very central location", "helpfulness": 1, "user": "Sydneysider01", "date": "October 10, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 82805005}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled on business", "text": "Cons - Shower over bath (plastic bath that didn’t feel very strong when you were standing on it). Pool area was not very appealing. Check in was a little slow.", "title": "Good quality apartment hotel in central location", "user": "deb0910", "date": "September 29, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 81456259}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled with family", "text": "I would recommend this accommodation for groups of friends if you need central accommodation but aren’t going to spend much time there.", "title": "Well appointed serviced apartment in a great location.", "helpfulness": 2, "user": "TravelGuru71", "date": "August 27, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 77149306}], "location": {"country": "Australia", "continent": "South Pacific", "city": "Melbourne"}, "stars": 4.5, "variance": {"poor": 17, "average": 59, "very good": 167, "terrible": 11, "excellent": 153}, "aka": "Medina Grand Melbourne Hotel Melbourne", "slim_ranking": 0.207865168539}