{"review_count": 39, "slim_ranking": 2.0, "name": "Adirondack Hotel", "reviews": [{"rating": 4.0, "stay_parameters": "Visited August 2013", "text": "The Adirondack Hotel has both a formal, white-tablecloth, dining room and tables in the bar. (Both seem to serve from the same menu.) We chose a table in the bar and were pleased with the food and the pleasant and efficient service. We enjoyed the view from the windows looking out over the end of Long Lake and the boats and float-planes moored there. An appetizer of cooked peaches with gorgonzola worked far better than we expected, with the caramelized peach contrasting nicely with the saltiness of the cheese. There were other interesting item on the menu. A burger ordered medium/rare was served a perfect medium/rare. Prices were quite reasonable.", "title": "A Good Dining Experience", "helpfulness": 2, "user": "Rags2006", "date": "August 23, 2013", "detail_rating": {"value": 4.0, "service": 4.0}, "id": 173726970}, {"rating": 2.0, "title": "Dissapointed", "text": "I'd return any time I was in the area.", "user": "Marlene R", "date": "August 21, 2013", "id": 173428158}, {"rating": 4.0, "title": "Interesting menu, would go again", "text": "The food wasn't what we considered to be \"fine dining\" The Haddock was bland. My husband had the lobster. and for the first time he wasn't served a lobster fork, no bib, also not even a wet nap to clean his hands afterwards.", "helpfulness": 1, "user": "smsg10", "date": "August 20, 2013", "id": 173262540}, {"rating": 4.0, "stay_parameters": "Visited July 2013", "text": "The Adirondack Hotel restaurant is situated perfectly on a strip of land so you can see the lake from many angles. Prior to eating we had a cocktail out on the porch and couldn't decide which end of the lake we wanted to face! Also, I never expect when traveling to remote areas that I will find something I've never had on a menu. I had scallops with pureed peas on a bed of greens. The greens were good but the pureed peas was just strange. Didn't matter because the scallops were wonderful. I also tried the gorgonzola grilled peaches and they were delicious! The staff was friendly. Family friendly place. And check out the bags of water on the walls - apparently to draw the flies up away from the tables, a popular fly mitigation technique used in the ADKs, who knew!", "title": "Good Option in the Area", "helpfulness": 1, "user": "bostontodc", "date": "August 14, 2013", "detail_rating": {"value": 3.0, "service": 5.0}, "id": 172268514}, {"rating": 3.0, "title": "Old original building and hostess", "text": "The choices are fairly limited in this area, and the Hotel Adirondack worked well for what we were looking for. Consistent with another review, the hostess could have been friendlier but once we were seated, it all went smoothly. We actually had great service from a young waiter in the area for the summer (ski patrol in Co. for the winter), got us in and out in the time that we had and the food was fine. You are not going to get great food in this area, I don't think, and this was not great but it was quite good, prices were reasonable though one of the bbq specials that night was a bit higher than I was expecting. But all in all, a very pleasant dinner.", "helpfulness": 2, "user": "elainewny", "date": "August 10, 2013", "id": 171649628}], "location": {"country": "United States", "city": "Long Lake"}, "variance": {"poor": 4, "average": 9, "very good": 18, "terrible": 0, "excellent": 8}}