{"user_rating": 4.0, "review_count": 660, "name": "Admiral Fell Inn", "reviews": [{"rating": 1.0, "stay_parameters": "Stayed October 2006, traveled on business", "text": "Yuck! I would never stay in this hotel again or recommend it to a friend. It was billed as a charming B and B type of hotel, which really means it is old and run down. The carpets were threadbare, the furniture was dusty and worn out, we had to put a towel on the upholstered chair in our room--it was that stained! The floors creaked and the windows leaked cold air, it was a terrible experience! The TV in our room was placed to the side ot the bed, so that you had to sit sideways on the bed to watch it, you could not even lay in bed and watch TV! There wasn't enough room in the very small bathroom to set your toiletries. I was very disapointed. I could hear everything in the surrounding rooms. The neighborhood is awful, I felt unsafe walking to my car. There were many beggers asking for money. There were not any bellhops to handle the luggage. So, trying to drag my suitcases across the old streets while fending off panhandlers--not fun!", "title": "Don't stay here!", "helpfulness": 9, "user": "veda p", "date": "November 16, 2006", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "location": 1.0, "rooms": 1.0}, "id": 6138287, "likes": {"liked": "— Nothing!", "disliked": "— Everything, there was nothing good about this hotel."}}, {"rating": 4.0, "stay_parameters": "Stayed July 2006, traveled on business", "text": "We were there for business and will stay next to the convention center next time we are in Baltimore. At least in that area there are clean restaurants and well lit streets.", "title": "Some good, some bad", "helpfulness": 9, "user": "SeekingPerfection", "date": "August 25, 2006", "detail_rating": {"front_desk": 4.0, "service": 1.0, "cleanliness": 2.0, "value": 4.0, "rooms": 4.0, "location": 3.0}, "id": 5710293, "likes": {"liked": "— Very pretty rooms.. Comfortable. Quiet", "disliked": "— Cleanliness is surface. They don't vacuum often. Carpet had glass shards in it."}}, {"rating": 3.0, "stay_parameters": "Stayed April 2007, traveled on business", "text": "I just returned from a stay at the Admiral Fell Inn for business. I loved the location- Fells Point is a very neat part of the city with lots of good restaurants and shops. As far as the Inn, I would say it is a 3 star hotel. It was nice, but not spectacular. My biggest complaint would be that the room and bathroom were very small. There was no way the bed was a queen size...it was indeed a double.", "title": "It was OK", "helpfulness": 3, "user": "stargirl23", "date": "April 3, 2007", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 2.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 2.0}, "id": 7276465}, {"rating": 3.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "I got a good deal from Hotwire or I would have never paid the full price for this hotel. Parking is hard to find unless you want to pay $25 a night for valet. Also, the desk was little help. Didn't even have aspirin. And my room key stopped working 3 times and I had to get it reset. That was a huge pain.", "title": "Nice hotel but bad experience....", "helpfulness": 7, "user": "kaf9379", "date": "April 1, 2007", "detail_rating": {"front_desk": 2.0, "service": 2.0, "cleanliness": 2.0, "value": 3.0, "rooms": 3.0, "location": 4.0}, "id": 7266187, "likes": {"liked": "— I like the way the hotel was deocrated and how the history was retained.", "disliked": "— The effort, or lack of, that housekeeping put into cleaning the rooms."}}, {"rating": 4.0, "stay_parameters": "Stayed March 2007, traveled on business", "text": "I would only stay here again if I found a good deal.", "title": "I liked it very much", "helpfulness": 1, "user": "seafoodben", "date": "March 17, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 7180081, "likes": {"liked": "— Location", "disliked": "— Noise"}}, {"rating": 1.0, "title": "Stayed here before, but things have changed...", "text": "My cousin, her husband, my husband and myself stayed at Admiral Fell Inn on the weekend of 3/16, St. Patty's Day weekend. We booked the Ultimate Harbor Experience for $210 for the entire weekend. The package included 2 nights at the Admiral Fell, 2 tickets each to the Aquarium, Science Museum and the Top of the World, 2 game cards with 40 points each to ESPN Zone and 2 water taxi tickets for free use all day. The deal was very, very good. The hotel was nice and I really liked the area-cobblestone streets, pubs, eateries, stores, etc. And the water taxi is right there, even though it was closed all weekend due to the weather. It only cost us under $7.00 for a taxi ride to the Inner Harbor. The restaurant true was very nice and breakfast was very good with a big selection.", "helpfulness": 6, "user": "RCD19027", "date": "February 18, 2007", "id": 6808856}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "My boyfriend and I stayed at the Admiral Inn for two nights while attending a Yankees/Orioles game. The Inn is in a great location, right next to the water taxi, the inn itself is charming, and the employees friendly. Our room was small and for some reason we got a smoking room but we enjoyed our stay at the inn. It was very expensive (about $250 a night or more) and not worth that price but our options were limited. I would stay there again-and prefer the inn to the harbor hotels.", "title": "Charming", "user": "Evie049", "date": "August 6, 2007", "detail_rating": {"front_desk": 4.0, "service": 5.0, "business": 5.0, "cleanliness": 2.0, "rooms": 3.0, "location": 5.0}, "id": 8361299, "likes": {"liked": "— The look of the inn.", "disliked": "— The smoking room-the smell was extremely strong-we could have requested a change in room."}}, {"rating": 2.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "The Admiral Fell Inn has a wonderful location and the decor is very charming. However, it begins to lose some of the charm due to poor housekeeping. I have stayed at this hotel twice this month and both times the room has not be thoroughly cleaned. Both times there was hair on the bathroom walls and in the shower. Candy wrappers are on the floor providing proof that the room had not been vacumed properly, if at all. On the first visit used linens were left in the room.", "title": "Great Location, Poor Housekeeping", "helpfulness": 3, "user": "Tillie21617", "date": "August 1, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 3.0, "cleanliness": 1.0, "value": 2.0, "location": 4.0, "rooms": 4.0}, "id": 8274635, "likes": {"liked": "— Location", "disliked": "— Cleanliness"}}, {"rating": 1.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "It's a nice place to stay for convenience to local entertainment and restaurants they just need to get a better housekeeping staff.", "title": "Stay away from this place", "helpfulness": 4, "user": "PickyTravelNy", "date": "July 7, 2007", "detail_rating": {"front_desk": 2.0, "business": 2.0, "service": 2.0, "cleanliness": 3.0, "value": 1.0, "location": 1.0, "rooms": 1.0}, "id": 8072082, "likes": {"liked": "— Location", "disliked": "— Everything else"}}, {"rating": 1.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "The hotel is not very comfortable. Both the bathroom and the bedroom don't feel comfortable. The room was quite dark and dingy. There was noise from bar across the street till late night. They charge $10 \"Destination Fee\" for a newspaper and few other services that most hotels provide for free. The fact that they chose a vague term like \"Destination Fee\" for additional services means that they want to scam their customers.", "title": "Find another place to stay...", "helpfulness": 4, "user": "LewesBeach", "date": "May 14, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "location": 4.0}, "id": 7616778, "likes": {"liked": "— Location", "disliked": "— High cost- poor quality"}}, {"rating": 4.0, "title": "Best Hotel Ever!", "text": "If you have a baby or are handicapped, this place is especially bad for you. Once you get to your floor in the elevator, you might have to go up and down additional stairs to get to your room.", "helpfulness": 1, "user": "eksl029", "date": "April 5, 2007", "id": 7283297}], "location": {"country": "United States", "city": "Baltimore"}, "stars": 3, "variance": {"poor": 41, "average": 50, "very good": 158, "terrible": 32, "excellent": 379}, "aka": "Admiral Fell Hotel Baltimore", "slim_ranking": 0.214285714286, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.0, "rooms": 4.0, "location": 4.5}, "description": "A comfortable inn in Maryland that is similar to the home of a well-to-do nineteenth-century sea captain."}