{"user_rating": 4.5, "review_count": 77, "name": "Adventure Inn", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "We enjoyed staying here and slept well. Everything you needed and free wifi. Breakfast was coffee/tea and sweet scones/buns. Nice but we prefer something not so sweet for breakfast. Staff very friendly and chatty. Different from normal hotel rooms but in a good way. Would go back.", "title": "Large clean room", "user": "HMoo", "date": "June 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 165479163}, {"rating": 5.0, "title": "Loved it", "text": "We arrived via a recommendation, and were very happy. It is generally well priced for Ely. The owners are very personable, and the place is very clean. The room was spacious, and it is keen that it is a 'green' establishment. Recycling bin in the rooms, etc. Nice beds, lots of outlets, fridge, microwave, very nice bathroom, and all was new and very nice. Our only negative was that the walls are not sound-proofed as some chain places. We could hear our neighbors on occasion. The coffee and rolls in the morning were nice, as well.", "helpfulness": 1, "user": "Hylocichla", "date": "June 23, 2013", "id": 164907919}, {"rating": 4.0, "title": "Nice, non smelly stay", "text": "Nice rooms, doesnt smell standard hotel room \"perfume\", clean smell. Our room on 2nd floor was nice, all you need basically. Only \"bad\" I could say, was limited breakfast. But there was free wifi, so that equals it... ;-). Took a walk to SubWay a few feet up the road instead, so another business in the area made a few dollars as well.", "helpfulness": 1, "user": "Goofey74", "date": "May 30, 2013", "id": 162413891}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled solo", "text": "Could easily return if we were in the area again.", "title": "A million times better than anything else in the same price range", "helpfulness": 2, "user": "he498", "date": "May 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 161789425}, {"rating": 5.0, "title": "Very clean and affordable , best stay for the $", "text": "For work reasons, I've spent weeks living at the Adventure Inn in several different rooms (in the front building---I've never been in the back) and I couldn't have survived it at any other hotel. The rooms are huge and light-filled. Everything is new and exceptionally clean. There are tables to sit at by the windows, couches or soft chairs in rooms with one bed, enormous lovely beds with the softest organic sheets and comforters. And good coffee downstairs every morning with pastries.", "helpfulness": 1, "user": "RoadGlideTD", "date": "May 24, 2013", "id": 161683730}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled with friends", "text": "Very good family-run hotel. The owners were friendly and obviously wanted to ensure we enjoyed our stay. They shared with us about the changes they're making to make the motel more 'green', which was interesting.", "title": "Very good hotel at a reasonable price", "helpfulness": 1, "user": "JazzyzGurl", "date": "March 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 155646776}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "The rooms were quite clean and well cared for, comfortable and quiet.", "title": "Appreciated the eco-friendly", "user": "northerntraveler4", "date": "March 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 155521656}, {"rating": 2.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "What I noticed immediately was the lack of chemical smells usually evident in motels. Stayed in the new building with beautiful bathroom, nice linens, eco-friendly wooden furniture, and comfortable heating. Very comfy all around.", "title": "Not Really Dog Friendly", "helpfulness": 2, "user": "Heather H", "date": "March 11, 2013", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 3.0}, "id": 154289260}, {"rating": 5.0, "stay_parameters": "Stayed February 2013", "text": "My husband and I were super excited to head up to Ely to a dog friendly hotel where we could bring our \"kids\". I was very disappointed when the owner pointedly asked me if we planned to bring our dogs with us when we were heading out for the day. I told her we would be usually but if we were shopping or eating out they would be in the room. She then told me of all the times peoples usually well behaved dogs behaved poorly in her rooms (chewing a bed corner=, ruining the blinds, and barking). It was less than 30 minutes after we left to shop we received a phone call saying the dogs were barking excessively. When we got there a few minutes later they were not barking at all. Upon check out we found out the time at which they were barking the place was a \"madhouse\". There were people coming and going, tons of people checking in, three dog sled teams checked in with their dogs barking in the trucks, well no wonder they were barking. Not to mention the dog friendly room we were in was on the main floor in the center of the parking lot that saw the most traffic out of any other room. The room was so hot we had to sleep with the windows open, even though we had the heat off in the middle of winter. The second and third night we just had to sweat it out because of the barking dog sled teams’ right outside our windows. The walls and ceilings were so thin we could perfectly hear the conversation or upstairs neighbors were having at 12:30 in the morning. Our dog dig tear a sheet with her nail on their \"Expensive Organic Sheets,” Fortunately we were only billed $25.00, which we were not notified of until after they charged it. We received the receipt in the mail a few days after the charge with a demeaning note telling us maybe we \"learned our lesson\" and that the sheets are normally $125 since they are organic, but since these sheets are older they only charged us $25.00, which come to think of it is how much my husband and I paid for our sheet sets that are organic at target. By the way, the sheets on the beds did not even match. This was an awful stay, snowmobiles ran by all night, the hosts were inhospitable, the bed and room uncomfortable, and not all that dog friendly.", "title": "Very cozy", "helpfulness": 2, "user": "Aljennings", "date": "February 13, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 152033245}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled with family", "text": "Decided to take a last minute weekend away to Ely for the winter festival. Decided on staying here for the night. Good decision. Very cozy all around nice stay. Highly recommended. Why does my review need to be 200 characters long?", "title": "Winter festival stay", "helpfulness": 1, "user": "SueWeinauer", "date": "February 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 151903493}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with friends", "text": "Adventure Inn is a very nice and clean motel. They even have a handicap room with a huge bathroom. Staff is very friendly and helpful. It is wonderfully located - minutes to restaurants and not far from the Wolf Center. Next time I am in Ely, I definitely would go there again!", "title": "Northwoods feel", "user": "Sigrid R", "date": "September 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 141443723}, {"rating": 4.0, "stay_parameters": "Stayed August 2012", "text": "Great beds and pillows!! Still right in Ely but a long walk to the cute shops for our family...close to a very nice park though. Beautiful hanging flower baskets and super friendly owner! Small continental breakfast was nice for a quick bite to start off our sight seeing. Chose because of proximity to Bear and Wolf Centers and other good reviews. We weren't expecting fancy and got all we hoped for...convenient, clean, friendly, enough room for 4 in our room and somevof the comfiest beds I've ever slept in! Good value.", "title": "Very nice, family owned motel", "user": "Going_to_Normandy", "date": "September 24, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 141182265}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled with friends", "text": "We stayed here after finishing an 8 day canoe trip around Boundry Waters. It was a good choice. Beds were comfortable and the staff was welcoming and helpful. Street noise was a distraction with the windows open: lots of trucks in the early morning hours.", "title": "Nice place!", "user": "John K", "date": "September 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 3.0}, "id": 141120688}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "The room was very clean, the staff was very friendly. It was a great place to stay for our overnight trip while visiting the International Wolf Station & Bear Center. We chose to stay here because they were dog friendly and allowed our dog stay in the room in his crate so we could visit the Wolf Center. Would love to stay here again! The price was resonable. The only thing is they didn't have breakfast so we ate breakfast at the Chocolate Moose.", "title": "Clean & Comfortable Stay", "user": "couple-n-pup", "date": "September 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 140557080}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "Very comfortable and good value for money. Good beds in good size rooms with interior corridor. Owners were incredibly helpful, kind and knowledegable about the area. Coffee and some breakfast items were available every day.", "title": "Good value and comfortable", "user": "C P", "date": "September 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 139488531}, {"rating": 5.0, "stay_parameters": "Stayed December 2012", "text": "I stayed in Room 5, the Wolf Room. I found the room extremely clean and at a comfortable temperature. Comfortable bed, clock, microwave, refrigerator (turned off) and cable TV. No coffee maker, hair dryer or phone. Coffee and donuts available at 7am in the office. I was very impressed with how well maintain and clean the inn is. The inn is located on the east side of town, quite a walk to the other end of town where most of the unique businesses are in this small town. During the off season, there is not much going on in town. Those businesses that are open close at 5pm. The inn has an excellent TV channel line up. I will not hesitate to come back when in Ely.", "title": "A steal during the off season!", "helpfulness": 1, "user": "worth-voyageur", "date": "December 14, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 3.0, "service": 5.0, "rooms": 5.0}, "id": 147469990}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "This hotel has everything you could need for the weekend get-a-way up-north...we stayed here 2 nights last year & stayed in the queen pine cone room...we decided to go back this year for 4 days, 3 nights in a king room in the main building (with the office) and it was THE most comfortable bed ever. Down blankets & pillows, plus a very comfy mattress. The size of the room was bigger than expected. There was lots of room to put all of our stuff, a flat screen tv (that we hooked up our brought-from-home-blu-ray player to), a nice sized table & chairs, plus a comfy side chair. There is a refrigerator & microwave, which we used to hold our bottled waters, leftovers, & heat up some food. The bathroom was exceptionally clean & very updated. The staff in the office is incredibly nice (especially Louise!) and they offer coffee/tea/pastries in the morning. The town of Ely is quiet & so is the hotel. It is a must stay if you are looking for a budget friendly yet upscale homelike environment up-north. Next time we will try the king-jacuzze suite!", "title": "Our up-north home away from home", "helpfulness": 1, "user": "Jessica W", "date": "October 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 143488609}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "Called ahead to let them know we would be arriving late, late in the evening and owners did everything necessary to help- Outstanding!", "title": "Outstanding. BIG help! Thank you!", "helpfulness": 2, "user": "Jimmy_Benson", "date": "October 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 143432801}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled with friends", "text": "Everything met our expectations. Good beds. Very fast wireless Internet. Good coffee and very good pastries (homemade?) in the morning. Priced right.", "title": "Nice motel", "helpfulness": 1, "user": "EZeringue", "date": "October 12, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 142659891}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled on business", "text": "Good chance that our kid will enroll at the local college. This might become our home-away-from-home.", "title": "Fantastic motel", "user": "tomsums", "date": "October 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 141831275}], "location": {"country": "United States", "city": "Ely"}, "variance": {"poor": 3, "average": 3, "very good": 18, "terrible": 2, "excellent": 51}, "aka": "Adventure Hotel", "slim_ranking": 0.285714285714, "description": "Adventure Inn is an earth-friendly, sustainable motel that is dedicated to reducing their energy foot print while providing comfort to their guests. A family run motel. We now have a brand new energy efficient solar thermal building with earthy comfort in mind. Quiet, comfortable with platform beds, hand made furniture,down blankets and pillows. We also have 2 brand new jacuzzi suites. The old economy building no longer exists and we are in the process of rennovating the 10 yr old back building."}