{"user_rating": 4.5, "review_count": 464, "name": "Aes Club Hotel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed July 2011", "text": "We stayed here for two wonderful relaxing weeks end of July with our two children. The hotel is Lovely and new. We had a family room which was ideal for a family of four which included two separate bedrooms. The only downside for me was the beds were far too hard and we were located a room in the roof which meant no balcony even though it was on my booking request but wasn't too much of a problem. The maids cleaned the room every day and towels were changed every other day. We had to ask for quilt covers for the beds as none were provided on our arrival.", "title": "Wonderful", "helpfulness": 5, "user": "LutonTraveller", "date": "August 26, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 117261571}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "The pool is lovely, the perfect size and was cleaned and checked every day. The nice part was there were plenty of sunbeds to go around even when the hotel was full.", "title": "Fantastic holiday", "helpfulness": 13, "user": "DougWilliams", "date": "August 23, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 4.0, "service": 5.0}, "id": 117143817}, {"rating": 5.0, "stay_parameters": "Stayed August 2011", "text": "The staff were all very attentive and", "title": "Amazing holiday", "helpfulness": 3, "user": "thetheobalds", "date": "August 20, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 4.0, "rooms": 5.0}, "id": 116979955}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "worked long hours. There was never a queue for breakfast lunch or dinner and the food was very good traditional Turkish food. It was different each day for the whole two weeks.", "title": "Lovely Hotel - few teething problems but well worth a visit!", "helpfulness": 1, "user": "ianandlesley", "date": "August 19, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 5.0, "service": 5.0}, "id": 116946994}, {"rating": 5.0, "stay_parameters": "Stayed August 2011", "text": "The entertainment team were all lovely And worked hard to ensure everyone had a good time. Hande who looked after the kids club was the most beautiful woman you could ask to look after your children. My daughter and her friends loved her.", "title": "Excellent in all respects including price !", "helpfulness": 1, "user": "Kathclarinet", "date": "August 19, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 116925543}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "We had very high expectations after reading the reviews on here and I have to say my expectations were exceeded.", "title": "missing you already..", "helpfulness": 1, "user": "Nicks_gal", "date": "August 30, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117459674}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with friends", "text": "We arrived late at night and were offered snacks, our room ( a family room) was huge with two bedrooms, ok, so it had a small window overlooking a brick wall and no balcony! but that is were the disappointment ended, when I made a query about other rooms the staff offered to move us the next day when people had vacated better rooms, as it turned out we decided not to bother and the room served us very well. The maid service was a little hit and miss and they did not come in the room every day but it could be that we were having such fun filled late nights that we were sleeping in late and possibly missing the time for cleaning. Either way it did not bother us, we had more than enough clean towels for a family of five and more than enough fresh bottled water in our fridge, they even provided toiletries in the bathroom.", "title": "Amazing!! Loved it!!", "user": "Lizzymck1", "date": "August 29, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117416818}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "The entertainment team (Sarp especially) were great and you could take part in as much or as little as you liked without feeling pressured. Something that really touched me and proved how genuine these guys are was when the karaoke was in full swing and a lovely young girl with mild learning disability was upset because the song she wanted to sing was not in the list of available karaoke songs. she was upset and the entertainment guys went and immediately downloaded the song from youtube to keep her happy!", "title": "excellent hotel", "helpfulness": 8, "user": "lokumbelfast", "date": "August 28, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117344235}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "The food is superb and I looked forward to every meal, it is typical turkish but seems to have enough variety for everyone, the quality was excellent.", "title": "Amazing!!", "helpfulness": 2, "user": "Dudders_11", "date": "August 27, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 5.0, "service": 5.0}, "id": 117330927}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "The food and Drinks Manager 'Turgay' was exceptionally helpful and real good fun.", "title": "One of the best holidays we've had.", "helpfulness": 1, "user": "Ashley D", "date": "August 27, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117330297}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "Myself, my husband and 12 year old daughter have just returned from spending two fabulous weeks @ the Aes Club Hotel. We were lucky enough to get a 3rd Floor room (4307) overlooking the pool. The room was sufficient for our needs - a double bed for us and sofa bed for our daughter. The room was modern, clean and comfortable.", "title": "What a nightmare - didn't want to come home!!", "helpfulness": 3, "user": "WendyWY", "date": "August 18, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116912752}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "We didn't get enough bedding the first night but all we had to do was have a quick word with the lovely maids the next morning and our requirements were sorted out. One other point to note - the maids are a bit skimpy giving out the bar soap so just take your own as a backup. As mentioned by a previous reviewer these are just minor quibbles in the scheme of things.", "title": "Great hotel, great location, great people!", "helpfulness": 6, "user": "happyholsgirl", "date": "August 14, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116719100}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "The animation team were absolutely fab - big applause to Cihan (Clouseau), Sarp, Ronaldo and the gorgeous Hande!!! These guys were amazing - working such long hours from 10am until after midnight each day. They made the days and nights around the pool so entertaining with table tennis, water aerobics, surf board challenges, water polo, killer darts and pool every day. In the evenings, they kicked off with the mini disco enjoyed by kids and adults alike (got pictures of you Frankie, Jan and Cathy!!!) at 9.30, followed by Turkish Nights, Kenyan Dancers, Fire Dancers - you name it. Don't be put off with bingo and karaoke (I usually am!!) - these evenings were hilarious!", "title": "Wow! Wow! Wow!", "helpfulness": 3, "user": "SURMA S", "date": "August 14, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116712407}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled solo", "text": "The all inclusive drinks were good - the bar served very generous voddies and coke! Real coke and diet coke together with real Fanta. The local beer Efes was very good and refreshing. The wine on the other hand - we lets just say it's an aquired taste - but we drank it anyway didn't we Jacksons?? One minor thing - they didn't serve ice creams but the rep. said that if enough people mentioned this they would probably take note, (I know management read these reviews - so please take note!).", "title": "excellant place to stay if traveling solo", "helpfulness": 3, "user": "karen m", "date": "August 14, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116701399}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "The food was good and plentiful. Breakfasts included cereals, cold meats, cheeses and a lovely chef prepared omelettes and pancakes each day. Lunches and dinners were good with a variety of salads and main courses. Something for everyone and never any queues.", "title": "FANTASTIC, AMAZING, WONDERFUL, SUPER, BRILLIANT, BEST HOLIDAY EVER!", "helpfulness": 2, "user": "i love berkay r", "date": "August 14, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 5.0, "service": 5.0}, "id": 116699447}, {"rating": 4.0, "title": "An honest review.... the good and the bad", "text": "Me and My boyfriend, 23 and 25 have just got back today and we had a really wonderful holiday! We arrived early hours of the 5th Aug 11 and when we arrived the receptionist was very helpful and friendly, he got someone to take our bags to our rooms, and offered us a sandwich (as we'd been delayed at Manchester for a few hours).", "user": "Nina J", "date": "August 12, 2011", "id": 116614778}, {"rating": 5.0, "title": "Great holiday we didn't want to leave ...", "text": "THE ROOM....... We got to the room and were very pleased with how modern and clean it was. The bathroom and balcony were very small but the quality and cleanliness was really good. Free water in fridge daily. The safe was free to use. Hair drier in bathroom. Flat screen TV on wall with adequate English channels. Plenty of storage. There was even a latch on the front door so that the maids couldn't just walk in if you were getting dressed etc. The maids did a great job, and made pretty designs on your bed with the towels. We used to leave a couple of Turkish Lira on the pillow to say thanks.", "user": "kellyhol", "date": "August 10, 2011", "id": 116522619}, {"rating": 5.0, "title": "What a tremendous holiday!!", "text": "POOL AREA/ ENTERTAINMENT STAFF......... On our first day, we were very pleased with the number of sun loungers around the pool, always enough for everyone so no need to get up early to put your towel down. Music on all day around the big pool and the entertainment staff were amazing. They got everyone playing water polo, a racing relay game on 2 surf boards (Sharks and Dolphins), killer pool, table tennis, water aerobics, that Gladiators game were you have to knock each other off the podium (using two surf boards and foam floats), and much more. The adults had as much fun as the kids playing all the games..... but be careful, if you lose any of the games, you are getting chucked in the pool lol.", "user": "jack e", "date": "August 9, 2011", "id": 116474089}, {"rating": 5.0, "title": "Fabulous Hotel, Fabulous Staff - Fabulous Place", "text": "FOOD........... The food was just ok. We ate out most nights. Breakfast was serial, toast (butter/ nutella), freshly cut up fruit, salad, eggs, sausage (hot dog ones) and some other strange things. They also had a guy made fresh pancakes which were good. Dinner was again salad, bread, wedges, pitta bread, rice, meat in sauce, chips etc. Then the had snacks on from 2 - 5pm everyday which was usually pizza, chips, burgers, wedges, salad which could all be eaten around the pool. Tea was pretty similar to dinner, not much variation.", "user": "Singapore_Smiths", "date": "August 9, 2011", "id": 116469895}, {"rating": 5.0, "title": "One of our best holidays", "text": "DRINKS........ Drinks were good. Unlimited Local Spirits and Beer - no complaints from us. Proper soft drinks - no Rola Cola lol. Coca cola/ Sprite/ Fanta - you name it - all served by the wonderful bar staff who always had a smile on their faces!!!", "user": "Mrsspencer11", "date": "August 9, 2011", "id": 116462342}], "location": {"country": "Turkey", "region": "Turkish Aegean Coast", "continent": "Europe"}, "stars": 4, "variance": {"poor": 13, "average": 55, "very good": 127, "terrible": 2, "excellent": 267}, "aka": "Aes Club Hotel Turkey/Ovacik", "slim_ranking": 0.318181818182, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.0}, "description": "The AES Club Hotel is located on the southern coast of Turkey, in the quiet resort of Ovacik, midway between the popular resorts of Oludeniz and Fethiye. This impressive new 4-star hotel, which offers an All Inclusive package, has 138 modern rooms spread over 4 buildings, and invites singles, couples and family groups to enjoy the sparkling pools for adults & kids, dining options, organised activities and entertainment, and fitness and Spa facilities..."}