{"user_rating": 4.5, "review_count": 2505, "name": "Affinia Shelburne", "reviews": [{"rating": 1.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "DO NOT WASTE YOUR TIME OR MONEY ....PAY THE EXTRA $100 TO STAY AT A BETTER HOTEL!!!!!!", "title": "This is a dirty, old hotel with a tiny bathroom!!!!", "helpfulness": 2, "user": "TravelGal79987", "date": "February 20, 2007", "detail_rating": {"front_desk": 3.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "location": 2.0}, "id": 6818691, "likes": {"liked": "— Nothing", "disliked": "— We Were Totally Disappointed"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2007", "text": "My husband and I just returned from a weekend stay in NYC at this hotel. Our first reaction when we walked into the room was how outdated everything was and how there was NO VIEW.", "title": "awesome hotel great value and super location", "helpfulness": 1, "user": "rao1", "date": "February 12, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6782362}, {"rating": 2.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "The bathroom was the size of the bathroom in my daughter's Barbie playhouse!!", "title": "Not usually fussy but Location and room terrible", "helpfulness": 3, "user": "MagsWicklow", "date": "February 11, 2007", "detail_rating": {"front_desk": 1.0, "business": 3.0, "service": 2.0, "cleanliness": 2.0, "value": 3.0, "location": 2.0, "rooms": 1.0}, "id": 6779641, "likes": {"liked": "— Driving in the taxi away from it", "disliked": "— The location"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled with friends", "text": "There was an unidentifiable dried yellow substance on the wall in the bathroom and dried white substance on the nightstand in the bedroom. The carpets were extra filthy and the chair in the living room was very uncomfortable.", "title": "Great, great, great!!", "helpfulness": 1, "user": "ukdiva", "date": "February 9, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 6775148, "likes": {"liked": "— Great location, the resturant/bar, Rare - best burgers in Manhattan according to Time Out!", "disliked": "— n/a"}}, {"rating": 3.0, "title": "Basic & plain but great location", "text": "After complaining and being told that there were no other rooms available, we ordered room service and were overcharged $40 for a bottle of champaigne because they told us the Room Service menu in the room had the \"old price\".", "helpfulness": 2, "user": "Molly&Tim", "date": "February 9, 2007", "id": 6772286}, {"rating": 3.0, "stay_parameters": "Stayed February 2007, traveled on business", "text": "I stayed at the Shelburne mid-February and found it to be a very decent value. I was impressed by the size of room itself (booked a one-bedroom suite), location, and price. I do agree that the hotel needs a major upgrade. If you happen to care about service (doorperson, etc.), this is not the place for you. I care mostly about noise level (hearing people in the next room or in the halls) and was happy that I could not hear anything. Of course I could hear the honking cars and street noise (up on the eleventh floor) but as a former New Yorker, it felt like home to me - you screen it out. Yes, the carpets and bedspread were a bit nasty, but aren't they all? The bathrooms were tiny but I've seen worse. An upgrade will do well for the hotel but of course it won't be as affordable. The hotel is in an excellent location - very central (not for food choices - restuarants in area geared towards frat boys and tourists, but for transportation). If you can get a decent price (under $200.00 for one-bedroom suite), I highly recommend the Shelburne. If you pay much over that ($300 and up) I wouldn't do it.", "title": "Decent", "helpfulness": 3, "user": "freqtrav88", "date": "March 6, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 2.0, "cleanliness": 2.0, "value": 3.0, "location": 5.0, "rooms": 3.0}, "id": 6920876, "likes": {"liked": "— Size, location, and price", "disliked": "— Needs major upgrade"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled on business", "text": "My quest to find a Manhattan hotel under $200 a night seemed futile, but the Shelburne Murray Hill turned out to be a pleasant surprise. It is conveniently located at 37th and Lexington. The rooms are all different but large for New York. Maybe it used to be efficiency apartments, because every room has a kitchenette and surprisingly large rooms. The hotel is U-shaped, and my room was facing inward. This means that there was no view, but it also means that the room was quiet. The staff was helpful and pleasant. The doorman was especially good. They used to have jazz in the restaurant, but it's not happening now. They said it might return. The rooftop lounge was closed for the winter, but it would be pleasant in warm weather. Attractive lounge, exercise room - all in all more than I expected and good enough to recommend. The hotel seems to be popular with groups, and the teenagers could be a noise problem, but the hallway commotion was manageable during this visit.", "title": "Practical New York Choice", "helpfulness": 1, "user": "GregChapelHill", "date": "March 5, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 6918481, "likes": {"liked": "— Price", "disliked": "— Expensive Internet connection"}}, {"rating": 3.0, "stay_parameters": "Stayed January 2007, traveled on business", "text": "I stayed at the Shelburne Murrary Hill as part of two week business stay (attended training at Cornell ILR's Mgmt. Center on 34th) in Manhattan during January and February of this week.", "title": "Great Location, Large Rooms, Uncomfortable Bed & Circulation", "helpfulness": 10, "user": "SeminarTrekker", "date": "March 2, 2007", "detail_rating": {"front_desk": 2.0, "business": 2.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 2.0}, "id": 6902389, "likes": {"liked": "— Kitchenette, Gym, Location, Many food stores and restaurants", "disliked": "— Bed, Room Climate Controls, Dated Furnishings, Dirty Drapes"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2007, traveled with family", "text": "From the Shelburne to Cornell it was about 12 minute walk.", "title": "Great place", "user": "LouLamb", "date": "February 27, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 6852071}, {"rating": 4.0, "stay_parameters": "Stayed February 2007, traveled with family", "text": "While it was cold, it could have colder and there was no snow during my stay in Manhattan. During the two weeks, I stayed at Residence Inn Times (39th & Ave. of Amr.) Square, Affinia Dumont and the Shelburne. I would rate the Residence Inn as being the best in terms of room comfort, quality of staff, and newest facility. Affinia Dumont (34th & Lexington) has comfortable and larger rooms than the Residence Inn and the neighborhood is less hectic and offers more food vendors and eating establishments. The Affinia has the Best Door people in the City. The Shelburne...hm.... I actually walked from the Residence Inn to the Affinia Dumont, pulling two rolling cases. After my stay at the Shelburne, I opted to stay shorter than planned and walked a few blocks Affinia Dumont and offers many eating establishments and food vendors/stores. The check in at the Shelburne was smooth. I asked for a quiet higher floor room away from the streets (Lexington, 38th and/or 37th). So I had a view of other rooms, but my room was quiet.", "title": "Wow, what a huge room!!!", "helpfulness": 1, "user": "MainePinetree", "date": "February 24, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 6835631, "likes": {"liked": "— size of room", "disliked": "— small bathroom"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "Second stay for us at this hotel on a NYC weekend get away. Close to nice restaurants, interesting eateries and Grand Central Station. Rooms are nicely appointed and a reasonable size, beds and linens are very comfy. Has a roof top bar which is lovely on a summer evening. 'Rare' restaurant is attached to the hotel - the best gourmet burgers and fries! Decent wine and beer choices too. Hotel staff are efficient, friendly and helpful. Only down side is no free internet in the rooms - free in the lobby but $13.95 a day in the room.", "title": "Great Little Hotel in Murray Hill", "helpfulness": 2, "user": "CatherineofCanada", "date": "August 4, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 4.0}, "id": 116277036}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled on business", "text": "The Affiinia Shelburne has become since two years my preferred hotel for my business trips to NY. Rooms are comfortable, quiet and clean, which is not always a given in Manhattan. Staff are nice, always available to help. During the summer the rooftop bar offers the opportunity for a drink in a cool ambience. Will be back", "title": "Usual pleasant stay", "helpfulness": 2, "user": "Daniele66", "date": "August 4, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 5.0, "value": 5.0, "service": 4.0}, "id": 116275040}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "My boyfriend and I live in Washington DC and take weekend trips to NYC about every two months, and if I book the reservations early enough I can find rooms for about $200 a night. The reason why I am rating this hotel as Excellent is because though it may not have all the luxury, but for $200 a night, you are getting big bang for your money in NYC. The staff is courteous and prompt, the bed is comfortable, and the room is clean and stylish with flat screen TV. The hotel is located in charming Murray Hill, pretty close to everything. NYC is notorious for being a expensive city, but this hotel is a real deal. Affina Dumont and Kimptons 70 Park Ave Hotel also have great deals, you just have to keep an eye on it.", "title": "Amazing Find for the Price", "helpfulness": 1, "user": "Beachlove08", "date": "August 3, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 4.0}, "id": 116233445}, {"rating": 5.0, "title": "I keep coming back!", "text": "This hotel is excellent--good design, walkable from Grand Central and very comfortable. Clean and well-maintained and the bathrooms are pretty luxurious. I have stayed here a number of times, in part because my daughter lives a few blocks away. The front desk staff are friendly and helpful; the one time I had a problem (too much noise from an adjoining room) I was moved promptly. The Affinia pillow menu is a nice thing--especially if you are allergic to feathers. I also like the size--it really feels like a neighborhood place. HIghly recommend.", "helpfulness": 3, "user": "JanieD", "date": "August 2, 2011", "id": 116168469}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled on business", "text": "This hotel was recently renovated, the renovation, in my opinion, really \"kicked\" the hotel up a notch! It was very nicely done. The rooms are clean and fairly spacious The locale of the hotel is great for getting around with easy access to Grand Central Station, shops, nice salons and cool restaurants. The staff were very helpful and pleasant. The only draw back is the elevator system, the elevators are small and the system is very slow but, otherwise, a very good stay!!!!", "title": "Great Location, will stay again!", "helpfulness": 1, "user": "citigirl28", "date": "August 1, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 5.0, "value": 4.0, "service": 4.0}, "id": 116104273}, {"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled with family", "text": "After researching many NYC hotels on the internet, I kept returning to the Shelburne Murray Hill recommendations and finally went ahead and booked a room. I couldn't be more glad I did. This hotel lives up to the charm, pleasantry and hospitality that many travelers have shared. The rooms are nicely sized and appointed in a lovely and quaint fashion. The staff is very helpful. We were able to check in early, much to our delight. The beds were comfortable and clean. Don't be detoured by the location. It is still close to everything and the great savings compared to the \"big\" hotels in time square are well worth the couple extra blocks you may have to travel. We had 2 moms and 2 daughters enjoy a wonderful weekend with a stellar view of the Chrystler Building. You won't be disappointed. We'll be back.", "title": "Lived up to it's charm!", "user": "kniff", "date": "January 20, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6629326, "likes": {"liked": "— The quaint and charming atmosphere", "disliked": "— nothing!"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2006, traveled with family", "text": "We were a party of 4 adults who stayed at the Shelburne for a few days over Christmas 2006. The room we pre-paid for was a one bedroom suite. When we arrived we were given a two-bedroom suite. We've been to New York many times in the past and this was by far the largest room - 4 queen beds, three televisions and two bathrooms. Our only complaints were that we asked for a quiet room and were instead put on the second floor - the traffic noise was horrible. The door lock on the room was a bit sticky - but with some pushing it would lock. The cleaning staff were lovely and even supplied extra towels when we asked. The location can't really be beat. You can walk to Macy's, the Empire State Building and Times Square. There are dozens of quaint places to eat in the neighborhood. Above all else, the staff was lovely and accomodating.", "title": "Shelburne Staff are Great", "helpfulness": 3, "user": "ABtraveler06", "date": "January 5, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 6556089, "likes": {"liked": "— The staff", "disliked": "— Traffice noise"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2006, traveled solo", "text": "Booked this hotel for three nights over new year to meet some friends staying in New york already. Couldn't beleive the price at £290 in total, for which i had a huge room with two double beds! Location was excellent 15-20 mins walk to times square and overall thought this was an amazing deal. Would recommend this place to anyone.", "title": "Fantastic value!", "helpfulness": 2, "user": "hamish72", "date": "January 5, 2007", "detail_rating": {"front_desk": 3.0, "service": 4.0, "business": 4.0, "cleanliness": 4.0, "rooms": 4.0, "location": 4.0}, "id": 6554733}, {"rating": 4.0, "title": "Worked well with our kids", "text": "I booked this hotel thru priceline and got a rate of $175 per night for 2 nights, which I thought was wonderful. The day before we went I called to see if we could get a rollaway in our room since we had 3 kids. Luckily I called because they had us booked in a room with one queen bed, not good. The man I spoke to said he switched us to a room with 2 queens, but no room for a rollaway. This would work since our 3 yr. old usually ends up in our bed anyway, so we would just start that way, and our 6 and 9 yr old boys could share a bed.", "helpfulness": 2, "user": "Peronnetj", "date": "December 31, 2006", "id": 6526901}, {"rating": 5.0, "stay_parameters": "Stayed July 2003, traveled with family", "text": "We walked with our luggage from Penn Station and halfway there wished we got a cab, not realizing it was so far (miscounted a couple of avenues when we were planning). Promised our kids we would get a cab back when it was time to check out! We got to the Shelburne at 1pm to stowe our luggage, but they let us check in! Unfortunetely the room change wasn't really made and they still had us in one queen. Victoria at the desk was very very helpful. After checking a couple of rooms for us, we checked into a roof top room that are normally not available in the summer because of their bar. But the winter they were perfect, with a view of the river and empire state building! We ended up with a king and a rollaway bed. The older boys switched between the rollaway and a soft lounge chair with ottaman. Not the best if the kids were older, but worked fine for us.", "title": "Charming", "helpfulness": 4, "user": "onyp", "date": "December 27, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 6504141, "likes": {"liked": "— overall prewar atmosphere and old school nintendo", "disliked": "— lack of electricity (but not the hotel's fault at all!)"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "My husband and I stayed here for only one night on our recent visit to NYC and were lucky to get the best rate in town ($109) by bidding on Priceline earlier that morning. Score! We knew that it was pretty far away from some of the sights we had planned to see that day but for a 3-star hotel at that price it was totally worth it to us.", "title": "Loved it!", "helpfulness": 3, "user": "ChrystalS", "date": "February 6, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 3.0, "rooms": 5.0}, "id": 6749130, "likes": {"liked": "— size!", "disliked": "— distance from attractions"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2006, traveled as a couple", "text": "What we hadn't expected was how cute the area was. Murray-Hill is for sure the most charming part of NYC that we saw. It was clean, pretty and obviously very affluent. We felt very safe walking the streets at night. Furthermore, the room was amazing! We had no idea that we'd 'won' a suite. The living room had a pull-out couch and TV, there was a kitchen, full bath and large bedroom also with TV. It was like a regular suite in any other city. Unusually roomy for an inexpensive room in NYC.", "title": "new york,new york - loved it so much we stayed twice!", "helpfulness": 2, "user": "monkeyboy30", "date": "January 29, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 6713823, "likes": {"liked": "— location & price", "disliked": "— decor"}}, {"rating": 4.0, "title": "Great location, loved it, roomy", "text": "Things that visitors might want to know...(1) use Grand Central Station. It's the closest stop. (2) it was only a $23 cab to LaGuardia!", "helpfulness": 3, "user": "travel disney", "date": "January 25, 2007", "id": 6694688}, {"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled with friends", "text": "Stay here. It's worth it. We WILL be back!", "title": "Sssshhhh! Best to keep it a secret", "helpfulness": 2, "user": "DC_Diva", "date": "January 23, 2007", "detail_rating": {"cleanliness": 4.0, "front_desk": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 6649664, "likes": {"liked": "— Wonderful staff and room size"}}, {"rating": 4.0, "title": "Safe in New York", "text": "Totally agree with a lot of the comments here, this hotel although could do with a bit of decorating in some of the rooms this really shouldn't put you off staying here. The beds are so comfortable and massive but maybe thats due to us having small beds in UK.", "helpfulness": 1, "user": "Jenny Macca", "date": "January 23, 2007", "id": 6646834}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "New York can be so hit and miss with regard to hotels and this one was hit, hit, hit in every way. Great location with immediate access to Grand Central, City Library, Time Square and 5th Avenue, but also a block away from the MidTown Tunnel making the drive to and from JFK really fast!", "title": "Unbeatable!", "helpfulness": 3, "user": "zacstar", "date": "August 12, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116593538}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "The staff were great, with hip New York street smarts and very friendly. The foyer lounge made the free wifi avaiable there a breeze to use and the rooftop bar made for an excellent onsite venue for drinks and views.", "title": "Awesome Stay at the Affinia Shelburne!!!", "helpfulness": 1, "user": "jgrimold", "date": "August 9, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116455692}, {"rating": 5.0, "stay_parameters": "Stayed July 2011", "text": "....and the room...enormous! New York apartments are smaller than this. Comfy bed, beautiful bathroom, great tv....what more could we ask for.", "title": "Fabulous hotel in the heart of midtown", "helpfulness": 2, "user": "Damian1974", "date": "August 7, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 116383200}, {"rating": 5.0, "stay_parameters": "Stayed May 2011", "text": "Will definately seek this one out on our return the NYC!!", "title": "Would return", "helpfulness": 2, "user": "Jetsetterlover", "date": "August 5, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 116320103}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "Our stay at the Affinia Shelburne was great. The hotel location in the Murray Hill area is very good, within short walking distance of the Empire State building, and reasonable walking distance of Times Square. It's just outside of the crazy busy area, which was just fine with us. The room was large, very clean, everything was recently updated, comfortable bed, nice washroom, flat screen tv on wall, our room was quiet. The reception and concierge service was very friendly and helpful. The price was excellent also for NYC, more priced like a 3 star vs. 4 star which I felt it definitely lived up to. We will definitely return to the Affinia Shelburne for our next NYC trip.", "title": "Comfortable, clean hotel and great staff!", "helpfulness": 5, "user": "BHolt", "date": "August 4, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 116281738}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "Stayed in this hotel for 2 nights on either side of a cruise in May 2011 and had booked 1 bedroom suites. On arrival for our first night we we were advised that we had been upgraded to a 2 bedroom deluxe suite. Having never been in America let alone New York it gave us a great first impression of USA!! The suite was amazing - 2 bedroom and 2 bathrooms and so much space we could nearly have lost each other in it! It was spotlessly clean and the beds were so comfy. It was also amazingly quiet for being inthe middle of Manhattan. On our second night at the end of the cruise we got a one bedroom suite which was also massive and had a balcony with views straight over to the Empire State Building. I could not find one fault with the rooms at this hotel - they were very impressive. The decor of the whole hotel was very attractive and we had a lovely breakfast in the hotel restaurant on our 2nd morning. I would like to give a special word of praise for the porters at the hotel - especially Denis. They were so friendly and helpful when we had absolutely no idea about finding our way round New York or hailing cabs!", "title": "Fantastic Rooms", "helpfulness": 1, "user": "waringstown8", "date": "July 29, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 4.0}, "id": 115958186}, {"rating": 4.0, "stay_parameters": "Stayed November 2010, traveled with friends", "text": "The location of the hotel was brilliant - just about 5 mins from Grand Central Station, 5th Avenue, Empire State Building etc so plenty of scope for exploring on foot.", "title": "Affordable luxury when booked in advance", "helpfulness": 1, "user": "Sez100", "date": "July 29, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 4.0}, "id": 115953593}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled with friends", "text": "The only slight criticism I would have to make would be regarding a few of the staff on reception. We were a bit confused as we understood payment had been for our stay at the hotel when we gave our credit card details on the internet, however, the receiptionist proceeded to ask for our card for payment on arrival. When we questionned this, she was very impatient and even a little aggresive. She didnt allow for the fact that we were even struggling to pick up what she was saying with her different accent. All i'm saying is that it wouldnt have been difficult to be pleasant and courteous when we couldnt understand her!", "title": "Great NYC hotel at the right price", "helpfulness": 1, "user": "NannarellaBoston", "date": "July 29, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115943156}, {"rating": 3.0, "stay_parameters": "Stayed July 2011, traveled with friends", "text": "But that aside I would defintely love to return to this hotel:-)", "title": "I have mixed feelings about the Shelburne too", "helpfulness": 1, "user": "JB3000", "date": "July 28, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 3.0, "value": 3.0, "service": 2.0}, "id": 115929652}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "Has a great casual bar downstairs that was frequented by lots of locals. Good choice bar menu.", "title": "We loved it and would stay there again", "user": "lyn07", "date": "July 28, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 115927089}, {"rating": 3.0, "stay_parameters": "Stayed July 2011, traveled on business", "text": "going to the website and looking around my expectation was something out of the ordinary and in fact found the place to be quite ordinary", "title": "Looks better on paper", "helpfulness": 1, "user": "GWVan", "date": "July 28, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 3.0, "value": 4.0, "service": 3.0}, "id": 115900310}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "clean, modern, good value, competent staff.....no real complaints", "title": "Exceptionally comfortable beds, plenty of space, great view.", "helpfulness": 1, "user": "3littlepigsgotroppo", "date": "July 27, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 3.0, "service": 3.0}, "id": 115872019}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "just nothing special", "title": "Loved the Affinia Shelburne", "helpfulness": 2, "user": "candygirlky418", "date": "July 27, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 4.0}, "id": 115835085}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "We booked 2 one bedroom suites for our family of 5 so as each teen had a separate bed. We been warned that NYC hotel rooms were tiny so we were very pleased to find the one bedroom suites we booked were as spacious as they had promised.", "title": "Great hotel, just needs a few tweeks", "helpfulness": 2, "user": "mclarenf1", "date": "July 26, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 3.0, "service": 4.0}, "id": 115811379}, {"rating": 3.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "We were disappointed to find, however, that there was no kitchen in the suites, I had understood there would be, and that the rooms were two floors apart even though we had asked they be on the same floor. It turns out if you want a kitchen you need to book a deluxe suite (which I would have, had I known) and that there is only one of the one bedroom suites on each floor. We live and learn!", "title": "Mixed feelings about the hotel", "helpfulness": 3, "user": "JBCO", "date": "July 23, 2011", "detail_rating": {"cleanliness": 2.0, "sleep": 4.0, "value": 3.0, "service": 3.0}, "id": 115670600}], "location": {"country": "United States", "city": "New York City"}, "stars": 4, "variance": {"poor": 84, "average": 173, "very good": 974, "terrible": 52, "excellent": 1222}, "aka": "Affinia Shelburne Hotel New York City", "slim_ranking": 0.194130925508, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "Here’s an escape from the city that’s well worth looking into. Or out from. Take a look at the new Affinia Shelburne (formerly the Shelburne Murray Hill). It’s still Murray Hill, one of the coolest and most convenient of Manhattan neighborhoods. But now it’s brighter, bolder, more in tune—thoroughly renovated and ready to dazzle.We are happy to announce Affinia Shelburne is hosting a new Wine Hour in the lobby, daily from 5 - 6 pm. This new wine happy hour in NYC will allow you to mix and mingle with fellow guests and our management team, while enjoying complimentary red or white wine.With 325 brand new guest rooms and suites, the Affinia Shelburne's unique design offers travelers a place to connect with friends, family or colleagues. Rooms feature eclectic décor, flat-screens and giant mirrors. Sleek kitchenettes or minibars and bright, new bathrooms. Looking for a view that could inspire dreams of Empire? Check out our select group of Terrace Suites."}