{"user_rating": 5.0, "review_count": 273, "name": "Afroessa Hotel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "I don't know what to say that hasn't already been said. Afroessa is now a part of my version of paradise. After reading the reviews here, I'd really wanted to book a suite but unfortunately waited too long - we ended up booking a standard room and couldn't have been happier! We called room 6 home for 4 days and 5 nights in early October and it was amazing. The room was quite large - we liked the decor and the differentiation between the living and bedrooms. The porch was fantastic - right on the path between Fira and Ia, and the perfect place to take in the sunset! We made sure to be back every night for the sunset and were never disappointed. Being right on the path, we did see a bit of foot traffic but it was not bothersome - I'm not sure how this would be during peak season, however. Joanna recommended quite a few restaurants in Imerovigli, Fira and Oia when we arrived, and I think we tried all of them - we were never disappointed! Amazing food, amazing location! We don't often like to repeat vacation locales but I could be very easily convinced to make a return trip. Recommended highly!", "title": "Paradise.", "user": "Alybyzrp", "date": "October 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 181734425}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "Afroessa is at the far end of Imerovigli, beyond the point that's accessible by car. It's a small boutique hotel with rooms carved into the cliffs, amazing sunsets and unparalleled beauty.", "title": "Blissful-The Essence of Santorini", "user": "lor1014", "date": "October 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 181521619}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "We could actually see the caldera from our bed that looked out over our private balcony. We had a small kitchen area with fridge & dishes, and room service is also available. The pool was nice with the same gorgeous view and a bar in a little \"cave\" area which also had seating for those who wanted to be out of the sun.", "title": "This hotel made our honeymoon!!", "user": "j_ollerenshaw", "date": "October 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 180367035}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "Joanna, the owner, and staff were warm, friendly and willing to arrange any trips, transportation or meet any other needs. The village has some really good restaurants, and Fira and Oia are easily accessible by public transportation, or taxi. We enjoyed several day trips, but always looked forward to returning to our little piece of paradise.", "title": "Great Place to stay!!!", "helpfulness": 1, "user": "Mel S", "date": "October 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 180315483}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "The price was VERY reasonable when you consider the location, ambience and attention to detail. We loved everything about Afroessa, and would love to return some day.", "title": "The Best!", "user": "Danielle T", "date": "October 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 180127225}], "location": {"country": "Greece", "continent": "Europe"}, "stars": 4, "variance": {"poor": 1, "average": 2, "very good": 25, "terrible": 0, "excellent": 245}, "aka": "Afroessa Hotel Imerovigli", "slim_ranking": 0.075, "description": "The Hotel \"Afroessa.\" Afroessa hotel praises romance. Our guests experience the exceptional view from our \"old canavas\" rooms, set atop Santorini's hillside. The original site of a winery built in 1700, it was renovated in 1998 on its existing foundation. Our ten studios, each with its own unique archway are built on five levels, with their own magical view of the Caldera. Each studio is individually decorated giving each its own distinct character, yet maintaining the traditional style. The beds are built into the foundations and the furnishings and decorations chosen so as to enhance the warm and romantic feelings created by the surroundings. The priceless moments which you will experience during the enchanting sunsets from your balconies and the relaxing pool bar, with chill-out music will forever remain in your memories, reminding you of the serene calm and magic of Afroessa."}