{"user_rating": 4.0, "review_count": 253, "name": "Agave Inn", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "We had to book this hotel last minute for a wedding on the La Fiesta weekend. What a great choice. Wendy & Susie were amazing and extremely helpful. It's a hidden gem and the rooms were very comfortable and slightly posh. I like how it's slightly off the beaten path from the main State Street scene because you can get away from the noise and traffic. Also, across the street is a perfect French Cafe that serves amazing breakfast to take back fro breakfast in bed.", "title": "Great Value with Very Helpful and Friendly Staff", "user": "marc242", "date": "August 14, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 37672121}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "Cute, clean, bright cheery room!! Nice bed linens. Great value and location. Bathroom a little cramped and no place to set down items like toothbrush, makeup etc. Mirror in bath too small. Super friendly and helpful staff. Good continental breakfast. Plan to stay again!", "title": "Great Value-Pleasant Stay!!!", "helpfulness": 1, "user": "Muffie60", "date": "August 11, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 37323326}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "I didn't know what to expect from this newly remodeled motel - I was worried about possible noise, enough room, cleanliness....", "title": "Top Value in SB, Surprisingly Restful Gem!", "user": "ca_reviewer_08", "date": "August 6, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 36940442}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "Agave Inn was a delight! Our room was on the upper level away from State Street which made it less noisy. It backed up against a little alley with a pretty view of blooming bougainvillea. We had two double beds which were not plush, but did the job. I was happy to find there were no waxy comforters - only cotton sheets.", "title": "Fabulous, yet affordable", "user": "bankergirl76", "date": "July 17, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 35001576}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "Our room also had a pull-out sofa (super comfy) and a small kitchenette - what a treat! This was great since we were traveling with two very small children ages 2 & 4. They loved the room and it was pretty easy to kid-proof. TV was up high, away from small hands.", "title": "Very good for the price", "user": "dasevilla", "date": "July 16, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 34892307}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "Santa Barbara is not cheap for hotels so this budget hotel is a welcome relief. It's a Mexican/pop art funky, clean, budget motel with flat screen tv, shower/bath, free wi-fi, ipod radio, fridge and microwave and clean sheets on a comfortable bed. If you are looking for somewhere safe to rest your head each night for under $100 while you explore SB this is it. If you are looking for somewhere to relax in - then look elsewhere.", "title": "Funky, clean, budget motel", "user": "clareawasw", "date": "November 27, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 50181235}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled on business", "text": "Best value motel around.Nicely decoreted,very pleasent services.", "title": "Best value motel around.", "helpfulness": 1, "user": "ADRI10", "date": "November 17, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 49383985}, {"rating": 3.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "Very clean ,is well-located and has everything you need .", "title": "OK for an stop-over", "helpfulness": 1, "user": "psychotante", "date": "November 4, 2009", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 3.0, "service": 2.0, "rooms": 3.0}, "id": 48483098}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "Friendly and helpful staff.complementary breakfast, which includes fruit was more than adequate.", "title": "Superb value!", "helpfulness": 2, "user": "orangemike", "date": "October 30, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 48127987}, {"rating": 2.0, "stay_parameters": "Stayed October 2009, traveled with friends", "text": "We stopped in Santa Barbara for one night on our way to San Diego. The room was clean and newly renovated. It was a little bit noisy because of the street which goes along the room doors. Breakfast was meager but ok.", "title": "Not what we expected...", "helpfulness": 1, "user": "lablove333", "date": "October 26, 2009", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 1.0, "service": 3.0, "rooms": 3.0}, "id": 47835723}, {"rating": 5.0, "stay_parameters": "Stayed September 2009", "text": "During our trip up the west coast we stayed two nights in the Agave Inn. Even though it's far away from downtown, if you got a car you're fine. The rooms were clean, nice decorated and very comfortable. The management is very friendly and helpful.", "title": "Very nice, I will be back!", "helpfulness": 1, "user": "Apple2009", "date": "October 14, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 2.0, "service": 5.0, "rooms": 5.0}, "id": 46836086}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "My Wife & I stopped here for one night on our way up the coast to San Francisco. This place has been recently refurbished. Nice clean room, LCD TV on wall, fridge, microwave, air-con and shower& free parking. Our king size bed was comfortable with the whitest sheets I have ever seen. Both Wendy & Suzanna on reception were lovely. The complementary breakfast, which includes fruit was more than adequate. It is located at the top end of State Street just round the corner from California 1. We would recommend this place to anyone.", "title": "Good value for money", "helpfulness": 1, "user": "bogla", "date": "September 26, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 44710177}, {"rating": 3.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "My husband and I just returned from a stay at The Agave Inn. We were looking for a reasonably priced hotel in Santa Barbara and after reading the reviews on Trip Advisor booked with Agave. For the price the motel was fine--the rooms were clean and spacious and there were complimentary baked goods and coffee each morning in the lobby area. There was a little balcony upstairs at the motel which was nice to sit out on before going out for the evening. The hotel is located on State Street, but I will warn you that it is not within walking distance to the shopping area. Overall, the place \"no frills\" was a great buy for the money in \"expensive\" Santa Barbara.", "title": "Budget Friendly Hotel", "user": "asmolyn01", "date": "September 22, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 3.0, "service": 4.0, "rooms": 3.0}, "id": 43697480}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "The Agave Inn is the best motel that I have ever stayed in. It brought me to the atmosphere of elegance. The place provided a peaceful environment with a friendly staff. The motel is colorful and lively. Its location is great because it is two miles from the beach and it is right on State Street where all the action is. You can do anything when you stay in the Agave Inn because it is surrounded by activities. I will definately go back to the Agave Inn some day.", "title": "Pleasant Stay", "user": "sensen", "date": "August 27, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 38927454}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled with friends", "text": "Stayed in the Agave inn with five of my friends. We had a room with one two-person bed and a room with two two-person beds. We loved the placed. The re-decoration looked incredible. By far the cosiest motel we stayed in during our trip thru America. Clean and comfortable and no noise from the raod outside.", "title": "A home away from home", "user": "Friso", "date": "August 24, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 3.0, "service": 5.0, "rooms": 5.0}, "id": 38669118}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled with friends", "text": "I was utterly surprised by the cleanliness, uniqueness, warmth and hospitality of this place. What looks like a regular motel along the side of the road, is actually a well looked after \"find.\" The hostess gave us maps and had fresh yummy scones and coffee in the morning. Not only was the room clean, but it was decorated and furnished with love and care.", "title": "Agave Inn is a special place", "user": "sunsurfandsand", "date": "January 1, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 52312684}, {"rating": 5.0, "stay_parameters": "Stayed December 2009", "text": "We stayed here based on the reviews and it was good. It's not 5 stars but neither is the price. This hotel is very clean new and the people are nice.", "title": "Clean and worth the stay", "user": "travelingaussies", "date": "December 28, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 51978561}, {"rating": 4.0, "stay_parameters": "Stayed December 2009", "text": "We stayed on a Saturday night and had no issues with noise and the breaky was enough to get us back on the road. We would stay again.", "title": "GREAT VALUE-SUPER CLEAN!!!", "user": "santabarbaraserenity", "date": "December 26, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 51915442}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "Okay, so there is no pool, parking is tight, the beds are a little hard, and the continental breakfast is fruit and coffee. But the innkeepers are very pleasant, and this place is clean (renovated in July), quiet, convenient (to my house and my work) and very, very inexpensive. I rented Rm. #8 (small queen room farthest from the street on the ground floor, with one common wall and one outside wall-i.e. neighbor on only one side) for my brother for Christmas Eve and Christmas night. Cost with tax for both nights-$165 (for both nights-not each night!) It cannot be beat! Just note that Susan, one of the innkeepers, mentioned that this room can get a little noisy after 8 am b/c it is by the coffee and fruit available for the guests in the morning; my brother heard nothing. I will use this place for guests, both personal and business, as long as the rate remains so low. Presently it is the best deal in town!", "title": "Perfect when you're going to Santa Barbara", "helpfulness": 1, "user": "HollandTom", "date": "December 1, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 4.0, "rooms": 5.0}, "id": 50440888}, {"rating": 4.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "First we wanted another motel (Presidio Motel), but they were full. The advised us to go to their sister property, Agave Inn. Cheaper and even as well as Presidio. Sounded good and... it was!", "title": "Charming Old Style Motel", "user": "674", "date": "November 30, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 50362239}], "location": {"country": "United States", "city": "Santa Barbara"}, "variance": {"poor": 4, "average": 28, "very good": 105, "terrible": 5, "excellent": 111}, "aka": "Agave Hotel", "slim_ranking": 0.216666666667, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "description": "The Travelers Motel is now the AGAVE INN !!!!! Agave Inn is a small 13 room boutique hotel. Mexican pop meets Modernists vibe. Free WiFi,continental breakfast,and Ipod players in all rooms. Conveniently located close to Earl Warren Showgrounds, Sansum Clinic, Santa Babara Municipal Golf Course and downtown. We look forward to seeing you soon!"}