{"user_rating": 5.0, "review_count": 126, "name": "Agriturismo San Fabiano", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed July 2012", "text": "Our family of four just finished a week stay in San Fabiano. The vacation was great. We enjoyed the small town of Monteroni and the agriturismo. Filippo is probably the friendliest count you will ever meet. Our vino accommodation was perfect. My son and I enjoyed the lovely pool every day. Nice setting for exploring the towns of Siena, Montepulciano, Pienza, and Montereggoni but then returning to a quiet town away from the crowds, The hosts Filippo, Rachel and son David were just lovely. would recommend and return in a heartbeat.", "title": "Friendly and relaxing", "helpfulness": 1, "user": "MikeyBikey", "date": "July 9, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 133906109}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with friends", "text": "We had a wonderful time at San Fabiano. We went with 3 other couples - all of us friends - who had planned for years to travel together. San Fabiano exceeded our wildest dreams. The villa is located in a small town outside Siena, pastoral yet not far from a city. The grounds are beautiful, the rooms spacious and very clean, and equipped with all the necessary equipment. Because we were a group, we were able to make use of the common kitchen and dining areas, also well- equipped. Rachel and Fillipo were amazing hosts - they made every effort to ensure that our stay in San Fabiano was perfect.", "title": "Can't Wait For Our Next Visit", "helpfulness": 1, "user": "Neil A", "date": "May 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130869567}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "San Fabiano is the perfect place - whether you travel all day and relax in the evenings, or spend all your time just relaxing and enjoying the beautiful scenery and the tranquility that Tuscany has to offer.", "title": "Peaceful birthday present", "helpfulness": 1, "user": "TravelDoIt", "date": "May 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 130472503}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "We had a lovely one night stay at San Fabiano. The stone house is beautiful, decorated with a personal collection of artwork and personal belongings from the Count and Countess' families. Comfortable rooms and beds afford a quiet, restful night (next time I will open the window and enjoy the county night sounds). The kitchenette was well equipped and our hosts provided basics to keep an always-hungry, growing child satisfied.", "title": "Terrifico!", "user": "AviSch", "date": "May 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 129932922}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "I cannot wait to stay at this agriturismo later this summer.", "title": "beautiful place and wonderful hosts", "user": "shamBahrain", "date": "April 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 127941259}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "the station monteroni d arbia does not have very frequent trains from Siena so one needs to make plans for daytrips depending on the train timings.", "title": "DreamLand!", "user": "superdelicious", "date": "April 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127676526}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "Overall a wonderful stay, would surely recommend thsi place if you want to stay in a quiet place with natural beauty in abundance in a very homely environment.", "title": "amazing place and hosts", "user": "Moran Y", "date": "March 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 126588634}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled with friends", "text": "When you think of Tuscany, you think about San Fabiano: The house, the excellent big suites, the hospitality, the big quiet fields, the nearby village and shops, the private kitchen to cook, the short distance to all nearby villages (and ice cream) - guys, this is it!", "title": "One of the most amazing places in the world!!", "user": "Ronen P", "date": "March 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 126583998}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with friends", "text": "p.s - don't tell anyone I said, but if you ask nicely Fillipo may sing to you. and what a voice he has! so look no more folks, and welcome to Tuscany!", "title": "best vacation", "user": "Einat L", "date": "February 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 125266032}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled solo", "text": "There are unlimited possible area travel by bicycle, car or on foot.", "title": "\"One never get enogh from this beautiful place and its wonderful hosts\"s", "user": "Jana664", "date": "February 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 125201348}, {"rating": 5.0, "stay_parameters": "Stayed July 2012", "text": "Our family of four just finished a week stay in San Fabiano. The vacation was great. We enjoyed the small town of Monteroni and the agriturismo. Filippo is probably the friendliest count you will ever meet. Our \"il vino\" accommodation was perfect. We appreciated the little touches like olive oil, balsamico and your first breakfast that most places don't have for you as well as the screen on the bedroom window to let in the cool night air.", "title": "Friendly and relaxing", "helpfulness": 1, "user": "MikeyBikey", "date": "July 11, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 134110682}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "We spent 3 nights in the beautiful Il Vino apartment in the main house of San Fabiano...it was very spacious with an amazing kitchen......we loved the beauty and history of our space and enjoyed very much the graciousness of our hosts.....they are a wonderful family with just the right balance of being there if you need them and letting you feel like San Fabiano is your own private villa....we rented a car after leaving Florence and drove down to San Fabiano (very easy and simple drive) and spent the days by car exploring the wonderful sights of Tuscany (follow Fillippo's suggestions for day trips, he gives great advice) before driving to Rome to complete our vacation....we loved the little town of Monteroni D'Arbia.... easy walk in with a wonderful gelato shop and a nice restaurant where we had the best Spaghetti Carbonara.... we were the only 'tourist's in town and felt like residents for the few days..everyone was friendly and nice even though we spoke no Italian... we stayed.if you are lucky to be there on a Tuesday, go to the morning market for a real sense of small village life...highly recommended and next time we want to stay in the small private villa on the property!", "title": "Beautiful property and excellent Tuscan 'Base Camp'", "user": "Andrea E", "date": "October 17, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 119409320}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled with friends", "text": "Coming back to \"San Fabiano\" is like coming back to your friends. If you wish to forget all your day-by-day problems, come to stay at this place. Located in the middle of the farm fields. Sit under the beautiful trees next to the pool and listen to the wind, and understand the value of the word tranquility.", "title": "The Best Place to Celebrate your Birthday with your Friends", "helpfulness": 1, "user": "Uri L", "date": "October 12, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 119212076}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "We were a party of three rooms, celebrating my round birthday.", "title": "Great Family Vacation In Tuscany", "user": "unixnerd", "date": "September 30, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 118773740}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "This is certainly not the last time they will see me at \"San Fabiano\".", "title": "Magical. We loved it!", "helpfulness": 1, "user": "Charlie307", "date": "August 29, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117427276}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "We spent a week at this farm with our two kids and another family with two kids. It was perfect. We barely saw the children all day because they were outside playing. In addition to the place itself, the location is great too. Very close to several key towns: Florence, Volterra, Sienna, and Rome is only a few hours away.", "title": "Beautiful!!", "user": "khallahan75", "date": "July 6, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115101141}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "We stayed for 8 nights in one of the main house apartment/suites. The apartment was very comfortable, clean and had a nice view of the countryside from our bedroom and livingroom.", "title": "A wonderful stay in Tuscany", "user": "longmountain", "date": "November 1, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120049634}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "It is a must to spend yout holliday in San Fabiano.", "title": "Great location and hosts.", "user": "lisabug11", "date": "November 26, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 121053997}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "We had a wonderful stay with Fillipo and Rachel. Their house is beautiful, the rooms are HUGE, and they had a full kitchen set-up and it was stocked with breakfast items. They welcomed us right into their home and gave us a bottle of wine that is produced on their estate (we drank it when we got home and it was amazing - also got rave reviews from our family that we shared it with). They were always available for questions, and once they knew what our general plan was, they gave us really great advice. We even met the housekeeper and grounds/maintenance worker and both of them gave us amazing advice as well. If it wasn't for everyone's input, we may have missed Siena, and that turned out to be our favorite place throughout our entire stay! There is a small train station in the town, which made it very easy to get to Florence, I'm sure you could get plenty of other places as well. We stayed after the sunflowers were harvested, but I can't imagine how beautiful it must be when they are in full bloom. Throughout our entire trip in Italy, this family and their staff were by far the most friendly and most accommodating people we met. We were very glad to have chosen this place to stay, and hope to return again for a longer period of time so we can enjoy all that they had to offer.", "title": "Great Villa, Wonderfull Location, Amazing Hosts!", "user": "Avicam G", "date": "November 22, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120899793}, {"rating": 5.0, "title": "Wonderful experience", "text": "We stayed with Filippo and Rachel for a week at the end of October in the main house. There is so much to say about the villa and location, but the main charm of the place are the wonderful hosts. Filippo and Rachel who own the villa, their son David, and the housekeeper Alexandra made us feel so welcome and did everything possible to make our stay fantastic.", "user": "Avraham H", "date": "November 14, 2011", "id": 120578718}, {"rating": 5.0, "title": "Lovely hosts, nice accommodations", "text": "The villa itself is beautiful with the surrounding fields and nature ideal for a nice morning or evening stroll. They even have bikes on property that we used to ride around the paths and go into town which is barely a 10 minute walk away and takes a couple of minutes by bike. Market day in Monteroni d'Arbia is on Tuesdays and we spent the morning shopping for fresh produce and my wife did some shoe and clothes shopping there. Sienna is about a 15 drive to the north and you can get to the most popular destinations in Tuscany in about 30 to 40 minutes (Montepulciano, San Gimignano, Arrezo, Voltera, Cortona, etc) .", "user": "Yosef W", "date": "November 2, 2011", "id": 120058531}], "location": {"country": "Italy", "region": "Tuscany", "continent": "Europe"}, "variance": {"poor": 0, "average": 1, "very good": 9, "terrible": 0, "excellent": 116}, "aka": "Agriturismo San Fabiano Hotel", "slim_ranking": 0.666666666667, "description": "romantic place where to enjoy music, good food, long wals on top of the rolling hills watching the nature and Siena skyline."}