{"user_rating": 5.0, "review_count": 23, "name": "Agriturismo Le Macchie", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "My husband and I (and young baby) rented the studio apartment at this lovely property. I cannot say enough good things about it. It met our expectation in all respects! The property is wonderfully located with beautiful views of the Tuscan hills from nearly every vantage point. There is a lovely pool with equally breath taking views. The studio apartment is very private, hidden away from the rest of the two larger apartments with a private outdoor seating area. The studio itself is very tastefully decorated, clean with a well equipped kitchen. As we were traveling with a baby, they set up a nice cot for her too. The groundsman is a lovely man Gianmario - he speaks a little English but is more than willing to help you out with any issue. The property itself is located quite near to montechiello - which is a very beautiful town and not nearly as touristy as other ones in the area. It is also about -a 20 min drive from both pienza and montepulciano. Our stay at le macchie was the highlight of our trip. I highly recommend it!", "title": "Stay here!!! You won't be disappointed.", "user": "fortunecookies", "date": "August 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 173342757}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "My wife and I rented Le Macchie in June 2012 for our wedding celebration, and we could not have picked a better spot.", "title": "Picture Postcard Tuscany", "user": "brooklyncowboy", "date": "November 4, 2012", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "location": 5.0, "value": 4.0, "rooms": 4.0}, "id": 144487724}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "The scenery is absolutely stunning - picture post-card perfect Tuscany. We visited the premises in October for the first time during the scouting trip, but it is summer time that truly gives it justice.", "title": "A superb villa in a superb setting", "helpfulness": 2, "user": "alpswhites", "date": "August 10, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 116514780}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "The property itself is well-maintained, the furnishings are rustic and ample. The owner of the property actually vacations there himself, which is reflected in the attention to detail there. Property manager Gianmario takes excellent care of the grounds and attends to any issue that arises in a timely manner -- not be taken for granted when in Europe.", "title": "Quiet hideaway in the Val d'Orcia", "helpfulness": 1, "user": "redesme", "date": "June 11, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 112801815}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "This is not a full-service villa with maid or butlers attending to your every need. It is more of a summer house, and the best way to take advantage of it is to come with a fun group of people who enjoy eating good food, drinking good wines and exploring the surroundings. Perhaps, one of the biggest advantages of Le Macchie is the location. You are right in the heart of Tuscany with easy access to some of the best wineries, cheese shops, pastry shops in the country (possibly the world)", "title": "Stunning views - very comfortable stay", "helpfulness": 1, "user": "Mumwithyoungfamily", "date": "August 23, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 76437056}], "location": {"country": "Italy", "region": "Tuscany", "continent": "Europe"}, "variance": {"poor": 0, "average": 1, "very good": 3, "terrible": 0, "excellent": 19}, "slim_ranking": 0.777777777778, "description": "Le Macchie is a farmhouse in Tuscany located in the earth of the Val d'Orcia, close to Pienza, Montepulciano and Montalcino. The Val d'Orcia was added to Unesco's World Heritage List in 2004."}