{"user_rating": 4.0, "review_count": 164, "name": "AKA Central Park", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "We paid 3000 us in advance for 7 nights here in October for at \"Deluxe Studio\".", "title": "Great location - at a price - no real kitchen", "user": "travelviking", "date": "October 23, 2012", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 143527950}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled on business", "text": "The room we were supposed to stay in was terrible. Very dark, small and with a constant noise from an outside ventilator engine right outside the window. We complained instantly and we managed to get a better room with no noise and much more light on the third floor.", "title": "Big Rooms in a Great Location", "user": "MarthaMcCully", "date": "October 20, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 143294042}, {"rating": 2.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "We thought we had a real kitchen in the place, but it was just a microwaveoven and a fridge plus dishes etc. So it was not possible to cook in the room, which was a disapppointment to us.", "title": "Hit & Miss hotel experience...Bigger Misses..", "helpfulness": 4, "user": "RollPositive", "date": "September 3, 2012", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 2.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 139279186}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "The bathroom was very nice but small. The bedroom was nice, good bed and cable tv.", "title": "A Restful Week", "helpfulness": 1, "user": "Denverlily", "date": "August 31, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 139022386}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "They do not remove your trash unless you call for them. The room is only cleaned once a week.", "title": "Perfect for a family", "helpfulness": 3, "user": "DubaiLondon", "date": "August 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 138763909}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled with friends", "text": "We booked this hotel last minute. Got a decent price for NYC standard, it was $295/night. The hotel lobby was small, nothing special. Checked in was painless, no waiting. Parking garage was adjacent to the hotel, standard price $50/night. Location is great, very close to central park, a few blocks from the subway station, very close to the famous Apple store and shopping area.", "title": "great value, big room in NYC", "user": "TravelNut2008", "date": "July 24, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 135218053}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "We were surprised to learn that the room is actually pretty big for NYC standard. We got a deluxe room with a wet bar area/microwave and refrigerator in the room. Our friend who booked earlier online had even a larger room - one bedroom suite - with a separate living room and full kitchen!! She paid the same price as I did. For the price we paid we're very happy with what we got. Will definitely go back again to stay here.", "title": "Excellent Hotel with great location", "helpfulness": 1, "user": "Randy N", "date": "June 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 132896341}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "My wife and i just got back from a week in NYC and stayed here. i was absolutely impressed with this hotel. i felt the price was great for its location. the service was great. room service came everyday. they even cleaned our wine glasses and put them back in the cabinets. the staff in the lobby was very friendly and knowledgable. the front desk were more than happy to arrange for car service, make dinner reservations, or try to help you get tickets to shows/games. i actually witnessed the doorman hail a cab for another couple in the rain! the location is superb. it is just a block south of central park. the doorman told us we could cut through the hotel across the street to get to the park instead of walking around the block. the hotel is also close to a couple of subway lines that can take you anywhere. the next time we go to NYC we will definitely stay here again and i would absolutely recommend this place for anyone who is going to NYC.", "title": "Perfect for a longer stay", "user": "blackcap", "date": "June 26, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 132795313}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "As we were staying 7 days in New York we wanted accommodation with decent living space, kitchen & laundry facilities while also providing hotel amenities. The AKA Central Park hotel had all of this. Our room was on the 12th floor. It felt really roomy and had a balcony. The kitchen area was quite basic, but enough to allow us to have breakfast in the room and the odd snack. I used the gym a couple of times. It has extremely modern equipment, a great range of weights and cardio and a good atmosphere. The staff were friendly and helpful. The location was excellent. It was a great hotel for our needs.", "title": "Great location, fantastic amenities in New York apartment", "user": "Tuppy2011", "date": "June 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 131733380}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "Stayed 8 nights whilst attending The Ring Cycle at the Lincoln Centre. Our second visit to this hotel and this time we chose the 1-bedroom apartment. The location, just behind the Plaza Hotel at Central Park, is fabulous and within walking, subway, bus or short taxi distance from almost anywhere in NY. Around the corner form Carnegie and 5th Avenue is at the end of the street.The apartment is great, although I think the kitchen utensils need to be improved for people who actually want to do some cooking - and yes I do know that NO-ONE cooks in New York! For the rest of us, Whole Foods at Columbus Circle is only a couple of blocks away and there's a great wine shop on the way. The staff at the hotel are helpful and there's a nice bar on the ground floor which is unfortunately usually empty - shame because it's very nice. The hotel can arrange cars to and from airports at reasonable rates if required. This is our second stay and we'll certainly come back again. It's not cheap but it's great value for money for this part of New York.", "title": "Handy self catering hotel near Central Park", "helpfulness": 1, "user": "Angie047", "date": "May 16, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 130027095}, {"rating": 5.0, "title": "Clean, Classy, European feel", "text": "The pictures already posted is exactly what the rooms look like. Staying here for two weeks and I can say, the rooms are spacious with lots of drawer space and a big walk in closet. 1 block from central park so good for runners and there's a first class gym in the hotel with new equipment. Staff are very friendly. Wifi is free, great cable service and the hotel has a nice scent. Once you book a hotel specialists contacts you to find out your needs. Remember to ask for your room serviced more than once every 7 days. It is possible to bargain daily cleaning. Views are inside hotel or of 58th street. Very impressed for NYC.", "helpfulness": 2, "user": "nigerian_princess", "date": "April 7, 2012", "id": 127440274}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "Across 58th Street from the Plaza Hotel, between 5th and 6th Avenues, AKA Central Park could not offer a better location. Bus and subway connections are superb, but so much of what people come to New York City for--theatre, shopping, museums, restaurants--is within easy walking distance. Straightforward and business-like, the hotel feels more intimate than its 130 or so rooms over 12 floors: the staff is cordial and helpful. (A container of large umbrellas appeared by the door when rain was forecast.) And breakfast in the hotel cafe is part of the charge for the room: a good range of choices on the menu--bacon and eggs to fruit salad. The room was spacious enough, the bed very comfortable, and the maintenance top quality. And since it is a hotel specializing in longer stays the rooms have kitchenettes (refrigerator, microwave, coffee maker). We paid $295 a night for a five-night stay and plan to return on our next visit there.", "title": "Not Cheap but a Terrific Value", "user": "BBonnet", "date": "March 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 126867898}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled with friends", "text": "(This review is for a party I organized in the a.lounge at the AKA Central Park hotel.)", "title": "great event i organized in the a.lounge at the AKA Central Park hotel", "user": "diebzak", "date": "February 16, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0}, "id": 124678362}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "I used the a.lounge at the AKA Central Park hotel for a birthday party reception for my wife. It was a huge success – a great space, wonderful service and a very reasonable price.", "title": "Great place to stay!", "helpfulness": 1, "user": "Baronent", "date": "February 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 124498654}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "Before the event, my wife had played a piano recital nearby (just steps away from Carnegie Hall!), so I was looking for a space in the area that could serve drinks and heavy hors d’oeuvres in a good atmosphere for about 30 to 40 people. I called around a few places, got some quotes (some of them outrageous) and eventually chose the AKA Central Park. Apart from the price, I was very impressed with the space and with the can-do attitude of the lounge’s manager, Marta. I was not disappointed.", "title": "Perfect location, fantastic staff.....", "helpfulness": 1, "user": "Lilyee", "date": "January 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 123758257}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "Just got back from a 7 day stay at this hotel with my 2 children. We had a one bedroom suite with fully equipped kitchen. Great location- steps away from Central Park, Plaza and FAO Schwartz. Great value. Very helpful and friendly staff.", "title": "AKA Central Park", "helpfulness": 2, "user": "Phil340", "date": "August 18, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 137531031}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "Would have rated excellent if daily cleaning was included in the price, as opposed to weekly.", "title": "A large hotel room in NYC?", "helpfulness": 2, "user": "ColmEFabio", "date": "August 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 137290601}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled on business", "text": "Warning to out-of towners: although this is absolutely not the hotel's responsibility, you need to add a surprising 18% (in my case 500U$) surcharge to the rate for taxes.", "title": "amazing as always", "user": "perryb6", "date": "August 4, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 136246366}, {"rating": 2.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "Highly recommended.", "title": "Don't go there", "helpfulness": 1, "user": "ManchesterPam", "date": "August 1, 2012", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 135989564}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "A travel agent recommended the AKA Central Park to us for a ten day visit to NYC. For what many people have paid for a mere hotel room, we ended up with a 600 s.f. living room, bedroom and kitchen, all of a high standard and very nicely and tastefully fitted out, all in a great location only one short block south of Central Park and 1/2 block from 5th Avenue. This was a perfect location for a visit to the city and a perfect place to return to at the end of the day, with room to stretch out and lounge about. If we wanted to eat at restaurants, we could; if we wanted to cook in the hotel room, we could. Breakfasts were at our leisure in the comfort of our own spacious apartment. The business centre is nicely outfitted with computers (never crowded), there is reliable free WiFi throughout the hotel and the gym was very well equipped and never even close to overcrowded. The staff were perpetually pleasant and helpful. Although our bedroom faced onto 58th Street, there was no problem at all with noise. We had never heard of the AKA chain before, but we shall definitely keep our eyes open for it in the future.", "title": "very good value and excellent location", "user": "brightonup", "date": "July 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 135420908}], "location": {"country": "United States", "city": "New York City"}, "stars": 4, "variance": {"poor": 7, "average": 13, "very good": 62, "terrible": 7, "excellent": 75}, "aka": "Aka Central Park Hotel New York City", "slim_ranking": 0.0727272727273}