{"user_rating": 2.5, "review_count": 50, "name": "Al-Mar Hotel", "reviews": [{"rating": 1.0, "stay_parameters": "Stayed October 2006, traveled solo", "text": "I stayed thee on the way from Sevilla to Seuta and disappointed this three-star hotel. The facilities are very old (TV was not worked) and a room is not ckean (a cockroach ran in my room!).However staff in this hotel is frendly and good and the view from the hotel is beautiful.", "title": "Three-star is over-rated", "helpfulness": 1, "user": "PON", "date": "October 23, 2006", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "location": 5.0}, "id": 5985315, "likes": {"liked": "— Viwe and location", "disliked": "— Room facilities"}}, {"rating": 2.0, "title": "Al Mar Hotel", "text": "We stayed at the Al Mar Hotel in Algeciras on our way back to Barcelona from Morrocco. We were disappointed in the hotel and would not consider it a three-star hotel but rather a two-star. The furniture was very old and the television didn't work properly. The bathroom was dirty and not very well maintained. We did have a nice view of the harbor and the staff was very nice. We stayed in six different hotels in this price range in Spain and I have to say that this one was by far the most disappointing, though the location is great.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "July 14, 2004", "id": 2296002}, {"rating": 4.0, "title": "Nice place to launch a day trip to Tangiers from", "text": "Al Mar is a 3-star hotel in Algeciras, not too far from Gibraltar and literally right across the street from the pier where the ferries to Tangiers and Ceuta launch from. Four of us stayed in a triple room with a rollaway bed for 85 euro, full buffet breakfast included. Parking is available in a gated lot under the hotel (I think it's 7 euro/night--they forgot to charge us). The room was comfortable and clean, and the staff was friendly. The location makes it a great place to stay if you're day-tripping to Morocco: it's a straight line from the dock to the front door of the hotel, so you don't have to lug your handmade rugs and souvenirs very far!", "helpfulness": 14, "user": "A TripAdvisor user", "date": "March 23, 2004", "id": 1737377}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled solo", "text": "After traveling all day from Madrid, I arrived in Algeciras at about 11PM local. I browsed over my Forbes travel book before getting off of the train and discovered that Al-Mar seemed to be about a 4 or 5 block hike from the train station. The locals were very helpful and explained the simple walk. Although I did it, I would not advise walking alone at night from the station to the hotel as it was a bit shady. Upon entering the hotel I asked if a room was available. To my surprise there was one available with a soft bed, a hot shower, and a plentiful breakfast buffet in the morning. The rooms were clean, the staff spoke English, and the price was very reasonable (55 or 60 Euro)! The ports for ferries to Morocco are just outside the hotel (visible and a 5 minute walk). The buffet is served on the top floor offering a spectacular morning view of the ports and the Mediterranean Sea! I would highly recommend this hotel to anyone traveling to or from Algeciras. I liked it so much that I stayed there a week later upon my return to Europe after traveling trough Morocco. Excellent staff, service, food, comfort, and safety!!!", "title": "Great little Hotel on the Sea!", "helpfulness": 1, "user": "NVOUS845", "date": "December 3, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 11219694, "likes": {"liked": "— Breakfast & Staff", "disliked": "— Nothing bad at all here!"}}, {"rating": 2.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "Though the hotel was listed in Frommer's it was kind of dumpy. Small room and could have been cleaner. I did sleep well and it was guiet although we were there off season. Tour buses stay there. Good location - right across from where you get the ferry to Morocco. Staff was nice", "title": "Qestionable hotel", "user": "Travel1333", "date": "November 20, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 2.0, "value": 2.0, "rooms": 2.0, "location": 4.0}, "id": 10945273, "likes": {"liked": "— A place to stay after a long day", "disliked": "— Kind of seedy"}}, {"rating": 1.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "There was bad smell of prolong smoking in-room in the two rooms that we came across. We couldn't open the windows either, as there was noise from the heavy traffic on the main road. The room was overpriced and not clean enough.", "title": "Smelly rooms", "user": "susanna.chow", "date": "September 29, 2007", "detail_rating": {"front_desk": 2.0, "service": 2.0, "cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "location": 3.0}, "id": 10019523, "likes": {"liked": "— location", "disliked": "— cleaniess"}}, {"rating": 1.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "The only good point is its proximity to the pier to Tangier.", "title": "Stay away!", "helpfulness": 3, "user": "susieqFlorida", "date": "June 21, 2007", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "location": 1.0, "rooms": 1.0}, "id": 7957339, "likes": {"liked": "— Nothing", "disliked": "— Everything"}}, {"rating": 1.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "Don't stay here if you're not a smoker.", "title": "Horrible...don´t go there", "helpfulness": 1, "user": "Pluttan", "date": "May 17, 2007", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "location": 2.0, "rooms": 1.0}, "id": 7636014}], "location": {"country": "Spain", "region": "Andalucia", "continent": "Europe"}, "stars": 3, "variance": {"poor": 13, "average": 17, "very good": 4, "terrible": 15, "excellent": 1}, "aka": "Al Mar Hotel", "slim_ranking": 0.833333333333}