{"user_rating": 3.5, "review_count": 61, "name": "Al Diyar Hotel", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed April 2009, traveled solo", "text": "For a town of only 80,000 people, Nizwa is spread out over a remarkably large area - at least compared to many places in Europe. This hotel is about 5 km from the centre of Nizwa, and everything you'll want to see in Nizwa itself is in the centre of Nizwa. That said, I don't think there are any hotels much closer to the centre of town anyway. The hotel is on the main road (ask for an inward facing room). The staff are helpful, and the hotel restaurant is pretty fair doing the usual grilled meat with salad fare - Nizwa doesn't seem to have any particularly good restaurants (unless you count Bin Ateeq). There's also an excellent juice bar 2 doors from the hotel entrance. Rooms are OK - bland but functional. For tourists, a cab to/from town costs no more than 1 rial (I'm sure locals pay less, but I don't speak Arabic !). Getting a taxi from the hotel to anywhere sometimes means a 10 minute wait, but getting a taxi from the centre of town is always easy. There's a pool (functional but nothing special) as well if you need a dip after the sightseeing", "title": "Reasonable, if nothing special", "helpfulness": 1, "user": "pmbma", "date": "April 9, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 3.0, "service": 4.0, "rooms": 3.0}, "id": 27687452}, {"rating": 4.0, "stay_parameters": "Stayed December 2008, traveled as a couple", "text": "Overall - friendly staff, functional hotel (and probably closest to where you want to be), but nothing particularly memorable.", "title": "Good option for a comfortable night in Nizwa", "user": "Bunge13", "date": "January 2, 2009", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 3.0, "rooms": 5.0}, "id": 23210937, "likes": {"liked": "— Large clean comfortable rooms", "disliked": "— Internet access not always available"}}, {"rating": 2.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "Stayed here for just one night. Although the room was spacious and clean, there was no hot water in the morning, which the staff did not seem surprised about and did nothing to fix it. The hotel is on a very busy road and we were kept awake in the night (however I think most of the hotels in Nizwa are the same). Breakfast was one of the worst I ever had.", "title": "JUST OK for an overnight stay - if you don't mind a cold shower!", "user": "AllanBLondon", "date": "March 25, 2011", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 1.0, "sleep": 1.0, "rooms": 2.0, "location": 2.0}, "id": 101501421}, {"rating": 4.0, "stay_parameters": "Stayed February 2011, traveled solo", "text": "A nice hotel with spacious, clean rooms and a decent restaurant. There's a big open air swimming pool and the balconies from the rooms/leading to the rooms have decent views of the surrounding mountains. It's not the most central hotel but it is decent quality. There's a small shop downstairs selling gifts etc. The reception staff are pleasant and helpful, and breakfast is a decent spread of choices.", "title": "A good hotel with nice rooms", "user": "FearfulFlyer", "date": "February 27, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 98254644}, {"rating": 3.0, "stay_parameters": "Stayed December 2010, traveled with family", "text": "As mentioned, the rooms are particularly good, with comfortable beds, lots of space, high standards of cleanliness and most facilities. The bathrooms are clean and the shower worked well, although the leaky bottom meant the bathroom got a fair bit of water on the floor - my advice is don't leave your towel on the floor if you want it to still be dry when you get out!", "title": "Just a nice tourist hotel", "user": "Walker1969too", "date": "January 3, 2011", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 91596710}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "A basic tourist hotel: clean large rooms but nothing special. No heating in the pool: great in summer cold in winter.. Good restaurant attached by local standards: great food but with romantic TL lighting..", "title": "best choice for value in nizwa", "user": "hullmick", "date": "April 17, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 61721859}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "we stayed two nights here just after Easter and the Omani welcome, cleanliness and room standard were far above what we expected from a 2-star hotel. Nice swimming pool which the rooms flank on two sides. Convenient enough for the centre (3kms) of this wonderful town (as interesting now as it was in 1987). Breakfast included in our deal, which was only adequate - served in adjacent restaurant, accessed from lobby. It's dry but there is another more expensive hotel with functional bar along same road.", "title": "Fine for a night, good base for Nizwa, great restaurant attached", "user": "annatc", "date": "November 15, 2009", "detail_rating": {"cleanliness": 4.0, "location": 4.0, "service": 4.0, "rooms": 3.0}, "id": 49273265}], "location": {"country": "Oman", "region": "Ad-Dakhiliyah Governorate", "continent": "Middle East", "city": "Nizwa"}, "stars": 2, "variance": {"poor": 6, "average": 30, "very good": 21, "terrible": 1, "excellent": 3}, "slim_ranking": 0.5}