{"user_rating": 5.0, "review_count": 728, "name": "Al Maha Desert Resort", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "This place is fantastic and ideal if you just want to relax and spend time on your own. If you are staying in one of the Bedouin Suites then ask to stay in Suite 23 which is the most private. From the terrace and infinity pool you can only see the desert - it is truly magical. The private pool is sizeable and the bedroom and bathroom is massive.", "title": "This place is amazing", "helpfulness": 6, "user": "JJLM", "date": "December 3, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 11218292, "likes": {"liked": "— The incredible views of the desert.", "disliked": "— The quality / choice at dinner"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "There is a restaurant but we ate most of our meals in our room and I would definitley recommend for an extra 100 dirums having your evening meal served to you in your room as it so special. Food was excellent apart from dinner this should be of a higher quality with more choice for the price charged, however, this did not detract from our stay. Also, we were unaware but you can also ask the chef for local cuisine for dinner which we would have liked to have sampled if we had known.", "title": "WOW! One of the best places on earth", "helpfulness": 3, "user": "michael_zrh", "date": "November 30, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 5.0, "rooms": 5.0}, "id": 11168374, "likes": {"liked": "— suites", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled with friends", "text": "Service is excellent and it is fun being picked up on a golf cart and being whizzed to whereever you want to go to.", "title": "Wonderful stay at Al Maha Desert Resort", "helpfulness": 2, "user": "Christinaki", "date": "November 10, 2007", "detail_rating": {"cleanliness": 5.0, "front_desk": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 10732291, "likes": {"liked": "— Everything was wonderful!"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "Two activites per day are included in the price and we did camel trekking both of which I would recommend. We did not have any spa treats but the gym was great with uptodate modern equipment.", "title": "Good but not amazing", "helpfulness": 4, "user": "pastol", "date": "November 5, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 2.0, "rooms": 5.0, "location": 2.0}, "id": 10608294, "likes": {"liked": "— Nice staff", "disliked": "— Smell of urine"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled with family", "text": "I would definitly go back to this hotel!", "title": "Paradise....without the kids next time", "helpfulness": 3, "user": "BathOntheroadagain", "date": "October 31, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 10474872, "likes": {"liked": "— Luxurious indulgence", "disliked": "— More choice in the restaurant"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2007", "text": "\"This is THE place for a dirty weekend\" a friend urged when he persuaded me to go to Al Maha. Was he right! I will return to the service etc in a moment - but if you want to have an unforgettably romantic time with your husband/wife/partner/lover.....this is the place to go. The private plunge pools are perfect for skinny dipping - put 'do not disturb' on your villa door, and you won't be! - and the villas are beautifully appointed...double bath, magnificent shower etc......SUPERB", "title": "If you want tranquility, quality and some zest in your love life..:)", "helpfulness": 8, "user": "norns", "date": "October 4, 2007", "detail_rating": {"value": 5.0}, "id": 10038678}, {"rating": 5.0, "title": "pure escapism", "text": "So is it worth the (considerable) money? The food is very good without being outstanding. We stayed for three nights and although the Maitre d' wandered about the beautiful dining terrace, he never spoke to us once. I only got to know about a Hammour special from his conversation on a neighbouring table.", "helpfulness": 11, "user": "maryjo", "date": "September 26, 2007", "id": 10006162}, {"rating": 5.0, "title": "Absolutely amazing!!!!!!!!", "text": "The service is outstanding: cheerful and discreet. The waiter at the Spa (amazing pool) knew my name and suite number having served me only once the previous day. Turn down comes complete with scented candles and illuminated plunge pool.", "helpfulness": 3, "user": "MoggyOxford", "date": "September 22, 2007", "id": 8850826}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "Answer: yes, it is. It is very expensive, and so take time to shop around for a deal if you can, but this is a break to save for - you will appreciate it more for having done so.", "title": "wonderful place in the desert", "helpfulness": 2, "user": "northnorwegians", "date": "September 17, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 8738045, "likes": {"liked": "— the surroundings, suites", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "One or two posts here talk of disappointment due to comparing it with African safaris. This is, of course, completely ridiculous. There is no game, other than the wandering oryxs and some small buck. It is, perhaps, the fault of the hotel that is comes armed with genuine South African rangers who greet you on arrival...maybe that raises the expectation. Treat this place for what it is: a beautiful, tranquil and awsome retreat which makes a perfect 3 day (2 days, just) escape from the building works and ever increasing Essex accents in the hotels of Dubai.", "title": "Superb oasis of tranquility", "helpfulness": 12, "user": "rjn21", "date": "September 7, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8671505, "likes": {"liked": "— Perfect Tranquility", "disliked": "— Having to leave"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2005, traveled as a couple", "text": "My husband and I stayed here for four days on our honeymoon, after spending a few days at the Burj Al Arab. It was my favorite of the two (and my favorite resort in the world), even though the Burj is much more famous and well known. Each guest couple (no children allowed) is assigned two people to assist your every need - one is your activities director (we went for romantic sunset camel rides with champagne toasts, falconry in the desert, nature walks, dune driving, etc.) and one is like a concierge (arranges transportation, check-in, etc). Accommodations were amazing. Each guest house had its own plunge pool and was wonderfully appointed. Because it was our honeymoon, they arranged a private dinner in our house with champagne. Also, the food, which was included, was fantastic, and I am really picky about food and was leery that this was \"all-inclusive\". You had your choice of various menu items and had to pay extra for special wines, which was fine. We loved it and want to go back for an anniversary!", "title": "Like a fairytale - unparalleled service, food and accommodations", "helpfulness": 3, "user": "MNTraveler74", "date": "January 29, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 13100536, "likes": {"liked": "— Everything - Activities, Accommodations, Food and Spa", "disliked": "— Nothing - Everything was wonderful"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "This desert resort was like a true getaway. The resort only has around 20 luxury tents. I say tents but they are actually luxurious suites, each with their own pool, looking out over the dubai dessert.", "title": "A Very Different Getaway", "helpfulness": 8, "user": "LauraNOli", "date": "January 18, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 12767549, "likes": {"liked": "— Setting, Own Pool"}}, {"rating": 3.0, "title": "al maha no adveture", "text": "There are activities included, one of which is horse riding. I was very keen to take part in this excursion but once we got there we found out you had to be a very expereinced rider as the horses are ex-race horse, which was a little dissapoiting. Howvever the dune driving is a great experince!", "user": "nvarda", "date": "January 4, 2008", "id": 12331584}, {"rating": 4.0, "title": "A fantastic resort", "text": "We took full advantage of the room service having our lunch bought to us each day and indulging in private dining on our decking. We were impressed with the food too.", "helpfulness": 5, "user": "bradleyshel", "date": "January 2, 2008", "id": 12250741}, {"rating": 5.0, "stay_parameters": "Stayed December 2007", "text": "We stayed here for 3 nights which is about right as there are limited things to do, unless you just want to relax in a very small resort.", "title": "Desert Paradise", "helpfulness": 10, "user": "bonbuben", "date": "December 28, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 3.0}, "id": 12002142, "likes": {"liked": "— Privacy, quiet, all-inclusive, nature", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "Arrived early morning after the BA night flight, were greeted with drinks and cold towels and then after a very short time were shown to our fabulous \"room\" they explained everything even telling us that the laundry service was free of charge, I have to say that we made full use of this. After we had a sleep my husband decided that he did not like this room as it did not have a view of the watering hole, where most of the wildlife congregates, it was no problem we were moved the next morning and they even packed and unpacked for us.", "title": "Fantastic, get away from the rat race", "helpfulness": 1, "user": "julie-torre", "date": "September 3, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 8614688, "likes": {"liked": "— Own private pool, and being able to have your dinner on your own deck next to pool", "disliked": "— journey"}}, {"rating": 2.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "You can do as much or as little as you want in this resort , I did nothing could not face the 5.00 am starts!! I literally spent the whole time reading and sitting in the pool which is heaven when it is 47 degrees.", "title": "Expectations raised but not met.............", "helpfulness": 6, "user": "chrisjones", "date": "August 6, 2007", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 5.0, "cleanliness": 5.0, "value": 2.0, "location": 5.0, "rooms": 5.0}, "id": 8361322, "likes": {"liked": "— Food", "disliked": "— Crap execution in setting then meeting client expectations"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007", "text": "The food is fantastic and the review that says you can only have 2 items of the room service menu must have had half her menu missing!! I have never had a lobster and prawn salad like it. We stayed here for 3 nights and then went to the Burj Al Arab for 3 nights but to be honest could have stayed here for the full 6 nights, absolutely wonderful and would not hesitate to go back. Staff are wonderful and cannot do enough for you, a real haven in a busy world !", "title": "Amazing!", "helpfulness": 3, "user": "MagicianManchesterUK", "date": "July 26, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8236465, "likes": {"liked": "— Everything", "disliked": "— Saying goodbye!"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "Stayed at the Al Maha on the 12th July in Suite 12. This suite is very close to the main hotel and consequently very conveneient but maybe a little noisier than others. The room was lovely as was were the staff and the food. A bottle of wine with the meal was a very reasonable 227 Dhs and good too. The evening sundowner trip was excellent and well worth attending however we did not sample any of the other activities.", "title": "An absolute retreat from hectic madness!", "helpfulness": 8, "user": "Galagirl1", "date": "June 25, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7987497, "likes": {"liked": "— Everything", "disliked": "— That I can't go back tomorrow!"}}, {"rating": 5.0, "title": "A world of Luxury and Relaxation", "text": "My only gripe was that on booking they enquired if it was a special event. I let them know it was my wifes 40th birthday and was pleasantly surprised when they offered a complimentary birthday cake and event went as far to ask for any specific wording I wanted on the cake!. Well the cake didn't make an appearance at any point during the stay. Now some of you might think that a missing free cake is nothing to complain about however with a hotel of this level to raise a customers expectations and then fail to deliver is inexcusable. To make matters worse I e.mailed them after the event to ask what had happened but to add insult to injury they offered no explanation - just 20% off spa treatments on a next visit! I didn't want a voucher - just an explanation.", "helpfulness": 6, "user": "THOMOPOL", "date": "May 30, 2007", "id": 7716316}], "location": {"country": "United Arab Emirates", "continent": "Middle East", "city": "Dubai"}, "stars": 5, "variance": {"poor": 4, "average": 13, "very good": 49, "terrible": 1, "excellent": 661}, "aka": "Al Maha Desert Hotel Dubai", "slim_ranking": 0.00213219616205, "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "description": "Exclusive Hotel designed to resemble a traditional Bedouin encampment - Set within a 25-sq.-kilometer desert conservation reserve."}