{"user_rating": 4.5, "review_count": 1207, "name": "Al Manzil Hotel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "Stayed for 6 nights in a standard room, using 3 Entertainer travel vouchers. So was a really good deal, only payed for 3 nights. Had to do check out and in 2 times but this never took more than 5 minutes because I only needed to extend my roomkey.", "title": "Love this one: Great location, great staff, wonderful room!", "helpfulness": 2, "user": "Ciskey", "date": "June 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 131898512}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled solo", "text": "At first check in was a bit of a nuisance. They didn't had any standard non smoking rooms available for us, while we are both asthmatic a smoking room was not acceptable for us. We were told because of the vouchers we could only get these smoking rooms which they cleaned as if they were non smoking. We could upgrade to a next level at 150AED per night only to get non smoking. After a while Mrs Hazel came and I told her we don't need an upgrade because of the poolview or whatever we only needed non smoking because of our asthma.", "title": "Perfect", "user": "Flemo72", "date": "June 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 131832290}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "She was great, fully understand my problem and said health is the most important. She gave us a free upgrade to a non smoking poolview room. So glad we got it!", "title": "Highly Recommended", "user": "John P", "date": "June 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 131695592}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "Breakfast on our 1st day was great. We loved the fresh fruit section, smoothies, and the French toast. 2nd day was a completely different story: fruit was not that great and many of the hot food section was cold. 1st day I rate the BF an 9, second day a 6.....", "title": "As good as they say if not better!", "helpfulness": 1, "user": "mytimenow", "date": "June 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 131647090}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled solo", "text": "The room was beautiful. We love the fact the bathroom was in the middle of the room because it made the room much more spacious. House keeping and turn down service both were great.", "title": "Great location, Great hotel, Great staff...just the best!!", "user": "smurdy24", "date": "June 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 131633847}, {"rating": 5.0, "title": "Highly recommended", "text": "The Al Manzil is a lovely hotel. We had a suite with a Burj Khalifa view which was stunning. The suite was spacious with a sitting area, desk, balcony large luxurious bathroom and separate shower room and toilet and lobby area. Really nice although a picture was hung a little off level! If you are looking to cut costs the standard rooms looked equally nice.", "user": "Barbara F", "date": "June 9, 2012", "id": 131629629}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "The staff made our stay really special as nothing was too much trouble and they all made us so welcome. The free pick up service to /from the airport went very smoothly too. We could have stayed elsewhere in a room for the same price as this suite but this is as close as you can get to the Dubai Mall without being in it. A delightful 5 minute walk through the Palace gardens and indoor souk and you are in the heart of everything. Can't praise it highly enough.", "title": "The perfect hotel, location, service, rooms and staff, highly recommend this hotel.", "helpfulness": 2, "user": "SandiandGlenn", "date": "June 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 131470617}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "This is our first time in Dubai on our way to New York, we decided to stay at the Al Manzil as it received excellent reviews on Trip Advisor. If I could give this a higher rating I would,", "title": "Great Place to Stay", "user": "helenchapi", "date": "June 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 131454098}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with friends", "text": "We used the hotels pick up service to collect us from our 5.30am arrival, a cold towel and water and a smiling face was there to meet us and take us to the hotel in air conditioned comfort. We arrived at the hotel just after 7am, now we didn't book the extra night to be guaranteed a room on arrival however the wonderful staff told us they would do their best and they did, we were in our room just after 8am. In the meantime we had another cold towel and fresh juice as we checked in and 2 coffees whilst we waited in the air conditioned lobby using the complimentary WIFI", "title": "An excellent hotel walking distance form the Dubai Mall", "helpfulness": 1, "user": "RobinRatchford", "date": "June 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 131346047}, {"rating": 5.0, "stay_parameters": "Stayed May 2012", "text": "The rooms are great and the bathroom is a central part of the room, all glass giving you a suite feel without the hefty price tag, we loved it, you can even spin the TV around to watch whilst sitting in the bath.", "title": "Best accommodation, location and helpful staff ever", "user": "Penewe", "date": "June 4, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 131312235}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled on business", "text": "I've stayed at Almanzil a couple times for work, and all I can tell you is I've never slept better. Breakfast is delicious, location is great, I can't think of a single negative remark. Excellent value.", "title": "Most comfortable bed ever!", "helpfulness": 3, "user": "shawana80", "date": "June 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 132725862}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "Al Manzil Hotel is the perfect choice when in Dubai. Clean spacious rooms and a fantastic breakfast spread. Very impressive exterior and all the staff were lovely. And so close to the Dubai Mall, but get a taxi, they are cheap and the heat is too much for walking there, walking anywhere really! We spent 9 hours in that mall and didn't see it all! Loved our stay at Al Manzil Hotel and seeing Dubai, looking forward to going back.", "title": "Excellent!", "user": "2munsters", "date": "June 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 132569264}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "Stayed for two nights this June on a round trip through Oman and Emirates. Al Manzil has an excellent location close to the Burj Khalifa and the Dubai Mall. Just keep in mind that walking distances are long in Dubai and the construction does not make it easier to reach certain parts of the vast Mall complex. Walking from Al Manzil through the Palace Old town hotel and Souk and from there to the mall is a very pleasant walk though. Check-in was courteous and swift, towels and welcome drink provided. The Burj view room was on the sixth floor as requested and provided a great view to the building and the adjacent new downtown area. We liked the open bathroom design and had no privacy issues. There was some intermittent smell from the tub but the issue is known and the staff confirmed that they are working on a solution. Pool area is small but nice and surprisingly quiet for the location. Tried only one lunch in the courtyard which was very good. Staff is extremely polite. Highly recommended for visitors interested in downtown and also suitable for business. Free wifi worked at very reasonable speed. Gym looked also great but we hadn't time to use it.", "title": "Very good", "user": "hjslaw", "date": "June 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 132521712}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled solo", "text": "This is a really nice hotel. Staff are incredibly polite and helpful...but that seems to be the case every where I have been in Dubai. My room overlooks the courtyard and pool area which is nice (510). They have several places to eat, I chose the sports bar...service could have been better but it was ladies night and my dinner was actually free...I only paid for my drinks. Since I was eating by myself I guess I didn't matter as much when it came to getting attention from the waitress. Rooms are clean and bed definitely comfy!!! They do have WIFI throughout the hotel which is nice. The hotel is literally right across the street from the Dubai mall and the fountains which is nice and the Burj Khalifa building isn't far away either. I haven't tried breakfast but I'm sure it will be nice. (My only issues is that they ask if you will use the minibar in the room, when I said no they told me they would send someone to lock it. Mind you I'm grown and I don't need anyone to come lock up the mini-bar but that's just what the did...while I was using the restroom!!! Some guy is standing in my room while I'm in the restroom having a conversation with me about locking up the mini-bar....really??? I had to tell him to get out of my room) Other than that it's a very nice place to stay. Did I mention they have a Starbucks right outside the hotel...YAAY!", "title": "Not a bad place to stay...", "user": "MDtravelinglady", "date": "June 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 132327452}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "15 out of 10 for this amazing hotel! Location is perfect, staff efficient and friendly, rooms clean, well maintained, spacious and beds are super comfortable. Every possible need you may have can be accommodated with ease from this hotel. Complimentary wifi is a plus, and works quickly throughout the hotel. Nothing is too much trouble, from the smallest enquiry to organising a day trip to Abu Dhabi. We have stayed in many places around the world and Al Manzil surpassed every experience, including other boutique hotels and a 6 star resort also in Dubai. We will return to Dubai and not even consider staying anywhere but here. Brilliant in every way!", "title": "Magnificent Al Manzil!!!!", "user": "10KimberleyR", "date": "June 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 132200067}, {"rating": 4.0, "stay_parameters": "Stayed May 2012", "text": "Located a 5-10min walk to the burj khalifa the hotel is a very stylish boutique hotel. Upon checkin we were greeted by 5 star hospitality and that didn't end until we left. The rooms are spacious and generous and very comfortable. The gym is also great with sufficient equipment to satisfy any gym junkie. The pool area is great also. What made our experience memorable were the extremely helpful and friendly staff. Oscar in particular was a breathe of fresh air everything we saw him.. So energetic and happy! Very lovely man! The hotel is also walkable to the dubai mall (10-15) min walk.. Great location, great hotel..", "title": "Great location, excellent staff, awesome stay!", "user": "cbsam", "date": "June 17, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 132161901}, {"rating": 4.0, "stay_parameters": "Stayed June 2012", "text": "The location of the hotel is excellent as it is very close to Dubai mall,Burj Khalifa and Souk Al Bahar", "title": "Great location&different style", "user": "advisor321", "date": "June 16, 2012", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 132076856}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "Room was good but the design you have bathroom in the middle of the room don't like it but I know other people will like it", "title": "Excellenty service! Central location! Great hotel!", "user": "mashuralam", "date": "June 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 132030904}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "Food was good and breakfast us good hot food and cold also very nice fresh fruit", "title": "A good option in the Dubai Mall area", "helpfulness": 1, "user": "ilovemiddleeast", "date": "June 15, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 132002776}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with friends", "text": "In the coffee shop you can have Shisha outside", "title": "Miss it, miss out!! FAB hotel.", "helpfulness": 1, "user": "hsgray81", "date": "June 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 131984960}], "location": {"country": "United Arab Emirates", "continent": "Middle East", "city": "Dubai"}, "stars": 4, "variance": {"poor": 12, "average": 36, "very good": 238, "terrible": 3, "excellent": 918}, "aka": "Al Manzil Dubai", "slim_ranking": 0.0277185501066, "detail_rating": {"service": 4.5, "cleanliness": 5.0, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 5.0}, "description": "Discover the spice of life; as you explore the area and make a discovery of your own. Just a five-minute walk from, Burj Khalifa the immense & inspiring Dubai Mall and right in the heart of the Burj Khalifa commercial and residential precinct, you’ll find Al Manzil Hotel, a four star deluxe hotel that presents a perfect fusion of old and new.Situated in The Old Town precinct with easy access from Sheikh Zayed Road via Financial Centre Road.With its excellent business facilities, Al Manzil is a popular venue for small to medium-size conferences."}