{"user_rating": 5.0, "review_count": 351, "name": "Alam Jiwa", "reviews": [{"rating": 5.0, "title": "Stunningly beautiful rooms and surroundings", "text": "I found the Alam Jiwa through the raving reviews on Trip Advisor, and I am extremely glad to have stayed there for 3 days.", "user": "Werder1", "date": "November 25, 2009", "id": 50027643}, {"rating": 4.0, "title": "Lovely Inn with Great Rooms and Decent Service", "text": "The staff are very helpful and friendly, the rooms huge and just beautiful. As far as I could see, each room occupies one floor of a 2-3 floor house. There are 4 houses in total, I think, all of which are set next to a 5-8m deep small river gorge. These houses are beautifully set with terraces and balconies, stone walls and floors and thatched roofs, carved wooden doors inside and out, and little fish ponds and creeks surrounding them, with lots of trees providing shade.", "user": "eriktera", "date": "October 29, 2009", "id": 48031664}, {"rating": 5.0, "title": "Surpassed Expectations", "text": "Behind the river are rice fields, and far in the distance is Mount Agung, Bali's highest volcanoe. There is a decent-size pool with an adjacent small kids pool opposite the reception & breakfast room house. All in all, it is a very tranquil and relaxing environment, just like I imagined my stay in Ubud to be.", "user": "ldewit7", "date": "October 2, 2009", "id": 45642206}, {"rating": 5.0, "title": "serene and beautiful", "text": "The rooms were cleaned and set during breakfast, and there was a turn-down service in the evening. Generous breakfast in the morning (even on your room terrace) as well as afternoon tea and cakes are included, as is free on-demand shuttle to anywhere in Ubud (and back).", "user": "Steggs", "date": "September 3, 2009", "id": 39645382}, {"rating": 4.0, "title": "Far from the Madding Crowd", "text": "The hotel itself is part of the locally-owned Alam group, which also operates the Alam Indah and Alam Shanti up the small back road towards Ubud, as well as the Alam Wangi Spa and two restaurants (Laka Leke and Cafe Wayan), plus the Alam Asia Gallery, that sells local textiles.", "user": "Subarite", "date": "July 22, 2009", "id": 35437347}, {"rating": 5.0, "title": "Amazing Experience - Loved It!", "text": "We stayed here in December with our 6 year old son. I was drawn to the hotel by the TA reviews and lovely photos. I was not disappointed! The grounds are amazing - so lush and peaceful. The architecture of the buildings is like nothing I've seen before. Simple, sort of rustic, yet incredibly ornate. We had a delicious breakfast delivered to our room (Casuary Room) each morning and was able to eat it on our incredible veranda overlooking the rice fields. What a way to wake up!", "user": "mckenzie99", "date": "January 8, 2010", "id": 52988019}, {"rating": 5.0, "title": "Paradise with a wonderful staff", "text": "Our son loved the environment, seeing huge spiders in the trees outside, geckos, lizards, and dragonflies around the grounds. We had just come from a high end resort in Nusa Dua so I must admit we had a short transition going from super luxury to a more rustic (yet lovely) hotel. We all agreed at the end of our stay that this was probably the most special place we've every stayed.", "user": "Vidaliatravels", "date": "January 7, 2010", "id": 52877982}, {"rating": 5.0, "title": "Mind Bogglingly Beautiful", "text": "Everything was so lovely, but I have to say the best part was the staff. They were so incredibly helpful. We did walk to town most days, since it was just a short walk through Monkey Forest, but would get picked up at the end of the day by their car service. This was so convenient. They just went out of their way to help us with whatever we needed.", "user": "Wanderingidiot101", "date": "January 6, 2010", "id": 52797210}, {"rating": 5.0, "title": "Paradise!!", "text": "I loved the location. After reading other reviews, I was worried it was too far from Ubud. When we actually walked home the first day, we couldn't believe how close it actually was. The village is so quiet and peaceful that I couldn't imagine staying in town. We loved Ubud but appreciated coming home to serene Alam Jiwa at the end of the day.", "user": "LouisaToucan", "date": "December 21, 2009", "id": 51589626}, {"rating": 3.0, "title": "Great environment, but lots of bed bugs", "text": "The spa owned by the people, Alam Wangi, was incredibly lovely as well. One other fantastic part was that the restaurant Laka Leke offers art and craft classes. They allowed our 6 year old to take a woodcarving class with them while we got massages! They were so attentive and took such great care of him that we were comfortable going down the road to the spa while he was in class. This was an extra added bonus we didn't count on!", "user": "HappyBelly", "date": "December 19, 2009", "id": 51529431}, {"rating": 5.0, "title": "What a find!!", "text": "This was a wonderful place to stay if you want to get out of the hustle and bustle of Ubud. Since we love to walk, the walk into Ubud was easy but hot! (Watch out for the monkeys trying to steal your shopping bags and water bottles.) We enjoyed the lovely surroundings, the quietness and how friendly and helpful the staff was. We had quite a few meals at Leke Lake down the road and even took a cooking class there. Also took advantage of the spa (can't remember the name) and had some hours of pampering.", "user": "Lv2trvl82", "date": "November 30, 2008", "id": 22319926}, {"rating": 5.0, "title": "Fantastic Place", "text": "We were worried about no air conditioner but with the ceiling fan and cooler temp in the evening it turned out just fine.", "user": "I_rock_it", "date": "November 7, 2008", "id": 21634174}, {"rating": 5.0, "title": "This is the best", "text": "A great place to stay in Ubud! Far enough from the bustle of town to be nice and romantic, yet close enough for getting in for food, or for a walk through the monkey forest...", "user": "MIMIDenverColorado", "date": "October 2, 2008", "id": 20577915}, {"rating": 5.0, "title": "Relaxing haven of tranquility", "text": "Great breakfasts, great room with beautiful views of the rice fields, great pool, great friendly staff that were helpful.", "user": "gwyn4940", "date": "August 5, 2008", "id": 18631719}, {"rating": 5.0, "title": "An amazing place... we dream of returning one day", "text": "Definitely stay here!", "user": "itchyfeetlady", "date": "August 3, 2008", "id": 18575466}, {"rating": 1.0, "title": "Beware reservation service - reservation non-existent!", "text": "I used the internet to book a three night stay. The website made me sign up for a booking service with password etc., all of which was cumbersome. But I got an e-mail confirmation with a reservation number and \"thank you for your reservation\" language. A few months later (a week before our trip) I clicked on the link that said to check the status of the reservation, only to find out that my reservation indicated \"waitlist.\" What? I thought I had a \"reservation!\" I called Indonesia and explained the situation. They told me they had sent me an e-mail two days later to let me know the hotel was booked. What?? If it was booked why would the reservation service tell me all those rooms were available and then give me a \"reservation number?\" I never got the e-mail (it may have been sent to my spam folder). But in any event, the booking service told me they had sent me a list of other hotels they could book for me instead. I asked them to go ahead and check on other hotels, and so far, they still haven't gotten back to me. This left me scrambling at the last minute to find an alternative hotel on my own. The hotel may well be lovely, but I'll never know, because the reservation system sucks!", "user": "MarleenLee", "date": "June 30, 2009", "id": 33573937}, {"rating": 5.0, "title": "Unique Hotel in a Unique Place", "text": "Rare is it that you will find a hotel that oozes character and fits into its natural surroundings as well as Alam Jiwa does. Add in reasonable prices and an incredibly friendly staff that is eager to please and you have a package that is hard to beat. Staying at Alam Jiwa does require some trade-offs, though in my opinion they are trade-offs worth making.", "user": "StrudelMonkey", "date": "February 4, 2009", "id": 24201373}, {"rating": 5.0, "title": "Delightful accommodations, outstanding service", "text": "The hotel is situated on the south side of Ubud and is surrounded by rice fields. Ubud town is about a 20-30 minute walk away via the Monkey Forest or about 10 minutes by car. The walk through the Monkey Forest is worth doing at least once, though there is a path on the outside that is free (and monkey free). This represents the first trade-off you must make ... sacrificing close proximity to town but, in return, getting a beautiful natural setting that looks out over rice fields, lush landscaping and a stream. At night, the sounds of the rushing stream, croaking frogs and bugs buzzing in the fields are just fantastic.", "user": "Meganonbeyond", "date": "January 17, 2009", "id": 23640219}, {"rating": 5.0, "title": "Wonderful Hotel", "text": "We arrived around 3am and were happy to see our driver waiting outside baggage claim, just as the hotel promised. It was about a 40 minute ride back to the hotel. We were shown to our room ('Gelatik') and were pleased to find fresh fruit waiting for us. They were kind enough to have the two beds pushed together for my wife and I. A mosquito net can be pulled around the bed, which was great ... we could keep the balcony door cracked at night for the sounds (see above) and not have to worry about getting eaten by bugs. Though I believe a few of their rooms feature a true shower, our large bathroom was limited to a tub only. Not a big deal, though I usually find it hard to contort my body well enough to spray off with the hose. The rooms at the hotel were beautiful, featuring traditional Balinese design and local natural materials. The rooms did not have TV or internet access, though you can ask to use the computer in the office if you need to check email. The lack of TV was fine with us", "user": "THCA", "date": "January 4, 2009", "id": 23268332}, {"rating": 5.0, "title": "Outstanding", "text": "Each night the staff would ask for your breakfast order. Though you can eat it in the open dining area near the office, we always chose to have it delivered to our room. It was really nice treat to have breakfast while sitting on the balcony watching the sun rise over the rise fields. Breakfast was great, with fresh juice, bread, yoghurt/fruit, coffee/tea, and choice of eggs, pancake or jaffle. No other meals are available at the hotel, though there is a free daily tea/coffee and cake between 2:00 - 6:00pm.", "user": "sunshiny_8", "date": "December 29, 2008", "id": 23085231}], "location": {}, "stars": 3, "variance": {"poor": 1, "average": 6, "very good": 52, "terrible": 2, "excellent": 290}, "aka": "Alam Jiwa Ubud", "slim_ranking": 0.0982142857143, "detail_rating": {"service": 5.0, "cleanliness": 4.5, "value": 5.0, "sleep": 4.5, "rooms": 5.0, "location": 4.5}}