{"user_rating": 4.5, "review_count": 39, "name": "Alaskan Host Bed and Breakfast", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "A very nice B&B with a jaw dropping view of the beautiful pond on the property with spectacular mountains in the background. A great place to unwind on our last night in Alaska. If you have a afternoon flight from Anchorage it is an easy 90 minute drive to the airport from Alaskan Host. The hosts were very pleasant and the breakfast was delicious.", "title": "jaw dropping view", "user": "tony838", "date": "June 25, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 165223473}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "For the true Alaskan experience - this is the place to stay! The hosts, Jim and Kathy Huston, make you feel like you have known them forever, and welcomed us like family. The home is warm, inviting, comfortable and uniquely Alaskan. Jim's wildlife and fish trophies enhance the artistic, Alaska-themed rooms that Jim designed and created – including 3D mural paintings! Amazing! The quiet location has breath-taking mountain views that ascend above the fish-teeming lake just outside the door. Our breakfast was delicious, and according to the locals we talked to, Kathy’s cooking is well known as the best in the local community. Did I mention it would be hard to beat these great prices? Incredible place! We will definitely be back!", "title": "The True Alaskan Experience", "helpfulness": 2, "user": "Michele H", "date": "March 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 155923643}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled with friends", "text": "Bill & Michele - Nikiski, AK", "title": "Ladies Church Retreat", "user": "Conny R", "date": "February 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 152577174}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "We were looking for a place to host our first ever ladies retreat from our church. Since this was the first time we had a retreat, we were a bit nervous looking for a place to stay. When we stumbled upon the Alaskan Host B and B, we knew we had a winner! The living room was large, yet cozy and comfortable. The bedrooms were spacious and decorated with Alaskan flair. Our hunting husbands would be jealous with all the animal mounts around the house : ) Kathy and Jim were good cooks (we even had moose sausage!) and Jim has a never-endling list of jokes! The location is great (30 minutes from Wasilla) so it makes an ideal place for those visiting our great state, and an easy commute for local folks", "title": "Loved the Outhouse Bathroom - In our Bedroom :) FUN!", "user": "origincondo", "date": "September 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 140647481}, {"rating": 5.0, "title": "Perfect ending to our Alaskan adventure!", "text": "I can't begin to stay how much we enjoyed our stay here. I loved how your decorated the rooms! The setting is amazing and the breakfast was the best ever! We were excited to sample moose sausage and it was delicious! Kathy and Jim could not have been more helpful to us. We were made to feel right at home from the start. We hated to leave but Denali was calling our name! We'll be back!", "user": "Yenne H", "date": "September 13, 2012", "id": 140180833}], "location": {"country": "United States", "city": "Willow"}, "variance": {"poor": 0, "average": 4, "very good": 7, "terrible": 0, "excellent": 28}, "aka": "Alaskan Host Bed And Breakfast Alaska/Willow", "slim_ranking": 0.2, "description": "Experience the real Alaska on our 200 acre estate with two private lakes, boating, fishing, hiking and walking trails around property. All rooms have private baths. Close to fishing at Willow Creek and close to historic Hatchers Pass. Two and half hours from Denali National Park and 90 minutes north of Anchorage."}