{"user_rating": 3.5, "review_count": 47, "name": "Alba Suites", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "Acapulco is a very expensive place now, so if this is your first time there, DON\"T stay at Alba Suites, because this is not the real Acapulco you're looking for ... so be ready to pay more then!", "title": "Good deal for Acapulco", "helpfulness": 7, "user": "GRojas", "date": "January 17, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 3.0}, "id": 6612005, "likes": {"liked": "— It has kitchenette, good price", "disliked": "— Location, lack of beach views"}}, {"rating": 4.0, "title": "home sweet home", "text": "However, I have been there several times to Acapulco, so I just need a comfortable place to sleep, I rent a car and travel wherever I want, so this is a good deal. It has a kitchenette, which I love so I can have my own food if I don't feel like eating out. The hotel is quite big, spread out on several units of 2 floors each, the pools are in between these units. Considering its size and openess I think it is very very clean, but on the other hand it is noisy during the day, specially all the kids in the pool. It's not near the beach whatsoever, but sits on a hill with a nice breeze, unfortunately no views to the sea from most rooms, I guess only one of the outdoor terraces.", "helpfulness": 8, "user": "A TripAdvisor user", "date": "March 9, 2004", "id": 1714481}, {"rating": 1.0, "title": "avoid at all costs", "text": "This hill is located in the old part of Acapulco, so you do need to go all around the bay to get where \"the action\" really is, however, once back in the evening is deliciously quiet !! which I like, unlike the expensive hotels on the costanera that deal with the noise of bars and people outside the streets. If you don't have a car, I think outside you can take a typical Acapulco taxi, VW black bug.", "helpfulness": 17, "user": "A TripAdvisor user", "date": "September 7, 2003", "id": 1275941}, {"rating": 3.0, "title": "Was average - probably wouldn't revisit", "text": "Suites Alba was an absolute pleasure. The rooms were clean and the staff exceptionable. They were always working on something and always went out of their way to help.", "helpfulness": 17, "user": "lacalif11", "date": "September 7, 2003", "id": 1275740}], "location": {"country": "Mexico", "region": "Pacific Coast"}, "stars": 2, "variance": {"poor": 1, "average": 5, "very good": 25, "terrible": 7, "excellent": 9}, "aka": "Alba Hotel", "slim_ranking": 0.147727272727}