{"user_rating": 5.0, "review_count": 125, "name": "Albert & Victoria", "reviews": [{"rating": 5.0, "title": "A pleasant stay", "text": "Recently stayed at this Guesthouse in Eastbourne and just wanted to say how much I appreciated the discreet but helpful attention to detail that the owners had provided. My room and bed were very comfortable but it was the little extras that elevated the room from standard to almost luxury - towelling bathrobes, toiletries and a spotlessly clean bathroom with loads of piping hot water. Breakfast was good too in a light, airy room. Would recommend.", "helpfulness": 1, "user": "carriepea", "date": "October 10, 2011", "id": 119134205}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "Booked this as a treat for my mum & dad's 50th Wedding anniversary. They had Leopold Room which they both loved. Spotless, beautiful and full of lovely finishing touches that made their stay extra special. Keith & Ken went the extra mile and we would like to send our thanks to them both for making my mum & dad's special occasion perfect in every way.", "title": "Wonderful B & B", "helpfulness": 1, "user": "woody2004", "date": "October 1, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 118819512}, {"rating": 5.0, "stay_parameters": "Stayed September 2011", "text": "Just love the attention to small detail by Keith. From advice on what to do and where to eat, to the earbuds, sugurblocs, energy-saving bulbs. When in Eastbourne again, I'll be sure to stay here again.", "title": "Feel like a queen!", "user": "Carinavrlondon", "date": "September 25, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 118576685}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "went here with my husband for our 10th wedding Anniversary and what a pleasant surprise we had.we had the top bedroom which was the leopold room and what a delight it was very clean and was a pleasure to sleep in there..Keith couldnt do enough for us either and the young lady at breakfast was a pleasure to talk to as well.we will most diff be going back again as u dont find many little treasure like this", "title": "Best B&B i've seen in many years", "helpfulness": 1, "user": "cooltracey", "date": "September 22, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 118445231}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "All we'd expected it to be and more. Can't praise Keith enough for this wonderful guesthouse and diappointingly we couldn't think of anything to make it even better! Beautifully decorated, spotlessly clean, lots of 'extras' that you wouldn't normally expect, huge TV, lovely bed and super breakfast. Very good value too. We will definitely return.", "title": "Excellent - highly recommended", "helpfulness": 1, "user": "Liz M", "date": "September 4, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117656713}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "We had a very pleasant stay in the Alice room of the Albert & Victoria this April. Keith was the perfect host and the accommodation was immaculate. The cost is an absolute bargain for the outstanding quality, splendid hospitality and ideal location.", "title": "Excellent", "helpfulness": 1, "user": "ShakesMagoo", "date": "April 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 128320539}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "We wish Keith every success and look forward to staying again in the future.", "title": "Victoria & Iain ------Plymouth Devon", "helpfulness": 1, "user": "Iain F", "date": "April 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 127920601}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "A 'real' find, and a treasure amongst the best of Guest Houses. Beautiful rooms with exquisite period features and absolutely immaculate throughout. A charming atmosphere in the pretty dining room where we enjoyed a great selection from the buffet and fine cooked breakfast A super friendly welcome from Keith and Ken with a personal service throughout our sadly short stay. We will most certainly return!!", "title": "B&B at its very best", "helpfulness": 1, "user": "hoch2", "date": "April 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127909714}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "Keith`s place in Eastbourne fulfilled any of our hopes of what a brilliant B&B could be – the room (The Beatrice) was amazing, the hospitality perfect and the breakfast just adorable. Thank you! And not to be unmentioned all the lovely and perfectly styled decorations ...", "title": "Simply lovely!", "helpfulness": 1, "user": "sophiem730", "date": "April 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127610617}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "When you take a break away you hope to be spoilt just a little ...and we were... a lot! Staying at the Albert and Victoria over the Easter weekend we each had a Lindt chocolate bunny in the room waiting our arrival and Spring flowers! Wonderful aroma of fresh laundry filled the air, comfortable beds, beautiful selection of towels, robes and toiletries (the little touches did not go unnoticed)! Even had hot chocolate (i usually take my own but forgot on this occasion)!. Relaxing, delicious breakfast - Keith... fantastic! Thank you. The Wet weather didnt matter! (Daughter felt like a princess)!", "title": "I'll be back", "helpfulness": 1, "user": "Phil O", "date": "March 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 126700878}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled on business", "text": "Stayed on the 6-8 October and was very impressed with the lovely guest house. I had a lovely room, the bathroom and shower were immaculate. The breakfast was lovely and the staff friendly....would recommend this guest house to others", "title": "Lovely, clean warm & friendly guest house", "helpfulness": 1, "user": "Anne R", "date": "November 10, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120409901}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "We thoroughly enjoyed our stay. When we checked in Keith brought pots of tea and coffee to welcome us. Our room and en-suite (Beatrice) were nicely decorated and exceptionally clean, if a little on the small side. The towels and bath robes are good quality, thick and fluffy. There was a good supply of tea, coffee, hot chocolate, bottled water, biscuits and chocolate in the room. The full English breakfast was well cooked and tasty with plenty of cereals, juices, toast and tea / coffee.", "title": "Exceptional", "helpfulness": 1, "user": "hkwoody", "date": "November 6, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120245821}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "Location is good, close to the sea front and pier in a quiet street.", "title": "It' all in the details", "helpfulness": 1, "user": "thomas e", "date": "November 6, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120236759}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "The bottom line is that there is almost nothing to improve on, everything is spot on.", "title": "What a surprise !", "helpfulness": 3, "user": "Brian T", "date": "November 3, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120101637}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "Great Britain, England, Sussex, Eastbourne... B&Bs all over the place. And but for the worst ones they are all more or less the same. You expect a bed (of course) and breakfast and then the quality makes the difference. And the host, of course. And here is a good starting point to say something about A&V. The host, Keith, has an eye for quality, as you would expect, and then the details. Actually it's better to say: He has a sense for the details. Quality is superior, everything is nice and clean... but then you find two flowers on a table for two ... That is to say: not only flowers on the table, because having flowers on the table is nice, no, you find two flowers on a table for two, and one flower on a table for one... You find towels, of course you do, in the bathroom, and then these are embroidered and carry the A&V. So do the gowns (yes, the gowns). The jam served at breakfast is not just jam it is bonne maman, etc etc. Everything seems to not just fullfill a function but please your eye as well and carress your senses. Keith is at hand with information whenever you need some, friendly, heedful, and so is his staff. We enjoyed and would like to come back.", "title": "Excellent!", "helpfulness": 1, "user": "CSCT", "date": "October 11, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 119207028}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "From answering the door, to saying goodbye (didn't want to leave) we couldn't fault the hospitality, room, breakfast, I asked for crispy bacon, with my full english breakfast (and that's what I got) nothing was too much. The room was spotless and loved the soaps/bodywash/shampoo/handcream,etc all a lovely touch. Was a lovely welcome having a cup of tea/coffee made for us, you don't get that everywhere. What is lovely and personal is all the rooms have different deco,and size beds to excellent standards. We asked where was good to eat, and was recommend the Cosmo, which is excellent aswell, eat all you like, will be coming back to the Albert and Victoria and Cosmo soon, just want to say a BIG thank you to you ALL, for our lovely stay.", "title": "Excellent, will be coming back!", "helpfulness": 1, "user": "Debrap655", "date": "March 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 126099859}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "Had a wonderful stay in this beautiful B&B. Can't fault it", "title": "A very nice B&B", "helpfulness": 1, "user": "howe2855", "date": "January 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 123341920}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "We stayed last night after spending the day hiking around Eastbourne. Keith greeted us with a lovely pot of tea in a very classy tea set. The decor reflects well the Victorian theme but wasn't too old fashioned either. The soaps and shampoos were a nice brand. There were little chocolates on the tea set. The towels were good quality. Bed was comfortable. Everything was very clean. There was even a bathrobe although we forgot to use it. Breakfast was great. I had a delicious salmon and eggs dish and my wife had yogurt and muesli. In addition to coffee and tea they had herbal tea which was great for her as she's trying to cut down on caffeine. Keith was friendly and thoughtful the whole time and helped us with bus information.", "title": "Everything perfect", "helpfulness": 1, "user": "LeanBA", "date": "November 27, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121093096}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "We didn't have any issue with it as we appreciate good use of space, but some might find the room small. Again, we think it's perfect and a very efficient use of space and didn't feel cramped at all but if you are used to mega US hotel rooms just be prepared. Probably most of the people going there are not like that so it should be fine.", "title": "great value", "helpfulness": 1, "user": "elizabeth s", "date": "November 25, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121014311}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled on business", "text": "All in all, a delightful stay and so nice to see someone with such attention to detail.", "title": "Fantastic Surprise", "helpfulness": 1, "user": "Gareth H", "date": "November 18, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120745782}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "stars": 5, "variance": {"poor": 1, "average": 1, "very good": 6, "terrible": 0, "excellent": 117}, "slim_ranking": 0.041095890411}