{"user_rating": 4.5, "review_count": 260, "name": "Albergo Lenno", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "We spent 4 nights in room 204 in September 2007. Clean, quiet and the room had a nice balcony with small table and 2 chairs looking out directly over the lake. The room furnishings were basic but very suitable. Very easy access to the other towns on Lake Como via ferry directly outside the hotel. Lenno is a quiet town and the last ferry from Bellagio does not really allow you to return to Lenno much later than 7 pm or so but there are several restaurants in Lenno. We ate in the hotel for dinner one night and the food and service were good for 25 euro per person. Breakfast was fine with coffee, juice, milk, cereal, fruit, breads, cheese and meat. All hotel staff were good with questions/advice, expecially Luca. Nice bar service in the lobby in afternoon and evenings. A wonderful 4 nights. Bring your own hair dryer as the one in the bathroom is not so good.", "title": "Very Relaxing", "helpfulness": 6, "user": "Westshore", "date": "September 28, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 10014252, "likes": {"liked": "— Beautiful location", "disliked": "— No complaints"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "My wife and I have just returned from a 9 day stay at Albergo Lenno. We found the hotel and the location to be very special. The hotel rooms are simple and basically furnished however the hotel is up to date with good air conditioning, double glazed windows and large marble baths with Jacuzzi showers. Also two PC's in the lobby provide internet access.Many rooms have balconies with great lake views. We spent three nights in a room on the third floor, at the side of the hotel, overlooking the outdoor breakfast area and the pool and 6 nights in a room on the second floor at the front of the hotel. Both rooms were very quiet and both had a balcony and view of the lake. The hotel is across the street from the ferry pier which made it very easy to tour the lake and we did not need a car. The hotel restaurant can get very busy and we could not get a table on two occasions since we had booked on a B&B basis, however this was not a problem since there are several good restaurants within walking distance. The breakfast was very good with a large selection including fresh fruit, cereal, cold meats, pastery, rolls etc. We also found the front desk personnel to be very helpful with restaurant bookings, chasing after our lost luggage and any other request we had. The only advice we would provide is to bring your own hair dryer because the one in the bathroom is very weak.", "title": "Albergo Lenno is very special", "helpfulness": 3, "user": "JohnTampaBay", "date": "September 25, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 10001756, "likes": {"liked": "— location and helpful efficient & friendly staff", "disliked": "— nothing"}}, {"rating": 2.0, "title": "Totally overated", "text": "Overall we found the Albergo Lenno to be a wonderful experience.", "helpfulness": 5, "user": "jbangel", "date": "September 22, 2007", "id": 8850298}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled with family", "text": "Just wanted to warn everyone about the noise issue with this hotel - we booked this hotel for the first stage of our honeymoon based on trip advisor reviews - it looked like everything we were looking for - peaceful, slow paced etc so that we could recharge our batteries after our hectic wedding celebrations. First of all, the room could only be described as basic - we had a large room with a balcony and yes it did overlook the lake and the view was gorgeous but the room was akin to student accommodation in terms of it's decor. However, the noise was terrible, - guests opening their doors using a card generated an annoyingly loud buzz at all hours of the day and night, the lift was right next to us and our balcony overlooked the breakfast seating area outside so that from 6am all we could hear were tables and chairs being dragged across tarmac for oh approximately 4 hours (guests kept dragging the tables out into the sun and then waiters would drag them back into the shade constantly). To top all that, the church bell sounds on the hour and half hour every hour so after 5 nights in Albergo Lenno, I was glad to go and relax in Florence!! Absolutely exhausted despite ear plugs and natrasleep. As we weren't half board, just B&B, we weren't allowed to eat dinner at the hotel either - given that there are approximately 4 other restaurants on the lake front in Lenno, we did feel this was a little too excluding. All in all, Albergo Lenno was a little too corporate for our liking - we were expecting a lovely little family run hotel but it felt more like a Thistle Hotel. I would defintely return to Lake Como and Lenno, but not Albergo Lenno.", "title": "Peaceful location. Polly ,UK", "helpfulness": 3, "user": "pollyNottingham", "date": "September 12, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 8702856, "likes": {"liked": "— location, helpful staff , personal", "disliked": "— food quality"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "Recently returned after a 7 night stay at Albergo Lenno.Have to agree with previous reviewers regarding location ,scenery and helpful staff . However , we felt that the food offered in the dining room in the evening slightly let the hotel down . We could not fault the service , but the food was all pre-plated and often lacked presentation skills .Most evenings we were served frozen peas/carrots , there seemed to be very little fresh veg.Quite a limited choice of menu, but remember to ask for a salad if you don't fancy the hors d'oevres or starter .We stayed on a half board basis , but in hind sight would probably have prefered B&B thus enabling us to try the local restaurants in the village which always seemed full . ( Always a good sign if the locals eat there ! ) My only other \" winge\" , being a lady who doesn't travel without her hair straighteners , is that there is no power point near the mirror ,and the hair dryer in the bathroom blows like a puff of wind ! But , overall , a wonderful relaxing week in perfect surroundings . Lenno is an excellent base from which to explore Lake Como", "title": "Beautiful lake views in peaceful surroundings", "helpfulness": 4, "user": "KathrynT", "date": "September 11, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 8692116, "likes": {"liked": "— Large comfortable bed and large bathroom"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled with friends", "text": "We decided to do a couple nights on Lake Como before going to Venice to catch a Med cruise. I spent a lot of time on TripAdvisor researching hotels because I wanted an intimate hotel with local flavor. I am a travel agent and have access to many hotel suppliers but I relied on TripAdvisor reviews and I am so happy I did! I contacted the hotel through their website aand they were prompt and friendly in getting back to me. I asked for rooms with a view and they gave us their two best...both with small balconies overlooking the lake! The rooms were large with nice bathrooms and the front desk was so helpful. A nice breakfast is included and we ate on the outside porch.", "title": "Delightful Albergo Lenno!", "helpfulness": 3, "user": "Thweety", "date": "September 7, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8671550, "likes": {"liked": "— the perfect location and views", "disliked": "— getting to the breakfast room is a bit of a maze/"}}], "location": {"country": "Italy", "region": "Lombardy", "continent": "Europe"}, "stars": 4, "variance": {"poor": 8, "average": 27, "very good": 93, "terrible": 2, "excellent": 130}, "aka": "Albergo Lenno Hotel Lenno", "slim_ranking": 1.0}