{"user_rating": 4.5, "review_count": 1964, "name": "Albergo del Senato", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "My wife and I really enjoyed the location and view from our room of the Pantheon. We usually don't spend a lot of time in our room when traveling but on this occassion were fortunate enough to have what appeared to be the only Superior room with a balcony. This made it practical to enjoy sitting on the balcony watching the circus like atmosphere of the square in front of the Pantheon rather than being in the circus. It was a little disappointing that the side of the Panteon that we were looking at was covered up with scaffolding. Beeakfast was frsh and plentiful. The room was very clean and beautiful with a large bathroom. we found the staff to be very helpful when we needed advice with restaurants and directions plus arranging for a taxi to get us to the airpport for an early morning flight. After getting \"fleeced\" by the taxi driver that took us from Termini to the hotel, getting a courtious driver a a set rtae was a relief.", "title": "Wonderful Location and Helpful Staff", "user": "RMJMW", "date": "November 7, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 86267244}, {"rating": 5.0, "title": "Great stay near the Pantheon", "text": "We really enjoyed our stay at this lovely property. Staff was courteous and helpful. Great location steps away from the Pantheon. Suites are roomy and have direct views. Rooms facing the Piazza can be noisy until around 9:00 p.m. or so due to the street musicians (some of whom are pretty bad) and general hubub. By the way, why do they allow amplifiers in the piazza?", "helpfulness": 1, "user": "Aldo_Nola", "date": "November 6, 2010", "id": 86195722}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "Bathrooms spacious. Bed very comfortable and on the firm side. Nice bar for relaxing. Keep in mind this is a 3 star property so there is no dedicated concierge. The desk staff keeps pretty busy so you might have to wait awhile for help. This will be our first choice for future stas in Rome. Exceptional value.", "title": "Incomparable location and accommodations.", "user": "Yoshipigs", "date": "November 4, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 86013804}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "Situated in the Pantheon square, the hotel front looks onto the Pantheon's entrance. Easy walking distance to nearly all the major ancient historic sites (Coliseum, Forum, etc.). The staff all speak English (better than our Italian!) and were friendly and helpful. Our original room (nice and large for Italian hotels apparently) overlooked the little alleyway next to the hotel, which was fine; but we asked for a room with more sunlight and to our surprise we were moved to a room at the front of the hotel - lots of sunlight AND a front-and-center view of the Pantheon. The room was much smaller, but comfortable and quiet (double-pane window). I suspect it helped that our stay was lenthy (6 nights). Breakfast is included in the room price, and the selections were impressive. Would absolutely return to the del Senato.", "title": "Outstanding 3 star", "helpfulness": 1, "user": "JohnNB64", "date": "November 2, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 85721329}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "In terms of cleanliness, style, location etc, I am staggered that this place is only a 3 star, and I can only attribute this to lack of additional facilities - the breakfast room is small and you may have to wait for example - because everything else about it is 4 star. Mauro behind the desk is extremely helpful and all of his colleagues are fluent in English. In terms of location, it is superbly placed right next to the Pantheon, and with the Piazza de Navona and the Trevi Fountain only 5 minutes walk away in opposite directions. In terms of value for money, it's perhaps not so great (the rooms at the front facing the Pantheon cost over 300 Euros per night - somewhat excessive at the moment given that the Pantheon is covered in scaffolding), but we were extremely lucky to be given room 602 which has its own terrace and additional lounge room. We would definitely go back as it's a lovely hotel", "title": "Fantastico!", "user": "possiblyaprincess", "date": "November 1, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 85655952}, {"rating": 5.0, "stay_parameters": "Stayed July 2006", "text": "The quality service started at the airport when the mercedes mini-van arranged by the hotel picked us up and the driver gave us a running commentary of the sights along the via appia antica all the way to the town. To get to the centre of rome can be a logistics nightmare if using the the metro or buses.", "title": "Still 5 stars despite the power cut", "helpfulness": 8, "user": "grahamkuk", "date": "July 6, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 5433337}, {"rating": 5.0, "title": "excellent experience", "text": "Upon arrival our reception at the frontdesk was very warm and welcoming. Our rooms were excellent (one at the front and a triple to the side) though the aircon in the front room wouldn't work properly. The view from our room was fantastic, people watching across the whole of the piazza too. The roof top terrace was a wonderful retreat after an evening meal out but opens between 1730 and 2230 - shame you can't just sit up there during the day but safety comes first.", "helpfulness": 4, "user": "MrsByers", "date": "July 5, 2006", "id": 5427557}, {"rating": 4.0, "title": "wonderful experience", "text": "The hotel only serves breakfast (but what a breakfast - a feast !) forcing you to eat out. You won't go short of fantastic places to eat nearby and if ice cream is your fancy one of roma's best is very close near the parliament building.", "helpfulness": 3, "user": "faprodz", "date": "July 2, 2006", "id": 5415954}, {"rating": 5.0, "stay_parameters": "Stayed May 2006", "text": "We suffered a power cut for a few hours which made it fun trying to take a shower before all the hot water was gone. The power cut wasn't the hotel's fault. We took a min-van back to the airport again arranged by the hotel - it was great fun at rush hour when everyone was driving like mad to get home for the football (italy won of course!!).", "title": "Definitely worth the splurge", "helpfulness": 6, "user": "bellasusanna", "date": "June 27, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 5394050}, {"rating": 5.0, "stay_parameters": "Stayed June 2006", "text": "All in all a fantastic stay and a highly recomended hotel.", "title": "Outstanding room and location", "helpfulness": 3, "user": "gymbackmom", "date": "June 17, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 5356908}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled with friends", "text": "From the moment I arrived (slightly flustered as my partner missed his flight) the outstanding staff made me feel welcome. They all speak excellent English, are professional, friendly, and real professionals.", "title": "Wow. Lovely. What a view, what a room!", "user": "kareneg061", "date": "October 28, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 85106435}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "Book one of their drivers to pick you up from the airport. It was wonderful after a long flight and it turned out to be cheaper than a regular cab!", "title": "Great location and fantastic staff", "user": "nigelwelch", "date": "October 26, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 84954129}, {"rating": 5.0, "stay_parameters": "Stayed July 2010", "text": "Myself and my family stayed in the penthouse room for 2 nights in July. We had an absolutely delightful experience - every single member of staff was so friendly and welcoming, the room was incredible, and the view spectacular.", "title": "Perfect hotel!", "user": "sydneyc10", "date": "October 25, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 84703683}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "Our rooms (2 bedrooms, huge terrace overlooking the Pantheon) were divine - spotless, modern, comfy beds, and a welcome fruit basket. The terrace was brilliant, very sunny during the day but great for people watching (the Piazza della Rotonda is directly below), and the Pantheon is opposite!", "title": "An excellent boutique and central hotel", "user": "Canadasnorkelers", "date": "October 24, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 84631136}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "As others have mentioned, it is a perfect location. Close to everything!!", "title": "Cannot Be Beat - 5 Out of 5", "helpfulness": 2, "user": "JamesII", "date": "October 24, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 84623460}, {"rating": 4.0, "title": "Great location, nice hotel", "text": "Breakfast was probably the only downside - it wasn't the greatest and a bit cramped. But to complain about that is clutching at straws, this hotel is fabulous.", "user": "lovelydreamin", "date": "October 24, 2010", "id": 84616221}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled with friends", "text": "Would only stay here in Rome.", "title": "Ticks all the boxes!", "user": "eagletraveller", "date": "October 23, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 84587918}, {"rating": 5.0, "title": "beautiful hotel", "text": "My sister and I stayed there over Thanksgiving last year. This hotel is beautiful and with marble and hardwood floors. The location is perfect. Highly recommended.", "helpfulness": 7, "user": "katieboston", "date": "August 6, 2006", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 5562908}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "I'm glad to say that we had a wonderful experience at this hotel. The staff was always attentive, courteous, and willing to help with any questions that we had. We were always greeted with a smile and advice was patiently given by the front desk staff whenever we needed it. I had contacted the hotel so many times before our visit through e-mail, that I felt as if I knew them all. My e-mails were always answered quickly and with a friendly response.", "title": "Wonderful stay, perfect location!", "helpfulness": 11, "user": "EShaps", "date": "August 5, 2006", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 5561552, "likes": {"liked": "— The location and helpful staff", "disliked": "— We liked everything"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2006, traveled as a couple", "text": "Our room was spotlessly clean (the furniture is a little worn, but I viewed it as antiques!) and the breakfast was fresh and delicious. Our room was comfortably cool, however the lobby was not air conditioned. We were there July 11th-15th during a terrible heatwave. The staff smiled even while wearing suits (jackets and all !) We, at least were in shorts and t-shirts! We had a very hard time smiling with the heat!", "title": "Location, Location, Location", "helpfulness": 10, "user": "buckliew", "date": "August 3, 2006", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 5543667, "likes": {"liked": "— Conveniently Located to much of Rome", "disliked": "— My room didn't have a view of the Pantheon"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled with family", "text": "The location of this hotel is fabulous. First of all, when we looked out of our window (room 205), we were staring at the Panthon! What a breathtaking view, made only better when the sun went down and the lights of the Pantheon and piazza came on. We loved looking out of the window at all hours. We walked everywhere....to the Vatican, the Colesseum, the Spanish Steps, etc. The only ride that we took was when we left Rome by train at the Termini station. We are not youngsters. My husband celebrated his 60th birthday on the 15th. The heat was stifling, however, we walked everywhere. We were so centrally located to all. I wouldn't stay anywhere else.", "title": "Perfect Place to Stay!", "helpfulness": 10, "user": "workinit", "date": "August 2, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5539597, "likes": {"liked": "— The rooftop terrace"}}, {"rating": 3.0, "stay_parameters": "Stayed July 2006, traveled with family", "text": "Thank you to all at the Albergo del Senato for a wonderful and memorable stay.", "title": "Great view and location, average customer service", "helpfulness": 3, "user": "silver1981", "date": "August 1, 2006", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 5.0, "value": 3.0, "rooms": 3.0, "location": 5.0}, "id": 5536946, "likes": {"liked": "— the view", "disliked": "— the service"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "We spent 9 nights at the Albergo del Senato in Rome for our tenth anniversary, and it was wonderful. First, the location can't be topped, but the hotel itself was a delight. Our very comfortable standard room on the third floor overlooked the Pantheon and the piazza, and we actually enjoyed sleeping with the window open--the noise at night from the people in the piazza was actually a nice 'white noise' and not a problem. (No sirens like NYC often has).", "title": "We loved it!", "user": "emmajane7", "date": "October 26, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 84945832}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "The staff, Mauro and Alessandra and the other lovely people, were welcoming, helpful in making dinner recommendations and reservations and everyone spoke English and didn't wince too much at my attempts at Italian.", "title": "Great hotel. Should be rated higher.", "user": "lynndesign2000", "date": "October 26, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 84891950}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "Breakfast had something for everyone, and was a great way to start a busy day of exploring one of our favorite cities.", "title": "Great location", "user": "Frequenttraveller046", "date": "October 25, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 84800511}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "We had high expectations for our 8-night stay at the Senato because of the reviews on TA; however, our stay at this hotel topped all expectations. We have stayed at a number of lovely European hotels, but I think the Senato tops all the others. As so many other reviews have stated, the staff members are wonderful--including the breakfast and cleaning staff; the breakfast and breakfast room provide a wonderful start to the day; and and the lobby and bar areas are warm and comfortable. When we returned from dinner our first night, we found a bottle of Prosecco chilling in an ice bucket--what a nice touch!", "title": "Topped all expections!", "helpfulness": 1, "user": "r0ckhill", "date": "November 16, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 87300332}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "We loved our room--#402, a Senior Suite. I have no knowledge about other rooms, so all my comments are about this suite. It was quite, quite large--two rooms with a hallway, 2 walk-in closets (one larger than the other) that provided ample drawer space and hanger space, a relatively large bathroom. The spotless floors were hardwood and marble in the bathroom. The bed linens were lovely and changed each day. The bath had bath sheets, ample hand towels (I did take my own washcloths; none were provided), and bath robes. The suite had 5 windows--2 in the bedroom, 1 in the hallway, and 1 in the sitting room. One of the bedroom windows overlooked the Pantheon and the piazza, which, as others have said, was interesting; I spent quite a bit of time standing at the window looking at all the activity below. The piazza can be a bit noisy at night, but when the shutters, windows, and lovely draperies are closed, the noise is completely shut out.", "title": "Made us fall in love with Rome", "helpfulness": 1, "user": "Worldtravelorplus", "date": "November 13, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 86909511}, {"rating": 5.0, "stay_parameters": "Stayed November 2010", "text": "The location is superb. We took a cab to the Vatican and to Termini, but walked everywhere else. There are many restaurants, trattorias, pizzerias, gelato places, etc. on the lanes and alleyways surrounding the piazza.", "title": "Beautiful hotel with superb staff", "helpfulness": 1, "user": "monepennie", "date": "November 9, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 86485451}, {"rating": 4.0, "title": "Stunning location, friendly staff.", "text": "We stayed as a party of 7 in 3 rooms of differing grades at this hotel. We were lucky enough to be allocated the room with balcony right at the front of the hotel with a stunning Pantheon view. The other members of our party also had Pantheon view rooms (triple/standard double) which they were very pleased with. The rooms were spotlessly clean and well appointed.", "helpfulness": 6, "user": "poet123", "date": "August 18, 2006", "id": 5623920}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "We felt the desk staff were exceptionaally helpful and friendly.", "title": "Amazing view and perfect location", "helpfulness": 7, "user": "UpperWestGal", "date": "August 13, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 5605751, "likes": {"liked": "— Location", "disliked": "— Pay extra to confirm a room with view of Pantheon - it's worth it!"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "The lady bartender on the roof terrace bar though was a little surly and had a habit of disappearing which meant you had a wait for a re- fill of your drink...this could explain why such a stunning terrace was empty of guests in August!", "title": "A memorable stay", "helpfulness": 8, "user": "P-KTraveler", "date": "August 11, 2006", "detail_rating": {"cleanliness": 5.0, "front_desk": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 5597935, "likes": {"liked": "— The location.", "disliked": "— Nothing."}}, {"rating": 5.0, "stay_parameters": "Stayed June 2006, traveled solo", "text": "Breakfast was served till 10am but ariving at 9am we could not be seated for 15 mins due to lack of tables/tables being uncleared. It seemed as if staff were in short supply.", "title": "Ask for Room 310", "helpfulness": 4, "user": "BMWLover", "date": "August 8, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 5579064, "likes": {"liked": "— Quality of the Room and professionalism of front desk staff", "disliked": "— No weaknesses"}}, {"rating": 5.0, "title": "A superb hotel!", "text": "Overall we enjoyed our stay and would return especially for the location.", "helpfulness": 7, "user": "wibberly", "date": "August 7, 2006", "id": 5564737}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with friends", "text": "Do not hesitate to stay here! We were 3 single girls traveling from NYC to Rome for vacation. The location was fabulous, rooms well appointed and staff superb!", "title": "FABULOUS STAY", "user": "ntm4", "date": "November 27, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 88346646}, {"rating": 5.0, "stay_parameters": "Stayed November 2010", "text": "Just returned from Rome & what a fantastic weekend! Myself, my husband, 18 yr old daughter & 12 yr old son. I decided to stay at this hotel on recommendations on Trip Advisor which I can always depend on & it's location. We were not disappointed. Lovely traditional homely hotel. Comfortable rooms, amazing view of The Pantheon, even from our childrens standard room. Breakfast was lovely, any requests dealt with immediately by lovely waiting staff. Front Desk staff were wonderful people, both day &", "title": "Fantastic Hotel", "user": "Sheerana", "date": "November 25, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 88167048}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled on business", "text": "The piazza comes alive at night. It's great fun to just walk around it at night. There is great casual dining just behind the Pantheon at a university haunt named Miscellana - try the \"sexy wine\" it's really quite good. More upscale yet affordable dining is available nearby at L'Angoletto, the front desk staff know the directions. As you leave the front door, take a right and go around the corner to one of the best coffee spots in Rome (my view and also that of the locals). Also in the piazza if you want to bring home some neat reproduction \"artifacts\" go into this very narrow store called Archeo Roma.", "title": "Beautiful hotel and perfect location.", "helpfulness": 1, "user": "Elysse2010", "date": "October 23, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 84553733}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "This hotel is everything we could have asked for. You can walk virtually everywhere. In order to not get into endless debates with taxi drivers we always arranged cabs through the front desk (and we only used cabs twice) and we opted to hire the limosine service offered on Albergo del Senato's website to pick us up at the airport. It is well worth it after a long flight.", "title": "Superb Location and Service in a Beautiful Hotel!", "user": "tenmileHuntsvilleAL", "date": "October 21, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 84320498}, {"rating": 1.0, "stay_parameters": "Stayed June 2006, traveled with family", "text": "We did not like this hotel because every staff member we encountered, except one , was very unfriendly, especially the man at the reception desk during the day. We paid 360 Euro's per night for a double room with a view of the Pantheon, I knew it was over-priced and that we were paying for the view and the location, but I never expected that the staff would be so unfriendly, and at times, rude. It totally ruined our enjoyment of this hotel. We travel throughout Europe every summer and we have never had this experience at a hotel ever before. There are 2 good things I can say about this hotel...the location and the view of the Pantheon. Both of those qualities were great, but the unfriendliness was overwhelming and very unpleasant. I do have to say, we only went up to the roof terrace once, and the bar was not open, maybe they are friendlier up there.", "title": "Did NOT Like This Hotel!", "helpfulness": 19, "user": "Chavenay", "date": "July 27, 2006", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 2.0, "value": 1.0, "location": 5.0, "rooms": 2.0}, "id": 5514880, "likes": {"liked": "— Location", "disliked": "— Staff"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled with family", "text": "Even the maids looked very unhappy and, to me, that is a sign that they are not treated well at all. We tipped our maid very well and, every day, because she worked hard. The room was large, but it was shabby. We have stayed at hundreds of hotels in Europe for 1/3 the price of this hotel and we were welcomed with open-arms and made to feel like family. Not this hotel! We will never stay here again.", "title": "Loved our stay at del Senato", "helpfulness": 4, "user": "tradescantia", "date": "July 23, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5498733, "likes": {"liked": "— Location"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2006", "text": "We (family of 4 in two separate rooms) loved our stay at Albergo del Senato for 5 nights in July 2006. The rooms were lovely and overlooked the Pantheon and Piazza. Walls are upholstered in padded silk (?) and the rooms were quiet and clean. The lobby and breakfast room were also sparkling and well decorated. The staff at the front desk were extremely friendly and helpful and recommended great restaurants at different price points. They are true professionals with warmth. We observed an interesting mix of travelers in the breakfast room - there were tourists from a variety of countries (US, Europe and Asia) as well as business people. This, to us, was another sign that this is a true Italian albergo, not a tourist trap.", "title": "Very pleased", "helpfulness": 6, "user": "Excellentadventures2", "date": "July 18, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 5478599}, {"rating": 5.0, "stay_parameters": "Stayed June 2006", "text": "I stayed at this lovely hotel for 3 nights and while it lacked the flash and glamour of some other hotels I stayed in during my trip to Italy, I must say that I cannot find anything to complain about at all. The rooms are spacious by European standards (call ahead to request a room on an upper floor overlooking the Pantheon. The view is wonderful--the Pantheon, the square, even the dome of St. Peter's Basilica in the distance.), the bathroom was modern and the location is perfect for exploring the entire city. There are several wonderful sidewalk cafes to sit at and just pass some very pleasant time people watching. The concierge is very pleasant and helpful. Be sure to have him arrange for transportation to the hotel from the airport. Do not even think about driving--the streets we took to the hotel were more like alleyways and I could not have found my way there if my life depended on it, Also, if you plan to visit the Vatican, have them arrange a private tour guide. You can easily navigate Vatican City on your own but there is a special entrance for guides that is open from 8-8:45 a.m. We waited in line for 30 minutes in the shade while those in the general admission line waited for about 3 hours in full sun,", "title": "Outstanding Hotel and Location", "helpfulness": 4, "user": "Rosenfelder", "date": "July 12, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 5459782}, {"rating": 5.0, "stay_parameters": "Stayed June 2006", "text": "As for restaurants, the concierge happily made my reservations--I can highly recommend Dal Bolognese and Da Fortunato which is less than 1 minute from the hotel on foot.", "title": "Great Place", "helpfulness": 5, "user": "stephensmom", "date": "July 9, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 5.0}, "id": 5444662}], "location": {"country": "Italy", "region": "Lazio", "continent": "Europe", "city": "Rome"}, "stars": 3, "variance": {"poor": 25, "average": 53, "very good": 286, "terrible": 7, "excellent": 1593}, "aka": "Albergo Del Senato Hotel Rome", "slim_ranking": 0.00236593059937, "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.5, "rooms": 4.5, "location": 5.0}}