{"user_rating": 4.5, "review_count": 176, "name": "Albion", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "Hotel Albion was a great find in Florence. Definitely not super fancy but the room was clean and the staff was wonderful. Family run and owned. Daughter of the owner, Sara, works the front desk and she is a total doll. She's very knowledgeable about the area and gives great recommendations for restaurants. 10 minute walk into the center of town. When walking from the train station don't be scared. The streets into town and toward the river are much nicer and safe. Great shopping as you walk into town. My husband and I didn't book a fancy hotel in Florence because we knew we would be out of the room for most of the day. But this hotel exceeded our expectations because of the great staff. Definitely a good find if you are looking for a medium-price range hotel. Would stay here again!", "title": "Wonderful find in Florence", "helpfulness": 1, "user": "Traveler0917", "date": "June 3, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 16653045, "likes": {"liked": "— The staff", "disliked": "— The close location to buses"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled on business", "text": "This was my third stay at Hotel Albion and I cannot imagine staying anywhere else in Florence. While the hotel is certainly not considered \"fancy\" the people who run the hotel, Sara and her dad, Massimo, certainly make the whole experience a wonderful one. From the minute you step in the door you are treated like family and they go out of their way to make sure that everything is taken care of,. Restaurants are recommended, cars are reserved if needed, tickets to museums are reserved, and every detail is taken care of with a smile. I love the neighborhood this hotel is located in because it's far enough away from the hustle and bustle of the main piazza's, but in an easy walk to everything including the river. As a Hilton Diamond member I am accustomed to staying at 4 and 5 star hotels around the world, but in Florence it will always be Albion for me!!!", "title": "My Third trip to Albion!!!", "helpfulness": 1, "user": "bk2ca", "date": "April 29, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 3.0}, "id": 15462875, "likes": {"liked": "— Staff"}}, {"rating": 5.0, "title": "A Great Hotel in Florence", "text": "This hotel is within easy walking distance of any site you wish to visit. Sara is a fount of information and extremely helpful, friendly, etc. A real treat. Great breakfasts and not too expensive, either. Strongly recommended.", "user": "PhoenixJohn", "date": "April 20, 2008", "id": 15175108}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "We found out about this place through Le Boscarecce, owned within the same family. Sara was very helpful before we even arrived. She booked the Uffizi Gallery for us and gave a ton of information about the opera, we were very grateful for the assistance. The hotel is within walking distance to the Duomo, etc. It is a little hard to find when driving so just have good directions with you!", "title": "Great family run hotel", "user": "OttawaMaritimer", "date": "October 19, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 3.0}, "id": 10151009}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled on business", "text": "I stayed at the Hotel Albion in mid-July while attending a conference. Massimo and his daughter, Sara, were the quintessential hosts! They happily helped me with every detail of my stay...great suggestions for restaurants, tickets to museums, train reservations. My room was typically small, but impeccably clean, and the breakfasts were fresh and filling. It is a nice 10 minute walk into the historic center of town, and less than 5 minutes to the train station. If you have time, take the train down to Castelfiorentino, where mama Susanna and older daughter Swan run a magnificent inn and restaurant, Le Boscarecce. It was the perfect ending to my stay. I will definitely stay at the Albion again.", "title": "Amazing!", "user": "Keem58", "date": "September 8, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 8677667, "likes": {"liked": "— The staff", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled with friends", "text": "Delightful. All of the staff including the owner Sara went above the call of duty to help with directions, attractions, tours, restaurants and needs. VERY clean and comfortable. It is not like staying at the Ritz, but when you are at checkout and paying the bill you sure are happy. I travel for business and pleasure. In Vegas I stay at the Bellagio and the service at Hotel Albion was much more impressive. What you give up in fancy beds and marble vanities, you get back in location and service. Will definitely return.", "title": "Book it!!", "user": "mclark", "date": "November 1, 2006", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 3.0}, "id": 6042573}, {"rating": 4.0, "stay_parameters": "Stayed September 2006, traveled solo", "text": "Sara on the desk takes all the plaudits! She was just great, giving reassurance and good advice about where to vist and where to eat in Florence. My room was overlooking the noisy street outside. The noise drove me mad the first night, but I couldn't stop myself from opening out the tall windows, and gawping at the crazy traffic below and the mazy junction. Breakfast was great - the dining room had a really relaxed atmosphere and there was a nice camaraderie among the visitors. The rest of the staff were really nice and helpful. My stay here wonderfully rounded off my trip in Italia.", "title": "Loud, but just great otherwise", "helpfulness": 1, "user": "Conor_Montague", "date": "October 26, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "business": 3.0, "value": 3.0, "rooms": 3.0, "location": 4.0}, "id": 6014776, "likes": {"liked": "— The staff", "disliked": "— Noisy traffic!"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "We checked trip advisor for other hotels located in florence, italy. The reviews on this hotel had alot of positive feedback. We decided to stay at this hotel and made reservations. Every positive comment made on this hotel was accurate. We met Sara at the front desk, she was very friendly and very personable. We stood there 3 nights, and at anytime we had questions about dinning, shopping and site seeing, Sara was there to help immediately. The staff made our stay very pleasant. The continental breakfast was great. This was the best hotel that I had ever stayed that made you feel like family.", "title": "A City to Remember", "helpfulness": 1, "user": "TwoTravelors", "date": "October 22, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5983493, "likes": {"liked": "— Location", "disliked": "— None to say"}}, {"rating": 2.0, "title": "Overpriced Hostel", "text": "We stayed at the Hotel Albion for two nights in October 2006. We booked the hotel because TripAdvisor users raved about the place. We found the owners to be friendly and helpful but honestly that would be the only thing worth raving about. The hotel is on a very busy street (we slept with earplugs in every night) and the atmosphere/decor is decidedly funky. This place had more of a hostel-vibe than that of a hotel. The room was clean but with dated furnishings and a lino floor. The bath towels were like large dishcloths. The included breakfast was fine - just fruit, juice, cold cereals and pastries. We thought that this place was extrememely overpriced.", "user": "zygomatic", "date": "October 22, 2006", "id": 5983164}, {"rating": 4.0, "stay_parameters": "Stayed October 2006", "text": "I just returned from a week long stay at the Hotel Albion. The staff are wonderful. Sara speaks fluent English and was extremely kind and helpful. Our room was less than wonderful upon arrival, but we were moved to a lovely room at the top of many stairs. The location of the hotel is perfect for day trips from Florence as it is near to the bus and train station. The area is safe, but noisy. We loved our stay there. The only negative was the noise from the street. The entire staff was pleasant and made us feel welcome.", "title": "Enojyed the Hotel Albion", "helpfulness": 1, "user": "waybackgranola", "date": "October 16, 2006", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 5961569}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "My boyriend and a visiting friend stayed at the Albion for 2 nites, Aug 12-14th. It's quite difficult to get a Triple room, but they put us in a Family room, so it actually had 2 seperate rooms, one with a double bed and one with two twin beds. Would be perfect for a family, or up to 4 friends travelling together! We actually arrived in Florence without a room and went directly to the main train station to ask at the tourist information desk. So we weren't picky and weren't expecting the world. But for what we got we are all satisfied! The price was 120EUR in total including breakfast AND parking. It's a 7 min walk along the river to the Uffizi Museum. And maybe 5 min into the city area (pedestrian zone, shopping, dome etc.) It's a walk but it's not so far that you need to take a taxi or bus. The staff are all friendly and polite. They even tried to help us in getting reservations into the Uffizi, as waiting in the ticket line can be 3 hours+ long! The breakfast buffet is stacked with croissants and will keep you full until lunchtime. The only thing is that the bathroom was a bit small and the hose attached to the shower head exploded once...but when we told them, they had a new hose/shower head fixture attached by the time we returned in the evening. It is on a street where buses drive by so opening the windows at nite is not meant for everyone. They have air conditioning to keep you cool if you leave the window shut (to avoid noise).", "title": "We enjoyed our stay!", "helpfulness": 1, "user": "deutscheAi", "date": "August 19, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 8451365}, {"rating": 5.0, "title": "What a wonderful place!", "text": "While researching hotels in Florence I was quite happy with the majority of the reviews given for Hotel Albion. Thank goodness I booked a room there; the hotel is fabulous! The staff, the hearty breakfasts, the decor on every floor (including art work galore) and the location make this a gem. Our room was sparkling clean, spacious and had everything we could possibly need, including a balcony. Sure, there is some traffic noise, but it doesn't go on all night and the glass doors and wooden shutters sufficiently cut down on the noise level. I am not a 'city' person but I must admit the traffic noise did not bother me as I had thought it might. Right around the block are great restaurants, rental car agencies, gelateria, shops and nearby are some of the great sites of Florence - one can walk everywhere.", "helpfulness": 2, "user": "lovetotravelTarzana", "date": "May 21, 2007", "id": 7668889}, {"rating": 1.0, "title": "Charming family hotel", "text": "I can only say thank you again to the wonderful staff of the Hotel Albion, where I hope to make a return visit sooner than later!", "helpfulness": 2, "user": "Cathare", "date": "January 8, 2007", "id": 6564644}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "Laura Marlowe", "title": "Great Stay in Florence", "helpfulness": 5, "user": "Halekulani", "date": "November 11, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6106117, "likes": {"liked": "— central location, friendly service", "disliked": "— no elevator"}}, {"rating": 2.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "A family hotel where the word service is reality.", "title": "Not so Good", "helpfulness": 1, "user": "BoomerTravel", "date": "November 5, 2006", "detail_rating": {"cleanliness": 2.0, "front_desk": 3.0, "location": 3.0, "service": 2.0, "rooms": 1.0}, "id": 6059948, "likes": {"liked": "— Near train station so you did not need a taxi", "disliked": "— Older hotel with mismatched junk furniture and no real bath towels."}}, {"rating": 4.0, "title": "Lovely Florence", "text": "Did you always want to visit Florence, the city where Michelangelo, Dante Alighieri, Leonardo da Vinci and the proud Medici dwelled? How about spending a few days in an old city palazzo and still being able to afford it?", "helpfulness": 2, "user": "Sinikka", "date": "October 11, 2006", "id": 5938816}, {"rating": 4.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "Imagine staying in a hotel but still feeling at home...", "title": "Sara R. is the hostess with the most personality", "helpfulness": 1, "user": "nuts7hawk", "date": "September 19, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 5817352, "likes": {"liked": "— Service", "disliked": "— Breakfast"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2006, traveled with family", "text": "Imagine being received by charming people...", "title": "Finally....Customer Service!", "helpfulness": 1, "user": "Toronto06", "date": "September 11, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 3.0}, "id": 5791010}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled on business", "text": "Imagine viewing within a few steps from your room the flaming sunset behind the river Arno...", "title": "Home away from home!", "helpfulness": 5, "user": "Zandria", "date": "July 26, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "business": 5.0, "value": 5.0, "rooms": 4.0, "location": 4.0}, "id": 5513779}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled solo", "text": "Imagine walking only ten minutes and reaching the Museum of the Ufficine with ist wonderful cultural riches...", "title": "Hotel Albion is like staying at home!", "helpfulness": 4, "user": "joeygirl30", "date": "July 24, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 3.0, "rooms": 4.0}, "id": 5503385, "likes": {"liked": "— The hospitality staff"}}], "location": {"country": "Italy", "region": "Tuscany", "continent": "Europe"}, "stars": 3, "variance": {"poor": 10, "average": 11, "very good": 66, "terrible": 2, "excellent": 87}, "aka": "Albion Hotel", "slim_ranking": 0.282608695652}