{"user_rating": 4.0, "review_count": 358, "name": "Alderbrook Resort & Spa", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "This resort really treated us well. We drove a long way to visit and they offered us a nice canal view corner suite upgrade. Rooms are quite spacious but the bathrooms not so much. The lobby is quite attractive and the two resident cats seemed to take full advantage.", "title": "Great Stay at Alderbrook", "user": "monarg", "date": "November 17, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 3.0}, "id": 145592853}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "The food was top notch, we especially enjoyed the orange juice and waffles for breakfast. My lunch favorite was the clam chowder.", "title": "Relaxing and beautiful!", "helpfulness": 1, "user": "Alisha H", "date": "November 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 145533024}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "The only complaint I had were the high prices for the spa which were quite frankly over the moon. The resort was not busy and should have offered guests some specials with the weather being what it was.", "title": "Hood Canal Hilight", "user": "clausrock", "date": "November 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 145267794}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled with friends", "text": "My husband and I have stayed at Alderbrook a few times over the past couple of years, always because we attended an event there and didn't want to drive home after. This stay was a 2 night stay for my birthday. I have to say, I've always thought Alderbrook was overpriced, but this stay changed my mind a bit! As usual, the hotel is very clean and beautiful and the views are breath-taking.", "title": "Alderbrook Resort and Spa:Get Refreshed!", "user": "357Teresa357", "date": "November 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 144969092}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled with family", "text": "This time, we ate at the restaurant (which we've done and enjoyed many times before) and enjoyed spa services and the pool and sauna/steam rooms. We walked the grounds, even though it was a drizzly day. And we really, really enjoyed ourselves.", "title": "Charming Luxurious Weekend Retreat", "user": "gayle p", "date": "November 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 144630319}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled with family", "text": "The staff knows how to support and wedding and makes a super effort to handle all details expeditiously and superbly. The setting for the wedding is beautiful. The facility is clean and cared for. Stayed in a cabin. Slept well. Comfortable. Wedding was beautiful! Price of wedding events were reasonable. This place is easy to recommend by any happy father of the groom.", "title": "Great place for a wedding!!!", "user": "Ted R", "date": "November 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 144627332}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled on business", "text": "I was there for a business retreat and my husband and 1 year old son came along. From the initial reservation, to the guest room set-up (pack-n-play waiting in our room) to the restaurant staff (brought crackers for my son to nibble while we waited on our dinner) - every need was met and expectation exceeded!", "title": "Work - Play - Family: All needs were met!", "user": "KTougas", "date": "November 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 144622793}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "My husband and I spent an evening at Alderbrook as a Anniversary Celebration and a quick getaway! Next time we'll stay longer!", "title": "A quick but enjoyable getaway", "user": "Pam S", "date": "October 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 143397921}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "The staff greeted us warmly and our dog was made welcome with his own doggy bed in the room! The grounds are beautiful as is hiking the immediate grounds surrounding the resort. Our room was comfortable and had a door access to outside for \"quick\" walks with our dog.", "title": "Perfect getaway close to Seattle", "user": "la12_traveler", "date": "October 10, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 142492746}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "Our dinner was delicious as was the breakfast the next day! All in all- we recommend and will return for a longer retreat and utilize some of the resorts spa services!", "title": "A welcome surprise", "user": "WondrTravelr", "date": "October 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 142315879}, {"rating": 5.0, "stay_parameters": "Stayed September 2012", "text": "A very nice resort. We won a free night's stay otherwise we would not be able to afford the price of the room. The food in the restaurant was good again a bit pricey. The service was excellent. I would definitely recommend a stay here if price is no object!", "title": "Beautiful location", "user": "CindyBGrapeview_WA", "date": "September 24, 2012", "detail_rating": {"cleanliness": 5.0, "value": 2.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 141142913}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "There are many things to like about the Alderbrook Resort. The resort is right on the Hood Canal with lots of beach access. There are kayaks to rent or you can cruise the canal on the Lady Alderbrook. The indoor pool is huge, and is bright and cheery. We had a room with 2 queen beds in the lodge. It was on the smaller side, but still large enough for two adults and two kids. One of the kids was able to sleep on the large window seat. Our room also had a balcony with a lovely view of the water. There was a huge soaking tub in the bathroom. The walls were somewhat thin and we were able to hear our neighbors on more than one occasion. The lobby had lots of comfortable seating with a huge fireplace. Our children enjoyed access to the DVD library and the chess board in the lobby, but by far their favorite thing (aside from the pool) was petting the resort's resident cats, Alder and Brook. My only complaint has to do with food. It was way over priced. There was a main restaurant as well as a \"patio\" that is open seasonally. Twice we ordered room service from the main restaurant. Delivery was prompt, but the food was too expensive for what it was. (The room service prices were the same as the restaurant prices.) We ordered lunch on the patio once. While the prices were slightly more reasonable (particularly the kids' meals) the service left something to be desired. After waiting forty minutes for our food, we were forced to gulp down our meal in order to make it to our cruise on the Lady Alderbrook. It's as if the resort knows that there really aren't any other great dining options in the area so they're free to charge whatever they wish for mediocre food and mediocre service. If they could address this one issue, they would easily earn 5 starts from me.", "title": "Nice resort in a fairly remote location", "user": "Karen N", "date": "September 17, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 140551817}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled on business", "text": "I had the pleasure of staying at Alderbrook which represents all the goodness of the pacific northwest. From my balcony, I enjoyed my morning coffee with a beautiful view of the ocean while listening to a waterfall in the lodge hotel garden area.", "title": "Great Spot in Puget Sound", "user": "NWRiver", "date": "September 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 140309259}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "The hotel has a craftsman design with large fireplace in the lobby and lots of cozy seating. It is surrounded by walking trails and has a great open fire pit. There are about 10 private cottages adjacent to the main facility that is fully furnished with a nice lounge, resturant, spa, and in door swimming and workout center. A golf course is across the road.Bikes and sea kayaks are available.", "title": "Exceptional wedding location!", "user": "williesmomok", "date": "September 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 139960456}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "The rooms are large and attractively decorated. Beds are comfortable with lots of soft pillows. I left relaxed after soaking in some sun and fresh air in a beautiful surrounding. The staff was great and went out of their way to be helpful. Great quick trip!", "title": "Olympic View - Rustic, sophisticated - full service resort on Hood Canal", "user": "KatieKey", "date": "September 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 2.0, "sleep": 2.0, "rooms": 5.0, "location": 5.0}, "id": 139949324}, {"rating": 2.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "We made the trip to Alderbrook from our home in Tacoma to experience a great dinner in a beautiful setting. While the location is idyllic, the restaurant was a huge disappointment. We were seated for dinner at 6:30PM and ordered fairly quickly as I had both my children with us. The service was excellent and my initial impressions were positive. The appetizers arrived in a reasonable time, however, the clams were swimming in a broth that was so salty I needed to drink water after each bite. The crab cakes were good. The next 1.2 hours proved to be the most frustrating. It took well over 1 hour from the time we finished our appetizers to the time dinner was finally served, We were repeatedly told that it would be just a few more minutes. When dinner finally arrived I would say most dishes, there were 6 of us, were good but not great. My son's ravioli was overcooked and bland. The other dishes were just OK. When you are spending in the neighborhood of $30-$40 for an entree you expect an excellent dinner. The host did apologize for the slow service telling us that it was an unusually busy night coupled with a new kitchen staff. Had I not made reservations well in advance, I might be more understanding.Will we go back-never", "title": "Disappointed", "user": "Mark H", "date": "October 8, 2012", "detail_rating": {"value": 2.0, "service": 5.0}, "id": 142303077}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled on business", "text": "We were here for a conference. The facilities were superb, comfortable chairs, break out rooms, plenty of restrooms, attentive staff, reasonable food. The food was very good , not spectacular but then conference food rarely is.", "title": "Great conference facilities", "helpfulness": 1, "user": "LaurettaYoung", "date": "October 7, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 142249723}, {"rating": 5.0, "stay_parameters": "Stayed October 2012", "text": "The rooms were comfortable, the decks are tiny but have lovely views of the water and the mountains. The beds and linens were superb. The place is relatively \"noisy\"-- in some hotels the doors have an automatic easy shut so they don't slam-- not this one- lots of slamming loud doors all night. Also you can easily hear all your neighbors flushing toilets, showering, etc --even with earplugs. Again at a place this expensive I have been at other properties which attended to these experiences... that's mainly why it gets a very good.", "title": "Excellent hotel, for short retreat or business meeting", "user": "Daidalos66", "date": "October 5, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 142094014}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "The staff were attentive and helpful. The lobby was lovely with a fireplace, two adorable cats, coffee in the AM and flavored water and apples all the rest of the day with newspapers.", "title": "Our Favorite getaway", "helpfulness": 1, "user": "Linda C", "date": "October 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 141842501}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "The food in the restaurant and bar was so so. The first night we has oysters-- reportedly Hama hama Bay oysters are world renowed. Well you sure couldn't tell by the huge amounts of breading and gloppy sauce all over them. The clam chowder and the salads were really good as were the martinis and wine selection. The next night my husband had the vegetarian raviolis which were good but not particularly special. I had fish and chips-- Ok but not superb...", "title": "I'll be back!!!", "user": "Karen S", "date": "September 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 141501023}], "location": {"country": "United States", "city": "Union"}, "variance": {"poor": 28, "average": 29, "very good": 95, "terrible": 10, "excellent": 196}, "aka": "Alderbrook Resort And Spa", "slim_ranking": 1.0, "description": "Walking hand in hand, you see an eagle soar overhead. You stop to skip stones across the water. Four, five, six skips. A perfect moment suspended in time. A story for dinner. This is the place where memories are made, where families come back year after year. Like having your own waterfront cottage, only better. Cartwheels on the grass. A game of badminton at sunset. Leather couches and a glass of Washington state Syrah. The sweet succulent bite of fresh oysters. Rooms that make you say “wow” when you open the door. Can this hotel be only two hours from Seattle? It can. Welcome to Alderbrook Resort & Spa."}