{"user_rating": 4.0, "review_count": 762, "name": "Aldwark Manor", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled with family", "text": "We stayed at this hotel mid-week with our 6month old baby and it was excellent. On arrival the staff were very friendly and helpful. The facilities are fab, the pool is very warm and there is a jacquzzi, sauna and steam room to relax and enjoy. Our 6 month old loved the pool, only downside is children aren't allowed in after 5.30pm.", "title": "Lovely place, highly recommended.", "user": "Speed1981", "date": "March 31, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 102320956}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "I couldnt recommend this hotel enough.", "title": "Best break in the UK", "user": "sts20", "date": "March 31, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 102261450}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled solo", "text": "We have just come from a 2 night break at this fantastic hotel, and the biggest thing that stands out from every other hotel in the UK (and I travel a lot) was the service and friendliness of the staff. They were extremely chatty, giving you their undividided attention and making us feel so welcome - I truly salute every single member of staff!", "title": "Fantastic hotel in stunning surroundings", "helpfulness": 1, "user": "FiHenley", "date": "March 19, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 100748871}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "The actual hotel is beautiful, the room was wonderful and I truly appreciate you catering to my needs with the non alcoholic drinks in the room being pregnant! Thank you so much again and I cant wait to return this time bringing the little one with me!", "title": "Lovely service and hotel - but book spa treatments way in advance!", "user": "YoohooUk", "date": "March 14, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 100106179}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled with friends", "text": "I recently stayed at the hotel and had a two night break away. The bedroom was wonderful with views across the golf course. The serive was very good and i would certainly go back again soon! Great to be so close to York yet be in the glorious country side!", "title": "Fantastic, beautiful place, staff really helpful and only a relatively short taxi ride from york town centre", "user": "Joooools186394", "date": "March 10, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 99697303}, {"rating": 4.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "To whom it may concern,", "title": "'CAN MAN'", "user": "chattyLJ", "date": "March 1, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 98526759}, {"rating": 3.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "I write with reference to my recent visit to Aldwark Manor Hotel in the company of my beautiful fiance'. I booked the hotel as a last minute decision to spend a couple of nights in the North Yorkshire area and I must say we certaintly weren't disappointed.", "title": "Excellent value on promo break but not sure it's 4 stars", "user": "Cyberhell", "date": "February 28, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 2.0, "location": 5.0}, "id": 98369362}, {"rating": 4.0, "stay_parameters": "Stayed February 2011, traveled with friends", "text": "On arrival we were greeted by a very helpful receptionist who booked us in promptly and efficiently. The room was amazing, had a beautiful view and contained everything one would expect from a 4 star hotel.", "title": "An enjoyable pamper break & with some tweaks would be excellent.", "user": "Pakathecat", "date": "February 27, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 98228233}, {"rating": 4.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "Our first afternoon/evening was excellent, having spent the afternoon using the hotel's exellent pool, sauna, and spa facilities we made our way to the restaurant and were greeted by a very helpful, polite suited man who showed us to our table, he provided us with two menus, a wine list and a full explanation of what menus we could order from, this as part of our 2 night package.", "title": "Relaxing trip, staff were friendly and couldn't do enough for you.", "user": "johno_mustard", "date": "February 16, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 96826835}, {"rating": 4.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "Throughout the night we were waited on by a very polite, professional young chap who served us with a smile and a great enthusiasm, (this man became known to us only as 'Can Man', I'm sure he knows the reason!!! :) ). The reason we write this email is in order to give 'Can Man' a special mention, his professionalism and politeness didn't go unnoticed by ourselves and he certainly stood out!", "title": "Nice hotel, with good food and a good spa", "user": "sarah___1988186", "date": "February 15, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 96782190}, {"rating": 4.0, "stay_parameters": "Stayed March 2011", "text": "We have just returned from an overnight Spa Break at Aldwark Manor and found it lovely and relaxing. The hotel is situated in the wonderful countryside far from any busy roads and is therefore fabulously quiet. Check-in was simple and our room was excellent, in a newer extension and right at the top (there is a lift), the window was a velux and so to appreciate the view we had to balance on the sofa but it was well worth it! The room was clean and spacious and the beds were beautifully soft and comfortable, there was a supply of up to date magazines and a small selection of toiletries. The spa area is great, lovely pool etc, there was a shortage of lockers though and only 2 hairdryers which were always in use. The inclusive lunch was a buffet, we were offered soup, a hot pasta dish, a lasagne and jacket potatoes with salad, for dessert it was a fresh fruit salad. The evening meal was excellent, we had an inclusive deal so the set menu was perfect, lots of choice and really good VFM, the a la carte also looked brilliant though quite pricey. The staff were very efficient and attentive and we had a most enjoyable evening. The following mornings breakfast service was \"interesting\", a group of young girls came down in their dressing gowns and pyjamas which raised a few eyebrows and I would question the management allowing them to do so in a 4* hotel. Also the cooked breakfasts were served so promptly that we had barely finished eating our cereal and the bowls hadn't even been cleared when the young man arrived with our plates of hot food, we observed this happening to most of the other diners, some having not even finished their cereals and so having to do so from the side of the table...bit of a timing issue here!? These minor issues aside we had a very pleasant stay and would definately return for an away from it all relaxing break.", "title": "Lovely Spa Break", "user": "LittleMissForgetful", "date": "March 7, 2011", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 99294325}, {"rating": 3.0, "stay_parameters": "Stayed March 2011", "text": "We stayed in room 401 and this room is in desperate need if refurbishment. Although it is spacious and has a view of the golf course, the furniture is scratched to pieces, worn and tatty, the furniture is ready to collapse, is dirty and the bathroom is older than my grandparents which was installed in the 70's. When you pay £150 per night you really expect better than this. This room was supposed to be superior and did have a four poster bed but a very tatty one, on dirty worn out carpet and you just didn't feel comfortable at all. The room hasnt been updated since the 80's, maybe earlier. People have talked about upgrading going on but we saw no signs of this. The room had no mini bar, no fridge, no water, no ice bucket and basic tea/coffee. I heard reports about a refurbished wing with contemporary rooms but it seems that you take your chance here and without any discount on the old run down rooms which is not fair. The shower had no pressure and temperature was impossible to control. The bath was tiny and so old fashioned (pale pink) that we didn't want to use it. The tv does not show sky channels yet the bars downstairs do. A cheeky way of getting guests out of their rooms when sport on tv and into the bar area and buying drinks.", "title": "Poor room standard", "helpfulness": 1, "user": "TOGETHER_WE_TRAVEL35", "date": "March 6, 2011", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 3.0, "service": 5.0, "rooms": 1.0}, "id": 99119098}, {"rating": 2.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "The room service menu is small and triple decker sandwiches come as single decker and are average.", "title": "Fab setting but the hotel is tired", "helpfulness": 1, "user": "traceashley", "date": "March 6, 2011", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 2.0, "sleep": 5.0, "rooms": 1.0, "location": 4.0}, "id": 99106961}, {"rating": 3.0, "stay_parameters": "Stayed February 2011, traveled with friends", "text": "The spa was very nice and relaxing. Drinks and food reasonably priced apart from small bottles of Becks at £3.60 which is crazy. They provide free tea and coffee which is a nice touch. There were a lot of hen parties here. We couldn't get near the jacuzzi for ages as it was full of women and when we did we found the water cold. The sauna and steam room are nice and so is the pool but be careful to make sure you choose the adults only pool times if you want piece and quiet. On a weekend they have periods every now and then where parents arrive with children and that can be a distraction. I have to mention that the mens changing facilities are very poor indeed. Paint falling off all over, dirty floors, Walls, mould and rust in showers etc and small changing space. Not spa standard at all.", "title": "good value for money on an offer", "user": "Bluebell30", "date": "March 2, 2011", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 98659925}, {"rating": 3.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "The staff here are wonderful. I have to say that. The hotel must take great pride in attracting such good staff, training them so well and holding onto them from such a small catchment area. The bar staff, receptionist and other staff were incredibly polite at all times and professional from check in to check out.", "title": "rooms are never ready on time which really lets them down", "user": "amanda_rouell", "date": "March 1, 2011", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 98570611}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "Spent the Easter weekend at Aldwark Manor. We had a room with a lovely view over the golf course. Staff were courteous and there was attention to detail. The meals we had at the restaurant were superbly cooked and well presented. In short, there was nothing to fault at Aldwark Manor Hotel.", "title": "Excellent hotel", "user": "Dunedain", "date": "May 2, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 106503390}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "It was a dream to stay at aldwark manor, the staff were helpful and friendly. The location was ideal forn nearby towns or countryside and the facilities were first class. paradoxicallythe surroundings were so tranquil and away from it all", "title": "relaxing and peaceful", "user": "brockies", "date": "April 30, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 106201866}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "We spent a wonderful two night stay in a junior suite, the accommodation was modern and comfortable, the service from the staff friendly and professional. The spa was terrific - very relaxing and we spent a very enjoyable afternoon enjoying unseasonal sunshine by the pool and soaking in the jacuzzi.", "title": "Can't wait till we can have another weekend there", "user": "MichaelWalshLeeds", "date": "April 26, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 105585013}, {"rating": 5.0, "stay_parameters": "Stayed April 2011", "text": "The food was wonderful with buffet breakfast and lunch and we enjoyed meals from both the 'all-in' and a la carte menus, both have much to recommend them.", "title": "Great hotel with great facilities", "user": "Rex B", "date": "April 18, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 104528800}, {"rating": 3.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "The only complaint? That the weeekend had to end, can't wait to head back for another long weekend of total self-indulgent relaxation.", "title": "Enjoyable stay", "user": "mim0714", "date": "April 17, 2011", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 2.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 104385729}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "stars": 4, "variance": {"poor": 74, "average": 131, "very good": 194, "terrible": 38, "excellent": 325}, "aka": "Aldwark Manor Hotel Aldwark", "slim_ranking": 1.0, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.5}, "description": "Aldwark Manor Golf and Spa Hotel is located near York. It is nestled in a picturesque village in between York and Harrogate within the stunning North Yorkshire Moors. Even though this gem of a hotel makes you feel a million miles away, it is just a hop, skip and a jump away from the A59. What better way to take in the views than to play the 18 hole golf course? The challenging course is set amidst gorgeous rolling hills. This hotel is a real mix of old and new. With 54 individually designed bedrooms which are split between the modern contemporary wing of the hotel and the traditional Manor house. If you are staying on business then the hotel has 6 conference and meeting rooms for up to 240 people. What's more the superb grounds covering 100 acres are ideal for team building events. Indulge yourself with an array of treatments at the spa or build up a sweat in the leisure club. Finish off the day with a delicious meal in our award-winning Brasserie, or snack on a selection of tasty nibbles whilst overlooking the manicured golf course in either The Terrace or Squadron Bar."}