{"user_rating": 5.0, "review_count": 356, "name": "Ale House Inn", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled solo", "text": "My mother was the \"queen\" of Portsmouth in her day. It's the city where I grew up. When my brothers and I had her funeranal I needed a place to stay that reminded me of home--both its elegance and its working class roots. The \"Ale House Inn\" was so perfect for me. I had two nights alone in complete comfort and seacoast lovleness. Everything was withing walking distance.. Portsmouth , being a seacoast town, always changes, and always remains the same. It was such a pleasant place for me. I'm so glad somebody understands the beauty inherent in this quirky seacoast town. the colors, the atmosphere, the lightning.... I hope the inn doesn't have to go to outrageous pricing to stay in business. Go. Enjoy the town.", "title": "A Respite from the storm", "helpfulness": 1, "user": "DICEWeybridge_VT", "date": "April 22, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 28586804}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled with friends", "text": "My best friend and I love Portsmouth and wanted to try the Ale House Inn as we are friendly with Doug from his time in Boston. The Inn is located in Portsmouth center so that we could park and walk all over town easily. The Inn itself is so beautifully designed and decorated we felt at home in the spacious sitting area and comfortable in our amazing room complete with very large TV and amazingly comfortable bed! Also, I LOVE the Aveda products and Dwell bedding that are provided. I can not wait to go stay again!", "title": "Lovely and wonderful", "helpfulness": 1, "user": "Thehl", "date": "April 21, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 28522067}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "My boyfriend and I stayed at the Ale House Inn for a quick weekend getaway. We did not want to stay at a motel, or old B&B, but also did not want to stay at chain hotel (Hilton or Sheraton), so we elected to stay at the Ale House Inn.", "title": "Boutique Inn with Great Location!", "helpfulness": 1, "user": "Gailou", "date": "April 20, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 28385845}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "Doug has done a great job renovating this inn - modern, sleek, but without pretention. The bed and sheets were very comfy! Great attention to detail - love the lighting, wine opener/wine glasses. Doug also provided a map with recommendations of where to walk/dine/shop - very much appreciated and took him up on all suggestions! He also provided a nice bottle of wine for us on Saturday night! Most of all, we appreciated the location of the inn - within 5 minute walk of Market Square. We parked our car on Friday and did not use it all weekend. We will definitely be back!", "title": "Beautiful and Unique", "helpfulness": 1, "user": "Cozmob", "date": "April 6, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 27507898}, {"rating": 5.0, "title": "Great Little Town, Laid Back Inn. A Pleasure", "text": "This was my first trip to Portsmouth for my wife and I and just wanted a good place to relax. The Ale House Inn was the perfect place for that.", "user": "marcp13", "date": "August 4, 2009", "id": 36699475}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "We stayed here under previous owners and ti was ok. Two years later, it was AMAZING! They really took the time and effort to make it a special little hotel, not just in the middle of everything for the price. It was lovely.", "title": "Lovely Little Inn!", "user": "Leaudemiel", "date": "August 11, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 37389930}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "The beds were big, the in room amenities were great, it was a comfortable place to stay for two nights.", "title": "Wonderful Little Inn", "user": "Dub61", "date": "August 11, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 37369744}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "Though there isn't a restaurant on site, they are very accommodating with helping you find some dinner and things to do. And they really seemed to put a lot of thought into things before just printing out lists of where to go/etc.", "title": "Great Experience", "user": "mkielty", "date": "August 11, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 37363985}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "My wife and I recently stayed at the Ale House Inn and totally enjoyed the experience. We had stayed in the Inn previously when it was known as the Bow Street Inn and the new owners have provided all the updates the property sorely needed. The amenities in the rooms are in line with those you would find in a modern hotel chain (e.g., W Hotels). The furniture, bedding and decor were all sleek without being cold. The flat screen television and bedside Sony Dream Machine with I-Pod docking station were cutting edge. Portsmouth, NH is a town suited to walking and The Ale House Inn is within easy walking distance of all Portsmouth has to offer. The Ale House Inn is less expensive than the chain hotel within walking distance of downtown and a class above it in terms of style and charm. A dedicated owner/manager on-site will ensure your visit is first class.", "title": "Great Place to stay in Portsmouth!", "user": "mandoperson", "date": "August 10, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 37281674}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "The Ale House Inn was the perfect place to stay in Portsmouth. Off the beaten path, but no so far you can't walk to Market and Congress Streets, it was exceptional. The Inn Keepers, rooms, information, everything was first class.", "title": "Tasteful modern hotel", "helpfulness": 1, "user": "iwn2000", "date": "August 5, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 36805940}], "location": {"country": "United States", "city": "Portsmouth"}, "variance": {"poor": 4, "average": 12, "very good": 51, "terrible": 0, "excellent": 289}, "aka": "Ale House Hotel Portsmouth", "slim_ranking": 0.2, "description": "Housed in a former brewery on historic Bow Street, the Ale House Inn is Portsmouth's urban inn. 10 guest rooms appointed with 32\" flat panel televisions, iPod docking stations, Keurig coffee makers, refrigerators, free WiFi and private baths. Please note: we are not a Bed and Breakfast, as we do not serve food at our property."}