{"user_rating": 4.5, "review_count": 852, "name": "Alexander Inn", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "My husband and I booked this hotel on its website after reading about it on Budget Travel, and were happy to see all of the excellent reviews it received from other guests. The Alexander Inn is wonderful. We checked in around 11:00 am on a Saturday, and the front desk encouraged us to enjoy the continental breakfast while we waited for an available room. Check-in wasn't until 3:00 pm but they had a room ready for us by 11:30. The hotel's breakfast is EXCELLENT--try the delicious granola cereal! There is also a wide array of pastries, fruit, juice, and coffee from which to choose.", "title": "Perfect Price, Perfect Location, Perfect Service!", "helpfulness": 6, "user": "Foodie26", "date": "January 27, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 13032933, "likes": {"liked": "— Good Value", "disliked": "— Sometimes House-keeping was a bit noisy in the mornings."}}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled solo", "text": "Our room was great as well. We made reservations for one of the smaller rooms with a full-size bed and were worried at first that the room might be cramped, but it was spacious and had an amazing street view, so if you are wondering if the 170 square foot room with one double bed might be too small for two people, don't worry, because there is plenty of space.", "title": "Almost perfect", "helpfulness": 8, "user": "TimManchester", "date": "December 27, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 11982228, "likes": {"liked": "— Value for money and great friendly service"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2007", "text": "The staff was always friendly and willing to give advice on great places to eat and fun things to do in the city, and they're always happy to explain public transit. Milton, who is in charge of the continental breakfasts in the lobby, always went out of his way to answer our questions and point us in the right direction.", "title": "Well-located Boutique Hotel", "helpfulness": 7, "user": "smoothride2007", "date": "December 22, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 3.0}, "id": 11887837}, {"rating": 4.0, "stay_parameters": "Stayed March 2007, traveled with family", "text": "The location of the Alexander is excellent as well, as you are only a few short blocks from great places to eat and the location of the hotel is very safe, too. We will definitely stay at the Alexander Inn again when we return to Philly!!!", "title": "Great Stay", "helpfulness": 4, "user": "plannerCA", "date": "December 18, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 11654876, "likes": {"liked": "— Location and that they provided breakfast"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2007, traveled with friends", "text": "Booked this hotel for a last minute, one night stay after checking Tripadvisor as usual and was lucky to get the last room they had. Location is perfect, as I imagine most hotels are as the city is so easily walkable. The welcome you get from the staff is very friendly and nothing seemed too much trouble. So the room wasn't huge but for these prices you should not expect luxury - what you get instead is cleanliness, comfort, friendly service, humour - all the things that make for a great little hotel. I'm coming back here in October and would recommend the hotel to anyone.", "title": "What a great find in a great location!", "helpfulness": 3, "user": "starzero", "date": "December 16, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 11608843, "likes": {"disliked": "— Not the best neighborhood late at night...doesn't have anything to do with the hotel, just the location."}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled with friends", "text": "A friend and I were looking for a small hotel in Philadelphia. Definitely didn't want a large chain. The Alexander was a great find ... convenient, reasonably priced, and with all the amenities we needed. The hotel is beautifully and tastefully decorated. Our room was very comfortable and quiet, the bathroom was clean and modern, and we were pleased to find we had a fridge and in-room safe. All the staff were friendly and helpful. I would definitely stay here again and recommend it to family and friends.", "title": "A fabulous find in Phila", "helpfulness": 1, "user": "Home_and_away_too", "date": "March 21, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 14429257, "likes": {"liked": "— Decor and value"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled solo", "text": "Everything about the Alexander Inn was wonderful! Staff, location, decor, breakfast, price.", "title": "couldn't be better!", "helpfulness": 1, "user": "dawnvOR", "date": "March 16, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 14320179, "likes": {"liked": "— courteous and helpful staff", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled on business", "text": "I was traveling alone and stayed in a single (twin) room which was perfect for one.", "title": "Precious gem!", "user": "Lorinfur", "date": "March 3, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 14012543, "likes": {"liked": "— Room was very comfy and well-appointed.", "disliked": "— If you're a klutz, watch the edge of the platform bed!"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled with friends", "text": "I feel really lucky to have found the Alexander Inn on my first visit to Philadelphia. No more searching. This is the only place to stay in Philadelphia!", "title": "The Alexander Inn is great.", "user": "NYCJohnny1", "date": "February 16, 2008", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 13601997, "likes": {"liked": "— The people, the building, the beds.", "disliked": "— No internet in our room."}}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "I work for the fed govt and had to travel to Philly. At first I couldn't find anything at a decent hotel (Loew's, Doubletree, Marriott, etc) for the per diem I am allowed, and I was resigned to having to come out of pocket to stay somewhere safe and decent. Then I found this hotel on Trip Advisor. It was rated #3, but it should be rated #1! It's supposed to be a \"boutique\" hotel (translation - rooms no bigger than a closet), but my room was very spacious (I had King room on the 7th floor), and well-appointed with a good sized, immaculately-clean bathroom. The bed was firm but very comfy, and the service - from my first call to the hotel to make reservations to the time I checked out, was gracious and welcoming. Lots of places in the hotel to just sit and relax (the Great Room), and lots of places in the neighborhood to eat and/or relax over a cocktail. All this and it was within the govt per diem!", "title": "Excellent Place!! Hidden Treasure", "user": "morenachica", "date": "February 15, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 13564510}, {"rating": 5.0, "title": "Outstanding Value in Philly's Center City", "text": "Outstanding service at every level: checkin in, restaurant advice, knowledge of local events including art, music and theater, superb breakfast, and accommodating in every way. Best of all the price is highly competative.", "helpfulness": 1, "user": "Professor-007", "date": "December 16, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 11607262, "likes": {"liked": "— Thoughtful service", "disliked": "— No on site parking"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2007, traveled solo", "text": "Since March 2007 I have stayed in Philadelphia on 8 different occassions. Every time has been in a hotel and usually for more then one night. After reading many reviews about Alexander Inn I decided to book there and see for myself what the place was like. I did try to book it for a few stays during the summer, but they were totally full both times I tried.", "title": "European style hotel", "helpfulness": 3, "user": "KCmusiclady", "date": "December 8, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 11327407, "likes": {"liked": "— Location and breakfast", "disliked": "— Worn bed spread and no coffee in room"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled solo", "text": "Right now, for the price and amenities, I prefer Alexander Inn. I am booked there again in December for 2 nights, Don't know the history on this place, but it has been beautifully restored with an art deco flair. Furniture is mostly art deco and many pieces are top quality. Bathrooms are small but constructed with \"real\" tile and grout. Real wood in the hallways and elevator entry-ways. The place was restored to last for a while.", "title": "Gay Friendly, Convenient Location", "helpfulness": 4, "user": "Jerrytrip", "date": "December 2, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 11209461, "likes": {"liked": "— Location, reasonable price", "disliked": "— The sweet rolls could have been sweeter!"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled on business", "text": "Soft furnishings do show some sign of wear as the rugs did have stains, but were clean (yes, this is possible). The same problem with the bedspreads. I admit I would like to see the blankets double-sheeted, which I might do myself when I arrive next.", "title": "Joining the Chorus", "user": "NewYorkWrj", "date": "December 2, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 11200742, "likes": {"liked": "— The staff, the decor, and the location"}}, {"rating": 3.0, "stay_parameters": "Stayed November 2007, traveled on business", "text": "Staff was great and very helpful. Breakfast was continental with great pastrys, cereals, plenty of fresh fruit, etc. The coffee was outstanding (at least the decaf that I had). I am strictly a Starbuck's decaf Sumatra drinker, so saying their coffee was good is quite a compliment.", "title": "The Alexander Inn is nice but not great", "helpfulness": 1, "user": "AskingForHelp", "date": "November 16, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 3.0, "value": 4.0, "location": 3.0, "rooms": 3.0}, "id": 10855974, "likes": {"liked": "— Price, breakfast, and front desk staff", "disliked": "— Cleanliness could be improved; blankets are very thin"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "First visit to Philly, picked it off Tripavisor, great choice. We arrived from the airport on the R1, got off at Market East Station, and it was an easy 5 block walk down 12th St to the hotel. Its an imposing corner building which has been decorated in a tasteful way. The rooms are quite small but very cozy, the beds exceptionally comfortable. The only strange thing is the old 4:3 CRT TV which hung from a massive bracket on the ceiling, you had to lay on the bed to watch it! The complimentary breakfast was great, and really set you up for the day. The hotel is really close to the main sights and historic places to visit, all within easy walking distance. Don't bother coming in a car, parking I would imagine, would be a nightmare. There is a bar over the street called 'Tria' is very classy and a pleasant way to spend the evening with a few drinks. The hotel is in the 'Gayborhood' area of Philly, the hotel obviously attracts clientele both straight and gay, but my wife and I had no problems at all. The staff are very friendly and the olace is immaculate, a place we both would stop at again if we went back to Philly.", "title": "Great Hotel", "user": "forrestd", "date": "July 13, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 34640219}, {"rating": 1.0, "stay_parameters": "Stayed July 2009, traveled with friends", "text": "For an establishment that prides itself on its warm and attentive staff, I was highly disappointed. Their inflexibility in addressing my concerns completely soured my experience. The rooms were fine, (although I certainly wouldn't call them \"designer\" as advertised.) As a business owner myself, I know how important customer service is in maintaining relationships with clients. Apparently that is not valued at this establishment as demonstrated by their behavior towards me and my friend. Despite, the okay rooms and room rate, I will never stay there again and will not recommend this inn to friends, family or business associates.", "title": "Terrible Customer Service", "user": "TravelerHV_9", "date": "July 12, 2009", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "location": 3.0, "service": 1.0, "rooms": 2.0}, "id": 34543956}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled solo", "text": "I stayed here for 4 nights in June and really enjoyed it. Perfectly located for seeing the sights of Philadelphia. The hotel is clean and the staff are friendly. Just one word of warning though, I’d booked a ‘twin’ so expected 2 beds, but they told me a ‘twin’ was a single. I would stay there again.", "title": "Very Nice", "user": "strawfoot", "date": "June 23, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 3.0, "rooms": 3.0}, "id": 32951147}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "My husband & I stayed here for one night while we were in town to see a concert. We prefer to stay at small hotels rather than the big chains so I was quite happy to find this place. The staff were nice and they let us check in early. The room was a little small but comfortable enough. The continental breakfast was similar to any other place.", "title": "Would stay here agian!", "user": "kdenelle", "date": "June 16, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 32462265}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled on business", "text": "I would definitely stay here again, nice neighborhood and within walking distance to many many attractions.", "title": "Best Hotel for The Price.", "user": "Ca2C03", "date": "June 15, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 32358401}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "I stayed at the Alexander Inn recently with my wife and teenage daughter. We were made welcome from the moment we walked in the door by the friendly staff.", "title": "What's not to like!", "user": "Slowpainter", "date": "August 30, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 39193364}, {"rating": 5.0, "title": "Beautiful hotel", "text": "Centrally located with parking close by (very reasonable rate too for a city centre-certainly a lot cheaper than what we paid the week before in DC!) it was the perfect base for touring the city.", "user": "evertonian61", "date": "August 27, 2009", "id": 38988198}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "The room was smallish but VERY clean and well appointed, no wasted space but not claustrophobic. And what comfortable beds!", "title": "A wonderful place to stay and see the city.", "user": "StevenKeesling", "date": "August 6, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 36854278}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "I couldn't reccomend this hotel enough. We will definitely stay here again.", "title": "Alexander Inn - the Best!", "user": "DonNewYorkCity", "date": "August 3, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 36599840}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "We stayed 3 nights as part of a stopover on the way to Phoenix with US Airways and considered this a very good hotel, in a v.good area close to all the historical sites, with a very nice buffet breakfast. The rates were very reasonable. There is an excellent bar Tria across from the hotel for a latenight drink. The staff were very helpful and the place was spotless.", "title": "FABULOUS STAY.", "user": "dincat", "date": "July 21, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 35385566}, {"rating": 3.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "We stayed at the Alexander Inn for 2 nights on a stop-over in Philapdelphia and whilst we had no complaints about the hotel, the staff were friendly, the breakfast was good and the room clean, if a bit noisy at night, we would advise caution if booking with Hotels.com.", "title": "Good hotel but beware when booking with Hotels.com", "helpfulness": 2, "user": "fazed", "date": "September 27, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 3.0, "service": 4.0, "rooms": 3.0}, "id": 44955385}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "We booked with them at a rate of $125 plus charges and taxes per room per night but on arrival we were given an invoice showing $139 plus charges and taxes per night. We queried this with the receptionist and were told that they do not honour prices quoted by third party booking agents (although they obviously accepted our booking through Hotels.com). The hotel would not budge on their rates and to date we have not received a satisfactory reply to our e-mails to Hotels.com.", "title": "Centrally located and good service", "user": "Prema_C", "date": "September 17, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 42370217}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled on business", "text": "We stayed in this hotel in August 2009. The hotel is conveniently located in downtown Philly and the historic district is within walking distance. The check in process was smooth and the staff at the front desk was helpful. The room was well maintained and the baths were clean. The overall ambience was good.", "title": "Ideal for my needs", "user": "jimsky", "date": "September 7, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 40004439}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled with family", "text": "The best part was the way the staff went out of the way to arrange an early breakfast for us since we were checking out early.", "title": "Good but...", "user": "Sojourn3", "date": "September 4, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 39797786}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "A good experience all in all and we would surely like to stay there again the next time we are in Philly.", "title": "Everything people say and more!", "user": "lesky", "date": "September 1, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 39451576}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled solo", "text": "Being alone in Philadelphia I wanted both a place i felt safe in as well as that was convenient to some of the sites. I chose this hotel entirely based on the Trip Advisor reviews and responses to questions when i called the hotel. I was pleasantly surprised on all counts. I arrived nearly three hours before check in. I had reserved the smallest of rooms for one person. However the helpful man at the desk put me in a deluxe queen room, on the sixth floor, at the edge of the hall with a great view of the City. Total cost of the room being a AAA member was $ 122.00 including tax. Extremely reasonable for downtown Philly I thought.", "title": "As Good As the Reviews", "helpfulness": 1, "user": "DCSacramento", "date": "October 1, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 45615895}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "The room was older and not particularly fancy in furnishings. However it was impeccably clean and larger than the square footage advertised on the web site. The bed was also comfortable and I slept very well. There was very little background noise from the street. The breakfast was good with a selection of fresh fruits, including fresh grapefruit and a few breads and rolls. Upon checking out the front desk provided me with detailed instructions how to take Amtrak to the Philly airport.", "title": "our over nite get away for fun and relaxation", "user": "twodaddies", "date": "October 1, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 45558377}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "we live in harrisburg pa. and enjoy taking over nite retreats at the alexander inn the parking garage is a nice leisurely walk from the inn. the front desk hosts make you feel welcomed and very happy to answer questions about whats going on and where to eat. the rooms are great, breakfast is more than enough to start the day. we esp. like the fact that we are in the middle of the nite life that we have come to enjoy!!", "title": "A real gem", "user": "jonny57", "date": "September 30, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 45529905}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "The Alexander Inn has it all, great location, great price and above all excellent customer service where staff make you feel welcome. This was our second visit in 2 years.", "title": "A \"must stay\" hotel!", "helpfulness": 1, "user": "djgolias", "date": "September 30, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 45487106}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "I didn't know I had friends in Philadelphia until we stayed at the Alexander Inn! While the rooms are well appointed, comfortable and definitely a beautiful break from the \"big box\" hotels, the staff makes the stay all the worthwhile. They are friendly, willing to help with guidance on getting around, and just plain fun. Without a doubt, I will be staying at the Alexander Inn again the next chance I get!", "title": "Friendly Staff, Clean and Safe, Recently Remodeled", "user": "rosedrr", "date": "September 27, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 45042420}, {"rating": 4.0, "stay_parameters": "Stayed April 2008", "text": "Took my mom for a one night stay. Friendly and accomodating staff. Nice spread for breakfast in the morning. (toast, danishes, bagels, fresh fruit, cereal, yogurt) Clean rooms. Rooms could be considered small by American standards, didn't bother us since we didn't spend much time in the room. Great Location. Plenty of places to eat nearby. Right around the corner from Antiques Row and only a few blocks from historic sites. Would definitely recommend and go again.", "title": "Very Convenient.", "helpfulness": 1, "user": "misstina26", "date": "April 2, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 5.0}, "id": 14754544, "likes": {"liked": "— Location, Staff", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "We were looking for a not too expensive place from which to experience some of the wonderful restaurants and sites that Philadelphia has to offer...in particular the Frida Kahlo exhibit at the Philadelphia Museum of Art. All the hotels recommended for the trip down from NYC were too expensive! Always an adventure with Tripadvisor, but were not disappointed. Everything in the other reviews is true! We got the cheapest queen, and although not large, extremely commodious. Wonderful spot!", "title": "Great spot!", "helpfulness": 1, "user": "patrobnyc", "date": "April 1, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 14701616, "likes": {"liked": "— expedient, friendly staff", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "This place is all it's cracked up to be. It's a charmingly decorated historic building in a beautiful downtown residential neighborhood just a few blocks from major cultural and civic attractions. The staff are extraordinarily friendly, helpful, and knowledgeable, and take meticulous care of the property; they all seem to enjoy running such a fine place. Our king-bed room had bay windows with a great view of the Philadelphia skyline - and all the windows (including the bathroom window) actually opened! Some other things we really appreciated: (1) We arrived rather early in the day. They watched our luggage while we went around town, and then let us check in early so we could be ready for a matinee concert at the Kimmel Center. (2) There are two free internet computers in the basement fitness room. (Don't you hate paying for internet access?) (3) There's a vending machine with cold Poland Spring water for $1 a bottle - not as good as free, but a lot better than the usual warm bottle for which you're charged $5 or more. All in all, an extraordinary experience and an excellent value. If they'd add hard boiled eggs to the breakfast buffet they'd be perfect.", "title": "Deserving of all the glowing reviews", "helpfulness": 2, "user": "museumgoer", "date": "March 30, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 14669689}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled on business", "text": "My apartment in the city is not big enough for myself and two of my friends, so I heard about the Alexander Inn and booked 2 rooms.They have great rates. We were greated by a terrific staff and the general manager John who made us feel right at home. He gave us lots of good suggestions on where and what to do in the area of the hotel which is very hip. Our rooms were both comfortable and stylish we overlooked spruce street which was fun to people watch. In the morning there is a great breakfast and we had good conversations with the staff and other guests. I definately reccomend this hotel.", "title": "What A Score Hotel", "helpfulness": 1, "user": "Joyboy519", "date": "March 27, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 14584134, "likes": {"liked": "— The Manager the room and the breakfast", "disliked": "— having to leave"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "Great location in Center City Philly. Off street self-parking deck for $10 per night only a 3 minute walk away. Restaurants are plentiful within walking distance.", "title": "Good price-Great location", "helpfulness": 4, "user": "tjm911", "date": "March 25, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 14541389, "likes": {"liked": "— Location and parking"}}], "location": {"country": "United States", "city": "Philadelphia"}, "variance": {"poor": 20, "average": 59, "very good": 255, "terrible": 22, "excellent": 496}, "aka": "Alexander Hotel Philadelphia", "slim_ranking": 0.119047619048, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.0, "location": 4.5}, "description": "A charming boutique hotel with 48 designer rooms, private baths, Hi speed wireless internet, in-room safes, DirecTV with 8 complimentary movie channels, great artwork, breakfast buffet, fitness center, historic tours from our door, discounted indoor parking nearby, a friendly staff and reasonable and consistent rates from $119."}