{"user_rating": 3.0, "review_count": 574, "name": "Alexis Park Resort", "reviews": [{"rating": 3.0, "title": "Don't know what all the bad press is about.....", "text": "I stayed at this location in June with some trepidation, based on the reviews I had read.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "July 6, 2006", "id": 5432578}, {"rating": 2.0, "stay_parameters": "Stayed April 2006", "text": "To my surprise I found not one, but three pools available for swimming. There appeared to be managment interest in improving the property, as we noticed workmen on-site both days.", "title": "Ok for the money - but not the greatest option", "helpfulness": 6, "user": "PoetinLeather", "date": "July 6, 2006", "detail_rating": {"cleanliness": 2.0, "value": 3.0, "rooms": 2.0, "service": 4.0}, "id": 5431240}, {"rating": 2.0, "stay_parameters": "Stayed April 2006", "text": "My room was clean, and large. The bed and bedding were comfortable, and the air conditioning worked well - thank goodness - it was well over 100 degrees both days!", "title": "Tired, Dirty & Broken ... those are the good points", "helpfulness": 12, "user": "Bingo47", "date": "June 8, 2006", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "rooms": 2.0, "service": 3.0}, "id": 5323900}, {"rating": 2.0, "title": "Barely tolerable!", "text": "I will definitely stay at the Alexis Park on my next visit to Las Vegas.", "helpfulness": 6, "user": "2infinity", "date": "June 5, 2006", "id": 5313155}, {"rating": 1.0, "stay_parameters": "Stayed May 2006, traveled on business", "text": "I stayed at the Alexis in April (2006) for a convention of cigar smokers - probably not their run-of-the-mill convention they hold there.", "title": "Overall Dirty Feeling", "helpfulness": 11, "user": "McMullen8", "date": "May 27, 2006", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "service": 2.0}, "id": 5224047}, {"rating": 2.0, "stay_parameters": "Stayed April 2006", "text": "I got lucky to get into this \"resort\" via Priceline. I didn't expect much but wasn't ready for dirty rooms. My co-workers got regular rooms and from what I can tell they were horrid. I was lucky to get upgraded to a \"suite\" with a fireplace, jacuzzi and other perks. LOL... That Jacuzzi was scary! :)", "title": "\"I got what I paid for!\"", "helpfulness": 6, "user": "shourick", "date": "April 29, 2006", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "service": 2.0}, "id": 5017652}, {"rating": 2.0, "title": "Nothing wrong that a wrecking ball won't fix", "text": "Happy travels!", "helpfulness": 3, "user": "A TripAdvisor user", "date": "April 28, 2006", "id": 5016953}, {"rating": 1.0, "title": "Horrible Place Better To Sleep In A Tent", "text": "The upside is you get a 2-room \"suite\" with a bar area including fridge and sink. The downside is everything else. The place borders an airport runway and has fallen into disrepair. Although things worked in my room everything was worn to the point of it being impossible to get clean. It's a sprawling \"motor lodge\" style campus with hundreds of rooms and three pools. All of it looks worn out. Basically they should bulldoze it. The only people I would recommend this to are people who don't mind the above issues and who are on an extreme budget and get a room really cheap (like 50 bucks) and like the two-room feature. It's all pretty lame.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "April 25, 2006", "id": 5007098}, {"rating": 2.0, "title": "Cute place, scary area.", "text": "This is a horrible place. The staff are terrible, lazy and unfriendly people. The rooms are moldy, dirty. They do not clean the rooms or refresh the toiletries. The toilet paper is more like sand paper. Air conditioning does not work. Fireplace does not work. The food is terrible. We will never return to this horrible place.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "April 24, 2006", "id": 5005488}, {"rating": 1.0, "stay_parameters": "Stayed March 2006", "text": "This was the only hotel near the strip that was not booked, and the only reason I chose Alexis Park.", "title": "If you don't want to shower, drink coffee or eat breakfast", "helpfulness": 7, "user": "CopperPenny2", "date": "April 2, 2006", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "service": 1.0}, "id": 4829261}, {"rating": 1.0, "stay_parameters": "Stayed July 2006", "text": "I can' t believe this place can stay in business. Dirty, bad service, things falling apart,,,,", "title": "Stay Away!", "helpfulness": 6, "user": "MelyssaGuerry", "date": "July 13, 2006", "detail_rating": {"cleanliness": 1.0, "value": 2.0, "rooms": 1.0, "service": 1.0}, "id": 5462473}, {"rating": 3.0, "title": "Making Improvements", "text": "I've stayed at the Alexis Park three times in the past year in preperation for an upcoming conference. Over that time I have seen quite a lot of improvement by the new management. The pool and grounds have always been nice. They have a top notch gym - better than most hotel and rarely used. The Lobby/regisrtation area was being renovated during my last trip and is going to be nice. The rooms and exterior painting are still being worked, but you can see the improvmenet from month-to-month.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "July 13, 2006", "id": 5461694}, {"rating": 3.0, "title": "Good deal in Las Vegas", "text": "the bottom line is this hotel is not a $300/night hotel and you are not going to get that type of service/ or accomodations. What it is going to be is a clean, respectable hotle at a very reasonable rate close to the strip.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "July 6, 2006", "id": 5433707}, {"rating": 2.0, "stay_parameters": "Stayed May 2007, traveled on business", "text": "The room design is very nice, an actual suite with a living area with kitchenette separate from the sleeping area. The staff was always helpful and polite. Really the place is very cheaply and poorly maintained. Fake rock abound all over the nicely conceived grounds. The coffee maker was ridiculous. I went to a nearby CVS and bought one so we could have coffee in the am. Our room needed many small repairs and touch ups. The hallways did not appear to be lit.", "title": "Wouldn't Stay there again", "helpfulness": 2, "user": "archana", "date": "May 7, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 2.0, "value": 2.0, "rooms": 2.0, "location": 3.0}, "id": 7556245, "likes": {"liked": "— Room layout", "disliked": "— Maintenance"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "I thought it was a great room. A queen suite (I thought we were in a queen, not a double bed) with a fridge and an odd coffee machine (filter basket is in coffee filter bag, one cup per brew). No way could we have gotten such a nice room, with room services prices at less than most restaurants on the strip, on the strip at $89/night when NAB was in town.", "title": "Great hotel, location too inconvenient", "helpfulness": 3, "user": "ginml", "date": "April 24, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 1.0, "rooms": 5.0}, "id": 7429504, "likes": {"liked": "— A great room at a great price", "disliked": "— Too inconvenient to bus system and the strip"}}, {"rating": 3.0, "stay_parameters": "Stayed April 2007, traveled on business", "text": "However, at that location you are probably best depending upon the bus system or cabs to get around. You can walk to the strip, but who wants to walk nearly a mile to the strip dying of thirst and hungry as anything, before spending five hours walking and sightseeing on the strip? Additionally, if you take the bus ($5 for 24-hr pass), the stops aren't as convenient to this hotel as to other off-strip hotels. I had to walk about two blocks to catch the bus to the convention center and the bus to the strip is a block or two as well. In the end, we may have spent what money we saved by staying off the strip on cab fare to get around. You could possibly just have fun enjoying Hard Rock across the street and I understand Hofbraus (just a short block down) has excellent food as well. In the end, although we loved the room and the great room service prices, the place was simply too inconvenient a location.", "title": "A little sketchy, but great for the price", "helpfulness": 4, "user": "photomikey", "date": "April 18, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 3.0, "location": 2.0, "rooms": 2.0}, "id": 7383200, "likes": {"liked": "— Price, Value, Big Rooms!", "disliked": "— Distance from strip, worn appearance"}}, {"rating": 1.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "I was a bit nervous, reading the negative reviews, but the place really wasn't all bad. I was off to a convention in Vegas, and everywhere was booked. I was unable to find anything on the strip < $500, so I turned to priceline and it's 3* properties, and got the Alexis park.", "title": "Horrible service...", "helpfulness": 4, "user": "VGSLVR1", "date": "April 8, 2007", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "location": 3.0, "rooms": 1.0}, "id": 7293144}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "The exterior of the hotel is in good shape -- three pools, nothing extravagant, but nice. The buildings have been re-painted with a faux-finish look, and it's nice, if not a tad cheesy.", "title": "No hassles, minutes to the strip, clean!", "helpfulness": 5, "user": "squidgirlie", "date": "April 2, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 7268508, "likes": {"liked": "— value, cleanliness, easy stay", "disliked": "— not right on the strip"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled with friends", "text": "Went with 6 other people. VERY nice for the price. Suite with 2 beds, bathroom accessible from bedroom or living room. Sofa couch and love seat. Mini-fridge to keep the alcohol cold. RIGHT across the street from the Hard Rock. Can't beat this deal for the price. Would HIGHLY recommend for college students or anyone on a tight budget. You will not regret it.", "title": "Excellent stay. Cheap. Right across from Hard Rock!", "helpfulness": 1, "user": "leo2302", "date": "June 19, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 5.0, "rooms": 5.0, "location": 2.0}, "id": 7939040, "likes": {"liked": "— Price! If you party at the Hard Rock, it's the place to stay", "disliked": "— Not walking distance to strip. But if you party at the Hard Rock, no brainer"}}, {"rating": 3.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "After reading all these bad comments we expected the worst but it turned out to be rather nice. We liked the courtyard with the pool area (reading free newspaper). The 2-room-suite was spacious, the carpets and furniture a bit worn (did not want to walk w/o shoes on).", "title": "Much better than expected", "helpfulness": 2, "user": "elro12", "date": "June 16, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 3.0, "rooms": 3.0}, "id": 7856487, "likes": {"liked": "— courtyard with pool area", "disliked": "— worn furniture"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled with friends", "text": "While we stayed there (building 18) it was quiet and we had no problem to sleep at odd hours due to jet-lag. The location was perfect for us but if you want to spend most of your time on the Strip you are better off there. Conclusion: if I had to, I would not mind to stay there again. Tip: try to stay on the right hand side, not too far in the back because of the contruction site there and traffic noise on the left.", "title": "Nice stay", "helpfulness": 2, "user": "gregcs", "date": "June 4, 2007", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 5.0, "location": 3.0, "rooms": 5.0}, "id": 7755198, "likes": {"liked": "— Great room size"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled on business", "text": "Had been 12 years since my last stay at the Alexis and some recent reviews made me nervous. No need to worry, room was very large and clean at a price that can't be beat right off the strip. Would definately go back with family.", "title": "Fantastic Stay!", "helpfulness": 2, "user": "Jonesy2007", "date": "May 16, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7630750, "likes": {"liked": "— The rooms were super clean and the bed very comfortable; clean, fluffy towels and soap", "disliked": "— The television service needs improvement; but I didn't go to Vegas to watch TV"}}, {"rating": 2.0, "stay_parameters": "Stayed April 2007, traveled with family", "text": "I stayed at the Alexis Park for 5 days for Darinfest 07. I just got home yesterday. It was a perfect stay. Clean room, comfortable beds, great service from everyone connected with Alexis Park. Security all over the place. I felt absolutely safe at all times. The food is excellent and very affordable. I cannot understand the negative reviews. Don't hesitate to book the Alexis Park! Beautiful pool and beautiful grounds. It was a great plus to me not to have a casino on premises. Although the airport was close, I was never bothered by the sound of planes overhead. I would definitely stay there again and highly recommend it.", "title": "Two stays, differing experiences", "helpfulness": 4, "user": "rbmm", "date": "May 14, 2007", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 3.0, "cleanliness": 2.0, "value": 2.0, "location": 1.0, "rooms": 1.0}, "id": 7616689}, {"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled on business", "text": "I just returned from a 4 night stay at this property. I was nervous after reading reviews here, but had a very positive experience. I was attending a conference in the hotel. This is an older resort with many 2 story buildings built around a center garden with pathways and 3 pools. It is a popular spot for garden weddings - they have several small weddings per evening on weekends.", "title": "A work in progress", "helpfulness": 6, "user": "M4", "date": "October 21, 2006", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 3.0, "rooms": 3.0}, "id": 5981538}, {"rating": 1.0, "stay_parameters": "Stayed September 2006, traveled on business", "text": "The resort is in process of being updated. My room in one of the building near the front of the resort had been redone. ( buildings 11-19 have been redone) It was a spacious room with comfortable double bed, a wetbar, with fridge, microwave and coffemaker and sitting area with sofa and club chair. The bath was large with an oval tub and lots of good towels.", "title": "Dangerous break-in", "helpfulness": 18, "user": "LisaLee2", "date": "October 17, 2006", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 1.0, "cleanliness": 3.0, "value": 1.0, "location": 1.0, "rooms": 1.0}, "id": 5964733}, {"rating": 4.0, "title": "Much better than I expected", "text": "The hotel offers free parking and is only about 1/2 mile walk to the strip. The resort does not offer a casino which was a plus. Hard Rock Casino is directly across the street, and there are shops and food a block away.", "helpfulness": 5, "user": "hempmark", "date": "September 26, 2006", "id": 5880854}, {"rating": 3.0, "stay_parameters": "Stayed September 2006, traveled on business", "text": "The staff were all very helpful and friendly. I would stay here again in one of the refurbished rooms. It is a good value.", "title": "Better than expected", "helpfulness": 1, "user": "The_Mystic", "date": "September 25, 2006", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 2.0, "cleanliness": 3.0, "value": 3.0, "location": 2.0, "rooms": 3.0}, "id": 5834391}, {"rating": 1.0, "stay_parameters": "Stayed July 2006", "text": "Alexis Park Resort and Spa turned out to be a dangerous place. We woke up to an intruder the first morning. She had broken in the bathroom window. We were so lucky that she was unarmed she knocked the towel rack down and woke us up - very scary situation. The general manager laughed when we asked for compensation on the room cost because of this terrifying experience - he actually did this. We did fill out a police report - this was October 2006. Don't stay here!", "title": "Dark and scary", "helpfulness": 5, "user": "dhk923", "date": "July 18, 2006", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "rooms": 2.0, "service": 1.0}, "id": 5480884}, {"rating": 1.0, "title": "Mice!", "text": "Pros of Alexis -- hot water, clean bed/bedding and pretty close proximity to center strip (25 min. walk in a pretty safe but not all sidewalked area), quiet pool area to sun ourselves each AM", "helpfulness": 5, "user": "A TripAdvisor user", "date": "May 15, 2006", "id": 5077374}, {"rating": 1.0, "title": "Would not stay here again.", "text": "Cons -- musty smelling room, very worn furniture (some to the point of being dangerous), no shuttle to Strip, main pool was closed (they said because of no lifeguard)", "helpfulness": 5, "user": "A TripAdvisor user", "date": "May 10, 2006", "id": 5047809}, {"rating": 3.0, "stay_parameters": "Stayed September 2007, traveled on business", "text": "It's not the Bellagio, but the suites are very large, tastefully decorated, and comfortable.", "title": "Good suite property", "user": "Snarky", "date": "October 3, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 10035450}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "The room has a small fridge and wet bar, two TV's (one in the bedroom and one in the living room, a couch, coffee table, and love seat. There is a desk with a high speed internet connection.", "title": "Great property", "helpfulness": 1, "user": "Arizona010", "date": "September 10, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 8690889, "likes": {"liked": "— size of rooms"}}, {"rating": 2.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "Rooms were clean and looked to have been recently refurbished. This property is at least 25 years old, but they've kept it in good shape.", "title": "Warning: long lines and overbooking", "helpfulness": 4, "user": "swimfish", "date": "September 5, 2007", "detail_rating": {"cleanliness": 4.0, "front_desk": 1.0, "location": 2.0, "value": 4.0, "rooms": 4.0}, "id": 8660346, "likes": {"liked": "— the bed!", "disliked": "— ridiculous lines and the property knowingly overbooks significantly"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2007", "text": "The restaurant is good, but a bit expensive for what it is.", "title": "Great property!", "helpfulness": 1, "user": "swmvgirl", "date": "August 24, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 3.0, "rooms": 4.0}, "id": 8497721}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled on business", "text": "If you have a car, you can park fairly close to the room. If not, cabs are out front frequently. The proximity to the Hard Rock helps.", "title": "Great for the price!!", "helpfulness": 2, "user": "Dreamgirl246", "date": "August 6, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 8362302}, {"rating": 4.0, "title": "Great hotel", "text": "After reading all the negative things on this site we were a little skeptical to c/in to Alexis when me and my husband arrived the Bell staff was great and the front desk staff was awesome we asked them why there was so many negative things written about hotel they responded with please don't listen to everything you hear. We went to are room it was the super suite and wow it was amazing kinda like when we went on our honeymoon in Hawii. My entire stay went beyond what I was exspecting besides the hskpn not getting to my room one out of the three days I was there. I would definitly recommend the Alexis.", "helpfulness": 4, "user": "desertgrl", "date": "July 28, 2007", "id": 8247153}, {"rating": 1.0, "stay_parameters": "Stayed July 2007", "text": "Stayed with my family of three for a week long dance convention. The hotel lost most of our groups reservations ( over 35 families)made over six months ago. Poor front desk and management. Hotel is understaff in all areas. The Bell service team was by far the best part of the hotel.. They should probably be running the place. Horrible housekeeping staff. No one spoke english and many things missing from our rooms and our group.. Wow,.. No safes available for valuables--ouch.....", "title": "Management need help.....", "helpfulness": 2, "user": "josephtravel", "date": "July 24, 2007", "detail_rating": {"front_desk": 1.0, "business": 2.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "location": 1.0, "rooms": 1.0}, "id": 8230584, "likes": {"liked": "— Bell Service Staff- joseph was great and all others", "disliked": "— everything"}}, {"rating": 2.0, "stay_parameters": "Stayed July 2007, traveled on business", "text": "My daughter was in Las Vegas for a ballet class at UNLV.", "title": "Not what they advertise", "helpfulness": 2, "user": "toocoolfornc", "date": "July 23, 2007", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 2.0, "cleanliness": 3.0, "value": 2.0, "location": 3.0, "rooms": 2.0}, "id": 8221472, "likes": {"liked": "— Good size suite.", "disliked": "— All the things that were broken or did not work."}}, {"rating": 1.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "The group that put on the dance class had arranged a special rate with this hotel. There were two adults and two teenagers in the suite. The suite, however, did not exactly match the pictures on their web site. Good things: Rooms were clean. Good location, near UNLV(non-gaming hotel). The beds were nice, the two rooms were good size and there was a small kitchen area with a frig. Prices for food and drinks and room service were resonable. Bad things: TV did not work. NO internet access at all( their web site claims to have high speed internet). Microwave oven, which was scheduled in advance, was not in the room. Frig door was broken. Maid service was hit and miss. Never had enough towels or toilet paper( called the front desk for TP, but it never came. Had to go down to the lobby and get some from the mens room) Pools out of order. Rooms had a run down look, nothing like the pictures on their web site.", "title": "Oh why did we NOT listen", "helpfulness": 9, "user": "dynamodoyles", "date": "July 20, 2007", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "location": 4.0, "rooms": 2.0}, "id": 8203087, "likes": {"liked": "— Grounds are well kept", "disliked": "— Everything else from service to price"}}, {"rating": 1.0, "stay_parameters": "Stayed July 2007", "text": "If I was going back to Las Vegas I would spend my money at one of the nicer hotels on the strip.", "title": "In a word: nightmare!", "helpfulness": 6, "user": "LovetotravelUtah", "date": "July 6, 2007", "detail_rating": {"front_desk": 2.0, "business": 1.0, "service": 2.0, "cleanliness": 2.0, "value": 1.0, "location": 2.0, "rooms": 1.0}, "id": 8065672}, {"rating": 1.0, "stay_parameters": "Stayed March 2006", "text": "The good thing about the hotel is that the rooms were much nicer than we had expected. We had a very large room for $99.00 a night for three nights. It had a whirlpool tub and shower. As non smokers we were happy that there was not a smokey casino to walk through to get to the front desk.", "title": "What a dreadful stay!!!", "helpfulness": 8, "user": "wales86", "date": "March 20, 2006", "detail_rating": {"cleanliness": 1.0, "value": 3.0, "rooms": 2.0, "service": 1.0}, "id": 4715577}, {"rating": 4.0, "stay_parameters": "Stayed March 2006", "text": "We are not gamblers, so the hotel was fine for us. All we really needed was a comfortable clean bed and that is what we got.", "title": "Don't panic!!! It's going to be OK", "helpfulness": 11, "user": "badbonez", "date": "March 15, 2006", "detail_rating": {"cleanliness": 4.0, "rooms": 4.0, "value": 4.0}, "id": 4624248}, {"rating": 4.0, "stay_parameters": "Stayed March 2006", "text": "Because of the location of the hotel, I will never stay there again or suggest it to anyone to stay there.", "title": "Is everyone used to staying at the Four Seasons?", "helpfulness": 15, "user": "Tahmay", "date": "March 5, 2006", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "rooms": 4.0, "service": 3.0}, "id": 4584002}], "location": {"country": "United States", "city": "Las Vegas"}, "stars": 3, "variance": {"poor": 91, "average": 99, "very good": 158, "terrible": 102, "excellent": 124}, "aka": "Alexis Park Hotel Las Vegas", "slim_ranking": 0.496296296296, "description": "Resort setting with greenery, waterfalls and streams - Mediterranean style architecture - 2 blocks from Strip."}