{"user_rating": 3.5, "review_count": 62, "name": "Alexa Hotel", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed March 2005", "text": "We just got back from a long weekend in NOLA and stayed at the ALexa. This hotel is really the bare bones sister of the adjoining hotel, the Astor. WHen we arrived, Wednesday evening, there were 2 clerks at the desk discussing their dinner orders. They were pleasant, but spent more time talking to each other than taking care of our checking in. There was no bellhop to speak of, but we didn't have a problem with that. Our room was on the 4th fl. facing Canal St. It was on the dark side, but I don't think as dark as those facing the inner courtyard. The room was a decent size (we had 2 queen beds for a family of 4). There were definitely signs of wear and tear, but there was also an attempt at charm and it was clean. Overall it was nicer than a Holiday Inn, but not as nice as a Marriott.", "title": "It served the purpose. Liked the location.", "helpfulness": 1, "user": "mfnyc", "date": "March 28, 2005", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "service": 2.0}, "id": 3307245}, {"rating": 2.0, "title": "March Visit to Aleax", "text": "We did have a problem with the TV remote and one of the phones. We also requested extra pillows. They did respond rather quickly to these situations. There was one day when I put out the 'Maid Service Please' sign when we left in the morning, when we returned at 3:30, the room still wasn't cleaned. We called and also told the front desk as we went out again. They finally did come and clean at that point.", "helpfulness": 1, "user": "Bexleyboy", "date": "March 24, 2005", "id": 3298349}, {"rating": 1.0, "stay_parameters": "Stayed November 2004", "text": "The location can't be beat, and it was quiet at night. The Bourbon House restaurant, located in the adjoining Astor hotel was very nice for dinner, but a disappointment for breakfast (walk the 2 blocks to the Marriott for a great breakfast buffet).", "title": "yuck - disappointing in all ways", "helpfulness": 2, "user": "FreethinkingOne", "date": "March 20, 2005", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "rooms": 1.0, "service": 1.0}, "id": 3288629}, {"rating": 3.0, "title": "Good size room but dark", "text": "We had no problem getting a late checkout (actually not all that late, 1pm, but better than 11), they also arranged for a taxi back to the airport, and held our luggage for a few hours after we did check out.", "helpfulness": 2, "user": "TL59", "date": "March 2, 2005", "id": 3240587}, {"rating": 5.0, "stay_parameters": "Stayed February 2005", "text": "We didn't have a problem with dark scarey corridors when we came and went through the Astor lobby.", "title": "Everything First Class", "helpfulness": 5, "user": "BillsMaryland", "date": "February 11, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3179239}], "location": {"country": "United States", "city": "New Orleans"}, "variance": {"poor": 4, "average": 7, "very good": 25, "terrible": 9, "excellent": 17}, "aka": "Alexa Hotel New Orleans", "slim_ranking": 0.82}