{"user_rating": 4.5, "review_count": 647, "name": "Alexandra Resort", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "My husband and I returned from Turks and Caicos Alexandra resort this past Saturday. Here are my thoughts:", "title": "Alexandra is an adequate property if you don't like to be pampered", "helpfulness": 7, "user": "gucci913", "date": "May 26, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 2.0, "value": 3.0, "location": 5.0, "rooms": 4.0}, "id": 16418169, "likes": {"liked": "— the location and beach", "disliked": "— the lack of service amenities"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "The check in: Don't expect a sexy open air lobby, rather a front desk in the front on a unpaved lot of land near some trailers due to construction. The staff was welcoming and warm. They give out rum punch and the check in was smooth as can be. The front desk is the conceirge and the do all. Dave and Emily are wonderful. They all are really but I do not recall their names.", "title": "Great value - BEAUTIFUL beach!!", "helpfulness": 7, "user": "Winegirl921", "date": "May 11, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 15933923, "likes": {"liked": "— Great value", "disliked": "— Lack of night life"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled with family", "text": "We stayed in a deluxe ocean view studio room in the Prima Donna Building. And I was very pleased with the room itself. It's updated with an understated luxury, queen with pillow top mattress, kitchen with granite counters, shower stand only with no tub but perfectly fine, and a small kitcen area with full size microwave, small fridge and sink area, again granite with stainless steel appliances. Housekeeping was not up to par, they did make bed each evening and provide clean towels but NEVER mopped the floors and did not notice until the last day that there was a energy saving card (on top of TV) that was supposed to be left on the bed upon arrival stating that if we wanted our sheets changed to leave it on the bed...no wonder I felt sand!", "title": "Most Beautiful Beach Ever!", "helpfulness": 3, "user": "BeachKids1", "date": "May 11, 2008", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 3.0, "cleanliness": 3.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 15924098, "likes": {"liked": "— We had an oceanfront room. Makes all the difference.", "disliked": "— towels were scrawny. But I got over it."}}, {"rating": 2.0, "stay_parameters": "Stayed April 2008, traveled with family", "text": "The pool area was nice and neat altough not lavish. But with an ocean like Grace Bay who needs a pool right? There was a towel stand although mostly unattended and at one time a sleeping worker it seemed to work out fine until the last day when they ran out of towels which seemed odd given the hotel was 20% occupied due to slow season.", "title": "Hmmm...Its all relative!", "helpfulness": 5, "user": "toypoodle", "date": "April 30, 2008", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 2.0, "cleanliness": 2.0, "value": 2.0, "location": 2.0, "rooms": 2.0}, "id": 15517019, "likes": {"liked": "— Great beach", "disliked": "— Cleanliness"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled with family", "text": "Check out was at 11:00am, and with a 4:00pm flight I had asked for a late check out, they stated the room was going to be used (again odd given capacity) but offered to stow luggage at front desk and we could shower in an unused old office which used to be a hotel room. It was a room located in the Chelsea building, one bedroom not studio. The room itself was okay, older than the building we were in with white appliances, full tub in bathroom. The room was not cleaned at all, no towels and likely to have been used by staff during breaks. It was nice they accomodated us but they should have cleaned it or sent us else where.", "title": "Fantastic Resort", "helpfulness": 9, "user": "jdbernal", "date": "April 27, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 15408291, "likes": {"liked": "— Location and Staff", "disliked": "— Our studio suite had an adjoining door to another room, so you could hear everything and likewise."}}, {"rating": 4.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "We just got back from four days at the Alexandria. We stayed in the Superior Ocean View Studio. We had a great time and really liked the place. I would recommend it to friends. The beach and water is amazing. Really amazing. I wish they had some snorkeling gear or hobie-cats to rent or something but they just have this guy on the beach who sells half-day and full-day excursions. Pretty limited.", "title": "Great Place & Value", "helpfulness": 3, "user": "eternalX", "date": "February 13, 2008", "detail_rating": {"front_desk": 3.0, "service": 2.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 13512707, "likes": {"liked": "— Beach", "disliked": "— Restaurant"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "I would think about booking the deluxe if I went back just because I *think* it comes with a stove and not just a microwave. It's hard to tell from online and asking the front desk didn't provide too many answers. Welcome to the islands...", "title": "Relaxing honeymoon!", "helpfulness": 7, "user": "BurlingtonHockeywife", "date": "January 22, 2008", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 12895039, "likes": {"liked": "— Clean rooms & well kept hotel grounds, beautiful beach", "disliked": "— Wireless internet connection rarely worked, no hot tub, & pool was cold"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled with family", "text": "We bought food and ate all breakfasts in our room. Lunch we ate at the hotel restaurant one day and out the others. Dinner once at the restaurant.", "title": "Reasonably priced, and nice amenities", "helpfulness": 7, "user": "ropster", "date": "January 22, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 12885145, "likes": {"liked": "— Location and reasonable price"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled solo", "text": "Pros: Beach, decent place for lunch, nice enough pool (nothing special), nice, modern rooms with tv/satellite, microwave, toaster, mini-fridge, many kitchen utensils, coffee maker (but no included coffee :(), beach, beach, beach. Nice, friendly bartender", "title": "Turks and Caicos", "helpfulness": 8, "user": "isys18", "date": "January 17, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 12713218, "likes": {"liked": "— The Location", "disliked": "— Most of the bar food is fried."}}, {"rating": 3.0, "title": "Alexandra is Getting There but not Quite Prime Time", "text": "Cons: No stove in our room, restaurant is pretty mediocre, as with almost every other place in the Turks, service is pretty pathetic/", "helpfulness": 6, "user": "lynnr11", "date": "December 31, 2007", "id": 12159892}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled solo", "text": "Summary and Background:", "title": "Great stay at the Alexandra", "helpfulness": 8, "user": "Beachdreams2", "date": "December 16, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 11594276, "likes": {"liked": "— New, contemporary style rooms; great beach; not crowded; wifi availability", "disliked": "— Fitness center was closed; no hot tub"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "I stayed at the Alexandra in a studio oceanview unit in the Prima Donna building in early December. I posted a complete trip report on the Providenciales forum titled “Trip report - second trip to Provo Dec 6 – 13”, so I am going to restrict the content here to the Alexandra. I am female and traveled solo, and this is my second trip to Provo (my first trip was earlier this year, and I stayed at the Royal West Indies then).", "title": "surrounded by nature with the comforts of home", "helpfulness": 11, "user": "camgrigsby", "date": "December 13, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 11530612, "likes": {"liked": "— wonderful location", "disliked": "— the price of drinks"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "Overall, I had a good experience at the Alexandra and would not hesitate to stay there again.", "title": "We will be back in August of 2008", "helpfulness": 2, "user": "mmshaw07", "date": "December 7, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 11318543, "likes": {"liked": "— The View", "disliked": "— Liked everything"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "Check-in, Check-out, and Staff:", "title": "Great Place, Best Beach, Best Value", "helpfulness": 2, "user": "ogur728", "date": "December 5, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 11271749, "likes": {"liked": "— The Beach", "disliked": "— Average Service"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "The check-in and check-out process was good (no lines for either), and I had good experiences with the staff. One thing that is different about the Alexandra compared to many other resorts is that they do not have a resort representative at the airport meeting planes and securing taxis for guests. While this is not a big deal, I did notice that the people who were going to resorts where they had a representative at the airport got taxis a lot faster than I did. Anyway, upon arrival at the Alexandra, a bellman put my luggage on a golf cart, and the reception staff quickly processed my credit card, and I was off to my room. Check-out was efficient too. I didn’t ask for a lot of advice or services during my stay, but the staff were always polite and responsive. What was particularly impressive was that some of the staff were proactive about providing assistance. One thing I did ask the front desk staff to do was to call the Gecko shuttle when I wanted to go somewhere. The process is that the Gecko tells the resort staff when they will arrive, but often what the Gecko driver tells the requester is grossly inaccurate. On several occasions, when the Alexandra staff saw me waiting for the Gecko past the time it was supposed to pick me up, they called the Gecko back without my asking. I really appreciated this, since I didn’t want to bother them to keep calling back, because pretty much everyone knows the Gecko operates on extreme “island time” (i.e., they tell the resort they will arrive in “10 minutes”, but that can turn out to be anywhere between 10 minutes and one hour in my experience). Other staff (beach, grounds, bellman, housekeeping, and management) were friendly and helpful as well. I did not have any negative experiences with anyone working at the Alexandra.", "title": "Heaven On Earth!!", "helpfulness": 2, "user": "C-villeTandCfans", "date": "November 11, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "rooms": 5.0, "location": 5.0}, "id": 10754937, "likes": {"liked": "— View from our room", "disliked": "— Need more beach towels"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "We stayed at The Alexandra March 8th through the 15th and had a blast! Booked a oceanfront 1 br, 1 bath, in the Chelsea building through a timeshare owner and couldn't have been more pleased with our little home away from home. We are in our early 30's with no kids and went to Provo to chillax at an amazing beach with not too many little ones running around disturbing our adult time. I am happy to report there were only a few kids during our stay which was nice, walked by the Beaches resort just a short distance from the Alex and it was a kiddie fest, people piled on top of each other, kids screaming in diapers, blah!...SO happy I didn't stay there!!! and I probably never will stay at a Beaches after seeing what I saw.", "title": "Great vacation, loved it!", "helpfulness": 6, "user": "Masha29", "date": "March 31, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 3.0}, "id": 14695260, "likes": {"liked": "— Ocean front and the beach!", "disliked": "— I liked everything"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "The Alex was clean, had a great location, beach was wonderful, water was crystal clear and calm, service was friendly. I really can't complain about a thing, I loved my stay and will stay at the Alex again maybe even as early as May!! can't wait to go back!", "title": "Loved the Alexandra", "helpfulness": 7, "user": "panter", "date": "March 15, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 14299995, "likes": {"liked": "— Everything, especially the view", "disliked": "— There was nothing to dislike"}}, {"rating": 5.0, "title": "Perfect beach, quiet hotel", "text": "Some things that we did that made things even better: Brought some of the staples with us, ketchup, mustard, sugar, coffee, bug spray, sunscreen, etc. with us and bought everything else at IGA. Brought our own cooler, ice packs, inflatable rafts, ipod & ipod speakers for the beach, & snorkle gear in a extra suitcase.", "helpfulness": 2, "user": "ElbyNY", "date": "March 10, 2008", "id": 14199160}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "We rented a car(I highly recommend) through Grace Bay rentals, older cars but you don't need a new car on this island. A lot of the roads are unpaved and bumpy. Driving left side with right sided steering wheel is akward at first but you get the hang of it rather quickly. Did Sail Provo out of Leeward Marina over the tour off the beach, huge newer catamaran with bathroom on board, really had a great time snorkeling. Went to the Casino, was ok. Ate at Coco Bistro, good but don't get the tempura soft shell crab, yuck! Went to Danny Bouys, was ok. Drove to Sapodilla Bay, and Chalk Sound, very pretty. Jet skiied over Caicos Banks and through the Cays, dove for conch on this tour, wonderful, highly recommend. Loved the Anacona(s?) lounge at Seven Stars, great music, sunset views, and comfy sofas & outdoor beds.", "title": "Loved the Alexandra!", "helpfulness": 3, "user": "atlantagirl7122", "date": "March 5, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 14079415, "likes": {"liked": "— nice, comfortable decor", "disliked": "— n/a"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "All in all we loved Provo and enjoyed our stay at The Alex, hope you do too.", "title": "Loved the Alexandra Resort", "helpfulness": 5, "user": "cowboyfan8", "date": "February 14, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 13554650, "likes": {"liked": "— Closeness to the beach.Cleanliness.", "disliked": "— The cost of alcoholic beverages ."}}], "location": {"country": "Caribbean"}, "stars": 4, "variance": {"poor": 19, "average": 45, "very good": 225, "terrible": 7, "excellent": 351}, "aka": "Alexandra Hotel", "slim_ranking": 0.439024390244, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "Located directly on Grace Bay Beach, one of the most beautiful beaches in the world, The Alexandra offers the dream vacation of a lifetime; luxurious accommodations, warm friendly service, amazing oceanfront dining and a bevy of exciting activities. Understated luxury with a delightful Caribbean atmosphere, fantastic ocean views, powder white sand, international cuisine with island flair and so much more await you at this magnificent Turks and Caicos resort."}