{"user_rating": 4.5, "review_count": 865, "name": "Alfonso XIII Hotel", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed March 2010, traveled with family", "text": "My family of four stayed in two rooms at the Alfonso XIII in Seville. We booked months in advance and requested two adjoining rooms or at least two rooms that were next to each other. We were assured that this request would be honored. When we arrived, our request was not honored.", "title": "A nice stay", "user": "SeaCam", "date": "March 27, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 59643928}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled with friends", "text": "The hotel lobby and public spaces are very beautiful but the rooms themselves are a bit tired and worn. The shower water pressure was weak in both of our rooms.", "title": "Exactly what I hoped a gorgeous hotel in Seville would be: stately, historic, spectacular", "helpfulness": 1, "user": "mrslauer", "date": "February 25, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 57097307}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled on business", "text": "The location of the hotel is great for seeing all Seville has to offer. The breakfast buffet is great and we had dinner in the hotel which was also very good.", "title": "one in a million", "helpfulness": 1, "user": "Siobhan797", "date": "February 18, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 56373932}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "After scouring the reviews, I did select a grand deluxe room. Mine had no issues, no sign of inferior quality. This is a historic hotel. It is a stunning example of architecture and design. From the azulejos (tiles) to the carved ceilings, to the stained glass, open courtyard, and silk-wrapped walls. The location is fantastic. About a 5 minute walk from the cathredral. Taxis awaiting you for any other trip across town. Scored all this for $150 a night. Fabulous!", "title": "Luxury! Luxury! Luxury!", "helpfulness": 1, "user": "moabhiker", "date": "February 15, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 56087391}, {"rating": 3.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "We stayed here on Tuesday. It is an absolutely magnificent building, words can't really do it justice. The friendly receptionist gave us a room upgrade, so our room was very big and lavishly decorated. The bed was king size and very comfortable. The tiling the bathroom was very decadent. We had a drink in the bar in the evening and there was a good atmosphere with spanish and non spanish people making for an interesting mix. The breakfast in the morning was lovely. The hotel offers very good rates off-season.", "title": "Mixed feelings", "helpfulness": 1, "user": "linusbos", "date": "February 14, 2010", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 55924108}, {"rating": 4.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "The location was good & the staff were always helpful & efficient. The room needs updating but was spacious & clean with a comfortable bed & a nice large terrace. Breakfast in the restaurant was nice. There was no in-room tea/coffee making facilities, no in-room iron+board & very limited English TV channels.", "title": "Comfortable & good location but not 5*", "user": "maddison59", "date": "May 20, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 64880559}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "A perfectly located hotel, exellent location for sightseeing, just in the middle of charming Seville, next to Alcazar and Girada. We really enjoyed it palace-like style and elegant atmosphere. The breakfast was very good, the stuff nice and friendly and helpful. The room was beautifully furnished and very comfortable. But one of the table lamps in our room was not working, but it was fixed after we complained. We loved the view of the park and the beautiful buildings that opened from our windows.", "title": "we just loved it!", "helpfulness": 1, "user": "DannyF74", "date": "May 11, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 63853563}, {"rating": 4.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "The hotel in not cheap, but definitely worth staying there", "title": "beautiful hotel with wonderful linen but poorly maintained. Popular with american tour groups.", "helpfulness": 1, "user": "heloiseandtom", "date": "May 8, 2010", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 63592545}, {"rating": 4.0, "stay_parameters": "Stayed April 2010, traveled with family", "text": "The hotel is lovely especially in the public areas but closer inspection shows a lack of attention to detail. We asked for a quiet room and were placed near a very noisy bell that rang every few minutes. After complaining we were shifted to a similar room on a higher floor which was quieter. We later discovered that the basin had dislodged from the plywood bench and the hairdryer which was a hose attached the the wall had a large hole in the hose, fortunately I had brought my own. There was mildew on the wallpaper and cracks and chips all over. We did have a terrace with a lovely view, it was a good sized room and non smoking. The sheets were simply fabulous. Breakfast which was included in our rate was taken in the beautiful patio but the food was of a lower standard than we had outside the hotel. The tour groups seem to eat early so its more peaceful to eat after 8am. For all its faults, the Alfonso was the best option we saw in Seville. Others such as the EME (which has a great rooftop bar) were next to a square used for concerts and in the smaller laneways the noise bounces around. Our hotel was in the grander part of town so we felt safe returning each night and I don´t think that would have been the case in the more cramped areas with dark laneways. Seville is a wonderful place and I can´t wait to return. Antihistamines are strongly recommended in spring.", "title": "Nice but could use an update", "helpfulness": 2, "user": "travelmagic41", "date": "April 5, 2010", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 2.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 60456065}, {"rating": 1.0, "stay_parameters": "Stayed April 2010, traveled with family", "text": "Hotel Alfonso XIII is all the rave being the only 5-star hotel in Sevilla, but I was not that impressed. Yes the hotel is nice and a landmark, the service is good, and the location is very good, but the rooms seemed dingy and dirty. You would think that if you had a hotel like that it would be kept up better, not to mention that there was hair on the floor in our bathroom when we arrived. I think the hotel is nice, but there are better places to stay in Sevilla.", "title": "Overpriced, Under Serviced - Definitely NOT 5 Stars", "helpfulness": 2, "user": "rslcb", "date": "April 3, 2010", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 5.0}, "id": 60258206}, {"rating": 5.0, "stay_parameters": "Stayed June 2013", "text": "Friendly staff and great location. The gym area is a bit small, but very handy for my daily exercises. The room was comfortable with a spacious bathroom with beautiful tiles. For sure I will be back to the Alfonso XIII hotel.", "title": "Superb hotel", "helpfulness": 1, "user": "Tadeujulio", "date": "July 7, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 166645531}, {"rating": 5.0, "title": "A hotel that you will never forget", "text": "The Alfonso XIII hotel is one these hotels that is a destination in itself. A hotel that you will remember as much as the city you visited. The hotel is one of the major landmarks of Seville. It is a beautiful restaured architectonic masterpiece. The location is the best in town and you can walk to all major attractions of Seville", "helpfulness": 1, "user": "Braziliantraveller", "date": "July 7, 2013", "id": 166608907}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "The rooms are exceedingly beautiful and well appointed. The bed is comfortable, the bathrooms are large, clean and modern. The swimming pool is elegant and relaxing. it is a perfect to spend the hottest parts of the day when it is difficult to walk in Seville because of the heat. This is a truly Luxury Collection hotel", "title": "A Grand Experience", "helpfulness": 1, "user": "texas spot", "date": "July 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 166427438}, {"rating": 4.0, "stay_parameters": "Stayed July 2013", "text": "The breakfast served in the beautiful and charming open Courtyard is one of the best I have seen. It includes a huge selection of cheese, hams, breads, fruits, yogurts, Spanish and Andalusian specialties, eggs, juices, Spanish sparkling wine etc. There was so much to sample that I stayed there for two hours and only could eat again at dinner", "title": "Great Hotel in fantastic location", "user": "Yclan5", "date": "July 5, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 166366902}, {"rating": 1.0, "stay_parameters": "Stayed June 2013, traveled on business", "text": "I have not stayed in other hotels in Seville, but I sincerely doubt that there is any hotel there that can rival the Alfonso XIII", "title": "except the location for nothing a five grand luxury hotel", "helpfulness": 1, "user": "miquel77", "date": "July 3, 2013", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 1.0, "sleep": 4.0, "rooms": 1.0, "location": 4.0}, "id": 166131150}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "My family and I stayed at this beautiful hotel for 2 nights. It's was our 2nd leg of our trip which started in Madrid. We went on to Granada and Barcelona. This hotel looks like a landmark. We checked in and were led to two impressive connecting rooms. They were picturesque but there was a sewage smell coming from one of the bathrooms. Having reserved the rooms through AMEX Fine Hotel and Resorts, we were offered a free lunch or dinner. We had checked in around 2pm and decided to have lunch. We requested the bathroom be looked at while we dined. The restaurant served very delicious food but the service was only fair. The odor from the bathroom persisted even after the maintenance personnel had looked into it. We complained again and were told that the pipes needed to be cleaned, and were asked when we would be gone for several hours while they did the work. We went for a nice, long walk and returned several hours later. The smell was better, but not completely gone. The hotel had undergone a thorough renovation recently so this was surprising. The pool area and garden looked like paradise but unfortunately we did not get to use it as our trip was short. Staff was friendly. The hotel is considered the finest in. Sevilla. We enjoyed our stay, except for the first couple of hours.", "title": "Beautiful hotel but a bad odor in the bathroom", "helpfulness": 1, "user": "Strattonskier", "date": "June 24, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 164994341}, {"rating": 5.0, "stay_parameters": "Stayed March 2013", "text": "We were traveling from Madrid to Seville and decided to go to the Alfonso. The hotel is in one of the best locations in town. You are at the edge of the old city and a short walk from Plaza Espania. It's architecture in magnificent in the old Moorish Style. The rooms are great and the staff friendly and fluent in English. If we go back to Seville we would stay there again. I would advise avoiding the Easter Season as prices are much higher.", "title": "Alfonso XIII", "user": "Karen F", "date": "June 23, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 164887172}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "This is truly a 5 star hotel and an experience you will not forget. You will feel the influence of Moors. The architecture, ambiance and feel will make you think of days long gone by. Hotel and everything about it were just perfect, Location in the middle of everything. Rooms, service and food first class. Highly recommend it.", "title": "World Class Hotel with the feel of the Moors", "helpfulness": 2, "user": "The-GCC", "date": "June 22, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 164850115}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "Because of the timing of our check in and pre made plans, I didn't experience this hotel until the morning after check in. My husband and I went to the buffet breakfast that was included as part of his platinum status. We received some questionable/bad service (no beverage service, table seating mishap) and were left with a bad taste in our mouths about this hotel. I used twitter to tweet a simple comment about how I was not impressed with the hotel so far. Within hours, SPG had responded to my tweet, the hotel food manager (Sam Bath) had called us to apologize, and we were brought a bottle of champagne for our troubles. I was IMMENSELY impressed with the attention to customer service. I hadn't sent the tweet to \"get\" anything, just to vent my frustration. I was pleased that Mr. Bath took this information and did whatever her could to alleviate my distress!!", "title": "Started rocky, but ended amazing", "helpfulness": 2, "user": "TracyJane76", "date": "June 22, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 164833188}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled with family", "text": "On another note, we chose to eat at the hotel restaurant \"Taifas\" tonight. First off, the service was impeccable! 3 wait staff to every table. There was never a glass that wasn't filled or a plate not taken away. My husband and I split the Mezzeh tasting menu. It was too much food! Hummus, egg plant, falafel, etc....just for appetizers. The mixed meat main course was cooked to perfection! The bottle of wine the waiter recommended was amazing. Overall, this dinner erased all of the bad breakfast memories and let us see this hotel for the gem that it is!", "title": "Yea and nay", "helpfulness": 1, "user": "nallie3", "date": "June 22, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 164828834}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "I was really looking forward to our stay at the Alfonso XIII. The hotel is absolutely beautiful...when we first arrived and saw it for the first time, we were awed not only by its exterior beauty, but also by the lavishly decorated lobby and the beautifully tiled stairwells. Definitely a historic landmark.", "title": "Beautiful historical hotel, with 3 star service", "user": "PVmomontherun", "date": "July 25, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 72283449}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "The location is perfect (less than 5 minute walk to all the tourist attractions), was very accessible by car and they had valet parking at very reasonable rates.", "title": "Right Royal fun", "user": "aussiesinspain", "date": "July 19, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 71568471}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "Check in at the hotel was great and our room which was a junior suite was perfect for our family of 4(2 adults and 2 teenagers).", "title": "Great stay", "user": "mathsboy", "date": "July 13, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 70820542}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "So why am I not rating this hotel 5 stars.... 2 reasons", "title": "Elegant, Old School Spain", "user": "Marnie33", "date": "July 11, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 70446744}, {"rating": 4.0, "stay_parameters": "Stayed June 2010, traveled with family", "text": "1. It did not have a level of service befitting of a 5 star hotel...", "title": "Rooms range from the rediculous to the sublime.", "helpfulness": 1, "user": "globetrottermom", "date": "July 3, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 2.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 69575858}, {"rating": 5.0, "stay_parameters": "Stayed June 2013", "text": "Bravo to the hotel management! This property is by far the best run hotel my husband and I have had the pleasure of experiencing (8 nights). The properties opulence, and perfect location is second to the staff. Many hotels are beautiful and have the perfect location, but this hotel has a well trained, friendly and efficient staff that makes your stay a pleasure! This hotel can and should be treated as a resort property, especially during hot summer afternoons. I'd recommend enjoying poolside sangria in the well decorated surroundings- very chic with flowing black sheer drapery (only some very low volume music would enhance the environment). The poolside services were fantastic-as we spent every afternoon there. I could provide countless daily examples of the staffs willingness and ability to extend warmth and hospitality. Most notable are the concierge services. The concierge was EXCEPTIONAL! He and the front desk team provided fantastic restaurant and sightseeing recommendations, and arranged tickets to all venues we requested. Not always easy, as in some cases they arranged for staff members to physically stand in line for some smaller performances we requested. They were also helpful in facilitating a date change on our train tickets, by sending someone to the station, so we could continue enjoying our vacation. That was helpfulness that certainly was above expectation and appreciated. Anna at the front desk was also a pleasure and extremely helpful; as was the gentleman at the front desk that recommend we watch the Spain vs Brazil soccer match one evening--we did and it was fun! I'd be remiss without mentioning the manager of restaurant (Sjour ) during breakfast. He's absolutely fantastic--courteous & efficient! I saw many complaints about breakfast services on trip advisor and was pleasantly surprised to see how wrong they were. Each morning I watched Sjour greet/seat and manage the staff to make sure guest were pleased. He frequently checked in with guest during or after breakfast to insure their satisfaction. Typically this is one of the most difficult positions in a hotel. (No one in my family, or circle of friends is in the hospitality industry. We travel 4-5 weeks a year and it's just an observation. I find that people complain more about complimentary breakfasts than anything. Frankly I find it annoying, as in most cases they wouldn't pay for it, but yet complain without reason). Anyway, it wouldn't surprise me to see Sjour become a luxury property manager in the future. The housekeeping staff is usually not mentioned in reviews. but in this case I have to note their extreme care to every detail. There was not a centimeter of floor that didn't shine or space that wasn't attended to daily--such a pleasure! I'd highly recommend staying at this property -- you'll love it!", "title": "Opulence with a resort feel, perfect location & outstanding service.", "user": "SFWolff888", "date": "July 2, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 166008418}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "We visited 5 cities in Spain and stayed in 5 amazing top rated hotels. I loved them all, but my favorite stay was at Alfonzo XIII Hotel. If glamour, luxury, service, history, convenience is what you want in a hotel, this is it. I requested for a free upgrade upon check in, but the hotel was full at the time and therefore could not accommodate my request. Instead, we were given a credit for free drinks at their bar which we enjoyed. Our room was not big but it was bright and tastefully decorated with quality furniture and the most comfortable bed. The hotel just oozes luxury. My husband and I enjoyed the piano bar area where we sat with our drinks and just listened to relaxing piano music being played. All the positive reviews I've read in trip advisor about this hotel is true and I'm so glad I decided to stay here for our three nights stay in beautiful Seville. We walked everywhere as Plaza Espana, The Cathedral, The Alcazar were all within walking distance. The hotel concierge arranged a dinner reservation for me and my husband and we were so very happy with his recommendation we ate there 2 nights in a row.. Every hotel staff we had the pleasure to interact with were warm, helpful and courteous. We did not eat at the hotel since there are so many choices outside. I hope to be able to return to Seville someday with my whole family and stay here. Anyway, the cab driver who drove us to our hotel from the train station told us that there is another Alfonzo hotel in Seville which is in a different caliber. I wonder if some negative reviews are meant for another hotel only because I just did not see any fault during our stay.", "title": "My favorite....", "user": "thedreamvacation", "date": "July 1, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 165838217}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "This is a hotel with a panache, style and poise with a posture of grandeur. It is a superb palace styled", "title": "Palace of a Hotel, Grandiose and real treat", "user": "23vaneet", "date": "June 30, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 165797931}, {"rating": 4.0, "stay_parameters": "Stayed April 2013", "text": "as a hotel. If I could afford I would have stayed much longer . It is expensive yet one does not mind the", "title": "Beautiful hotel in the middle of Seville", "user": "Sajaji", "date": "June 25, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 165149742}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "expense because you feel its worth it. The service was fragmented but the presentation was still", "title": "Beautiful city deserves this beautiful hotel", "user": "jmt96", "date": "June 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 165091479}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "This was our second stay at the Alfonso XIII.", "title": "An experience in itself", "user": "anon73", "date": "July 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 167498390}, {"rating": 5.0, "title": "Perfect", "text": "Even though we'd stayed there before, and knew what it looked like, the hotel still wows you at the first sight. It truly looks like a palace rather than a hotel, and it keeps that look when you walk in.", "user": "Roger C", "date": "July 13, 2013", "id": 167417648}, {"rating": 5.0, "title": "Excellent.. A real palace in the heart of Seville", "text": "The public areas are gorgeous. The beautiful ceilings in the lobby, the majestic stairs, the amazing tiled hallways - everything leading up to your room is magnificient. After all of that splendor, you walk into your room - and it's a Westin, That's a bit of a letdown.", "user": "Senol A", "date": "July 11, 2013", "id": 167209392}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "I am sure we had one of the nicer rooms, too, as we get upgrades as SPG Gold. Don't get me wrong - our deluxe room was very nice, fairly spacious, nicely furnished and decorated...but it looked just like any other Westin.", "title": "Just wonderful", "user": "Janet3775", "date": "July 10, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 167016260}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "I know for many, the brand consistency is exactly what they look for, but the Alfonso is so unique, I just hoped the rooms would retain that feeling as well.", "title": "Put on Your Bucket List", "user": "HRSTraveler", "date": "July 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 166817073}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "Our five night stay at this wonderful hotel blew us away! The hotel is beautiful - the style of the building is amazing and the inner courtyard is ever so nice! The bed was wonderful and the marble floors in the bedroom were a welcome treat from the heat outside. We ate breakfast, lunch and dinner at the hotel and were very impressed with the service and quality of food. That said, I would also recommend eating in other restaurants in the town for more atmosphere as there didn't appear to be that many locals eating at the hotel. The staff was very friendly and helpful. Thanks for a great stay!", "title": "Luxurious Hotel with Great Views and Wonderful Food!", "user": "UKonthego", "date": "July 2, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 69460349}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "A top notch, grand old hotel built in 1929 in classic Andalucian style. Attactive azulejo-lined hallways. Room 328 i third (top) story, excellent. Large room and bath bed comfortable, a/c perfect and silent. Superb service; front desk very helpful", "title": "Superb Hotel in Great Location", "user": "Traveler039", "date": "June 25, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 68670777}, {"rating": 2.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "Nice courtyard is an excellent place for a drink or snack. We did not eat dinner there. Huge breakfast buffet, everything possible is there and excellent.", "title": "Overated - Snobby/Lack of Service", "helpfulness": 2, "user": "Travel1123", "date": "June 22, 2010", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 2.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 68377007}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "Great location, close to cathedral and rstaurants. One block from river and a short walk across river to medium-scale riverside restaurants on the Trianna side. Behind the cathedral, we recommend a sidewalk dinner at Giradello, not cheap but good food and the pasing scene is fun.", "title": "Fantastic Hotel!", "helpfulness": 2, "user": "HappyTraveling40_10", "date": "June 4, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 66458817}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "My husband and I stayed her as a platinum guest and we were not treated very well. We are Asian American business professionals in our early thirties and felt this hotel did not provide us with quality service. Do not stay here if you do not look like your eighty years old and \"appear\" to be wealthy. (On vacation, we dress comfortably in sneakers and jeans.) The porter ignored us and in fact, walked away when assistance was needed with our luggage at the top of mini staircase in the lobby. I was standing right next to him!!!! This was the not the first, but the second instance. I was taking a photo and wanted to ask another porter for assistance. He was on his cell phone and walked away!!! My husband also asked to break a large bill and he was asked if he stayed at the hotel. As a traveling business executive for a global firm, it is the first time my husband reacted with a comment \"maybe we look too young to stay here.\" I never claim this, but I deflinely felt there was discrimination here. Ridiculous. If you are in the L.A area and would like to experience a similar hotel with Spanish architecture, you don't have to venture far. Try the Mission Inn in Riverside. We had our wedding there and the service was outstanding. For a luxury collection hotel (they like to boast about this), this place was disappointing.", "title": "Stay in a landmark", "helpfulness": 1, "user": "NewYorker03", "date": "June 3, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 66376310}], "location": {"country": "Spain", "region": "Andalucia", "continent": "Europe"}, "stars": 5, "variance": {"poor": 41, "average": 53, "very good": 183, "terrible": 26, "excellent": 562}, "aka": "Alfonso Xiii Seville", "slim_ranking": 0.0297619047619, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.5, "rooms": 4.5, "location": 5.0}, "description": "Discover the recently renovated Hotel Alfonso XIII, Seville. Since its inauguration in 1928 the Hotel Alfonso XIII has been the preferred rendezvous for residents of Seville and elite travelers from around the world.From the moment you pass through the entrance of the Hotel Alfonso XIII a world of luxury is your's to explore. Discover the 151 rooms and suites at the newly renovated Hotel Alfonso XIII, Seville, totally equipped and furnished with luxury and comfort. The hotel guestrooms have been decorated with three different elegant styles: Andaluz, Moorish and Castillian rooms."}