{"user_rating": 4.5, "review_count": 387, "name": "Alkyon Hotel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with friends", "text": "As a holiday to Mykonos is all about the fabulous beaches, sumptuous restaurants, vibrant bars and wonderful atmosphere of the place - you might think that your accommodation will not be top of your list of priorities (due to the little time you will spend there). The Alkyon joins everything together perfectly. Its in a wonderful location, overlooking Mykonos town (a 10 minute walk down the hill and you are in the heart of everything), has great views (one of the best sunsets in the world), easy access to the great beaches around the island (they arranged for us to hire a quad bike, which was a cheap and fun way to get around) and offers a simple, but smart choice of rooms (all with a small terrace). The owners are a delight - very friendly, genuine and helpful. There is a beautiful pool, for those not wanting to be adventurous. Breakfast is simple, but perfectly adequate (my only criticism would be to improve the coffee) and they offer drinks and snacks during the daytime (don't view the lack of restaurant as a problem, as Mykonos has plenty of wonderful options, all within a short walk of the hotel). The big positive is the price - very reasonable for Mykonos (and it also includes an airport transfer for free...). A great choice.", "title": "Great hotel, wonderful location & fabulous sunsets", "helpfulness": 1, "user": "Globaladventure", "date": "July 3, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 114976973}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "Stayed here last two weeks in June. As promised we were picked up at the port and dropped back to airport on our return. The guy at checkin was very friendly and helpful, asked us if we had visited the island before and to let them know if we needed any recomendations or help with anything. The reception and bar area are far nicer than the older facility shown on the hotels website. We were brought to our room and made sure we were satifisfied. The friendliness and great service from the owner Sophia and all the staff continued throughout our stay.", "title": "Great Stay", "helpfulness": 2, "user": "colindkavanagh", "date": "July 2, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 114965518}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "The room was modern, comfortable, big bathroom with shower and bath, very clean and we had a large terrace. The view from the terrace was stunning looking directly over the town and sea. We normally head to Little Venice to watch the sunsets in Mykonos but we spent most of our evenings on our terrace enjoying the stunning sunsets before heading into town.", "title": "Wonderful hotel, staff and view", "helpfulness": 1, "user": "BCCampbells", "date": "July 1, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 114946494}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "Breakfast was good, decent choice although the food is less plentiful closer to 10.30 and the coffee could be hotter. Choice of foods include breads, cakes, pasteries, bacon, egg, cold meats, cheese, olives, tomatoe, cereal, yogurt, juices and coffee.", "title": "Spectacular from check-in to check-out!", "helpfulness": 1, "user": "Bee2011", "date": "June 29, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 114854722}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "The location is about a ten minutes maximum walk into town, the walk back is steep and takes about 20 minutes. If you are relatively fit and healthy, you won't have any problems. Its also a good way to burn off the evenings indulgence downtown. It's also worth it to have the stunning views from the hotel.", "title": "Absolutely Fabulous", "helpfulness": 2, "user": "Dimi64", "date": "June 26, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 5.0, "service": 5.0}, "id": 114752272}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled with friends", "text": "We stayed at the hotel Alkyon as part of an extended honeymoon with friends. The service was way above pair. Just as an example, I really stubbed my toe and I didnt have a bandaid. They didnt have any onhand so the front desk sent their transportation guy up to the store to get me some. What hotel does that?! Wow. Anyway, the lobby and pool area are fabulous, and the breakfast in the morning has a huge variety. The rooms are spacious with large patios. The only complaint I would have is that the mattresses are very hard and the lighting in the bathroom was very dim. The hotel will pick you up or drop you off at the ferry or airport for free, and help you rent ATVs. They had a great recommendation for a Taverna just outside of town that ended up being our best meal. Bravo Hotel Alkyon!", "title": "Great Hotel!", "helpfulness": 1, "user": "thejuicemasta", "date": "June 24, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 3.0, "value": 5.0, "service": 5.0}, "id": 114706157}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with friends", "text": "To add to the countless Perfect 5 Star reviews - I also salute Sophia and her team for their beyond call-of-duty services that made all the differences for our vacation experience. It was icing on the cake that the hotel happens to be suberb with a fantastic view you would just love to stay and savour.", "title": "Alkyon - and Sophia - Two Hidden Gems", "helpfulness": 1, "user": "Beetlejuce", "date": "June 23, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 114693979}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "Alkyon was half the price of our Santorini hotel but at twice the value and enjoyment. The dining and pool area has a breathtaking view to relax and chill out. Sophia is always smiling and helpful - she even helped us settled a parking ticket and assured us not to worry about such things while on holiday.", "title": "great hotel and staff...", "helpfulness": 1, "user": "gokbaser", "date": "June 23, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 114672686}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "From the moment we were picked up tll dropped off again for departure - our experience was that of a hearty welcome and hope to see us again - which we will!", "title": "We loved it!!!Unbelievable stay!", "helpfulness": 1, "user": "boystranger", "date": "June 22, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 114654481}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled with friends", "text": "Thank you Sophia for making you and the hotel a precious part of our holiday memories.", "title": "Awesome place to stay", "helpfulness": 1, "user": "daniel30168", "date": "June 13, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 4.0}, "id": 113169279}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled with friends", "text": "Yes, a breathtaking view, great service that makes you feel welcome, pampered and welcomed warmly. Excellent breakfast and beautiful surroundings. Great ambience.", "title": "Positive, positive positive!!!!", "helpfulness": 1, "user": "lentisco_02", "date": "May 17, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 108698328}, {"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "Not so expensive. I really recommend.", "title": "Great bathroom! Friendly staff!", "user": "life_on_travel", "date": "May 15, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 108344754}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "The guys working there are very kind, truly available and nice. Pretty ready to help in anything you need. It was a pleasure to stay there!", "title": "Excellent Hospitality!!!", "helpfulness": 1, "user": "cheinv", "date": "May 10, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 107702598}, {"rating": 5.0, "title": "Alkyon is great!", "text": "The hotel is probably lately refurbished and its lobby is certainly one of the best decorated. It gives you a feeling of staying in much more expensive premise, very elegantly decorated and spacious. Sophia was very friendly and had done us a good introduction of Mykonos on a map.", "user": "CarlosS14", "date": "April 27, 2011", "id": 105829435}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "Room was clean. Size was average. TV is a flat panel one with a lot of channels - surprise! Even more surprise with the modern bathroom which is equipped with a tub - not to be found with the majority of similarly priced places. The shower was one of the best with great water pressure and hot water.", "title": "Awesome hotel and good value for money!", "helpfulness": 1, "user": "eva_mps", "date": "April 26, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 105525134}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "I can not describe how impressed me and my husband were with ALKYON HOTEL and it's service.This hotel has been recently renovated with an apsolutely beautiful and elegant lobby area and very clean modern rooms.There is Wi-Fi everywhere in the hotel(public areas & rooms) for free of charge.We were on our honeymoon and they welcomed us with a bottle of local wine and a bouguet of roses!We really appreciated it.Sophia and the staff are very accomodating and friendly.Swimming pool was another add.Relaxing on the sun beds admiring the sunset was an incredible experience!We highly recommend ALKYON HOTEL to anyone who wants to travel in Mykonos and have a nice time!", "title": "Excellent choice", "helpfulness": 2, "user": "babygirl2_11", "date": "June 7, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 5.0, "service": 5.0}, "id": 112058168}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "My boyfriend and I stayed at the Alkyon for 10 days in May. We had a lovely bright, clean room with it's own little balcony with sea view. The room was cleaned everyday. The pool area was fantastic with amazing views over Mykonos town and the sea. The service we experienced was second to non. Sophia and team will go out of their way to make you feel welcome and were happy to recommend places to visit and restaurants to dine in. Sophia also organised a trip to Delos Island and the hiring of a Quad bike for us too. We were greeted at the airport by Alkyon staff who took us straight to the hotel free of charge. Breakfast was buffet style which consisted of a good selection of continental foods with egg and bacon. The hotel is located at the top of a hill so be mindful that there are alot of steps to walk up and down, however it only takes between 5 and 10 minutes to reach the centre of Mykonos town. All in all I would recommend this hotel as it was great value for money, fantastic location and the views are breathtaking.", "title": "Great value for money", "helpfulness": 1, "user": "Snazzle", "date": "June 5, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 111614277}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "I stayed here early May with my partner for 2 days and I felt very impressed with this property and the service that provides.It is a family run hotel consisting of Sophia and her family.The cleanliness was excellent and above of high standards.The lobby area is recently refurbished and it seems like you are in a boutique hotel rather than in an A class hotel.Our room was big enough with light coloured linen and a magnificent view of the town and the bay!The staff and especially the family was extremely helpful.Everything you need you had it at once!We felt very warm there and we will certainly come back!", "title": "Perfect in all the ways!!", "user": "jenssweet2", "date": "May 28, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 110227351}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "It was an excellent choice and we are happy that we spent our vacation time in Alkyon hotel!", "title": "Nice views, very clean and helpful staff", "user": "Mike_UpperWestSide", "date": "May 23, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 109525366}, {"rating": 5.0, "stay_parameters": "Stayed May 2011", "text": "We stayed two nights, 3 adults and 1 2 year old child. The walk down the hill was not that bad and we can confirm it was about 10 minutes, but you could not use a stroller down the hill. It was only 4 euros to take a taxi to/from town which to be honest is just as fast (and easy to take the stroller).", "title": "Wonderful hotel and staff", "helpfulness": 1, "user": "Happytravler35", "date": "May 20, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 109137658}], "location": {"country": "Greece", "continent": "Europe"}, "stars": 4, "variance": {"poor": 5, "average": 15, "very good": 72, "terrible": 11, "excellent": 284}, "aka": "Alkyon Hotel Mykonos, Greece", "slim_ranking": 0.488372093023, "detail_rating": {"service": 4.5, "cleanliness": 5.0, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}}