{"user_rating": 3.0, "review_count": 119, "name": "All Suites Perth", "reviews": [{"rating": 1.0, "stay_parameters": "Stayed March 2010, traveled with family", "text": "stayed here after ACDC concert in march. Hotel is very basic we got placed in the disabled accomodation, which was ok. shower was dirty and needed fixing, the other room we had was extremeley basic. dirty bathroom, broken fixtures and jobs not fininshed like flooring. Shower smelt of pee.need a really good cleanup but i Might give this a miss next time....", "title": "Grotty, old, patched up hotel", "helpfulness": 2, "user": "Wherenext67", "date": "March 18, 2010", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 2.0, "rooms": 1.0, "location": 2.0}, "id": 58856911}, {"rating": 4.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "I booked a Studio Apartment over the internet. At a later date I noticed allot of negative reviews and adverse comments concerning this property. I emailed the reservations department about my concerns andpromptly got a reply back from \"Casey\", who addressed my concerns. On arrival we were checked-in to a comfortable apartment, I found the accommodation was great and the staff were excellent, especially on the Front Desk. The location is excellent, my initial concerne were definitely unfounded. We would and will recommend Aarons All Suites to our friends.", "title": "A truly enjoyable stay", "user": "DeakinPM", "date": "February 18, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 56432640}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "After reading negative reviews for this establishment I must admit I was very sceptical as to what I would receive. I wanted to give my wife a memorable holiday and Aarons All Suites delivered on all counts. Our room was compact and it had heaps of facilities. A frontloader washing machine, full kitchen facilities, staff that go out of their way to assist, the room staff exceptional on tidying up the room, a full 5.1 Surround Sound to compliment the DVD player and the list goes on. We found the room staff very obliging which is very different to other hotels", "title": "What a fantastic place to stay", "helpfulness": 1, "user": "ringdown1", "date": "February 16, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 56122166}, {"rating": 1.0, "stay_parameters": "Stayed January 2010, traveled with family", "text": "This establishment would be the best that we have stayed at in Australia and could not recommend enough. It is also handy to all public transport and the CBD. My wife and I had no need to hire a car as the Perth Public Transport is super friendly, so much so that it really does kick other capital cities for regularity and punctuality. It has an on-site Cambodian Restaurant that is budget friendly in a city of expensive restaurants and bistros. The Huls Bula downstairs is expensive though with $16:00 cocktails and $6:00 - $8:00 beers. There are plenty of cafes open for breakfast and some restaurants and bistros handy to Aarons All Suites.", "title": "Don't stay here if you are travelling in a car", "helpfulness": 1, "user": "geraldtonian", "date": "January 31, 2010", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "location": 2.0, "service": 1.0, "rooms": 1.0}, "id": 54814332}, {"rating": 3.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "Put Aarons All Suites on top of your list for preferences as far as accommodation goes. We loved them, clean, quiet rooms with very comfortable beds. I suffer osteoporosis and requested a comfortable bed and we got a room with a very comfortable bed. After all a good night's sleep after a huge day on the town is very important.", "title": "capital works issue", "user": "Natasha98", "date": "January 7, 2010", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 3.0, "service": 3.0, "rooms": 3.0}, "id": 52819049}, {"rating": 3.0, "stay_parameters": "Stayed October 2009, traveled on business", "text": "Hotel room was small and very cramped. Certainly not worth 179 per night. No amenities were included. The parking was 20 dollars a day and internet was 40 dollars for one weeks worth which can easily be used up in 3 or 4 days. Location was good and the hotel was clean but there was nothing special about it. You can do better for the money. Hotel staff were decent, one woman was very helpful giving out directions. I would not however stay here again.", "title": "Not worth the money", "user": "huskerabroad", "date": "January 6, 2010", "detail_rating": {"cleanliness": 4.0, "value": 1.0, "location": 4.0, "service": 3.0, "rooms": 3.0}, "id": 52804901}, {"rating": 3.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "The Aarons hotel is very cheap considering all other prices of hotels in Perth. We stayed here the night before flying out on a trip and we didn't have very high expectations. Although when the staff found out it that we were flying out the next day to get married in Thailand they immediately upgraded us the the business suite and brought up a bottle of wine and free parking. They did what they could to make the evening special.", "title": "Value for Money in comparison to other Perth Hotels", "user": "Seajasper81", "date": "November 26, 2009", "detail_rating": {"cleanliness": 3.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 3.0}, "id": 50135415}, {"rating": 3.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "Considering the price of the hotel it was worth it. You wont find cheaper in Perth city. 3 stars.", "title": "Bad Choice", "user": "W0nderer64", "date": "November 20, 2009", "detail_rating": {"cleanliness": 3.0, "location": 3.0, "value": 3.0, "rooms": 3.0}, "id": 49615052}, {"rating": 2.0, "title": "Aarons All Suite", "text": "Our 5 nights stay has not been all pleasant. 2nd and 3rd night, the aircon was not working and we've to request for fan. On our 3rd day stay onwards, the floor and kitchen were not cleaned up properly. Pieces of food from our previous night cooking were still found on the floor, the kitchen top were not wiped. However, the front desk staff is friendly and always polite.", "helpfulness": 1, "user": "TanCL", "date": "October 28, 2008", "id": 21324060}, {"rating": 2.0, "stay_parameters": "Stayed October 2008, traveled with family", "text": "A VERY ordinary stay. The room was poorly serviced, the bed was not made at all, the microwave did not work and they clearly have no idea of the invention of the vacuum cleaner.", "title": "Cheap but not cheerful!", "helpfulness": 2, "user": "DLM48", "date": "October 6, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 2.0, "value": 2.0, "rooms": 2.0, "location": 3.0}, "id": 20680125, "likes": {"liked": "— The location", "disliked": "— Poor servicing of the rooms."}}, {"rating": 1.0, "stay_parameters": "Stayed October 2008", "text": "One of the two lifts was out of service and the remaining lift did not seem to be working on the day we checked out so we had to carry our bags down from the 9th floor. Overall an experience that we would not wish to repeat.", "title": "One word - Cheap", "user": "Weary_Traveller079", "date": "October 6, 2008", "detail_rating": {"front_desk": 2.0, "business": 1.0, "service": 1.0, "cleanliness": 2.0, "value": 1.0, "location": 2.0, "rooms": 1.0}, "id": 20679854}, {"rating": 1.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "In my job I get to stay in a lot of places and I have to say that the Aaron is one of the most ordinary places I have stayed in for a while. The whole feel of the place is one of economy, from the lighting (broken light bulbs), the cheap soap, the really cheap toilet paper, torn carpet, really bad tea and coffee, lack of towels and so on... Not worth the money that they are asking for..", "title": "The Best Part of this Hotel Stay was when we Left (only stayed 4 hours)", "helpfulness": 1, "user": "Willytraveler", "date": "October 6, 2008", "detail_rating": {"cleanliness": 1.0, "front_desk": 2.0, "rooms": 1.0, "value": 1.0}, "id": 20654580, "likes": {"liked": "— Leaving 1st thing in the morning", "disliked": "— everything in the room!!!"}}, {"rating": 1.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "We arrived at this Hotel @ 12.30am and incounted the following:", "title": "This hotel is awful!", "user": "stephied26", "date": "October 3, 2008", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "location": 2.0}, "id": 20586636, "likes": {"liked": "— Nothing!", "disliked": "— Pretty much everything"}}, {"rating": 2.0, "stay_parameters": "Stayed February 2009, traveled on business", "text": "We stayed at Aarons in Victoria St for nearly 3 weeks in a 2 bed room. We found the staff to be pleasant but not terribly efficient. The housekeeping staff were very inexperienced and certainly not up to standard. The beds were poorly made, the vacuuming was done maybe once a week, the soap and towels were always replaced however the bath was NEVER cleaned, we know this because we waited to see how long it took for them to clean off the spilt blue shampoo - it was never cleaned in 20 days!!! The kitchen was never wiped down, except by us. The balcony table and chairs were so dirty we never sat out there and the airconditioning unit was on the balcony and whirred constantly very loudly. The curtains looked like they hadn't been cleaned in years and the whole room needed a very good scrub - maybe they are waiting for Spring although I wonder which year? We knew of others that had bed bugs, but we were lucky!", "title": "Look around - there must be better!", "helpfulness": 1, "user": "letsgosydney", "date": "April 16, 2009", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "location": 3.0, "service": 2.0, "rooms": 1.0}, "id": 28121945}, {"rating": 1.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "On the 15th and 16th November we stayed at the Aarons All Suites Hotel in Victoria Avenue PERTH and we were booked into a Luxury apartment with 1 queen bed, etc.", "title": "A shocker", "user": "kebinsv", "date": "April 1, 2009", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "location": 2.0, "service": 1.0, "rooms": 1.0}, "id": 27208124}, {"rating": 2.0, "stay_parameters": "Stayed February 2009, traveled with family", "text": "This Hotel is rated as 4 star – well the best we can rate it would only just making 3 star. As for luxury – well you must have another meaning for luxury than we have. The room was extremely basic, although the kitchen area appeared to have been recently renovated. The carpet was all lifted up and ragged at the entrance to the bathroom. The carpets in the passage ways of the hotel were soiled an in need a good clean or replacement.", "title": "Certainly no 4-star hotel!", "helpfulness": 3, "user": "Petals7", "date": "February 15, 2009", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 2.0, "value": 2.0, "rooms": 2.0, "location": 2.0}, "id": 24579241, "likes": {"liked": "— none", "disliked": "— poor service"}}], "location": {"country": "Australia", "continent": "South Pacific"}, "stars": 3.5, "variance": {"poor": 24, "average": 35, "very good": 25, "terrible": 18, "excellent": 17}, "aka": "All Suites Perth Hotel", "slim_ranking": 0.51724137931, "description": "Offering a range of accommodation options, from studio to one and two bedroom suites, All Suites' serviced apartments are amongst the best Perth has to offer. Located on the edge of the business district, and walking distance to the Swan River, All Suites Perth offers all the comforts of home, all the service of a hotel, and all on the doorstep of Perth's main attractions. All Suites Perth Apartments are fully equipped with kitchens, fridges, clothes washer/dryers as well as TVs, DVD players and stereo systems. Reception is available from 7am - 9pm daily but of course if arriving outside of these hours just let us know and we will explain our after hours check in procedure. Car Parking is also available for $25.00 per day. There is limited availability for these so it is strongly suggested that you pre-book a car space prior to your arrival. There is also a ‘Wilsons’ car park just around the corner on Hay Street, should our parking be fully booked they offer the same daily rate for All Suites guests. All Suites Perth is also equipped with wireless internet access, available from your rooms as well as public areas within the property. Please see reception for information on costs and how to connect to this service."}