{"user_rating": 3.5, "review_count": 1302, "name": "Allerton Hotel", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed December 2007, traveled on business", "text": "My first impressions of this hotel were not good. The hotel has long-since sold its ground floor space for retail on the Magnificent Mile, and therefore you enter the hotel via a less-than-impressive small side entrance and have to wait for an elevator to the lobby on the 3rd floor. My suitcases were taken out of the truck of the taxi and I was handed the baggage receipt stubs - at no point was I given a choice about whether or not I wanted or needed assistance!", "title": "Disappointing", "helpfulness": 1, "user": "TBUK", "date": "December 9, 2007", "detail_rating": {"front_desk": 1.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 2.0, "location": 4.0, "rooms": 2.0}, "id": 11387646, "likes": {"liked": "— Location", "disliked": "— Everything else"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled on business", "text": "Check-in was a disaster zone. I waited in line for 15 minutes, although people were cutting in and the check-in staff served them and didn't seem to care. Several guests in front of me were having problems checking in and I soon found out why - when I checked in, they mistook me for another guest in spite of having my credit card with my name clearly printed on it.", "title": "Pleasant, Great Location, Good Value", "helpfulness": 3, "user": "IndyMegan", "date": "December 5, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 11266564, "likes": {"liked": "— Value - respectable, cozy room in prime location for $100", "disliked": "— No pool or hot tub, no attached parking garage, mattress could be better quality"}}, {"rating": 2.0, "title": "Decor little to be desired", "text": "My room was, in my opinion, very small, as was the bed, and only had a shower, no bath tub. After a long flight I had been looking forward to a bath, so this was also disappointing. The decor was dated, and I would not have wanted to stay more than one night. My room faced out onto the Magnificent Mile which, be warned, is very noisy! The Christmas shoppers were making a lot of noise when I arrived, and I was woken up regularly in the night by emergency vehicle sirens. Maybe Chicago needs to impose fines for noise during the night hours as they do in Manhattan?", "helpfulness": 2, "user": "jennifer57", "date": "November 25, 2007", "id": 11059555}, {"rating": 4.0, "stay_parameters": "Stayed November 2007, traveled on business", "text": "Of course, the proximity to the Magnificent Mile is also an advantage and you are in a great location with this hotel.", "title": "Older, renovated property with SUPERB staff.", "helpfulness": 1, "user": "Chauncey_Gardiner", "date": "November 19, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 10921854, "likes": {"liked": "— Superb staff...", "disliked": "— Combo biz center/gift shop in lobby was silly expensive."}}, {"rating": 1.0, "stay_parameters": "Stayed October 2007, traveled on business", "text": "Overall, I found this hotel disappointing compared to other Crowne Plaza properties and would not stay there again.", "title": "I Moved Out On Monday Morning", "helpfulness": 2, "user": "blkjax", "date": "November 7, 2007", "detail_rating": {"front_desk": 2.0, "business": 1.0, "service": 4.0, "cleanliness": 1.0, "value": 1.0, "location": 4.0, "rooms": 1.0}, "id": 10676754, "likes": {"liked": "— location was good", "disliked": "— the hotel"}}, {"rating": 3.0, "stay_parameters": "Stayed September 2007, traveled on business", "text": "My husband and I do a lot of traveling to Chicago on business, and we usually stay at The Conrad Hilton or the InterContinental, but they were both booked solid, so we tried the Allerton for the first time.", "title": "Not Bad, Not Great", "helpfulness": 1, "user": "SMonica310", "date": "October 19, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 4.0, "cleanliness": 2.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 10143398, "likes": {"liked": "— Excellent location, great views, quiet and farily comfortable", "disliked": "— Missing shades; dingy, torn curtains; run down feeling"}}, {"rating": 1.0, "stay_parameters": "Stayed October 2007, traveled on business", "text": "We were in a Jr King Suite, so we did not have a problem with the room being small or a low ceiling, which is a good thing since my husband is 6'4\". The elevators and hallways in the hotel are super tiny, and it's true that you have to change elevators to get to street level, but that didn't bother us.", "title": "Disgusting", "helpfulness": 3, "user": "jeff1232", "date": "October 16, 2007", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 2.0, "value": 1.0, "rooms": 2.0, "location": 5.0}, "id": 10085696}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "The room itself was quite large and comfortable, but it was definitely showing some wear. As other reviews have mentioned, the shades were missing from the windows, and the curtains were dingy and torn in some places. (I bought clothespins from a drugstore to keep the curtains shut because after reading reviews here, I didn't want to bother asking maintenance to fix them.)", "title": "We will definitely go back....", "helpfulness": 2, "user": "28High", "date": "October 3, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 10034699, "likes": {"liked": "— location and character of an older hotel", "disliked": "— third floor lobby"}}, {"rating": 3.0, "stay_parameters": "Stayed September 2007, traveled on business", "text": "The staff was very courteous and friendly, especially the maid for our room. We did not have the nightmare experience that some other reviewers had, but we will probably stick to The Conrad as our first choice of hotels in Chicago.", "title": "I stay there often on business - so-so", "helpfulness": 1, "user": "CozFans", "date": "October 1, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 5.0, "rooms": 3.0}, "id": 10028500}, {"rating": 3.0, "stay_parameters": "Stayed September 2007, traveled on business", "text": "The good: Excellent location", "title": "Small rooms!", "helpfulness": 1, "user": "AmsterdamSquirrel", "date": "October 1, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "business": 3.0, "cleanliness": 3.0, "rooms": 3.0, "location": 3.0}, "id": 10025395, "likes": {"liked": "— Location", "disliked": "— Very small rooms"}}, {"rating": 3.0, "stay_parameters": "Stayed October 2007, traveled with family", "text": "The good thing about this hotel is location. It's right on Magnificent Mile (Michigan Avenue) so if you like shopping, this may be the right one. However, The Allerton Hotel did not meet my expectation at all. I booked a double junior suite and expected to get a nice, if not, a quite nice room. Turned out, the room was pretty ugly looking. The wall was painted yellow. Mind you it's not the yellow you see in the photo gallery on the hotel's website. If you really want to see how your room would look like, check out the hotel's virtual tour. It looks the closest to the real thing. The staff were ok. Though, the concierge was excellent.", "title": "A little below average", "helpfulness": 3, "user": "Asatis", "date": "October 30, 2007", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 3.0, "cleanliness": 3.0, "value": 2.0, "location": 5.0, "rooms": 2.0}, "id": 10461262, "likes": {"liked": "— Location", "disliked": "— Decoration"}}, {"rating": 4.0, "title": "Not a bad place at all", "text": "I recently stayed at the Hotel Allerton for a conference (10/22-10/26). It was a decent deal that I got through the conference. I had read previous reviews that were mixed regarding this hotel and was sort of skeptical. I will break down my review for you now...", "helpfulness": 2, "user": "Saysum", "date": "October 30, 2007", "id": 10438318}, {"rating": 1.0, "stay_parameters": "Stayed April 2007, traveled on business", "text": "Hotel/Room: The hotel is old/historical looking from the outside. But it has been recently refurbished. Other reviews stated that the elevator only went to the lobby and you needed to transfer out. This has all changed. You can now ride the elevator from street level to your room. I had a room on the 19th floor. It was on the small side (had two beds) but was tastefully decorated. The TV was kind of awkward because it was perpendicular to the beds. We faced another building (but I didn't care for a view). The bathroom was nicely decorated and the shower had great water pressure. No fridge in the room but a desk in between the beds. Small closet with a safe.", "title": "Extremely poor - rip off and bad management", "user": "GeorgieBrown", "date": "October 28, 2007", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 3.0, "value": 1.0, "location": 4.0, "rooms": 1.0}, "id": 10410618, "likes": {"liked": "— Location", "disliked": "— Rude unpleasant and downright dishonest service"}}, {"rating": 2.0, "stay_parameters": "Stayed October 2007", "text": "Location: This was one of the best features. Right on Michigan Ave. A couple blocks away from everything including: Giordano's Pizza, Water tower mall, John Hancok, and a bunch of other great shopping stores. You could walk to pretty much anything.", "title": "MUCH better options in Chicago", "user": "brklyndoxie", "date": "October 21, 2007", "detail_rating": {"front_desk": 4.0, "service": 2.0, "cleanliness": 3.0, "value": 1.0, "rooms": 1.0, "location": 5.0}, "id": 10207883}, {"rating": 1.0, "title": "NOT impressed. This place is a dump.", "text": "Service: I had booked for 1 king bed but at the last minute needed two beds. The hotel stated that they were sold out and couldn't make the change. However when I got there, they were able to give me the two beds and didn't even charge me extra. The bellmen were nice enough. And I thought the front desk was great too. They were going to charge me for internet access, however I checked my wireless and found that I could pick up a signal free of charge. Never used room service. Maid service was good. No turn down though.", "helpfulness": 2, "user": "Vegas1239", "date": "October 21, 2007", "id": 10207715}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled solo", "text": "I enjoyed staying at the Allerton. The location is fantastic! While my room wasn't the biggest, it was definitely sufficient, clean and confortable. I would recommend the Allerton and would stay there again.", "title": "Positively Surprised", "helpfulness": 2, "user": "seriouslynonames", "date": "September 12, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 8703487, "likes": {"liked": "— Location"}}, {"rating": 4.0, "title": "Great hotel at a great price", "text": "The Allerton Hotel is in the heart of the Magnificant Mile on Michigan Avenue. Because of the low rate ($159) I feared it might be only average condition, but was pleasantly surprised that it was very up to date and clean. We even got a complementary upgrade to a junior suite which was very nice. (But note that it wasn't really a suite, just a large room). The staff was very friendly and helpful, especially the bellmen.", "helpfulness": 2, "user": "Louise55555", "date": "September 7, 2007", "id": 8672740}, {"rating": 3.0, "stay_parameters": "Stayed August 2007, traveled solo", "text": "The only drawbacks: we ate breakfast in the restaurant one morning and it was so-so and expensive; and the toilet in our bathroom was sited so we hardly had room for our knees.", "title": "Small & Older versus Larger & Modern?", "helpfulness": 2, "user": "aistudio", "date": "September 5, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 5.0, "rooms": 2.0}, "id": 8660778, "likes": {"liked": "— Location", "disliked": "— Small rooms"}}, {"rating": 1.0, "stay_parameters": "Stayed August 2007, traveled on business", "text": "We would definitely stay there again.", "title": "Good location - bad hotel -- find another place to stay!!", "helpfulness": 2, "user": "luvtotravel1970", "date": "September 4, 2007", "detail_rating": {"front_desk": 5.0, "service": 2.0, "cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "location": 5.0}, "id": 8618805, "likes": {"liked": "— Location", "disliked": "— Mismanaged"}}, {"rating": 3.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "Before booking this hotel, I was a little skeptical - I had read several reviews from this website and other sites. I was leaning towards booking another hotel, but a friend of mine, a native Chicagoan, convinced me to book this hotel. I should have trusted my initial instincts. After checking in, I used the \"micro-sized\" elevator to get to my room. While on the elevator, I spoke with a woman who had previously stayed at this hotel. After commenting on how small the elevator was, she warned me that I just might get a room where I would open the door and run into the bed - I laughed it off not believing her. When I opened the room door, lo and behold, the bed was right there....within three steps of the doorway. The standard room in this hotel is really small. It may be okay for one person, staying for only one night. However, I was staying there for three nights and was not happy about it. Also, there was a foul odor in the hallway on the floor of my room - I contacted the front desk and requested to be moved to a different floor.", "title": "Allerton Hotel is Okay but not great", "helpfulness": 1, "user": "japesmom", "date": "August 28, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 2.0, "value": 3.0, "location": 4.0, "rooms": 2.0}, "id": 8522124, "likes": {"liked": "— location", "disliked": "— it is a little run down"}}], "location": {"country": "United States", "city": "Chicago"}, "stars": 4, "variance": {"poor": 131, "average": 263, "very good": 525, "terrible": 89, "excellent": 294}, "aka": "Allerton Hotel Chicago", "slim_ranking": 0.644578313253, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.5, "location": 5.0}, "description": "With a spectacular, multi-million-dollar renovation to match our dynamic downtown setting, we have reaffirmed our coveted standing among Magnificent Mile Chicago hotels. Luxuriate in sleek, modern rooms and suites appointed with every conceivable comfort, along with a few surprises. Stay at our dazzling downtown Chicago upscale boutique hotel and be at the center of it all with world-class shopping, dining, sightseeing, and entertainment beckoning from right outside our doors."}