{"user_rating": 4.5, "review_count": 258, "name": "Aloft Chapel Hill", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed December 2011, traveled on business", "text": "This was my first stay in an Aloft hotel. Without a doubt, it's a low end offering. Amenities are minimal, and thanks to lots of concrete and other hard surfaces, the noise level is high. Did I mention paper curtains that let light and street noise in? Staff were friendly enough, but the airport transfer they arranged was terrible. In all, it's far from the best choice if you're looking for a better hotel experience and/or convenient downtown location.", "title": "Low budget experience", "helpfulness": 2, "user": "Bray11", "date": "December 5, 2011", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 2.0}, "id": 121438166}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "Excellent job done by the staff. Perfect accomodations for this large group. Ages from 3 months to age 87.", "title": "Aloft Wedding Weekend", "user": "Bill K", "date": "December 5, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121421586}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled on business", "text": "If you have ever experienced Starwood's W Hotels, then you will love this property! Aloft is a lower end version of W, but is still very impressive. For the price range, you can't beat it. I've stayed at a few Raleigh area hotels and this is the best. I love to stay here on business and it's a convenient drive to the airport.", "title": "Love Aloft", "user": "happyjackman", "date": "December 2, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121316886}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled with friends", "text": "One of the things marketing folks get excited about is when customers consider their brand to be so powerful that people associated themselves with it. I'm now identifying with the Aloft brand. I just love the place so much.", "title": "Proud to call myself a member of the Aloft family", "helpfulness": 1, "user": "RuthlessBunny", "date": "November 29, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 121198560}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "I like the young, hip, vibe of the place. I love the dogs, free to roam around and be dogs. I love the staff, all smiling, helpful and pleasant.", "title": "Great pit-stop on our way to the beach", "user": "amy_dawn_99", "date": "November 26, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 121060608}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled on business", "text": "Nice hotel in a quiet area walking distance to restaurants and grocery store", "title": "Nice hotel in a quiet area walking distance to restaurants", "user": "nychellzkitchen", "date": "January 20, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 123355333}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled on business", "text": "Typical Aloft...clean and with happy people working there", "title": "Great Spot", "user": "Justin M", "date": "January 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 123257404}, {"rating": 5.0, "title": "GREAT stop, great price", "text": "Free Parking... covered and uncovered", "user": "eclarky", "date": "January 14, 2012", "id": 123084934}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled on business", "text": "Will stay again if in the area again... Platinum SPG here and this is your typical Aloft", "title": "Friendly staff, new modern hotel", "user": "SometimesFlyer", "date": "January 10, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 122901588}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled with family", "text": "Excellent hotel with a great bar and extremely friendly staff. Would definitely recommend to anyone coming in to see a game or traveling on business.", "title": "Very nice stay...", "user": "Mason", "date": "January 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 122830937}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled with friends", "text": "Great hotel. It felt very European. Simple but at the same time very stylish. The check in staff was extremely friendly and helpful. The lobby felt very modern European boutique in style. The room had intelligent design and a sexy bathroom. PLUS they accept well behaved dogs and had a dog bed and bowls in the room waiting for us. This property felt lush and high end but at a very reasonable price. I'm a fan and will look for Aloft hotels in all my travels now! Please build more of them!!!!!!", "title": "Modern, clean, friendly staff, hip....", "user": "RussellKP", "date": "January 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 122821910}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "On our way back from our vacation we needed to hotel that would allow us to take a break and relax. Based upon other reviewers I was worried about the location of this hotel. A lot of people said they had a hard time finding it. We had not problem finding it. Actually we thought it was very easy. Not only was our GPS dead on they have small signs on the rights that point out the hotel. The checking process was very easy. Initially they gave us a room with two queens which we booked a king. I think this was not their fault because we booked it via Priceline. However, I went back downstairs and the service representative was very sorry and quickly switched our rooms. The rooms are great, just like the name of the hotel it is a loft feel. The beds were comfortable and the room was very clean. The bathroom is my favorite of any hotel I have ever stayed at. The hotel accepts dogs with no problem. Since my dog was over 40 pounds I had to sign a waiver for him, but not big deal. The service desk rep. even gave my dog a treat. The parking is on site right next to hotel. They give you a parking sign to put in your car which allows you to park in the spots outside the garage or in the garage. They have a nice bar downstairs with a pool table and relaxing area. I love it so much that I will keep in mind other Alofts when traveling.", "title": "Awesome Hotel, Clean, Comfortable, Great Customer Service", "user": "LoveTraveling1126", "date": "January 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 122625208}, {"rating": 3.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "The concept of disguising a slightly above average hotel with a contemporary look and a \"green\" approach works well for this chain, as most of the reviews indicate. But underneath the facade of luxury, we found what we thought to be an adequate room that was, indeed, clean. The room was furnished rather sparsely, with only a desk type chair available for seating, no closet, no drawers. Thankfully, our bags were small, so that allowed us to balance them on the foot wide shelf below the rod covered by a curtain that is also a foot wide. We only stayed for one night, so it wasn't a burden to live that way for less than 24 hours. There wasn't the usual printed material available in the room (I imagine you can request it from the front desk) that helps with information about the area and restaurant, etc. I suppose this is part of the \"green\" concept. The beds were comfortable, the pillows uncomfortable, and there was a 42\" television in the room, which itself wasn't overly spacious, but not cramped. The hotel is also pet friendly, and that includes dogs that are about the size of Shetland ponies. So those of you with certain allergies, consider yourself forewarned.", "title": "Adequate", "user": "TarHeelBiggy", "date": "December 30, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 122289082}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "The people on the front desk were very helpful, courteous, and efficient, and that's always a nice thing to have at a hotel.", "title": "Gorgeous Property!", "user": "Laneash", "date": "December 20, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121920259}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled on business", "text": "If you like unique, with an unusual flair and some extra touches in the lobby, you'll enjoy it. I certainly would not rate this as a bad choice for a hotel stay in Chapel Hill, but there are better choices for some people.", "title": "A new look in a hotel chain -- fun, clean, Scandinavian look", "user": "Robby71", "date": "December 18, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 121869527}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled with family", "text": "We attended a Thanksgiving family weekend as our son lives in Chapel Hill with his family. This was our 2nd stay at Aloft. We have enjoyed both stays immensely. The cost was a good value. The staff was very helpful....room was clean...good maid service.....very satisfactory stay. We will stay there again.", "title": "Thanksgiving Weekend Stay at Aloft Hotel", "user": "hcohn31", "date": "December 16, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121799540}, {"rating": 3.0, "stay_parameters": "Stayed July 2011, traveled with friends", "text": "The aLoft Chapel Hill provided me with a pleasant stay. If you've ever stayed at an aLoft, the property is exactly what you'd expect as far as hotel layout, staff, and style go. I was placed on the SPG floor and did not experience any noise or problems while staying at the hotel.", "title": "The aLoft Chapel Hill - Nice!", "user": "sluzby", "date": "December 13, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 121704914}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled with friends", "text": "The hotel is in a decent location, but I'd recommend having a car (or taking the shuttle) to be able to branch out and see other areas. There are a few stores and places to walk, but the majority of attractions aren't within walking distance. In terms of parking, there was free parking right outside of the hotel, so that was a major perk! They also offer valet service. Internet was also free in the hotel.", "title": "Excellent service!", "user": "douglado", "date": "December 12, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 121680246}, {"rating": 1.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "I would say, overall, I did not experience any major glitches in my stay at the aLoft Chapel Hill. The hotel and staff provided exactly what was advertised and expected of an aLoft property. I would return to this property in the future, if ever back in the area.", "title": "Worst customer service", "helpfulness": 2, "user": "Jand12", "date": "December 12, 2011", "detail_rating": {"service": 1.0, "cleanliness": 5.0, "value": 1.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 121673026}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled with family", "text": "My wife and I stayed here for a wedding in Chapel Hill and were very pleased with the staff and amenities. The Aloft had all the quality of a Starwood property with a precise blend of economy and function. We brought our dog Ziggy (a 100 lb mix) and Chase and Brad treated us all like family. I will defintiley seek out other Aloft properties as a result of this experience.", "title": "Great Choice", "user": "cb8855", "date": "December 8, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121516376}], "location": {"country": "United States", "city": "Chapel Hill"}, "stars": 3, "variance": {"poor": 8, "average": 27, "very good": 71, "terrible": 9, "excellent": 143}, "aka": "Aloft Chapel Hill Hotel", "slim_ranking": 0.5, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "Aloft Chapel Hill is by UNC's Campus, area universities, Research Triangle Park, and RDU Airport. Our hotel has 1,600sq ft of meeting/event space, free wifi, an indoor pool, and w xyz, a bar/lounge."}