{"user_rating": 3.5, "review_count": 448, "name": "Aloft - Baltimore Washington International Airport", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "We just wanted a hotel to sleep before taking a plane next day and we found it very comfortable, clean and we are invited to go back and spend more time there. Staff and kind and nice. The pillows and the bath soap were the best!", "title": "Great", "user": "Trip60", "date": "October 31, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 144163589}, {"rating": 5.0, "stay_parameters": "Stayed October 2012", "text": "Thank u to Shafeqah, Mallory and especially the manager Pierre. Pierre was exceptional ! I highly recommend this hotel . The Service was outstanding .", "title": "Fabulous Hotel", "user": "Bridgetwiley", "date": "October 31, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 144158734}, {"rating": 2.0, "stay_parameters": "Stayed October 2012, traveled on business", "text": "When we arrived Pierre welcomed us and although they had no double beds showing available Pierre went out of his way to Make it happen. He then Took my husband down the street to purchase wine and said it was all at his pleasure.", "title": "Needs some work", "helpfulness": 3, "user": "LovingThisLife", "date": "October 28, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 2.0, "location": 5.0}, "id": 143917345}, {"rating": 5.0, "title": "Excellent", "text": "The rooms are spacious , clean and the decor is sassy retro ... (; breakfast was awesome and the overall experience was there was extremely pleasant . We will Definetely return to here if ever in the Baltimore area.", "helpfulness": 2, "user": "Tony C", "date": "October 26, 2012", "id": 143801509}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled with friends", "text": "Great front-desk staff but this place needs some work. We stayed here twice. We arrived in Baltimore and needed a hotel near the airport to catch a flight the next day so the first stay was very short. The front-desk attendant, Pierre, was very welcoming and helpful and our room was fine. It was small but we were only there for the night and didn't need much. When we departed the staff allowed us to store a piece of luggage until we returned a week later to finish out our trip. I chose this hotel because I needed to be in that area for some appointments and the location was perfect for my needs. When we returned the staff were once again, helpful and our luggage had remained untouched in storage. Our room, however, was a different story. We arrived at the room to find there was no door on the bathroom. That's fine if you are in the room alone but I wasn't about to share a room with anyone for 4 nights with no bathroom door. So, we asked to be moved and the staff quickly gave us another room. It had been a very long day for us and I left my purse in the first room. The hotel staff returned it untouched and asked me to verify the contents. I was grateful that the staff were so honest considering, our camera, phones, wallet and jewelry were in the purse! The new room had a bathroom door but it would not close. It was a sliding door that kept sliding back open unless we jammed something in the track to keep it closed. This would not have been a problem if we hadn't already had to move just to have a door in the first place. The sliding, barely-covers-the-entrance, modern door may look nice to some but it is not practical at all. The door never fully closed in this room. They did give us a bar voucher for our troubles, which was nice. Wine makes up for a lot of things but still a bathroom door is key. The other issue was house keeping. On our last full day, our room wasn't serviced. We really just wanted fresh towels so we asked the housekeeping staff when we saw them in the hallway with a cart full of towel around 3pm but when we returned at 2 am with still no service, we called to the front desk and the woman told us we could have fresh towels but we would have to come down to the desk to get them. Not cool at any time of day. While the problems with the hotel were minor, it was inconvenient and I wouldn't stay here again.", "title": "Service is Excellent", "helpfulness": 1, "user": "Tracy H", "date": "October 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 143735959}, {"rating": 5.0, "stay_parameters": "Stayed October 2012", "text": "We have stayed at the Aloft on several occasions visiting DC and Baltimore. The hotel staff is excellent, very friendly and helpful. The decor is modern and very calming after a long ride. Highly recommended for value, location and amenities.", "title": "Modern, clean, convenient airport hotel", "helpfulness": 1, "user": "redsig", "date": "October 23, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 143558016}, {"rating": 3.0, "title": "No regrets, but maybe would stay in the city next time", "text": "I had just stayed at another Aloft 2 weeks before with no trouble, but this experience was not quite as good. The staff was friendly, and the decor was basically the same as the other. The room, however, was a little more worn down (carpets and walls), and the hallway by the elevator needed vacuuming the whole time we were there (yes, it was that noticeable). Our biggest issue was that housekeeping took the towels that we had not left on the floor and then did not replace them. When we arrived in the evening, we called the front desk. After almost an hour, we finally went down to the front desk to pick them up ourselves. They also didn't leave any creamer for the coffee, so we had to get that too. What we did like? Free parking, fridge and safe in room, digital thermostat, the ability to plug mobile devices and laptops into the flat screen tv (they say that they will lend you a cable, but we didn't use that service), non-creepy and mellow hotel bar in the lobby, convenient access to the highway. There were also other little touches, like good soap, a few interesting magazines in the room, and something I really, really appreciated....lots of electrical outlets for charging devices, including easily accessible plugs on both bedsides.", "helpfulness": 1, "user": "GiselleF", "date": "October 18, 2012", "id": 143164898}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled on business", "text": "By the way, there's also a pool if you bring kids, but I don't really think of this as a kid type hotel.", "title": "Different and trendy.", "helpfulness": 1, "user": "Rob T", "date": "October 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 143133108}, {"rating": 4.0, "title": "Enjoyable stay. Great service in the restaurant.", "text": "The hotel is not right next to the airport (though you can hear the planes), but it's convenient to it as well as to downtown Baltimore (maybe an 18 minute drive). There's a free airport shuttle also. The only other tip I can think of to give you is that the hotel is part of a complex containing a Marriott, Hilton, and Aloft. We accidentally walked into the Hilton when we arrived, because the signage was unclear. Just go all the way to the end of the street to find Aloft. The advantage of this set up is that the Hilton has a restaurant (if you need it), while Aloft does not, and it's an easy walk across the parking lot to get there.", "helpfulness": 1, "user": "SuperNaturalBC", "date": "October 17, 2012", "id": 143079226}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled on business", "text": "I stayed here on a business trip. The rooms offer some unique features, like a little AV switch that allows you to plug your laptop's VGA cable in and display it on the TV in the room. The whole facility was clean and seemed well looked-after. There is a nice little snack area in the lobby which is expensive but convenient. I was surprised that the WiFi was not a free service. I used my phone for internet access, and I expect many others would do the same, rather than pay a fee for WiFi. I liked the decor and the design of the lobby. The staff was attentive and it seemed like a good value.", "title": "Fantastic!", "helpfulness": 1, "user": "Katie H", "date": "October 17, 2012", "detail_rating": {"value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 143015897}, {"rating": 3.0, "stay_parameters": "Stayed October 2012, traveled on business", "text": "Stayed at the Aloft by the airport for one night. Aloft is a very modern hotel which I do love. The room was really nice with a comfortable bed, nice flat screen TV, complimentary water, and a refrigerator. Loved Loved the room. The reason it has an average rating is due to the bartender and the front desk. I was checking in late at night and there were a few off us. The woman working the front desk was talking super fast while I was checking in. My coworker and I barely understood what she even had to say. The reason it only has an average rating is due to the lounge and bar area. I proceeded to meet some coworkers at the lounge area after we checked in. We were sitting on some couches and the bartender starts screaming at a customer. I have no idea what the customer did but it was a very strange awkward feeling that I was getting just being in the same area. There was also a little cute dog running around jumping on people's laps. I am sure they didn't mind but I found it strange that this dog had the run of the hotel. I am sure Starwood would not expect that this is happening in one of their hotels. Overall great night of sleep but strange in the lounge. There are plenty of hotels to choose from in the BWI area. I am sure there is another one for the same price range. I will stay at Aloft again but not that one.", "title": "Loved the room but the service", "user": "tabasco3", "date": "October 5, 2012", "detail_rating": {"service": 2.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 142083188}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled on business", "text": "This was my first time staying at this hotel and the hotel itself is trendy, clean and comfortable. But I have to say what made my evening relaxing is having my quick dinner and a drink with Tanya at the WXYZ Bar in the hotel. She is friendly, has a bubbly personality and her \"glitter\" lights up the night. I came down for dinner both nights and nothing was ever too much trouble for her even when other guests were a bit demanding. That is true professionalism and she is an asset to your company. Look forward to staying there again!", "title": "First Time", "user": "Eileen G", "date": "October 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 142056426}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled on business", "text": "Well folks, ALOFT BWI has done it again- they have gone and made me and the other patrons feel as if they are staying in a castle, not a basic, 2 star hotel. Pierre, Kierra, and Shafeqah are a power packed combo of staff to interact with during a stay. I seriously have to pinch myself after each interaction with them to remember that I am not in a 4 star hotel. No, I am at A-lOFT, but that's just fine with me because being treated with the kind of respect, patience, and interest in my experience that they demonstrate is the most important part of my travel experience. Who cares about the fads, colors, mirrors, and \"LOFTY\" feel- it's the people that elevate this little corner of the world.", "title": "A-\"lofty\" set of standards for customer service", "user": "Rebecca m", "date": "October 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 142036083}, {"rating": 5.0, "stay_parameters": "Stayed October 2012", "text": "My sister and I stayed here at the very top floor (The Preferred Guest Suites) for a few days. They were beautifully furnished and very clean. Beds were very comfortable and we were never disturbed at night. I know there are few negative reviews about this place, but I believe people are just being harsh. The pool & workout room weren't huge - but they were still there, and we enjoyed them! The lounge area was really neat & comfortable. We played a few games of pool as well. The staff was always so sweet & welcoming - Pierre is the bomb!!! :)", "title": "Loved it - definitely recommended!", "user": "sophieaj94", "date": "October 4, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 142030965}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with friends", "text": "Overall, I'd always come back. We were in love.", "title": "Great hotel and ware reception", "user": "jay j", "date": "October 4, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 142000640}, {"rating": 2.0, "stay_parameters": "Stayed October 2012, traveled on business", "text": "Check in was easy but when arriving to the room there were many things damaged in the room. The bed looked like it had been slept on. The bar service was so so. The icing on the cake was it took over an hour for the shuttle to pick us up at the airport. I definitely will stay elsewhere next time.", "title": "Very Disappointing Stay!!!", "helpfulness": 1, "user": "woof2you", "date": "October 15, 2012", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 4.0}, "id": 142914780}, {"rating": 5.0, "stay_parameters": "Stayed October 2012", "text": "we only stayed on a brief layover in the hotel. However we encountered such wonderful service. Our room what exactly to the specifications of our request. Also made specific request for a crib and Konise, at the front desk along w Pierre, the manager on duty made sure that 2 sleeping children did not wake up. It may seem trivial, but the difference between a good hotel and a great hotel are the subtleties. Exactly what we needed! Couldn't be happier! we would definitely stay again.", "title": "Customer service. Wonderful attention to detail!!", "helpfulness": 1, "user": "BigTuna1", "date": "October 13, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 142750228}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled solo", "text": "The Reception/Lounge area is unique in terms of the design. Very distinctive. However, the idea to supply food in reception is not thought through. Why not charge the items on a room bill as appose to paying directly? good choice of food nonetheless. The notion of implementing a pool table is good. its a way of entertaining guests - it worked. Overall, the hotel is decent, the rooms are fairly standard good for students (like myself)", "title": "Overall layout and decor is simply awesome!", "user": "Canai_E5", "date": "October 11, 2012", "detail_rating": {"service": 2.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 142529129}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled with friends", "text": "I recently stayed at this hotel and enjoyed it very much. The rooms were an adequate size if not really roomy. I and my 3 other friends shared a 2 queen room and the room space was great. Especially for 4 people with about 8 or 9 suitcases between us. The beds were very comfy. The bathroom/ shower area was nice. The only thing I did not like about the shower area was that is was only separated by a movable wall mirror and it did not close all the way. So one could actually see snippets of someone showering. The fridge and free bottle waters were extra bonuses as was the FREE WIFI throughout the hotel (including your hotel room). The hotel itself has a nice/ contemporary vibe/ feel to it. The Lounge area was cool/ hip and equipped with pool table. The bar area was chic and there were actually people conversing over in that area. The Munchery or Snack area was always topped with snacks and quick bites to eat. The pool and exercise areas were nice although I wish we would have had time to enjoy it. The only things that bothered me about the hotel was guest/ shuttle services. Check-in staff were not very friendly and were a little curt at times. Only one clerk and housekeeping seemed at all friendly. Shuttle service expanded to the neighboring Arundel Mills Area. Because I found it a bit strange that the Arundel Mills Aloft Hotel could pick guests up at BWI Amtrak station and take them to that area but the Aloft BWI shuttle could only go 3 miles from the hotel. All in all this is a good hotel to stay in when trying to explore DC and Baltimore. Free parking, Free shuttle to MARC commuter trains and Amtrak trains make this a great hotel for me.", "title": "Aloft @ BWI", "user": "ncallaha", "date": "October 10, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 142505894}, {"rating": 5.0, "stay_parameters": "Stayed October 2012", "text": "I want to acknowledge the great customer service and welcoming presence from Tanya. She worked at the bar and was a wealth of information and great to watch sports with!! Best part I gave her an idea of what I wanted to drink and she just created something great. This welcome is so appreciated from a travel perspective and I recommend this hotel and especially spending some time at the bar.", "title": "Customer service fantastic", "user": "DeltaBindu", "date": "October 8, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 142260001}], "location": {"country": "United States", "city": "Linthicum Heights"}, "stars": 3, "variance": {"poor": 50, "average": 75, "very good": 139, "terrible": 43, "excellent": 141}, "aka": "Aloft - Baltimore Washington International Airport Hotel Linthicum", "slim_ranking": 0.793103448276, "detail_rating": {"service": 3.5, "cleanliness": 4.0, "value": 3.5, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "description": "Aloft Baltimore-Washington International Airport Hotel offers something bold and new to the culture-conscious traveler alienated by cookie-cutter, one size fits all experiences."}