{"user_rating": 4.0, "review_count": 216, "name": "aloft Broomfield Denver", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled on business", "text": "I stayed in the Aloft Broomfield since I needed to be in Lafayatte so the hotel was close by. I like the modern look of the lobby, the bar was very creative and the drinks were fun and good price.", "title": "Neat Hotel", "user": "L1", "date": "November 19, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 3.0}, "id": 120800203}, {"rating": 1.0, "stay_parameters": "Stayed November 2011, traveled on business", "text": "The room was different from what I was used to. I felt it was a good size, (I had 2 queen beds). I would have like some drawers and a deeper, shorter closet. I loved the spaciousness of the bathroom counter. Lots of room to spread out. I was also very happy to see a walk in shower with a rain shower head. Much better than trying to step into a bathtub.", "title": "MAJOR DISAPPOINTMENT", "user": "ocdtraveler331", "date": "November 18, 2011", "detail_rating": {"service": 3.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 1.0}, "id": 120738921}, {"rating": 3.0, "stay_parameters": "Stayed November 2011, traveled on business", "text": "It was a plus to have 2 bottles of water left in my room. Because of the dry weather, I really needed it. They could offer a bigger lotion for that same reason. I went through it before the morning was done. The Bed was very comfortable. Loved all the plugs.", "title": "Nicest hotel in area, but lots of development nearby.", "user": "originalXfactor", "date": "November 16, 2011", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 2.0, "rooms": 4.0, "location": 3.0}, "id": 120685644}, {"rating": 4.0, "stay_parameters": "Stayed November 2011", "text": "Some things to help the stay better.", "title": "Different and fun", "user": "LeakyWader", "date": "November 13, 2011", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 3.0, "rooms": 4.0}, "id": 120554795}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled on business", "text": "Provide foam pillows. I hate down pillows as they always go flat.", "title": "Clean and Pleasant", "user": "lynnie_poops", "date": "November 9, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 120392781}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "Stayed here for 1 night, the room was clean, new, great big-screen TV, nice, modern amenities. Great value!", "title": "New, Clean, and Efficient", "helpfulness": 1, "user": "raffel", "date": "September 12, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 118006313}, {"rating": 4.0, "stay_parameters": "Stayed August 2011", "text": "This hotel has very well designed rooms that come off as hip and seem more expensive then they are. The aloft brand is definately carrying on the W style at a more budget level hotel.", "title": "All the power outlets you could ever want", "helpfulness": 1, "user": "jrroe", "date": "September 10, 2011", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 5.0}, "id": 117910188}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "This is my first time staying at one and I must say i really enjoyed it for a couple of reasons, first and foremost the number of plugs easily accessible. There were plenty of outlets everywhere i needed one. Not just on the desk but on the nightstand, and near where the ironing-board goes, all around the room really. I travel frequently for business and always seem to have to choose between charging my phone, computer, iPad, or kindle this typically happens after a long desperate search that may involve trying to move furniture.", "title": "Great Hotel, Awesome staff, Perfect location for an event at the 1st Bank Center", "user": "Breckgirlz", "date": "September 10, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117899356}, {"rating": 3.0, "stay_parameters": "Stayed August 2011, traveled with friends", "text": "The other nice thing about this hotel is the energy. Coming home every night there seemed to be people at the lobby bar having drinks and being social. While this may be a turn off for some I found it to be a nice change of pace from the usual dull hotel lobbies I typically see.", "title": "Good hotel with some room for improvement", "user": "KozyKritter", "date": "August 26, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 3.0, "value": 3.0, "service": 3.0}, "id": 117298038}, {"rating": 2.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "Stayed at Aloft the evening of a concert at the 1st Bank Center. The staff, first of all, was awesome....so friendly, accommodating and helpful. The rooms were the perfect size for the price, and very clean. The beds were also extremely comfortable. I assumed, considering the concert goers at the hotel, that it would be fairly noisy. However, I was surprised how quiet the rooms were! We will definitely stay here again!!!!", "title": "So many things in the room were broken", "user": "balletbabe", "date": "August 21, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 1.0, "value": 2.0, "service": 3.0}, "id": 117037177}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled solo", "text": "I have stayed at this hotel several times, but have just now gotten around to writing a review. I stayed last night, and am staying again tonight. EVERYTHING about the Aloft in Broomfield, its atmostphere, and most of all the team members, far exceed any hotel I have ever stayed at. Ryan and Julian are the managers and have gone above and beyond to take care of me. Monica, Samantha, and Rick are also tops when it comes to their handling of their guests/patrons. I always have a wonderful time, and am treated like royalty when I'm here. Besides being aesthetically pleasing, the staff have been more accommodating than I could have imagined. I will always recommend this hotel to anyone who asks where to stay in this area. In fact, I am moving to Texas next week, and decided to have my going away party at the aloft bar and social area. It's a blast and everyone has been great about hosting it! Stay here if you want to wake up happy and refreshed! LOVE this place.", "title": "Wonderful Stay(s) at Aloft Broomfield!!", "helpfulness": 1, "user": "Patrick E", "date": "October 15, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119339568}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled solo", "text": "I had not heard of this line under the Sheraton name until I was looking for a hotel outside of Denver but not as far as Boulder. I had activities in both cities over a weekend and LOVED the price of this hotel so i thought I'd try it. I'm hooked!!! it was extremely comfortable and the staff is very nice!", "title": "Love this hotel!", "user": "Lainy76", "date": "October 5, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 118977468}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled on business", "text": "I really enjoy the trendy feel as well! I'll be back soon!", "title": "Excellent choice for Broomfield area, will be back for sure.", "user": "nikimc", "date": "September 28, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 118679200}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "First stay here after years of traveling to Broomfield on business, and I'll be back for sure.", "title": "LOVED IT!", "user": "TricolorCS", "date": "September 21, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 118417910}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "Loved everything about the room, and the hotel in general. Two small points would have improved my stay, but not showstoppers at all. 1 - The mini-fridge is on the tile floor, so the sound echos a lot at night, if it was on a carpet tile that would deaden the sound, and be a great improvement for light sleepers. 2 - You can't sit at the desk and watch TV, which for a multi-tasker like me was a pain. Fine to use laptop in bed, but a laptop tray (like Hampton Inns have) would make that more comfortable.", "title": "great stay for the money", "user": "nutravelsawait", "date": "September 19, 2011", "detail_rating": {"value": 4.0, "location": 3.0, "service": 4.0, "rooms": 4.0}, "id": 118311259}, {"rating": 2.0, "stay_parameters": "Stayed August 2011, traveled on business", "text": "Loud, noisy, gaudy, cheap.", "title": "A dump to avoid, unless you are on spring break", "user": "1911MC", "date": "August 15, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 1.0, "value": 3.0, "service": 3.0}, "id": 116781633}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "The AC had a loud drone, the choice was a headache or too hot.", "title": "Very nice rooms! It would be nice to get breakfast.", "user": "dlandthr", "date": "August 15, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 3.0}, "id": 116744517}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "The hotel thinks it looks European. Europe is not this gauche.", "title": "My first choice for Business and Leisure travel", "user": "SlvrBel", "date": "August 14, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116728537}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled with family", "text": "We were eagerly anticipating our stay at aloft Broomfield; the last night of our vacation and our first \"real\" hotel. I wasn't sure what to expect, but knew it would be different. It was. The decor is bright and eye-catching with many different seating arrangements. The lobby is meant for socializing, with pool tables, a fireplace, the computers with free internet, and the bar all right there. Very \"open-concept.\" The kids loved the elevators with fun interactive pads on the floor to play with. The rooms were very large with huge restrooms and a large glass enclosed shower. We had mini-refrigerators, but you have to go down to the self-serve deli to use the microwave. The beds were very comfortable, and they had huge flat screen TVs and you could hook your ipod or other electronic device to be broadcast thru the TV. If you wanted anything to eat, you have to go the the deli, pick it up, and take it to the check-in desk to pay for it. The food was to expensive and minimal for breakfast, so we went out. There isn't much else around the hotel, so we had to drive a bit. It was an easy commute to the airport from here. We got a GREAT deal thru the booking site if the prices posted were accurate.", "title": "Will definately stay there again!", "user": "OlsonOlson", "date": "August 6, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116335204}, {"rating": 1.0, "stay_parameters": "Stayed August 2011, traveled on business", "text": "Awesome contemporary \"GREEN\" decor. Awesome amenities, the fitness room, the lounge and food selections are right on. Never encountered any negative responses for service from the staff. I also frequent aloft in Pheonix, AZ and Arundel Mills, Hanover Maryland and the experience is consistent. Keep it up SPG!!! also love elements.", "title": "One of the WORST hotels I have ever stayed in.", "helpfulness": 1, "user": "Dreamer966", "date": "August 5, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 1.0, "value": 1.0, "service": 2.0}, "id": 116308880}], "location": {"country": "United States", "city": "Broomfield"}, "stars": 3, "variance": {"poor": 6, "average": 24, "very good": 82, "terrible": 8, "excellent": 96}, "aka": "Aloft Broomfield Denver Hotel Broomfield", "slim_ranking": 0.666666666667, "description": "Aloft Broomfield Denver is near the University of Colorado, Sun Microsystems, Interlocken Business Park, and downtown Boulder. Our hotel has 3,125+ sq ft of space for meetings/weddings"}