{"user_rating": 4.0, "review_count": 157, "name": "Aloft Green Bay", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "My wife and I stayed at Aloft for our honeymoon as we visited Green Bay for a Packers game on New Years day. We used SPG points and found this hotel to be a steal for a Category 2 Starwood hotel. The service was exceptional, as the staff provided a complimentary romance package (bottle of champagne and chocolates) as well as breakfast credits to choose from a variety of breakfast options in the lobby (healthy options available as well).", "title": "Modern and efficient with excellent service", "user": "nelboski", "date": "January 5, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 122605951}, {"rating": 3.0, "stay_parameters": "Stayed January 2012", "text": "The rooms are very modern (as the hotel is only a couple of years old) and efficiently designed to offer more than sufficient space. There are a host of amenties as well - most notably the large flatscreen TV, walk-in shower and complimentary high speed internet access. The location is ideal with a mall close by and Lambeau Field a short cab ride away.", "title": "Sleek and Minimal but thin walls...", "user": "Natalie P", "date": "January 2, 2012", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 3.0, "rooms": 3.0}, "id": 122415102}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled with friends", "text": "We didn't use the pool and exercise facility, but the exercise equipment is of excellent quality (Life Fitness) and was being utilized by other guests much of the time.", "title": "Starwood May have a Winner", "user": "UKbanker33", "date": "December 25, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 122080473}, {"rating": 5.0, "stay_parameters": "Stayed December 2011", "text": "You will certainly appreciate the modern touch and efficient design of this brand if you have not yet experienced an Aloft hotel. You will be hard pressed to find a similar hotel if staying in the Green Bay area.", "title": "Clean rooms with a European touch", "user": "Wizard113", "date": "December 18, 2011", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 121867040}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled on business", "text": "Modern sleek new hotel. The good is that the rooms have good layout for your bags. The bed is comfortable and faces a 42\" flat screen. The windows are small but tall with roll up blinds so they are either open or closed, no sheers for lettingin daylight. The room had two unupholstered chairs ..not comfortable, leaving only the bed to sit on. The bathroom has a walkin shower with frosted glass wall. If you like modern and hard surfaces you will like this place. You can bring your dog. If you dont like hearing everyone in hallway and the dog that barks at night..better to pass. The bar food also left alot to be desired. I ate some washabi peanuts that had a rancid taste to them. Also tried the chicken egg rolls that were baked and burnt.", "title": "Modern & feature-rich", "user": "davidpokey", "date": "December 17, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 121839382}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled with friends", "text": "The staff here is some of the best we have ever encountered! Always friendly and very helpful. The hotel is only a few years old so the rooms are still in great condition. I think our friends stayed in a corner room with two double beds and had a ton of extra space. We always stay in a king room and it is fine for the two of us. I will say however the doors and walls are pretty thin so game weekends can be noisy. The lighting in the bathroom could be better and a magnifying mirror would be a great help as well. The hotel is a few miles from Lambeau Field but we never had any trouble getting cabs to and from the stadium. The best part of the hotel for me are the Bliss products!! Love them!!", "title": "we stay every year for a packer game", "user": "practicingvacation", "date": "September 6, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 3.0, "value": 5.0, "service": 5.0}, "id": 117772865}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "Recetnly stayed at the aloft with my family.. the hotel is a W group hotel, and as such is more suited for adult and business travel. Though my family was comfortable, and the rooms were above reproach. The walking space was suitable, and the shower very large. I would consider the space in the lobby as a lounge, as in bar, and not very kid friendly in that regard. I will say, the pool area is in a seperate enclosed area, and there... the kids were able to be kids. So the lounge/lobby was the biggest downside of this stay. Rooms absolutely no problem. The food is all alacarte and mostly prepackaged, so no kitchen or food service to speak of.", "title": "aloft trendy vibe", "user": "fam4097", "date": "August 12, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 4.0}, "id": 116593893}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "My husband, myself, and our dog stayed at this Aloft on Friday August 5th. We thought the hotel was fabulous. We loved the way they treated our dog, from the doggie treats outside the main entrance to the \"welcome\" bag they gave her upon our arrival. We loved the hip feel of the lounge and the modern feel of our room. We wish more hotels would be like this - very nice yet very pet friendly. We will definitely be back.", "title": "Loved the Aloft - fabulous for dogs", "user": "lovewarmerweather", "date": "August 8, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116452051}, {"rating": 5.0, "stay_parameters": "Stayed August 2011", "text": "Great place to stay when in Green Bay. Lobby area has a pool table and table games available for guests for recreation. Xyz bar with drink specials every night. Great workout area. Nice pool with whirlpool. Breakfast has many choices for purchase in the morning for a grab and go breakfast. Comfortable rooms with a choice of king or two doubles. Nice flat screen tv and free wifi.", "title": "Hip, fun and trendy", "user": "PackerfanWi-Usa", "date": "August 6, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 116362492}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "Just an overnight stay before heading to the airshow in Oshkosh. Never stayed at an Aloft before and it was pretty neat. Modern, hip style with a nice pool and hottub. Free parking and no hidden fees. My wife didn't think the bed sheets were very fresh, so we asked for a new set and changed them ourselves. Other than that everything is like new and top rate.", "title": "I was impressed", "user": "Ready.Teddy", "date": "July 28, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115903485}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled on business", "text": "We have base our packers game crew here for the past three years. The staff is excellent, offering to drive us to dinner/drinks in the hotel ride ( pimped out ford fusion). The lobby is lively with free pool tables, indoor/outdoor fireplace and close to the stadium. Great choice for GB, cant beat the atmosphere and staff.", "title": "Best choice in titletown", "user": "nuggetshow", "date": "December 13, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 121687491}, {"rating": 1.0, "stay_parameters": "Stayed November 2011, traveled with friends", "text": "Arrival to the Aloft hotel was great. The reception was very nice. The initial impression of the hotel was positive. The hotel staff was friendly. We asked to make a change to the credit card that was billed. They gladly made the change. Then, we got to the actual room. refrigerator didn't work. Went to get ice in the bucket and the tongs/bucket were very dirty. Garbage hadn't been disposed of from the previous stay. Called the front desk and they came up to inspect immediately. They kindly replaced the broken refrigerator. They looked at the ice bucket/tongs/garbage and made no offer of resolution. They did however, agree that it was gross. The next day, we left in the morning (before 10am). We came back at 4pm and our room hadn't been cleaned. The hotel was sold out for the Green Bay/Vikings Monday night football game. Therefore, we thought housekeeping was busy and they'd get to our room. We came back at well after midnight and our room wasn't serviced. We were stuck with the garbage, dirty towels, and dirty ice bucket. We called for new towels and didn't receive any. We had 3 girls staying in the room. We unexpectedly found out that there wasn't an additional roll of toilet paper stocked in our room. The friendly front desk staff brought some up to us well over an hour later. The hotel price was well above any other in the area. At first, we thought it was worth it when booking. However, we regret paying the over inflated prices for such a disappointing experience. The lack of service and lack of cleanliness and lack of response is why I give this hotel a terrible rating. To add insult to injury, approximately 3 days later, we found out that the nice check-in girl that fixed our credit card issue actually didn't fix it at all. The wrong card was still charged which makes the expensing impossible for us. Afterward, I emailed the Aloft General Manager and never received a response which was also disappointing. This was my first experience with the Aloft brand and I have to say I am very disappointed in the overall experience and lack of customer service.", "title": "A myriad of issues", "helpfulness": 2, "user": "Mistyw", "date": "November 29, 2011", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 2.0, "location": 4.0}, "id": 121227275}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "This hotel is more interesting than the typical chain hotel...the decor, the amenities, and the public areas. Very modern decor. The best part about this hotel is the staff though, especially the manager, Elizabeth. We had a problem with our stay and she went out of her way to be helpful. I would have been left with very negative feelings after that visit if she hadn't done so much to 'make it right'. I wouldn't want to stay anywhere else when visiting Green Bay for those Packers games!", "title": "Modern and quirky with fabulous customer service", "user": "MomWisconsin", "date": "November 21, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 120885960}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "Myself and my husband and family went for our anniversary. The staff was great. They were very", "title": "OUR ANNIVERSARY!", "user": "MARIA K", "date": "October 26, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 119759094}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled on business", "text": "friendly. The atmosphere was very cool and inviting. You have got to try the Cucumber Collins at the WXYZ bar in the hotel. The room we had was a King bed, it was comfortable and the shower had the pumps for shampoo & body wash. That was a plus because sometimes the little bottles they give are not enough for more than 1 person. The location is great it is like 5min from a mall, restaurants and things to do. We are already planning to come back with more family members this Winter.", "title": "Nice nights stay here", "user": "2worldtravelersnj", "date": "October 25, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 119693511}, {"rating": 5.0, "stay_parameters": "Stayed October 2011", "text": "Aloft is our green bay getaway every couple months or so. It's a cool, newer hotel with a nice bar, hot tub and very decent rooms with super shower gel and shampoo. It's in a good location not too far from lambeau and right down the road from a nice mall and movie theater. Check it out, relax, and enjoy.", "title": "Always a great stay at this cool, modern hotel.", "user": "Trekkenman", "date": "October 14, 2011", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 119311190}, {"rating": 3.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "Familiarity with the W brand as well as Scandinavia's SAS brand prepares you for the Aloft. Lots of steel, glass, minimalism. Bedding was great but single sink in the bathroom was a drag. The use of curtains rather than a door over the clothes closet reminded me of a place I stayed at the Jersey Shore one summer. Great outlay of foods, snacks and fresh fruit in lobby. Watching football in the lounge was fun; could relax on comfy furniture. No restaurant on site but Regatta restaurant within walking distance, although we didn't have a good experience there but maybe you will. Now, about value: the Aloft chain is the lower priced alternative in the W chain, but when the Packers have a home game that lower price goes away and you pay, as we did, the Event price which can be comparable to the cost of a W in Seattle. But we booked late, all the other hotels were full, so we knew what we were getting into. Caters to the 25-35 crowd and the young in heart, so go, but avoid the Event price if you can! Plus, where else can you play Hungry Hippo (pink, no less) while sipping wine and looking at football!", "title": "Mixed reviews...", "user": "higham", "date": "October 8, 2011", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 119080324}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "This is our third visit to the Green Bay, Wisconsin Aloft. While my wife and I are by no means strangers to the Aloft brand, Green Bay is in particular a fun and very comfortable lodging choice. Convenient to Lambeau Field, as well as downtown Green Bay, we have also found it to be the perfect launching place for trips into Door County.", "title": "Best choice for Green Bay Area", "user": "ETMATOLA", "date": "September 12, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 5.0, "service": 5.0}, "id": 117993375}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled with friends", "text": "The rooms are comfy and fun, and the lobby with its bar are also very enjoyable. Pool/spa and fitness center are 24 hours open for adults and are both excellent.", "title": "Great Experience!", "user": "gobadgersWisconsin", "date": "September 12, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117992992}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "Next time we head for Green Bay and or Door County we will be back.", "title": "Very nice room with modern touches", "user": "JoshNeenah", "date": "September 11, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 4.0}, "id": 117955747}], "location": {"country": "United States", "city": "Green Bay"}, "stars": 3, "variance": {"poor": 8, "average": 18, "very good": 66, "terrible": 4, "excellent": 61}, "aka": "Aloft Green Bay Hotel", "slim_ranking": 0.341463414634, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "description": "The Aloft Green Bay is just minutes to Lambeau Field, home of the Green Bay Packers and the downtown scene. Close to Uof Wisc Green Bay and the Green Bay Packer Hall of Fame."}