{"user_rating": 3.5, "review_count": 264, "name": "Alpina Hotel", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "We stayed in Chamonix as part of a holiday covering parts of Italy, France and Switzerland. The Alpina was the most disappointing hotel of our trip. On arrival the overwhelming smell of air freshner alerted us to potential other difficulties. We had reserved a 'Mont Blanc' view room for ourselves and a 'Brevant' view room for our son. Both rooms were in dire need of new decor and the bathrooms were definitely in a time warp. Our balony was dirty although the view was indeed spectacular. When we asked to be moved rooms due to the condition and smell of dampnesss of the ones we were in, we were told that we were on the best floor - 5th and that we were in the best rooms they had!!! It has to be said that we have particularly high standards and if you are just looking for a hotel in the centre for town convenient for everywhere then the location is perfect.", "title": "Not for us the Alpina!", "helpfulness": 3, "user": "flubadub", "date": "July 20, 2007", "detail_rating": {"front_desk": 4.0, "service": 2.0, "cleanliness": 1.0, "value": 2.0, "rooms": 1.0, "location": 5.0}, "id": 8204532, "likes": {"liked": "— Great views", "disliked": "— Overpowering smell of either air freshner or dampness!"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled with family", "text": "We were at the Club Med 'hotel'. A lot of people were sick ('stomach flu'). I knew that I was going back to Chamonix for the Spring vaca with the kids (6 and 12 yo). I didn't want to go back to the Club Med, and I so happened to find the Alpina. I LOVED my stay there. The staff is helpful. We rented skis on the premises. The ski monitor picked up the kids at the hotel. The hotel is located in a terrific location. I went to the grocery shop below the hotel to get our lunch...ate in the room. There is a beautiful balcony. As for their restaurant... we had ostrich, kangaroo for the first time in our lives. My kids LOVED it (I believe it's their regular menu... fondue). If you go, go to the Albert Hameau restaurant 'bistro'... the name escapes me. I went with 2 children and they also loved it (and a lot cheaper than the 'real' thing. The service was excellent. I'm surprised that this hotel isn't rated higher than it is. Yes, the bathrooms are remenscent of my youth (70's)... but the room is really clean. Loved it!!! The massage therapist, at the Alpina, was wonderful.", "title": "LOVED the Alpina", "user": "expatsonthego", "date": "April 22, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7414866, "likes": {"liked": "— location, staff, food at hotel", "disliked": "— bathroom needs updating-although very clean"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "We booked to stay at the Alpina Hotel through the Chamonix website at the midweek special rate. For what we paid, we received excellent value for money. The hotel has recently had the exterior, restaurant and reception updated which gave the hotel a four star feel, however, the rooms showed signs of requiring an upgrade themselves (dated bathroom decor; tired looking carpets and paintwork).", "title": "Location, location, location", "helpfulness": 1, "user": "B&OSA", "date": "March 12, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 2.0, "value": 4.0, "rooms": 3.0, "location": 5.0}, "id": 7148747, "likes": {"liked": "— Location and on site services offerred", "disliked": "— Dated decor and smoke smell in room"}}], "location": {"country": "France", "region": "Rhone-Alpes", "continent": "Europe"}, "stars": 3, "variance": {"poor": 35, "average": 75, "very good": 101, "terrible": 15, "excellent": 38}, "aka": "Alpina Hotel Chamonix", "slim_ranking": 0.519480519481}