{"user_rating": 4.5, "review_count": 106, "name": "Altfrankische Weinstube", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "There is no doubt this guesthouse is full of charm. It's kitschy while still being modern as the bathrooms looked recently redone and came with a hairdryer. The breakfast was lovely and typical of what you get in Europe - yogurt, sliced deli meats and cheese, breads, spreads, hard boiled egg, juice, coffee, tea, fruit. My only complaint but enough for me to not stay again was that because there is a restaurant on the ground (first floor for Americans) floor you could smell the cigarette smoke seep up into the bedroom, which for us was room3 on the 2nd (3rd) floor. It was enough to wake me up and jag a bit in the middle of the night. We did not hear any noise, however. All other things considered, it was pleasant.", "title": "Charming guest house in great location", "user": "Sushi", "date": "January 2, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 52398401}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "This was our first trip to Germany, and following Rick Steve's guidelines (not to mention the on-line photo of the inn), we booked our only night in Rothenburg at the Altfrankische. It did not disappoint - our room was lovely, with window boxes filled with flowers overlooking the road, the outdoor \"courtyard\" perfect for drinking a beer in the late afternoon, and our dinner was simply wonderful. Breakfast by candlelight was such a treat - and so what if Mario isn't a laugh a minute - the man is busy running a first-rate inn! We will absolutely stay there again (note the last name, Franken).", "title": "Just perfect!!", "user": "IowaTori", "date": "September 30, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 3.0, "service": 4.0, "rooms": 4.0}, "id": 45543941}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "This hotel was a real treat to stay in. I wish we could have stayed longer. Rick Steves described it as having a \"Lord of the Rings\" feel and that description was so appropriate! It is quaint and cozy and charming. The staff was very hospitable and even though most said they spoke no english, we found that they could speak some. My husband left his phone charger in the room when we checked out and when we called from our next destination to ask if they could send it to our current hotel, they not only had it sent to us within 2 days, but they didn't charge us a cent and also sent a little thank you note and a postcard with it! Wow! Rothenburg is so awesome and if you go you should definitely try to get a room at this hotel. The breakfast buffet is included with the price and was very nice too. I love German hospitality!", "title": "Charming little hotel", "user": "Poundcake652", "date": "April 15, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 28085964}, {"rating": 4.0, "stay_parameters": "Stayed February 2009, traveled with family", "text": "We stayed for just one night while we were on our way from Denmark to Austria for our skiing holiday. We were six people - our family of four and my parents. My parents had a double room, we had a triple room (one of our kids slept in our double bed). The rooms and the place itself are fantastic - really old and quaint and full of funny and interesting objects. We had dinner in the bar/restaurant that night - it was OK and quite cheap, although not exactly haute cuisine. No deserts were available and there was no children's menu either. But it was OK for us for the one night. The restaurant is also very quaint and lovely. Breakfast next morning in the breakfast room was nice - again the room was great and full of old stuff - lots to look at! One of the female staff was not particularly friendly, but it didn't ruin our stay. Rothenburg ob der Tauber and Altfrankischer Weinstube is well worth a visit.", "title": "Lovely rooms - exceptionally quaint!", "user": "Froggy2Denmark", "date": "March 1, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 3.0, "rooms": 5.0}, "id": 25399291}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "What a fantastic little place. It's like staying in another time. We kept expecting hobbits to come through the door! The hosts were wonderful and our room was beautiful. It had a 4-Poster bed and had views of the cathedral from the windows with nice flower boxes framing them.", "title": "Awesome!", "helpfulness": 1, "user": "patmania", "date": "October 22, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 21100984, "likes": {"liked": "— Everything"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "This place is charming, packed full of character and in a great location. From the moment you step inside, your senses are overloaded with things to look at. The owners were friendly, helpful and the food (we had dinner here as well as breakfast) was very good too. We've got very happy memories of our stay here and only wished we had stayed for 2 nights!", "title": "Lovely and jam-packed with character", "user": "katherinious", "date": "July 31, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 4.0}, "id": 116075725}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "Good hotel with plenty of atmosphere. Inside the town wall and a 5 minute walk from the center of town. Definitely not a new hotel, but the plumbing was new and the beds comfortable. Great food, especially for dinner. The staff was competent but left you pretty much to yourself. Available when needed. Finding it was a bit difficult but parking was available close by. There were stairs that got narrower as you went up the floors. Would definitely return.", "title": "Great place -- quirky - like the Hobbit town", "user": "cahowatt", "date": "July 4, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 4.0, "service": 3.0}, "id": 115026005}, {"rating": 3.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "Stayed here for 2 nights. Room was comfortable and clean with a slightly old-fashioned country feel to it.Free internet access was available. Parking was a problem and the owner ended up having to move his own car in order for us to park. Ate in the restaurant the first evening - a pleasant enough meal with local dishes and a good value wine list. We wanted to eat there the second night too but it was full due to \"The English Speaking Club\" they hold there on a Wed evening - no-one had bothered to inform us about this so we could reserve a table.Credit cards were not accepted either, despite what it says on the booking form, and we only discovered this via a postcard stuck on the wall of our room. Our room was situated at the front of the hotel and I'm afraid the smell of cigarette smoke drifting up from outside became quite overpowering, especially on the Wed evening when the restaurant was full. The building has a great deal of character but overall, we were disappointed.", "title": "Quirky but unfriendly staff", "helpfulness": 1, "user": "caddy54", "date": "June 24, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 3.0, "value": 3.0, "service": 2.0}, "id": 114712324}, {"rating": 5.0, "stay_parameters": "Stayed June 2011", "text": "We were wonderfully surprised by this quaint, quiet, lovely hotel in Rothenburg! We were traveling with our 3 adult children and booked two rooms. Both were wonderfully decorated, comfortable and clean. Our best surprise was the delightful dinner that we enjoyed after our Nightwatchman Tour (also a must). I would definitely recommend this hotel to anyone traveling to Rothenburg ob der Tauber.", "title": "Wonderful find!", "user": "Drod1963", "date": "June 14, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 113437289}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "Very nice hotel with unique atmosphere. We stayed in a suite decorated with antique furniture.", "title": "great experience", "user": "igof", "date": "May 3, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 106751180}, {"rating": 4.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "My husband and I stayed here for one night. When we first arrived to the hotel, we found it difficult to check in at first. We couldn't find anyone that worked there! We waited for several minutes, because we weren't sure what we were supposed to do (there weren't any signs). We decided to walk up the stairs to try to find someone. Finally, we found a woman that guided us to our room. We were impressed by the room. It was comfortable and elegant. Our bathroom was really clean and nice as well. The hotel is near St. Jakob's Church, and a few blocks away from the main square. The price was decent and included a breakfast, that had a pretty good selection. We had read, prior to our stay, that there was supposed to be free wi-fi at the hotel. Later in the evening, we tried to access it, but it required a password. We tried to find someone to ask for it, but the only workers we found were busy running dinner, so we didn't bother them. It would've been nice to have more information about it in our room. The staff seemed nice, but they could've been friendlier and more helpful.", "title": "Nice, cozy hotel", "user": "excitedtraveller23", "date": "June 28, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 68948301}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "So many people in Munich told us we had to go to Rothenburg that we changed plans and spent a night here. They also told us about how great this place was. They were right on both points. The town has such a medival feel to it...especially after dark when 99% of the tourists leave. Take the tour with the night watchman and then come back to a great dinner downstairs from your room. The owners ar real nice and understand enough english for things to work out. The rate at this place was the best we had in our 2 weeks in Italy and Germany.", "title": "Great old world place!", "helpfulness": 1, "user": "TomD56", "date": "June 24, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 68541827}, {"rating": 4.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "This is a really interesting place-- it's tiny and dark, but the rooms are comfortable and it's a great location. The dinners are really good, and you can stay up late drinking wine outside which is fun. If you're really tall or have trouble in tight spaces, this might not be your best bet but otherwise it's a good place. Be sure to bring a copy of your reservation with you.", "title": "Nice place to stay in Rothernberg.", "user": "Staying_in_Europe", "date": "June 22, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 68350005}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "An excellent place to stay in Rothenburg. A very clean and comfortable inn with lots of atmosphere. We arrived later than expected (about midnight) and had a tough time finding the inn in this old city even with a gps. We must have been seen by the owner because as we were stopped trying to find our way, someone drove up and asked if we were looking for the inn. He let us follow him. When we got there Mario gave us our room and looked for a place for me to park in this crowded middle ages city. After we got settled, he offered us a couple of drinks and some snacks in his pub. It was well appreciated after a long day of sight-seeing and driving.The room was very clean and comfortable. Breakfast was included.", "title": "Great hospitality by Mario", "helpfulness": 1, "user": "chuckjet", "date": "May 25, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 65324343}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "Great location, nice rooms, beautiful decor, good food, excellent price, and within walking distance to everything! What more could you ask for?!?! As for the two poor reviews on this site. I've really gotta ask myself what kind of places these people normally stay at. By far the best place we have ever stayed at periord!", "title": "Loved, Loved, Loved it!", "user": "Eavabug", "date": "January 9, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 53060083}, {"rating": 5.0, "stay_parameters": "Stayed March 2011", "text": "Gorgeous. The hotel wonderful. It looks like a house fairytale of brothers Grimm. The restaurant is fantastic, same spectacular atmosphere with great cookin and perfect services. The town is wonderful. I will come back for sure.", "title": "Spectacular", "user": "Bogdan1480", "date": "March 19, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 100757295}, {"rating": 3.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "We liked the location and the house and the food was good too apart from tinned fruit at breakfast. However the customer service was poor with surliness and a take it or leave it attitude. No help in carrying luggage up precipitous flights of stairs, no informing that you had to make a reservation for an evening meal (house guests are not guaranteed a table) and \"sit down here or you cannot eat\" despite the fact that German friends had reserved a table. We liked talking to the regulars at the weekly English conversation club. Pity about the customer service overall.", "title": "Quaint but with good food but poor customer service", "user": "g_headworth", "date": "October 11, 2010", "detail_rating": {"service": 2.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 82957000}, {"rating": 5.0, "stay_parameters": "Stayed August 2010", "text": "My husband and I only had the pleasure of staying here one night and we wished we had two! Room was clean and bathroom was good. The tub had only a handheld shower but this was not a problem. Bathroom was clean and modern enough. The owner allowed us to drop off our backpacks before the room was ready which was a big help! Also, we had an early train to catch the next morning. They had breakfast prepared extra early with coffee waiting before we left. Great service! If you stay here make sure to have dinner in the restaurant. The food was excellent and was one of our favorite meals in Germany. The atmosphere was unforgettable! Dine early because the restaurant gets crowded in the evening. Overall, a wonderful experience not to be forgotten.", "title": "Wonderful medieval experience!", "helpfulness": 1, "user": "sroark", "date": "October 10, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 82871961}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "We found this lovely little (6 rooms?) inn thanks to Rick Steves and Lonely Planet. We stayed for five nights to explore town and the region (we had a car, easy to park just outside the city walls - 5 minute walk to hotel). We loved the overall ambiance of the main rooms downstairs. While our room (#1) had a few too many 'cute' dolls for our 12-year old's sophisticated tastes - the overall feel was charming. I should have asked ahead of time about bathroom - ours had a 'sh-ub' as we call it - a big tub with a hand-held shower handle - we would have preferred a stand-up shower - but the room otherwise was fantastic. The area is very quiet - off the beaten path most of the time (the occasional tour group rolls by on their way to the nearby museum). The restaurant was quite popular so it's good to make reservations even if you're staying there - so you get a table you want. The breakfast room itself was worth the trip - great decor and really generous spread. And FYI - cash only so be sure and hit the ATM before you go!", "title": "Romantic inn and resturant away from the crowds/tourists", "helpfulness": 1, "user": "FoiledSeattle", "date": "August 22, 2010", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 76374751}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "We absolutely loved our two nights at this hotel. We actually stayed in the guesthouse, just a stone's throw away but ate breakfast every morning at the Altfrankische. The guesthouse has been thoroughly updated, had two darling rooms, and after spending the previous ten days traveling and staying in hotel rooms it was nice not to be tripping over our luggage and having a wonderful sofa to stretch out and read on! I would stay there again if I'm lucky enough to return to Rothenburg ODT.", "title": "charming atmosphere", "helpfulness": 1, "user": "TravelTwist", "date": "August 9, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 74488321}], "location": {"country": "Germany", "continent": "Europe"}, "variance": {"poor": 4, "average": 11, "very good": 29, "terrible": 1, "excellent": 61}, "aka": "Altfrankische Weinstube Hotel Rothenburg Ob Der Tauber", "slim_ranking": 0.244444444444}