{"user_rating": 4.5, "review_count": 1280, "name": "Amalfi Hotel Chicago", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed October 2007, traveled on business", "text": "I stayed at the Amalfi for three nights while attending a conference in Chicago. It was recommended to me by a colleague, so I thought I would give it a try.", "title": "Good Price, but some drawbacks", "helpfulness": 2, "user": "tinkin3", "date": "November 2, 2007", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 2.0}, "id": 10546445, "likes": {"liked": "— Location", "disliked": "— Small cramped room"}}, {"rating": 1.0, "stay_parameters": "Stayed October 2007", "text": "The staff are all quite pleasant, and room was very clean. The room was quite small, though. I was in a corner room, and it didn't seem to be well though-out when designed. There is a very long hallway, with the bathroom attached, and then the room. The design of the room makes it very tight for walking around the furniture. The bathroom, although poorly lit, was wonderful though. The shower has a dual head and was like heaven. But, the bed could have been more comfortable.", "title": "bed bugs in room #607", "helpfulness": 7, "user": "TravelNonstop", "date": "October 30, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 1.0, "value": 3.0, "location": 4.0, "rooms": 1.0}, "id": 10451816}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled on business", "text": "The hotel boasts free breakfast and daily happy hour. In truth, the breakfast is just baked goods and coffee. There was a small bowl of fruit, but that's all. And the happy hour was not in a \"lounge\" but rather a small, dark room, and the bartenders were not very friendly. I took my drink back to my room.", "title": "Bang On Value For Money, Excellent", "helpfulness": 1, "user": "orangejumper", "date": "October 30, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 10443953, "likes": {"liked": "— Location", "disliked": "— the breakfast buffet, but it was still ok++"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled with family", "text": "The one thing that realoly bothered me was the air in the room. It NEVER shuts off. If you turn the thermostat down, it gets too cold, and if you turn it up, it gets to stuffy. So, I finally just flipped the switch to turn it completely off. It got a little chilly at night, but it was worth it.", "title": "Love the Amalfi, but the happy hour bartenders need a lesson in manners", "helpfulness": 4, "user": "Haggisfortea", "date": "October 10, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 10064364}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "The staff was accomodating, though. I needed to check out a day early, and they were OK with that - no penalty, which was surprising. The hotel is conveniently located, but there is major construction going on all around it, so it can be a bit noisy. All in all, it wasn't a bad stay - but I'm not sure it was nice enough for me to go back.", "title": "A classy choice I'd return to", "helpfulness": 1, "user": "comowhat54", "date": "October 2, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 10033180}, {"rating": 5.0, "title": "GREAT HOTEL, GREAT LOCATION", "text": "Excellent hotel and location. Daily breakfast buffet located on each floor was great. Only 2 blocks to Michigan ave and can walk to Navy pier. Free trolley is avaliable about a block from hotel to all atttractions. Aquarium was fun for whole family. River tour is a must -- takes you on Chicago river and then out onto the Lake.", "user": "katciampi", "date": "August 27, 2007", "id": 8515949}, {"rating": 4.0, "title": "Chicago Touring", "text": "My wife and I have visited Chicago on business a number of times, but never as tourists. We stayed at the Amalfi, downtown, where we were very close to just about everything: Food, entertainment, museums and other sites of interest. The Amalfi' s service was excellent and the room was clean and comfortable.", "user": "trivialpursuit", "date": "August 25, 2007", "id": 8502430}, {"rating": 5.0, "title": "Wonderful Place", "text": "The complimentary Continental breakfast served daily was a great start to our day of adventures in touring a great town. We'll be back!", "user": "jennydct", "date": "August 21, 2007", "id": 8463866}, {"rating": 3.0, "title": "Great Hotel - Good Price Value in Chicago", "text": "We stayed four nights and were impressed by the quality of service, at a reasonable rate. The staff were extremely courteous. The room was on the smaller side, but with very nice amenities (comfortable bed, soft towels, turn-down service). They had a huge FREE breakfast and coffee-tea service each morning on every floor. The coffee and pastries were delicious. The location was great for the main attractions. We will def. stay at this hotel again!", "user": "pittston", "date": "August 12, 2007", "id": 8399679}, {"rating": 4.0, "title": "Nice hotel", "text": "For inner city Chicago this Expedia special price was very good. The rooms are VERY small and cramped with the TV/Bar literally 10\" away from the bed. The wired internet service is tremendous though. The hotel is running low prices because it is in a major construction area. Each morning the workers right outside my window started at 6AM and WOW what a racket they make. The manager's nightly reception is easily the worst I have witnessed in Chicago. I asked for a refrigerator and microwave which was added to my room at no cost. The fridge is barely large enough to hold a small bottle of milk at one setting - FREEZE! Try pouring frozen milk on your breakfast cereal in the morning. The hotel is conveniently located though and I may stay here again depending upon the prices of other local hotels. In my opinion, Amalfi will need to keep their prices lower than $150 per night to maintain a steady client base.", "user": "Nathalie D", "date": "August 9, 2007", "id": 8380936}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "Beautiful hotel in a beautiful city. Located in busy downtown but it felt very private and secluded.", "title": "Romantic Escape", "user": "Katsuko", "date": "February 7, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 55417555}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "My second visit to Chicago with my boy friend. I got a great deal and it included parking. Walked a few blocks to Shops at North Bridge, so great location. We only stayed for a night as we were on our way west. I had booked a corner king room but upon arriving was informed that there were no more corner rooms and got upgraded to a suite automatically. Kudos to all staff - very friendly, helpful and discreet. The amenities like the breakfast and cocktails in the evening are also very nice.", "title": "Excellent Location for Shopping", "user": "GolfGuyLouisiana", "date": "February 1, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 54966801}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled on business", "text": "I would definitely stay at this hotel again - great staff, great location, great rooms - what more is needed?", "title": "Very cool hotel - great location and value for downtown Chicago", "user": "laketravishill", "date": "January 29, 2010", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 54666359}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled on business", "text": "This was out 4th trip to Chicago. My wife and I take annual shopping \"Pilgrimages\". The Amalfi is situated in an extraordinary locaion for walking, shopping, etc. The Chicago iver basically splits the pedestrian area in two; North and South River areas. The Amalfi is located one block north of the river and 3 blocks West. Donald Trump's new hotel tower is next door. A botique hotel, the Amalfi is not a part spot. No lobby bar, Starbucks or Ruth's Chris. However, all this is a 2 minute walk away. Baseball famed announcer Harry Cary's Restaurant is across the street. Great bar and steaks. Hotel rooom service actually comes from there. The happy hour is smal but quaint. It is in a converted room on the 6th floor. There are 2 types of beer and Amalfitinis; served in masse. Dont ask for an extra shot. The Amalfitinis are tasty but lacking in vodka. The light snacks are Italian (as is the bottle beer). The am breakfast is typically European; breads, jams, juices, etc. Hint...the hotel executive offices are located on the 4th floor; so...the breakfast on that floor is the last to be picked up. Each floor has its own breakfast at the elevator area. If you stay on the 3rd or lower floors, expect no view. We selected a corner room and paid $10 bucks extra per night. We has 30 linear feet of windows and a view of Trump Tower.", "title": "You definitely want to stay here!!!", "user": "charliesmyangel", "date": "January 27, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 54523710}, {"rating": 4.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "The room was extremely comfortable. Bathroom was great. Flatscreen TV was nice. I pod docking station next to bed. Work desk with nice carpets and bedding. I will stay again. Wi F throughout. Noisy garbage pick up in the am", "title": "Great deal on a good hotel", "helpfulness": 1, "user": "Lucyinthesky11", "date": "January 21, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 54038588}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled on business", "text": "I stayed at this hotel while I was attending a medical conference.", "title": "A strange but perfect hotel", "helpfulness": 4, "user": "screenname060309", "date": "December 7, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 11312564, "likes": {"liked": "— wireless internet", "disliked": "— lack of safe boxes in the rooms"}}, {"rating": 5.0, "title": "The Most Impressive and Unique Hotel Experience", "text": "The hotel was nearly perfect and though I generally try to stay at different hotels, this hotel was so nice that I definitely consider going back.", "helpfulness": 3, "user": "pineapple1212", "date": "November 26, 2007", "id": 11085269}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled solo", "text": "It has a very small gym. It was quite adequate and not busy at all.", "title": "A Hip Place in the Loop", "helpfulness": 1, "user": "BrynMawrBK", "date": "November 13, 2007", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 2.0}, "id": 10807000, "likes": {"liked": "— The convivial atmosphere and complimentary food and beverages", "disliked": "— The street where it is located"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled with friends", "text": "Breakfast is served at each floor separately. Some might not like the fact they had to take the breakfast back to their rooms but I did not mind it. The breakfast consisted of seasonal fruits like apples, pears, oranges and occasionally bananas all of good quality. Small jars of jam, a lot of different pastry and small boxes of Philladelphia cheese. No warm food was offered.", "title": "Great weekend at the Amalfi Hotel", "helpfulness": 1, "user": "k8soda", "date": "November 13, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 10794355, "likes": {"liked": "— Comfort, ammenities"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "Remembering that American hotels usually don't provide any breakfast included in the price this menu was allright.", "title": "Great place, excellent location, smashing cocktail...", "helpfulness": 3, "user": "Niall", "date": "November 5, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 10626492, "likes": {"liked": "— Proximity to everything, and the extras provided.", "disliked": "— Noisey building site across road, not hotels fault though"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "We booked this based on other reviews and were very happy with our decision. It is close enough to walk to Michigan Ave and most of the restaurants around there, but also only a block or two from the river, which is nice if you are wanting to walk to Millenium Park or the Loop area. The room was comfortable and spacious, the breakfast was very nice and the evening cocktail reception was outstanding. I'm still dreaming of their signature drink the 'Sorrento Sunset'. Mmmmm.", "title": "A great place to stay!", "user": "kfio", "date": "March 22, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 59254599}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled with friends", "text": "We were there for the weekend and got the 1-day bus/train pass on the day we knew we wanted to go far around the city - it was such a deal...$5.50pp, I think. The hotel is in-between two train stops on the brown and red lines. You can only get the 1 day pass at certain places and the closet place to the hotel was the Jewel-Osco on State St. We would also recommend drinks or lunch on the John Hancock tower. As long as you are eating/drinking up there (Signature Room on the 95th or 96th floors) it is free to get up. I think it is about $15pp at both the Hancock building and Willis tower to get up to the observation decks, so at least with the Signature Room you are getting food or drink in return for the money you spend.", "title": "UNIQUE, PERFECT LOCATION, GREAT HOTEL", "user": "irisheyes078", "date": "March 15, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 58652514}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled on business", "text": "Recently stayed at the Amalfi for the St. Patrick's Day weekend events and couldn't have been happier with the amenities, location, and staff. Our car was quickly valeted, room made available hours before check in, of course we could walk everywhere, and morning buffet station on our floor with great coffee and crossaints. I would come again for sure.", "title": "Great Hotel, Great Location", "user": "PeterUlffers", "date": "March 6, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 57873372}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled with family", "text": "This is a fantastic hotel. Great staff and amenities. Two blocks from the State/Lake \"L\" stop. Half-a-block from Harry Caray's and the House of Blues and walking distance from some of the best restaurants in Chicago. I will definitely return to the Amalfi Hotel and have already recommended it to friends headed to Chicago in the near future.", "title": "Good Things Come In Small Packages!", "user": "usafanScotland", "date": "March 3, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 57627165}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "This lovely hotel has only six floors, making it easy to get to elevators and down to reception. The building is dwarfed amongst all the skyscrapers around it. Trump's huge new tower is just down the street. The Amalfi looks recently refurbished, very modern, but warm and inviting. Bedrooms quite spacious with lovely linens and very, very comfortable beds. Bathroom quite small but roomy enough, with Aveda tolietries and constant hot water in the showers. Continental style breakfast is set out fresh every morning in front of the elevator of every floor. Great to stumble out of bed and grab a coffee etc (robes & slippers provided) without having to get dressed for a formal breakfast. Really enjoyed the Managers evening cocktail reception, especially the Amalfitinis. A nice way to relax after a hard days' shopping! Location is great for all the shops, transport, museums etc. Easy walking to everywhere. Staff also very friendly and welcoming. Would definately stay there again.", "title": "Great Hotel in a great city (I'll be back)", "user": "KEITHCOTTER", "date": "February 19, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 56469044}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled with friends", "text": "Spent a wonderful night at the Amalfi with friends. The evening reception was very nice and the staff was very attentive. Breakfast was a plus, rooms were cozy and very clean. Would not hesitate to go back again.", "title": "Fabulous Visit", "helpfulness": 1, "user": "Patti0", "date": "January 21, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 54024441}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled on business", "text": "I decided to book at the Amalfi after cancelling a reservation for a different hotel after reading their reviews on TA. I was blown away by the reviews for the Amalfi on TA and decided to check it out. I was able to secure a great price on the hotel room and I was not disappointed. I asked to be put in a quiet room because I was having an interview the next day. The room was very quiet and in a great location, but my only complaint was that it was right next to the fitness center and I could hear people running on the treadmill during the day. However, it quieted down at night and I could not hear anything. The rooms were enormous for Chicago and I was pleased!!!", "title": "Best Hotel I have EVER stayed in", "helpfulness": 1, "user": "L2pst2cK", "date": "January 13, 2010", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 53405342}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled with friends", "text": "The hotel provided free breakfast which was good, free internet, and free gym access. The hotel is only a few blocks from the Magnificient Mile and I walked there everyday to do shopping. I have to say that the doorman is truly a gem and is very friendly. I wish that their front desk staff were as friendly as he was.", "title": "Chicagos best hotel", "helpfulness": 1, "user": "tmkixa", "date": "January 12, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 53296261}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "All in all, I plan to stay at the Amalfi anytime I visit Chicago in the future.", "title": "great Chicago hotel - breakfast and free cocktails are a nice touch", "helpfulness": 1, "user": "Kstearn", "date": "January 7, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 52842766}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled with family", "text": "We have been to Chicago 5-6 times in the last 18 months. The people at The Amalifi", "title": "OUTSTANDING VISIT, GREAT TIME", "user": "bearman_10", "date": "January 4, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 52596969}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled with friends", "text": "Myself and two other friends stayed at the Amalfi Hotel for the last week and August.", "title": "Amalfi: amazing exeprience", "helpfulness": 1, "user": "planehopper", "date": "September 29, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 10017987, "likes": {"liked": "— location, comfort", "disliked": "— views."}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled with friends", "text": "I must say this was an excellent stay and the service was above par. I cannot rave enough about the excellence and quality this hotel boasts.", "title": "Great service and great location!", "helpfulness": 1, "user": "jrks", "date": "September 22, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 8850912, "likes": {"liked": "— Location, service, comfort"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "The check in was quick and painless, we arrived at 10 am and were allowed to go to our room right away!", "title": "LOved the Amalfi", "helpfulness": 1, "user": "Gerry94", "date": "September 17, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 8736627, "likes": {"liked": "— Location,cleanliness, friendliness", "disliked": "— Little more light needed in bathroom"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "There are DVD's to borrow from the lobby if you want to watch something in particular.", "title": "Great Hotel in Excellent Location", "helpfulness": 2, "user": "koolchas", "date": "September 9, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8681569, "likes": {"liked": "— Location and the extra services provided such as breakfast which made for a good price vs. value.", "disliked": "— views."}}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "The hotel is VERY chic and trendy. Definitely a higher end boutique hotel.", "title": "Great hotel; perfect location", "helpfulness": 2, "user": "buckysmom", "date": "September 9, 2007", "detail_rating": {"cleanliness": 4.0, "front_desk": 4.0, "location": 5.0, "value": 5.0, "rooms": 4.0}, "id": 8680547, "likes": {"liked": "— Location; boutique feel", "disliked": "— Can't think of anything"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled with family", "text": "First stay at the Amalfi, certainly, not the last....traveled with my daughter, sister-in-laws and their daughters and a friend for an after Christmas shopping/tourist trip. From the minute we walked thru the door to the final hailing of a larger taxi from quite a distance, we were met with attentive, friendly and knowledgable staff.", "title": "One word - FABULOUS", "user": "whiteskunk", "date": "January 3, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 52476220}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled on business", "text": "The price was more than reasonable & when you factor in the excellent continental breakfast that is right on your floor and the cocktail hour, it's a steal.", "title": "PERFECT", "user": "Manthosn", "date": "January 2, 2010", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 52374995}, {"rating": 4.0, "title": "Great Location", "text": "Location is perfect. Close to all shopping, train/bus stations and within reasonable walking distance of many popular sites.", "user": "mariec1983", "date": "December 30, 2009", "id": 52180713}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "Cleanliness is a priority in returning to a hotel, and again, this was top-notch.", "title": "nice little place in the city", "user": "dale3", "date": "December 21, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 51620426}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled with family", "text": "There were many features to the hotel we did not take advantage of - fitness & business end; but I would be quite confident that all aspects of anyone's stay would be excellent.", "title": "Upscale boutique hotel with mid-west courtesy and friendliness!", "user": "happyg9", "date": "December 20, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 51566618}], "location": {"country": "United States", "city": "Chicago"}, "stars": 3.5, "variance": {"poor": 23, "average": 86, "very good": 352, "terrible": 11, "excellent": 808}, "aka": "Chicago Amalfi Hotel", "slim_ranking": 0.10843373494, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "A stylish boutique property located in downtown Chicago, the Amalfi Hotel Chicago offers a unique hotel experience for both leisure and business travelers. Conveniently situated in the heart of the city’s fashionable River North neighborhood, the hotel ensures that guests are at the center of everything. Its ideal location is within walking distance to the Magnificent Mile, Willis Tower, Millennium Park, Navy Pier, Loop (financial and theatre districts), museums, attractions and River North nightlife."}