{"user_rating": 3.5, "review_count": 141, "name": "Amazon Eco Park Jungle Lodge", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed September 2006, traveled with friends", "text": "The Amazon eco lodge is close to Manaus but you wouldn't know it until you leave the lodge to take the trip to the meeting of the waters. We did the three day package and enjoyed all of the planned activities in the company of our excellent guide, Yury, and opportunities to relax in the natural swimming pools.", "title": "Breakfast with the birds", "helpfulness": 3, "user": "eiluvtravel", "date": "October 10, 2006", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "location": 5.0}, "id": 5935658, "likes": {"liked": "— location - quiet but close to airport", "disliked": "— outside of the resort we thought the amazon overly tourist oriented"}}, {"rating": 1.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "Don't expect to be able to wander off into the jungle on your own as there are no marked paths.", "title": "You will not get a room in the jungle, you will get the jungle in the room", "helpfulness": 7, "user": "Maribel_Hernandez", "date": "September 30, 2006", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "location": 1.0, "rooms": 1.0}, "id": 5894587, "likes": {"liked": "— Nothing", "disliked": "— Everything"}}, {"rating": 2.0, "title": "Different holiday experience", "text": "Jungle walk, caiman spotting at night, piranha fishing and a visit to the monkey sanctuary are all close to the lodge. They were very open about the local village experience having been created for tourists, claiming it was a chance for us to experience how people lived deeper in the jungle.", "helpfulness": 15, "user": "792Carol_H", "date": "March 18, 2006", "id": 4691105}, {"rating": 4.0, "title": "I always stay here when I am in the Amazon Rain forest", "text": "I'd rate accomodation as three star jungle experience. Small, basic, rustic rooms, not a lot of light, but comfortable and clean. Ours smelled a bit damp but the only wildlife we encountered was a tiny frog in the shower. The restaurant was fine - you share it with resident macau and parrots. There is a small bar near reception. Beer and caiparhinas are reasonably priced but don't order wine. The most expensive glass of wine we encountered throughout our trip, and not particularly good.", "helpfulness": 28, "user": "Tastydogs", "date": "December 9, 2005", "id": 4229355}], "location": {"country": "Brazil", "continent": "South America"}, "stars": 3, "variance": {"poor": 12, "average": 31, "very good": 56, "terrible": 9, "excellent": 33}, "aka": "Amazon Eco Park Jungle Hotel Amazon River", "slim_ranking": 0.4}