{"user_rating": 4.0, "review_count": 193, "name": "Ambassador Hotel", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed December 2010", "text": "A comfortable hotel with excellent food. We stayed as part of a tour, the service was fantastic and everything was spotless. The room was large though lighting poor and furnishings dated. Very close to both centre of Brig and station. We would definitely return.", "title": "Thoroughly enjoyable", "user": "UKBells", "date": "January 4, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 91723166}, {"rating": 4.0, "stay_parameters": "Stayed December 2010", "text": "Close to the station, yet very quiet. Helpful, friendly staff. Excellent food. Rooms on the small side, but perfectly clean and great shower!", "title": "Friendly hotel with excellent food", "user": "HdL2010", "date": "December 30, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 91078137}, {"rating": 4.0, "stay_parameters": "Stayed December 2010", "text": "We stayed 5 nights as part of a tour group.Everything was ready for our arrival.The bedrooms were clean & comfortable.The staff were helpful.The breakfast was an extensive buffet.The dinners were excellent.We would return.", "title": "Convenient location,excellent service,good food.", "user": "IdSouthYorks", "date": "December 29, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 90981869}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled with family", "text": "Brig and this hotel--2 blocks from station--are well located for enjoying SW Switzerland. By rail and bus you can enjoy the whole area easily from here. This hotel is excellent and has kept the railroading motif in the main, bar, and dining areas. Especially note the \"tile\" posters, wall sconces and ceiling glass in the brasserie--eat here!! Do not overlook the brasserie--gourmet dining after a day of exploring--repeat, eat here and enjoy. Friendly and courteous staff. My only recommendation would be for the hotel to offer free Wi-Fi as that seems to be more common now.", "title": "Good location, hotel; the dining room/Brasserie is outstanding", "user": "wsxedc", "date": "November 5, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 86075421}, {"rating": 2.0, "stay_parameters": "Stayed October 2010, traveled with friends", "text": "Because my favourite place to sleep in Brig (the Good Night Inn: no frills but comfortable, efficient, clean, bright and excellent value for money) was fully booked I stayed for one night at the Ambassador Hotel. I choose it because it is rated #1 in Brig by tripadvisor.", "title": "faded charms of the 80s - or even 70s?", "helpfulness": 2, "user": "Gaydoc", "date": "October 10, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 82852973}, {"rating": 4.0, "title": "Good hotel but with some daft charges", "text": "Chose this hotel because we needed secure parking and easy access to the City. This hotel has an underground free car park. Access to Berne is by a tram that stops outside the hotel and takes about 10 mins. Hotel rooms are modern and a good size. Now for the daft stuff: WiFi is free but via an annoying 3rd party provider that drops the signal ever time you switch off meaning you have to keep logging back in. Choose wired access and they'll rob you blind! Breakfast is CHF6.50 for juice, coffee, cold meats, cheeses and bread. Add something hot and it leaps to CHF22 !! Reception very helpful & friendly. Overall I'm happy with this hotel as it worked great for our 1 night sightseeing trip to Berne.", "helpfulness": 1, "user": "Tickandbash", "date": "July 14, 2012", "id": 134326229}, {"rating": 3.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "On the whole, I was very disappointed as the Hotel I saw on the internet was different from what I came in contact with. Is this not daylight robbery? I would rather prefer to see current pictures than something deceiving. I drove past the hotel as the picture in mind was different from what was seen. The SPA was great to use, the cook at the Japanese Restaurant was a funny guy, breakfast wasn't the American Breakfast I was expecting. Service wasn't the best but average as the few words exchanged was enough. Location is great depending on what one is in Bern for, as there is a street train right in front of the hotel. Parking was free, which I really must give credit to the management. I had a great view to the old town and a very descent quiet hotel.", "title": "Not for the second time...", "helpfulness": 1, "user": "Muguyaro", "date": "April 13, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 127822974}, {"rating": 3.0, "stay_parameters": "Stayed April 2012, traveled on business", "text": "The hotel is rather average. The pics on the website make it look better than it actually does when you see it for yourself.", "title": "Hotel looks better in the pics than it does in real life", "user": "Happy Traveller G", "date": "April 10, 2012", "detail_rating": {"service": 4.0, "cleanliness": 2.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 127628260}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled on business", "text": "The room was OK (one of this wannabe modern 'designer rooms' where the bathroom is just way too close to the bed and the sink is outside of - I am not a big fan of it). I was a bit disappointed though to see that my room was dusty and some of the repairs to it where done cheaply (see picture). The bed was OK.", "title": "amazing view from the room of the old town", "user": "marzinihw", "date": "January 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 122401202}, {"rating": 3.0, "stay_parameters": "Stayed August 2011, traveled on business", "text": "Something I would really complain about is the breakfast 'buffet' - to be a buffet the variety of dishes is rather scarce and the quality very poor. Sadly, if you come after 7:30 am you will not find very much left... the staff takes its sweet time to fill again the empty trays.", "title": "Neat hotel in a quiet area", "user": "enixmatix", "date": "September 25, 2011", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 118560897}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "This hotel is in an excellent condition it is very clean. Everybody was most helpful and it was a pleasure to stay there. The bed was very comfortable with excellent pillows the bathroom was spotless. The hotel was in an excellent location however I must admit if I did not have a taxi from the airport I would not have found it. The food was good but the breakfast I thought was exceedingly expensive 1700 rubles (£34.00) for two people. You did have the option to have as much as you like.", "title": "Hotel review", "user": "Doug562", "date": "June 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 164513793}, {"rating": 5.0, "title": "Superior", "text": "I'd say most travelers wouldn't find this hotel, but it's worth the search. Beautiful lobby, rooftop restaurant with view of the old city treasures and a pool to boot. Nice rooms, good location. Only complaint is that they forgot my wake up call at 3:00 AM to make my early morning flight to Frankfurt.", "user": "WorldTravelers03", "date": "June 15, 2013", "id": 164081683}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled on business", "text": "Great value for money in a well located hotel with great service and a wide range of facilities. The roof top restaurant offers stunning views to the city and a delicious beef stroganoff. They also stock a rather good Serbian white wine which goes for 600 or 800 rubles a bottle which is dirt cheap for a hotel in St pet", "title": "Amazing value for money in Russia", "user": "Savvas P", "date": "June 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 163852749}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with friends", "text": "First thing we noticed about this hotel was cleanliness. Everywhere was spotless.", "title": "Excellent value for money", "user": "Ren_D361", "date": "June 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 163371314}, {"rating": 5.0, "title": "Comfortable hotel, fantastic view from restaurant!", "text": "The lobby is elegant with marble and solid wood features. The staff at reception were very pleasant and helpful.", "user": "sjmmarsh", "date": "May 30, 2013", "id": 162416684}, {"rating": 4.0, "stay_parameters": "Stayed April 2010, traveled with family", "text": "Our family of seven arrived on the the 9 p.m. train. It was a bit further to walk to the hotel than I had thought from previous reviews. We did occupy 3 rooms on the 4th floor and they were clean, large and comfortable. The manager sent us to a restaurant a few blocks away where we were able to order pizza at 10 p.m. on a Sunday night, while everything else was closed. Our waiter was friendly and spoke excellent English. Next day, we found the town friendly and easy to stroll around in before we boarded our train to Geneva. Breakfast at the hotel was quite nice and the dining room has lovely paintings of mountains and a beautiful stained glass ceiling. Charming.", "title": "Charming, friendly, comfortable and a good breakfast", "user": "GRM59", "date": "April 24, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 62319567}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled solo", "text": "Both the hotel and the restaurant are staffed by very helpful and enthusiastic people. Rooms provide very good value and the restaurant has many interesting choices from various Swiss regions. Cleanliness and comfort are excellent. There was an occasionally annoying clicking sound of undertermined source heard in my room. Room needs power plug for computer charging (mine did not fit old style outlet). The owner was kind enough to take time to chat with me about the many interesting railway aritifacts used to decorate both public and private rooms. I will definately stay there again and advise others to do the same.", "title": "Outstanding service with excellent value and enthusiastic staff.", "user": "Venni", "date": "April 20, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 62011672}, {"rating": 4.0, "stay_parameters": "Stayed April 2010, traveled with friends", "text": "We stayed one night in April 2010. We stayed with friends, and booked 3 rooms between us. On arrival, the manager explained that there would be a band playing that night, and so he would give us rooms on the 4th floor. Bearing in mind the earlier reviews, I was glad.", "title": "Nice hotel in good location for the souther alps", "user": "Elstonian", "date": "April 18, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 61822548}, {"rating": 4.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "The rooms were clean and spacious, if rather old fashioned. They had nice views over the town and the mountains. The TV had multi channels, including English language news.", "title": "one night stay", "user": "shanefull", "date": "March 19, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 59003504}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled with friends", "text": "The second thing that the manager mentioned was that that evening they were having a special Thai food night if we were interested. We decided that this sounded like a good idea, and so we booked. It turned out to be a very good idea, with lots of choice from a buffet of varied and interesting dishes. It was a really fun evening, and the staff were attentive and eager to ensure that we enjoyed ourselves.", "title": "Clean,friendly with great food deserves a 4th star!!", "user": "lishylad", "date": "March 12, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 58364196}, {"rating": 4.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "Modern and clean room though on the small side. Bathroom a definate triumph of design over function. Ask for a room overlooking old town, not only an excellent view but also less traffic noise. Our room had aircon though we did not use it. Tram link to town centre worked well and free parking is useful. Breakfast uninspiring and staff rather laid back. Many tour busses and their parking outside the hotel with their engine running was an annoyance as we had the window open.", "title": "Mixed Blessing in Bern", "helpfulness": 4, "user": "Woganfan", "date": "September 24, 2006", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 5.0, "value": 3.0, "rooms": 4.0, "location": 4.0}, "id": 5832564}, {"rating": 4.0, "title": "Solid Place", "text": "My wife and I stayed at the ambassador and we would not be as harsh as some of the previous reviewers. I believe that the hotel has renovated its rooms extensively. They now all have hardwood flooring, very clean and designer bathrooms. However, we agree that the room was very very small. There are now also flat screen TVs. Breakfast however was probably the least impressive during our 17-day Europe trip. We had a car for the duration of our trip, so it was no big inconvenience for us to drive the 5 minutes to the old part of the city. However, if you travel by train, I would recommend one of the more central properties. Going back to Bern, we may in fact stay at the Ambassador again. Wireless internet is available in the rooms as well. Btw. Bern is not a city where you will have plenty of 5-star hotel choices, so I assume that the Ambassador is in fact one of the most luxurious options.", "helpfulness": 4, "user": "stephanklee", "date": "November 29, 2005", "id": 4153282}, {"rating": 4.0, "title": "A pleasant surprise!", "text": "My wife and I arrived at this hotel, dreading what we would find since we had read the previous (bad) reviews AFTER we had made the booking! What a pleasant surprise. The hotel was renovated Jan-Apr of 2005, and is now ultra-modern (though the glass-walled bathroom was a bit too modern!). We had a large, bright room looking out over the valley to the buildings of central Bern. The non-central location was offset by the hotel being located next to the tramstop, with frequent trams providing a 5-minute ride to the railway station (a 15-minute brisk stroll, as I also found!). Negatives? The hotel bar and restaurant are too bright and lack character, and the hotel was very busy with tour bus groups.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "October 7, 2005", "id": 3999063}, {"rating": 1.0, "title": "Where are the rest of the stars", "text": "For a 4 star hotel, where are the rest of the stars? It was a dump. This hotel was terrible and nothing like the pictures. Rooms are very,very small, filthy, no a/c and no coffee maker in room as described, and very OVER PRICED for the money. Never could find out the difference in the breakfasts either.. except the price. That wasn't worth the money either! It is not a 5 min. walk to downtown.. not even driving. My friends stayed at the Etap Expo hotel and that seemed like a 4 star hotel compared to ours. Atleast they had a/c and stayed in a nice, clean, hotel inside and out. Next time I will know where to stay and it won't be at the Ambassador.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "July 25, 2004", "id": 2320071}, {"rating": 1.0, "title": "Disappointing!", "text": "The hotel was listed as a '4 Star' Hotel. It would not be considered 4 Star by anyone! It's laughable!", "helpfulness": 3, "user": "KPSimone", "date": "April 19, 2004", "id": 1792337}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled on business", "text": "We stayed recently in the Ambaasador Hotel in Milwaukee for about 4 nights as a result of a conference I was attending at the Fronteir Centre. While the Centre was a good walk away, the weather allowed us to do that and when time did not permit, we made use of the excellent shuttle service at the front door. The hotel is quaint while relatively up-to-date with good staff and all the necessary amenities. The small restaurant is quite good and the friendly service of the shuttle drivers puts this place on our \"quality\" list. Well recommended if you are planning a visit to Milwaukee.", "title": "Quality at the Core", "user": "Cuff11", "date": "September 29, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 118747696}, {"rating": 5.0, "stay_parameters": "Stayed September 2011", "text": "The only real downer was the lack of any discernible or easy way to get to the highly advertised shops at Cedarburg which is a 25 minute drive out of the City. It is advertised but not readily accessible.", "title": "Great place to stay in Milwaukee with car", "user": "Lburchard", "date": "September 25, 2011", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 118576563}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled on business", "text": "Recently stayed for 3 nights during a professional meeting at the Frontier Center. While most of the hotels suggested were closer to the downtown center this location a bit farther out was great for travelling by car with ample free parking. The complimentary shuttle was great for getting to downtown locations without needing to move our car or pay for parking elsewhere, which was another great added value. The historic art deco hotel was beautiful. The guest rooms were updated, modern and very spacious with a separate seating area and two separate sink areas. The staff was very responsive and service oriented. The conference negotiated rate was a good deal for a hotel in a major metropolitan area .", "title": "Great room! Good service!", "user": "SLPlovesPE42", "date": "September 25, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 118550115}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "I stayed at this hotel for 4 nights (from a Wednesday night to Sunday morning) while I was attending a continuing education course at Marquette University. The king suite room was spacious and very comfortably decorated. It was within walking distance of my class, so I didn't have to rent a car. And the free shuttle was great - very timely in picking me up from the waterfront after I walked into downtown. The driver was very knowledgeable about the area's sights and restaurants.", "title": "A old time diamond in the rough", "user": "cyd_the_red", "date": "September 16, 2011", "detail_rating": {"value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 118196442}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "The Envoy restaurant (located inside the main floor of the hotel) was pricey but decent and the service was attentive but not overwhelming. Not very abundant on choices for a vegetarian though. The Caffe' Deco was also pricey (the non-prepackaged food comes from the Envoy kitchen anyway) but the cashier was very unpleasant and unfriendly both times I went there for breakfast - which was a surprise, since everyone else was so nice and helpful.", "title": "Historical hotel in Milwaukee", "user": "Midwesterner009", "date": "September 12, 2011", "detail_rating": {"value": 4.0, "location": 3.0, "service": 4.0, "rooms": 4.0}, "id": 118030668}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "This hotel is the greatest! It kinda fools you the way it looks on the outside but once you get inside the decor is beautiful. Checking in was fast and easy then we got inside the beautiful art deco elevator to our floor and our room, which was a king deluxe. OMG, the room was large and roomy, it had a large bathroom with a great shower (which I wanted to take home) and also robes for us to use. After spending some time sightseeing in Milwaukee, we returned to our hole for dinner and the Envoy - we each had the strip steaks which were perfect followed by dessert which was sinful!!! The wait staff are very attentive and make you feel important, they make you feel as if your every wish will come true! After dinner we visited the casino, then coming back to the room after a night of gambling and drinking, we fell into the most comfortable bed, it was as if we were sleeping in the largest most softest pillow that ever existed!!! In the morning, we went back to the Envoy for breakfast, I had the Eggs Benedict which were perfect and they had the best coffee ever! Ike, the waiter was gracious and attentive, after our dinner, he even put our coffees on a tray and walked us to the outdoor patio where we enjoyed our coffee and cigarettes in the beautiful sunlit Milwaukee morning. Checking out was fast and easy and our trip to Milwaukee and the Ambassador was over. We will definitely come back and stay at the Ambassador, it is completely different than the generic hotel chain, better and more personal. The Ambassador makes you feel cherished as if you were a family member coming to visit!", "title": "We loved it and we will be back!!", "user": "Cathi847", "date": "September 5, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117695613}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "What a great experience! This hotel is really exceptional. The service is superb, the staff is very friendly and helpful without fawning, and the rooms are spaciaous. The bathroom is tiny, but the rest of the room makes up for that and the sink area outside the bathroom is great. I loved the bed and especially the pillows to choose from. All in all an exceptional experience!", "title": "Exceptional quality at a great price!", "user": "LHHUNT", "date": "August 15, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116779741}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled solo", "text": "I stayed at this hotel for two nights while I was in Milwaukee for the UFC Live event. First off: the place looks great; art deco style, lots of remodeling. Secondly the service was outstanding. The drivers for the free shuttle were courteous and on-time. By the way: the shuttle is free so if you want to see downtown but don't want to fork over another hundred bucks or so then do as I did and stay here.", "title": "Beautiful hotel, great service, ok food", "user": "yojimbo7", "date": "August 15, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 5.0}, "id": 116772773}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with friends", "text": "The food that I ordered through room service wasn't the greatest and was overpriced in my opinion. That's really the only bad thing I have to say about the place except for the fact that the walls are thin and if you're a light sleeper then you might want to talk to the management beforehand. The room was clean however the coffee maker still had the previous customer's instant coffee bag in it. Wasn't a deal breaker as I'm not a huge fan of coffee anyway.", "title": "Would come back again (if the Pirates start winning)", "user": "jstiger", "date": "August 15, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 3.0, "service": 5.0}, "id": 116748127}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled on business", "text": "Free wireless is a plus. While my laptop was working (had some Vista bug/glitch) the speed was great.", "title": "Interesting Hotel", "user": "MandyD_1", "date": "August 14, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 3.0, "service": 4.0}, "id": 116721232}, {"rating": 3.0, "stay_parameters": "Stayed July 2013, traveled with friends", "text": "The small entrance to the hotel is on an unattractive street in a plain neighborhood. the lobby is a good size, and surprisingly very attractive. The rest of the hotel is unremarkable.", "title": "OK", "user": "Jed3", "date": "July 15, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 167697581}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled solo", "text": "We had a standard 2 bedroom, about 300 SF including a moderate sized bathroom. The bathtub rim was 22 inches high, making it somewhat difficult to get in and out for the shower. The walls and furniture were plain.", "title": "Another Great Stay!", "user": "Amy1953", "date": "July 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 167140472}, {"rating": 3.0, "stay_parameters": "Stayed July 2013, traveled with friends", "text": "Breakfast was very good, with omelets made to order.", "title": "Average hotel. Nothing much to write home about", "user": "cptspalding", "date": "July 9, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 2.0}, "id": 166960345}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "There wa a pool which was free for only a part of the morning. Service was friendly.", "title": "Angenehmes Hotel", "user": "Ines1009", "date": "July 9, 2013", "detail_rating": {"service": 2.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 166939794}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "This hotel is my favorite in St. Petersburg! I've stayed here many times in every season and each time is a pleasure. The free wi-fi is so wonderful; the rooms are so clean and tidy. The breakfast buffet keeps one going all day. The hotel is close to the Mariinsky, the metro and trams to Nevsky.", "title": "A great hotel to stay", "user": "Cheshirehardy", "date": "June 23, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 5.0, "location": 3.0}, "id": 164876768}, {"rating": 4.0, "stay_parameters": "Stayed June 2010", "text": "Stayed here for two nights after riding the Glacier Express from Chur. Room was well appointed, clean and comfortable. Even though the weather was warm, we were not bothered by the lack of an air conditioner...the room had two large windows which allowed for a decent flow of air into the room. The hotel is an easy 4-5 minute walk from the train station which makes its location quite attractive if you are travelling around by train as we were. European style breakfast buffet was quite good too.", "title": "Comfortable Hotel in Convenient Location", "user": "stuart316", "date": "July 29, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 72801331}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "We stayed at this hotel 1 night in a family room/quad on the top floor. The room was beautiful, spacious and the bathroom was fabulous with a fantastic shower. (Although the bathroom door was see through glass which was interesting with a family with teenagers!) The hotel does not have air conditioning as one reviewer mentioned but we had 2 large windows that we opened allowing the room to cool down in the evening. We stayed as a stop over to tour Zermatt and it served our purposes perfectly. You could walk to the train station and take a train directly into Zermatt from Brig.", "title": "Comfortable and well located hotel", "user": "TorontoTravelfan", "date": "July 25, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 72249290}, {"rating": 4.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "We did not eat dinner at the hotel but the breakfast was very good with lots of choices.", "title": "Great economy hotel, helpful staff, very good breakfast, clean rooms.", "user": "asgekar", "date": "July 20, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 71682624}, {"rating": 1.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "We (mature couple) had a good time. We travelled from India, so had very little idea about Brig. Staff helped us with it. Room was clean, service excellent, and breakfast was great as well. We wish we had stayed longer, it was too good a stay. highly recommended.", "title": "DO NOT STAY HERE IN THE SUMMER, NO AIR CONDITIONING!", "helpfulness": 3, "user": "PeelPeople", "date": "July 7, 2010", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 4.0}, "id": 69990927}, {"rating": 4.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "Really if you want to be comfortable you do not want to stay here in the Summer, Brig can get very hot. Our holiday was truly spoilt by the inability to have the room at a reasonable temperature. Otherwise this is a pleasant hotel so would be fine in cool weather.", "title": "Friendly welcoming family run hotel with superb restaurant", "user": "Rosemary T", "date": "July 6, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 69972990}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "My friend and i loved the Ambassador. The front desk staff were excellent. They all spoke excellent English. The hotel has a pool and a sauna. It also has free garage parking which is excellent considering we were on a driving holiday. It is very easy to find. It is a little ways from the center of town but the tram is very close to the hotel and is very easy to use. It costs 2 swiss francs each way. The included buffet breakfast is excellent. Cold meats, boiled eggs, scrambled eggs, bacon, sausage, breads, fruit. yogurt etc. The room was a nice size and had excellent air conditioning. I found the beds very comfortable. I really enjoyed the duvets, it was like sleeping in a marshmallow.", "title": "Loved the Ambassador", "user": "DeanCalgary_Alberta", "date": "August 8, 2008", "detail_rating": {"cleanliness": 5.0, "front_desk": 5.0, "location": 4.0, "value": 5.0, "rooms": 5.0}, "id": 18764634, "likes": {"liked": "— The front desk staff and the free parking", "disliked": "— I liked everything"}}, {"rating": 3.0, "title": "Worth a look", "text": "Nice hotel with modern touches especially in the bedrooms. Not in the city centre but tram number 9 will take you from the Schonegg stop right outside to the main railway station in 5 minutes. Good view of Bern from one side of the hotel. The other side looks out onto the road and countryside. Good breakfast with both hot & cold food although the restaurant staff are a little inattentive. Room was cleaned impeccably every day and it was nice that they give you a kettle. They don't however replace any of the coffee etc that you use. Worth considering if you can get a good deal.", "helpfulness": 1, "user": "gazcam", "date": "May 12, 2008", "id": 15953406}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "We had a good stay in this hotel. Of course there are always some points that can be better but overall we were satisfied. The positive points are: We had a good view. The room was clean and comfortabel. The staff is friendly. Good parking and close to the city center even for a walk.", "title": "Great view, good hotel", "helpfulness": 1, "user": "FORZA7777", "date": "January 9, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 12460318, "likes": {"liked": "— good location and friendlu staff", "disliked": "— Small Sauna and pool"}}, {"rating": 2.0, "stay_parameters": "Stayed July 2007, traveled solo", "text": "Negative or less positive points are: The breakfast is good but plain, not very special. The sauna is very small. With three people in there it is crowded. The same goes for the swimming pool.", "title": "Mind the tiny everything", "helpfulness": 6, "user": "evidence", "date": "July 23, 2007", "detail_rating": {"cleanliness": 3.0, "front_desk": 2.0, "location": 1.0, "value": 2.0, "rooms": 2.0}, "id": 8219355, "likes": {"liked": "— the bbc channel", "disliked": "— value for money"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled with friends", "text": "I just returned from a weekend in Bern+Fribourg. The intention was to have a pampering relaxing weekend in a hotel with fitness, spa and swimming pool. I chose Ambassador because it promised all the above with the guarantee of a 4 stars hotel. I have no idea how they got the ratings! The room was tiny, the bathroom was a miniscule glass cabin carved out of the room. The elevators were old and ridiculously slow. The information in the room was only in German. The website gave instructions on how to reach the hotel, but forgot to mention that the tram stop next to the station does not function for extensive road/tram works, oh and the tram does not exist either. And regarding the \"spa\", you can find it in the garage, a tiny room with a tiny changing space, right next to the tiny fitness room.", "title": "good business hotel, compact leisure hotel with free spa", "helpfulness": 1, "user": "nikindia", "date": "July 19, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 8185292, "likes": {"liked": "— good compact rooms with great views", "disliked": "— outside of the building"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled with family", "text": "We booked this hotel on line from the USA and loved it. We would have plannned to stay longer had we known how nice it would turn out to be. We had a wonderful dinner on the garden terrace and the best breakfast of our trip the following morning in the Brasserie. The breakfast was included. The staff was friendly and very help[ful", "title": "Great Hotel Find", "user": "whomustbeobeyed", "date": "October 3, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 81939718}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "All the staff were very helpful and friendly at check-in, breakfast and with general enquiries.", "title": "Very comfortable and friendly hotel within easy reach of the station and Old Town", "user": "JJfromtheEast", "date": "September 26, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 81018341}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled with friends", "text": "The hotel is relatively simple (but clean and comfortable) and is located within 5 minutes of the station and the beautiful Old Town of Brig. We were on our way home from a holiday in the Alps and Brig is definitely a place I would recommend and visit again.", "title": "Charming hotel with exellent service!", "user": "Sussen", "date": "September 11, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 79161971}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "I stayed here for one night with some friends. I forgot to inform the hotel about our late arrival. The hotel called me and asked if we were coming.. =)", "title": "Great place at good price", "user": "Sailor-NHYC", "date": "September 8, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 78755366}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled solo", "text": "The rooms are clean and modern!", "title": "Great Location", "user": "swandav", "date": "August 10, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 74547194}, {"rating": 2.0, "stay_parameters": "Stayed June 2011", "text": "Hotel had a small room. The building was old but decently remodeled.", "title": "Not 4 star for sure", "helpfulness": 1, "user": "Ttalki2", "date": "August 4, 2011", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "location": 3.0, "service": 1.0, "rooms": 2.0}, "id": 116277776}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "Service just terrible. I had stayed at this hotel twice due to hotwire, and service both times were unacceptable. Rude, not accommodating of simple requests as a king bed, etc.", "title": "Very nice urban hotel", "user": "Blacklager", "date": "August 2, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 3.0, "service": 5.0}, "id": 116191068}, {"rating": 1.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "Stay somewhere else.", "title": "Not a 4 Star Hotel", "helpfulness": 3, "user": "hughwgraham", "date": "August 2, 2011", "detail_rating": {"cleanliness": 1.0, "sleep": 1.0, "value": 1.0, "service": 2.0}, "id": 116162598}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "Location is so bad that the parking is free.", "title": "We're Coming Back - Fort Worth Loves Ambassador", "user": "swgtx", "date": "July 30, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116030955}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "It was obvious that this is an older hotel, but it has been refurbished very nicely and looks modern. It has a nice restaurant and bar, and the staff was very accomodating. The only possible criticism I have is that there is not much right in that locality within walking distace.", "title": "What a lovely surprise", "user": "tennisfanRaleighNC", "date": "July 29, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115971763}, {"rating": 1.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "Bad location. The rooms were old, tiles broken in the bathroom. The beds were very uncomfortable. Reception felt like a mess and everything felt very unorganized.", "title": "Worse ever", "user": "Stefan B", "date": "March 10, 2010", "detail_rating": {"service": 1.0, "cleanliness": 2.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 1.0}, "id": 58258473}, {"rating": 3.0, "stay_parameters": "Stayed August 2009, traveled with friends", "text": "Would not stay here again.", "title": "OK Hotel Not Near Downtown", "user": "WatsonTravellers", "date": "February 8, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 2.0, "location": 2.0}, "id": 55485808}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled on business", "text": "The Ambassador was located high above the town of Bern. There is a tram station right outside of the hotel, but of course you must pay everytime to use it. The system was not hard to figure out. You can buy tickets from the front desk and pay for them at the end of your stay. The hotel was OK and would be fine if you get a great deal on it and don't mind commuting to the sites. We were disoriented when we first arrived in Bern (our first trip) and took a cab to our hotel - it was approx $30. Should we have taken the tram it would have been like $2. It's unfortunate you can't just walk out the front door and stroll through adorable Bern. The room was a little beaten up. We had an uncomfy chair with a huge slash in it. The bath was small and the shower had drywall in it which made for not the cleanest of feel. We had breakfast here once and the staff accommodated our request for just coffee and bread and did not charge us the full breakfast price so that was very thoughtful. The sushi restaurant was closed during our stay. We walked down to the spa to investigate. It looked very tired and had a steam room and a tiny pool. I don't think there were services even offered but I am unsure.", "title": "Super Duper", "user": "Earby", "date": "January 13, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 53373546}, {"rating": 3.0, "stay_parameters": "Stayed November 2009, traveled solo", "text": "Yes the rooms are small, that is the only negative!", "title": "too small, too modern", "user": "ninapod", "date": "November 25, 2009", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 3.0, "service": 3.0, "rooms": 2.0}, "id": 50020763}, {"rating": 4.0, "title": "Good Spot", "text": "Staff are superlative, so is food, so is everything else, would I stay again, obviously!", "user": "melba", "date": "October 29, 2009", "id": 48080100}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "beautiful art deco hotel near Marquette u..Service was top notch.The staff truly aims to please.We paid 83.00 bucks including tax. Booked stay and play rate with Potowotamie casino..Deluxe king bed room was great. Large,and, roomy..", "title": "ambassador was amazing", "user": "charliejoe", "date": "October 23, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119610284}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "My family of 4 stayed at this hotel this past week and it is a little gem in the middle of the Marquette University area of Milwaukee. The deco style hotel is quite old but is still modern enough to please everyone. Once you walk inside you are welcomed by a restaurant on one side and a bar on the other. The lobby pumps out a rather pleasant scent of which the origins are unknown but I found myself looking forward to returning each evening to catch a whiff. The rooms are very spacious and inviting. The beds are extremely comfortable; I don't remember sleeping that well at a hotel in a long time. The only complaint I would have is the walls are a bit thin; we were next to the elevator and it was a tad loud in the night. That wouldn't scare me away - I would happily stay here again.", "title": "Delightful", "user": "mtngirl37", "date": "October 19, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119499573}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "The hotel staff was courteous, helpful and attentive. The location is also close to downtown and the older areas of Milwaukee. Parking is free to hotel guests and they also have a free shuttle that runs daily. Another perk here is free wi-fi - not easy to find in nicer hotels. The restaurant has a limited menu but Milwaukee boasts some great eateries within a short distance. I highly recommend the Ambassador if you are looking for comfort, value and convenience.", "title": "Great Hotel!", "user": "TravelerLoren", "date": "October 12, 2011", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 119224106}, {"rating": 3.0, "stay_parameters": "Stayed October 2011, traveled on business", "text": "My husband and I stayed 4 nights at the Ambassador Hotel. We saved money by not staying downtown but rather near Marquette University and we are so glad that we found this hotel. Our room was very nice and spacious. But, the best part of this hotel is the shuttle service. The complementary shuttle will take you to basically any site in Milwaukee. The shuttle will even pick you up and return you to the hotel. We even used the shuttle to get to and from Miller Park for a Brewers game.", "title": "Value for money in Milwaukee", "user": "SAH123_10", "date": "October 12, 2011", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 119211648}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled on business", "text": "On the downside housekeeping left something to be desired. The room was very clean upon our arrival, however maintenance wasn't great. One day no one came until 3:30. Another day, our used mugs weren't changed out. Another time we asked the front desk for some coffee and they said they would bring some to our room, which never happened.", "title": "Older and charming but there was room for improvement", "user": "nomadic4fun", "date": "October 1, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 2.0, "location": 4.0}, "id": 118823802}, {"rating": 2.0, "stay_parameters": "Stayed November 2010, traveled on business", "text": "Although the hotel's promotional photos try to make it look like a hotel W from Starwood, it is decidedly not. A colleague described the rooms as being similar to an American college dorm room, and I think that's a great assessment. This is not the place if you're looking for romance, style, luxury, nice towels or proximity to downtown. The breakfast bar is the stereotypical European version, comprised mostly of bread and sliced meats. Internet is extra, and a code must be purchased at the front desk.", "title": "Utilitarian, but not as nice as suggested in hotel's web photos", "user": "David S", "date": "December 1, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 2.0}, "id": 88772189}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled on business", "text": "Having said that, it was clean and the staff was fine. Hotels are expensive in Switzerland, and this was around $225 or so. If you need a no-frills crash pad, and the location is convenient for you, then maybe it's ok.", "title": "Stunning Room Service", "user": "sfinniga", "date": "September 14, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 79550147}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "This hotel has spacious rooms, great a/c, convenient location, free parking.... all that good stuff - however prepare for the fastest room service in the country! 24 hour room service - if you order \"all day\" items they show up at your room almost before you hang up the phone. If you call during meal service, they run a menu up to your room, you select what you want, and it is delivered very quickly - pleasant, delicious food, reasonably priced by local standards. Internet connection fees are stunningly high - consider stopping by Swisscom and getting their USB access stick instead - 7.50 CHF a day.", "title": "Super views", "user": "Saffronbee", "date": "September 9, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 78950989}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with friends", "text": "We stayed for one night at the Ambassador and were given a room at the back with magnificent views over Bern and the surrounding hills.", "title": "Great location", "user": "Westie69", "date": "August 19, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 75898078}, {"rating": 2.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "It was super quiet at night and a real treat. The beds seemed comfortable at first, but I found the duvet a little on the heavy side. The décor was actually a bit hideous and very minimal (eg the reading lights), although I didn’t mind the tiny space-age bathroom that so many reviewers complain about. Breakfast was not great (particularly not at the price we paid) and staff seemed a little lax in more than one respect.", "title": "A bit below average", "user": "leisurebunny", "date": "July 4, 2010", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 3.0, "sleep": 3.0, "rooms": 2.0, "location": 2.0}, "id": 69683223}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled solo", "text": "Stayed at this hotel for 6 nights in March 2013. The hotel helped with the Visa invitation. I booked the transfers from the airport to the hotel which was very helpful as I don't know a word of russian. The reception staff are helpful and courteous. The room was comfortable and clean. It's a great base to explore St Petersbrug.", "title": "Clean, comfortable and good base for exploring St Petersburg", "user": "pammy111", "date": "March 31, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 156161488}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "A deceivingly large hotel which is internally very attractive, warm and welcoming. A good sized bedroom with Sat TV, free Wi Fi and a small seating area with desk and chairs plus an attractive bathroom / wet room. Great views from our 7th floor room over St Isaacs Cathedral and beautiful old St Petersburg.", "title": "Warm Smart Hotel", "user": "Steggs", "date": "March 27, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 155803567}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled with family", "text": "Pleasant pool and sauna but spoilt but charging for use after 1130 in the morning???", "title": "Clean, efficient and friendly.", "user": "JKW70", "date": "February 23, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 152871940}, {"rating": 2.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "The top floor Bar and restaurant looked good but pretty expensive.", "title": "Beautiful but deceiving", "user": "H H", "date": "January 17, 2013", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 2.0, "sleep": 2.0, "rooms": 3.0, "location": 2.0}, "id": 149886916}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "The hotel was spotlessly clean throughout.", "title": "Warm and Cosy Stay in the Middle of Winter", "user": "SvetlanaMosowRussia", "date": "January 9, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 149309370}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "We were on the 7th floor overlooking the city so superb views but, if you want the convenience of being 'in' the city, it's not for you. There's tram stop across the road though and it's a short journey into the centre. Very 'modern' room...perhaps too modern for friends sharing as the bath and sink are IN the room. The rack-rate is too expensive but we got a cheaper deal which was acceptable, being in mind that Switzerland is VERY expensive at present. The hotel has a Japenese restaurant - and there seem so to be a lot of Japenese coach parties staying just one night - which can be a bit noisy. If you want peace and quiet, ask for a top floor room.", "title": "Pricey but good", "user": "mattynortheast", "date": "August 29, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 2.0, "service": 5.0}, "id": 117395800}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "On our way to Tuscany we thought it would be nice to hit the alps but beforehand stop off just outside for the night so we have the day to really see the mountains (especially the Grimselpass).", "title": "It did the job", "helpfulness": 2, "user": "Kris G", "date": "August 29, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 3.0, "service": 4.0}, "id": 117384928}, {"rating": 3.0, "stay_parameters": "Stayed July 2011, traveled on business", "text": "Anyways, our main concern was first, parking, second, decent room. We'd heard Bern was pretty bad for that and when we saw this hotel had free parking a decent rooms, SOLD!", "title": "Not what I would expect from a 4star hotel", "user": "nuriasm", "date": "July 27, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 3.0, "service": 4.0}, "id": 115861303}, {"rating": 3.0, "stay_parameters": "Stayed August 2010, traveled with friends", "text": "So OK, we didn't come in with the biggest of expectations however we were pleasantly surprised. The room was quite nice, the shower, while strange in that it was kind of, in with the rest of the room (ie: no seperate bathroom) it was quite good. It had a seat construction and we quite enjoyed it.", "title": "Next time in Bern, I' ll choose another hotel", "helpfulness": 1, "user": "ff00", "date": "July 12, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 2.0, "service": 3.0}, "id": 115275345}, {"rating": 4.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "The bed was also rather comfortable for myself (I enjoy a harder bed) though it was a tad too hard for my wife (she is a tiny thing)", "title": "provide a parking place. very important in bern!", "user": "dell3581", "date": "January 21, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 93941303}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "The Ambassador Hotel cannot be faulted for cleanliness, facilities, comfort and quietness.", "title": "Clean, modern and not too far from the sites.", "user": "JaynrManchester", "date": "May 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 162164114}, {"rating": 3.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "We were impressed from the minute we walked through the door and when we reached our lovely, spacious and light room on the sixth floor, we remained impressed. The beds were really comfortable, the air conditioning effective, the facilities impressive. A double wardrobe for clothes with extra hanging for coats. One of the biggest breakfast buffet selections I have seen during my travels with both hot and cold food. The hotel offers free use of dishes and cutlery and free hot water (for you to make your own cuppa) by request. The only niggle I had was with the pillow and if we were staying for more than the two nights that we had booked, I would have requested either a different pillow or an extra one. A short walk to the nearest metro station, A half hour stroll to the Hermitage. Quite close to a small park. Quiet at night. Staff were friendly and efficient.", "title": "Satisfactory", "user": "eaglebudd2", "date": "May 25, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 161765050}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "This is an older renovated hotel. First impressions walking down the very long hall to our room were of Darkness - a low ceiling, dark green carpet and many dark wood doors to pass gave this impression. Our room was cramped with insufficient space for clothes. The bathroom was small but adequate - although the sink plug wasn't tight. TV small and limited English channels.", "title": "Excellent hotel", "user": "Paul P", "date": "May 17, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 2.0}, "id": 160945600}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "The breakfast room on the 9th floor has a great view and lots of light. The food was OK not great although the omelet bar was good. Fruit sald consisted of mostly chopped up apples.", "title": "Excellent hotel and excellent value for money", "user": "adaziv", "date": "April 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 157491784}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled on business", "text": "There was quite an international clientale - some from the US, some Russians, British, men with women/wives in Muslim robes.", "title": "Excellent hotel for the money", "user": "Matti P", "date": "April 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 156341539}], "location": {"country": "Switzerland", "region": "Swiss Alps", "continent": "Europe"}, "stars": 3, "variance": {"poor": 8, "average": 20, "very good": 68, "terrible": 4, "excellent": 93}, "aka": "Ambassador Hotel Brig", "slim_ranking": 0.0625, "description": "The Hotel Ambassador has a quiet central location 200 metres away from the train station in Brigue with free parking.Arrive and immediately feel at home? The rooms are individually designed, spcious and bright.Exclusive Boxspringbeds from the Norwegian company Jensen provide with restful sleep. A Delizio capsula-Machine for thea and coffee is at your disposition in all rooms."}