{"user_rating": 4.5, "review_count": 451, "name": "Amber Hotel", "reviews": [{"rating": 4.0, "title": "great little hotel", "text": "We stayed at the Amber at the end of October. Got the shuttle train from the airport and then a taxi from the station--we were approached by a 'man with a van' who took us to the hotel for 30 zloty for 6 of us--well worth it as it saved a 20 min walk with luggage.", "helpfulness": 1, "user": "peterwilliam_8", "date": "November 10, 2009", "id": 48923704}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "As other reviews state, the big plus of the Amber is its proximity to the centre without being in the central price band. it is a nice hotel with very helpful staff and a nice atmosphere. The standard rooms are perfectly adequate--clean and cosy with a few nice touches. Yes the breakfast room is small but with our reasonably early starts we had no problem and the food ia also quite adequate and plentiful.", "title": "Good hotel in a ver convenient location", "user": "Vic_Hope_9", "date": "October 30, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 48133313}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled with friends", "text": "The hotel is just a few minutes' walk from tram and bus stops --we found it easier and a lot cheaper to use these for trips to Auschwitz and the salt mine rather than book an organised trip. However, for convenience, we did take a taxi from the hotel on our return to the airport at a cost of 100 zloty between 6 (80 z for 4 people)--very reasonable.", "title": "Gem of a hotel", "user": "PatsyHolmfirth", "date": "October 26, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 47798919}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "there are plenty of places to eat at reasonable cost as long as you avoid wine! The beer is fine!our favourite was Nostalgia--just a few minutes walk away--great food and atmosphere---try the pierogi there.", "title": "Excellent hotel", "user": "Monika_and_Daniel", "date": "October 23, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 47550042}, {"rating": 2.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "Krakow is a nice city to visit for a few days and the hotel amber is a great base--strongly recommended.", "title": "Very gloomy room - more like a cell.", "helpfulness": 2, "user": "JonnyHoop", "date": "September 29, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 3.0, "service": 4.0, "rooms": 2.0}, "id": 45423272}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "It's all been said by previous reviewers but this is simply a first class small in every aspect one could wish for. It offers brilliant value for money.We were given a large room with modern decor, a large TV, the Cherry Vodka (Wisniowka) so nice that we brought some home, a 6 foot wide bed, sofa, large wardrobe space, an office area and very good free wi-fi. The standard of housekeeping was excellent and there were several magazines with very good uptodate information on what was current in Krakow.", "title": "The best place to stay in Krakow", "helpfulness": 2, "user": "nataliatiyad", "date": "December 23, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 122029938}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "The reception staff were first class, welcoming, always smiling and happy to advise on places to eat, trams to catch etc (and provide small change for the trams) and in arranging taxis to and from the airport (note: for some reason Poles do not expect to have to tip taxi drivers!).", "title": "Impeccable service", "helpfulness": 1, "user": "PJMSomerset", "date": "December 16, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 121803124}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled with friends", "text": "The breakfasts could be very filling if one didn't exercise some restraint with a wide choice of cold meats and cheeses, rolls and pastries and hot frankfurters and fried eggs with pancakes.", "title": "Krakow Christmas", "helpfulness": 4, "user": "MartinWJH", "date": "December 12, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121652338}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "The location is 5-6 minutes easy walk from the centre of the old town and handy for the exceedingly cheap trams to all parts of the city. Whilst we were there we went to a Turner exhibition at the National Museum, entrance was £2 each compared with over £10 at the Tate for his last special exhibition.", "title": "A Real Find", "user": "AnnSurrey_England", "date": "December 9, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 121562241}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "We would be delighted to return to this hotel in summer.", "title": "Lovely hotel amber", "user": "Samantha6671", "date": "December 7, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 121496212}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled on business", "text": "The hotel, totally reformed it enables a pleasant sojourn in one of the places but tourist of Estmbul, but you find the best of this hotel in the deal received by the employees of the same family very pleasant environment", "title": "un buen hotel a un pecio razonable", "helpfulness": 1, "user": "pedro63", "date": "June 3, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 31461001}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "We stayed here for 3 nights on a city break in Krakow & were highly impressed with Hotel Amber. Located on a quiet street just a 5 min walk to the Market Square. The room we had has to be one of the biggest we have ever stayed in, tastefully decorated & with a powerful shower. Breakfast was buffet style. The hotel/reception staff are exceptional. They were very friendly, most helpful & booked all the tours we wanted to go on for us (Auschwitz/Salt Mines/Communist Tour). Indeed a few days before we arrived I received an e-mail from the hotel asking us did we want to book an airport transfer to the hotel (which we did) & when we arrived @ the airport on our first day we were met @ arrivals by our taxi driver.", "title": "A 3* Hotel with 5* Service", "helpfulness": 1, "user": "Waterford-TRIP", "date": "June 2, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 31369963}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled solo", "text": "I really liked Krakow & will definitely return here soon & I will stay at the Hotel AMBER without hesitation. It's a hidden gem of a hotel. I highly recommend it to anyone thinking of visiting Krakow.", "title": "Neat, all you need and excellent staff", "helpfulness": 2, "user": "SarkaCZ", "date": "May 4, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 29282660}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled with friends", "text": "It's on the edge of the old town square, and about a 10 min walk to the train and bus station. That's the practicalities over with, it's in an excellent position to explore the city and surrounds.", "title": "Great Hotel", "user": "Bouff", "date": "May 4, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 29275823}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled with friends", "text": "The rooms are kept immaculately clean, and the one I was in may not have been huge but it didn't matter, I was by myself and I wasn't going to spending all day in there anyway! The bathroom facilities were excellent and the staff even left a small gift of sweets and the next day, some mineral water in the room. There was also tea and coffee making facilities, which was a plus.", "title": "Excellent central hotel, far better than 3 star", "helpfulness": 1, "user": "JohnandCarolineUK", "date": "May 3, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 29246601}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled with family", "text": "I booked this hotel on the strength of the reviews from Trip Advisor and was not dissapointed. The hotel staff were very friendly and the rooms were spacious and clean. Breakfast was fine with more than enough choice. The hotel is 5 minutes walk to the main square. This was our first trip to Krakow but will definately be going back and will try to stay at this hotel.", "title": "Great hotel in a great location", "user": "SherburnLil", "date": "September 29, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 45412482}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "Friendly efficient staff speaking excellent English and determined to meet your needs. Hotel situated 5-7 minutes stroll to main square.in quiet side street. Good breakfast selection. We had 5 nights stay here on this our first visit to Poland and would not hesitate booking again on a return trip. Reception will book any excursions, all at reasonable prices. Hotel Amber represents really good value for money.", "title": "Hotel Amber ticks all the boxes", "helpfulness": 1, "user": "trav28Leeds", "date": "September 13, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 41291971}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "It was our first time in Cracow for me and my husband. If we were going back we wouldn’t go looking at hotels, we would just book Amber again!", "title": "Excellent choice", "user": "Susan1982", "date": "August 3, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 36607125}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "Situated in the Old Town with a very short walk to Main Market Square and most of the Cracow’s attractions. The hotel is cosy and modern at the same time. I would even say it is more like a home than a hotel. The rooms are big and the beds comfortable. They have a cable television and free wireless internet access. Tea and Coffee Making Facilities in our room were very useful.", "title": "GREAT HOTEL WOULD DEFINATELY GO BACK AGAIN", "helpfulness": 1, "user": "stugillSalisbury", "date": "June 14, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 32305534}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled with family", "text": "The staff couldn’t have been more helpful or friendly. They had great knowledge of the city, cultural events, transportation etc. Every detail of service has been focused on guest comfort. They really made us feel welcome. Once, they put sweets in our room, the other day we recived fresh strawberies. It was more than we expected!:)", "title": "Wonderful hotel and city", "helpfulness": 1, "user": "Hannahsmum", "date": "June 9, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 31934886}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "Stayed here for five nights in a family room (two adjoining rooms). Nice, friendly place with some little feminine touches in the rooms that differentiated it from the usual corporate square boxes found in the big brand hotels. Staff are extremely friendly and helpful. Just five minutes from the main square. There are some restaurants a couple of minutes walk from the front door plus a small supermarket, bakery and ATM right across the road. Would have rated as excellent had it not been for the heating failing in our room on our last night which also lead to a shortage of hot water - rest of the week was fine. We used the sauna (£3/person supplement) which you reserved and had to yourself. Wifi worked a treat too. Booked trips to Auschwitz & Salt Mine viia the hotel (both excellent and not to be missed) and hotel organised taxis to/from the airport. We walked everywhere once there - it's only a 15 minute walk to the Galleria, 15 to Wawel - and everwhere feels safe. We loved Krakow, loved the Amber hotel and would highly recommend. Can't wait to return.", "title": "Highly Recommend Amber", "helpfulness": 2, "user": "slowman", "date": "October 22, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119599104}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled solo", "text": "great location, EXTREMELY friendly & helpful staff, room was clean & comfortable. decent breakfast, bed pretty comfortable by european standards. can definitely hear things through the walls, maybe bring ear plugs if you are a light sleeper. the heat was not quite as strong as i would have liked & i had some trouble getting the a/c-heating unit to work consistently, but it wasn't unbearable or anything. free wifi worked great. this hotel definitely tries to add little extras & think of details that make your stay more comfortable/convenient/enjoyable. i would stay again without any hesitation.", "title": "great place to stay", "helpfulness": 1, "user": "newyoika", "date": "October 20, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119532216}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "Nice Hotel good location , we recieved an upgrade on arrival ,staff excellent, just a shame about the restaurant changes that we encountered during our stay, apart from that very good.", "title": "Very good", "user": "joew1967", "date": "October 18, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 119438834}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled with friends", "text": "Having never been to Poland before we took stock of the reviews on Tripadvisor and were not disapointed. The Amber Hotel situated down a quiet side street only a five minute walk from the old town centre is the perfect place to stay. It is a small hotel, very friendly and caters for the disable person by having a stair lift even for the half dozen steps into the reception and a lift to all rooms. We found the food a wide choice of both hot and cold, English or Polish and all very enjoyable. Having traveled to many countries I can truthfully say this was the cleanest place I have ever stayed in. Rooms are large enough to be comfortable, bathroom the same. There is a friendly touch added by the fact there were a couple of ornaments on the window sills, a Teddy sat on the bed and a decanter of Cherry Vodka for you to try. Thankfully we were given a city map as we were once lost and we were even offered the loan of an umbrella one evening when it looked like rain. Trips can be booked through the hotel if needed. Four of us stayed in two rooms and even between us we could not find a fault with the Hotel. I would have put they had tea and coffee in the rooms but not milk, which seems the norm in Poland as we did struggle to get a drink with milk added, but after asking at the reception desk about milk they produced a carton from their kitchen so this leaves us with no complains at all. If we went again to Krakow this is where we would stay again.", "title": "Perfect short break", "helpfulness": 2, "user": "bodturner", "date": "October 17, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119382839}, {"rating": 4.0, "stay_parameters": "Stayed October 2011", "text": "Carol Turner.", "title": "Good location", "user": "Kjerstim", "date": "October 16, 2011", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 119342614}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "Booked the hotel through Expedia. Lovely hotel in close proximity to the main square. Reception staff very friendly and we were given access to our room immediately (11am). Room was of a very good standard with TV and tea/coffee making available and the bathroom was superb with a super shower and lots of hot water. The breakfast was more than adequate with a good selection of hot and cold food, my only complaint being that it was served in quite a small room with the food presented on a narrow bar which if a number of guests were present together resulted in a bit of a 'traffic jam'.", "title": "November visit to Krakow", "helpfulness": 2, "user": "kmunro28", "date": "December 6, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121450926}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled with friends", "text": "Krakow itself is a very pretty city and is very 'doable' in a few days. We took advantage of the free walks that start each day from outside the large church in the corner of the main square. At 11am there is the 'City walk' which takes place every day and at 3pm the 'Jewish Quarter walk' but this is not available between December and I think March (weather!). Both our guides were very knowledgable with a good mix of history and humour.", "title": "the best hotel i have ever stayed in", "helpfulness": 1, "user": "derry b", "date": "December 1, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121293420}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled with friends", "text": "The staff are so polite and helpfull. The meals are fantastic and worth the wait. A memeber of are party was taken ill and had to go to hospital and with the help of the staff they arranged transport, hotels for somebody to stay with my friend and where to buy the things she needed. They aranged fantastic trips with the aid of a mini bus and driver so good value. I hope to stay again very soon.", "title": "A real gem in Krakow - highly recommended", "user": "Mindenham", "date": "November 29, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121223396}, {"rating": 1.0, "stay_parameters": "Stayed November 2011, traveled with friends", "text": "Seven of us stayed at the Amber Hotel in 4 rooms from Thursday to Monday. The hotel is well placed on a quiet street, just 5 minutes walk from the central old market square. A bank for money exchange and cash machine are conveniently opposite the hotel. You will get a better exchange rate there than in the UK!", "title": "hotel in the center but hopeless staff", "helpfulness": 3, "user": "eric b", "date": "November 29, 2011", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 2.0, "sleep": 1.0, "rooms": 1.0, "location": 5.0}, "id": 121216529}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled on business", "text": "The hotel was scrupulously clean. The heating was good although on our last morning the hot water in the shower was getting a bit cool because of high demand around 08:30 hrs. Rooms were modern, very clean and warm but with adjustable radiators and air conditioning (we didn't need it in November!). There was a safe in each room. A complimentary drink of cherry vodka was waiting in our room when we arrived - a nice touch to go with the big pillows and teddy bear. Complimentary, large, juicy apples were always available in reception.", "title": "Very pleasant weekend", "helpfulness": 1, "user": "Berit2011", "date": "November 23, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 120946764}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled solo", "text": "I booked this hotel based on the reviews on TripAdvisor and I was very pleased. I liked this hotel so much that I would definitely stay there again. An e-mail to the hotel before my trip to confirm my Expedia reservation was answered almost immediately.", "title": "A gem in Krakow.", "helpfulness": 1, "user": "Kathleen1819", "date": "November 30, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 50333765}, {"rating": 5.0, "title": "A Superb Little Hide-a-way next to the Action!", "text": "The hotel is about a 15 minute walk (leisurely pace) from the main train station. If you have wheeled luggage, and are not dragging all your earthly belongings, the walk is fine.", "user": "Hughbass", "date": "November 23, 2009", "id": 49917396}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "The front desk staff is excellent and very welcoming. Everyone at the front desk spoke perfect English. My questions were answered with all the information I needed to plan my day.", "title": "Ab Fab", "helpfulness": 1, "user": "i_luv_gud_times", "date": "November 23, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 49893130}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled on business", "text": "I had a room facing the inside courtyard and it was very quiet. The bathroom was spotlessly clean. Towels were changed daily and there was plenty of hot water and excellent water pressure.", "title": "Wonderful staff, excellent location!", "helpfulness": 1, "user": "TylerW78", "date": "November 17, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 49407408}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "Breakfast was a good way to start the day and more than adequate. There were meats, cheeses, fresh fruit, coffee and tea and wonderful hot Polish pancakes. The breakfast was very filling and I did not need to eat again until late afternoon.", "title": "Beautiful Hotel with friendly staff", "helpfulness": 2, "user": "PTFCscott", "date": "November 15, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 49242776}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "The hotel has everything - fantastic clean rooms, great helpful staff (who speak English very well), excellent location, decent breakfast, awesome powershower and wonderful decor - all you could ever want!", "title": "Brilliant", "helpfulness": 2, "user": "Dazzler-TA", "date": "September 27, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 10010003}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled with friends", "text": "We booked on short notice and were informed that we would need to change rooms halfway through our stay. This was dealt with so professionally there was no interruption to our holiday at all.", "title": "40th Birthday treat", "user": "charliefarley77", "date": "August 29, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 8537430}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled solo", "text": "Great location - 5 min walk from centre, clean, friendly, helpful, good breakfast included in price, BBC World in my room - would recommend", "title": "Good place to stay", "user": "Jeff B", "date": "November 17, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120691854}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled with friends", "text": "We stayed for 2 nights in September with a couple of my friends from the USA, frequent travellers around the globe! We were welcomed by very kind staff on reception, whatever questions and requests we had, the staff were extremely kind and helpful. The hotel offers very cosy, stylish and clean rooms with huge pillows and cherry liquor (as a treat, not minibar!). The breakfast and coffee were good. The hotel is located very close to the Old Market, and a parking lot is closeby (although quite expensive as it is the case in this part of Cracow). We all enjoyed our stay very much and were postively surprised by the quality and atmosphere of this 'hotelik'.", "title": "First-class cosy hotel in a country of big pillows!", "helpfulness": 1, "user": "Sylwia S", "date": "November 15, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 120616068}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "Our 4 night stay in Krakow was absolutely superb. the hotel was warm and comfortable and an easy walk from the centre. The staff at the hotel were very friendly and helpful. We recieved a lot of helpful advice and nothing was ever a trouble. Just cannot wait to go again.We did not realise how much of interest their is to see and do.It was always a pleasure to go back to the hotel after a long and tiring day ,knowing their would be a warm welcome.", "title": "our first trip to poland", "helpfulness": 1, "user": "Nichol C", "date": "November 14, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 120587850}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled with friends", "text": "Stayed here for three nights in late October. Very clean and tidy. Friendly reception staff. Free wifi. Basic breakfast, but did the job. About five minutes walk from the main square etc. Would highly recommend.", "title": "Perfect for short trip with friends, great location.", "helpfulness": 1, "user": "Neil B", "date": "November 12, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 120490241}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "Our 3 night stay at Hotel Amber was brilliant from start to finish. We arrived early afternoon on Sunday 16th October. When we arrived we were greeted by name and given a very warm welcome. The lady on reception when we arrived was fantastic, she showed us a map and marked area’s of interest such as Kazimierz and The Planty. We asked if we could make a reservation at a restaurant for that night and gave the receptionist the name of where we wanted to go and within 2 minutes our reservation had been made for us.", "title": "Brilliant from arrival to departure!", "helpfulness": 2, "user": "Kirst_and_Phil", "date": "October 22, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 119602726}], "location": {"country": "Poland", "region": "Southern Poland", "continent": "Europe"}, "stars": 3, "variance": {"poor": 3, "average": 19, "very good": 111, "terrible": 5, "excellent": 313}, "aka": "Amber Hotel Krakow", "slim_ranking": 0.0550847457627, "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "In the heart of this magical city, right next to the enchanting and picturesque Krakow old town, in a secluded street there is an unusual place, XIX century tenement house, and inside - a little, unbelievably hospitable boutique Amber Hotel with a unique atmosphere. Even though the hotel is situated in the very centre of the old town, only 500 meters from the main square, it manages to remain distant from urban noise. Elegant and functional rooms provide our guests with ideal conditions for both work and relaxation. Comfortably furnished rooms, coffee/tea making facilities, satellite TV, free and fast internet connection contribute to creating a comfortable and friendly place for every guest. The hotel is frequently visited, apart from tourists and businessmen, by renowned personalities from cultural, artistic and political circles. Extremely friendly service, always ready to help, makes it an exceptional place, full of good manners and taste, where every desire of the Guests is immediately satisfied by the professional service."}