{"user_rating": 4.0, "review_count": 41, "name": "Amelia Surf & Racquet Club", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "This was a great place for a family vacation. We rented multiple condos, 3 families were in Building A, which is closest to the Ritz in the complex, and the other family was in building B, a really nice 7th floor 2 bedroom. Overall we had A-127, A-126 and A-133, then B-something… All the condos were clean and more than adequate for our week on the beach. Some had a few more items like beach chairs than others and all were pretty well stocked. They were also very, very quiet. Whatever they use for soundproofing works great - even within the condos.", "title": "Good 4th of July week on Amelia Island - 4 families", "helpfulness": 1, "user": "jodi_123", "date": "July 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 169771452}, {"rating": 3.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "The location is great if you want to spend a lot of time on the beach. The walkway was convenient and the beach is excellent hard packed sand for walking. The two pools were not crowded, even on the holiday and we were always able to get a seat. We enjoyed boogie boarding and hunting for shark's teeth on the beach and used the grill by the parking lot more than once. Another great thing the condos had going for them was the wonderful Kaitlyn who worked with all of our families to get what we needed for all of us to have room and be close together.", "title": "Surf and Racquet Club overview", "helpfulness": 2, "user": "Dave299", "date": "July 23, 2013", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 168741641}, {"rating": 3.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "There were a couple of \"downers\" while we were there. The people they hire to guard the gate do a really great job, especially on the holiday, but there is no reason for them to be nasty. We had an extra parking space at one of the condos and wanted to use it for a friend who was also visiting the family and we gave him the wrong condo number. You would think they were going to shoot him and his wife they were so mean to them. All they asked was for a minute to call and clear it up, once they were able to do that all was OK. The other was a \"funny\" jerk in our building who thought it was hilarious to pull the fire alarm multiple times. We didn't know it was a false alarm, the fire trucks came, when we called the office they didn't know. Well, those jerks (and yes, gee the office did find out it was someone staying there on the 6th floor - they should have been evicted) made my 72 year old handicapped mother cry. She had to slowly walk backwards down 5 flights of stairs while the alarm was blaring and was terrified. And, of course, had there been a real fire later that week, no-one would have evacuated after that so the people that were responsible should have been kicked out. I guess they didn't care and thought it was funny, but it was traumatic for our family and they should be ashamed of themselves.", "title": "A nice complex-but rent from an owner", "user": "jka6123", "date": "July 23, 2013", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 168652793}, {"rating": 3.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "Would we stay again? I would say we would although we probably won't get back that way for a while. Overall the stay was a good one with mishaps that were not really the properties fault (although they should change their policy on kicking out people who are evil and think fire alarms are there for their enjoyment).", "title": "Old; service could stand improvement", "helpfulness": 2, "user": "like2travelAtlanta", "date": "June 12, 2013", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 163769153}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "Great property with most units in fairly good shape. Short walk to beach and nice poolside areas. Leasing office and receptionist are helpful but fairly rude and not as focused on customer service as you would expect from a place such as the Surf and Racquet club. Overall I would recommend this to friends but forewarn of the cold nature of the leasing office and hope that you don't have to interact with them outside of check in and check out.", "title": "Location Location Location", "helpfulness": 1, "user": "Atlanta_GeorgiaTerry", "date": "May 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 160325544}], "location": {"country": "United States"}, "variance": {"poor": 4, "average": 3, "very good": 13, "terrible": 0, "excellent": 21}, "aka": "Amelia Surf & Racquet Club Hotel Amelia Island", "slim_ranking": 0.666666666667}