{"user_rating": 4.0, "review_count": 348, "name": "America Diamond's Hotel", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "My girlfriend and I stayed at this hotel to start our Europe trip and it could not start on a better note....The city is amazing and what made it even more wonderful is that the hotel is on a main street leading the downtown area with a metro right outside the hotel doors. The hotel was really clean and the rooms were tidy and abundant for the two of us. The price was very comparable and there were not secret costs. The internet was free after you asked the front desk to give you the password to log on and it worked without any hassle. The front desk staff was knowledgable and willing to give you directions to where you are going or to guide you to where the Hop On and Off tour bus stop was. This hotel was so centrally located that we were able to walk to most of the locations in about 15-20 minutes or take the metro and it would take you 5-10 minutes. The only thing I could have seen done better is the breakfast arrangement. The breakfasts are not very good, not does it seem like the food was fully cooked but they did not have enough room for everyone so you had to wait for a table and when a table came open, it would take time before the would remove the last individuals plates. That was the only really bad aspect, other than that....the Hotel was amazing!!", "title": "Excellent, Excellent and Excellent", "helpfulness": 1, "user": "Alleria83", "date": "June 22, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 32913689}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "After hours and hours and hours of consulting online and travel guide reviews, we were overwhelmed with information and just decided to go with the Trip Advisor \"Top Value\" recommendation. Once again, Trip Advisor members steered us in the right direction.", "title": "Best value--great service, first-rate facility & breakfast included!", "helpfulness": 3, "user": "SpringboroTraveler", "date": "May 10, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 29694639}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "The hotel has been recently renovated and felt clean and new (with housekeeping service nightly). The staff was very helpful (our first time in Lisbon--so we needed more than a few pointers). As you know, or will know, there is no shortage of steps in Lisbon. The multi-story hotel had steps, of course, but also two elevators. As we were traveling with my husband's mother and step-father (who were tired after an afternoon of walking this hilly city), the elevators were a welcome treat.", "title": "Great Value for Money", "helpfulness": 1, "user": "timok", "date": "March 23, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 26650866}, {"rating": 4.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "The continental buffet breakfast (included in the price of the room) was very nice, with lots of choices. Pastries and rolls, fruit, deli meats & cheeses, yogurt, cereal, coffee, tea, and more were continually replenished. It was nice to not have to leave to find breakfast before starting our day. And, with what the dollar was trading for against the Euro on the days of our stay, the included breakfast made the hotel an even better value. Room service is available at an additional charge (we did not use room service).", "title": "Great value, bright and clean room", "helpfulness": 2, "user": "shenmue", "date": "February 25, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 25158357}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "I have no hesitation in recommending this splendid hotel. Location, value for money and comfort makes it a top choice. Only a 10 minute speedy ride from the airport, this very modern hotel is central (the metro is on its doorstep), very clean and has all the facilities needed for a city break. A very filling breakfast, hot water, comfortable bed and internet connection (though it's not free to use the hotel computers in the foyer), the hotel ticks all the right boxes. I really don't think we could have chosen any better. The only downsides: Staff could be more friendly, the silly name of the hotel!", "title": "A diamond choice", "helpfulness": 1, "user": "BillParis", "date": "November 9, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 4.0, "rooms": 5.0}, "id": 48806139}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "Very modern hotel just 5 paces from the Metro and then a couple of stops to the centre. The room was a reasonable size, nicely furnished if a little dark because of the narrow vertical window. There was a mini-bar.", "title": "HIGHLY RECOMMENDED", "helpfulness": 1, "user": "billtheblue", "date": "October 27, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 47905362}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled with friends", "text": "The breakfast room was also very modern and the breakfast itself was excellent; fruit salad, cereals, rolls etc.,scrambled eggs, mushrooms and bacon, toast, yoghurts and a selection of fresh fruit. There is also a coffee machine and a selection of teas and grapefruit or orangejuice.", "title": "Ideal for the Metro", "user": "karlmarxist", "date": "October 17, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 3.0, "service": 4.0, "rooms": 3.0}, "id": 47091271}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled solo", "text": "Our only criticism of this excellent hotel was the bathroom layout. The position of the sink meant that you had to squeeze between the sink and the WC to get to the bath/shower. It would have been much better to have positioned the sink on the opposite wall.", "title": "this is a good hotel", "user": "divinidylle", "date": "September 29, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 3.0}, "id": 45444956}, {"rating": 3.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "The staff were friendly and pleased to help with any enquiry.", "title": "Good hotel with good location", "helpfulness": 3, "user": "Raphael F", "date": "September 10, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 3.0}, "id": 40579700}], "location": {"country": "Portugal", "region": "Estremadura", "continent": "Europe", "city": "Lisbon"}, "stars": 3, "variance": {"poor": 7, "average": 42, "very good": 185, "terrible": 7, "excellent": 107}, "aka": "America Diamonds Lisbon", "slim_ranking": 0.281818181818, "description": "Our Hotel was total reconstructed in 2006 on a historical building, keeping only its original façade, contrasting with its modern and comfortable interior, equipped with 60 comfortable rooms of different typologies."}