{"user_rating": 2.0, "review_count": 28, "name": "Americas Best Value Inn Stamford", "reviews": [{"rating": 1.0, "stay_parameters": "Stayed March 2012, traveled solo", "text": "Let me cut to the chase--- the only people I can imagine wanting to stay here are prostitutes, drugs addicts, or High School kids who cant get into anywhere else. Or perhaps the unfortanate high way traveler who just need a place to crash and donest know any better. The place is downright seedy. The rooms in themselves are disgusting. I would imagine that back in 1980 or so the place might have been passable, but it's a joke now. Disgusting old bathrooms, unclean rooms, old beds and TVs, shady characters everywhere, scary and unsafe hallways, a bulletproof check-in counter, ect ect. And what makes me laugh is that prices are still pushing $100, with \"hourly\" rates availabe. I would think that even for someone brave enough to stay here, paying anymore then $40 would seem outrageous. A tip for Americas best value--Either take your name off this hotel, or clean it up. You dont want to be assoticated with this place. There are a couple other 1 or 2 star chains in Stamford that are miles better then this place, and at similar prices.", "title": "Shady and creepy, and not even priced closed to what it should be.", "helpfulness": 2, "user": "icem2829", "date": "January 28, 2013", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 3.0}, "id": 150858971}, {"rating": 1.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "Bad traffic forced an early stop on our way to Boston, The place seemed OK at first: kinda run down, but everything worked. Then, at 2am, the office calls US to see if we're the ones making all the noise! No, but it seems there were a bunch of punk kids who got two rooms for a party, complete with booze, smoking and blaring music. It seems the night \"manager\" was randomly calling rooms to see where the problem was. After calling him back about every 15 minutes, he finally WENT to the rooms and threatened to call the police to get them to leave - which they did, at 5 AM! note - he even had the audacity to reply to one of our continued calls with a whiny \"but no one is answering the phone\". YA THINK?!? Perhaps it was unplugged or they just couldn't hear it above all their noise, huh?", "title": "sleepers need not apply", "helpfulness": 5, "user": "Bob d", "date": "January 15, 2013", "detail_rating": {"service": 1.0, "cleanliness": 2.0, "value": 3.0, "sleep": 1.0, "rooms": 2.0, "location": 3.0}, "id": 149765042}, {"rating": 2.0, "stay_parameters": "Stayed October 2012, traveled with friends", "text": "So, three hours of lost sleep due to ineffective management - and then no offer for compensation of any sort!", "title": "Bates Motel?", "helpfulness": 5, "user": "Michael W", "date": "November 13, 2012", "detail_rating": {"service": 3.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 2.0, "location": 3.0}, "id": 145303500}, {"rating": 1.0, "stay_parameters": "Stayed October 2012, traveled on business", "text": "I stayed in this hotel because of how close it was to NY and frankly, not my first choice. The other person i shared the room with had a cigarette burn in his mattress and my pillow case had major stains on it. Seedy motel in a ok area of Stamford.", "title": "GRUESOME !", "helpfulness": 7, "user": "SEAJourney", "date": "October 13, 2012", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 1.0}, "id": 142696158}, {"rating": 1.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "First, I want to apologize for any negative thing I have ever written about any other hotel or motel,", "title": "Disgusting and sketchy doesn't begin to describe it...", "helpfulness": 5, "user": "Brent D", "date": "September 4, 2012", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 1.0}, "id": 139424369}, {"rating": 2.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "I travelled there at thanksgiv wkend with my husband .. had a very painful experience:", "title": "Simply avoid", "helpfulness": 4, "user": "P C", "date": "December 1, 2011", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 3.0}, "id": 121284521}, {"rating": 2.0, "stay_parameters": "Stayed October 2011, traveled with friends", "text": "1. I requested for a microwave when booking - never got it - there was a young Indian woman who promised me everytime to get it to my room - she was the greatest lier I have ever seen in my life", "title": "Look Elsewhere", "helpfulness": 7, "user": "CaTravel7", "date": "October 11, 2011", "detail_rating": {"service": 3.0, "cleanliness": 1.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 3.0}, "id": 119194139}, {"rating": 1.0, "stay_parameters": "Stayed October 2011, traveled with friends", "text": "(this is not any sort of racist comment..but being an Indian myself, I was expecting better & responsible behavior from this lady)", "title": "Whoever says this pig-sty is even slighty ok is a liar!!", "helpfulness": 6, "user": "septknows", "date": "October 6, 2011", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 2.0, "sleep": 2.0, "rooms": 1.0, "location": 2.0}, "id": 119020167}, {"rating": 1.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "2. None of the food vending machines in this hotel worked...it was very rainy that day & even for small snacks, we had run to the nearest gas station in the torrential rain", "title": "Disgusting", "helpfulness": 7, "user": "MarkFDM3", "date": "September 24, 2011", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "service": 1.0}, "id": 118547929}, {"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled solo", "text": "3. The TV remote didn't have any battery (although they provided one when asked for..that the only thing we thankfully got from them)", "title": "Excellent stay.", "helpfulness": 4, "user": "nikunjpatel27", "date": "April 6, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 103094263}, {"rating": 1.0, "stay_parameters": "Stayed February 2011, traveled with family", "text": "This hotel does not look like the picture on this website. I stopped at this place on my way to Boston from Washington with my family. The staff seems to have no concept of customer service, as at the check in the manager refused to show me the room and also refused to provide me any extra sheet/blanket as he stated he was ALONE at the hotel at night. I only stopped at this place as my children were very edgy after a long drive otherwise I would have never dared to come here. I was looking forward to the breakfast but it turned out to be extremely poor with no eggs (the people who came in early finished these off) and only cheap diet milk. NEVER EVER STAY THERE!!!", "title": "Bad place to say - no customer service.", "helpfulness": 13, "user": "famalik", "date": "March 2, 2011", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 1.0}, "id": 98720513}, {"rating": 2.0, "title": "Not exactly \"newly renovated\".", "text": "The room(236) was not even remotely new. The thin carpet and the bathroom vanity and tiles may have been newer, but that was it. Room furnishings were a minimum of 10 years old, and not in the best condition. I thought that since the hotel recently went from being an independent(Stamford Motor Inn) to being part of a franchise(America's Best) that the place would be a little better than it was.", "helpfulness": 11, "user": "A TripAdvisor user", "date": "January 17, 2011", "id": 93442329}, {"rating": 1.0, "stay_parameters": "Stayed December 2010, traveled on business", "text": "Bottom line: America's Best Value apparently has very low(or no) standards when it comes to hanging their sign on a building.", "title": "avoid this place...", "helpfulness": 11, "user": "rjkromeny", "date": "December 25, 2010", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 3.0, "sleep": 1.0, "rooms": 1.0, "location": 5.0}, "id": 90676811}, {"rating": 1.0, "stay_parameters": "Stayed June 2010, traveled on business", "text": "i travel frequently for business, and i never before have written a negative review of a motel. but this place bears NO resemblance to the web-site page. NO wifi; service desk does NOT answer phone; desk clerk does not speak english w. any fluency (i wanted a smoking room; clerk kept saying 'jacuzzi' (???); tv does NOT respond to remote (tried 2 remotes...) after 6 'clicks' (???); 1/2\" GAP at bottom of door...cold air and snow blew in all night; LOUD restaurant/music on premises; only one ice machine on premises; heat DOES work well (thank goodness...see 'gap' above);", "title": "Very Nasty Place", "helpfulness": 13, "user": "GOtraveler1967", "date": "June 20, 2010", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 2.0, "sleep": 1.0, "rooms": 1.0, "location": 2.0}, "id": 68062979}, {"rating": 1.0, "stay_parameters": "Stayed October 2009, traveled with family", "text": "When I checked in to this hotel for a non-smoking room I was asked to wait while the front desk person ran to the room with a box of carpet freshener. I waited for about 10 minutes for him to return and check me in. Once he came back and checked me in I walked to my room and there was carpet fresh all over the floor and the walls were all half painted. I could smell smoke in the room and the it was dirty. I pulled the sheets back and there were black hairs all over the bed sheets. I complained at the front desk and they moved me but my next room was just as bad. I stayed there for about a week and figured out that the people that work in the hotel also live in the hotel. They also have cats and this is why the bed sheets have black hair all over them, I guess they allow the cats to hang out in the bed while they pretend to clean the rooms. Also, you can book on line for around 60.00, if you book at the hotel in around 90. There is no way I'd ever pay around 90.00 to stay in that dump. Oh, they also have roaches.", "title": "They should have paid us to stay there !", "helpfulness": 11, "user": "jennaxx", "date": "November 8, 2009", "detail_rating": {"cleanliness": 1.0, "value": 2.0, "location": 3.0, "service": 1.0, "rooms": 1.0}, "id": 48789075}, {"rating": 1.0, "stay_parameters": "Stayed July 2012, traveled on business", "text": "Arrived at this hotel alone via taxi after 16 hours of international travel 4th of July weekend. Thursday July 5, 2012. Checked in around 11:30 p.m. was in bed sleeping by 12 midnight. By 2:00 a.m. I was awoken by a burning sensation on the right side of my chest. When I pulled back the covers and checked the sheets, there it was a BED BUG! I immediately brought the bed bug (dead by this time after I squashed it) and showed it to the night manager. He refunded me right away but was extremely rude about it initially. He also denied knowing anything about the hotel having bed bugs (please read the previous post regarding a different guest and bed bugs). Long story short he eventually, after about 2 hours of my waiting in the lobby (trying to figure out my next course of action considering the late hour and uncertainty of finding a hotel in close proximity with available rooms), he offered me a different room at no cost which I took but DID NOT dare sleep in that bed. I actually slept in the chair in the room, after nursing the multiple bite marks now welting all over my body as a result of the bed bug bites and counted the 6 hours till daylight at which time I immediately left this deplorable hotel.", "title": "WARNING BED BUGS ROOM 225", "helpfulness": 7, "user": "Lady F", "date": "July 6, 2012", "detail_rating": {"cleanliness": 1.0, "sleep": 1.0, "service": 1.0}, "id": 133628524}, {"rating": 1.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "Every bad thing you read about this play is true, but multiply it by 10. OMG, this play should be condemned. Dirty, chunks of soap in the tub draip, pubic hairs in the shower, stains on the bathroom walls. Furniture was old and scratched. Carpet was gross, had an oder. We slept on top of the covers, didnt dare to sleep uner them. As we were walking to our room there was a guy next to us that had a large Rambo type knife sitting on the A\\C outside the room. We went into our room and closed the door and put a chair up against the door. We slept with one eye open. It was a long night to say the least. Avoid this place at all cost..", "title": "AVOID-AVOID-AVOID!!!!!", "helpfulness": 3, "user": "Slaramie", "date": "July 5, 2012", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 1.0}, "id": 133540757}, {"rating": 1.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "i stay there in march 2 for one night and one off the bed had bed bugs that all i need to say", "title": "my stay", "helpfulness": 3, "user": "darlinedenis", "date": "March 27, 2012", "detail_rating": {"service": 3.0, "cleanliness": 1.0, "value": 3.0, "sleep": 1.0, "rooms": 1.0, "location": 3.0}, "id": 126733483}, {"rating": 3.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "Beware there are ghetto drugged up drunk people outside yelling until 1:30-ish am. There's like a club on top of the front office so they hang outside. Police drive by a few times when the club gets out to make sure everyone has left.", "title": "Don't stay here alone", "helpfulness": 2, "user": "allison c", "date": "February 10, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 1.0}, "id": 124372995}], "location": {"country": "United States", "city": "Stamford"}, "stars": 2, "variance": {"poor": 4, "average": 4, "very good": 3, "terrible": 17, "excellent": 0}, "aka": "Americas Best Value Inn Stamford Hotel Stamford", "slim_ranking": 0.928571428571, "description": "Americas Best Value Inn is conveniently located off of I-95N Exit 9, in the beautiful shoreline city of Stamford, Connecticut. Our hotel is within minutes of the area's most popular attractions including Stamford Town Center Mall, Landmark Square Cinema, Lockwood Mansion, Island Beach, Bartlett Aboretum, University of Connecticut Stamford, Dolce Convention Center, and Stamford Museum and Nature Center. Enjoy a delicious meal at our on-site restaurant \"Exit 9 Cafe\" or visit one of the restaurants within a mile of our hotel including Subway, Smokey Joe's BBQ, Brasitas Restaurant, Villa Italia Ristorante, and Giovanni's Serious Steak House. Our 24-hour staff is here to make our pet friendly hotel your home away from home. Guests are treated to free wireless high-speed Internet access, free daily continental breakfast, free local calls, free parking, use of our on-site business center, Rooms feature a radio, desk with lamp, alarm clock, satellite/cable TV, in-room safe, and wake-up service. At Americas Best Value Inn Stamford, We've Got You Covered from the time you hit the road until your head hits the pillow."}