{"user_rating": 4.0, "review_count": 45, "name": "Americas Best Value Inn", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "I was a little disappointed this stay. We've stayed at this Super 8 several times, our daughter goes to college nearby. Perhaps because it was the weekend of graduation that they were unable to put us in as nice of a room as we had stayed in on previous visits. The room had an unpleasant musty odor when we arrived. We were just dropping our luggage and going out to eat so we opened the window. When we returned it wasn't so bad. We were on the first floor and the second floor creaked when the upstairs guests walked around and they walked around a lot. The breakfasts have always been outstanding but on this stay they didn't offer the \"make your own\" waffles. The other things that were offered were nice and fresh (baked goods, fruit and coffee). Over all a good stay, we'll stay there again.", "title": "Good stay, previous stays were excellent.", "user": "RiderXB12x", "date": "June 20, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 32741013}, {"rating": 4.0, "stay_parameters": "Stayed May 2009, traveled solo", "text": "I stayed at this motel in May 2009 during a solo road trip exploring northern Michigan. The Super 8 was a decent place to stay. It had no frills (no pool or computer for guests to use), but it was clean and comfortable. Breakfast was all right. The staff were friendly enough, but they didn't go out of their way to be extra welcoming or friendly.", "title": "Comfortable, clean, no frills - decent place to stay for the night.", "user": "New_friends_GR", "date": "May 4, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 29342840}, {"rating": 4.0, "stay_parameters": "Stayed July 2004", "text": "For the price I paid, it was acceptable. Nothing fancy, but I slept well and it was cozy in a way. :-)", "title": "Nice room Great Breakfast!", "helpfulness": 6, "user": "flowerladytoo", "date": "May 30, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 3.0}, "id": 5235486}, {"rating": 3.0, "stay_parameters": "Stayed April 2006", "text": "Stayed here for 3 nights in July 2004. We had a whirlpool *suite* but it was really just a basic room with a small whirlpool stuck in the corner. It was nice though after a long day of walking to relax in there, both of us nearly fell asleep. The biggest gripe we had with this hotel was the bed...the matress was fine but the sheets didn't fit and kept coming off and had pilling on them. I just couldn't sleep well on them. The third day hubby talked to the manager and they knocked 20.00 off our room rate per night for the inconvenience...and when we came back we had sheets that fit and were not pilled. The breafast was great but the breakfast room was very small and overcrowded. There was lots of selection though and we started each morning with a great meal...they kept it well stocked right til the end of breakfast. Overall it was a great stay and we would do it again :)", "title": "The Super 8", "helpfulness": 3, "user": "JimZim", "date": "April 30, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 5020754}, {"rating": 5.0, "stay_parameters": "Stayed October 2005", "text": "The Super 8 was a great place to stay. The room was clean. The room had a recliner so you didn't have to sit on the bed to watch TV. One problem we had was the bed matress was very hard.", "title": "This Super 8 Motel was just that, Super", "helpfulness": 4, "user": "SooBoy2003", "date": "November 3, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4082341}, {"rating": 3.0, "stay_parameters": "Stayed May 2009, traveled on business", "text": "I stayed one night at the Best Value Inn in Amsterdam as part of a music festival. After reading some of the reviews I was a little nervous, but this hotel turned out to be just fine.", "title": "Clean, one star hotel", "user": "Bandlady", "date": "June 1, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 3.0, "service": 4.0, "rooms": 3.0}, "id": 31342717}, {"rating": 4.0, "stay_parameters": "Stayed June 2008, traveled with friends", "text": "Check in was a breeze. My room had definitely seen better days, but everything was clean and smelled fresh, which are the two most important things to me. The bathroom was outdated, but everything worked just fine and the shower was actually quite pleasant! One suggestion I would make is to be sure to ask for a room that is not facing toward the train tracks, which are a block away. Trains do run all night, but on the opposite side of the hotel I was able to sleep with no problem. There is a $7.95 breakfast buffet, but I chose to drive to a nearby fast food place for something a bit cheaper. Although I probably would not choose to stay here again (there is a Super 8 near the Thruway), the hotel was fine for one night, and definitely does not deserve the negative reviews others have given it.", "title": "Accommodating and Friendly", "user": "wtbyct", "date": "July 1, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 3.0, "value": 3.0, "location": 5.0, "rooms": 3.0}, "id": 17403446, "likes": {"liked": "— The staff and location", "disliked": "— No opinion"}}, {"rating": 1.0, "title": "The worst!!!.", "text": "We stayed at the Americas Best Value Inn for a motorcycle event in June. Although this is not a five star hotel the staff made it feel that way. The rooms are clean and provide everything you need for a good nights rest. From the time we checked in until we left the staff was excellent! Anything we needed they were more than happy to accommodate. Elizabeth and Gail, thank you for your advice on things to do in the area and the great smiles we received. Rita - our bartender - you did a fabulous job providing our beverages and enjoying the craziness . If you happen to be there to have a bite to eat - I would definately recommend the burgers - yummy.", "helpfulness": 1, "user": "lpunal", "date": "June 17, 2008", "id": 16995319}, {"rating": 1.0, "stay_parameters": "Stayed December 2006, traveled on business", "text": "To all of the staff - Thanks for a job well done!!!", "title": "Rude Management", "user": "skeletonocean", "date": "July 26, 2007", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 1.0, "cleanliness": 3.0, "value": 1.0, "location": 2.0, "rooms": 2.0}, "id": 8239593, "likes": {"liked": "— The closeness to the hospital was nice.", "disliked": "— I intently disliked the rudeness from the women running the hotel."}}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "I guess you can call me a bit picky when it comes to service and cleaniness. This motel met my expectations. I got a good price that I booked thru Orbitz. Had no hassle and actually got a better rate when I got to the motel. I paid an average of $45 a night. The continental breakfast was very nice. We took the sausage biscuits and breakfast burritos back to our room and cooked them in our in room microwave. The asst manager, Rahul, went over and beyond in his services. Many times, in passing, I heard him say, \"If you need anything, you come to me, I will get it for you!\" When he was there, and it was during the breakfast times, he would be in the kitchen offering his services to other guests. The linens were clean, smelled of bleach and changed everyday. The only problem we had was using our GPS to get to this location. It was wrong. I would advise to use mapquest or call them for directions when near the area.", "title": "Perfect stay", "helpfulness": 2, "user": "budnjules", "date": "March 14, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 100122834}, {"rating": 3.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "This hotel is not new but had been kept up very well. We had a suite with king-size bed, flat panel tv, minifridge, microwave, coffee maker, ironing board and iron, desk with free wi-fi and a very comfortable easy chair with ottoman, all for about $50.00/night. Other hotels in the area charge $89-$109 per night.", "title": "A very good value", "helpfulness": 1, "user": "homer0729", "date": "December 9, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 89451431}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled with family", "text": "We had low expectations for such a low price but were very pleasantly surprised by the facility and the service. The continental breakfast was more than adequate. There was a washer and dryer available for guests to use. Also there were restaurants and a grocery story within walking distance. I would definitely stay here again, and recomment it to anyone wanting a clean place to stay in that area.", "title": "Could not have found a better place if I tried!", "user": "lilipie", "date": "June 12, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 32213243}, {"rating": 1.0, "stay_parameters": "Stayed November 2007, traveled with friends", "text": "W", "title": "Bad Visitor", "helpfulness": 3, "user": "2travelers37", "date": "November 15, 2007", "detail_rating": {"cleanliness": 1.0, "front_desk": 2.0, "location": 4.0, "rooms": 1.0}, "id": 10842166}, {"rating": 4.0, "title": "Great Place to stay!!!!", "text": "I was traveling with my small daughter across West Texas on I-10 and could not face going through San Antonio on a Friday rush hour, so I pulled in and saw the sparkling pool and then went in and saw the beautiful lobby and was sold. GREAT room. Had everything I wanted, breakfast, fridge, microwave, very comfy new beds and a view of the Texas Hills. Fantastic! Very cute German town with many diverse restaurants.", "helpfulness": 2, "user": "Tchwawa", "date": "March 16, 2007", "id": 7171372}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "My husband and I are staying here tonight. The location is excellent, just off the freeway, I 75. The staff is friendly and we have in room free Wi Fi. Coffee and tea are available 24 hours and there is also a coffee pot in the room. The hotel is clean and comfortable with a complimentary breakfast that we are looking forward to. This hotel is an excellent find and truly value for the $ spent.", "title": "Great Value for the Price", "helpfulness": 1, "user": "tacopat", "date": "July 28, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115937756}, {"rating": 5.0, "title": "Will go back anytime", "text": "This is a very polite and clean Hotel. The employees are very nice and will help you when you need. Rooms are very clean and just the right size", "user": "thisname01", "date": "July 26, 2011", "id": 115815114}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "The GM, Kim, was very helpful. The front desk staff were friendly and helpful.", "title": "Very Clean", "user": "mrspatti", "date": "July 17, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 5.0, "service": 4.0}, "id": 115465859}, {"rating": 4.0, "title": "Great value", "text": "This hotel provided a great value for our stay in the Soo. It wasn't my first choice but other hotels were already booked. It turned out to be just fine. The bathroom was small as others have said, but adequate. We had a room with two queen beds, one was pretty soft, the other hard. Pillows were very thin, but two more pillows were available in our room already, so we were okay. Breakfast included waffles, bread for toasting (peanut butter, jelly, and butter available), boiled eggs, two cereal choices, instant oatmeal, mini muffins, and fresh apples. There was Folgers coffee, hot chocolate packets, tea bags, and apple and orange juice. There was a computer in the lobby for customer use. Staff was very friendly and helpful. Located next door to the police dept. A little traffic noise, but not too bad. Walls were thin, I am glad we were on the second floor. I would stay again for a one night stay, longer than that, I like a pool and more breakfast choices.", "helpfulness": 2, "user": "greecer", "date": "June 26, 2011", "id": 114777143}, {"rating": 3.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "The room was clean and would stay again. Close to the Sault Ste Marie locks and highways. We were just travelling through and this hotel fit our needs. It was very easy to find. We requested extra pillows and had no problem in having them delivered to our room promptly.", "title": "Friendly", "user": "Hobbes20", "date": "July 6, 2010", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 69884111}, {"rating": 4.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "My husband and I take an annual trip for my birthday, just going to various spots in Michigan. We decided for a trip to Sault Ste. Marie as this year's getaway. We chose Super 8 because of positive reviews on Trip Advisor but also because they accepted pets.", "title": "Clean and Comfortable", "helpfulness": 1, "user": "Judy T", "date": "March 2, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 57529708}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "Because I'm a germophobe, I get a little anxious about cleanliness because I am aware (and have experienced) that other pet owners are not as hygenic (in the room or out) as we are. While I did notice waste outside because a lot of pet owners do not take responsibility, the room itself was VERY clean and I felt utterly at ease in the room.", "title": "Tried some of the rest, but we keep coming back to the best", "user": "jahoduluth", "date": "August 30, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 39255912}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "There is no \"luxury\" here (Say Amway Grand or even Marriott) but everything we needed was there. We asked for a fridge and microwave -- they were in the room; we needed another pillow; it was provided immediately.", "title": "Typical Super 8, clean room, good location", "user": "mtcp", "date": "August 5, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 36849424}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "This property is owned and operated by an independent company under agreement with Super 8 -- since I've never stayed at a Super 8 before, I don't know if that makes a difference in the friendliness and cleanliness of the property.", "title": "Great place", "user": "Floyd22", "date": "July 31, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 36312164}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled on business", "text": "The breakfast buffet was mostly carbs -- it did provide the popular bavarian waffle, yogurt, cereal, toast, mini muffins, oatmeal -- no protein to speak of. However, the price was great, the room clean, had everything we needed and our little (under 15 pounds) mini dachshund enjoyed himself.", "title": "cleanest, best service, classy, best hotel we stayed in.", "user": "NovaScotiaBound", "date": "June 30, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 33558996}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled with family", "text": "This place was very nice. Price was reasonable and the room was good and clean. The front desk service was just exceptionally good! Always very polite and gracious. The breakfast was very nice, too. I'd stay here again.", "title": "Good place, Great service", "helpfulness": 1, "user": "MaggieP6789", "date": "November 19, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 120801254}, {"rating": 3.0, "stay_parameters": "Stayed November 2011", "text": "I could see deep impressions in the bed as soon as I walked in. The nasty scent of air freshened was overpowering. I pulled back the horrible thin worn out bedding to find a fitted sheet that didn't fit! A king size bed with the little pillows. The soap tray is hanging by a thread in the shower. The TV must be 10 years old. This place is gross! I can't believe the low standards of the people who wrote such glowing reviews that landed me in this dump. The ottoman is filthy. Never again.", "title": "Outdated, run down.", "helpfulness": 4, "user": "ArcherSLO", "date": "November 17, 2011", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 3.0, "service": 4.0, "rooms": 2.0}, "id": 120725781}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "I stayed here for three nights when I moved from Virginia and my apartment wasn't ready. I was exhausted from a 4 day drive with 2 cats. The family that runs this motel were friendly, helpful, kind, and very welcoming. The room was comfortable, great water pressure in the shower, it was clean, and convenient to everything. Close to freeway but room was very quiet! I felt safe and at home there.", "title": "This place was terrific!", "helpfulness": 2, "user": "kkjimspq", "date": "August 18, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116914101}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "We enjoyed our stay...very clean room, comfortable bed, the front desk people were so very accomodating..great location...will definitely stay there again as we frequent Boerne several times a year...would definitely recommend this property..", "title": "Great place to stay", "helpfulness": 2, "user": "simonGranbury", "date": "June 15, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 113721244}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled on business", "text": "I live in Bergheim, Tx. 30 minutes from Boerne. I enjoy staying overnight to get away sometimes for a week. I am semi-retired. I know all B&B’s here. I was not aware of this one until I called the Chamber of Commerce from reference. As soon as I called, I felt the warming service from Mr. Rahul Dodhia, Asst. Mgr. I liked the competitive prices and gave the hotel a try. WHAT A SURPRISED. Got a clean like new room with King size bed, flat HDTV, well decorated and kept room. In addition, they provide B-fast and DAILY ROOM SERVICE (lacked by others). Visitors, stay away from “Key to the Hills Motel and/or Spinelli's Boerne Bistro B&B Motel. They stink. Hurray for Americans Best Value! This is the purpose for my time used in this review. Keep doing a super good job.", "title": "Unexpected great service and state of the arts accommodations", "helpfulness": 3, "user": "kuhlarrow", "date": "March 29, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 102099612}], "location": {"country": "United States", "city": "Sault Ste. Marie"}, "stars": 2, "variance": {"poor": 1, "average": 8, "very good": 17, "terrible": 2, "excellent": 17}, "aka": "Super Eight Sault Sainte Marie", "slim_ranking": 0.411764705882}