{"user_rating": 2.0, "review_count": 69, "name": "American Host Motel", "reviews": [{"rating": 1.0, "stay_parameters": "Stayed June 2008, traveled on business", "text": "Having previously lived on Cape Cod I would drive by this motel almost on a daily basis on my way to work. As my previous post states, at times I do require a hotel/motel room on Cape Cod to avoid the Summer traffic as I now live on the South Shore. I am amazed with the over-inflated prices for hotels and motels on Cape Cod. This motel looked \"OK\" from the street. As I turned into the property from rte 28 I then noticed the large amount of bicycles chained and lock to every inanimate object. Your unable to view this phenomenon from the street until you enter the property because of the narrow entrance. I then realized I had entered a motel that rents out on a weekly basis i.e. \"affordable housing\" My observation was confirmed when I entered the lobby and witnessed several residents rummaging through the communal post office box looking for their mail. My assigned room smelled like a smoky bar.... \" Of course it's going to smell like a smoky bar, someone has lived in it all winter smoking cigarettes! \"", "title": "Same old Rat Hole on the rte 28 Motel Mile", "helpfulness": 3, "user": "scott s", "date": "July 1, 2008", "detail_rating": {"cleanliness": 1.0, "front_desk": 1.0, "value": 1.0, "rooms": 1.0, "service": 1.0}, "id": 17407439, "likes": {"liked": "— My earplugs, Ambien tablet and the AC actually worked!", "disliked": "— I'm embarrassed that I stayed at this motel."}}, {"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled with friends", "text": "Motel opportunities are limited in the Hyannis/South-West Yarmouth/Dennis area. You also have to consider that most motels are rented out weekly/monthly off season and most of the motels on rte 28 are atleast 50 - 60yrs old with limited updating.", "title": "Reasonable motel", "user": "RitwikSinha", "date": "May 14, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 2.0, "rooms": 4.0, "location": 2.0}, "id": 16040101, "likes": {"liked": "— Price"}}, {"rating": 1.0, "stay_parameters": "Stayed October 2007, traveled with family", "text": "As of one week ago the rack rate was $56.00 The Summer rates are now $110.00+ . Please look elsewhere, you'll thank yourself.", "title": "Terrible!!!!!", "helpfulness": 3, "user": "qtp", "date": "October 9, 2007", "detail_rating": {"cleanliness": 1.0, "front_desk": 3.0, "location": 3.0, "value": 1.0, "rooms": 1.0}, "id": 10061057, "likes": {"liked": "— Nothing", "disliked": "— Everything"}}, {"rating": 1.0, "title": "overpriced, moldy, rude hotel", "text": "I see a lot of really bad reviews for this place, but I just wanted to mention that we did not have such a bad experience there. We were scared after reading some of the reviews, but found our room to be in pretty decent shape. We did not see any mold in our room/restroom. The location is not great, you will have to drive to beaches. We also had (the basic motel) breakfast. Don't expect anything fancy, you did not pay for it.", "helpfulness": 3, "user": "karenv1500", "date": "October 8, 2007", "id": 10055314}, {"rating": 1.0, "title": "Terrible", "text": "This motel needs Hot Water and Bleach!! We checked out early .", "helpfulness": 3, "user": "jetkgt", "date": "October 8, 2007", "id": 10054879}, {"rating": 1.0, "title": "There Are No \"Newly Renovated Rooms\"", "text": "The room smelled so bad and the staff is really rude! Broken bathroom fixtures, stained soiled bedspreads etc. That placed should be inspected by heath officials... yes, it is that bad. There's activity all night, including someone being arrested after a bad fight while I was there - worst stay of my life so far. I asked for a non-smoking room and I got a stinky room, when I asked for a refund they said that because of FULL Capacity he would not refund my money and that he had turned people away because of that - lucky them. By the way, their next door neighboor is operated by the same stinky people...", "helpfulness": 5, "user": "A TripAdvisor user", "date": "September 4, 2007", "id": 8619442}, {"rating": 1.0, "title": "all negitive reviews right on the money!", "text": "I was looking for a hotel here for next weekend down in the cape and saw THE AMERICAN HOST\"! i had to check it out. i was going to stay there one night but demanded my money back! back in 2004, our room had a black and white tv, bed was broken and feared it was not \"clean\". the bathroom had that brownish ring around the bowl, the sink was obviously home to moths. MOTHS!!! i laughed to my girlfriend and said this was pathetic and as i opened the shower, at this point expecting a body, there were japanese bugs all over the tub. my girlfriend freaked out and went to the car. true, the pool was nasty. i wish i had a camera with me to take pictures of all this. maybe i'll stop by there on my way to The Cove, which is an awesome hotel; and maybe try to get some pics. anyway, the place was a dump and i did get a refund. but how ironic when i go back in to the office, i see a \"NO REFUND\" sign. placed so secretly you don't notice when you originally walk in! plain and simple, DO NOT STAY AT THE AMERICAN HOST!", "helpfulness": 7, "user": "tjg101079", "date": "August 7, 2007", "id": 8370068}, {"rating": 1.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "AMERICAN HOST! NOT AMERICAN AT ALL!!!!", "title": "american host is totally gross!!!", "helpfulness": 6, "user": "Cyn79", "date": "July 19, 2007", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 2.0, "location": 4.0, "rooms": 1.0}, "id": 8192999, "likes": {"liked": "— Nothing!", "disliked": "— Everything!"}}, {"rating": 1.0, "title": "Run away from here!", "text": "Thing place is 100% gross! You would be better off sleeping out on the street!", "helpfulness": 7, "user": "Ron-Travels-America", "date": "July 8, 2007", "id": 8078490}, {"rating": 1.0, "stay_parameters": "Stayed June 2007, traveled with family", "text": "Room: Carpet was dirty! No screens on windows! Bathroom had mold the tiles & all over the bottom of the shower curtain! The fitted sheets were flat sheets which would fall off the bed. The AC was broken and had a piece of paper which was holding the vent open so the air could come out!", "title": "Run away as fast as you can", "helpfulness": 5, "user": "TOMMYSGIRL41", "date": "June 26, 2007", "detail_rating": {"cleanliness": 1.0, "front_desk": 1.0, "location": 3.0, "value": 1.0, "rooms": 1.0}, "id": 7999506, "likes": {"liked": "— NOTHING", "disliked": "— EVERYTHING"}}, {"rating": 1.0, "title": "Very Poor Choice", "text": "Stay AWAY from this HOLE!!", "helpfulness": 11, "user": "A TripAdvisor user", "date": "July 5, 2005", "id": 3637866}, {"rating": 1.0, "stay_parameters": "Stayed May 2005", "text": "NOISY,No amenities..not even KLEENEX!", "title": "Avoid like the Plague!!", "helpfulness": 18, "user": "JohnDenver", "date": "June 5, 2005", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "service": 1.0}, "id": 3530180}, {"rating": 1.0, "title": "serious problems", "text": "NO Mattress Pad on Bed AND linens did NOT even FIT the Mattress.", "helpfulness": 16, "user": "txmonkey", "date": "July 22, 2004", "id": 2314083}, {"rating": 1.0, "title": "Eck!", "text": "Does NOT even deserve 1 STAR or Mention!!", "helpfulness": 11, "user": "A TripAdvisor user", "date": "January 28, 2004", "id": 1616579}, {"rating": 1.0, "title": "worst inn and suites", "text": "This is the worst hotel I have ever stayed in. It is disgusting. The rooms are filthy and don't come with any shampoos, hairdryer, coffee, anything. We got a non smoking room with the duvet and sheets covered in cigarette burns. Rooms are cleaned once a week, I kid you not. It is advertised with \"free continental breakfast\". This consists of 1 box of cereal and a box of old, half eaten doughnuts at the front desk, which is a unattended shack. When we first arrived there was no one at reception. 30 minutes later the \"manager\" strolls in from an adjacent room, just out of his bed. It was early afternoon. He then denies the cheaper prices he quoted us on the phone so we have to pay more. In the pictures there is a pool. In real life there is a cesspool covered in tarpaulin. It seemed like we were the only idiots who chose to stay there as it was completely empty. We found out later that there are lots of much better, cleaner, cheaper motels on the same street. I really wish we had stayed at one of them as this dump ruined our trip.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "August 23, 2003", "id": 1257878}, {"rating": 1.0, "title": "Beware", "text": "I made reservations for this hotel for 2 nights and then changed my mind about staying there. I called the hotel to cancel and they said the place online that I made the reservations with would charge me half price. I called the place online that I made the reservations with and they asked me to hold on while they called the hotel. They came back on the phone and said the hotel has decided to charge me full price. Because this is in their fine print I had to pay $133.87 for a place I never stayed in. BEWARE!", "helpfulness": 7, "user": "xykathy", "date": "August 19, 2006", "id": 5625727}, {"rating": 1.0, "title": "Borderline Scary...", "text": "I am actually still in the room right now using the highspeed internet from the Econo Lodge next door.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "July 4, 2006", "id": 5423127}, {"rating": 1.0, "title": "Don't do it!!", "text": "I have high expectations, but i also have stayed cheap to have a nice time and save money before. This time went too far.", "helpfulness": 11, "user": "A TripAdvisor user", "date": "September 21, 2005", "id": 3928988}, {"rating": 1.0, "title": "Dirty and old", "text": "My finace and I thought it might be a nice time for us to save some money and go to the cape for the weekend.", "helpfulness": 9, "user": "A TripAdvisor user", "date": "August 4, 2005", "id": 3738122}, {"rating": 1.0, "title": "stay away drive down the street", "text": "When i checked in, the check-in guy tried to boost my pre-booked online rate by 20 bucks a night.", "helpfulness": 13, "user": "athome47", "date": "July 15, 2005", "id": 3669949}], "location": {"country": "United States"}, "stars": 1, "variance": {"poor": 8, "average": 14, "very good": 8, "terrible": 38, "excellent": 1}, "aka": "American Host Hotel West Yarmouth", "slim_ranking": 1.0}