{"user_rating": 3.5, "review_count": 44, "name": "Americas Best Value Inn & Suites", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled with friends", "text": "I had booked this motel well in advance, and I paid in advance in order to get the cheapest rate. The price was about $60, so I wasn't expecting much. I was surprised by the high quality of this facility. Modern rooms, nice breakfast, and very helpful staff. Within easy walking distance of several restaurants. Highly recommended.", "title": "Great Value", "user": "Tomcod", "date": "June 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 165565228}, {"rating": 3.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "While we were taking a trip throughout Idaho, we stopped here for our first night. The beds were very comfortable, breakfast was VERY good, its easy on the pocket, and the staff is very friendly and professional. It does need some updating but thats about it!", "title": "Great on the pocket, and very good breakfast!", "user": "Shane H", "date": "June 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 165248746}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "Enjoyed our stay. Great room. Other hotels wouldn't let us stay there with our \"large\" dog. This hotel is very pet friendly. Hot tub & pool were very clean. The staff was very friendly. We will stay here again & will recommend this hotel to family & friends.", "title": "excellent weekend", "helpfulness": 1, "user": "Alan I", "date": "June 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 164965517}, {"rating": 1.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "This hotel is in extreme need of some TLC and updating. We stayed only for one night (thankfully) and I will not be back unless there are some improvements to the property. If you are going to McCall, spend a little extra and stay at one of the many other options in town. The room was out of the early 80's and the hairdryer was so outdated it looked like something out of a 70's tribute museum (I even took a picture of it because I have never seen anything so terrible - it looked like a mini vacuum cleaner on the wall!). The bedding was cheap and provided no comfort or warmth, the sheets actually felt like they had fabric pills all over them. The mattress was hard and uncomfortable. Someone near us took a shower and it was so loud it sounded like it was in our room! There were shoe scuff marks (!!) on the wallpaper above the bed headboard. There was no screen in the window. There was this OLD lazy boy recliner in the room that was just nasty looking - and to make it even better, when you pushed out the foot rest, a big piece of it was missing showing just the frame. The breakfast was mostly cheap carbs and there was a creepy guy eating the breakfast when he wasn't clearing the tables. Common areas were out of date and definitely NOT something to rave about. Old TV in our room - and funny that on our way out the next day, they were selling the old TV's in the parking lot - NOT classy. The woman at the front desk was nice - but that is the only good thing I have to say about it, other than that it is in McCall, one of the most beautiful places in the world.", "title": "Awful", "user": "103lisas103", "date": "June 19, 2013", "detail_rating": {"service": 3.0, "cleanliness": 1.0, "value": 2.0, "sleep": 1.0, "rooms": 1.0, "location": 3.0}, "id": 164537344}, {"rating": 3.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "WE reserved the room for 2 nights just so my wife and i could get away as we raise 3 grandchildren who are severly ADHD. We got checked in, Our room being next to the pool had at least 20 kids screaming as loud as they could with no parental supervision....Thats the start of it all....Then went to use the eletronic door key and i had to go back 7 times to have it reprogramed to get back in! So i complained and they put us in another room,( packing all our stuff up) and moving, Guess what? Happened again so i asked to check out! Rachel the assistant manager felt bad and gave us the first night free, gave us a mini suit at normal room rates and a free bottle of wine! Thank you Rachel !! But the noise continued at the pool all night long and coming to find out that they let anyone off the streets come and use the pool and hot tub....I cant say i will stay there again but thanks again Rachel for trying to cover up your owners poor way of running a hotel! Jon Cline, Payette, Idaho", "title": "A horrible experience at first but got better!", "helpfulness": 1, "user": "nashvillejonny", "date": "March 18, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 154994115}], "location": {"country": "United States", "city": "McCall"}, "stars": 2, "variance": {"poor": 2, "average": 10, "very good": 19, "terrible": 4, "excellent": 9}, "aka": "The Western Mountain Hotel", "slim_ranking": 0.777777777778, "description": "(Formerly the Western Mountain Lodge) In the heart of McCall Idaho and the heartland of the west, Americas Best Value Inn & Suites offers all the beauty of the outdoors within the city limits. Nestled among the mountains and lakes, rivers and wide-open spaces, you will experience all the adventures of this year-round playground in Valley County. Start your day with our Deluxe Breakfast - with Biscuits & Gravy! We also serve Hard Boiled Eggs, Hot Waffles, Yogurt, Fresh Whole Fruit, and Assorted Bagels, Cereal, Muffins. You will love our breakfast!"}