{"user_rating": 5.0, "review_count": 428, "name": "Ammos Hotel", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "This is a beauty. Small, chic, charming, caring. Ammos hotel, is a find.", "title": "Chic!", "user": "ashisharchitect", "date": "July 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 166264367}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "We spent three of our best days in Crete at Ammos, this June and none of the glowing reviews here on Trip Advisor, let us down. Very, small, very personal, this is one of those places you are unlikely to forget quickly, and most likely to go back again.", "title": "Lovely, lovely place...", "user": "MrMcTad", "date": "July 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 166177280}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "Rooms are nice, a little cramped but elegant and with a lot of detailing. We had a sea facing studio opening upto the pool with a little useful pantry counter, and a generous sized refrigerator, aircon nicely hidden but very efficient, and a priceless view. Small, a little \"dainty\" looking pool, but great for kids! Nice thoughtful touches, all over, like a basketful of beach toys and floaters by the pool for kids.", "title": "Family atmosphere in a design hotel", "user": "dazIntl", "date": "July 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 166164029}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "Nice funky mix of chairs in the bright looking restaurant. Food, though small portioned, looks prepared with care and love. Staff, always around when you need them, cheerful and helpful. And ofcourse, Nikos, the owner is hands on, with the best advice and knowledge of the area.", "title": "Stylish boutique hotel", "user": "israphale", "date": "June 30, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 165799195}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "Lows: Nothing around and a eight euro cab ride to Chania town. Could be more generous in food portions and in other small things…", "title": "Wonderful week!", "helpfulness": 3, "user": "SaraundBart", "date": "June 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 164860457}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "We labored whether to stay at a hotel or try to find a villa in Crete. Well, villas are not that available on Crete, so we were advised by a Fodor's certified commentor to check out the Ammos Hotel. We're glad we did. The staff was a amazing. Friendly, hard working and eager to please. We loved the food and thought it was a wonderful modern take on classic Greek dinning. Try the Greek yogurt parfait with crushed graham crackers at the bottom. Wonderful. Mykos, the owner, was astonishingly accessible. He recommended a number of great activities for my family and children. My kids are older--21, 22 and 24--and they were in the minority. There were a lot of younger partners with kids ages 2 to 6 years old. All of them were remarkably well behaved--the Brits being so much more mindful of their kids being polite than Americans (I am American so I can say that). The style and design of the Ammos is very contemporary. The location, on the beach, can't be beat. It turned out that this hotel had the intimacy of a villa but with a great staff who dotes over guests. Great job! Worth having three rooms for the weeks. Thanks everyone at the Ammos for making our stay so memorable. Some day, some way, we will be back. PS the Coco Mat mattresses are dreamy. I only wish I could buy one in the US--they thought of everything at the Ammos!", "title": "Great value, an excellent time!", "helpfulness": 1, "user": "Greg M", "date": "June 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 164368593}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "Excelent hotel. The staff is simply the best! The food is delicious! The place is very good with many options to do.", "title": "Special hotel", "helpfulness": 1, "user": "Gafwien", "date": "June 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 164156024}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "We really enjoyed our time in Ammos and we will recommend this hotel to our friends.", "title": "Super friendly, beautifully finished, ultra relaxing", "helpfulness": 3, "user": "Sarah E", "date": "May 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 162308511}, {"rating": 4.0, "title": "Nicest hotel in the area. Nowhere is more welcoming that here", "text": "Thanks Mykos, Penelope, Marios and all the staff for the friendly attention.", "helpfulness": 5, "user": "PhilipBloom", "date": "May 27, 2013", "id": 162030784}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "From the designer furniture through to the colour scheme and the general ambiance, this place has it all. The white exteriors offset by blue doors, the same colour as the gorgeous sea and sky, its just a relaxing atmosphere and some where you're happy to spend oodles of time.", "title": "All the staff are wonderful!", "helpfulness": 2, "user": "vernon2005", "date": "May 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 161253963}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "I spent the Easter holidays at Ammos with my girlfriend and our friends (two more couples). Eventhough i had heard lots of good things about the hotel, i was still pleasantly surprised: the kindest and most efficient stuff i ve met, delicious food (the restaurant is a destination for picky eaters), beautiful sandy beach and sunset, designer furniture everywhere, Nikos (the owner) was so helpful and friendly... And one more thing which i found unique: Most guests we met at the hotel were repeaters from all over the world. They created a sophisticated and interesting crowd (even the children were discreet!). Ammos is what modern greek hospitality should look like.", "title": "Simply amazing!", "helpfulness": 3, "user": "Vassilis S", "date": "May 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 160405524}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with friends", "text": "I'm just back from the Ammos Hotel and boy does it hurt ... Feels like being forced to leave home. Because that's what this hotel is about : making You feel like You are at home and they do excel like very few do. This is a small property, with only few rooms, so from the very first moment You enter Ammos, You feel as if You've arrived at a friends house. The owner Nikos will probably greet You at the reception and show You to Your room. We didn't even bother unpacking, because the smell coming from the restaurant was just too much to resist. Ammos Cretan cuisine at its best. Absolute respect for the freshest product. The feeling of the place is laid back elegance. The room I stayed with my 2 daughters was a double, but it didn't feel crowded at all. If You decide to stay at the hotel and linger by the pool or sunbathe at the beach You will have attentive and smiling staff pampering You in every possible way. If You want to exploer, Nikos will give You the best tips - trust him, he knows the most beautiful (and tasty) places on the island. We were in a group of 9 : 4 adults and 5 kids and all of us feel like we left a piece of our hearts in this beautiful place. Thank You Nikos, Pinelopi , Mariusz and all teh staff at Ammos for being such great people. Hope to see You soon :)", "title": "In love with Ammos", "helpfulness": 4, "user": "Hanna091", "date": "May 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 159803746}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "We checked in on the first day of the season to a newly renovated room - each is redecorated annually, hence the relatively high prices for Greece; the photos on the hotel's website are a true reflection of what to expect. The rooms aren't big, but as 3 adults in a deluxe sea view studio we were comfortable enough. Beds were comfy and it was nice to have a proper mattress on the third bed. There is limited storage space due to the presence of the kitchenette, which could be very useful if you have children in tow. The bathroom was small but functional, with a lovely rain shower, soft fluffy towels and Apivita toiletries (available in M&S in the UK). We didn't find any problem with ventilation unlike a previous reviewer, nor for that matter were there any cats around. The balcony has a lovely view, but is fairly noisy if the children are in the pool. Everywhere was spotlessly clean, and as everybody mentions the service is very friendly and attentive.", "title": "Great if you have small children", "helpfulness": 1, "user": "Ceri393", "date": "May 1, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 159380421}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "I'd read a number of TA reviews before booking, thinking that the people complaining about children were scrooges. However, we had a lovely meal in the restaurant on our first night which was completely ruined by screaming children in the relatively small public restaurant/reception area. Unfortunately, while most of the kids were well behaved it only needed a few over-indulged British kids to spoil the ambience. It was unfortunate because the food was very good, and reasonably priced. This theme continued, to a lesser extent, at breakfast which was an excellent buffet containing lots of home-cooked and local produce. When we were in our room we didn't hear any noise from children, except when out on the balcony.", "title": "the most relaxing holiday ever", "helpfulness": 4, "user": "myriam k", "date": "April 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 157666011}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "The location is good - just off the main road through the suburbs, 10 minutes from the middle of Chania (heading west) but set back far enough that you can't hear any traffic. The beach is lovely and the sea shallow - making it warm even in April. I can see if you have small children this hotel would be great, though the clientelle were predominantly British, so if you want to get away from the Brits you may prefer somewhere else.", "title": "Nice place with great service, great food, minor niggles", "helpfulness": 1, "user": "Flaneurbanite", "date": "April 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 157302946}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "We found this hotel on Tripadvisor as we are quite picky when it comes to hotels and once again I am pleased to say that TA didn't let us down. We really loved Hotel Ammos and would definitely recommend it. It is best for couples and families with young children rather than teenagers. If you don't like children this may not be the hotel to come to as other reviewers have said, but to be fair all were very well behaved when we went and as I am 6 months pregnant it was interesting for us to see families on holiday. It is stylish, spotless, relaxed and very friendly. All the staff are warm and very professional and there is a genuine happy ambience there. The building and interiors are spotless and well designed with interesting fun designer (but never pretentious) furnishings and well tended gardens. The food was competitively priced and delicious - the breakfast buffet was particularly lovely with a good variety of fresh sweet and savoury food, freshly squeezed orange juice, fresh breads and pastries and lots of different fruit. They serve food and drinks by the pool or down on the beach as well as the restaurant which was great especially when you are too lazy to move from your beach lounger and you are craving a banana milkshake! We felt the food was not on the small side as an earlier reviewer said nor was the room on the small side. We changed rooms half way through our holiday due to availability so sampled both the sea view and garden view rooms and both were excellent - comfy beds, rain showers, well equipped kitchenettes, very quiet air con, non humming fridges and fresh flowers. When we moved rooms we were told we needn't pack all our things up as the staff could move everything for us (except the safe contents) as 'we want our guests to have a trouble free holiday and spend their time on the beach or wherever instead of spending time moving rooms'. We arrived at 1am on our arrival night and there were sandwiches and fruit waiting in our room which weren't ordered but a lovely surprise - another example of their incredible customer service (we always meant to say thanks for that - thanks Nikos!)", "title": "Stylish beachfront hotel with fantastic customer service and delicious food", "helpfulness": 1, "user": "acbw_8", "date": "July 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 168411581}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "The beach is sandy and the water is crystal clear and it is right next to the hotel with no road in between. Hotel Ammos is the best looking hotel on the beach and really is an oasis that you don't need to leave but if you do there is a big comprehensive file at reception with lots of restaurant and excursion suggestions. The surrounding area isn't hugely exciting as it's on the outskirts of Chania town but this makes it easy to get into town (buses every 15 mins, 1 euro10). There are some supermarkets in the vicinity plus a Lidl 15mins walk away so you can always prepare food in your room - they will even do your washing up when they make up the room in the morning - yet another plus point in our eyes!", "title": "Fantastic family holiday destination", "helpfulness": 1, "user": "Cindy L", "date": "July 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 168273517}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "So in summary we thought it was a brilliant hotel conveniently located and agree with all previous excellent reviews. Thanks so much Nikos and co for everything - hopefully we will become repeat customers like so many of your guests and next time we will bring our baby to meet you all.", "title": "Superb for our family holiday", "helpfulness": 1, "user": "JMHGlobetrotter", "date": "July 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 167947409}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "This little piece of beachfront paradise to which we vow to return is a must for any family looking to visit Crete. We spent 6 incredible days at Ammos Hotel at the beginning of July. It is the perfect blend of design inspired boutique hotel with all the amenities of a bigger resort. The hotel's two greatest triumphs are it's service; delivered by an incredibly friendly and accommodating team and the attention to detail; picture children sized hangers in the cupboard.", "title": "Unique with its excellent staff", "user": "KRHNSZR", "date": "July 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 167751311}, {"rating": 5.0, "stay_parameters": "Stayed June 2013", "text": "We stayed in a garden view suite, which was perfect for our family of four with enough room for the kids (and the luggage we'd brought for our two week holiday) and a separate room for my husband and I. I was concerned about not having a bath for my two year old but a separate hand shower I assume is for this purpose made up for that.", "title": "Excellent modern greek hotel", "helpfulness": 2, "user": "Marcel N", "date": "July 10, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 166999103}], "location": {"country": "Greece", "continent": "Europe"}, "stars": 3.5, "variance": {"poor": 3, "average": 0, "very good": 49, "terrible": 0, "excellent": 376}, "aka": "Ammos Hotel Chania", "slim_ranking": 0.0909090909091, "description": "Ammos Hotel is a small stylish hotel located on the best spot of the city of Chania, right on the water front at the bay of Agii Apostoli, 4km away from the Venetian Harbor and the picturesque old city. In an idyllic setting by the water, wake up listening to the sound of the waves and indulge into our vast palette of vivid colors, from light green to the turquoise of the sea water and from beige to the bright fuchsia of bougainvillea. This is your private escape..."}