{"user_rating": 4.0, "review_count": 464, "name": "Amora Hotel Wellington", "reviews": [{"rating": 3.0, "title": "good position", "text": "We booked a special deal on line that gave a few complimentary items cheese and wine in the room and extra toileteries and breakfast. The rooms were ok and bathroom had a large shower however the rooms are showing there use and ceilings were cracked and peeling in the shower", "helpfulness": 1, "user": "watchitLondon", "date": "September 9, 2007", "id": 8680763}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled on business", "text": "area and the room was dreessed with a blanket over the bed but nothing exceptional at the price. Breakfast was good and varied and although we had two rooms of 2 adults and 3 children for which we paid an extra bed charge when breakfast came they said we would have to pay for one breakfast extra as only two were included in the room rate! Be aware if you have nut allergies as they provided no warning at breakfast and we had a child who suffered an attack from a muffin which was made with a mild almond butter paste.", "title": "Special Stay at the Duxton", "helpfulness": 2, "user": "dizzyb23", "date": "August 18, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8448012, "likes": {"liked": "— The Mini Bar", "disliked": "— The Breakfast choices for vegetarians"}}, {"rating": 3.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "The hotel is well placed for the main street shopping bars etc., and museum and sea front. If you come on the bluestar interisland ferry you need to walk across the road to the station for the taxi.", "title": "nice view", "helpfulness": 1, "user": "sausage21", "date": "August 15, 2007", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 2.0, "cleanliness": 4.0, "value": 2.0, "location": 5.0, "rooms": 2.0}, "id": 8425086, "likes": {"liked": "— location", "disliked": "— nothing, for the price it just did nothing for me"}}, {"rating": 3.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "We stayed at the Duxton twice whilst we were in New Zealand. This hotel is the place to spend a special occasion or simply if you need a treat.", "title": "Central location but Club Room lacked value for money", "helpfulness": 2, "user": "Kit2", "date": "April 25, 2007", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 7435030, "likes": {"liked": "— Location", "disliked": "— Limited services in the Club Lounge"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "It isn't as expensive as some hotels of this high standard.", "title": "Great location, wonderful view", "helpfulness": 3, "user": "Lottie1", "date": "April 23, 2007", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 5.0}, "id": 7420280, "likes": {"liked": "— The view was amazing"}}, {"rating": 1.0, "stay_parameters": "Stayed July 2006", "text": "Used WOTIF to book two nights with breakfast for two each day. First morning attempt was made charge me for breakfast in the restaurant. Had to prove to the duty manager that I had a booking, which included breakfast. Asked if I would have a problem at checkout. He stated NO. Used room service for breakfast on the second morning. At checkout attempt was again made to charge me for breakfast. Slow service in restaurant and room service breakfast half cold.", "title": "Poor service", "helpfulness": 4, "user": "david01", "date": "August 27, 2006", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 3.0, "value": 1.0, "rooms": 3.0, "location": 4.0}, "id": 5713652}, {"rating": 2.0, "stay_parameters": "Stayed April 2006", "text": "We booked into the Duxton a hurry after arriving at a hotel we had booked earlier to discover a cross between half-way house and student dorm (warning, do not stay at the Hotel Wellington under any circumstances, its a complete dump).", "title": "Faded tackiness", "helpfulness": 8, "user": "CanberraTravelBug", "date": "April 24, 2006", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "rooms": 2.0, "service": 1.0}, "id": 4998432}, {"rating": 4.0, "stay_parameters": "Stayed February 2006", "text": "The room rate we got was relatively cheap - $150 per night supposedly for a room that usually cost NZ$500 per night. Well, its pretty hard to believe the room would really go for $500. The service on arrival was hopeless - no one helped unload our heavy bags from the car, no one helped us open the door and my husband had to ask several times to get a bellhop to take the bags to our room. Smiles from the staff were pretty light on.", "title": "Well located, slow restaurant", "helpfulness": 8, "user": "John6", "date": "March 16, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 4626398}, {"rating": 3.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "Stayed 1 night in a \"deluxe\" room. The good stuff: young and friendly staff doing their best, great views over Wellington harbour. The bad stuff: slightly shabby and dispiriting room - a decent size but just a bit tatty and frayed around the edges and with a bed so soft it was like marshmallow. Also the location, while very handy for downtown and the Te Papa museum, is in a part of town that is slightly seedy after dark (lap dancing bar around the corner, etc). A decent enough place to stay a night or so, but don't go expectng anything special.", "title": "Great views and staff but otherwise mediocre", "helpfulness": 1, "user": "vlasska10", "date": "April 22, 2007", "detail_rating": {"front_desk": 5.0, "business": 1.0, "service": 4.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 2.0}, "id": 7414902, "likes": {"liked": "— Harbour Views", "disliked": "— Shabby room"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "Booked on the internet and got a Hot Deal. Requested a harbour view. Our room was on the 7th floor and the view was breathtaking. Room was really nice, clean, well maintained - as was the bathroom. Service was always fine, location pretty good. We had valet parking and that was fine. Breakfast was very good and they start serving early enough for you to catch the first ferry (0830?) to Picton. Agree that the dinner menu is overpriced and restaurant did not feel very cosy - somewhat exposed on a mezzanine floor. Maybe we were not looking in the right places but we did find it hard to find somewhere nice to eat in Wellington. We ended up in Plum which was a fabulous wine bar, great food, good atmosphere. But for B&B, would recommend this hotel.", "title": "Fabulous harbour views", "user": "scissorsister", "date": "March 9, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6967301, "likes": {"liked": "— The view", "disliked": "— TV was at right angles to the bed so could not view easily from the bed"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2006, traveled as a couple", "text": "I booked the Club Room through their website and managed to get the Club Suite for only 250. It was pure luxury, with two double beds, 2 bathrooms and a fantastic view of the Harbour. Included was a breakfast in the Club lounge. If you want a night of luxury for a low price, try booking on their website as there are great deals.", "title": "Loved the Club Suite", "helpfulness": 2, "user": "feijoa19", "date": "November 7, 2006", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6083731, "likes": {"liked": "— Clean and crisp", "disliked": "— At first they actually mucked up my room but this was fixed in the meantime"}}, {"rating": 1.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "In terms of food however, you may want to dine elsewhere as their menu was quite average for such a high price", "title": "crash", "helpfulness": 5, "user": "corkster", "date": "October 17, 2006", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 2.0, "cleanliness": 3.0, "value": 1.0, "location": 3.0, "rooms": 3.0}, "id": 5963473, "likes": {"liked": "— n/a", "disliked": "— the valet parking service"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "Be wary of the using the valet parking service. Our vehicle was badly damaged by one of the valets as she attempted to park it. A rear window was shattered and the rear driver's side scraped. Also worth mentioning about this hotel is the service in the restaurant. The waiter who brought us our main meals had no idea what it was when he brought it out. Some prompting by us and some guesswork by him eventually led to a resolution! And finally the internet service in the room was never available. The screen always said that the service was busy.", "title": "Pleased with our choice", "helpfulness": 17, "user": "luckystrike", "date": "September 1, 2006", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 5731806, "likes": {"liked": "— Great location"}}], "location": {"country": "New Zealand", "region": "North Island", "continent": "South Pacific", "city": "Wellington"}, "stars": 4.5, "variance": {"poor": 23, "average": 76, "very good": 213, "terrible": 24, "excellent": 128}, "aka": "Duxton Hotel Wellington", "slim_ranking": 0.294117647059, "description": "This fabulous, downtown hotel completed a total accommodation makeover in 2011 redefining superior comfort and luxury with contemporary style in the Capital City.Nearly all the rooms command unobstructed views of Wellington Harbour and/or the city and we’re located right in the arts and entertainment precinct.The hotels rooms are spacious with 192 Deluxe, Club & Club Suites, featuring all the niceties you would expect from a leading international hotel.Our Club Rooms are located on the top floor and assure stunning harbour views, superior in room amenities and access to the exclusive Club Lounge for complimentary refreshments and gourmet breakfast."}