{"user_rating": 4.0, "review_count": 1117, "name": "Amsterdam American Hotel - Hampshire Eden", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "Stayed four days at the Hotel American in May. Room 607 was a \"delux\", very comfortable, with a great view of canals and boat traffic. The Hotel is walking distance to all the main museums, flower market, and even Rembrandtplein. Three trams are right out the door, as is the Water Taxi. Old town and Red light District are only 10 minutes away on Trams. Staff was very friendly and helpful. These are the \"Pro's\".", "title": "All Star Conveniance", "helpfulness": 3, "user": "Newyorker765", "date": "June 16, 2007", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 7857399, "likes": {"liked": "— Location and Room amenities", "disliked": "— Poor and Expensive Internet, Poor Gym facilities"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "The \"Con's\": Rather expensive overall, outrageous Internet and Mini Bar Prices, and overpriced Cafe American (but it does look stunning!) \"Gym\" is poor.", "title": "Great Location", "helpfulness": 1, "user": "DCMJMM", "date": "June 3, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 3.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 7752130, "likes": {"liked": "— Location", "disliked": "— Some noise from trains"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled with friends", "text": "All in all a wonderful stay despite the caveats.", "title": "Prime location", "helpfulness": 2, "user": "E_Hemingway", "date": "May 31, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 4.0, "rooms": 3.0, "location": 4.0}, "id": 7723548, "likes": {"liked": "— Room size and location", "disliked": "— Mini bar price, no non smoking room available"}}, {"rating": 1.0, "stay_parameters": "Stayed May 2007, traveled on business", "text": "Great location. Near Museum Quarter and convenient public transportatin to get anywhere else in the city. Near many different ethnic restaurants.", "title": "Terrible Cancellation/Reservation Policy -- Book carefully", "helpfulness": 3, "user": "SFtoADam", "date": "May 29, 2007", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 3.0, "cleanliness": 3.0, "value": 1.0, "location": 4.0, "rooms": 3.0}, "id": 7710996, "likes": {"liked": "— Staff was friendly and helpful", "disliked": "— Price, ridiculous reservation policy, cost for breakfast and internet, decor"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "Stayed in a Junior Suite. Nice modern room and bathroom. Beautiful restaurant. Good breakfast buffet but cheaper options nearby.", "title": "A good hotel in a super location", "helpfulness": 2, "user": "tropicaldan", "date": "May 27, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 7705018, "likes": {"liked": "— location location location"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "This was a great Hotel. Incredible staff, beautiful Hotel, inside and out. A great city. Our room looked out over the canal, highly recommend this. Easy access to everything in the city. The art musuems are a five minute walk. The only thing I would change, would be to get a room with a large bed. The singles are fairly small. Cannot say enough about the Hotel.", "title": "Love this place", "helpfulness": 3, "user": "S.E.-L.V.", "date": "October 25, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 6010924}, {"rating": 3.0, "stay_parameters": "Stayed September 2006, traveled on business", "text": "Lobby area is small, but great looking with modern and sleek minimalist design, but it is at times crowded with smoking meeting participants rendering the air terrible. And there is no air circulation. The staff is great, however, check/in and out seems overly complicated and slow - an antiquated computer system may be to blame. Rooms are generally on the smaller side, with small bathrooms. Both areas are nice and clean. The shower heads are the typical European models that tend to squirt more than they shower. Good towels. Internet access is 25 Euro per day! Corridors are generally neglected, and the elevators very small and slow.", "title": "Modern and old at the same time", "helpfulness": 4, "user": "DX-Traveler", "date": "October 6, 2006", "detail_rating": {"front_desk": 2.0, "business": 1.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 5923247, "likes": {"liked": "— location"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2006, traveled as a couple", "text": "Absolutely gorgeous hotel in a brilliant location, right beside the main shopping area but far enough away that you're not bothered by noise at night. The rooms are beautiful- when we arrived we were told we'd been upgraded to a fancier one overlooking the canal- we'd requested a nice room in our email to them, and they certainly didnt let us down! The hotel itself has a great bar and dining area, though unfortunately we werent up early enough to sample the breakfast. The night life in the hotel itself and in Amsterdam in general is great craic. Would definitely recommend this hotel and a stay in Amsterdam- its a brilliant city and there's a lot more to it than the red light district. PS. rent the bikes, its a great city for getting around on bikes, even if you dont like cycling (like my boyfriend!)", "title": "Loved it! Very posh!", "helpfulness": 8, "user": "lkeegan", "date": "October 5, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 5920371, "likes": {"liked": "— Location, great rooms, lovely bar and restaurant, beautiful views"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2006, traveled with friends", "text": "As a veteran of many Amsterdam breaks it is clear that the consistency of hotels in this wonderful city is questionable. The Amsterdam Amercian is one of the exceptions to this in my opinion. Decent size rooms, great view, great location and very friendly staff. Sure, the rooms might benefit from some updating to the interior but I always find this hotel as a comfortable, stress free vibe.", "title": "Consistent Qualitiy", "helpfulness": 4, "user": "ManontheMoon", "date": "September 30, 2006", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 5893248}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled with family", "text": "My husband and I traveled to Europe with our 4 year old son and my sister. Since there was a huge convention in town we had few choices but chose the American Hotel because it seemed like the best given the circumstances. We were so pleased with our choice. The location on the Leidseplein and just blocks from the canal tour, Rijksmuseum and the Van Gogh Museum was wonderful. The room was very modern and clean. It included great bath products. We chose a deluxe room with a balcony and canal view. The staff was very friendly. We appreciated their playfulness with our son who had just gotten off the plane after traveling from Los Angeles. The extensive buffet breakfast (includes champagne) in the American Cafe--watching the city wake up--was a terrific way to begin our vacation. We can highly recommend this hotel.", "title": "Exceeded Expecations", "helpfulness": 4, "user": "BCKTravelers", "date": "September 29, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 5889646, "likes": {"liked": "— Location", "disliked": "— expense"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled on business", "text": "Excellent service! My room just happened to be ready when I arrived at 10:30 AM. I know this is not usual, although coming off of a 10 hour flight, it was great to check in and shower before exploring the city.", "title": "Stayed a Week.... could stay a month!", "helpfulness": 1, "user": "Sean K", "date": "September 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 141369191}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "The staff was friendly and personable. The rooms are large for the money, coupled with the great cafe downstairs and the location, I will stay here again on my next trip.", "title": "A very central hotel in Amsterdam", "user": "David P", "date": "September 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 141278577}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "This hotel is very centrally situated in Amsterdam. The airport bus, which runs every 30 minutes, stops just outside the hotel. The tram, which can be boarded just minutes from the hotel, runs right through the centre of Amsterdam. The staff in the hotel are extremely friendly and helpful. The rooms are clean, spacious and have tea and coffee facilities. An ice machine is situated just down the corridor. On checking out of the hotel, a room is available to store luggage, and spacious and clean toilets are available. There are numerous good eating places within minutes walk from the hotel. A small supermarket is situated about a 10 minute walk from the hotel. The hotel is also close to a park and a number of very beautiful canals and bridges.", "title": "Very nice hotel", "user": "Amoraal", "date": "September 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 141256621}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "The American hotel lies directly at the Leidseplein. A very nice hotel, with a great service and large rooms.", "title": "Location great for sightseeing", "user": "James V", "date": "September 24, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 141184659}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled on business", "text": "On the edge of a major restaurant area and accessible to the museum plaza by a short walk, the hotel is attractive for visitors who want to get to the museums early in the day and have dinner within a short walk. The tram to the central train station and the bus to the airport are one minute from the hotel entrance. The hotel is not top class, but there were some dirty towels left in the bathroom, but all in all, it was a good base for a six-night stay.", "title": "There are much better choices for this price range", "helpfulness": 1, "user": "Larry F", "date": "September 23, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 140991985}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "We arrived at the hotel and new right away that this was a pleasant place to stay. The lobby was swanky, chic, and the staff were attentive. Our room was modern, and had the most amazing bed down comforter. It is also the best location and I would recommended this hotel in a heartbeat as my boyfriend knows I can sometimes be hard to please.", "title": "Loved Our Stay", "user": "rk-winelover17", "date": "August 22, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 8467960}, {"rating": 3.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "the hotel is very central, we have been to amsterdam before and stayed in the Marriott which was far superior, having said that, the American Hotel was very good with the little extra's i requested on-line before the trip. It was our son's birthday and we treated him and his girlfirend to this break, we asked the hotel to provide a birthday cake and give them a room with canal view. they fulfilled our request's, and delivered the cake at the exact time requested. the rooms were average size, but the bathroom was very small. We think this part of amsterdam is excellent, lots of bars, place's to eat, street entertainment, comedy clubs, you cant go wrong staying near leidesplien square.", "title": "excellent location", "user": "janoandpastie", "date": "August 11, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 2.0, "value": 3.0, "location": 5.0, "rooms": 3.0}, "id": 8394070, "likes": {"liked": "— location", "disliked": "— small bathroom"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "The hotel is clean, classic and truly beautiful. It is located on Leidesplein, a lively square lined with cafes and entertainers. It is walking distance from all the big sites. The trams run frequently to more outlying places and were easy to master (even for this inexperienced traveler).", "title": "Perfect location, clean, beautiful. Extras are EXPENSIVE!", "user": "glib1122", "date": "August 9, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 3.0, "rooms": 4.0, "location": 5.0}, "id": 8378464, "likes": {"liked": "— Location, cleanliness", "disliked": "— prices"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2006", "text": "I booked a basic room- it had no view, but I didn't care. It was spacious (for Europe) and the bathroom was huge. Air conditioning was powerful!", "title": "Enjoyed Amsterdam American", "user": "Ohjustpeachy", "date": "July 27, 2007", "detail_rating": {"cleanliness": 4.0, "front_desk": 4.0, "location": 5.0, "value": 4.0, "rooms": 4.0}, "id": 8242494}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "The staff were extremely friendly and helpful.", "title": "Loved it", "helpfulness": 1, "user": "charmcity", "date": "July 10, 2007", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 8096264, "likes": {"liked": "— Balcony, great bed", "disliked": "— Took concierege forever to bring up a bottle opener for our wine (we'd already given up & gone down to the bar to have it opened) Really this was a minor problem."}}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled with friends", "text": "I stayed for one night with a group of friends in September. We booked room only so I can't give any information regarding the breakfast. Check-in was a bit slow but the staff were very friendly and helpful. Usual information - buses, places to visit and maps all located at reception. Great location, very easy to get a 197 bus from Schipol airport to Leidesplein, when you step off the bus you can see the hotel located behind the fountains. Rooms were comfortable, clean and warm. Only downside is if you are not here for the nightlife I would recommend staying somewhere quieter. I was in room 322 and there was a lot of noise coming from the bars, there is double-glazing but it still didn't block out the music, We went to bed about 1.30am and I think I finally managed to fall asleep at 4am to be woken by workers (presumably road sweepers) at 7am.", "title": "Good location.", "helpfulness": 1, "user": "S.S.S.M.L.A", "date": "October 15, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 2.0, "rooms": 4.0, "location": 4.0}, "id": 142856264}, {"rating": 1.0, "stay_parameters": "Stayed October 2012", "text": "After regularly staying at the American for the past 9 years l was informed upon checking in that they had sold my room to someone else and that they were overbooked.", "title": "Never stay here.", "user": "Dgc72", "date": "October 15, 2012", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "location": 1.0, "service": 1.0, "rooms": 1.0}, "id": 142834337}, {"rating": 2.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "Aside from the fact that the room had been guaranteed with a credit card for nearly a month didn't seem to bother them to 'put me in their sister hotel just across the street'.", "title": "Stay there but don't eat there !", "user": "HFFK", "date": "October 14, 2012", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 142800991}, {"rating": 5.0, "stay_parameters": "Stayed October 2012", "text": "The sister hotel being a 75 euro per night 3 star tourist class hotel the Hampshire, and not the 4 star 200 euro per night room l had reserved - needless to say alot of harsh language (mine) was used in their poor attempts to justify and make up for their glaring screw up. The greatest moment of this entire debacle is when l informed them that l wouldn't be paying 200 euro for a 75 euro a night room and neither that l'd be staying at any of their hotels again l was magically found a deluxe room at one of their other 4 star hotels, The Manor. Poor.", "title": "Sure to stay again!", "helpfulness": 1, "user": "travels83", "date": "October 14, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 142760167}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with friends", "text": "To be honest the Hampshire hotel made me feel more welcome than the American could ever have hoped to, and the staff were of a higher professional standard to deal with the situation than the clowns on the desk at the American.", "title": "one of the best", "helpfulness": 1, "user": "tim g", "date": "October 5, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 142098237}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "Stayed here as birthday present for my boyfriend and could not have been more pleased! Its a beautiful hotel with lots of history, but better than that the price was fantastic. Shop around as we got a great deal compared to many other sites (soz I can't remember what one) and I also booked months in advance. The staff are lovely and the rooms are great, just a god size for city trip of a few days.....plus its all true ..... these beds are amazing!!!!! If we'd fallen out we'd have thought we were sleeping in different rooms !!! Had a great time over there and although its a \"once done can't say we'd be back in a huge rush\" place to visit, I'd stay at this brand of hotel again based on this experience. Best location as its in the middle of every major sight seeing landmark and a good distance from all the best bars, restaurants and cafes. Can't recommend more :-) !!!!!!!!!!!", "title": "Perfect Location & Great Value", "helpfulness": 1, "user": "ScotsGlobeTrotters", "date": "November 9, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 48852742}, {"rating": 4.0, "stay_parameters": "Stayed November 2009, traveled on business", "text": "Great location, great room, great hotel, great service, great staff. Superb!", "title": "Right in the heart of Amsterdam....", "helpfulness": 1, "user": "parkydj", "date": "November 9, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 48834135}, {"rating": 3.0, "stay_parameters": "Stayed November 2009, traveled on business", "text": "Stayed here for a conference, so was not a personal choice. The hotel was quite small in arrangement and the room was comfortable, however, compact. The bath room could just about contain one person, but it would be difficult to contain two unless one was in the tub!! The main problem with the room was that you could hear water running every time people flushed toilets, had a shower and ran taps, which for the age of the hotel was surprising. The bonus was the size and comfort of the bed, which was excellent.", "title": "Comfortable room, with water music!!", "user": "handyspanner", "date": "November 7, 2009", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 4.0, "service": 4.0, "rooms": 3.0}, "id": 48716060}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled on business", "text": "The staff were really well presented and helpful and the dining room is awesome, with some great architecture and windows. There is a small gym with 3 CV machines and some weight machines. There is also a sauna and massage.", "title": "Great Location... No complaints", "user": "RickStevesJunior", "date": "November 6, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 48662198}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "The price of the hotel was expensive for what you got and the breakfast at 19 Euro was a rip off as was the internet at 22 euro per day.", "title": "GREAT deal and nice place to stay", "user": "ynotUsa", "date": "November 6, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 48625703}, {"rating": 3.0, "title": "Not a 4 star hotel", "text": "The elevator key card system did not always work, without multiple retries. Our room carpet was stained. The internet service was not availabe in the rooms but free in the public areas. However the restaurant was quite good. The location was excellent.", "user": "Judith L", "date": "September 21, 2012", "id": 140880304}, {"rating": 1.0, "stay_parameters": "Stayed September 2012, traveled on business", "text": "With a room at 180 EUR / night, you would expect good, reliable and free Wi-Fi. Well, its all the contrary, you get an internet access of 128 kps, which is the equivalent of the Internet at the Stone Age. It is slow, very slow, unreliable and very, very irratating. Each page takes about 1 min to load completely.", "title": "Terrible! Wi-Fi is unreliable and is not free!", "user": "Matthieu O", "date": "September 21, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 1.0, "sleep": 3.0, "rooms": 2.0, "location": 5.0}, "id": 140853445}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "Also, the code never worked for my room and I had to use one time codes every day for each of my devices.", "title": "Great Location - nice quiet room", "helpfulness": 1, "user": "TravelJunkies04", "date": "September 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 140519092}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "Even if the staff was very helpful, do not go to this hotel if you need an internet access. Just forget it, end of story.", "title": "Top notch hotel", "helpfulness": 1, "user": "JetLagQueen", "date": "September 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 140209137}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "What could have been a pleasent stay was ruined by the time lost to try connecting to their internet.", "title": "don't forget Vondelpark", "helpfulness": 1, "user": "Brian D", "date": "September 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 139719164}, {"rating": 2.0, "stay_parameters": "Stayed November 2009, traveled solo", "text": "I am curently in the hotel now (Room 429) which, admittedly, was an Internet special single room. The furnishings are lovely and while the room is smallish it is OK (other reviewers have hit on the need to ask for for an outside room - a balcony would have been heaven). My biggest disappointment is the 1 hour + I spent upon arrival with computer tech supprt trying to get my laptop to work in the room. All to no avail. Come to find out, the hotel only has wireless in the lobby - which is where I am sitting now writing this review. Argh! There is dial up in the room, but the cable hookup in 429 seems not to work (several lights don't work either) - what century are we in, anyway?? I have wireless hotel room connections in Haiti (!), why not Amsterdam?? When I complained, the front desk put me on to the Internet provider - a bit of a cop out for a 4-star hotel. The cable TV \"bouquet\" is also a bit odd - for the \"American Hotel\" there is no CNN (and very little English news), but lots of US sitcomes with Jennifer Aniston as a (seeming) teenager - what's with that?. I think next time I am going accross the street to the vanilla Marriott (going to check them out right now, while I think of it), although I love Art Noveau and Art Deco. Disappointed in Amsterdam. Marty Mueller", "title": "Great outside & location, a few problems inside...", "user": "Martymiami", "date": "November 2, 2009", "detail_rating": {"cleanliness": 1.0, "value": 3.0, "location": 1.0, "service": 2.0, "rooms": 3.0}, "id": 48357336}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled with friends", "text": "We stayed one night in Amsteradm American hotel. Hotel was very nice and beautiful. Room was spacious. And the surrounding is the one of the best in Amsterdam. Previously i have had accomodation in the other areas in Amsterdam. In the future, this is the area I would like to stay in Amsterdam. Only negative thing was the cleaning of the rooms. In this hotel is strictly forbidden to smoke hash and we don't do drugs. Anyway, we found a small amount of marijuana from our room....", "title": "A great place in the great area", "user": "FinlandFinn", "date": "November 2, 2009", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 48333878}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "But anyway, hotel and it's location was perfect.", "title": "Nice hotel but ask for a renovated room.", "user": "travelingcats14", "date": "October 18, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 47161288}, {"rating": 4.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "My husband and I stayed at the American Hotel for six nights in September. We asked for a room with a balcony and got room 408 which was really wonderful. The room had a balcony with two chairs that overlooked the canal. Aside from the great view this room was less noisy at it was not facing the street or busy square. Apparently only several floors of the hotel have been renovated and while I did not see a non renovated room, the halls on the renovated floor were so much brighter and upbeat. The staff were terrific and all requests from housekeeping came promptly and efficiently. This is a great area of area of Amsterdam but you have to like the hustle and bustle of an otherwise quaint city. The best is that the hotel is within walking distance of Melkweg, Paradiso and Boom Chicago which is great if you want to attend musicconcerts and the show at Boom Chicago. Boom Chicago is also where you sign up for the St. Nicholas canal ride which is a small boat tour of the canals. The hotel is also within walking distance of Mike's Bikes where you can take a city or countryside tour on bikes. We did the countryside tour which was fabulous. We also walked to the museums although you could take a tram which stops outside the hotel. There are also many inexpensive places to eat around the hotel which worked well for us. I wish the internet was complimentary. We paid 35 cents a minute which mounted up fast. I would recommend this hotel and would stay again but would ask for a canal facing renovated room.", "title": "Lovely hotel - central location without being too loud", "user": "TurquesaTrippers", "date": "October 16, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 46999701}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "My partner and I stayed here for 3 nights. It was a perfect base for exploring the city from. The rooms were spacious and clean with a huge bed. The stain glass windows and fountain outside the hotel add a bit of intreague and beauty. The outdoor bar is pleasant to have an evening drink in. We would recommend.", "title": "The perfect place to stay to when visiting Amsterdam!", "user": "Fanc", "date": "October 9, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 46364217}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "As we had already booked this hotel I was more than a little worried when I read some of the reviews on this site, I even tryed to cancel our booking but the American Hotel does not do this, so beware..As it turned out this was just as well. The hotel turned out to be really lovely, we upgraded our room to an american duluxe from an american classic so I can only go on this room. We asked for a room with a balcony overlooking the canal if possible and thats what we got, the room had the biggest bed we had ever had in a hotel and the decor was very pleasant, not the biggest room ever but very comfy and cosy. The staff were very friendly and helpful, Cafe America was a joy and if you visit the bar try a sweet candy cocktail, well worth £8 euros. We are returning to Amsterdam in Febuary and if we stay in this part of town will certainly be coming back to this hotel, we found none of the negitive things lots of other people found thank goodness and am pleased to recommend this hotel to others, it proved very good value for money.... Amsterdam as a city if fab to....", "title": "very pleasantly surprised", "user": "walterlazymouse", "date": "November 2, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 10537476, "likes": {"liked": "— The room", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled with friends", "text": "Me and my buddies stayed here for two nights during our yearly cultural journey to one of the bigger European cities (\"cultural\" meaning everything from visiting museums to real heavy drinking). Excellent location at Leidseplein where all the action is. A little distance from the Red Light District, but never mind, take a cab. Excellent staff, excellent bar. We never had breakfast at the hotel, but I am sure that was excellent to. Not the cheapest of hotels i AMS, but if you take advantage of the various internet offers, you could get away with it at a reasonable price.", "title": "Great Hotel in the middle of everything", "user": "HenrikIbsen", "date": "November 2, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 10531836, "likes": {"liked": "— Location", "disliked": "— Ongoing renovation"}}, {"rating": 2.0, "stay_parameters": "Stayed October 2007, traveled solo", "text": "Booked for 3 days as a stop on the way home from the East. When booked I inquired about the cancellation policy, as always. I was told that I would be liable for at least one night, even if I didn't stay at all. Upon arrival, I had become quite ill and informed the desk at check-in that I would only be staying 1 night. The desk attendant said that was no problem and that they would credit my credit card for the 2 nights. Another person overheard this and the whispered into the clek's ear and all of a sudden their policy changed!!!! I was stuck with payingfor 3 nights despite leaving the next morning!", "title": "Very disappointing", "helpfulness": 3, "user": "amjur613", "date": "October 21, 2007", "detail_rating": {"front_desk": 2.0, "business": 1.0, "service": 2.0, "cleanliness": 5.0, "value": 2.0, "rooms": 4.0}, "id": 10189124}, {"rating": 1.0, "title": "Oct 13, 07 seems very nice but...", "text": "I won't even go into the intenet problems! That it didn't even work in the guest rooms, as promised, was the least of the issues.", "helpfulness": 2, "user": "traveler5635", "date": "October 13, 2007", "id": 10074759}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled with friends", "text": "The room was OK, but \"European\" small. The location is great if you are into the art museums but pretty far from everything else.", "title": "Excellent Stay - Beautiful Room and Excellent Service!", "helpfulness": 2, "user": "waterbottler", "date": "October 5, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 10043164, "likes": {"liked": "— The beautiful room!"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled with friends", "text": "Just completed a long weekend visit and stayed at the Amsterdam American Hotel and cannot recommend it enough. Staff was exceptionally helpful and friendly, rooms quite large for Europe, very clean, even extra pristine bathroom linens. Cafe American is terrific - a Sunday Jazz brunch is quite special. The location is nothing short of perfect - ease of access to trams in all directions, easy walking to everything, wonderful canal location.", "title": "Absolutely Marvelous", "helpfulness": 4, "user": "flysalot", "date": "September 28, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5889147, "likes": {"liked": "— Friendly and perfect location", "disliked": "— had no complaints"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2006, traveled with friends", "text": "Unbelievably quiet, 24 hour service although entrance changes after midnight. If you have physical difficulties might not be best choice as there are some stairs in property and as a bath/shower combination you have to step into. Thought it was exceptionally good value for the room rate. A building with great history, fantastic staff and location, and a well maintained property I would most assuredly stay here again.", "title": "Fantastic location!", "helpfulness": 3, "user": "uka", "date": "September 4, 2006", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 5768580, "likes": {"liked": "— Comfortable beds", "disliked": "— some check in difficulties"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2006, traveled solo", "text": "We were a group and we stayed at the hotel for three nights. The hotel has a fantastic location! Leidseplein is right in front of the hotel with many bars, nightclubs, comedy theatre, and restaurants. The museums are within walking distance. The rooms are of average size and all the rooms have had differnt plans of solution. The bathroom was ok, with large and clean towels. The twin beds are very comfortable and the rooms are aircondioned. Ask for rooms with canal view, these are located on the quite side of the hotel. Quality of the rooms are average. The staff are friendly, eventhough there seems to be a touch of professional friendliness. We had some trouble with our bookings but it was solved without further difficulties. We did not eat breakfast at the hotel as it was expensive. We ate outside and can suggest you a beagle and bean cafe situated on the leidsestraat, and it is on the lefthand side on the 2nd canalbridge from the hotel. You can get a lovely berakfast for 7 euros! There is a exercise room at the hotel, but if you are a runner i will suggest you a fantastic running tour through the Vondelpark, just a few hundred meters away from the hotel. Beautiful park and you can run and see! A maxi taxi to the hotel costs around 50 euros or else you can take a train to the centralstation and take tram 1 or 5 which stops just outside the hotel.", "title": "Great Value & location", "helpfulness": 3, "user": "Spencertraveller", "date": "September 4, 2006", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 5767361, "likes": {"liked": "— Location and suprisingly good service", "disliked": "— Room was not made up @ 5pm!"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2006", "text": "Great Location, suprisingly great service from staff and a nice big bed in my room. The breakfast was really good even for the EUR20 and the American Bar serves one of the best martinis I have ever had.", "title": "Loved this hotel", "helpfulness": 4, "user": "ewd2", "date": "August 30, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 5728424}, {"rating": 4.0, "stay_parameters": "Stayed February 2006, traveled as a couple", "text": "Also, a nice little gym at hotel that is rarely used with a nice dry Sauna which is surprisingly for Amsterdam. It located close to museums and everything else, much better to stay here than hotels in the DAMRAK area. Enjoy!", "title": "Good Value For Money", "helpfulness": 2, "user": "Robothell", "date": "August 26, 2006", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 3.0}, "id": 5712181, "likes": {"liked": "— Location, dining hall, champagne breakfast.", "disliked": "— Austin Powers type decor."}}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "I have stayed here more times than I can remember and I just can't help going back.", "title": "Fabulous!", "helpfulness": 1, "user": "Tartan_Totty", "date": "December 1, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 6313250, "likes": {"liked": "— Everything!", "disliked": "— Nothing!"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2006, traveled solo", "text": "The rooms are lovely (especially if you can get allocated one of the newer ones on check-in), the staff are helpful, professional and knowledgeable. The food is good although we did tend to go out and try other places.", "title": "Nice for A European Hotel", "user": "adrienneth", "date": "November 29, 2006", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 6269962}, {"rating": 4.0, "stay_parameters": "Stayed November 2006, traveled solo", "text": "This hotel has a fabulous location right beside Leidseplain where you can sit and people watch with a G&T (or ten) for hours!", "title": "Great stay at the American", "user": "vbfan", "date": "November 27, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 6181738, "likes": {"liked": "— Cleaniless", "disliked": "— No complaints"}}, {"rating": 3.0, "stay_parameters": "Stayed November 2006, traveled on business", "text": "The last couple of times we stayed we upgraded to the Mata Hari Suite - WOW! You could hold a party in there and you even get the Music System to do it!", "title": "Good location but not a very good value", "helpfulness": 2, "user": "Chuck, Santa Cruz", "date": "November 22, 2006", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 6163201, "likes": {"liked": "— Lots of tram lines, walking distance to downtown.", "disliked": "— High cost for what you get."}}, {"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled with family", "text": "I enjoyed my stay at this hotel. Apparently, I got an unheard of rate of $147 euros for a one night, Saturday night, stay. The room was SMALL, but clean, comfy, and the bathroom was the nicest I've experienced in Amsterdam (spacious, separate tub and shower, nice fixtures, lighted mirrors, white robe and slippers, etc.). You'll have a flat screen TV with stations in English. Stay AWAY from the mini-bar- I got desperate and paid $7 euros for a large bag of M&M's. I was desperate. I'd also stay away from the \"full American breakfast buffet\". It's $20 euros, the eggs tasted awful, and the bacon was horrible. You do get champagne, though. The place is very pretty, the elevators are spacious, and the staff is quite accomodating. I will stay here again.", "title": "Great hotel - great location", "helpfulness": 4, "user": "Fryfamily2006", "date": "October 29, 2006", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 6026258}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "I absolutely LOVE this hotel!", "title": "A top choice for staying in Amsterdam!", "helpfulness": 2, "user": "MyLSD", "date": "October 3, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 10037386, "likes": {"liked": "— location & room quality", "disliked": "— i could always use a discount on room rates"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled with friends", "text": "I first caught a glimpse inside this hotel in '03 when my cousin was staying there on business. It looked like a nice quality place to stay, so when I saw rooms available there at reasonable prices this year, I didn't hesitate to book!", "title": "fantastic location", "helpfulness": 3, "user": "pooch2121", "date": "September 19, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 5.0}, "id": 8754996, "likes": {"liked": "— the location", "disliked": "— mini bar prices"}}, {"rating": 2.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "This hotel has two main features that I look for: Nice comfortable, clean room AND location, location, location.", "title": "Is this the best there is?????", "helpfulness": 1, "user": "laplume9254", "date": "September 5, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 2.0, "value": 2.0, "rooms": 1.0, "location": 4.0}, "id": 8660952, "likes": {"liked": "— OK, but dirty location", "disliked": "— the entire experienc e"}}, {"rating": 3.0, "stay_parameters": "Stayed August 2007, traveled on business", "text": "The room was definitely nice and clean. It had modern decor and furniture to the room. The bathroom was nice and clean. The bed was comfortable.... and so where the blankets and pillows - oh the pillows! =) The room was a tad bit narrow for my taste, but it was NOT closet tiny like most european hotels.", "title": "Fab location - public areas are 'tired'", "helpfulness": 1, "user": "Sackville", "date": "September 3, 2007", "detail_rating": {"value": 3.0}, "id": 8613004}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "Location was what this hotel is all about! It is located RIGHT smack in Leidseplein (if you are familiar with Amsterdam - it is literally one block from Bull Dog). I like the location because yes, it's in a touristy area, but it is in a safe area. Late a night, you can easily walk over to the next block where all of the restaurants and cafes are and people watch all night long. The long streets of shopping are also about a minute's walk away. When you walk about 5 minutes in the other direction, you can easily cross the Holland Casino and make your way to Museumplein. But of course, the tram stops are right near the hotel, so you can pretty much get yourself everywhere around town.", "title": "Lovely hotel, great location", "helpfulness": 1, "user": "bikermich", "date": "August 27, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 8515293, "likes": {"liked": "— Very luxurious", "disliked": "— Expensive so don't drink the mini bar!!"}}, {"rating": 3.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "When we checked out after our 2 night stay the bill included a charge of 9 Euro for two small bottles of water. Not a big deal, but in the scheme of things, this left a bad taste. My advice to management would be, don't make a 500% mark up on water out of guests who have paid handsomely for your services in the bar and dining room. It leaves a bad taste.", "title": "Shame about the water charge.", "helpfulness": 2, "user": "tripping10", "date": "October 3, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 141888383}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "Oh - the reading table is something to see and the stained glass dotted about the building is a magnificent aspect of the 110 year old art deco design. Rooms are spacious, if a good few years past refurb. Noise of Amsterdam at night is a powerful feature of the experience, undiminished by sound proofing. Standard is around UK 3 star at best, but clean with it. Location is great - Leidseplein is for me, the best of Amsterdam. Restaurants in the area are outstanding.", "title": "Comfortable", "user": "JaneSmith1977", "date": "October 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 141732811}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "But 9 Euro for 500ml of water in a room that cost 500 Euro? A bit rude. Wouldn't go back for that reason.", "title": "Recent reviews very accurate", "user": "VivienJane", "date": "September 28, 2012", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "location": 5.0, "service": 4.0}, "id": 141481867}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "I and my husband stayed at the hotel last week. The room was very simple and clean and enough space for us. Hotel location is very close to a tram station and 10 minutes to the central station by tram. Many shops and restaurants are there. Hotel staffs were always very nice.", "title": "Worth every penny", "helpfulness": 1, "user": "Slavica B", "date": "September 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 141404740}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled with friends", "text": "We had a very good time at the hotel.", "title": "best location", "helpfulness": 1, "user": "katashaSwiss", "date": "September 27, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 141385941}, {"rating": 4.0, "stay_parameters": "Stayed July 2006, traveled solo", "text": "I recently stayed in room #408 at this perfectly located hotel. My room had a nice balcony overlooking the canal and was of decent size. I found all the staff I encountered to be friendly and professional. I would definitly stay at this property again. I highly recommend the Amsterdam American Hotel.", "title": "Great stay in room #408", "helpfulness": 1, "user": "Skipper39", "date": "August 11, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 5600992, "likes": {"liked": "— Location"}}, {"rating": 3.0, "stay_parameters": "Stayed February 2006, traveled with friends", "text": "A group of four of us stayed in the Amsterdam American in February 2006. After having booked two rooms in the new Rembrant Square hotel, building wasn't completed in time so we were \"upgraded\" to the Amsterdam American.", "title": "Don't be fooled by the grand facade!!", "helpfulness": 8, "user": "ETolan", "date": "August 11, 2006", "detail_rating": {"front_desk": 2.0, "service": 2.0, "cleanliness": 3.0, "value": 3.0, "rooms": 2.0, "location": 3.0}, "id": 5600476, "likes": {"liked": "— Small smoky rooms", "disliked": "— Try a deal in the Die Poort van Cleve!!"}}, {"rating": 3.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "Having seen the hotels website I was very excited and looking forward to staying there, and upon arrival was encouraged by the grand lobby and restaurant - however this was to change when we arrived at our rooms!", "title": "Super location, rooms fine", "helpfulness": 3, "user": "yuringa", "date": "August 9, 2006", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 5581692}, {"rating": 3.0, "stay_parameters": "Stayed July 2006", "text": "Firstly, check in was a very long and drawn out process, and although the staff were quite pleasant, seemed to take forever. As well as this, the credit card details I gave at reception for security were later fraudulently used for purchases to the tune of £2500!! I have no guarantee that it was a member of hotel staff acting dishonestly, however it was the only time I had used this credit card in months.", "title": "Really average, quite expensive", "helpfulness": 4, "user": "mummytait", "date": "July 15, 2006", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "rooms": 3.0, "service": 4.0}, "id": 5467883}, {"rating": 4.0, "stay_parameters": "Stayed July 2006", "text": "Once we left the lobby and got into the lift it was like we had stepped back in time! The marble floors had changed to 60's style carpet, and the spacious foyer was now a maze of dingy corridors! The hotel room itself served its purpose, but it was tiny. Especially the bathroom - it was virtually impossible to close the door while you were on the loo without taking your legs off!", "title": "reasonable value", "helpfulness": 5, "user": "des101066", "date": "July 12, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "service": 4.0}, "id": 5458179}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled solo", "text": "A stay in this unique hotel is like a trip back in time. It is an Amersterdam landmark and perfectly located for all your sightseeing needs. The front desk was extremely helpful, service in the elegant bar/restaurant was attentive and friendly, and consequently I hated to leave. My room was huge and the single air conditioner vent barely cooled the room, but I got it as an accomodation. After a long flight arriving early in the morning, I begged for an early room check-in and was switched to the only one available. I needed a shower and rest so bad I can hardly hold that against the hotel for their kindness! I can't wait to go back and stay there again.", "title": "Old Style Charm", "user": "Outbound09", "date": "October 8, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 46301795}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "Service was great, hotel and room were very clean and staff helpful. Centrally located and in the thick of the nightlife of the Leideseplein. Our room was a nice size and overlooked the canal. Even though there was always so much going on in the street below, the windows blocked out most, if not all, of the sound. We were welcomed to our room with a letter from the hotel manager which included a voucher for a complimentary drink at the hotel bar and/or restaurant to be used at any time during the time of our stay. We are definitely going back to Amsterdam and will certainly stay here again.", "title": "Great Hotel in a Fabulous location", "helpfulness": 1, "user": "skflowers", "date": "September 8, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 40122905}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "We stayed at this hotel for three days while on a trip from Paris to Amsterdam to Prague to Amsterdam, to Paris. Between the two hotels we stayed at in Amsterdam we enjoyed this one more and found the location to be excellent. The Leidsplein (sp??) District's main square is just two short blocks away and dozens and dozens of restaurants are within walking distance. Several tram lines cross nearby making it a quick ride to most destinations in Amsterdam.", "title": "Great location - Reasonable value", "user": "Tim_H332", "date": "September 7, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 3.0, "rooms": 3.0}, "id": 40026102}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "Like most hotel rooms in Europe, it was small but not overly so and was in good shape and clean. We found the staff friendly. We had asked for a quiet room so ended up high up on the back side so we didn't have a view at all but the room was dead quiet at night. I would imagine that the views on the canal side or on the front would probably be very nice. We interacted very little with the staff, however, the seemed quite friendly and helpful at checkin. Unlike many hotel rooms in Europe, there was an iron and ironing board in the room!! Thank you!", "title": "Comfort +", "user": "djvmax", "date": "September 1, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 39433596}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled solo", "text": "I'd recommend this hotel to friends and family. It compared very favorably with the Hotel Victoria that we stayed in on the way back and was less expensive.", "title": "Great Central Hotel", "helpfulness": 2, "user": "Sidhartha", "date": "August 27, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 38973049}, {"rating": 4.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "Great convenient location, nice staff.", "title": "Happy canal-side stay", "user": "LagunaGrrl", "date": "January 3, 2010", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 5.0, "rooms": 3.0}, "id": 52470743}, {"rating": 3.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "CHECK-IN: It's a 3pm check-in. We had a 9am flight which had us at the hotel by 10:30am. Our room was not available, but with our names in we were told to come back after 12:00 and they'd try to get us in early. We got back by 1:30pm and they had our room ready. Staff were friendly and accommodating.", "title": "great location - not luxurious though", "user": "margmc", "date": "January 2, 2010", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 52386615}, {"rating": 4.0, "stay_parameters": "Stayed December 2009, traveled solo", "text": "ROOM: We had #116, which is a great canal-side room with a balcony. The bed was comfortable and the room large for European standards. The bathroom was fine with great water pressure, however we were traveling in December and there wasn't a heater directly in the bathroom - which meant the air was a bit chilly for the morning shower. No noise to speak of - couldn't hear neighbors or the streets outside. The black-out curtains worked great to keep city lights and morning sun out.", "title": "Eden American - Almost Perfect", "helpfulness": 1, "user": "helovesher", "date": "December 16, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 51365703}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled on business", "text": "LOCATION: Great location. Convenient to Leidseplein, trams and walkable to the Dam. A completely safe area, well-lit.", "title": "Fab Hotel - We didn't want to leave & beware of sleeping in over the alarm!", "helpfulness": 1, "user": "rebeccaeady", "date": "December 5, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 50702344}, {"rating": 4.0, "title": "For Parents, children and family Amsterdam is a great City Break destination", "text": "PROPERTY: The hotel is well-maintained. There's a bar on-site and the cafe is well-known it's own right. There was a large holiday party going on at the time - the staff took care to make sure that hotel guests were not bothered by noise or the crowd by leaving a note in rooms advising of the festivities and who to call if anything was a problem. A rare proactive approach.", "user": "DublinRoseG", "date": "November 14, 2009", "id": 49158658}], "location": {"country": "The Netherlands", "continent": "Europe", "city": "Amsterdam"}, "stars": 4, "variance": {"poor": 79, "average": 176, "very good": 467, "terrible": 37, "excellent": 358}, "aka": "American Hotel Amsterdam", "slim_ranking": 0.302941176471, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.5}, "description": "Historic Hotel resembling a Venetian palace with sweeping arches & clock tower. Certified with the Golden Green Key."}