{"user_rating": 3.5, "review_count": 72, "name": "An Island Oasis", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed March 2005", "text": "We stayed in the separate small cottage with a kitchenette at Blue Skies. The place is for sale and the upkeep on our unit was poor. It was all still usable (except the microwave that didn't work) but the room needed a good cleaning. The bathroom is TINY and there is very little space to put one's clothes. On the plus side, it was quieter than we expected and we were able to use one of two free parking spaces adjacent to our room. We were able to have lunch on the deck just outside the room. There was no space for a table inside the room. The manager was pleasant and helpful.", "title": "the separate cottage with kitchette", "helpfulness": 5, "user": "hadley1", "date": "March 18, 2005", "detail_rating": {"cleanliness": 1.0, "value": 2.0, "rooms": 2.0, "service": 3.0}, "id": 3285543}, {"rating": 2.0, "stay_parameters": "Stayed December 2003", "text": "When we first arrived here for our Christmas vacation (2003) we were very pleased. Cool spot, good location, funky garden area. But when we viewed our room we were slightly disappointed. We booked online where it explicity stated the rooms were \"spacious\" with hardwood floors and other charming features. Our room was on the first level and was just big enough to fit the King size bed and the bad carpet. We got over this though and decided to enjoy our vacation. Came back from dinner that night and went for a pleasant hot tub. This, however, turned out to the the \"warm tub\". When we questioned the host about it the next morning he promised to turn on the heat for us, but never did. This was all bearable, but the big thumbs down point of this place was that breakfast was served directly outside of our bedroom window, which was directly beside our bed! So each morning at 0700 it felt like all the other guests were in bed with us! When we complained (constructively of course) our host was very unhelpful, stating \"No one has ever complained before\". The whole experience put a slight damper on our vacation.", "title": "Nice place but....", "helpfulness": 9, "user": "spooner1000", "date": "November 16, 2004", "detail_rating": {"cleanliness": 5.0, "value": 2.0, "rooms": 2.0, "service": 2.0}, "id": 2828488}, {"rating": 5.0, "title": "Great place to stay", "text": "I was very pleased with my recent stay at the Blue Skies Inn in Key West. The room was very clean and had a huge bed and a nice bathroom. The staff was very friendlyand very helpful. It was also in a great location. I would definity stay there again.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "June 8, 2004", "id": 2172926}, {"rating": 3.0, "title": "Good place to stay but ditch the mattress pad", "text": "We stayed at the Blue Skies Inn in Feb 2004. The hostess was very friendly and accommodating. The room was large and clean. There was a nice kitchenette area with microwave and refrigerator which came in handy for reheating left overs and keeping drinks cool. There is some off street parking available on a first come, first serve basis. There is no pool but the beach is nearby and you can purchase a pass to the Wyndham if desired. The only complaint I have is that the mattress had an awful plastic mattress pad that was quite uncomfortable to sleep on due to its noise and the fact that it makes you sweat. The breakfast was ample and fine. I would stay again but would remove the mattress pad from the bed!", "helpfulness": 4, "user": "A TripAdvisor user", "date": "May 17, 2004", "id": 2070555}, {"rating": 1.0, "stay_parameters": "Stayed July 2008, traveled with friends", "text": "I must admit up front we did not stay at this hotel, however the couple we traveled with did and it was the worst experience ever!", "title": "Oh NO NO NO!!!!!", "helpfulness": 2, "user": "LaurenEk77", "date": "July 21, 2008", "detail_rating": {"cleanliness": 5.0, "value": 1.0, "location": 3.0, "service": 1.0, "rooms": 4.0}, "id": 18119077, "likes": {"liked": "— Room was very spacious and had half kitchen", "disliked": "— the owner and her rudeness"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "While we stayed at the unbelievable Island City House on the other side of the Island, our friends stayed at this hotel. They are frequent travelers to Key West, but it was my husband and I's first time. We went to see the Southernmost Point which isn't far. Then we decided to go to our friends room in this hotel around 3pm. They had some drinks and we made some. Keep in mind, we are all over the age of 30 and were just trying to spend some time with our friends. Next thing we know, at about 3:30 pm, there was a knock at the door. A woman (I assume the owner) was standing there and asking how our stay was. We told her fine. She snapped at my husband and I and asked where we were staying. I told her Island City House and she glared at me as if I were lying. My husband leaned over the top of a wicker chair in an uncomfortable effort to understand what was going on. At this point the woman snapped at him and asked if he leans on his furniture like this at home. Our eyes were wide as ever! I was shocked this woman was talking to us like we were highshcool or college kids! She then proceded to tell us we were waking people up in the building (keep in mind it was 3:30 pm) and that we needed to take it to Duvall Street.", "title": "Truly an lsland Oasis", "helpfulness": 2, "user": "JANNIEBABE", "date": "May 7, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 15765255, "likes": {"liked": "— Peace and quiet away from main drag.", "disliked": "— Nothing!"}}, {"rating": 2.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "I would be first to admit if we were being even remotely loud. The four of us are very respectful professional people, our friend that was staying in the room is a teacher. We were absolutely shocked that we were being accused of sharing a room (I'm not sure why it would be an issue anyway with a roll out couch in the room) and being too loud which we knew was just not true.", "title": "Not an Oasis", "helpfulness": 1, "user": "Woodstock_n_Snoopy", "date": "March 20, 2008", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 3.0, "cleanliness": 3.0, "value": 2.0, "location": 2.0, "rooms": 2.0}, "id": 14406378, "likes": {"liked": "— Bed was very comfortable. Location to Bike rental.", "disliked": "— Felt it was mis-represented in it's ads. Not really an oasis."}}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "In respect to the place, our friend told us the ladies husband was very nice to her the next morning at breakfast and even sat with her. However, I will never stay here nor advice anyone under the age of 80 to stay here. Especially with children. I can't imagine her discontent with a crying baby.", "title": "A perfect get away", "user": "queenbee105", "date": "March 14, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 14285637}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "Stayed at this gem in April to relax after a long winter. Suzy was very friendly and helpful, for anyone needing help booking any of the excursions available. We stayed in the Cottage, very private - lovely marble (?) floors, very comfortable king bed, fridge and microwave. We had Key West Massage come to us on the first morning, and it was wonderful! $160 for a couple's massage- what a way to start a vacation!", "title": "Really a find!", "user": "CSChicago", "date": "January 15, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 12666794}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "We loved staying in this bed & breakfast. It was down by the Southernmost point, half a block away from the beach, it was quiet and peaceful there. It really did feel like an Oasis, especially as we ducked under palm fronds to get to our room. It was cosy and romantic. We got one of their cottage rooms, right next to the hammock and dipping pool, (which was a luxury on those hot days). Clean, cool and comfortable room. Complete with a king size bed, hardwood floor (and ceiling), a mini-fridge and microwave (thank you!), cable with lots of channels, wicker dresser, chair and tables. The bathroom was excellent, clean and well equipped: the shower had a caddy, a shampoo/gel dispenser right in the shower, and a towel just for makeup. Plus the complimentary breakfast was exciting... bagels, fruit, cereal, juice, muffins... a real money-saver. Plus, the concierge was very nice and helpful. (Thanks expedia.com)", "title": "Loved the Oasis", "helpfulness": 2, "user": "PugCake", "date": "October 3, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 10037220, "likes": {"liked": "— intimate and relaxing place", "disliked": "— the distance from Duval St."}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "My husband and I really enjoyed our stay at An Island Oasis! The room was just beautiful and super clean! We felt right at home! Sue is a wonderful hostess and is very helpful with anything you want to see or do on the island. You can't beat the location and price! We will definitely be back!", "title": "Wonderful Stay at An Island Oasis", "helpfulness": 2, "user": "arielnwa", "date": "June 27, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8017279, "likes": {"liked": "— The location.", "disliked": "— We liked everything."}}, {"rating": 3.0, "stay_parameters": "Stayed February 2004", "text": "We stayed 3 nights there last year. Our room was on the first level with an outside entrance. It was on the left hand side which was at the opposite end of where the office was and also where the breakfast was served so it was located on the quieter side. However, the building is located pretty close to the street so plan on some traffice noise. [We masked that at night by having the fan of the air conditioner on--even though it was February.]", "title": "Some Positive Reasons to Stay Here", "helpfulness": 5, "user": "Neepaconejo", "date": "June 22, 2005", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "rooms": 2.0, "service": 4.0}, "id": 3599358}, {"rating": 1.0, "stay_parameters": "Stayed February 2005", "text": "We liked the location because it wasn't too much in the thick of things and we could walk just a block to a very nice restaurant. We could also walk to the beach at the Wyndham Hotel. Buying the guest pass for this beach was well worth it. Key West really isn't known for its beaches and this one was lovely.", "title": "What a dump!", "helpfulness": 9, "user": "bigkitty", "date": "June 12, 2005", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "service": 1.0}, "id": 3544702}, {"rating": 2.0, "title": "What a joke!", "text": "The staff was accomodating and we requested that they put us in a quiet room. Quiet isn't something you can expect much of in Key West but we had no problems with our neighbors. Our room was clean but nothing fancy. And speaking of fancy, the breakfast is not.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "March 21, 2005", "id": 3291592}], "location": {"country": "United States"}, "variance": {"poor": 9, "average": 16, "very good": 16, "terrible": 8, "excellent": 23}, "aka": "An Island Oasis Hotel", "slim_ranking": 0.845360824742, "description": "Intimate Bed & Breakfast in Conch-style House (1939) with New England \"Eyebrow\" design."}