{"user_rating": 3.5, "review_count": 685, "name": "Anaheim Plaza Hotel and Suites", "reviews": [{"rating": 1.0, "title": "don't go there ! they hired a THIEF working there.", "text": "Nothing good to write about this hotel,I just let the world to know some staff work there are NOT HONEST,thank you.", "helpfulness": 3, "user": "mamade154914", "date": "June 11, 2011", "id": 112682016}, {"rating": 1.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "Stay at the Del Sol Inn!!! Same price, 1,000,000X better! Its cleaner and closer to the parks.", "title": "Considered sleeping in the car", "helpfulness": 1, "user": "courtnees", "date": "June 8, 2011", "detail_rating": {"cleanliness": 1.0, "sleep": 1.0, "value": 1.0, "service": 1.0}, "id": 112295850}, {"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled with family", "text": "A few short notes: Only take your children here if you're interested in their resentment for years to come, the homeless men in the parking lot add a particularly \"elegant\" feeling unmatched by any hotel that costs only ten dollars more, and the milk duds left on the floor by the room's previous occupants will lead you into a fun-filled hour long phone call with customer service representatives and hotel management as you angrily beg for your money back and consider sleeping in the car.", "title": "Great value", "user": "PixieDustHolidays", "date": "June 7, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 5.0, "service": 4.0}, "id": 112079271}, {"rating": 1.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "And an in depth review: \"Horrible\" doesn't even begin to describe this hotel. False, false, false advertisement on both their website as well as Expedia's in terms of what you will get in a \"suite,\" how the hotel is set up, the kind of stay you will get, and what you will see upon staying here. My sister and I were looking into a place to stay while visiting Disneyland, and cost efficient as well as location were of our biggest concerns. We chose the Anaheim Plaza because it was both inexpensive and not terribly far from the parks. When we arrived we were stunned.", "title": "bugs on the loose", "user": "Desertzoey", "date": "June 6, 2011", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 2.0, "sleep": 1.0, "rooms": 1.0, "location": 3.0}, "id": 111897171}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "The hotel is set up like an apartment complex and we had to drive to our building, it wasn't even connected to the lobby! The room was disgusting! Moth eaten and stained sheets were atop painfully stiff beds which matched the outdated furniture and archaic television set which the management referred to as their \"newer models.\" The water pressure in the bathroom made showering not even worth doing, and the front desk as well as upper management were so rude, unaccommodating, dishonest, and awful! For whatever reason, while checking in he said to my sister more than three times \"be sure to come down for happy hour\" and when she finally said, \"sorry my sister's not old enough,\" he said, \"she can stay in the room...be sure to come down for happy hour.\"", "title": "OMG", "user": "Victracy", "date": "May 26, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 109892331}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled with friends", "text": "My sister and I stayed here for 2 nights while visiting Disneyland for the LA during an LA stopover. I chose it becasue of the across-the-street location, and the great price. We spent very little time there, arriving at night and then spending the entire next day at Disneyland, but we were very happy with our stay. Friendly front desk staff, nice breakfast buffet and a Dollar car rental on site with reasonably priced one way rentals to LAX. My only complaint would be the cost of wifi and internet kiosks was quite high. If you're looking for a place to sleep close to Disneyland and want great value, I highly recommend this hotel!", "title": "Excellent Value1", "helpfulness": 2, "user": "lovebeachtravel", "date": "July 3, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 5.0, "service": 4.0}, "id": 114977807}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with friends", "text": "The first hotel we hit after a long flight & serious jet lag so it needed to be good...good, it was excellent.", "title": "Fantastic Location, Great Hotel", "helpfulness": 2, "user": "PaulP85", "date": "June 28, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 5.0, "value": 5.0, "service": 4.0}, "id": 114826885}, {"rating": 3.0, "title": "i dont know if i will be back", "text": "Right from check in the staff were extremely helpful with directions & a map of the area, the car parking was right out front & plenty of spaces.", "user": "sgtwrench", "date": "June 22, 2011", "id": 114651872}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled with friends", "text": "The rooms were in separate 2 storey out buildings each with its own balcony, ours had a view towards the front of the hotel and overlooked Disney's California Adventure Park & the Hollywood Tower of Terror ride...what a backdrop to look out onto, better than the views from the actual Disney Hotels. Also a very nice pool area open until 10pm is great for relaxing after a heavy day on your feet.", "title": "Great Deal!", "helpfulness": 1, "user": "Disneyfayn", "date": "June 18, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 5.0, "service": 4.0}, "id": 114217619}, {"rating": 3.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "Location - well what can I say, it is right in the heart of all the food outlets & the Disney main gate where the shuttles drop off is literally across the road. From room to Disney Park gates is 5 minutes walk. Also Disney Village is about 8 minutes walk.", "title": "Price = Hotel", "helpfulness": 1, "user": "realgc", "date": "June 17, 2011", "detail_rating": {"cleanliness": 2.0, "sleep": 4.0, "value": 3.0, "service": 4.0}, "id": 114067771}, {"rating": 3.0, "stay_parameters": "Stayed February 2011, traveled with family", "text": "The Plaza is pretty good for the price we payed. You get what you expect in the way of rooms and theres nothing to brag about. The decor is out dated and and the air conditioning was loud and annoying. The rooms were large and spacious but if you were lucky to have all the features working you were good. Our alarm clock did not work but lucky a wake up call did. Our room happened to be right at the back of the resort style complex and all night the generator/compressor to the hotel would turn on and off again making so much noise i didn't sleep for a week.", "title": "Could have been better....but then location!", "user": "Nicole255333", "date": "May 1, 2011", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 4.0, "sleep": 1.0, "rooms": 3.0, "location": 5.0}, "id": 106420380}, {"rating": 3.0, "stay_parameters": "Stayed February 2011, traveled with family", "text": "The staff were a mixed bunch, some were extremely friendly and other didn't even care you existed. The location was a huge plus! Right next to Disney Land. I mean 10 mins away! There are also many restaurants nearby within walking distance and the hotel backs onto a very nice mall. Unfortunately the mall is always deserted so many shops are not open but the travel agents on the bottom floor are very helpful with booking all your tours.", "title": "Value,Helpful,Friendly.", "user": "junee_ferris", "date": "April 26, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 1.0, "location": 5.0}, "id": 105702701}, {"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled with family", "text": "Also if you book tours to the other parks, being at the Plaza hotel and Suites, your pretty much guaranteed to get picked up first. And believe me, the coaches get packed after doing 5 stops along the hotel strip so getting a good seat matters.", "title": "Great location; good value; would stay here again.", "user": "HappyGramma67", "date": "April 13, 2011", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 103919414}, {"rating": 2.0, "stay_parameters": "Stayed December 2010, traveled with friends", "text": "All in all i would recommend this hotel only for the price and location and since you rarely spend much time in your room you wouldn't notice the imperfections anyway!", "title": "Great location, that's about it", "helpfulness": 4, "user": "MelJane10", "date": "April 8, 2011", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 2.0, "sleep": 2.0, "rooms": 3.0, "location": 5.0}, "id": 103333074}, {"rating": 3.0, "stay_parameters": "Stayed April 2011, traveled with family", "text": "Good value Motel,no passing traffic noise, no view, but enclosed area,with garden table & chairs outside each room. Easy 15 min walk to Disneyland entrance. Plenty of Restaurants in the area.", "title": "large rooms, small price!!!", "helpfulness": 2, "user": "blueskies145", "date": "April 8, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 103300220}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled with friends", "text": "Picked this hotel for the price and because it is within walking distance to Disneyland. Check in was fast and easy. Rooms are nice enough - lots of room, all have balconies or porches, mini-fridge. Nothing fancy, but did not expect much because of the price. Clean is important and our rooms were clean. Maintenance/cleaning staff friendly and working all the time to keep the rooms and grounds nice. Awesome, large pool!", "title": "Right for the price", "user": "xj6jj", "date": "May 24, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 109684766}, {"rating": 3.0, "stay_parameters": "Stayed March 2011, traveled with family", "text": "Has on-site restaurant, but did not eat there. Surprised to find there was a parking charge - $14.00 for 3 nights.", "title": "The best value", "helpfulness": 1, "user": "canuck9964", "date": "May 22, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 109401815}, {"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled with family", "text": "Stayed for 10 nights with 2 ajoining rooms ground floor. We booked direct with the hotel. We were due to stay at the hotel next door but got this one $20 cheaper per night. Money well saved. Sure the place is more like a motel and a bit dated. The rooms were clean, the showers could get a little cold, parking was $4 a night and i would of liked to of checked in earlier after a 14 hour flight...BUT i came to see Disneyland. PERFECT location..BY FAR!!!!! I just wanted a place to sleep and my belongings were safe when i was at the park, but to be honest i think i got more. The rooms were pretty big. We had the kids (4 of them) in one room and us in the other. All six of us did not get in each others way. Sure the tv is a little old, but i didnt come to Disneyland to watch tv. The beds were ok and the pillows. We were so tired after the park we could of slept on the floors. The rooms were clean when we got back each night. VIP tours has an office and pick up from there. Hotel has a handy laundry and a ok gift shop for snacks and such. Always went out to the many places to eat along the way to Disney so never ate in the hotel. Would not use the rent a car in the hotel though. The guy running it kept me waitng nearly an hour while seeing other people that came in after me. Sretty much not to know what he was doing...the Alamo just down the round and around the block was PERFECT in every respect, also a better rate and so much better service. We would walk to the park each day (10 mins max at a slow rate) so no need to stay at a hotel with a shuttle. The front desk staff were neither here nor there. Not good or bad. Didnt do anything bad but also didnt blow me away with great service. They do have internet to use near front desk, but were expensive. Better off going down the road to some of the stores that have internet in them or you could use the net at the Cleaver Bros who also had it, though i didnt use it. Bought citypass through them and got 3 days at Disney,1 at Universal, 1 at SeaWorld and 1 at the San Diego Zoo. GREAT value. We hired a car and drove around with GPS. VERY easy. All in all would gladly stay here again. It was perfect for what we wanted and at a great price. $130 US a night for both rooms. Right across from California Adventure. How could you possibly ask for more. Rooms clean, large and felt safe. We had a fridge in both rooms and a microwave in one. Huge swimming pool and spa. If you want to go on holidays and spend lots of money to be pampered and stay in your room this is NOT the place for you. If you would like to save money to spend more time seeing the parks and sights this is perfect... Can't wait to get back!!!!", "title": "ANother great stay", "helpfulness": 1, "user": "Nicole H", "date": "May 12, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 107891913}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled with family", "text": "This is the third time we have stayed at this hotel. Whilst it is basic it has everything you need for a great stay. The location and price cannot be beaten. Walking distance to Disneyland and a whole range of restuarants. It has a laundry which comes in handy when you are travelling for 4 weeks from Australia! The maids are very nice and friendly. Mostly the front staff are great ( they seem to have a lot of different staff on every night). You can leave you bags there before check in if required. We were lucky enough to get a room before check in after a 14 hour flight which was much appreciated. The hotel is fairly quiet and has a lot of grassy areas for kids to run around without disturbing anyone. Pool area is huge and fantastic. The rooms are basic but comfortable. We did run out of hot water one morning after a sleep in so have your shower early. I dont know where the dodgy reviews come from for this hotel. Who wants to spend more money and waste time catching shuttles to Disneyland when this hotel is cheap and right across the road. We will stay there again and again....", "title": "You cannot beat this place for the price", "helpfulness": 2, "user": "Loveofgage", "date": "May 4, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 106910705}, {"rating": 3.0, "stay_parameters": "Stayed April 2011, traveled with family", "text": "We've now been here twice and have been very impressed both times. Firstly, the motel rates seem to be cheaper through the motel website than through these travel sites. I paid $60/night...even in the Christmas season. The motel rooms are a bit outdated and feel very 60's but our rooms were clean and LARGE. The second trip we utilized the 2 room-combo (two rooms with interconnecting door) for only $109 so we could bring Grandma along. We were able to view the Disney fireworks from the balcony and Tower of Terror was directly across the street. This motel really can't be beat for the price...the location is wonderful!! The staff have been courteous and friendly and the breakfast was very inexpensive and very, very good (again the wait staff was wonderful). I HIGHLY recommend this motel to everyone....hope it stays in local, independant hands and doesn't get bought up as a chain like the other motels in the area. Very Satisfied. OH...and PARKING IS FREE!! ANd you get a minifridge", "title": "Quite a few mess ups, they fixed them somewhat", "helpfulness": 1, "user": "OnHolidayGT", "date": "May 2, 2011", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 5.0, "sleep": 3.0, "rooms": 2.0, "location": 5.0}, "id": 106564746}], "location": {"country": "United States"}, "stars": 2, "variance": {"poor": 85, "average": 166, "very good": 295, "terrible": 63, "excellent": 76}, "aka": "Anaheim Plaza Hotel Anaheim", "slim_ranking": 0.540540540541, "description": "This unique resort style hotel offers the following features:LOCATION:Directly across the main entrance to Disneyland® Adjacent to Anaheim Garden Walk.Two blocks from the Anaheim Convention Center.STYLE:Two story apartment style buildings on nine acres of landscaped gardens and walkways.PARKING:Ample parking all around the hotel.POOL:Olympic size outdoor heated pool and spa.ROOMS:Large rooms, some with patio or balcony.FAMILY SUITES:Two connecting rooms for families.FOOD & BEVERAGE:Mi Casita Restaurant and Lounge.MEETING ROOMS:Over 11,000 sq feet of flexible meeting space.VALUE: Excellent value for a hotel in Anaheim!"}