{"user_rating": 4.0, "review_count": 362, "name": "Anaheim Islander Inn and Suites", "reviews": [{"rating": 2.0, "title": "Just OK", "text": "Stayed in the family suite for 6 nights in September 2006. Rooms definately need to be renovated especially the small bathroom. Good location about a 15 minute walk to Disneyland. Breakfast was a small sweet danish, a piece of fruit with tea and coffee. Probably next time I would pay extra money for a bit more luxury.", "helpfulness": 8, "user": "Fernuch", "date": "October 30, 2006", "id": 6027597}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled with family", "text": "We've been to Disneyland many times and have stayed in many different motels. This stay was for 6 nights. The Islander met all of our needs and is a teriffic bargin. Comfortable beds, clean remodeled rooms with Wi-Fi Internet, continental breakfast, parking space right outside the room, courteous staff, close to Disneyland. We picked a suite with 2 rooms for a small additional fee. Great to have the kids in their own room. Brought our portable DVD player and hooked it up easily to the room TV with RCA jacks. Staff is exceedingly friendly and well informed. We had a low tire with a nail in it Sunday morning just before we were going to make a day trip to San Diego. I figured the whole day was shot, but they directed us to a place that was open Sundays, only a couple of miles away. Half hour later the tire was fixed and we were on our way. Next time we go to Disneyland, we will make our reservation early to be sure we can stay at this place.", "title": "Great Value - Highly Recommend", "helpfulness": 12, "user": "Bobcat10", "date": "October 26, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6014650, "likes": {"liked": "— suites", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "The Islander Inn and Suites was excellent for our stay, clean and comfortable. We took the 'Managers Special' which included 3 free tickets for Disney. What a saving! The location is within walking distance of the theme park and there are plenty of restuarants within easy reach.", "title": "A great deal for Disney.", "helpfulness": 15, "user": "MaryofBramhope", "date": "August 30, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 5726481, "likes": {"liked": "— The great deal and location", "disliked": "— Everything was fine"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2006, traveled with family", "text": "The Manager even gave us a lift to the park, what a deal. Would highly recommend.", "title": "Quiet family-friendly hotel", "helpfulness": 18, "user": "NoTellin", "date": "August 14, 2006", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 3.0}, "id": 5610159}, {"rating": 4.0, "stay_parameters": "Stayed May 2006", "text": "This hotel is a great choice for a family on a budget. It's a full 15 minute walk from Disneyland if you have kids in tow; there are 3 signals to get through. It's clean and attractive--nothing fancy. We stayed for four nights. Morning, afternoon, and evening -- I always saw two or more parking spaces available. The parking is free. The pool is average sized with shaded areas and lounge chairs; I've been to 3 star hotels with smaller pools. The pool offers privacy, and is just a bit on the cool side. The staff was pleasant. There were plenty of towels. The complementary breakfast is great in a pinch: apples, OJ, coffee and danish. There's a soda machine and ice machine onsite. We stayed in a family suite with two rooms. Each room had a TV that got a few local channels and HBO. The bathroom was clean and average-sized. There was plenty of closet and drawer space. A microwave, refrigerator, and coffee machine were in the room. We were able to come back to the room each day at noon for our young one to take a nap alone in a quiet room. The housecleaner was even kind enough to work around our schedule. The walls are a bit thin, but this is a pretty laid-back and quiet hotel. It's far enough away from Disneyland to stear clear of the loud hustle-bustle in the evenings.", "title": "Good location", "helpfulness": 12, "user": "azar", "date": "July 16, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 5472514}, {"rating": 3.0, "stay_parameters": "Stayed February 2006", "text": "I stayed here in Feb 2006 visiting Disneyland for the 50th. I would say that this was a neutral experience because nothing went terribly bad, but it wasn't that terribly great.", "title": "Get What You Give", "helpfulness": 8, "user": "adormouse", "date": "July 8, 2006", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "service": 2.0}, "id": 5438557}, {"rating": 4.0, "title": "Great Hotel at a Great Price", "text": "Parking is limited, unless you are lucky and come back to hotel before 10-11PM. By midnight its virtually impossible to find parking. I never had this problem, but did notice the parking lot packed when I would go outside to smoke. I was kind of scared to leave the car out there, only because the \"Motel\" next to it is very run down with all sorts of bad people.", "helpfulness": 8, "user": "A TripAdvisor user", "date": "July 5, 2006", "id": 5428856}, {"rating": 4.0, "stay_parameters": "Stayed May 2006", "text": "Every day that I stayed there I had the little door handle sign saying NO SERVICE. Meaning I wanted no one in my room, as I have had things messed with (i.e. stolen) before and didn't want anyone and we weren't staying too long we needed anything. After the third day of the sign, the staff took it upon themselves to go inside anyways-- which irked me, but thankfully nothing was taken.", "title": "Great Hotel for the Price", "helpfulness": 8, "user": "Duffy2", "date": "June 8, 2006", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "rooms": 3.0, "service": 4.0}, "id": 5325441}, {"rating": 4.0, "stay_parameters": "Stayed May 2006", "text": "The room was clean enough, no problems, except the bathroom was tiny and outdated. The carpet seemed fine to me and we did get the cable. The only thing that sucked was that when people got up early to go to Disneyland (and we slept in one morning and didn't make it over to Disneyland until 2 PM) you hear everything through the thin walls.", "title": "Great bargain!", "helpfulness": 16, "user": "kellerma", "date": "May 7, 2006", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 5040998}, {"rating": 1.0, "title": "Cancelled reservation and didn't let us know until we went to check in!", "text": "The staff wasn't very pleasant or helpful, they gave me my room, told me about the smoking policy several times (which was unnecessary since I understood the *first* time and smoked outside in the freezing rain), and basically was personality-less. The continental breakfast is a joke and not even worth saying breakfast. Its a couple of peice of fruits and warm OJ, and if you get there early you might get a stale pastry.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "May 3, 2006", "id": 5032048}, {"rating": 5.0, "stay_parameters": "Stayed March 2006, traveled as a couple", "text": "My boyfriend and I stayed here for 4 nights for the 50th Disneyland celebration. The room was very clean and comfortable; sheets, towels, carpet, fridge and coffeemaker were all spotless. It was great having the appliances! We came back to our rooms for a mid-day break and made lunch and put our feet up.", "title": "Great room, Great staff!", "helpfulness": 7, "user": "Heidi H", "date": "February 6, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6749106, "likes": {"liked": "— Good value and clean, very close to Disneyland", "disliked": "— Nothing comes to mind"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled with family", "text": "The second day I had to go to the emergency room and we had no idea where it was, the desk clerk was VERY helpful and actually concerned for us -- he gave wonderful directions and told us he could help us with checking out if we had to leave. I was fine after the visit and the medication and was able to still enjoy our last couple of days at the park. The desk clerk made sure I was fine and was relieved everything turned out okay.", "title": "Loved the Anaheim Islander", "helpfulness": 6, "user": "Parulb", "date": "January 12, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6583273, "likes": {"liked": "— Value, worth, clean"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled with family", "text": "We are planning to go back to Disneyland this coming October and are planning on staying here again. It was such a bargain for all that you get and the staff really cares.", "title": "Feels like home", "helpfulness": 6, "user": "Holidaymemories2007", "date": "January 9, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6568529, "likes": {"liked": "— Very Clean rooms and great staff", "disliked": "— there was nothing that we didn't like"}}, {"rating": 1.0, "stay_parameters": "Stayed December 2006", "text": "We have stayed here on the New Year. Booked it 3 weeks ahead and chose it because it had the bunk beds and 2 queens’ beds, and most places within walking distance of Disneyland were full or very high prices. I would stay there again because it was a great value. We only used the shuttle once, and it was good but the walk to the main entrance only 10 minutes so walk rest of the days.", "title": "Beware ", "helpfulness": 6, "user": "Kayafamily", "date": "December 12, 2006", "detail_rating": {"front_desk": 1.0, "value": 1.0, "service": 1.0}, "id": 6433338, "likes": {"liked": "— Horrible customer service", "disliked": "— STAY AWAY"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2006, traveled with family", "text": "When you are a larger family on a budget but still want quality for your dollar this is the place to stay. The rooms are very clean and the staff are so outgoing and helpful that it makes you feel like you are at your own home away from home.", "title": "Great Stay", "helpfulness": 10, "user": "ann-sin", "date": "December 4, 2006", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 6325343, "likes": {"liked": "— quiet"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2007", "text": "We are a family of four who stayed at this Hotel for 3 nights. The positives to this Hotel are :", "title": "Great Value for Families", "helpfulness": 3, "user": "Biddleonia", "date": "April 6, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 3.0, "rooms": 4.0}, "id": 7285907}, {"rating": 3.0, "stay_parameters": "Stayed March 2007, traveled with family", "text": "- Location", "title": "Good for what it is", "helpfulness": 3, "user": "Amylgam", "date": "March 19, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 3.0, "location": 5.0}, "id": 7191696, "likes": {"liked": "— Location, friendly staff", "disliked": "— cramped parking"}}, {"rating": 4.0, "title": "Great Deal!", "text": "- Separate Bedroom", "helpfulness": 1, "user": "M.BayTraveler", "date": "March 19, 2007", "id": 7187672}, {"rating": 2.0, "title": "Dirty Feet", "text": "- Large rooms which were clean", "helpfulness": 9, "user": "RentonWaFamily", "date": "February 25, 2007", "id": 6838359}, {"rating": 1.0, "stay_parameters": "Stayed February 2007, traveled with family", "text": "- Warm Pool", "title": "The worst hotel I have ever stayed in!!!", "helpfulness": 9, "user": "ppoolman", "date": "February 13, 2007", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "location": 2.0, "rooms": 1.0}, "id": 6787123, "likes": {"liked": "— Leaving", "disliked": "— Everything!!"}}], "location": {"country": "United States"}, "stars": 2, "variance": {"poor": 20, "average": 34, "very good": 165, "terrible": 15, "excellent": 128}, "aka": "Islander Hotel", "slim_ranking": 0.126126126126, "description": "An easy walk to Disneyland® Resort & Anaheim Convention CenterDiscover casual luxury, friendly service, affordable room rates and perfect location for a family vacation or a productive business trip in vibrant Orange County.Our friendly hotel is centrally located in the heart of beautiful Anaheim, California, just 1 block from the world-famous Disneyland® Resort, and the Anaheim Convention Center. We are so close that you can walk to the Magic Kingdom, or if you prefer you can pick up Anaheim Resort Transit shuttle right from our door step with a nominal fee.Our professional staff is courteous, friendly, attentive and committed to making your stay comfortable and satisfying with quality accommodations and legendary service that exceeds your expectations"}