{"user_rating": 4.5, "review_count": 636, "name": "Anantara Dhigu Resort & Spa", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "Our family of four visited this resort in December 2012 over New Year's Eve. The GM, Jeffrey is an affable presence and made us feel so welcome. The hospitality was warm without being intrusive. He gave us good tips on the various restaurants. The food was perfect at the grill restaurant, where we had most of our meals. Breakfast is a spread and the Thai restaurant is superlative. Prices are high considering everything is flown in. Local seafood is not easy to procure. The resort is spread over the island to ensure maximum privacy, the children could play on the strip of beach outside our room in a tranquil bay. There are the usual water sports and the instructors are a god send for beginners. The spa carries elemis products and follow Thai procedures and you can never go wrong with that. My husband spent evenings playing volley ball with guests and staff most evenings. The pool is fairly large and has fairy lights at night. There is so much natural beauty that one is instantaneously relaxed. I barely wore slippers for the whole trip! However, I felt the rooms were a bit too dark and the daily clean up job was average. There was a thick layer of dust at the mini bar. A superb trip and we will surely revisit. Thank you Jeffrey and team. The Shroffs", "title": "A complete resort", "user": "AnganaS_13", "date": "April 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 156549921}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "Feeling is everything. Excellent Service, Elegant and spacious hotel room, amazing sunset and sunrise view, Variety of food from Asia to Europe to Local, I'll definitely recommend everyone I know to stay in this resort when they go to Maldives and I'll also go back again for next holidays. Thanks Anantara Dhigu for everything.......", "title": "\"Happiest Romantic Trip to Heaven\"", "helpfulness": 1, "user": "KhinYadanarWin", "date": "April 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 156518501}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "We were in Anantara Dhigu for 7 days on our honeymoon last November and the experience we had was fantastic! On the first day of our arrival we were picked up by a private boat chartering us to the resort. In the boat, there was only 2 of us and another couple from Sweden. The trip was quite scary as the boat leaving male was really bumpy due to the high tides, but the boat was really really comfortable.", "title": "The best honeymoon ever!", "user": "Edreen Z", "date": "March 27, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 155831536}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "Upon our arrival we were greeted by the Customer Service managers along with the Maldivian drums and a glass of refreshers. We were taken to our Beach villa overlooking the sea. The room was perfect! it was decorated with roses and we had free champaign and chocolate. My only advice is that if you are looking for a private moment together, do not stay in the Beach villa, the reason is because there is no partition between your room and your next door neighbor, aside to that every single thing is perfect.", "title": "Loved it", "helpfulness": 1, "user": "sdasan", "date": "March 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 155521338}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "We upgraded ourselves to the Water villa on our 4th night just to get the experience of the Water Villa. It was more than I could have expected. The room was clean and the service is amazing. You will be surprised everytime you leave your room, because the room will be clean again and again and it feels good to be back inside after being out in the sun.", "title": "The best honeymoon ever at Anantara !", "helpfulness": 3, "user": "ppasha", "date": "March 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 155062722}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled solo", "text": "I honestly cannot say enough about this resort. Heaven on earth is an understatement, It was by far the nicest place I have ever been. I came to this resort as a day guest. I was staying on a local island and decided to splurge ( hey it's the Maldives) and pay the $178 to go for the day. The neat thing about it is that you get to use the $178 as credit to use during your time at the hotel. During the two days ( okay you caught me...one wasn't enough. Had I gone at the beginning of my trip I probably could have talked myself into going every day) I used my credit for an amazing buffet lunch each day, drinks at the swim up bar, parasailing, and a white coconut essence wrap at the spa. You can see why I didn't want to leave. They also had diving, jet skis, wake boarding etc. keep in mind that the \"in house\" guests are first come first served so things fill up quickly. They also have free kayaks and snorkel equipment you can use and a little uninhabited island you can paddle over too. The Anantara is made up of 3 resorts...two 5 star and one 7 star that is private. You can use all the facilities at both of the five stars. They are both very nice, and I have saved the best for last. The pool is AMAZING! Infinity pool looking over the Indian Ocean...breathtaking. And then......the ocean. The ocean is crystal clear. You can see your toes. And if you swim out a bit you get to a sand bar with a hammock just hanging out in the middle of the ocean. An amazing photo opp and super relaxing, If you can't tell from my review...I will be going back! Maybe next time I will be able to afford one of the water villas where I can walk into the ocean. Ohh and as I said...I didn't stay there but I did ask to see one of the rooms. We looked at one of the family rooms with its own pool and outdoor bathroom, vaulted ceilings, bar...yah I would have kids just to stay there", "title": "Heaven on earth", "helpfulness": 1, "user": "spicypepper21", "date": "April 16, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 157904559}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "We got there at night, and getting there and check in was pretty easy and fast. Good for tired travellers who have been in transit for about 8 hours.", "title": "Quiet and relaxing", "helpfulness": 2, "user": "manilamoongoddess", "date": "April 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 157284792}, {"rating": 4.0, "stay_parameters": "Stayed April 2013", "text": "Room was excellent - high ceilings, design features were great and the back door opened out onto the beach. There were no ants in the actual room (some in the outdoor bathroom) and rarely were there mosquitoes. Bed was good and big (bigger than most hotels), they had an adaptor ready for us and they were very abundant with water. Another huge plus was the yoga mat in the room as that helped me do my workouts.", "title": "This is really enjoy !", "user": "mylim168", "date": "April 8, 2013", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 157138448}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "Outdoor bathroom was nice. We appreciated that while it was an outdoor bathroom, there was still a ceiling (unlike at the Condrad where it got to be too hot - and we can just imagine how it was if it rained). The tub was huge but not too big. We ended up using the tub daily while we were there - it was that great!", "title": "A fantastic Maldives experience & hotel choice!!!", "user": "Noodlesam", "date": "April 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 156759534}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "One thing I should warn you about - we got \"gassed\" with mosquito gas one Wed afternoon whilst we were in the tub. No one warned us about that spray so we kinda panicked until we figured out what it was (and then we ended up holding our breaths until the smoke cleared). Would have been warned that they were fumigating that day so we stayed indoors.", "title": "Quiet, expansive and leisurely engaging", "helpfulness": 3, "user": "Ruckdee", "date": "April 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 156596672}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled with friends", "text": "Five days of tropical bliss and luxury. Everything is expensive, from the airfare, airport transfer ($206 roundtrip incl taxes PER person), rooms, food...but you do get what you pay for. The villas were wonderfully spacious. Outdoor bathroom (with tub and 2 showers). Your own patio and loungechair. Infinity pool. A dreamy white hammock in the middle of the lagoon. Gym. We were lucky to catch the free cocktails every Wednesday from 5:30-6:30pm. It gives the staff/managers a chance to meet the guests. Room service food was actually better than in the restaurants (go figure). But if you do have to eat out of your room, do try the Baan Huraa (thai restaurant) at Anantara Veli (the sister-resort across the way). Fantastic Thai cuisine. A bit expensive but it IS good, and they have a set menu for 2 that can actually feed 3 people that makes it a good deal. The spa is super relaxing. Facedown on the massage table, you see a window into the lagoon below. Though you have to pay extra, I highly recommend the sunset cruise (it comes with champagne and hors d'oeuvres). Wonderful wonderful wonderful.", "title": "Paradise indeed!", "user": "dissolvedgirl", "date": "April 28, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 159013312}, {"rating": 5.0, "stay_parameters": "Stayed April 2013", "text": "Just checking out today from anantara. we've spent the past 4 nights here as part of the 1st leg of our honeymoon and the experience has been one I'll never forget. beautiful resort, beautiful sunset water villa, amazing food and hospitality.", "title": "heaven on earth....at a price", "helpfulness": 2, "user": "gusyah82", "date": "April 25, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 5.0}, "id": 158775611}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "I would 1st like to extend my gratitude to matthew and manesh, the hotel managers who went to great lengths to make amends and make our stay a wonderful, unforgettable experience (we had dirty water coming through the taps when we arrived which wasn't very convenient after a long hot journey, the problem was fixed within a few hours).", "title": "A vacation of a lifetime. Heaven is one word to describe", "user": "apisgogo", "date": "April 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 158758738}, {"rating": 5.0, "stay_parameters": "Stayed April 2013", "text": "I would also like to thank issu, our room boy who kept our room prim and proper and was wonderful to talk to. Anything we needed he would go and provide.", "title": "Heaven. On earth. Perfect for everyone", "helpfulness": 1, "user": "Janechokpinyo", "date": "April 19, 2013", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 158233158}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "I would also like to thank adam at the fudan restaurant who provided us with an excellent service.", "title": "Exceeded Expectations", "helpfulness": 1, "user": "lunahouse", "date": "April 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 158103815}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "We arrived 2 days ago and are half way through our holiday with our 2 year old little man. The journey starts with a short walk out from the lounge at the airport straight onto a luxury large speedboat and here the special little moments begin. Cool drinks and friendly boat crew whisk Jack off to the Captains Chair to drive the boat here. Big smiles all road. A wonderful welcome and off to our room which was stocked with an array of Johnsons Baby products. Beautiful seaside sunset villa with easy access to the turquoise blue waters. First night lovely dinner on our terrace and last night at the Japanese tepenyaki on the adjacent Anantara island. We all had a ball with Jackneating masses of egg rice made in front of him. Diving this afternoon and a sunset spa experience the next day. Heaven and such lovely friendly people. Surprising ideal for little children.", "title": "Surprising & Delighting", "helpfulness": 1, "user": "dpe156", "date": "March 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 154728350}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled with family", "text": "We have stayed in Anatara Dhigu for 12 nights in February. It was our 6th holiday in the Maldives (previous stays include Full Moon (currently Sheraton), Olhuveli, Baros, Conrad and Kurumba). These six resorts are quite different so it is difficult to compare. However I would dare to say if your question is Anatara vs Kurumba, choose Kurumba (50% cheaper overall + better service only downside of Kurumba over Anantara is the proximity to the airport and the wave breakers in the ocean). Coming back to Anantara, please find below my detailed review.", "title": "Beautiful views, food and services upgrade much required ASAP", "helpfulness": 3, "user": "Raluca_11", "date": "March 12, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 154329362}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "Views: we had sunset beach bungalow no. 67 and it was very nice (well appointed, comfortable, open air bathroom, close to the swimming pool and main restaurant however not noisy at all). The beach in front of our bungalow was beautiful as well as the views of the lagoon (clear and calm water, with no man-made wave breakers (open view in the ocean)).", "title": "Fabulous Experience!", "user": "BRedIndia", "date": "March 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 154309284}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "Kids club – we were on holiday with our son (he is 2 years and 9 months old). The indoor of the kids club is very tiny and messy (not even close to the kids club in Kurumba). The kids club staff was so and so. It was raining outside so they put all the kids inside to watch cartoons…). Been there one afternoon, did not return.", "title": "Best holiday yet", "user": "R K", "date": "March 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 154208275}, {"rating": 5.0, "title": "Idyllic holiday destination, even by the Maldives' very high standards", "text": "Dolphin quest was disappointing as we did not find any dolphins. Even if we knew they cannot guarantee dolphins, we still had expectations (both adult and kids on the boat). They should be creative and ready to distract the guest in this kind of situation and offer some sort of compensation (for example free ice-cream if no dolphin or “no dolphins but look at the beautiful sunset from the boat” etc).", "helpfulness": 3, "user": "Andy S", "date": "March 5, 2013", "id": 153762240}], "location": {"continent": "Asia"}, "stars": 5, "variance": {"poor": 17, "average": 26, "very good": 112, "terrible": 7, "excellent": 474}, "aka": "Anantara Dhigu Hotel South Male Atoll", "slim_ranking": 1.0, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "An idyllic tropical island paradise set in the South Male Atoll, just half an hour from Male international Airport, Anantara offers the Maldives resort experience you've only dreamt about, with two lush islands, Dhigufinolhu and Veligandu Huraa. Unwind on endless white sand beaches, palm-fringed islands and pristine coral reefs."}