{"user_rating": 4.5, "review_count": 955, "name": "Anantara Bangkok Sathorn", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled with friends", "text": "We got a 2-bedroom serviced apartment for our group of 6. The room was quite spacious so it didn't seem too cramped for all of us with our big suitcases. The hotel was nice and well maintained. The staff were helpful and nice. The only negatifve thing I can think of is the location. You need to ride the free shuttle to get to the nearest metro stop. If you want to go to the main shopping area (where siam paragon or mbk or central world are located) faster, you are better off in a taxi. Tell the driver to use the meter. It will cost around 80baht. Bring the card that came with your key that indicates the name and location of Anantara Sathorn in Thai to make it easier to communicate with the taxi driver on the way back to the hotel from wherever you are because not all drivers know where it is.", "title": "Nice but far from main shopping area.", "helpfulness": 2, "user": "dissolvedgirl", "date": "April 22, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 158439295}, {"rating": 2.0, "stay_parameters": "Stayed April 2013", "text": "We arrived not as close to the main part of town as told got to room 2 single beds it was noisy wind blowing through doors as they didn't line up on runners airconditioning didn't work properly so very musky smell when you walked in the staff were nice and the boys at the door very helpful. After complaining about room they offered free breaky which was bloody aweful you had to wait 25 min for them to cook eggs there was no bacon the juice was hot it was$16 if you were to pay so you wouldn't have been impressed. Complained a second time as they were supposed to have fixed aircon but didn't and beds they told me manager would be in touch didn't happen. We found it very uncomfortable due to heat and as it was the start of our honeymoon it was quite depressing a lot of work needs to be done to bring this up to the standards it should have.", "title": "Not impressed", "user": "terrykc", "date": "April 20, 2013", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 2.0, "service": 3.0, "rooms": 2.0}, "id": 158321645}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "We stayed here for 3 nights and we couldn't fault it apart from it location, it's a little out the way but the hotel staff will sort you out with a taxi that will cost very little to go to see the city sights. Staff was friendly very welcoming which is nice to see after a 12hr flight.", "title": "Very nice hotel", "helpfulness": 1, "user": "Stpoole", "date": "April 19, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 158170788}, {"rating": 4.0, "stay_parameters": "Stayed March 2013", "text": "We have booked for one of the 2 bedroom suite, one of the one bedroom suite and one premier room. We stayed for 4days 2 night. When we reaches there, its abit dissapointing as we already before end. But when we reaches there it already three plus (thai timing) all the room are not ready. We have to wait at the premier room first but only after 20mins later. We waited for two hours for another 2 room suite keys. The receptionist was abit impolite. Its hard to communicate as they dun really knows hw to speak english. But the doorman was friendly. Eventually after we gotten the key, we are pleased wit the room suite. Worthy n its huge. Its look beautiful. The hotel was far from the town area but luckily we hired a driver n van there. The breakfast was also excellent. When we reaches hme, we call them coz my father forgotten his vest. They said they will email us to arrange ffor us to send bck, whether they saw it or not. Its a mths already but no reply frm there. The srvices might need to be improve. But the doorman n overal we do have fun there.", "title": "Satisfied afterall.", "user": "eezah", "date": "April 18, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 4.0, "rooms": 5.0}, "id": 158106983}, {"rating": 5.0, "title": "simply awesome!!", "text": "We (my husband, my son and I) were there for 7 nights and stayed in their one bedroom suite. We simply loved the hotel. They are very quick to reply to our emails, no matter what we asked and how many times we asked for the same information.The bed and the pillows were very comfortable, something we really enjoyed after a long day of sight seeing and shopping. The shower and the bath were great. The staffs were very helpful and friendl, extremely good with kids. Our son loved their kid's menu food. We would recommened this hotel to everyone. It is not very far from the train station. We usually walked but they have the shuttle and tuk tuk services as well.Couple of minor things that we didn't like was the last two days we weren't given the bathrobes, the breakfast buffet was a bit simple and not a lot of varities and maybe a liittle more toys in their Crayons room for toddlers. Other than that we had a very enjoyable time there. We had left few things behind and when we emailed them we were told that it has been kept in their lost and found box. For our next visit, we will be going back to Anantara.", "user": "Lopsee S", "date": "April 16, 2013", "id": 157900303}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "I came here with my partner in March for a 3 nights stopover before hitting Phuket and I can confidently say that this was the best hotel in our trip. We paid a bargain price for a 1 bedroom suite that had 2 balconies, a shower big enough for two and a location that was convenient for those keen to experience Bangkok public transport.", "title": "Ample room in a cramped city", "user": "greenbagguy", "date": "April 2, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 156444697}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "The Anantara was a bit tricky to find (our taxi driver took two wrong turns and had to ask for directions; scam or not, we'll never know). Once we stepped in, things started looking up. The check-in was swift and friendly with staff who were confident in their duties.", "title": "Perfect Bankok Vacation, Would Love to Stay Here Again!", "user": "wanjoboy", "date": "April 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 156376168}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "The room was clean, well-appointed and very spacious. We had 2 balconies that offered a view of the surrounding neighbourhood. The air-conditioner was powerful though the fan was a little bit noisy at maximum settings.", "title": "Great for Families", "user": "bligg", "date": "April 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 156368888}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled solo", "text": "Breakfast was an average buffet spread. It was nowhere as grand or varied as the hotels in Singapore and Malaysia but it was still satisfying. The restaurant tends to get busy and crowded around 8.30 am. Anyone staying there who wishes for a more peaceful breakfast should get there early before the larger groups fill the spots.", "title": "Nice and great apartment hotel", "user": "thierry d", "date": "April 1, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 156241740}, {"rating": 3.0, "stay_parameters": "Stayed March 2013, traveled with friends", "text": "The hotel offers a free shuttle service that takes passengers to the Chong Nonsi BTS train station (a 10-15 minutes walk away) but there is also the BRT Akarn Songkroh bus just at the hotel doorstep that connects you to Chong Nonsi/Sathorn. Overall, it is very convenient to get around. The shuttle service is fairly regular and prompt but also very popular with limited seats. Get there early to avoid disappointment and inform the doorman you're there for the shuttle service. He'll get you to wait in the cool lobby and will notify the driver you are waiting (hence saving you a spot).", "title": "The room need maintenance", "user": "HongLee", "date": "April 1, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 156215546}, {"rating": 5.0, "stay_parameters": "Stayed April 2013", "text": "Checked in earphones to the Anantara Sathorn after an 11 hour flight & were greeted with nice happy staff as you expect in Thailand! The hotel is approx 400m from the nearest BTS station of Chong Nonsi which us literally straight up the road ;) We also caught the Airport Express to Praya Thai then the BTS to Chong Nonsi which saves so much time versus taxis. We were only staying one night so picked the hotel due to its proximity to the BTS and the River. Pool was nice and relatively quiet but we only used it for a quick dip before breakfast :) Now, the breakfast :). We have never had a breakfast quite like this, absolutely everything has been thought of, so much choice available for many nationalities and everything was super fresh! If we ever come back to Bangkok we'll be staying here again for sure!", "title": "One of the best breakfasts ever!", "user": "Aileen S", "date": "April 8, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 157016982}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled with friends", "text": "stayed 5 nights at this hotel...good service. accept the mail problem I went to the local post office and brought 10 stamps for postcards ...when I asked reception to post them no problem by the time I got back to my room I received a phone call to say the stamps were out of date..went down again was told that as I brought they stamps yesterday they were out of date I would have to buy new ones gave the man another 150 bats and he said he would put new stamps on them and fix everything up..........guess what ..not 1 person received a postcard must have been his way of making money my only complaint enjoyed the service and staff of this hotel", "title": "missing mail", "user": "carbrookman", "date": "April 7, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 156847121}, {"rating": 2.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "We chose this hotel as it was close to Nahm where we were eating on our last night in Thailand.", "title": "very disappointing", "helpfulness": 1, "user": "Unic", "date": "April 6, 2013", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 2.0, "location": 2.0}, "id": 156808742}, {"rating": 3.0, "stay_parameters": "Stayed February 2013, traveled with family", "text": "We arrived at 7 after a long journey from Hua Hin thanks to the deadly Bangkok traffic. The welcome was pleasant and we rushed to our room to get a quick shower and change before we went out. The room was stiflingly hot.", "title": "Nice if you want to leave the hustle and bustle", "helpfulness": 1, "user": "Kelly L", "date": "April 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 1.0}, "id": 156543026}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "We returned after dinner to discover the room still astoundingly hot. We contacted reception and they sent someone up to look at it. He stood on the room chair to access controls. Left telling us he would be back. After ten minutes we were still hot and waiting. We contacted reception again to ask them to get it sorted. They apologised. No one came, the room slowly got cooler. We went to bed, covers off. After 10 minutes (probably half an hour after our second call) we had a call on the phone which we ignored.", "title": "Does the important things very well", "user": "HuntingtonBeach", "date": "April 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 156447142}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled on business", "text": "Anatara is right at the heart of the financial district and close to the BTS station so transport to the shopping districts are pretty easy!!! Its Modern, Spacious and had an exceptional b'fast spread. The service is top notch and facilities are top notch. The Bar at the top is amazing and a must try after a long day at work.", "title": "Amazing!", "helpfulness": 1, "user": "shammu_b", "date": "April 13, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 157572583}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "We've stayed in a 2 bedroom suite for one night as it's our last night flying out of Bangkok. Excellent value for money. We've had a lot of space in our apartment. It was very modern and clean. I would highly recommend for family with kids. It's not in tourist area, but was good to be amongst locals.", "title": "Excellent value for money", "user": "YellowMountain43", "date": "April 12, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 157515611}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "Modern, clean, friendly, helpful, nothing to much trouble, quality and taste.", "title": "Amazing!!!!! just book it!!!!! Don't look any further !!!!!", "helpfulness": 1, "user": "Mickynicky", "date": "April 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 157474573}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "Stayed for two nights.", "title": "Friendly service. Good sized suite.", "user": "legendifs", "date": "April 9, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 157146071}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "Front of house helpful, friendly, nothing too much trouble.", "title": "Great family place", "user": "Fussells", "date": "April 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 157018113}], "location": {"country": "Thailand", "continent": "Asia"}, "stars": 4, "variance": {"poor": 28, "average": 90, "very good": 337, "terrible": 14, "excellent": 486}, "aka": "Anantara Bangkok Sathorn Hotel Bangkok", "slim_ranking": 0.123978201635, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 3.5}, "description": "In the heart of Bangkok, moments from the city’s business and shopping hubs, Anantara Bangkok Sathorn offers the perfect urban sanctuary. Unwind in the seclusion of the hotel’s fastidious designer surroundings. Explore the city’s most vibrant, traditional and contemporary areas. Replenish with a host of world class services and facilities. Anantara Bangkok Sathorn makes the most of its fantastic location with incredible panoramic views across the city, courtesy of floor-to-ceiling glass windows in each well appointed room and suite. Matched with the hotel’s unrivaled services and facilities, Anantara Bangkok Sathorn becomes the capital’s ultimate retreat."}