{"user_rating": 4.5, "review_count": 601, "name": "Anantara Resort and Spa Hua Hin", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "Staying at the Anantara for the 1st time we expected better especially after reading the many reviews. After checking in and the upselling techinques Rooms & Meals felt as though the company is more interested in profit than guests. Found communicating to the restaurant staff very difficult poor english skills for a \"5\" star hotel. Saw very few signs of mgt around the resort asked to see the GM after several dissapointing meals in the Thai restaurant & beachside cafe as was told that the Mgr would contact our room, which ofcourse never happened. Room was confortable but very dated, green tiles & a tiny bathroom. Not sure if I woud stay at an Anantara gain. Disappointed.", "title": "Should be Better", "helpfulness": 3, "user": "DarrenSheppard", "date": "August 24, 2008", "detail_rating": {"front_desk": 2.0, "service": 2.0, "cleanliness": 3.0, "value": 3.0, "rooms": 1.0, "location": 3.0}, "id": 19290423}, {"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "Having arrived at The Anantara Resort after 4 lovely, but hectic days in Bangkok we were welcomed most warmly with a cool towel and a drink. Despite there being at least 10 other people checking in at the same time we did not feel neglected. The receptionist who was checking us in then congratulated us on our first wedding anniversary and my birthday (both the same day) and went on to talk about an upgrade to the lagoon room. Due to her broken English I understood we were being given a complimentary upgrade, but then came the sting. She was actually offering us the the chance to pay for the upgrade. The cost was the equivelent of over £500 sterling. I explained that we could have booked it cheaper at home in the hope they would be open to negotiation, but alas she was not. We decided to stick with the Garden Villa which was very nice, however, the bathroom could use a makeover and it was absolutely tiny. We realised we were staying in a four star resort and felt what we got was actually quite good value for what we paid.", "title": "Loved it, But!", "helpfulness": 5, "user": "mdc092", "date": "August 7, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 3.0}, "id": 18719307, "likes": {"liked": "— Always clean and very comfortable", "disliked": "— The bathroom was tiny"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2005", "text": "We were unable to meet the food and beverage manager until two days in to our 9 day stay. It was at the meeting with him he offered us an excellent lunch and dinner package for three lunches and three dinners for a total of £58. There was also a five day package available but we wanted to experience the food in the town. We did feel that this food package should be offered at check in rather than or at least along side the overpriced room upgarde. The quality of food was outstanding. The breakfasts were among the best of any resort or hotel we have ever stayed in, including the Palace in Dubai and Reethi Rah in the Maldives. Our favourite restaurant was the Italian. The service and quality of food is truly first class and could hold its own with any 5 star resort. The service on the whole was excellent with courteous staff throughout the resort with the possible exception of a couple of bar staff who were a bit sullen. On our anniversary we had booked a private dinner. When we arrived we were greeted by our waitress who was on hand soley for us for the duration of our meal. The area we chose to eat was decked in white drapes and flowers and looked amazing. When we arrived back at our room there was a beautiful chocolate Birthday cake waiting for me. All in all we had a lovely time at The Anantara and would definitely go back. The resort and its surroundings are really much better than the 4 star rating but the standard rooms let it down very slightly although they are clean and comfortable with a lovely terrace. We came here on a very good package having spent an absolute fortune on our honeymoon last year. I was a bit apprehensive but it really did exceed my expectations. The grounds are phenomenal and taken care of by a huge team of gardeners. The only dissapointing thing was that on checking out they tried to sting us for a 10 minute local call by overcharging us by 20 times. I said I would pay the going rate an not a penny more. They agreed. Be warned, everything you use or buy has a service charge which in some ways takes the hassel out of tipping but it does become a bit rediculous when a service charge is added to a phone call or to purchases made at the gift shop. I simply refused to pay these charges and they were removed from the bill.", "title": "first class hotel", "helpfulness": 1, "user": "angieNewcastle", "date": "August 7, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "business": 5.0, "cleanliness": 5.0, "rooms": 5.0, "location": 4.0}, "id": 18715111, "likes": {"liked": "— tranquill very relaxing in beautiful surroundings and staff were excellent", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "would recomend this hotel to all it is absolutely amazing everything from the rooms to food and staff were excellent. could not be faulted in anyway do not listen to poor reviews. would go back in an instant.", "title": "Enjoyed the hotel", "helpfulness": 2, "user": "alliealliecat", "date": "July 12, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 3.0}, "id": 17818781, "likes": {"liked": "— Lagoon Room was fantastic", "disliked": "— Nothing!"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "I stayed in the hotel in September, and as a Travel Agent, will try to give you a good all round view.", "title": "Just short of paradise", "helpfulness": 2, "user": "pjay72", "date": "June 25, 2008", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "rooms": 3.0, "location": 3.0}, "id": 17204205, "likes": {"liked": "— Pool and gardens", "disliked": "— Rooms and location"}}, {"rating": 1.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "The Anantara Hua Hin is NOT comparable to a Four Seasons, or Ritz Carlton, or a Sheraton; not even close. It aspires to the big league, but unfortunately falls short largely due to disappointing service.", "title": "Did not live up to expectations, disappointing service", "helpfulness": 4, "user": "TTIW", "date": "June 9, 2008", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 2.0, "value": 2.0, "rooms": 2.0, "location": 2.0}, "id": 16791422}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "Firstly on the positives. The hotel is reasonably pretty, with well grown-out gardens, wood carvings and furniture, and so forth. Also, the food is good. Unfortunately, these are about the only good things I can say about it.", "title": "A wonderful place", "helpfulness": 2, "user": "JoeCampbell", "date": "May 16, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 3.0, "location": 5.0, "rooms": 5.0}, "id": 16086506, "likes": {"liked": "— The quality of the buildings and gardens - the aesthetics", "disliked": "— Can somebody not invent silent aircon?"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "In terms of areas for improvement, the hotel needs to focus on a lot of things. On our second day there, it was very hot during lunchtime, so we were seeking somewhere indoors or in the shade to eat, but got rejected by both restaurants. The Italian restaurant was hosting a group lunch for a large corporate's employees, while the Thai restaurant was hosting a tour group and wouldn't let us sit in the shaded area even though there were empty tables. And we were fully paying guests! I guess this is another takeaway: this isn't really a romantic place you'd go to, as they do bring in tourists by the busloads.", "title": "We loved Anantara", "helpfulness": 1, "user": "Brydon55", "date": "May 2, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 15564289, "likes": {"liked": "— Our room, the food and the friendliness of the staff", "disliked": "— Brekfast at the beach"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "Secondly, we reserved a car \"limousine\" to bring us from Hua Hin to Bangkok airport to catch a relatively early flight; we went up to the front desk to make this reservation the day before our departure. On the morning we were supposed to leave, our car didn't arrive at the appointed time of 6.30am. Fifteen minutes passed, so we went to ask the front desk what was taking the car so long. The three men at the desk said \"Sorry late, five more minutes\", several times. Their body language (nervous, not looking us in the eye, speaking to each other in Thai) betrayed them however; we eventually found out that the reservation had not been sent to the car transportation firm the day before. The front desk lied, and didn't even have the courtesy to aplogise to us. This to me is utterly unacceptable.", "title": "relaxing", "user": "senna1", "date": "April 27, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "rooms": 5.0, "location": 4.0}, "id": 15403185, "likes": {"liked": "— the size and quality of the room", "disliked": "— not much to complain about"}}, {"rating": 5.0, "title": "holiday paradise", "text": "I will not stay at an Anantara ever again.", "helpfulness": 1, "user": "GwynBath", "date": "April 21, 2008", "id": 15182731}, {"rating": 4.0, "stay_parameters": "Stayed October 2008, traveled on business", "text": "This location is a small paradise of beach, swimming pool, bungalow.", "title": "So relaxing", "helpfulness": 2, "user": "flash76", "date": "October 23, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 21135689, "likes": {"liked": "— AERA", "disliked": "— nite reception"}}, {"rating": 5.0, "title": "Great retreat, great service!", "text": "A nice place for a honeymoon trip where you can enjoy spa and relaxing.", "helpfulness": 2, "user": "BangkokNegotiator", "date": "September 17, 2008", "id": 20131378}, {"rating": 4.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "For a short vacation we didn't have time to travel too far, so Hua Hin was our choice as we live in Bangkok. First time to this resort we didn't know what to expect. We were already impress with the landscape and the designed of the hotel. The reception was very nice and helpful, right away we felt at ease.", "title": "Good trip", "helpfulness": 2, "user": "SammyJS", "date": "September 16, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 20113250, "likes": {"liked": "— Fab room!", "disliked": "— Price of drinks!"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "We tried the spa, their signature package was the wine scrub.. I think that's what its called. The spa facility is beautiful and the staffs are very professional. We are already talking about our next visit there.", "title": "Anantara or Sofitel Hua Hin?", "helpfulness": 3, "user": "Diarmaid", "date": "September 2, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 19644358, "likes": {"liked": "— Lagoon rooms, friendly staff and swimming pools", "disliked": "— Lack of a watersports scene and standard rooms were quite old"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "Our room was nice and simple. The bathroom is a bit small but all that don't seem to matter much. Food is very good, especially the breakfast buffet with lots of fresh fruits.", "title": "Fantastic holiday, again", "helpfulness": 3, "user": "Somchay", "date": "August 30, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 19550301, "likes": {"liked": "— The people that work there", "disliked": "— Nothing in particular"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2009, traveled as a couple", "text": "Stayed 29 December-6 January in superior lagoon room #851 and deluxe lagoon room #821.", "title": "Most enjoyable!", "helpfulness": 1, "user": "pelun", "date": "February 4, 2009", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 24201631, "likes": {"liked": "— Tranquil", "disliked": "— Spa"}}, {"rating": 2.0, "stay_parameters": "Stayed January 2009, traveled as a couple", "text": "All in all this resort is perfect. It’s not “hot” design place, no extravagant “luxury” with gold and crystal chandeliers, but a wonderful well appointed hotel in a more traditional exclusive Thai design. It has a cool and gentle atmosphere. Very soothing. The lagoons, tropical gardens, swimming pools and beachfront are beautiful. It’s a large property with only 137 rooms nestled either in the tropical gardens or by the lagoons. Lagoon room is best choice. Large with high standard, terrace or balcony, “open” bathroom with tub for two. Lot of wardrobe space! Always replenish of water (4 bottles) in the morning and in the evening. View from our deluxe lagoon room stunning. Fantastic sunset. The excellent breakfast can be enjoyed in the room, by the seafront or in the breakfast restaurant. There are 3 restaurants. Dining next to the ocean having a freshly barbequed shell/seafood platter is unforgettable. The Italian restaurant is beautiful and serving good food. There is also a thaifood restaurant whih we didn’t try but had very good thaifood for lunch at the beach or by the lagoon pool. The lobby bar is calm, beautiful and serving great afternoon tea and evening cocktails (accompanied by soothing live music). Main pool large but can be a bit crowded and noisy from kids playing. There are plenty of sun loungers by the ocean, but during winter there is no real beach. However there are stairways right down to the ocean which is shallow for a long way out on a nice sandy bottom. For the lagoon room guest there is an additional lagoon pool (with private bar) which is stunning. The hotel has plenty of staff and the service is impeccable. The staff is very friendly and surprisingly a general good English knowledge. Unfortunately only thing not impressed by was the spa (although gorgeous). Had the worse and most expensive Thai massage ever. Furthermore, I’m continuously disappointed in Thailand of the many luxury hotels who cannot have a free water service during the hot days! However apart from that you can relax, wind down and enjoy! Should you like to leave the resort Hua Hin center is only 10-15 minutes away. Make sure take a regular taxi not a tuk tuk! Price is same (thb 200) and taxi feels much safer! Try the Japanese restaurant Hagi!", "title": "Tired, expensive and isolated. Not worth it. Sydney", "helpfulness": 2, "user": "Moonwalker123", "date": "January 25, 2009", "detail_rating": {"front_desk": 2.0, "business": 1.0, "service": 2.0, "cleanliness": 3.0, "value": 2.0, "location": 2.0, "rooms": 2.0}, "id": 23884661, "likes": {"liked": "— Nothing much", "disliked": "— Food, wine, lack of facilities, no free drinking water"}}, {"rating": 3.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "My husband and I stayed at this resort for a week in Jan 09. We we were later joined by our 18 year old daughter who got sick in India on a trek and then joined us at the resort for 4 days.", "title": "It was Ok not fantastic", "helpfulness": 2, "user": "GillianHorsfield", "date": "January 6, 2009", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 3.0, "cleanliness": 3.0, "value": 1.0, "location": 3.0, "rooms": 3.0}, "id": 23322986, "likes": {"liked": "— Hotel Staff", "disliked": "— Location"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "We had stayed at the Anantara in the Golden Triangle a few years ago and really enjoyed the resort. We thus thought this one would be the same. But, alas, we were disappointed.", "title": "Haven of tranquility!", "helpfulness": 4, "user": "Kat-Leigh", "date": "December 29, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 23081944, "likes": {"liked": "— Everything !!!", "disliked": "— Nothing."}}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "The resort is tired and needs a face lift. It is also really far out of Bangkok, needing a 3 hour taxi/limo transfer which is quite expensive. It is also far out of the town and so most of one's meals need to be taken in the resort. The food was reasonably priced but not of a really good quality and boring after a while as the menu did not change and there was only one restaurant at lunchtime. The more formal restaurant at night was better as the head chef was Italian. But, the wine selection was very average, esp. the by the glass choices. Not expected of this resort.", "title": "Loved the Anantara", "helpfulness": 1, "user": "itchyfeet77", "date": "December 3, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 22420527}], "location": {"country": "Thailand", "continent": "Asia", "city": "Hua Hin"}, "stars": 4.5, "variance": {"poor": 29, "average": 57, "very good": 203, "terrible": 7, "excellent": 305}, "aka": "Anantara Resort And Spa Hua Hin Hotel", "slim_ranking": 0.133858267717, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.0}, "description": "The 187-room Anantara Resort Hua Hin is a distinctive Thai village-style property located on the sunrise coast of the Gulf of Thailand, around 220 kms south of Bangkok. Hidden amidst 14 acres of luxuriantly landscaped gardens and lagoon pools, the picturesque resort enjoys a beachfront location at the quiet end of Hua Hin's long sandy beach for only 5 kms. from Hua Hin town centre. A three-meters high terracotta wall cleverly cocoons the resort from the hustle and bustle of town. As you make your way along the landscaped driveway, a sense of calm descends. The sense of arrival is heightened as you admire a decorative wall adorned with a parade of elephants. A cool breeze drifting in from the beach floats through the open-air Lobby with the strains of a melodic Thai tune lingering. Polished timber floors and Thai-style salas (pavilions) heighten the ambience of an intimate tropical hideaway."}