{"user_rating": 4.0, "review_count": 137, "name": "Anastasia Inn", "reviews": [{"rating": 5.0, "title": "Would not hesitate to recommend or return", "text": "I stayed @ the Anastasia Inn for 4 days - booked it because of the reviews here. I want my hotel to be clean, to feel safe, and to be relatively quiet. The AI was these things. I'm not seeking a resort, as I'm not vacationing in the hotel.", "user": "sfm132", "date": "May 12, 2008", "id": 15974102}, {"rating": 3.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "I asked for a top floor room (so I would not hear plumbing from the room above); and except for the infrequent \"rice-rocket\" bike winding it up on A1A, I did not hear any street noise. The frig & micro in room 202 worked well; TV had about 15 channels and HBO. The AC worked well & it was easy to regulate the room temperature.", "title": "Won't be back", "user": "belgamo", "date": "May 8, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 2.0, "value": 2.0, "rooms": 1.0, "location": 4.0}, "id": 15786599}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "This is not a new or fancy property; otherwise they could not offer the rates they do. 4 nights here cost me what 1 night in Charleston did. The pool is quite small, but looked very clean.", "title": "Another great stay", "user": "SpaceCowgrrl", "date": "May 5, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 15691906, "likes": {"liked": "— Friendly service, clean rooms, great value", "disliked": "— Nothing to complain about"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled with family", "text": "There is construction nearby - the Bridge of Lions is being totally restored, so there is a temporary bridge up. But a sidewalk is in place, so the old city center is still within walking distance if you wish.", "title": "Great place for a Getaway", "helpfulness": 1, "user": "Sunshine817", "date": "April 8, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 14879103, "likes": {"liked": "— Clean, comfortable, friendly, and great location", "disliked": "— not applicable."}}, {"rating": 3.0, "title": "Good for a short stay", "text": "If I visit St. Augustine again, I will stay at the Anastasia Inn.", "helpfulness": 1, "user": "obersholt", "date": "April 5, 2008", "id": 14810136}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled with family", "text": "This was a great place to stay for 7 of us in 3 rooms for 2 nights. The price was unbeatable with clean rooms and continental breakfast. The place was spacious and the breakfast of cereal, muffins and bagels were fresh both days. As long as they keep it up to par, we will stay here again on all our visits to St. Augustine and will recommend this place to all our friends and family. Please do not hesitate to stay here as it is better than the chain hotel that we stayed in on the other side of the bridge. You get a real bargain for the money. You will not find a better deal in St. Augustine.", "title": "Great Place to Stay Cheap-Clean & Spacious", "helpfulness": 3, "user": "vacationtoanywhere", "date": "February 11, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 13458339, "likes": {"liked": "— Location, Cleaniness, Price", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "This hotel was so reasonably priced: $59! which included a more than adequate buffet breakfast. Great location just across the bridge from the old town. Very pleasant owner, rooms sparkling clean, everything worked fine. We stayed here because we had read the great reviews on Trip Advisor and it's always a thrill when you find something you can trust. Anyway, would definitely stay here again. The fish restaurant: O'Steens close by seemed to be a most popular place to eat, but very expensive, so much salt in the food that everything on the plate tasted the same, ultra poor service and long (outside) line-ups. Walk across the bridge and find somewhere better.", "title": "Definitely lives up to its great reputation", "helpfulness": 5, "user": "NimrodToronto", "date": "February 2, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 13217892, "likes": {"liked": "— location and price"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "Spent two nights here in January of 2008. This is not a modern hotel (newly built), but it was clean, spacious enough, and had plenty of hot water. We did not use the pool as the weather was cool-it was very small but clean and the water was warm. Heating/cooling unit in the room worked well. Breakfast items (bagels/muffins/coffee) were fresh. We arrived late and found a note on the office with instructions! Staff responded immediately and got us into our room quickly-they were very helpful. Very informal atmosphere. We would stay here again.", "title": "Clean and Fairly Priced", "helpfulness": 3, "user": "RegRgr", "date": "January 19, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 3.0}, "id": 12800513, "likes": {"liked": "— Clean, quiet, and close to town.", "disliked": "— Rug was stained."}}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "Just outside of town, this motel is a bargain. We arrived late and decided we wanted to spend one more night in St. Augustine. The desk clerk was able to find us another room, though we would have to move the next morning. He gave us a late checkout, and we were going to move our luggage into the other room after the other guests checked out. The next morning the clerk told us we had rearranged the rooms, so we could stay where we were. Hooray! Everything worked fine in this hotel. Bathroom had a little mold - I would imagine mold can be tough in Florida. Beds were comfy. Spacious fridge- though I should have checked - it was set very low and wasn't cold enough. The Bridge of Lions is under construction and not really a pleasant walk like we had hoped. Instead we bought the Old Town Trolley tickets for $17 a piece and got picked up right at the hotel by their \"beach shuttle\". The trolley was great - took us everywhere we wanted to go and saved our feet, so we still felt like wandering the town well after dark. We took a cab back after dark for a few bucks. We left our bikes on the back of our car and had no problems. Breakfast included cereal, muffins and bagels. Standard motel fare. St. Augustine is a very fun and cute town. We especially loved the fort. Great stay.", "title": "Bargain", "helpfulness": 4, "user": "girlygirl8701", "date": "January 14, 2008", "detail_rating": {"cleanliness": 4.0, "front_desk": 5.0, "location": 4.0, "value": 5.0, "rooms": 5.0}, "id": 12601854, "likes": {"liked": "— Cost, convenient location"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2008, traveled with family", "text": "We stayed at the Anastasia Inn on our way home from Disney. We love the St. Augustine area and always look forward to a stop there either on the way down or back; needless to say we have stayed at many hotels in St. Augustine. On our way home, with cash getting in shorter supply we felt like we didn't want to pay a zillion dollars for a quick night, we checked in our \"Room Saver\" coupon book and stopped by the Anastasia Inn, we reviewed the room and booked 2., with the coupon price both rooms came to $87.00, less than the price of 1 room at the \"Sleep Inn\". Now, I am a \"neat nick\" and am completely paraonoid about dirty bathrooms, this place did not disappoint and I must say was the cleanest hotel on our stay ( we are generally Best Western, Holiday Inn, Sleep Inn people) and certainly the cleanest hotel we have stayed at in St. Augustine. The complimentary continental breakfast is just O.K. but hey, for the price the place is a real steal, I would definately stay there again, and will.", "title": "Great spot off the beaten path", "helpfulness": 5, "user": "WendyCanada", "date": "January 12, 2008", "detail_rating": {"cleanliness": 5.0, "front_desk": 4.0, "location": 4.0, "value": 5.0, "rooms": 5.0}, "id": 12550139, "likes": {"liked": "— Cleanliness of rooms, close to downtown attractions, heated pool", "disliked": "— nothing anyone could complain about"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "Let me start by saying that we will be coming back to the Anastasia Inn whenever we go to St Augustine -- it is the best in its class. It may well be the best budget place, in which, I have ever stayed.", "title": "Convenient, Clean, Comfortable, Cheap and Close to the sites and the beaches.", "helpfulness": 1, "user": "BluesTraveler1961", "date": "March 29, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 14646208, "likes": {"liked": "— Clean, Comfortable and friendly.", "disliked": "— Nothing"}}, {"rating": 4.0, "title": "very convenient, very affordable", "text": "This is the place to go if you are looking for a clean and comfortable room and you are a bit short on bread. This place is new inside and out and the hard-working, friendly staff really try to keep it that way. Seriously, they put in the effort every day that we were there (3/12 to 3/19.) The maids even removed the covers off of all of the AC units and cleaned them.", "user": "site_fan", "date": "March 26, 2008", "id": 14547358}, {"rating": 5.0, "stay_parameters": "Stayed March 2008", "text": "We had new towels and clean sheet everyday.", "title": "very nice!", "user": "niaMonson_ma", "date": "March 15, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 14296519, "likes": {"liked": "— friendly, helpful people, cost."}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "With a nice little fridge, a microwave, a cabinet, a coffee maker and free continental breakfast, you can also dine cheap.", "title": "Great choice", "user": "StillwaterTraveler", "date": "March 14, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 14285082, "likes": {"liked": "— clean, quiet, safe, convenient, value", "disliked": "— all ok"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "The walk from the Anastasia Inn, over the bridge of Lions, and into the old downtown is surprisingly short,", "title": "Clean & quiet, great stay at the Anastasia", "helpfulness": 3, "user": "JMSoule", "date": "February 14, 2008", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 3.0}, "id": 13558850, "likes": {"liked": "— location, cleanliness", "disliked": "— does not offer 24-hour check in"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled with family", "text": "My parents and I stayed at the Anastasia Inn for one night on December 22-23. We had a very pleasant stay. We picked the hotel mainly from the other reviews and because it had great rates in comparison to other hotels, especially in the historic district. In hindsight, the close proximity to downtown (2 minute drive) made it ideal, and the price was right.", "title": "Good stay, great price", "helpfulness": 2, "user": "beaufort-tiger", "date": "December 27, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 3.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 11991314, "likes": {"liked": "— Location and price", "disliked": "— Bathroom needs updates"}}, {"rating": 5.0, "title": "good stay for the budget minded", "text": "I think we definitely got what we paid for. The rooms were a little dated, but overall very clean. The bathroom could have used a little more attention and perhaps an update, but wasn't disgusting. Not that we used it much during our stay, but the TV channels were limited. They served a small breakfast in the morning.", "helpfulness": 3, "user": "hoosierdaddyOklahoma", "date": "December 22, 2007", "id": 11901681}, {"rating": 4.0, "title": "good location", "text": "Word of warning to those considering booking this hotel or any other property across the river from downtown: the Bridge of Lions is closed for repairs, and a temporary bridge has been put in its place. It is not very pedestrian friendly, and you're better off taking your car and parking it somewhere downtown than attempting to walk.", "helpfulness": 1, "user": "Flannie", "date": "November 22, 2007", "id": 10993375}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "All in all, it was a hotel that suited our needs: convenience and a lower cost for only a night's stay for three people. We would likely stay there again the next time we visit.", "title": "Very clean, a great stay", "user": "cuteangel2320", "date": "November 1, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 10494284, "likes": {"liked": "— It was very clean", "disliked": "— Parking"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2007", "text": "Stayed at Anastasia Dec 14 and 16, '07. Went to St Aug to meet a lady friend for the first time and was looking for reasonably priced accommodations that were clean and comfortable. That's exactly what I found. I paid $76 Friday night and $54 Sunday night, taxes and AARP discount included. I called ahead from the airport to confirm my room reservation and to request an iron and ironing board be ready since I was on a tight schedule. Check-in went quickly and the iron was waiting for me when I walked in the room. The rooms are older but in great shape. Wireless internet worked flawlessly. I needed a taxi for Friday night to take me to Harry's . The front desk called them for me and he showed up right on time. I'm returning in Jan '08 and will definitely stay at Anastasia again.", "title": "Great little place", "helpfulness": 1, "user": "huckleberry3", "date": "July 7, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 8071946}], "location": {"country": "United States", "city": "Saint Augustine"}, "variance": {"poor": 13, "average": 23, "very good": 60, "terrible": 6, "excellent": 35}, "aka": "Anastasia Hotel", "slim_ranking": 0.55, "description": "The inn is ideally located between Historic St. Augustine and St. Augustine Beach. We are one mile from the Historic Downtown area. Going in the opposite direction for 2 miles takes you past the St. Augustine Lighthouse, The Alligator Farm, Anastasia State Park and St. Augustine Amphitheatre before arriving at St. Augustine Beach. The Anastasia Inn is a prominent 2 Diamond AAA establishment. We offer both Queen rooms and King rooms. All rooms include - In room coffee service, Microwave and Refrigerator, and our Free continental Breakfast."}