{"user_rating": 4.5, "review_count": 528, "name": "Anchor In Hotel", "reviews": [{"rating": 4.0, "title": "Enjoyed our stay", "text": "Motel is in a pretty location although you wonder if you have the right place when you drive into the car park overlooking the hospital being built further down the coast. It did look the best place to stay in Hyannis. Very efficiently run and extremely clean. it is a bit of a hike into Main Street but it has very pretty outlook onto marina. Rooms were quite basic and very dark, situated around a small heated pool. Breakfast is good quality although limited to juice coffee bagels and muffins served from a small reception table between only 7-9am. Motel stocks menus for local resturants and we walked to Spankys Clam Shack but found food disappointing. 2 night stay overshadowed by very heavy rain which prevented us from going up into National park.", "helpfulness": 4, "user": "TAmembers", "date": "September 13, 2006", "id": 5795439}, {"rating": 4.0, "title": "Very Nice", "text": "This was a very nice hotel located a short distance from town. The staff was friendly and helpful and the rooms were clean.", "helpfulness": 1, "user": "BlackcourseBP", "date": "September 8, 2006", "id": 5780110}, {"rating": 4.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "We arrived on a very warm and sunny day in August and the view from the room was spectacular and fully matched the pictures on the internet and brochure.", "title": "Very comfortable with a great view, but refreshments limited", "helpfulness": 4, "user": "DriftwoodNL", "date": "September 2, 2006", "detail_rating": {"front_desk": 5.0, "business": 1.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 5761640, "likes": {"liked": "— Views", "disliked": "— Very limited refreshment facilities"}}, {"rating": 3.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "Stayed for 2 nights during last week in October. Wonderful view of harbor from sunroom with comfortable chairs for eating continental breakfast. The innkeepers were nice and very helpful. Comfortable rooms in small property, which we liked a lot. Overall experience at hotel was above average, but they did not honor the AAA discount that is advertised by AAA, saying that they give everyone the same low rates. We will contact AAA about that.......", "title": "Nice stay but did not honor AAA discount advertised", "helpfulness": 6, "user": "newengtraveler", "date": "November 6, 2006", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 3.0}, "id": 6063037, "likes": {"liked": "— friendly innkeepers", "disliked": "— didn't honor discount advertised"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled with family", "text": "We had a family get together and rented 5 rooms at the hotel for the weekend. The staff was polite and very helpful. The rooms were as lovely as the web pictures depict. They were extremely clean and comfortable. The beds were very comfortable. The views were wonderful. The breakfast was very good. My family had a wonderful time and I highly recommend this hotel to everyone. The location and views are perfect. It lived up to all my expectations.", "title": "Wonderful Hotel", "helpfulness": 6, "user": "TA3", "date": "October 29, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6027149, "likes": {"liked": "— Clean, Comfortable, Great Views, Great Staff", "disliked": "— No complaints"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "This was the only lodging I could find in tripadvisor.com on Cape Cod that no one had any complaint about. I had a hard time believing that but.....it lived up to its reputation. We spent a week in the new wing and it was excellent. The service was great, there wasn't anything that the innkeepers were not prepared to help with, the location is great and the view even better. We throughly enjoyed our stay and will return next year.", "title": "Out standing!", "helpfulness": 3, "user": "WHB#", "date": "October 19, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 5973200, "likes": {"liked": "— They were quite, clean and very comfortable. The view was outstanding.", "disliked": "— lack of onsite breakfast facility. The continental breakfast was good but got dull early."}}, {"rating": 4.0, "stay_parameters": "Stayed September 2006, traveled with family", "text": "Location to harbor excellent. Great for walking to ferries and to downtown Hyannis. Rooms very clean & neat. Hotel offers a continental breakfast which was very fresh & abundant. I only wished they offered a sunroom or some other room to sit and enjoy the meal and the view.", "title": "Enjoyed the Anchor-Inn", "helpfulness": 6, "user": "susielq", "date": "October 2, 2006", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 5.0}, "id": 5900302, "likes": {"liked": "— The cleanliness of Hotel", "disliked": "— No area to sit at tables to eat breakfast or sit and talk. They had a hallway for this purpose and I didn't feel this was acceptable"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "This hotel is in a great location, next to Hyannis harbour and walking distance to the ferry terminals to Martha's Vineyard and Nantucket. It is also close (walkable) to Main Street for the shops and restuarants. Rooms are spacious, with small balconies overlooking the small pool and harbour. Buffet breakfast is simple (muffins, bagels and fruit) but fresh. Cheaper than some of the larger chain hotels in Hyannis, this location is much better.", "title": "Great Location", "helpfulness": 5, "user": "gb293", "date": "September 17, 2006", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 5808887}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "My boyfriend and I were there this past weekend. We had an excellent stay, beautiful room and views. The hosts were friendly and accomodating , the patio chairs out and ready for us to relax and enjoy the view. If you like laid back, non chain hotel accomodations, this place is for you. The king size bed was comfortable, the room decorated in a tradition cape cod way, soft colors, great bathroom and tub. I would definitely stay here again and will do just that next year!", "title": "Wonderful little get-away place!", "helpfulness": 4, "user": "lolasmom", "date": "May 3, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7543488, "likes": {"liked": "— the view of the harbor", "disliked": "— nothing!"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "HI My boyfriend and I staying in the Anchor In for 3 nights whilst visiting Cape Cod. It was fantastic.....set right on the water with fab views. The staff could not have been more helpful especially Chris! Renovated rooms were spacious and bright and for value could not be beaten.", "title": "Absolutely fabulously romantic", "helpfulness": 3, "user": "Holmania", "date": "April 17, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7379074, "likes": {"liked": "— Fab rooms, friendly staff", "disliked": "— The pool was not open."}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "My husband and stayed at the Anchor In [--] for two nights to celebrate our 15-year anniversary. Upon our arrival, there was a complimentary bottle of champagne left for us in our room (the Osterville, which was 75-feet from the water). The room was beautifully decorated, very clean, with great views of the harbor. You can see the ferries coming in and going out. We were recommended to some great restaurants. At the Roadhouse Cafe[--]we enjoyed delicious lobsters and drinks, while enjoying jazz music in the jazz room. Would highly recommend a visit to this restaurant when in the area, as well as, staying at the Anchor In.", "title": "Great Harbor View", "helpfulness": 5, "user": "mt1089gren", "date": "April 11, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7332412, "likes": {"liked": "— The view from the Osterville Room.", "disliked": "— The scent of the cleaning products. Had to air out the room for a few minutes (or turn on the fan), as it bothered my allergies."}}, {"rating": 4.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "My husband and I stayed at the Anchor In for just one night (March 3). We had been to Cape Cod twice before, and since our favorite spot was closed for the season, I chose the Anchor In because of the price, and the reviews on this site.", "title": "Perfect for an off-season getaway!", "helpfulness": 3, "user": "HernameisRio", "date": "March 6, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 6921290, "likes": {"liked": "— Comfortable beds, proximity to downtown, front desk service"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2006", "text": "We were not disappointed. The property doesn't look great from the outside, but the inside has been completely renovated. We stayed in the East Wing, in a deluxe room ($97/night USD). It was beautiful, with a great harbour view. The beds were more comfortable than the $300/night room we had the night before in downtown Boston! Definitely good value.", "title": "Great holiday get-away!", "helpfulness": 4, "user": "Dineyander", "date": "January 5, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 2.0, "cleanliness": 5.0, "value": 5.0, "location": 2.0, "rooms": 4.0}, "id": 6555371, "likes": {"liked": "— The off season price was awesome.", "disliked": "— Walking distance from hotel to the Hy-Line ferry."}}], "location": {"country": "United States"}, "variance": {"poor": 7, "average": 27, "very good": 155, "terrible": 4, "excellent": 335}, "aka": "Anchor In Hyannis", "slim_ranking": 0.0909090909091, "detail_rating": {"service": 4.5, "cleanliness": 5.0, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "We are Distinctively located in Hyannis, the \"Homeport of Cape Cod\". Walk to Bayview Beach, ferries to Nantucket and Martha's Vineyard, waterfront restaurants, Harbor cruises to Hyannisport and the Kennedy compound, Main Streets diverse variety of shops, restaurants, gift stores, festivals, Cape Cod Train, and the Kennedy Museum. Within a short drive you will find Whale Watching, golf, historic Rte 6a, summer theatre, bike trails, world-class Cape Cod beaches including the Cape Cod National Seashore."}