{"user_rating": 4.0, "review_count": 321, "name": "Anchorage Port Stephens", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "We had an excellent weekend at Peppers, on our way from Sydney towards Brisbane. Saturday night was very busy but Sunday much less so. A very nice room with balcony overlooking the marina; large comfortable bed; good bathroom; quiet ambience throughout. Staff were good. Restaurant food was excellent. Several very nice beaches nearby, and bars, cafes, etc. at Nelson's Bay. Make sure you get driving directions, because Peppers isn't signposted until you're nearly there. The hotel is a nice series of linked 2-storey chalets, with lawns and boardwalk.", "title": "Excellent quiet weekend", "helpfulness": 1, "user": "salmoneater", "date": "November 25, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 88196951}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "Went here with a group of 3 couples, 1 couple was new to Australia and this was a great introduction to the wonders of Port Stephens and this little slice of heaven at Corlette - roomd were very spacious, clean and comfortable and the double doors opening out to your deck and further to the lawn overlooking the water was just divine. We ate at the restaurant for dinner and 2 breakfasts, the staff were fantastic and very knowledgeable regarding the food and wine and were more than generous with breakfast servings and free little tid bits.They even gave us a discount on our breakfast orders as we are a group! The bar upstairs is quaint , comfy and quiet, ideal for a G & T before dinner. This is a superb place for Weddings and we watched one next door at their convention room. The place is understated elegance and easy coastal living. We are going back for January holidays next year with more visitors from overseas.", "title": "Great Location, Food and Service", "helpfulness": 1, "user": "JPH66", "date": "November 25, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 88153256}, {"rating": 5.0, "stay_parameters": "Stayed November 2010", "text": "Just came home today from a weekend stay at Peppers Anchorage. I was here on my 2 year wedding anniversary! All I can was the place was great. I stayed in room 105, which was on the ground floor, and directly faced the white sandy beach outside of the hotel!", "title": "Excellent Stay", "helpfulness": 2, "user": "CharlieAwit", "date": "November 14, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 86999861}, {"rating": 2.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "The hotel is probably the best in the port Stephens area! I would definatley recommend the hotel to anyone traveling to port Stephens!", "title": "Not bad but the small things take away from it", "helpfulness": 2, "user": "rjweb", "date": "October 31, 2010", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 85513035}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "I would also recommend Catch restaurant for a wonderful dinner. It's pricey, but it's a class above all else.", "title": "Rained all weekend - but it was still lovely!", "helpfulness": 2, "user": "DrMSydney", "date": "October 31, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 85418686}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "We were in Sydney for medical tests and had a few days up our sleeve before having to travel home. After quick research decided upon Peppers Anchorage. What an outstanding decision that turned out to be. The resort itself is idyllic nestled in a bay overlooking the marina but it was staff who made the Anchorage stand out. No request was a problem. Their friendliness, interest and helpfulness was exceptional. The rooms were well equipped and very comfortable. We were in a king anchorage room. Even though the hotel was quite full you really were unaware of others around you. We had full breakfast on two mornings and the food was fresh, tasty, plentiful and well presented. We had a car and explored the beaches and restaurants nearby. We particularly enjoyed the Oyster Farm. I would highly recommend this place to all---whether it be a weekend getaway, a time with a young family, or as in our case a much needed escape and retreat.", "title": "Relax in Paradise", "user": "StephNewZealand", "date": "May 21, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 64894065}, {"rating": 5.0, "stay_parameters": "Stayed May 2010", "text": "After leaving our children with grandparents, my husband and I wanted to get away for the weekend before our next baby arrives in a few weeks. We chose Peppers based on positive reviews and nicely discounted Internet rates. When getting a discount, I often expect to be put in the worst room, but we were thrilled with our lovely room with balcony overlooking the marina and beach. The room was wonderful and comfortable, the pool was warm enough to swim in May weather, the spa was lovely and the food delicious. We enjoyed dinner at Merets on Friday night and went to town for dinner at Zest on sat night. Both were outstanding!", "title": "Brilliant babymoon", "user": "cooksincrowie", "date": "May 15, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 64241609}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled with family", "text": "Peppers was the perfect weekend getaway for us and provided all the rest and relaxation we needed.", "title": "A wonderful guesthouse stay with warmth and charm from both staff and the premises itself", "user": "brettSydney", "date": "April 21, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 62121914}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "We have recently stayed at Peppers Anchorage, and can sincerely say after it being almost 10 years since we have had a chance to re-visit, it still hosts all the charm and serenity of a beautiful seaside guesthouse, along with the genuine staff and service who in every detail made our stay truely memorable .", "title": "Superb location and service!", "user": "hillske", "date": "April 5, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 60477773}, {"rating": 4.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "From the moment we arrived the staff were friendly and very informative, to dinning in the restaurant where we experienced exquisite tastes in a relaxing enviroment to even the housekeeping staff who were very warm and friendly. The hotel itself still graces all the beautiful features of this wonderful seaside town and has remained a beautiful and tranquil place for rest and rejuvination, whilst still offering enough things to do for our children.", "title": "excellent views, great location", "user": "MargyD", "date": "March 21, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 59180161}, {"rating": 4.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "We recently spent two nights here and its a great place for peace whilst looking over the bay and maybe seeing a dolphin or two from your balcony.", "title": "Lovely and peaceful", "helpfulness": 1, "user": "hamiriver", "date": "July 11, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 70452596}, {"rating": 3.0, "stay_parameters": "Stayed June 2010", "text": "The rooms are huge and nicely furnished. Toiletries are nice, minibar well stocked. We had some complimentary champagne which was a lovely touch for our anniversary.", "title": "Good location rooms and srvice, over priced menus and breaky", "user": "BuddiNanna", "date": "July 7, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 70087567}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "Our request for a room with water view was granted, however when we arrived at 9pm , we were given a room with two single beds! We were quickly moved to a king size room and all was forgiven! There was also a lovely plate of petit fours for our arrival.", "title": "Perfect stay", "user": "TamandMike", "date": "July 7, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 69999401}, {"rating": 4.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "We took the breakfast package which was good as you didnt have to drive all the way into town to get fed. The breakfast was pretty standard hotel fare- but good quality and range. The only thing was the coffee machine kept running out of milk and water was cold at one point. However the staff were very helpful and cheery and would happily make fresh cups.", "title": "A memorable wedding anniversary", "user": "kmagro", "date": "June 11, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 67173110}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled with family", "text": "The view is lovely from the little balconies and nice and quiet. You can hire bikes etc and nice walks along the breakwater. In summer the little beach next door would be great for small kids to paddle in, as is the playground next door.", "title": "What a Fantastic Family Time", "user": "aerrrr", "date": "June 1, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 66012621}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "Spent 4 days. Fantastic service. Good food in the restaurant. Staff arranged for a complimentary bottle of champagne and organised delivery of flowers to room. Can't praise the hotel or staff enough. Special mention to Craig on reception, Peter in the restaurant and Daniel the barman.", "title": "Wedding Anniversary", "helpfulness": 1, "user": "englander1966", "date": "October 6, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 82263359}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "Wouldn't hesitate to return or recomend hotel to anyone", "title": "Magical Setting for Romantic Break", "helpfulness": 2, "user": "Oz-Amanda", "date": "September 27, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 81281678}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "My husband and I have just returned from a long weekend/mini break at the Anchorage. I have had friends and family stay here before, all of who praised the resort, which has been around for about 20 years. I had checked out all the reviews on TripAdvisor before booking, as I was concerned if the property had aged etc. We booked as part of a package which included buffet breakfast and a $40 drinks credit. We just booked a standard anchorage room on the first floor as this was recommended over the ground floor rooms for privacy. The room was spacious and stylishly furnished, if a tiny bit on the spartan side. Their was an i-Pod dock and a large flat screen tv. I totally agree with some previous comments that the bathrooms are showing their age and are in need of refurbishment, with black mildew grout around the bath which is quite unattractive. Ours was very tiny with the toilet in a very cramped position behind the door. Also a room safe would have come in handy. On the plus side the view from our balcony was just magical - looking out over the marina and the wider bay area. The grounds are well kept as well. Unfortunately the particular room we were in (411) had some sort of airconditioning plant/motor above our room and it decided to kick in around bedtime and lasted all night. I rang reception around 10.30pm and asked what it was and if it could be turned off, but she said she wasn't sure and the maintenance man had left for the day (which was fair enough). She said she would have moved us immediately but the hotel was booked out for a wedding party. (We were aware of this, but in no way did the function disrupt our stay). The receptionist promised to get back to us in the morning, and true to their word we received a message at 8.30am the next morning saying that they were going to move us to a larger room in the same block when it was vacated around midday. The room was actually available and ready for us at 11.30am and a member of staff came along to help us move our bags. All of this was much appreciated but I suppose you would expect this sort of service at a 4 star resort. The next room was definitely larger, but unfortunately had the same old dated bathroom with the black mould around the bath. It was the only let down of both rooms.", "title": "Best Birthday Ever", "helpfulness": 2, "user": "KimboWilko", "date": "September 9, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 78965291}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "The breakfasts were fantastic, with plenty of choice including a range of fresh juices and smoothies, about 8 types of bread, fresh made waffles and pancakes, and omelettes etc made to order. We didn't try the restaurant for dinner as we had made a reservation for the first night and on the second night we decided to have a lighter snack in the bar from their all day menu. All in all we had a very pleasant stay and appreciated the friendly and accommodating service of the staff.", "title": "Location, Location, Location", "helpfulness": 2, "user": "Brisbanegirl22", "date": "July 30, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 72977954}, {"rating": 4.0, "stay_parameters": "Stayed July 2010", "text": "When I was in my early 20s I saw this place open and thought it was so opulent and glamorous and promised myself one day I would stay there. As I approached my 40th birthday, I decided that day had come, and that to ease the pain of aging, I would treat myself to a stay at the Anchorage. I was concerned that after so many years, it might not be all I had hoped, but I needn't have been. The place was very glamorous but still very comfortable. The view from the room was spectacular and relaxing, and there was plenty of room in the loft apartment both downstairs and up. The spa bath was the best I have ever experienced, and there was plenty of privacy to feel like you weren't actually in a hotel. I felt a bit 'lifestyles of the rich and famous' even though it didn't have that kind of price tag. And I was treated a bit special when we returned to our room on the first night to find a complimentary bottle of champagne waiting for us from the hotel. We also indulged in a massage each, which was well worth it. The whole stay was just moments of bliss from beginning to end and I would highly recommend this hotel to anyone.", "title": "Stayed three nights in a loft room which...", "helpfulness": 2, "user": "skyman64", "date": "July 17, 2010", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 71214495}], "location": {"country": "Australia", "continent": "South Pacific"}, "stars": 4, "variance": {"poor": 18, "average": 55, "very good": 133, "terrible": 9, "excellent": 106}, "aka": "Peppers Anchorage Port Stephens Hotel Corlette", "slim_ranking": 0.5, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.5}, "description": "Luxury Accommodation by the SeaAll 80 rooms and suites have an individual balcony or porch, most with unobstructed views over Port Stephens. Intimate guest lounges are found on both levels of two accommodation guesthouses. At Anchorage Port Stephens we are large enough to provide you with superb guest facilities but small enough to ensure your stay is intimate and relaxed. Only two and a half hours drive from Sydney,Anchorage Port Stephens is the perfect seaside weekend escape."}