{"user_rating": 4.5, "review_count": 2081, "name": "Anderson Ocean Club & Spa, Oceana Resorts", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed November 2013, traveled with family", "text": "The Anderson is a beautiful place and right on the beach. However despite having requested handicap accessible room we didn't get one.I complained and was told \"Oh you are here on the Hilton package\" so neither Hilton nor Anderson Club would change our room. My poor family member had to sponge bath the whole time and wash his hair in the kitchen sink.They also have no Handicap Accessibility to the beach. I was told Oh we can help him down the beach. Right he's 6ft 2 inches tall and weights 250lbs. and 2 little non medically trained people are going to heave-Hoo I don't think so! We was on the 20th floor. Between the Hilton people doing tours and stopping right outside our bedroom window (which is on the hall side) and loudly pointing out the view and the maids letting doors slam rooms next door it was hard to rest well during the day. The balcony has no screen if you leave the door open BUGS come flying in. They have no restaurant in the building but you can cross the street to a place that must have stock in CRISCO because they deep fat fry everything and the veggies are so over cooked they are a water/mushy mess. Sorry but this place really missed it and I don't think it will be on my top list of places to stay. I think the Best Western next door would have been a better choice for us.", "title": "NOT Handicap Accessible and the floor was loud!", "user": "Janie W", "date": "November 6, 2013", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 1.0, "sleep": 2.0, "rooms": 2.0, "location": 4.0}, "id": 183746531}, {"rating": 5.0, "stay_parameters": "Stayed October 2013", "text": "My first time in Myrtle Beach so was very nervous and picking the right hotel was top priority for me and my wife. We almost didn't leave the room it was so comfortable and friendly! I loved it and will be back to stay there again! The service was great and everyone made us feel right at home.", "title": "A great place to stay!", "user": "Jab41847", "date": "November 4, 2013", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 183484254}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled with friends", "text": "After my last visit to Myrtle Beach in the summer several years ago, I swore NEVER AGAIN! Too crowded, too touristy, too much traffic! But I'm so glad I gave the off-season a chance and the Anderson Ocean Club was just the place to do it. Our 3-BR condo made the perfect place to relax with friends. The kitchen was fairly well-appointed and had nice new appliances, and the dining/sitting area gave us plenty of room to spread out. We were on the 9th floor and had a balcony that stretched from the sitting area to the master BR. It was amazing to lie in bed at night and listen to the ocean! The view was amazing and there was plenty of sitting area on the balcony for all 6 of us. The bedrooms each had an en suite bath. Unfortunately, we didn't have the opportunity to use the spa because it looked great. The only complaint I have about the entire weekend is that the free parking is in a deck across the street and down the block, not exactly convenient, so most people appeared to use the $12/day valet parking. The valet area was very small and the cars kept backing up as people came and went. I can't imagine how they deal with this in the summer. The beach is beautiful here and made it easy to take long walks. I can't wait to go back to the Club --- but I think I'll stick with off-season every time!", "title": "An off-season treat!", "user": "kgoley", "date": "November 3, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 183430327}, {"rating": 5.0, "stay_parameters": "Stayed October 2013", "text": "Since this was our first time visiting Myrtle Beach, we didn't know what to expect. We were pleasantly surprised to have ideal weather in October. The beachfront property, with an ocean view balcony was like paradise! The room was exceptionally clean. The separate bedroom and full kitchen and living room felt like home, as opposed to a hotel setting. The staff was also great! We will definitely return!", "title": "Luxury at a reasonable rate!", "user": "tonni27", "date": "November 3, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 183383942}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "Beautiful view of the ocean from our room that was quiet and comfortable. As if we had an apartment on the coast! Stay of 4 days and 3 nights, had a presentation on Hilton Grand Vacations with no high pressure sales tactics.", "title": "Anderson Ocean Club", "helpfulness": 2, "user": "Rebecca C", "date": "November 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 183468015}, {"rating": 3.0, "stay_parameters": "Stayed November 2013, traveled as a couple", "text": "Number of Ants grew through our stay. By the time we left they were all over. No housekeeping service. Would have been nice to at least have the garbage picked up and some extra coffee packets. Location was excellent and we did have a view of the ocean. It was very quiet.", "title": "hmmmm", "user": "Eugene John A", "date": "November 9, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 184210809}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled with family", "text": "Hilton doesn't disapoint with this one! We had a very nice time. I guess the only thing I can say is we were told they had an indoor pool. It is actually outside under a roof and heated. Which made it even better!", "title": "Wonderful place to stay!", "user": "Terry L. C", "date": "November 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 184125036}, {"rating": 3.0, "stay_parameters": "Stayed November 2013, traveled as a couple", "text": "Wonderful view and nice condos. HGVC property is 50% of the facility. The HGVC Timeshare condo was updated, clean, and comfortable. Staff was unprofessional and not competent with accuracy of bill, bell service, parking fees, and arranging tee times. Starbucks in the lobby is convenient.", "title": "Facility is very good / experience with staff was poor", "user": "Carol Ann L", "date": "November 8, 2013", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 184124802}, {"rating": 3.0, "stay_parameters": "Stayed October 2013, traveled with friends", "text": "Well, you can't make a silk purse out of a sou's ear. Myrtle Beach is just not very nice. I will go so far as to say it is just plain tacky. I lived in South Carolina for many years and always avoided this city but had heard recent reports of it being cleaned up--not the case.", "title": "Nice for Myrtle Beach", "user": "Travelqueen37215", "date": "November 6, 2013", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 1.0, "sleep": 3.0, "rooms": 3.0, "location": 2.0}, "id": 183783993}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled with friends", "text": "The Anderson Ocean Club is probably one of the cleaner, better resorts there but it is still sub par to most beach resorts. The rooms were very clean and updated, the views were great, the pool area just plain awful. The parking was awkward and worse yet--we are HGVC Club owners--we arrived at 4:05 pm and our room was not ready until after 5:00 pm. If you are going to Myrtle Beach stay here--it is probably as good as it gets for this sorry town. Better yet--stay away from Myrtle Beach and go somewhere that has a little ambience and class", "title": "Lovely place to relax at the beach", "helpfulness": 1, "user": "Roger N. H", "date": "November 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 183864784}, {"rating": 4.0, "stay_parameters": "Stayed November 2013", "text": "This was the first time visiting Myrtle Beach for my husband and me, and we brought two friends with us. After driving 5 hours to get to MB, we were eager to get to the Anderson to relax. We arrived on Friday around 5pm. We were asked to park in the loading area as I went to check in. Checking in was easy and they gave us the free valet parking placard for HGVC owners. It was nice to have the bellhop cart to bring up our luggage. While I did not request for an oceanfront room at check in (was too tired to remember to), it would have been nice to have been offered that option, complimentary or not...the resort was very empty as it was off-season. We were assigned to unit 1200, a 2-bed/2-bath facing north, so we still could see a slice of ocean off our teeny balcony. (At least we did not get a unit with a hallway window!)The room was comfortable and offered plenty of space. Having a separate bathroom for each couple was great as well.", "title": "Nice weekend", "user": "everfair", "date": "November 19, 2013", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 185213033}, {"rating": 4.0, "stay_parameters": "Stayed November 2013, traveled with family", "text": "In terms of the other amenities and services, we were pleased. The valet always had our car waiting for us when we called. All the pools were available to use, although I think they should put either a second or larger hot tub on the outside patio...we would have loved to use the outside hot tub to enjoy the weather, but it was always crowded and we were relegated to the one inside. The on site coffee bar was nice and we enjoyed a relaxing morning coffee sitting outside next to the pool,watching the waves. Beach access was nice as well. The Anderson is a ways away from the boardwalk and other activities, but walkable. Wished we could have tried out the minigolf across the street, but it was closed for the off-season.", "title": "Nice location and great view", "user": "James Vincent C", "date": "November 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 185035963}, {"rating": 4.0, "stay_parameters": "Stayed November 2013, traveled as a couple", "text": "We did have a nice time thanks to the Anderson, but I do have to agree with other reviewers...this does not feel like a typical HGVC, and I wished it did. Did not realize that I missed things like the big soaking tub and the little market until we did not have them on site.", "title": "Nice hotel, but not as good as I expected", "helpfulness": 2, "user": "STACEY M", "date": "November 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 2.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 184697420}, {"rating": 3.0, "stay_parameters": "Stayed November 2013, traveled as a couple", "text": "Do check out the local events flyer posted in the elevator...we ended up going to two local seasonal activities we found out about there (Dickens Christmas festival and drive-thru light display synchronized to music) and enjoyed them.", "title": "Not the best...", "user": "Littchr", "date": "November 14, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 184696424}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled with family", "text": "Not a Hilton Grand Vacation Club facility, but nice. Kitchen well appointed. Valet parking a plus since parking is near but NOT onsite. Location is good with easy drive to lots of restaurants, shopping malls and attractions. beach is easy access and well maintained.", "title": "Great Vacation Location", "user": "Paul H. W", "date": "November 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 184654077}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "We had a very good time Room was great everyone was warm and friendly and helpful Pool was clean and room was clean Had no problems Would stay here again anytime All the staff was top notch The bed was very comfortable and all the rooms were clean we did not need anything during our stay", "title": "Our stay", "user": "MICHAEL C", "date": "November 1, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 183334120}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled with friends", "text": "Let me start by saying I'm shocked this resort isn't rated higher. From the time I pulled in to the smiles of the friendly valet staff, to the sweetheart behind the desk, my welcome was what one would completely consider 'Southern Hospitality'. The valet whisked us to our room (two of us in two separate cars with an amazing amount of 'stuff') in a matter of minutes. We were able to check in early, which thrilled us both, as on a chilly day we wanted to hit the hot tub. When we walked into our room my friend was thrilled (making me the hero for booking) as was I. We had a VERY large 1 bdrm. suite. The view was stunning, ALL ocean. Not only were the balcony furnishings MUCH nicer than other hotels in this area, but the walls were so deep that we had privacy. The king bed was very comfy, and surprisingly so was the murphy bed. I've slept on a murphy bed in the past with a sore back as a result. Kudos to you Anderson for getting it right. The kitchen had everything we would need and more. One added bonus, a whirlpool tub.. Ok, that was the room.. The hot tub was great! One covered and one open to the stars. We were able to order cocktails from the bar (literally steps from the Jacuzzi) and relax in complete bliss! I must say that this resort quickly became a favorite of mine. The staff was wonderful!!! The maid even dropped what she was doing to help me down with my bags the day I left. LOVE THIS PLACE!", "title": "Fantastic", "user": "Gabrielle71", "date": "October 30, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 183000066}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "My one bedroom studio was very comfortable. View was exceptional for a partial ocean view. I typically only settle for oceanfront rooms. Small kitchen was well equipped. Queen bed a little small as I 'always' get king beds. Location is quite appealing--just the right distance to get some exercise walking to restaurants and the boardwalk.", "title": "Pleasantly Surprised", "user": "Robert H. M", "date": "October 30, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 183014480}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "This is our first visit to the Anderson Ocean Club, and we had a great time. We are Hilton Timeshare owners, and I understand that the rooms that are not designated as such have not all been upgraded, so please keep that in mind if you are renting on the open market.", "title": "Watch out for the Handicapped Room", "user": "Francine S", "date": "October 30, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 182931781}, {"rating": 4.0, "stay_parameters": "Stayed October 2013, traveled with family", "text": "Rooms :", "title": "Fall 2013", "user": "Arthur Dale S", "date": "October 30, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 183014276}], "location": {"country": "United States"}, "stars": 3.5, "variance": {"poor": 84, "average": 156, "very good": 669, "terrible": 41, "excellent": 1131}, "aka": "Anderson Ocean Club And Spa, Oceana Resorts", "slim_ranking": 0.117117117117, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "We feature luxurious-, two- and three bedroom condominiums with room service and other amenities including a day spa with hair and nail salon, flat screen TVs, fitness center, indoor & outdoor pools, lazy river, Jacuzzi, oceanfront bar, wireless internet and valet parking. Our full service spa offers massages, facials, men’s spa services and more. Close to many nationally recognized golf courses, restaurants and area attractions."}