{"user_rating": 4.0, "review_count": 14, "name": "Andromeda Hill", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "Centrally located in Jaffa, this is an apartment \"hotel\". The apartment we had was large, the bed comfortable, the kitchen was fine, lot of places within walking distance to buy stuff for breakfast, dedicated parking underneath. In short, all good. Yes, the band next door did practice, and the church broadcast mass via loudspeakers on Sunday but that is part of the charm. Less charming was the traffic to get to the location and the fact that the office was only open Sun-Thurs business hours, there was no café, although one is promised, and the stairs to the Jaffa port were locked.", "title": "Nice place to stay but not a hotel", "helpfulness": 1, "user": "Humphryg", "date": "May 5, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 159707584}, {"rating": 2.0, "stay_parameters": "Stayed April 2013, traveled with friends", "text": "There is a church next to Andromeda, and that church is the most noisy place I have ever experienced in my whole life. The community of the church has a band which is training almost everyday (including weekends) noisily. You never have a quite and peaceful time there. The band and the children playing in the garden of the church drive you crazy until 9 pm almost every night. No peace and silence there because of the noise coming from the garden of the church.", "title": "Not quiet and peaceful", "user": "Daniel M", "date": "May 1, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 1.0, "rooms": 3.0, "location": 4.0}, "id": 159335646}, {"rating": 4.0, "stay_parameters": "Stayed August 2012", "text": "We rented an apartment for 5 nights in August 2012. Our 1 bed apartment was big, clean and very well equipped - sofa and lounge area, cable TV, WIFI, Air con, excellent cooking equipment, jacuzzi bath - basically a very nice home from home.", "title": "Very clean, quiet, great location - definitely would recommend", "helpfulness": 1, "user": "monkeygaz", "date": "August 14, 2012", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 3.0, "rooms": 5.0}, "id": 137134891}, {"rating": 4.0, "stay_parameters": "Stayed August 2012", "text": "The complex is clean and safe with a lovely pool and gardens. Gym is well equipped with CV and free weights.", "title": "its not a hotel but its worth the miney", "helpfulness": 1, "user": "fatola4", "date": "August 10, 2012", "detail_rating": {"cleanliness": 4.0, "location": 4.0, "rooms": 3.0}, "id": 136812773}, {"rating": 3.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "The location is AMAZING - less than 5 minute stroll to Jaffa central/ port... Many nice restaurants, bars, ice cream shops.Jaffa market is also 5 minutes away which is good fun shopping.", "title": "Not a hotel !", "user": "Jean-PhilippeB", "date": "July 28, 2012", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 135614524}], "location": {"country": "Israel", "continent": "Middle East", "city": "Tel Aviv"}, "stars": 3, "variance": {"poor": 1, "average": 1, "very good": 8, "terrible": 1, "excellent": 3}, "slim_ranking": 0.79012345679}