{"user_rating": 3.5, "review_count": 309, "name": "Anfiteatro Flavio", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed September 2006, traveled with family", "text": "First time in Rome, pleasantly surprised. Great location, a few minutes from the colosseum. Bus outside the door right into centre. Staff very friendly and helpful. Small rooms but clean. Would recommend to others.", "title": "Nice hotel in a great location", "user": "MCorrigan", "date": "October 4, 2006", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 3.0, "location": 5.0, "rooms": 4.0}, "id": 5909073, "likes": {"liked": "— friendly staff", "disliked": "— small lift"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "Corrigans, Omagh, N.Ireland", "title": "Lovely Little Place", "helpfulness": 2, "user": "pixie_scar", "date": "September 7, 2006", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 5777095, "likes": {"liked": "— it's central location", "disliked": "— being on the ground floor next to reception."}}, {"rating": 4.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "I visited Rome last November with my boyfriend and as we were both pretty strapped for cash, we looked for the cheapest thing in the best place and crossed out fingers and hoped for the best!", "title": "nice place to stay", "helpfulness": 2, "user": "lifashi", "date": "August 29, 2006", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 5726024, "likes": {"liked": "— location", "disliked": "— not many fast food near by"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2006", "text": "Surprisingly, The Flavio is a lovely little hotel a stones throw away from the Colloseum and central to almost everything. The room was compact, but clean. The shower was very powerful which was nice at the end of a long day walking.", "title": "Can't wait to return to Rome!", "helpfulness": 7, "user": "whiskypie", "date": "July 11, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 5457178}, {"rating": 4.0, "stay_parameters": "Stayed May 2006", "text": "We were on the ground floor, which I could imagine would be a bit of a nightmare in high season as we could hear everything that was going on in the reception area.", "title": "Ciao Flavio!", "helpfulness": 5, "user": "OzDuff", "date": "July 8, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "service": 3.0}, "id": 5438785}, {"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled with family", "text": "I stayed at Anfiteatro Flavio in October 2006 for 2 nights. My brother and I travelled to Rome from London for a mini stay and to re-visit some Roman landmarks.", "title": "Great Location, Helpful Staff.", "user": "AJCairns", "date": "February 27, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 6852421, "likes": {"liked": "— Location, Friendly Staff", "disliked": "— being allocated a room next to the dining room."}}, {"rating": 1.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "We found this hotel to be more than adequate.", "title": "BEWARE..Dishonest manager", "helpfulness": 1, "user": "melbournetraveller24", "date": "February 18, 2007", "detail_rating": {"value": 1.0, "service": 1.0}, "id": 6809840, "likes": {"liked": "— Location and price", "disliked": "— Their attempt to double the price, and then that they would not refund the deposit."}}, {"rating": 3.0, "stay_parameters": "Stayed February 2007, traveled with family", "text": "We had a room right next to the breakfast room and even that wasn't too bad as far as early morning noise goes. The bathroom, whilst small was clean and very functional.", "title": "Very Practical", "user": "Goretti87", "date": "February 16, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "rooms": 2.0, "location": 5.0}, "id": 6803022, "likes": {"liked": "— Location", "disliked": "— Bathroom Smell and Size"}}, {"rating": 5.0, "title": "Good place.", "text": "The staff were helpful, and even gave us the name of a local trattoria that gave discounts to the guests of Anfiteatro Flavio.", "user": "UkSb", "date": "February 16, 2007", "id": 6802654}, {"rating": 4.0, "title": "perfect location", "text": "We arrived at about 11.30pm after a delay in London and there were staff waiting to greet us. They will also arrange a car to pick up and drop off guests at the airports.", "helpfulness": 1, "user": "ktwilsano", "date": "January 23, 2007", "id": 6647668}, {"rating": 4.0, "stay_parameters": "Stayed January 2007, traveled with family", "text": "This is a great little bed and breakfast in a fantastic location. The triple room we had was Remo (all the rooms are named after Roman Emporers) and it was small but clean. The 'double bed' was 2 twins put together and quite hard but ok and the central heating wasn't too good at night. The only other not so good thing about the room was that the tv only had local channels in Italian. I like to watch tv to relax before I go to sleep and wasn't able to, but hey, what do you expect for a budget room? The staff were all fantastic! From Ivor/Ivan?, the night receptionist who checked us in and gave us the low down on where to go and what to see, to the girls who were on breakfast duty. They didn't speak english too well but tried very hard and worked even harder. The location of the hotel is amazing for the price. If you take 2 or 3 steps onto the road outside and look down the via del Serpenti, you'll see the side of the Colloseum (about a 5 mins walk) with the Roman forum right next to it. Indeed the hotel is within walking distance to pretty much everything there is to see, the Vatican city and museums apart. So if your looking for a great location and not going to spend too much time in the hotel, this is ideal.", "title": "Great budget b&b", "helpfulness": 2, "user": "gazbjo", "date": "January 13, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 2.0, "location": 5.0}, "id": 6590269, "likes": {"liked": "— Definatly the location", "disliked": "— TV was only in Italian"}}, {"rating": 2.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "One thing you really need to know though, dont make eye contact with street vendors or they'll keep trying to sell you their wares and watch out for gypsy kids. I was approached by to young girls and a boy going down stairs at the colloseum. 2 on one side and one on the other and when we approached they switched places. The young boy tried to put a bit of card with writing on it under my face and I felt the young girl try and dip my pockets. I slapped her hand out the way and shouted at them but with lots of gypsies in the area, I didn't want to do too much else.", "title": "Great Location but Not Good Accomodations", "helpfulness": 1, "user": "ahsot", "date": "December 29, 2006", "detail_rating": {"front_desk": 3.0, "service": 2.0, "cleanliness": 1.0, "value": 2.0, "rooms": 1.0, "location": 4.0}, "id": 6516186, "likes": {"liked": "— The location; down the street from the Colliseum.", "disliked": "— The room was awful."}}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "The Anfiteatro Flavio is not a hotel to stay in for more than 2-3 days; unfortunately we were booked for 7 days from 12/8-12/14. The pictures shown on the website are extremely misleading; the bathroom was extremely small. The smell permeating from the toilet was unpleasant as well. Luckily, I came prepared with an air freshener and flushing the totel sounded worse than flushing airplane toilets. Going to the toilet at night always woke up whoever was sleeping. We also had an issue where there was some type of water pump on our balcony that came on every night at 3:30 am, 4:30 am and 5:30 am so getting a restful sleep did not happen until I was headed back home on the airplane. The sheets were never changed after I specifically asked to have them changed; I knew because there was a hole in the sheet on our double bed which was two twin beds pushed together. They were not even twin longs because my boyfriend is 6'2\" and we had to sleep on an angle so he could fit. The phone did not work until the night before we were to leave Rome. The best attributes at the hotel were the cappuccino and croissants (the ladies in the cafe were truly nice), the location (down the street from the colliseum/metro stop) and the two gentlemen that worked the front desk were always helpful. After much research I really thought I had chosen the right place to stay while in Rome but at 93 euros a night; I clearly made the wrong choice. I would not recommend the Anfiteatro Flavio to anyone unless they were just passing through for less than 3 days; actually it is only worth staying overnight.", "title": "Perfect location, friendly and helpful staff", "user": "k2rhodes", "date": "December 26, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 6496093, "likes": {"liked": "— The staff", "disliked": "— Check out the supermarket on the nearby Via Nazionale. It saved us a ton of money to buy food there."}}, {"rating": 4.0, "title": "Verty pleasant stay", "text": "We stayed 4 nights at this hotel and couldn't have had a better experience. The staff was so friendly and helpful; they made us feel like we were at home. The location of the hotel was within a 20 minutes walk to everything that we wanted to see, so that we did not have to take the subway once during our stay. The people in the surrounding neighborhood were as friendly as the hotel staff, and helped with directions and anything else we asked for. Overall, the hotel was also a great value. The rooms were comfortable and everything was very clean. The complimentary breakfast was a big plus also, and it was very good. We would return to stay at the Anfiteatro Flavio again and plan on doing so whenever our next trip to Rome comes up!", "user": "ilming", "date": "December 21, 2006", "id": 6479776}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled with friends", "text": "We stayed in one of the apartments of the hotel that was decorated to a high standard, with efficient central heating and also air conditioning - that we did not need in December. The shower room also had basin, bidet and WC and seemed to heve been recently fitted out to high standard. There are 2 bedrooms and another room fitted out with a kitchenette. The only drawback was that the appartment we occupied was 2 floors up with a somewhat uneven concrete staircase and no lift. The staff were very helpful and assisted us as much as necessary.", "title": "A good place to stay", "helpfulness": 1, "user": "Gilstef", "date": "December 16, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 6447724, "likes": {"liked": "— the staff, the quietness", "disliked": "— No access to the Internet"}}, {"rating": 4.0, "title": "fab position", "text": "We stayed 3 nights in anfiteatro flavio.", "helpfulness": 13, "user": "Neesa", "date": "December 1, 2006", "id": 6314870}, {"rating": 3.0, "stay_parameters": "Stayed October 2006, traveled with family", "text": "We booked with lastminute and prebooked a taxi with the hotel via email (see their own website) from Learnado De Vinci Airport for E50. This went so smoothly, and the driver even stopped the car to let us take photos on our way in, that we also booked our taxi for the way back. Taxi journey from LDV airport to hotel was about 35mins.", "title": "Great location small room for 4", "helpfulness": 2, "user": "vanheeswijk", "date": "October 25, 2006", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 3.0, "location": 5.0, "rooms": 3.0}, "id": 6010736, "likes": {"liked": "— the location", "disliked": "— the size of the room for 4"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "Arrived at the hotel and was delighted to see so many resteraunts within 2min walk of the hotel as well as a fantstic view of the coloseum from the road!", "title": "Anfiteatro Flavio: Wonderful Hotel in a Great Location!", "helpfulness": 3, "user": "cicchetticj", "date": "October 20, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 5979116, "likes": {"liked": "— Hotel staff were attentive, friendly and very helpful!", "disliked": "— Leaving after only 2 days..."}}, {"rating": 3.0, "stay_parameters": "Stayed July 2006, traveled with family", "text": "Check in at the hotel was a breeze, we were promptly given our room key. Note: most hotels do take your passport upon check in, but there is a room safe, and if like me and my friend, you are under 26 and you show your passport (or driving license), then you get discounted entrance to many of the sites including the colosseum (E6.50 instead of E11) and the Vatican museum (E11.50) along with many others.", "title": "Decent hotel minus the plumbing odor", "helpfulness": 2, "user": "1kat", "date": "October 8, 2006", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 4.0}, "id": 5928282, "likes": {"liked": "— location", "disliked": "— bathroom smell"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2006, traveled with friends", "text": "For 2 people, we had the Nerva room on the 3rd floor with a double bed and a single bed (v.clean!). There was one lift, however it was small and meant for 2 people, with 2 small luggages (so ok for us). Not really a problem if youre on the lower floors though (went upto level 5). Room size was good, there was room to fit our luggage on the side and walk around the beds. We had a dressing table and chair, and 2 sets of cupborads with hangers for clothes. There was also a safe (the key is attached to the room key so impossible to lose!) and a fridge in the room. Our room overlooked the main Via Di Serpenti Rd, which wasnt too noisy with the windows open, and dead silent with the windows closed.", "title": "Lovely hotel", "user": "vtf", "date": "October 7, 2006", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 5925995, "likes": {"liked": "— location", "disliked": "— all was great"}}], "location": {"country": "Italy", "region": "Lazio", "continent": "Europe", "city": "Rome"}, "stars": 3, "variance": {"poor": 35, "average": 65, "very good": 119, "terrible": 40, "excellent": 49}, "aka": "Anfiteatro Flavio Rome", "slim_ranking": 0.574921135647, "description": "This cozy and comfortable accommodation is located in a 17th-century Roman mansion in the heart of Rome, a stone's throw from the Colosseum (also known as the Anfiteatro Flavio), the Imperial Forum, Via Nazionale, the Spanish Steps, Via del Tritone, Piazza Venezia, the Trevi Fountain, Piazza Barberini and the Via Veneto. The hotel has recently been refurbished and has 21 comfortable and elegant rooms, each of which is named after a Roman emperor. Every room is equipped with: Private bath, Direct telephone, Color TV, A/C and Central Heating, Fridge, Hairdryer, Safe Box"}