{"user_rating": 5.0, "review_count": 348, "name": "Antigonish Evergreen Inn", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed March 2009", "text": "Spent the night here with my daughter's volleyball team. Bill and Lynne treat you like you are staying at a 5 -star facility. Newspaper on the bed, chocolates on the table and the lamp nicely lit when you arrive. The rooms are amazing- beyond clean and the beds are the most comfortable I have ever stayed on in a hotel. In addition, you have a full kitchenette in your room. We fed the entire team and parents a full meal on Friday night. Don't worry about breakfast as they provide this as well. I would not hesitate to return and will recommend this hotel to everyone!", "title": "This hotel will keep you coming Back!!", "helpfulness": 1, "user": "rc_keith", "date": "March 31, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 27157511}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "What you get for an affordable price:", "title": "A for Antigonish Evergreen Inn", "user": "kasey363", "date": "September 1, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 39518134}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "1. Very large, clean rooms with a full kitchen. full size refer, stove, sink. fairly large counter area and cupboards full of plates, pots and pans, utensils etc. Just move in, it's a studio apartment only without a dining room table.", "title": "A truly hidden gem!!!", "user": "ruffy6", "date": "September 1, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 39492707}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "2. Bath area is extremely large, clean, plenty of counter space, oversized tub/shower. Everything but a hair dryer - so go natural.", "title": "Great value, super clean, very comfortable,friendly owners.", "user": "trvlr2362", "date": "August 9, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 37170898}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "3. Parking right in front of your room", "title": "A gem of a little motel", "user": "Sahkanaga", "date": "August 4, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 3.0, "service": 5.0, "rooms": 5.0}, "id": 36730969}, {"rating": 5.0, "stay_parameters": "Stayed July 2009", "text": "4. Small breakfast area set up with help yourself cereals, muffins, toast, juice, granola bars, fresh fruit, coffee. Over what you might expect from a small motel type accomodation.", "title": "Little Gem", "user": "rnmamlo", "date": "August 3, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 36633917}, {"rating": 5.0, "title": "Clean, quiet and affordable!", "text": "We stayed one night on our way to Cape Breton Island and what a find. The owners are great and the room was really clean, quiet and comfortable. We checked in, slept, ordered food to be delivered, slept some more and then had a nice breakfast. There was free water in the fridge and the munchies in the room to purchase were priced at what they must have paid for them. I would stay here again in a heartbeat. We found out about this from the visitors information center and what luck, would never have found out about it otherwise. If you are looking for a clean, quiet and affordable room this is the place to go. The views of the hills is very peaceful and the place was very quiet.", "user": "merle55", "date": "July 29, 2009", "id": 36136251}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "What a wonderful retreat after a long day's travel. Our room was an absolute delight. It was pristine clean. The bed was so comfortable.one fell asleep immediately. The view from our window was one of gently rolling hills. There was a small fridge already stocked with bottled water. And the bathroom...it was like entering a five star establishment with its tiled walls and luxurious, soft white towels. Every small detail was included.", "title": "An oasis after a long day's travel", "user": "Smubby", "date": "July 20, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 35275262}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "In the morning, after reading the supplied newspaper, we had a delightful continental breakfast which included a bowl of seasonal fruit and home baked muffiins.", "title": "A fabulous small motel", "user": "EssexMallard", "date": "July 3, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 33831375}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled solo", "text": "The owners were friendly and obliging and gave us excellent ideas about where to dine.", "title": "Clean, great amenities, quiet and large rooms.", "helpfulness": 1, "user": "ravengirl1220", "date": "May 26, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 30834517}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled on business", "text": "We would have liked to have stayed longer but they were fully booked. Would we return to the Evergreen Inn? In a heartbeat!", "title": "Wow, what a fabulous Hotel", "helpfulness": 1, "user": "Musman2", "date": "May 17, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 30170739}], "location": {"country": "Canada", "city": "Antigonish"}, "stars": 2.5, "variance": {"poor": 0, "average": 1, "very good": 22, "terrible": 0, "excellent": 325}, "aka": "Antigonish Evergreen Hotel Antigonish", "slim_ranking": 0.2, "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.5}, "description": "We are located approximately 1.5 km from the downtown core of Antigonish and our well known university, St. Francis Xavier. We are known for our quiet yet \"in-town\" location, friendly, homey atmosphere, helpful service and a healthy continental breakfast. We offer clean and comfortable accommodations with all amenities you could require. Book today and relax in front of our new flat screen tv's with over 400 DVD's to chose from at no charge or sit outside and enjoy the view while reading and enjoy a flavored coffee from our evening treat cart. Our queen rooms have cozy fireplaces for your relaxation as well. All rooms have robes and slippers and ipod/iphone docking/charging stations. For the business travelers we have wifi and/or cabled connection with excellent strength. Visit us today - we promise you won't be disappointed."}