{"user_rating": 4.0, "review_count": 390, "name": "Antigua Miraflores Hotel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "Really nice hotel, huge rooms, lovely receptionists who helped us at every opportunity. Very quiet at night, nicely located with many restaurants in the area. Felt safe walking around at night. No elevators, though, so we did carry our bags up 2 flights of stairs. I am sure a porter would have done it if we had asked.", "title": "Beautiful hotel", "user": "Judy L", "date": "July 22, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 168634794}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "The four of us started and ended our recent trip to Peru at Antigua Hotel. The customer service was outstanding, beginning with our promised minivan driver waiting for us at the airport. The hotel has staff available 24 hours a day, and this is very helpful when you arrive in the middle of the night. Our rooms were very nice, and we had a good breakfast of chicken tamales in the morning, with time to walk down to the lovely parks and beaches that are so close by. There are also good restaurants close by, and a fun neighborhood in which to walk.", "title": "Charming hotel in Miraflores", "user": "annlemery", "date": "July 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 168472646}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "We stayed here for a week during July.", "title": "Nice Hotel", "user": "Flying_Marcus", "date": "July 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 168239863}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "Nice room, very helpful and friendly personell and a nice breakfast. Safe taxis are also always available in front of the hotel.", "title": "Decent hotel, pity about Lima", "user": "Plug28", "date": "July 15, 2013", "detail_rating": {"cleanliness": 3.0, "sleep": 3.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 167617327}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "The area is nice and safe also at night. Lot of cafés and restaurants close by.", "title": "Clean, Quite, Safe and Centrally located", "user": "Alex A", "date": "July 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 167542279}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "Spent five nights here at the end of a 3 week holiday in Ecuador and Peru. The English speaking driver (Jose) who picked us up at the airport was very pleasant and informative. Front desk staff were efficient and very helpful. Lovely area for walking, with many good restaurants nearby. We stayed in one of the newer rooms. It was spacious and clean, with a very good bathroom. Quiet at night, we slept with the windows open. Walking distance ( 8 blocks) to a major historic site. We booked directly and our room came with daily breakfast and airport pick-up. Nice cafe half a block down the street for a later morning specialty coffee and croissant. Felt completely safe in the area at night. Taxis always available if you want to go farther away. No hesitation in recommending.", "title": "Enjoyable Stay", "user": "BarbaraElizabeth", "date": "August 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 170944454}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "Being a converted home makes this place more charming, despite the difficulties of maintaining such a property. There are issues with carpets being musty and the like, but if there is a problem the staff is very gracious and promptly address it as best as they possibly can. And don't miss the free shoe shines. Walking distance to Kennedy Park and to the grocery store Vivanda (very similar to Whole Foods). Good restaurants nearby and a some nicer ones are still walkable as this is in a safe neighborhood. Some in our group even walked to park overlooking the Pacific.", "title": "Nice change from Name Brand hotels", "user": "anlgza", "date": "August 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 170431784}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled solo", "text": "I booked the Hotel Antigua through Booking.com and was happy with the rate which also included breakfast. However, upon my arrival, I was advised that the rate only included breakfast on the first morning of my stay. Even though I did not require breakfast on days 2 and 3 due to ultra early departures, I was glad I didn't have to pay for two more breakfasts because the American breakfast serving was rather spartan. (I filled up on bread rolls.) Otherwise, the staff were helpful, my ground floor room was clean and comfortable and overlooked an attractively landscaped garden. The bar/lounge area was most relaxing and the tasteful decor enhanced the old world charm of the hotel. If you enjoy good coffee, spoil yourself with a cappuccino - definitely among the best in Lima.", "title": "Shame about Breakfast", "user": "Linda S", "date": "August 2, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 170399309}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "We stayed at the Miraflores hotel twice - once when we flew into Lima and then 2 weeks later before flying home. There was a big difference between our two rooms. The first room was musty smelling and had rather old comforters on the beds. It was almost like being in a cabin. The second time we were on the top floor (room 300) and it had a nice view, smelled fine, and the furnishings and comforters seemed newer and better. Pros: there is a nice bar/coffee place in the hotel. The breakfast was decent, but nothing great. But every room has a pitcher of purified water to use, so you have plenty of clean water. The hotel is also in a nice location with restaurants and shopping nearby. Cons: the water pressure for the shower was terrible you only get a trickle of water. There seems to be a big difference with the rooms. Some are a lot nicer than others.", "title": "Boutique Hotel has Charm", "user": "CaliforniaGirl040", "date": "July 30, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 170067222}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "Transformed from a 19th century mansion, Hotel Antigua Miraflores has a lovely old world charm with modern comforts. At the center of the hotel is an atrium with a fountain and many lush plants. The rooms are modern but decorated with hints of traditional Peruvian style and very comfortable beds. The staff is extremely helpful, and the breakfasts are satisfying and provide plenty of variety. While one needs a taxi to get to the historic section of Lima, the hotel is a short walk to the Miraflores beach and the quirky Parque del Amor. Good restaurants and shopping are very close to the hotel. Best of all, a Pisco and tapas bar just opened for guests at the hotel. Don't miss this new venture, Alembic, operated by Carla Davila Carlin and her partner. They have created all sorts of infusions to go in your Pisco sours, from gooseberry to blue corn to lemongrass, and even if you don't want to sample the alcohol, their tapas are not to be missed. This was some of the best food we've had anywhere in the world!", "title": "Charming hotel and pisco bar in Miraflores", "user": "Ellen E", "date": "July 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 168743933}, {"rating": 3.0, "title": "An old and expanded house", "text": "We stayed two nights at the end of our more than two weeks family vacation trip. The hotel premises are based in a traditional Miraflores house which was expanded and aded other floors to augment the hotel capacity. Our room was in a makeshift construction on the terrace, it was big enough for a family of four which suit us well to rearrange the many suitcases before the final trip. The breakfast is good with fresh bread, several options and eggs to order. The personal was very attentive and help us with the suitcases.", "user": "Camoto54", "date": "July 14, 2013", "id": 167530858}, {"rating": 4.0, "title": "Great location nice hotel", "text": "We stayed here twice during our trip to Peru - once on the way into the country and the second time on our way out.", "user": "calif-irish", "date": "July 13, 2013", "id": 167414909}, {"rating": 4.0, "title": "Great rooms and breakfast with quick wifi but coach tours make it seem crowded at times", "text": "The hotel property has a nice charm to it. It is located in a nice area in walking distance to Kennedy park. The staff was extremely helpful.", "user": "greenandbluetoo", "date": "July 12, 2013", "id": 167310120}, {"rating": 5.0, "title": "A Wonderful 4th", "text": "Our first room was on the top floor facing the street. There was quite a bit of noise from the road. On our second stay, we had a room on the first floor away from the street - very quite and quite comfortable. The only problem with the second room was some difficulty controlling the temperature of the shower - seemed to go from very hot to very cold.", "user": "wildnfunms", "date": "July 10, 2013", "id": 167102855}, {"rating": 4.0, "title": "Not bad! Great location", "text": "They had a nice breakfast with breads, coffee, juice and tea and a choice of a hot breakfast. We didn't find the Peruvian breakfast selection all that tasty, but the other breakfast choices were good.", "user": "Camila G", "date": "July 7, 2013", "id": 166663130}, {"rating": 1.0, "title": "Check the year of the positive review and run to another hotel", "text": "We unfortunately were unable to stay in this hotel July 4, 2013 because the hotel is very, very dirty. If you look, the good reviews are from a long time ago. It is so dirty, it is like a flop house. Carpets in the halls are full of stains, the rooms are the same. The hotel smells of dirt, mold and is just very low standard. We were shown two rooms, one off the main entrance and one in an adjoining building. It is just not clean. It's like something you see in movies for people who need to rent by the week and live on a very low income.", "user": "Lovinglifetoday2012", "date": "July 5, 2013", "id": 166390177}, {"rating": 5.0, "title": "Charming Peruvian hotel", "text": "It is not at all as represented by the hotel images, although it may have been grand at one time.", "user": "thebaberanch", "date": "July 3, 2013", "id": 166215684}, {"rating": 4.0, "title": "Something like staying in a museum...", "text": "Plus, even after confirming that the hotel would arrange transport from the airport, we looked for 45 minutes the sign with our name on it, as the hotel promised in writing-3 guests and an airport representative, and there was no transport. Stay somewhere else, unless you want to sleep in your clothes.", "user": "Westralia", "date": "June 30, 2013", "id": 165726685}, {"rating": 3.0, "title": "Tiny room, comfortable bed", "text": "Stayed here as part of a tour group with STA travel for a few nights.", "user": "grip652", "date": "June 27, 2013", "id": 165468644}, {"rating": 4.0, "title": "Nice Hotel/ Good location", "text": "Great location.", "user": "Naturetravelers", "date": "June 25, 2013", "id": 165235955}], "location": {"country": "Peru", "region": "Lima Region", "continent": "South America", "city": "Lima"}, "stars": 3, "variance": {"poor": 22, "average": 65, "very good": 190, "terrible": 12, "excellent": 101}, "aka": "Hotel Antigua Miraflores", "slim_ranking": 0.25}