{"user_rating": 5.0, "review_count": 170, "name": "Aoraki Court Motel", "reviews": [{"rating": 4.0, "title": "Beautiful location and rooms", "text": "The new Aoraki Court Motel has stunning views of the peaks surrounding the Hooker Valley. The suite was spacious and well appointed. Overall the accommodations well exceeded our expectations but staff proved less than helpful on multiple occasions. When asked where we could find a shop to purchase food supplies, the man who checked us in told us we might be able to buy food at the Hermitage. This is true but the youth hostel across the street from the motor court had significantly more provisions which we discovered when we were leaving the area. We also asked where there might be a place to swim to cool off after a hike on a hot day. Staff mentioned a stream but failed to note that there is swimming for the brave at Blue lakes in Tasman valley which you can bike to with bikes rented at the youth hostel across the street. We were disappointed that we missed this opportunity because we did not put the info together in time. Finally, while the motel staff oriented us towards the Mountaineer for lunch, the Hermitage's Sir Edmund Hillary bar and cafe was definitely the best value for your money.", "user": "ES R", "date": "March 3, 2013", "id": 153629571}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "Well appointed, clean and spacious accommodation. Comfortable large bed and good size bathroom complete with spa bath for two! Stunning views of Mt. Cook range from patio doors. Helpful staff and easy access from Mt. Cook Village roads.", "title": "The best stay of our NZ adventure", "user": "Stephen G", "date": "March 1, 2013", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "location": 5.0, "value": 5.0, "rooms": 5.0}, "id": 153454551}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "Stayed here for three nights as part of our honnemoon trip around the South Island. Simply outstanding!! Excellent quality spotless facilities with amazing views. Really welcoming and friendly owner. We had originally only booked one night but changed to three on entering the room. This was a definite highlight of our trip.", "title": "Excellent!!!", "user": "MartinLillis", "date": "February 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 153287203}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "This is a new establishment. The kitchen is very well equipped. The bed was enormous, and very comfortable. The spa bath a very nice touch. All the rooms have wonderful views out over the mountains. We had a fantastic stay.", "title": "A Fantastic Stay", "user": "SVPromise", "date": "February 26, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 153252131}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled solo", "text": "New, well appointed motel at Mt Cook village. One or two of everything you need in the kitchen, large bathroom, comfortable beds and pillows. With respect to touristy areas (pricey), the rates stack up well for what you get. It's not cheap, but I think it's far better value than the one other comfortable accommodation offering at Mt Cook. Pleasant and friendly staff, plenty of parking, complimentary wi-fi. Recommended!", "title": "Great to see another quality option at Mt Cook", "user": "777Gus", "date": "February 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 153013058}, {"rating": 5.0, "stay_parameters": "Stayed February 2013", "text": "Amazing location and lovely spacious room. Very nicely done decor. We would certainly stay again. One very small annoyance was they provided a 2 person coffee satchet and a 1 person plunger. Otherwise very very nice place.", "title": "Great locAtion", "user": "Russdi", "date": "February 17, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 152373166}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "My wife and I stayed in the motel together with my sister's family after a grueling 3 hours drive in the rain from Christchurch. We were already tired from travelling from Nelson a day before and thought that it would be great to just check Mt.Cook out for a change. We had to book Aoraki Court since there weren't any more vacancies elsewhere and to our surprise it was definitely a pleasant surprise for all of us!", "title": "Worth the trip!", "user": "Aqel", "date": "February 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 152011204}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "The rain held us back from doing anything however the new unit was fitted with a jacuzzi tub and everything else was new. Outside presented a good view of the mountain range although it was covered in mist most times during our stay. Thankfully we packed enough food to cook for dinner and breakfast and who knew a stay-cation during a vacation could be so fun that we were seriously considering staying for another night. We might have if it wasn't because the torrential rain and the fact that our next destination was Lake Tekapo.", "title": "Amazing views", "user": "sandaross", "date": "February 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 151848707}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with friends", "text": "Kudos to the management for providing such a great place to stay at Mt. Cook!", "title": "AMAZING room in an amazing setting", "user": "yorkiebar23", "date": "February 10, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 151835427}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "What a wonderful motel. Amazing views, you can't quite see Mt Cook but the mountain views are breathtaking. Very clean and tidy, lovely decor. Also it's a great price!", "title": "Heavenly stay in the mountains!", "helpfulness": 1, "user": "momflys", "date": "February 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 151428117}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "Stayed here for 1 night to visit Mount Cook national park. The 2 bedroom apartment was excellent, large, well-furnished and stunning views over the mountains. Good value for money for such a remote, tourist location. We had a hearty meal at the Chamois in the backpackers lodge, just 5 minutes walk, also surprisingly good value for the location.", "title": "Excellent apartment with stunning views", "user": "Kevin B", "date": "March 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 154115388}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "We stayed here for 2 nights, so were given a room at the front of the motel with an unobstructed view of Mount Cook. It was truly memorable. The motel is quite new and the room was large, very clean and very comfortable. The kitchenette was well equipped. The Staff were very friendly and helpful.", "title": "A view to remember", "user": "Felicity S", "date": "March 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 153884637}, {"rating": 5.0, "stay_parameters": "Stayed March 2013", "text": "We would definitely stay here again", "title": "Lovely location and stay", "user": "Topdiver", "date": "March 6, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 153830281}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "It was a last minute decision that took us to Mt Cook Village and Aoraki Court Motel and I'm glad we did. As it was a new Motel everything was in lovely condition as you would expect. That said it was a special place with accommodation that was excellent value for money. I would recommend it to anyone wanting something a little special if you are in the area and don't want to pay through the nose for it.", "title": "A great apartment at a reasonable price", "user": "Chris S", "date": "March 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 153662377}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled with friends", "text": "Our apartment was excellent. Only opened 3 months ago, so all smart and clean , and everything worked. Staff very helpful. Very clever windows meant that we had views of mountains on 2 sides. If you want better than backpacker/YHA-type place, without paying Hermitage prices, this is your place.", "title": "Mountain magic", "user": "Roitacop", "date": "March 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 153645143}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "We stayed at this motel for 6 nights during a long spell of unusually good weather. The excellent insulation meant that the room remained cool; great for coming back from a long hot tramp. As there was no airconditioning the room was quiet. We stayed in a studio with no bath but a large shower with enough room to store personal toiletries in the shower (a bugbear of most rooms). There was also a large shelf for luggage - enough for 2 bags so no argument about who had to put their bag on the floor. There was plenty of room in the unit. Cooking facilities were very good too, although the coffee plunger did only one cup at a time.", "title": "Excellent place to stay", "user": "sphinxxnz", "date": "February 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 152921626}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "On the down side there were no comfy chairs and nothing to sit on outside - I took a chair from the table outside to sit in the sun. The views of Mt Sefton are great but the outer units have better views.", "title": "Wonderful place to stay", "user": "Beverly B", "date": "February 23, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 152831572}, {"rating": 5.0, "stay_parameters": "Stayed February 2013", "text": "Once the landscaping is completed the visual appeal will be greater. I can reccommend this as comfortable for a long stay.", "title": "Fantastic little place to stay!", "user": "Ella P", "date": "February 21, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 152753233}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled with friends", "text": "Spent one night here because we could not get into the other place up the hill and arent we glad we couldnt. Fantastic place, views were unbelievable, service just great. When landscaping finished will be superb. Would definitely stay again.", "title": "Absolutely A1", "user": "Linda H", "date": "February 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 152508430}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "Once the gardens are completed this accomodation will be unsurpassed. The views from our bed were breath taking, the spa was fantastic for warming our frozen toes! The service was the best we experienced all trip, lovely people the both of them! Deffinatly recommend this place, fantastic!", "title": "Very spacious and lovely decor", "user": "Wendy B", "date": "February 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 152411599}], "location": {"country": "New Zealand", "region": "South Island", "continent": "South Pacific"}, "stars": 4.5, "variance": {"poor": 0, "average": 2, "very good": 16, "terrible": 0, "excellent": 152}, "aka": "Aoraki Court Motel New Zealand/Mt. Cook Village", "slim_ranking": 0.5, "description": "Brand New Motel Complex situated within the stunning Aoraki Mt Cook National Park with every unit having absolutely stunning view of Mt Sefton and the surrounding mountains. 24/7 Reception, daily housekeeping and private bathrooms in all units."}