{"user_rating": 4.5, "review_count": 252, "name": "Apartments Parque Tropical", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "Just back ,what a great place to stay no noise a joy to get a good nights sleep. Staff very friendly and helpful. Cleaning excellent, towel replacement good. Apartement well equiped,fridge excellent for cooling etc. Early risers that grab sun loungers should get red card. Walking distance to beach 5min and shops etc. I will be back .", "title": "HAPPY DAYS.", "helpfulness": 2, "user": "rimfire22", "date": "October 10, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 20783184, "likes": {"liked": "— well kept", "disliked": "— nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled with friends", "text": "Just back from Lanzarote and stayed in the Parque Tropical appartments. The appartments and complex are probably one of the best I have stayed in to date. They have recently been refurbished and are really done to the highest standard. I did notice that some are refurbished more than others but they are all still of high standard.", "title": "Highly recommended", "helpfulness": 3, "user": "Nipper08", "date": "July 30, 2008", "detail_rating": {"front_desk": 3.0, "service": 4.0, "business": 3.0, "cleanliness": 5.0, "rooms": 5.0, "location": 5.0}, "id": 18418623, "likes": {"liked": "— Clean and very spacious appartments", "disliked": "— no air conditioning"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled with family", "text": "The only thing missing was air conditioning but some appartments have roof propellors which offer some bit of cooling.", "title": "just fab", "helpfulness": 2, "user": "Eamon M", "date": "April 26, 2008", "detail_rating": {"cleanliness": 5.0, "front_desk": 5.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 15385099, "likes": {"liked": "— fresh clean and airy", "disliked": "— n/a"}}, {"rating": 3.0, "stay_parameters": "Stayed March 2008, traveled with friends", "text": "The complex is also very nice and very well maintained. The grounds, swimming pools are spotless and very quite during the night times. The only issue was lack of sunbeds - you would have to be up very early to get one.", "title": "OK To Stay", "user": "longestyard", "date": "March 29, 2008", "detail_rating": {"front_desk": 2.0, "service": 2.0, "cleanliness": 1.0, "value": 3.0, "rooms": 3.0, "location": 4.0}, "id": 14639381, "likes": {"liked": "— LOCATION", "disliked": "— STEPS, ONGOING REFURBISHMENT,"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2009, traveled with friends", "text": "Just returned from a week's stay and would happily re-book tomorrow. Apartments are in a great location - extremely handy for everything (5 mins or less to beach/shops/restaurants/bars) and yet they're very quiet. Amenities are more than sufficient (2 ring hob, microwave, coffee machine, toaster, large fridge/freezer) with plenty of wardrobe space in the bedroom, a decent sized bathroom and large balcony. The pool area is lovely with lots of mature plants and very comfortable sunbeds. Staff were very friendly and helpful - especially Pedro on reception who had lots of useful information on the area. All in all wouldn't hesitate to return.", "title": "Highly recommended", "user": "pinkflower001", "date": "May 8, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 29599419}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled with family", "text": "These apartments were far and away the best I have stayed in abroad. We has a cleaner visit every day and she even washed up if we had felt to lazy after breakfast . Clean sheets after 4 days of a 9 day break also. Excellent facilities and quiet despite being only 5 mins from main strip . Pool and pool area cleaned everyday set amongst lovely grounds . Staff very friendly and supermarket just across road I will defo be back", "title": "What more can I say excellent a real find", "helpfulness": 1, "user": "dawes66", "date": "April 21, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 28482859}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled with friends", "text": "I stayed here with one of my friends i was 19 she was 20 we arrived late enough in the evening but wer shown to our apartments straight away no waiting around we had our showers and got ready to go out for something to eat we walked down the road towards the main strip and spotted a chinese restaurant on our right just before the main strip we sat beside a window and behind us we could see a bar/club called paradise beach club and decided we would try there later as it wasnt to far the food was lovely very cheap and generous portions couldnt fault it we ate here 3times we also ate in a lovely restaurant called la dolca vita same again cheap and lovely.", "title": "fantastic!!!will be back nicest apartments ive stayed in in a long time", "user": "lanzaloverlouth", "date": "March 23, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 26672123}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "night life was excellant we seemed to have a routine paradise first in the evening staff are very nice here cant do enough for you try to make your holiday as enjoyable as possible we used to head down to the centro atlantico then for the likes of nikki beach and the big apple when these closed sometimes we would head to one of the clubs called 928 dance club with the staff although some people complained the crowd in here was very young (15-16) it didnt really bother me on our last night we went to the opening of ceasers and what a night that was very entertaining.", "title": "Lovely apartments", "user": "Taliha", "date": "February 3, 2009", "detail_rating": {"cleanliness": 5.0, "front_desk": 5.0, "location": 5.0, "value": 5.0, "rooms": 5.0}, "id": 24178728, "likes": {"liked": "— It was so clean and people at reception were friendly.", "disliked": "— Not enough sun-loungers and no entertainment in apartments for younger children."}}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "the apartments itself i found very clean but a little bit warm but in previous posts as people said just use the ceiling fans and you will be ok staff very friendly and helpful cleaning lady came about five times and we were only there for a week clean towels and toilet roll each time she didnt come to early either i think it was around ten o clock when she used to call so we still got our lie in wasnt noisy at all even though you were very central you wouldnt even know how central you were..i felt very secure in these apartments as i myself seen the receptionist who worked in the evenings look around the complex and outside before locking the front door to make sure everything was ok and as for those who are complaining about the sun loungers we had three on our balcony and i know other balconys had them too and the beach is only a 5min walk all in all these are the best ive stayed in in a long time the year before i was away working for the summer and the apartments i stayed in when i was away dont come close to these even my friends when they came over to visit me last year paid far more than wat i paid for these and you should have seen them apartments \"central\" yea right central to what? a road. so all in all i will be back this year once in may and once in oct so far. and these are suitable to most people young and old families and singles and yes even disabled people as the apartments at the front of the complex open out on to the street only there is a bit of a hill to walk up and down to the main street.", "title": "Way above my expectations", "helpfulness": 1, "user": "BirminghamGadabout", "date": "October 18, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 20990307, "likes": {"liked": "— Modern and spacious", "disliked": "— Not enough sunbeds round the pool"}}], "location": {"country": "Spain", "continent": "Europe"}, "stars": 3, "variance": {"poor": 10, "average": 25, "very good": 86, "terrible": 5, "excellent": 126}, "aka": "Apartments Parque Tropical Hotel Puerto Del Carmen", "slim_ranking": 0.156626506024, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.0, "rooms": 4.5, "location": 4.5}, "description": "Parque Tropical is a small complex of 80 apartments in the heart of Puerto del Carmen. It is used mainly by couples and families, who want to be in the centre of things but at the same time relax in the calm atmosphere of this friendly and clean establishment which was totally refurbished in May 2007.All apartments have pool, sea or garden view from terrace or balcony. Two ecofriendly pools , reception 24 hours."}