{"user_rating": 4.0, "review_count": 896, "name": "Apartamentos Aguamar", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "Not long got back from Aguamar. We booked it on the basis of previous reviews taking into account good and bad reviews and deciding to go for it!", "title": "Great value apartments close to amenities", "helpfulness": 2, "user": "kimmy_yo", "date": "June 30, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 2.0, "value": 5.0, "service": 3.0}, "id": 114911011}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "When we arrived at 11.30pm, we checked in quick, the receptionist was lovely and we got to our room on the 4th floor. We were really pleased with the room itself - but it was so so hot due to no air conditioning in any rooms. We then opened the window and balcony and it was extremely noisy due to the string of 5 or 6 bars across the road. We couldn't get to sleep until about 3am - we presumed as it was a saturday night it would be quite lively so just accepted it.", "title": "Great for families", "user": "modestjen", "date": "June 29, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 5.0, "service": 5.0}, "id": 114874678}, {"rating": 2.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "We had to hire a fan due to the heatwave, it got to 40 plus degrees a few night, this also drowned out the noise from the bars etc which you got used to and accepted, it wasn't too bad through the week days.", "title": "Never again", "helpfulness": 2, "user": "steviepDerbyshire", "date": "June 27, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 1.0, "value": 1.0, "service": 3.0}, "id": 114802885}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "The breakfast is nice, good hot selection, including chips, haha. Bacon, sausage, mushroom, eggs, plum tomatoes, beans all nice, a selection of cold meats and cheese, fruit salad, plain yoghurt, cereals, hot and cold drinks, it was more than adequate. We were B and B basis and tried the evening buffet, it was diabolical, 24 euros for 2 of us, drinks were seperate. The food consisted of chips, sauteed potatoes, rice with peas in it, pasta and fish, chops, hake and not much more. Ice cream was included. Very dear for what it was.", "title": "Fantastic", "user": "billnanne", "date": "June 24, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 5.0, "service": 5.0}, "id": 114700291}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "The bar area was very quiet in the evenings, presumably everyone just nips into town with it being so close and loads of places do a pint for 1 euro.", "title": "Brilliant first family holiday with small children", "helpfulness": 1, "user": "kimgregory86", "date": "June 23, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 114685435}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "Myself and my sister stayed here for 6 nights, half board, at the beginning of July and thoroughly enjoyed it. The staff were friendly from the word go and answered any questions we had.", "title": "Very good hotel, excellent for the price!!", "helpfulness": 1, "user": "Rebecca1022655", "date": "July 9, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 5.0, "service": 4.0}, "id": 115193011}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "As I myself am a fussy eater I was worried about the food that would be served but was well able to fill my plate every night from the wide selection of food. Every dinner (served between 7:00pm-9:00pm) there was something different but always consisted of chips, a pasta dish, meat dishes, fish dishes, potato dishes as well as other cooked vegetables and soups. There was also a salad bar to choose from which included cold meats and cheeses. The dessert was always a selection of ice creams, fresh fruit and cake.", "title": "Clean friendly apartments", "helpfulness": 1, "user": "bazptr", "date": "July 9, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 3.0, "value": 5.0, "service": 4.0}, "id": 115180066}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "The breakfast (served between 8:00am- 10:30am) consisted of a full cooked breakfast, a selection of pastries, yoghurts, fruit and cereals.", "title": "Fabulous hoilday and will certainly be back", "helpfulness": 6, "user": "Gordons24", "date": "July 4, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 4.0, "service": 5.0}, "id": 115023998}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "The apartment itself was very clean and well maintained. The bedroom was spacious with sufficient storage space and a large mirror. The kitchen was well equipped and was fully stocked with cutlery and china. The living room was also spacious and catered for our needs. The bathroom was clean but we did have a problem with the water backing up through a small drain on the floor and although it did suck it back in after time, some water was left. We did however not find this a major problem so did not feel the need to report it.", "title": "Stunning place and location", "helpfulness": 1, "user": "Aidygers", "date": "July 4, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115005368}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "The pool area was always very clean and had enough sunbeds for everyone. The lifeguard was very helpful and interacted with the guest and children often. Although the swimming pool looks small from the outside, it has a depth of 1.25-1.75m around with the children pool being 0.55m. The pool was never crowded but used frequently by all the children and adults.", "title": "Great Apartments, would stay there again!", "user": "kim1990", "date": "July 4, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115004119}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "Me and my family (fella 2 kids and mother in-law) stayed here for 11 nights with Jet 2 we had 2 apartments which were next to each other. We were half board breakfast and evening meal, which was a buffet style affair. Morning consisted of usual continental cheese and meats and breads, with pastries, cereals available, juice tea coffee etc, also traditional english beans eggs(boiled,scrambled,fried) bacon, sasauge etc, you could make toast as well and also there was yoghurs and fruit too. Evening meal was varied hot foods and cold I was happy with choice as was my family, it is no worse or better than any other half board place just they same standards, so if you like a good moan and get board with food easily dont bother with half board or all inclusive simple really!", "title": "great relaxing time had by all", "helpfulness": 4, "user": "vickeh", "date": "July 28, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 4.0}, "id": 115890627}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with friends", "text": "The pool was not a huge one but we found it to be perfect for our needs the beds could get busy but then most places do, we never had any issues with them. The life guard round the pool was absolutely fantastic, he looked after all the kids and adults, very well and even gave the kids who swam with armbands swimming lessons free of charge you could see them become more confindent in the pool as the days went on.", "title": "Best staff ever", "user": "dogsneedlove", "date": "July 28, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115885155}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "The apartments are ok we had one bedroom with 2 single beds for me and my fella. It was quite small for both our HUGE suitcases but they still fitted in I kept mine on the floor next to my bed and lived out of that. There were wardrobes in the room but I am funny about putting my clothes in them. The living/kithchen diner had a sofa with a pull out bed underneath it also had all you needed for self catering in the kithchen, which I thought was good considering we were half board. The bathroom was big and I was happy using it (I can be funny with bathrooms). The balcony ovedrlooked the pool as I think they all do. The floor level apartments were right next to the pool which would have been very handy for families.", "title": "Very good accomodation", "user": "alexthewood", "date": "July 18, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 5.0, "service": 5.0}, "id": 115474165}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "It is I would say a 10 to 15 min stroll to the beach and it all seems quite instinctive to navigate your way around.", "title": "Not the best but good", "helpfulness": 1, "user": "gr8manners", "date": "July 16, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 5.0, "service": 5.0}, "id": 115411507}, {"rating": 2.0, "stay_parameters": "Stayed July 2011, traveled with friends", "text": "There is just down the road a set of local bars selling pints of larger for 1.50 which was cheap!! they were fun and not rowdy at all. If you fancey some nice baguettes there is a takeaway place at the bottom of the road and turn left and a very short walk on your left, she cooked chicken every day and fresh homemade pies all her food was homemade I would definately reccomend there for a snack. I think it was called lisa's or traceys internet cafe takaway.", "title": "Wouldnt Go Back", "user": "tia05", "date": "July 15, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 2.0, "value": 1.0, "service": 3.0}, "id": 115394733}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "Every thing about this hol was brill. Staff very pleasent, rooms clean, we took the Half Baord option which was well worth it, the food was very good, plenty of variety and only small amounts put out at a time so it was never cold, but was always replaced when getting low. Pools were clean. On the whole a very enjoyable time was had by all.", "title": "Brilliant Holiday", "user": "Annie60_11", "date": "July 15, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 3.0, "value": 5.0, "service": 5.0}, "id": 115394461}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "Only one moan, the lack of entertainment at night.", "title": "GREAT HOTEL, DEFINATELY GO BACK!!", "helpfulness": 1, "user": "jessie_01_2k5", "date": "July 14, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 3.0}, "id": 115366409}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "Well what can i say!! This holiday was brilliant!", "title": "GUAAR - Thank you and goodbye. We'll be back.", "helpfulness": 17, "user": "MrFlux001", "date": "July 11, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 3.0, "value": 4.0, "service": 3.0}, "id": 115243477}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "Im a 20 year old and i went with my mum, family friend and sister. The hotel was a great standard, i dont know how people can be so fussy! The room was immaculate and was cleaned 5/7 days. The kitchen facilities were good apart from the fact that it took nearly 2 hours to boil an egg on the hob, whether it was just our hob that was a bit dodgy i dont know! The pool area was always kept clean and caught the sun all through the day! Cant rate the hotel food as never ate there, we would usually walk along the bars by the beach ( about a 5/10 minute walk)", "title": "fantastic - booked again for September", "helpfulness": 1, "user": "Mmcw048", "date": "July 10, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 5.0, "service": 5.0}, "id": 115209312}, {"rating": 4.0, "stay_parameters": "Stayed July 2011", "text": "The only thing that was disappointing on this holiday was the 'maxicat' boat trip that we went on. The sales woman told us we would have a free bar and lunch when we asked what lunch consisted of she said sandwiches, fruit, salad and tortillas. we got one pre packaged sandwich each which were discusting and a piece of chocolate cake about 2 cm big. Not impressed as we then went and complained 2 days later and it was a man this time and he said there was nothing he could do about it!", "title": "You get what you pay for!", "helpfulness": 1, "user": "KJB121", "date": "July 9, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 3.0, "service": 4.0, "rooms": 4.0}, "id": 115196773}], "location": {"country": "Spain", "continent": "Europe"}, "stars": 3, "variance": {"poor": 40, "average": 155, "very good": 424, "terrible": 28, "excellent": 249}, "aka": "Apartamentos Aguamar Hotel Los Cristianos", "slim_ranking": 0.153846153846, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 3.5, "rooms": 4.0, "location": 4.0}}