{"user_rating": 3.5, "review_count": 183, "name": "Aphrodite Beach", "reviews": [{"rating": 5.0, "title": "Mykonos better than Ibiza", "text": "Each year i head off to Ibiza for some early summer fun, relaxation & just to get a bit of a tan. This year i went to Mykonos after a friend told me about Contiki Resort which is a new hotel on Kalafatis beach - you've got to be 18-35 to stay there but it's really good quality. Not filled with losers thankfully! There's lots of things to do in the day like windsurfing & diving and on the nights when i couldn't be bothered goint to town i stayed at the resort club isn't bad. There was always people in there and up for a good time. The clubs on Mykonos are really good and there is lots of daytime beach parties too. I ate at the resort because the food was good and it was included in the price to stay anyway.", "helpfulness": 10, "user": "kidrock", "date": "July 8, 2005", "id": 3648443}, {"rating": 5.0, "stay_parameters": "Stayed June 2005", "text": "I paid an extra £20 for the better room and it mean that i had a big balcony & view over the resort & ocean. The bathrooms are basic but there's everything you need like hairdryer, tv, minibar. For a week I paid £400 to stay including flights from London & two meals a day so it was much cheaper than i normally spend in Ibiza. It's different from staying at a normal hotel because it was easy to meet other people staying there and my friend & i spent quite a bit of time hanging out with our new found friends!", "title": "Heaven on earth", "helpfulness": 12, "user": "kornuts16", "date": "June 29, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 3621329}, {"rating": 3.0, "stay_parameters": "Stayed May 2005", "text": "This place is heaven on earth. The CAPS (contiki action planners) are great they always make sure you have something to do. The only down side is the owner of the hotel has a dog that attacked me, however I got my trip comped, but i couldn't drink. Other than that this is a great place. If you are going to Mykonos try to to stay there, its wonderful.", "title": "Value for Money!", "helpfulness": 16, "user": "RamblinHeart", "date": "June 29, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 3619724}, {"rating": 5.0, "stay_parameters": "Stayed August 2002, traveled as a couple", "text": "Arraiving to this hotel I knew we found a gem... It was quite and peaceful with a very nice beach. Our room had a terrace that looked down to the pool and the sea very beautiful view, and the room had a nice bed and marble floors. the only small problem was that it was a 15 min drive to town,, but it was ok we were on our honeymoon.", "title": "Beautiful Views", "helpfulness": 4, "user": "shawana80", "date": "August 21, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 3.0}, "id": 5631239, "likes": {"liked": "— The views", "disliked": "— the location"}}, {"rating": 1.0, "stay_parameters": "Stayed July 2006, traveled with friends", "text": "This place is terrible. The rooms are awful (dirty, old and noisy), the location is far away from the main town, the staff are young and inexperienced, the food is horrible, the drinks are expensive. We booked a double room, to be told when we arrived that they had double-booked so we were told to share with another 2 people on 2 bunk beds. Luckily we fought our way out of it, but others in our group suffered this fate. DON'T STAY HERE!", "title": "Don't stay here", "helpfulness": 3, "user": "paulene_tavani", "date": "August 1, 2006", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "location": 1.0, "rooms": 1.0}, "id": 5536330}, {"rating": 1.0, "stay_parameters": "Stayed September 2005", "text": "This \"all-inclusive\" resort was recommended to my husband and me by a travel agent for part of our honeymoon. Our experience was terrible from the moment we arrived at Mykonos. We had to wait for someone from the resort to pick us up from the ferry station for over an hour. Our room had a nice view, but we had to walk about 1/4 mile up-hill to get our suitcases there. The fridge had leaked all over the floor, and our bed consisted of 2 twin beds pushed together -- they were hard as rocks... not even close to what I would expect for a honeymoon. Our room was crawling with ants the whole time we were there. This alleged all-inclusive resort is a farce! They only feed you breakfast and dinner; you're on your own for lunch, and the food is sleep-away camp, cafeteria quality. You have to pay for every beverage you consume... even water! In three days, my husband and I racked up a $50 charge just for water and diet coke (we didn't drink alcohol because the prices were so unreasonably high). The resort was completely isolated from the rest of the island, and you had to take a 1/2 hour bus ride just to see civilization. The pool (which is salt water, by the way) was freezing, the beach had rocks, rather than sand, and all of the un-included activities were over-priced. The first day we were there, my digital camera was stolen, and it had all of our honeymoon pictures on it. There is a \"rec room\" with a TV and pool tables in it, but it closes at 9:00 pm, for some reason, and they WILL kick you out. You have to pay by the hour to use their slow internet service. Finally, most of the other guests there are late adolescent Australian kids, so the feeling of Greek culture is completely lost! We were charged over $800 for a 3-night stay, which was completely not worth it. The management of the \"resort\" seems to be run by complete amateurs, and there was absolutely nothing special or elegant about it. All in all, it was truly pathetic, and we could have completely skipped over this part of the homeymoon with no regrets.", "title": "If you like sleepaway camp, you'll like this \"resort\"", "helpfulness": 25, "user": "Weawuzz", "date": "September 25, 2005", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "rooms": 2.0, "service": 2.0}, "id": 3937644}, {"rating": 5.0, "stay_parameters": "Stayed August 2005", "text": "Contiki is definitely fun. Make sure you go to the jet ski hut at Kalafatis Beach and ask for Dimos! He is the best!", "title": "Look for jet ski instructor Dimos!!!", "helpfulness": 2, "user": "caligirl123", "date": "August 21, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3793331}, {"rating": 1.0, "stay_parameters": "Stayed August 2005", "text": "A bunch of us went to this resort expecting a good time, good partying, lots of young people and we were very disapointed. For the most part the staff was aweful. They messed up our room keys numerous times so we had to keep going down to the office to get them fixed. We never got new towels. There was vomit outside our door that we had to clean up, drinks were overpriced and there really was not much going on at all. The resort was not crowded and very boring. The rooms were just ok. Don't pay for water view because you are too far away from the water to enjoy it. It is a few hundered meters across the street and everything. There is also a huge barrier between the Contiki workers and the hotel employees so it is hard to get anything straightened out. I would NEVER stay here again. You are better off staying at an actual Greek resort, not one ran by a huge corporation that could care less about unhappy travelers.", "title": "Dont stay here! Horrible", "helpfulness": 17, "user": "wgj2222", "date": "August 7, 2005", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "rooms": 2.0, "service": 1.0}, "id": 3743026}], "location": {"country": "Greece", "continent": "Europe"}, "stars": 3, "variance": {"poor": 19, "average": 37, "very good": 43, "terrible": 22, "excellent": 62}, "aka": "Aphrodite Beach Hotel", "slim_ranking": 0.7}