{"user_rating": 4.5, "review_count": 112, "name": "Apollo Bay Eco YHA", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled solo", "text": "Stayed one night here whilst I was touring the great ocean road, never stayed at a youth hostel before but this is no ordinary yha, very clean and modern decor - lovely clean kitchen, lounge, tv room and computer room. Shared a room with 2 bunk beds, but only one other person shared my room that evening. Clean showers and bathrooms, very helpful and friendly owners. Would highly recommend for a cheap (£25) night's accommodation, and not just for 'youth's' there was a huge range of ages and people there.", "title": "Changed my opinion of youth hostels!", "helpfulness": 1, "user": "chocolate27", "date": "March 28, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 101847194}, {"rating": 3.0, "stay_parameters": "Stayed August 2010, traveled solo", "text": "I stayed here by myself last year and was quite impressed with the overall cleanliness of the hostel. Its brand new, modern and feels like a big contemporary holiday home. Before you read more into this review, please consider that I came in the winter and thats why I am trying to alert people who come to hostel in the winter and cooler months of the year. If you are a summer traveller, please disregard my rants on heating etc. Generally, I had a pleasant stay. The hostel is quiet and peaceful. There are many rest areas where you can escape and read a book/watch tv etc. The couches and living areas/kitchens are all emaculate. The only problem I had with this hostel was that it was too cold !! The overall sealing and insulation of this building to the elements is also questionable as I could feel an overall draft in the building. The rooms are huge and I guess part of the reason it is cold is due to the air that needs to heat, which I can imagine would be a huge expense for a hostel to pay for. I opted to stay in a single room for the night, thinking that maybe I would receive more amenities in terms of heating and other extras. The room again was clean, no dust and I was reasonably happy. Problems were the light fittings which were extremely dim (due to environmental offset targets). Also I didnt like the use of concrete in all rooms as it felt slightly surgical having nothing but grey concrete brick everywhere. Sure, it is the \"contemporary\" style that they are after but when it comes to general comfort and warmth I think that the customer comes first? ..... if I can \"beg\" to ask that? ... also getting back to the heat the wall heaters were not good enough. I woke up sneezing and felt that more could be done to either insulate the building properly or create more options for heating. Why should travellers be subjected to sickness in the name of meeting environmental targets? That is a question that I want answered. Sure, the environment does come first but is saving every ounce of electricity in exchanged for cold, tired and weary travellers a \"sustainable\" thing to do? I am sure that I wasted more environmental deficits on the amount of tissues that I used in exchange for the megawatts of electricity used to heat the room. Please take a moment to think about this and re-justify the \"sustainable\" pursuits that the hostel is trying to achieve. May sound ridiculous to you but try to imagine all the trees being cut down in exchange for your policitcally correct environmental best practices. The IT and TV room were my favourites. THe kitchen, while brand new and modern seemed to cater for the masses. I am sure that groups would love this hotel as there is just so much space, almost too much space and that leaves me feeling well .... rather cold and in need of a comfortable warm stay !!!!!!", "title": "Modern, contemporary .... but cold !!", "helpfulness": 1, "user": "Tony_au77", "date": "March 1, 2011", "detail_rating": {"service": 1.0, "cleanliness": 5.0, "value": 2.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 98598755}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "Not being a habitual \"hosteller\" I was lulled into a false sense of security with this place! It defied all my preconceived ideas about what a hostel would be like. Although it is new, the caretaker was visible and busy making sure everything was right. The kitchen was spotless and had an abundance of equipement and utensils. We loved the idea of being able to pick the herbs. The only thing that would have made my stay more comfortable here would have been an en-suite which we felt it could so easily have done. Having said that the communal showers were very clean and well maintained.", "title": "Set the standard that others couldn't follow!", "user": "Riever", "date": "February 17, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 96971585}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "Partner and I decided to visit the water falls at Apollo bay, I booked online and call the YHA to arrange for a late check-in, the manager was very helpful in orgazing that for us. He also gave us good advise on what to see in the area. There are tons of info/pamphlet/flyer about the local area at the reception + info booklet in your rooms.", "title": "You'll wish your home was like this place.", "user": "cherrywitfang", "date": "February 10, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 96191367}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "We had a two single bed room facing the garden. It was a basic room, clean and comfortable, we had shared bathrooms.", "title": "One of the best youth hostels I've been to", "user": "EsJayUK", "date": "January 19, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 93787751}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "Eco beach YHA is undoubtedly one of the best hostels is Australia. The owners are friendly, the rooms are spacious, the toilets and showers were really clean, and even better, they have two lounge areas, one with a log burning fire and games! We had a brilliant stay and wished we were staying longer than just the one night - we could have stayed all week! The kitchens were really clean and so well equipped, and if the sun had come out we would definitely have had a bbq on the terrace. To me, this place is the equivalent of a really nice hotel, but more down to earth and friendly, and GREAT value for money.", "title": "The best hostel EVER!", "helpfulness": 1, "user": "jennalou25", "date": "June 12, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 112897153}, {"rating": 5.0, "stay_parameters": "Stayed April 2011", "text": "This was our third stay at the Eco-Hostel, and each time has been fantastic. The location is perfect, and not just because it's in one of the most picturesque bays in Victoria - the hostel itself is just 2 minutes from the restaurants and shops, and 5 minutes from the stunning beach.", "title": "A YHA with the X Factor!", "helpfulness": 4, "user": "BradWhatmough", "date": "May 21, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 109252091}, {"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "The hostel itself is stunning, a beautifully designed and welcoming retreat that defies its status as a hostel. It's lounge features a log fire, a TV room with bean bags, fully equipped kitchens with bbqs, a roof top balcony with views, and modern rooms and bathrooms. Even the outside landscaping matches the bayside location perfectly. It also comes with the friendliest management you will ever meet.", "title": "Probably the best hostel you're ever likely to find", "helpfulness": 1, "user": "Br0sie", "date": "April 21, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 104950248}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "Of course, you have to remember it's still a hostel, so rooms are basic, and you share bathrooms, but that is why it costs just $80 for a double.", "title": "Brilliant hostel", "helpfulness": 1, "user": "Joseph_Pike", "date": "April 8, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 103273808}, {"rating": 5.0, "stay_parameters": "Stayed March 2011", "text": "Ask for a room with a balcony if there is one, much better, and make sure you visit the Cape Otway lighthouse. The lighthouse itself is good fun, with a really top quality cafe, but the route down is even more spectacular. You will drive through forest with dozing Koala's all above you! If you stop at the campsite halfway down you will also get close and personal with them, and there is a. Breathtaking walking path down to stattion beach. Enjoy, we will be back!", "title": "Wow wow wow", "helpfulness": 1, "user": "Snibbug", "date": "April 1, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 102400846}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "This is a 5* hostel. Cosy, warm and spotless. After a long day of walking we had a heater in the room, a log fire and large sofas to relax on and even Jack Johnson playing in the showers! There was a TV showing the world cup. Staff were friendly and helpful. There was a mix of guests, a lot of older Australian travelers who knew this was the best place to stay on the GOR. No noise at night.. I could go on and on. You wouldn't get more from a hotel. Highly recommend it and we will definitely be back for a weekend away.", "title": "Best Australian Hostel that we've stayed in", "user": "Rhian T", "date": "October 12, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 119208731}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled solo", "text": "A truly beautiful hostel, very clean and really nicely decorated. Bright and sunny rooms, friendly staff. Excellent kitchen and facilities", "title": "Amazing!", "user": "SouthwestRach", "date": "August 30, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117448227}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "I absolutely loved this place and could have stayed here a lot longer than we did.", "title": "BEST HOSTEL IN OZ!!!!", "helpfulness": 1, "user": "kathg", "date": "August 30, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 117446225}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled with friends", "text": "We stayed in the shared rooms which were great and you didnt really notice the other people there.", "title": "We loved it and we'll be back - best hostel we have ever seen!", "user": "Sandra M", "date": "August 14, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116727899}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "The communal facilities are 5 star with 2 huge kitchens and a nice living room. There's also a lovely roof top terrace and a nice comfy tv room.", "title": "The best hostel I've stayed at by far", "helpfulness": 1, "user": "Ristari", "date": "August 2, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 4.0, "service": 4.0}, "id": 116143296}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled solo", "text": "Along with the Brisbane YHA, I would say this is one of the best hostels in Australia. Super clean, new, comfortable, and with many little touches more often found in hotels than hostels. Gilbert is friendly and helpful and the common areas are excellent. There's even a free herb garden out the front for use in your cooking! Eco-friendly as well! It just doesn't get any better, and only $30 a night for a dorm if you are a YHA member. The location is just one street north of the main street in town, and close to everything you need.", "title": "Amazing!!", "user": "lovebeachtravel", "date": "January 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 122864403}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled with friends", "text": "We stayed for a 2 night break in a private twin room. We loved everything about this hostel. The location is perfect, not too close to the main strip but close enough. The rooms, communal areas, kitchen and bathrooms were spotless and had everything you needed. They have parking, laundry facilities, tv/dvd room and plenty of board games to keep you occupied on an evening. It was the most relaxed hostel I have ever been to and more about chilling with a nice bottle of vino than raving till the small hours! Perfect in every way and I would book it again when I fancy a trip to the Great Ocean Rd. Ps. The Thai place across from the hostel is superb!", "title": "Fantastic Hostel", "user": "SharenScott", "date": "January 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 122789636}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled with friends", "text": "I thought that the Halls Gap Eco-Hostel was about as good as it gets, only to find that this one lifted the bar just a little higher.", "title": "Outstanding", "user": "KaleneAndy", "date": "December 29, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 122207106}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "A mate and I stayed here on our trip around the Grampians & Great Ocean Road, and it could barely be bettered. A very cheerful fellow efficiently checked people in and explained the facilities. He was also to pop up later, feeding the fire in the comfortable lounge throughout the evening - a very nice touch.", "title": "Great hostel", "user": "Amanda_and_Tyler", "date": "November 6, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 120216529}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "The rooftop deck was a nice extra, and the well-equipped kitchen was just what was needed. Our room was a decent size, and the fold-out table was a smart idea.", "title": "Best hostel we've ever stayed in!", "user": "Vickymakin79", "date": "October 15, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119318454}], "location": {"country": "Australia", "continent": "South Pacific"}, "variance": {"poor": 2, "average": 4, "very good": 23, "terrible": 0, "excellent": 83}, "aka": "Eco Beach Yha Hotel Apollo Bay", "slim_ranking": 0.125, "description": "Apollo Bay Eco YHA backpackers hostel is a must-stop location on the Great Ocean Road! Located between the Otway Rainforest and Loutit Bay, the hostel is the perfect base to explore nearby attractions including Loch Ard Gorge, Otway Fly Treetop Walk, London Bridge and the 12 Apostles.The architect designed Apollo Bay Eco YHA is Eco Certified Nature Tourism accredited, with solar electricity, rain water tanks, a worm farm, reverse fans and louvered windows all help reduce environmental impacts. Backpackers can feel free to pick home-grown herbs from the garden to spice up meals!Facilities include two cosy lounge rooms with wood fires, TV room and free DVDs, two stainless steel kitchens, open rooftop area with beautiful views plus two balconies. Additionally, there are laundry facilities, internet and luggage storage, plus separate sleeping and common areas ensuring sleeping guests are not disturbed.In Apollo Bay, swim in clear water, kayak to the local seal colony, attempt surfing lessons, experience deep sea fishing or explore the Great Ocean Walk. Sample local seafood in restaurants, sip coffee in the town’s cafés and spend an afternoon in local art galleries. Don’t miss the regular Saturday foreshore market! Head further into the Otways to see the glow worms at Melba Gully, elusive platypus at Lake Elizabeth and wild koalas at nearby Kennet River. Visit Cape Otway Lightstation to climb mainland Australia’s oldest lighthouse for panoramic ocean views! There are four share, doubles, twins and family rooms available. The hostel is also a Rent-a-YHA hostel and can be booked exclusively for large groups of up to 72 people."}