{"user_rating": 4.5, "review_count": 115, "name": "Applegate Inn", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed May 2006", "text": "If you are planning a trip to the Berkshires, the only choice for a B&B is the Applegate Inn. From the beautiful grounds to the most gracious hosts, this was an excellent experience for us.", "title": "Without a doubt, we will be back", "helpfulness": 2, "user": "Traveler2000_8", "date": "May 19, 2006", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 5.0, "service": 5.0}, "id": 5181865}, {"rating": 5.0, "stay_parameters": "Stayed January 2006", "text": "The room we stayed in was beautiful and tasetefully decorated. The afternoon wine and cheese session as well as the breakfast were great opportunities to meet with other guests as well as the innkeepers, not to mention the food was excellent as well.", "title": "Perfect Stay", "helpfulness": 3, "user": "Erin_Maloney", "date": "March 12, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 4.0}, "id": 4602623}, {"rating": 5.0, "title": "Our first stay will not be our last!", "text": "I just can't say enough about this inn.", "helpfulness": 13, "user": "A TripAdvisor user", "date": "November 25, 2005", "id": 4143312}, {"rating": 5.0, "stay_parameters": "Stayed April 2005", "text": "I highly recommend you give it a try. You will not be disappointed.", "title": "A top-notch experience!", "helpfulness": 6, "user": "Dervish38", "date": "July 19, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3681934}, {"rating": 5.0, "stay_parameters": "Stayed June 2005", "text": "We stayed at the Applegate for a ski 4-day weekend. We ski in the Berkshires every winter, but this was our first Applegate stay. The entire weekend exceeded our expectations. Our room (7, I think) was beautiful, very clean, and had every amenity. The room had a wooded/garden view - breathtaking in the winter snow and I am sure just as special in the summer. The bathroom, and room for that matter, seemed new - double-headed shower and clawfoot tub in-room. Remote controlled fireplace, comfy loveseat, minibar, dark chocolate, brandy and balcony rounded out the list of amenities. We are very picky and pretty tough to please, and I can't think of a thing that was missing here. We highly recommend the Norman Rockwell museum and Jiminy Peak. (Previously, we have always stayed at the Orchards Hotel in Williamstown. It is lovely, and was once a perfect retreat. It has now fallen into disrepair and is overrun with children.) The Applegate is in a completely different league - peaceful, immaculate, luxurious.", "title": "Berkshire's Best Inn", "helpfulness": 4, "user": "RJS&Gale", "date": "June 26, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 3612837}, {"rating": 5.0, "stay_parameters": "Stayed November 2004", "text": "My boyfriend and I stayed here for Veteran's Day weekend last year and it was absolutely perfect! Applegate was so warm and cozy. It was our first stay at a bed and breakfast and they made us feel right at home. They have candies and freshly baked cookies around the house and if the weather is right a fire burning in the living room at night. They also have wine and cheese in the living room early in the evening and upon arrival you will find chocolate and brandy waiting for you in your room. Pam was awesome and so helpful in selecting restaurants for dinner. (There are many excellent choices in the area.) We went to Lenox for massages and the Lee outlets aren't too far away. The nearby Lion's Den downstairs at the Red Lion Inn has live music on most nights. This is the place to go if you are just looking for a romantic place to go to get away from it all!! They pay attention to every little detail. You cannot loose!", "title": "Absolutely Perfect!!", "helpfulness": 3, "user": "travelingirl81", "date": "June 4, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 3528154}, {"rating": 2.0, "title": "Not What it was Cracked Up to Be", "text": "My husband and I arrived after a grueling, very windy highway trip to Applegate at around 5:00 p.m. The driveway is very, very narrow to the front door. I opted to stay in the car until we were checked in. Upon entering the Inn, my husband was asked to retrieve me, as the innkeeper wanted to show us around. I came in, and was informed immediately that some guests prefer to take their shoes off upon entering. Len had his on, so we followed his lead. Then the fun began. Upon entering the most expensive suite in this Inn, my eyes went right to the carpet where there was a dark, round large stain. The room was set at 63 degrees, and Len wanted to know if we wanted any heat! The bed was sloppily made. Next, my eyes traveled to the desk, where a very noticeable notice was sitting, encouraging guests to tip the staff AT LEAST $5.00 a day, more if you were thrilled with their housekeeping. We woke up the next morning, went to breakfast, (where hard boiled eggs meant just that, hard), returned to our room, and found the bed was made....that's all. That's housekeeping, for $5.extra dollars a day? The room itself was $250, so perhaps making a bed should be part of that charge.Used glassware was not cleaned, coffee made in a pot with a broken lid was still there (there were no cups or stirrers or powdered cream to go with that little pot of coffee in the morning). If you leave your room at 7:00 a.m. to go downstairs for some coffee, wear your slippers and best flannels, and a bathrobe...it was freezing. And I'm from New England. This review is not to say we did not enjoy Len and Gloria...just that we have stayed in many, many B&B's, and felt pampered, not disappointed at what we were getting for the high end rate at Applegate, in Lee, MA.", "helpfulness": 4, "user": "EVEO", "date": "February 26, 2007", "id": 6840778}, {"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled with family", "text": "Loved our stay at the Applegate Inn. If you are looking for a quiet place to relax, enjoy a delicious breakfast, snacks, wine and cheese fireside look no further. The rooms are also well appointed with luxury bed linens and fireplaces. Thank you for a wonderful weekend, Pam.", "title": "Wonderful Retreat", "helpfulness": 1, "user": "chrissypt", "date": "February 18, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6809010}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "My husband and I wanted to get away for the weekend and thanks to the reviews on Tripadvisor, we booked the Applegate Inn. We stayed just before Christmas and had a wonderful time. The Inn was perfect in every way. Len and Gloria are terrific hosts and make you feel welcome the minute you walk in the door. We will definitely be back!", "title": "Just what we were looking for", "user": "maggieb0425", "date": "December 29, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 6517191, "likes": {"liked": "— The hosts; cleanliness", "disliked": "— we were located just above the stairs"}}, {"rating": 5.0, "title": "The best in the area - perfect!!", "text": "I simply cannot say enough good things about Len & Gloria, and their beautiful inn. I contacted them at the last minute due to being unhappy elsewhere, and as it was a weeknight , I got a great room. Even though I stayed for only 1 night, they went out of their way to help me, even getting up early and serving breakfast for me early so I could catch my flight. The inn itself is absolutely amazing, and comes equal place with my other favorite place in the country. I stayed in October, during the gorgeous fall, and their property is ablzae with breathtaking color!But most of all, I was impressed with how warm and genuine Len & Gloria are, how they seem to actually enjoy meeting their guests and ensuring that every comfort is taken care of - you will find out when you settle into your room, and realize that everything you could want has been anticipated and provided. The best bed I have slept in all year (and I have accrued about 50 hotel nights to date in 2006). Based on the websites I thought this would be the best place to stay in this area, but was reluctant to book because Lee semed a bit out of the action. Now that I know the area, Lee is 3 minutes from Lenox and no problem at all. You will not be missing anything you can't get to in 3 minutes flat. Thanks Len & Gloria!!", "user": "twoworlds", "date": "December 17, 2006", "id": 6452641}, {"rating": 5.0, "stay_parameters": "Stayed April 2006", "text": "We stayed here midweek during April and had a fabulous time. The Inn is lovely and as others have said, it is extremely comfortable. Accommodations and food are top shelf. The grounds are well kept and the hosts are just so nice. Our only regret is that we didn't golf at the course across the street. We would definitely stay here again. Loved it!!", "title": "Wonderful, wonderful Applegate Inn!", "helpfulness": 1, "user": "bharrin", "date": "July 5, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 5429592}, {"rating": 2.0, "title": "Something lacking", "text": "The greeting on arrival was not the most convivial & obviously the people who rate this 5 are not fussy about their bed linen being fully laundered. When we arrived & my wife pulled back the covers the sheets were very creased & looked as if they had been slept in. When we brought this to the attention of the girl on reception she advised us that they never ironed the sheets but did offer to change them.The replacements, tho' still unironed, did look better. I have never stayed anywhere - good,bad or indifferent where the bed linen did not have the appearance of having been ironed. The owner later assured me that the bedding had been fresh & that they did infact iron the topsheet ( you would never have guessed) & that the room was cleared out after each guest. This did not really explain the half eaten bag of crisps we later found in a cupboard of the half drunk bottle of water in the fridge. If traffic noise is a problem for you don't book a room at the rear . You will hear noise from the adjacent roads & also the I90 Interstate.It didn't bother us overmuch & I have to say, the foregoing apart ,the room was very comfortable & quiet.", "user": "Scallywag", "date": "November 2, 2007", "id": 10529190}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "When you stay at an inn versus a commercial hotel chain, you always wonder if you are going to get the same service or alternatively will the innkeepers want to become your best friends. Well let me tell you, we just got home from a one night stay at the Applegate Inn and they did everything right. The perfect balance of hospitality and respect for privacy. These folks love what they do and it shows. The building is old enough to be charming but not decrepit like some. Tastefully decorated Colonial not silk-flowered-to-death like some Victorian style inns. Clean comfy bed, expensive sheets, charming fireplace, complimentary cognac, chocolates, and bathrobes in the room, and the most lovely breakfast you could ever want. They never seemed harried like so many innkeepers we've met. Consumate professionals, warm and accomodating. We will go back for sure. Wonderful, relaxing, beautiful and worth every cent!", "title": "They did everything right!", "helpfulness": 1, "user": "MLFMarshfield", "date": "May 19, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7646320, "likes": {"liked": "— really comfortable, slept great and was very relaxing", "disliked": "— it was too early in the season to use the beautiful pool, we'll have to come back!"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "My husband and I just stayed at the Applegate for the second time. Both times we stayed in Room 10, which is in the Carriage House. The room is spacious, impecably clean and lovely. It has all the modern conveniences (from a large tv--hidden by a picture -- over the remote-controlled gas fireplace, to a large jacuzzi tub) while still feeling like a quaint inn. The property is in a beautiful, serene setting, yet close enough to anything you need. Breakfast is home-cooked and delicious. Gloria and Len, the innkeepers, are warm and helpful without interfering. From the chocolates and brandy in the room to the well stocked \"guest pantry\" to the cheese and crackers in the main house in the evening, they've thought of everything. This is a beauiful, restful retreat.", "title": "Applegate is Wonderful", "helpfulness": 1, "user": "Darcy'smom", "date": "May 9, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 7572408}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled solo", "text": "I recently enjoyed a wonderful weekend at this beautiful inn. Applegate has many special touches that truly make it stand out as a top-notch Bed & Breakfast. My room, which was beautifully decorated with a comfortable queen sized bed, had several windows which made it bright and airy. There was a CD player with several classical music CD's (and I enjoyed listening to every one!), a gas fireplace, a luxurious bathrobe, a candle with matches, and a crystal decanter of brandy on the dresser along with fine chocolates. There were also two reading lights over the bed, which is a rare and very thoughtful consideration. Every afternoon at 5, the owners offer wine and cheese in the living room. Most of the guests come to this, which is a great way to meet everyone, discuss where to go for dinner, and get suggestions on what to do in the area. The owners also provide a well-prepared list of restaurants and local attractions, along with maps of the area. Breakfast in the dining room is lively, especially where you have already met your fellow inn guests the afternoon before! There are varied and delicious offerings of both hot and cold food served at the ample breakfast - you won't go away hungry! My favorites were the baked apple, cinnamon raisin stuffed french toast, and the spinach squares. I also noticed that the friendly staff accomodated each and every special request made by a guest. I highly recommend Applegate Inn and look forward to staying there again!", "title": "A fabulous, luxurious inn!", "helpfulness": 1, "user": "barbieann5", "date": "May 8, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7565433, "likes": {"liked": "— The many nice touches in the room and the inn", "disliked": "— Nothing!"}}, {"rating": 2.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "We stayed at a slow time for the inn. It was very well appointed, the bed was quite comfortable. The breakfasts were always very well done. The shower at times was barely luke-warm and when it became hot it took close to ten minutes.", "title": "Breakfast was very good, but...", "helpfulness": 3, "user": "jdlieberman", "date": "March 11, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 2.0, "cleanliness": 3.0, "value": 2.0, "location": 4.0, "rooms": 3.0}, "id": 7012131, "likes": {"liked": "— Breakfast", "disliked": "— Price"}}], "location": {"country": "United States"}, "variance": {"poor": 6, "average": 0, "very good": 15, "terrible": 0, "excellent": 94}, "slim_ranking": 0.555555555556, "description": "Welcome to Applegate Inn located in the Berkshires region of Massachusetts. Applegate has a unique location - a country estate, near horse farms, with only a half mile walk to downtown Lee."}