{"user_rating": 4.0, "review_count": 477, "name": "Aquabella Hotel", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "My husband and I stayed at the Aquabella over the 2009/ 2010 new year period. The hotel is located close to the centre of town, it would be at most a 10min walk from the main street. Parking is located nearby in a public car park, but as we found out if you have a nice car they will offer your free parking out the front. Unfortunately for us our car was not deemed to be nice enough!", "title": "Its a little bit meh", "helpfulness": 1, "user": "T-A-UK", "date": "January 12, 2010", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "location": 3.0, "service": 1.0, "rooms": 3.0}, "id": 53325826}, {"rating": 5.0, "title": "Loved the pool", "text": "The rooms were tired and need a facelift, in fact when we sat on one of the chairs in the arms fell off! The rooms were large, quiet and did have a good view over the town. Breakfast and dinner was over priced and pretty average. Unfortunately the staff seemed reluctant to help us find places in town to eat or reccomend sites to visit. The spa wasn't open while we were there so I can't comment on what it is like.", "user": "D0ugs", "date": "January 8, 2010", "id": 52976450}, {"rating": 4.0, "stay_parameters": "Stayed October 2009", "text": "The pool area really makes this hotel, set in the old roman walls and whilst we were there is was 30oC, so that is where we spent most of our time. Rooms were comfortable and the food we had in the restaurant by the pool was good.", "title": "My Favorite Hotel in Aix-en-Provence", "user": "AlaskanG", "date": "November 19, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 4.0, "service": 3.0, "rooms": 4.0}, "id": 49537050}, {"rating": 3.0, "stay_parameters": "Stayed October 2009, traveled on business", "text": "We didn't book any spa treatments in advance and there were very few treatments available on the day, so book before you arrive. Also don't leave any valuables in the carpark, we had our bikes with a number of locks on stolen from the roof of our car.", "title": "Corporate hotel, a bit overpriced, can be noisy", "user": "Zzzzzzzzzzz_77", "date": "October 22, 2009", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 4.0, "service": 4.0, "rooms": 3.0}, "id": 47511536}, {"rating": 4.0, "stay_parameters": "Stayed September 2009", "text": "I used 1800Hotels to make my reservations for this visit. Stay away from this service. They promised a refund of a foreign exchange fee and after three correspondences have still not refunded it. I paid the flex fee and were no help when I needed to make changes in my reservations.", "title": "Nice place to relax after a long day of touring", "user": "amccutcheon", "date": "September 24, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 44259712}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "i'll keep this brief.", "title": "nice hotel... shame about the noise", "user": "JA1966", "date": "September 19, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 2.0, "service": 3.0, "rooms": 4.0}, "id": 42826157}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "the hotel, room, reception service and spa were all great - i cannot fault them. however, two things let this place down - both of which happen to be very important to us:", "title": "very high standard", "helpfulness": 1, "user": "eurotrippers", "date": "September 15, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 41920652}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "1. the breakfast was really quite disorganised and it seemed to be impossible to get COLD milk to put on cereal.", "title": "Great value & peace and quiet", "helpfulness": 1, "user": "arbroath55", "date": "September 2, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 39571692}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "2. the hotel is located centrally, next door to a pub called the 'wohoo bar'. it also has a long rear wall adjacent to a road with a sheltered area beneath the room windows. unfortunately, almost every night we were there, several drunks/down-and-outs and pub clients decided to take shelter beside the hotel wall and make loads of noise until the early hours (4am on one occasion). for this reason alone, we would not stay at the aquabella again. i suspect that the rooms which face into the hotel garden are quieter, but i don't know this for sure.", "title": "Wow!!!", "user": "ravshaz", "date": "August 24, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 38646936}, {"rating": 3.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "by the way, AIX is fantastic and we will be back there again soon..... alas not at the aquabella.", "title": "expensive for average hotel", "helpfulness": 1, "user": "fernette", "date": "August 23, 2009", "detail_rating": {"cleanliness": 5.0, "value": 2.0, "location": 4.0, "service": 3.0, "rooms": 3.0}, "id": 38588371}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "We stayed here for a week in August 2009. The rooms are typical 3 * standard, clean, tidy and fresh which was all we needed and expected. The staff were always polite, friendly and helpful- which made us feel all the more welcome and relaxed. The pool was excellent- a great place to relax with very good pool side service. The hotel although looked quite worn from the outside, has a nice modern, reception, clean basic good sized rooms, a fantastic looking spa (although we never used it), a nice restaurant (though expensive) and lovely small gardens. It is just a 5 minute walk into the town, the shops, restaurants and bars - far enough not to be in the thick of any crowds but near enough for an easy stroll. The only small thing that we would have liked was a balcony- we had double doors opening out but no balcony- otherwise we would rate our stay as excellent- you could not ask better from a 3*hotel.", "title": "great 3* hotel, wonderfully relaxing holiday and very friendly people.", "helpfulness": 1, "user": "BrightonSarahw", "date": "August 21, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 3.0}, "id": 38321243}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "This is a real gem! We stayed here for two days in July and could highly recommend it for anyone interested in seeing this beautiful city while having a really nice hotel, complete with pool and spa, only a ten minute stroll from the town centre. The staff could not be more helpful, and the food in \"The Orangerie\" worth checking out. I would also highly recommend having one of the wonderful salads in SplenDid in the town centre also ... quite amazing!", "title": "Lovely Hotel, Highly Recommended", "user": "Finghin", "date": "August 19, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 38118728}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "My partner and I have just returned from a four night stay at the Hotel Aquabella and had a lovely time. The best feature of this hotel by far is the beautiful swimming pool enclosed by the original Roman wall and tower. With temperatures soaring to the mid 30s our days were spent lazing beside the pool and taking the occasional dip when we got too hot! It was absolute bliss! We were looking for a relaxing break with endless sunshine and cloudless blue skies and that's what we got!", "title": "Very relaxing stay at Aquabella", "user": "Miranda S", "date": "August 18, 2009", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 38018512}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "The hotel itself is ideally situated within the centre of Aix and is a 5-10 minute walk to both the old and new quarters. There are so many cafes/restaurants to choose from, all offering a wide selection of food. We found a stylish little brasserie style restaurant in the modern commercial part of Aix - Les Allees Provencales on Avenue Giuseppe Verdi called Le Darius (named after Darius Milhaud - the French Jazz composer whose family were from Aix). The food especially the desserts was delicious and the staff friendly and helpful as I struggled to recall my A Level French! We also ate at a few of the bustly more touristy cafes in the old quarter along Cours Mirabeau but found the food tastier and better value at Le Darius.", "title": "Great location and fab pool", "user": "EboracumYork", "date": "August 8, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 37037183}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled with friends", "text": "If like me you love a bit of retail therapy then again head straight to Les Allees Provencales past La Rotonde and the dancing fountains where you'll find both high street stores and designer boutiques. For those of you with a sweet tooth I recommend La Cure Gourmande - an olde worlde style sweet/biscuit/chocolate shop. If modern Aix is not for you, then stick to the narrow Provencal streets of historic old Aix where you’ll find a plethora of fashion boutiques, cafes, pharmacies, ice cream vendors and corner style shops. Word of warning though Aix is NOT cheap so take plenty of cash!", "title": "Great hotel with excellent location", "user": "kv_wood", "date": "August 6, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 36860122}, {"rating": 3.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "The best things about this hotel would have to be the huge outdoor pool, the spa, sauna, hammam, and gym. We spent our mornings lying around the pool and would then head out to explore the town in the afternoons. The hotel is great if that's what you're looking to do.", "title": "Great pool but rooms need updating", "user": "Ferbent", "date": "August 1, 2009", "detail_rating": {"cleanliness": 2.0, "value": 3.0, "location": 4.0, "service": 4.0, "rooms": 2.0}, "id": 36406247}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "The hotel is located close to restaurants, cafes, shops as well as the main sites.", "title": "Cool, clean, comfortable, great location", "user": "Ms_Moggy", "date": "July 14, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 34741823}, {"rating": 4.0, "stay_parameters": "Stayed March 2009, traveled on business", "text": "Unfortunately the rooms are not up to standard. They are dated and the bathroom was dirty and had a lot of mould. They need to be completed renovated.", "title": "Good quality for 3 stars level hotel", "user": "garry_to", "date": "July 12, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 34541914}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "While it was nice to have lunch by the pool in the hotel restaurant, the food wasn't very good and not worth the high prices.", "title": "Perfect stay in Aix-en-Provence!", "helpfulness": 1, "user": "hirondelle11", "date": "July 1, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 33674491}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "Thankfully we didn't spend a lot of time in the room so would still recommend this place if visiting in the summer.", "title": "Nice hotel with wonderful pool and fitness facility", "helpfulness": 1, "user": "LizSTL", "date": "June 25, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 33171163}], "location": {"country": "France", "region": "Provence", "continent": "Europe"}, "stars": 3, "variance": {"poor": 27, "average": 82, "very good": 216, "terrible": 9, "excellent": 143}, "aka": "Aquabella Hotel Aix En Provence", "slim_ranking": 0.176470588235}