{"user_rating": 4.5, "review_count": 244, "name": "AQUA DOME Hotel", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "We took a chance booking this hotel just based on the photos of the wacky outside thermal pools (like wine glasses) and some postive reviews on tripadvisor. It is a great hotel with a fabulous spa. The mere entrance tunnels are a work of art with blue lights or sparkly ones, giant artworks on the walks and calming therapeutic music. The outdoor pools are heated to a lovely warm temperature and are usuable all year. There are some rules on kids in the pool areas but generally they are allowed in almost all the pools and this makes a nice change from the non family friendly spas that seem to predominate.", "title": "Unusual but great hotel", "helpfulness": 2, "user": "sjwoolnough", "date": "September 1, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 8601520, "likes": {"liked": "— Spa", "disliked": "— Too busy"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled on business", "text": "Children are, however, not allowed in the Therme area where the steam and sauna rooms are. This is again a lovely area with its own private pool and relaxation room with running water ornaments throughout. Nudity seems to be the norm but anything goes.", "title": "Aqua Dome in Langenfeld in Tirol is excellent", "helpfulness": 3, "user": "Robinger", "date": "May 1, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7487213, "likes": {"liked": "— The wiev from the balcony and the great rooms.", "disliked": "— No Opinion"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled on business", "text": "The rooms were also great for families with interconnecting rooms with two bathrooms being easily available. These rooms were of a good size and nicely decorated with a welcome addition of a balcony to enjoy the stunning scenery outside.", "title": "worth visiting during the week, not on weekends", "helpfulness": 3, "user": "ECMY", "date": "November 11, 2006", "detail_rating": {"front_desk": 4.0, "service": 3.0, "business": 5.0, "cleanliness": 5.0, "rooms": 4.0, "location": 3.0}, "id": 6107336, "likes": {"liked": "— free soft drinks in room", "disliked": "— crowded sauna, naked people"}}, {"rating": 5.0, "title": "High quality, contemporary style, lovely hotel", "text": "We travel alot and tend to stay at 'higher' class hotels than this so were a little shocked by the lack of room service and the very limited dinner menu (we were on half board). Basically dinner was often an either or choice which could be tricky for fussy eaters. However the food was of excellent quality and several courses were included in the price. Breakfast was excellent too and the wine list suprisingly extensive.", "helpfulness": 5, "user": "MediagirlUk", "date": "June 16, 2006", "id": 5352772}, {"rating": 5.0, "title": "Aqua-dome Langenfeld", "text": "The main fault with staying here was how busy everything seemed. The public are not allowed access to the spa/pools till 10am and after 10am things became uncomfortably busy. The kids water slide had queues so long it was pointless going on it other than between 9 and 10am. It just ruined the lovely facilities by letting in too many people. This is obviously not unusual as there are 3 floors of sun loungers overlooking the indoor pool which kind of indicates that this is always a heavily used facility.", "helpfulness": 8, "user": "Westra25", "date": "February 26, 2006", "id": 4521718}], "location": {"country": "Austria", "region": "Austrian Alps", "continent": "Europe"}, "stars": 4.5, "variance": {"poor": 5, "average": 9, "very good": 54, "terrible": 3, "excellent": 173}, "aka": "Aqua Dome Langenfeld", "slim_ranking": 0.333333333333}