{"user_rating": 4.0, "review_count": 1090, "name": "Aqua Aloha Surf Waikiki", "reviews": [{"rating": 4.0, "title": "nice place for the dough!", "text": "the rooms are small, and the parking is a nightmare! But overall this is a nice place to stay.It's out of the way; but only 2 blocks to the beach.very good location. Good value.", "helpfulness": 9, "user": "A TripAdvisor user", "date": "May 18, 2005", "id": 3482277}, {"rating": 1.0, "title": "Wouldn't recommend", "text": "We stayed at the Aloha Surf for the last two days of our second honeymoon/25th anniversary trip. We walked in in the afternoon, and we were immediately greeted by an argument between a woman staying at the hotel, who was having problem with a key card, which evidently hadn't worked on three different occasions. She was livid, even threatening to \"jump back there and start tearing up that computer!\" The manager came out, and fixed her problem.", "helpfulness": 10, "user": "A TripAdvisor user", "date": "May 17, 2005", "id": 3479422}, {"rating": 4.0, "stay_parameters": "Stayed March 2007, traveled with friends", "text": "my stay in aqua aloha surf was super. i love the staff especially the housekeepers. they made my stay very comfortable. i would surely recommend to my friends.", "title": "Comfortable,Friendly", "helpfulness": 1, "user": "HawaiiTourist", "date": "March 30, 2007", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 7247385, "likes": {"liked": "— Food", "disliked": "— time"}}, {"rating": 5.0, "title": "Loved it!!!!!", "text": "P.s. Thank you aloha surf", "helpfulness": 2, "user": "honoluluangel", "date": "March 23, 2007", "id": 7203805}, {"rating": 5.0, "title": "Thank You Aloha Surf", "text": "My family and I stayed here for 3 days and we really enjoyed it. It is very clean and the staff was so friendly and hospitable;", "helpfulness": 2, "user": "drmarkeh", "date": "March 5, 2007", "id": 6919020}, {"rating": 4.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "Housekeepers are well trained and made sure we are well taken cared of specially Merlinda!!!You rock! Thank you for feeding us!!!", "title": "For the price I've paid, it is a good choice!", "helpfulness": 6, "user": "Lucky_happy", "date": "February 24, 2007", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 3.0, "rooms": 3.0}, "id": 6836147, "likes": {"liked": "— Price, location, breakfast", "disliked": "— street noise"}}, {"rating": 3.0, "stay_parameters": "Stayed December 2006, traveled with family", "text": "Aloha Surf is the BEST!!!!", "title": "Not good enough - there are better places for same price.", "helpfulness": 2, "user": "jjsc", "date": "January 4, 2007", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 2.0, "rooms": 2.0, "location": 4.0}, "id": 6553235}, {"rating": 5.0, "stay_parameters": "Stayed May 2005", "text": "the room was clean and the staff was helpful. if you are the type to hang out in your room or by the pool the whole time, then it's probably not for you. we found it to be great deal. simple continential breakfast consisting of crossaints, muffins, good coffee, juices, toast ect. all we needed ! the room has what you need clean bedding, shower, toilet, mini fridge, safe, tv. ect. price includes daily newspaper delivered to your door. the balcony wasn't that great. plastic chairs., and the view is of the apartments directly across., which can actually be quite amusing at night. we didnt use the pool though it looked clean and cared for. we didnt' use the parking garage. we parked next door at the food pantry. $14 a day or $7 half day. it was really convenient having a grocery store next door. everyone we came in contact with was nice. it was perfect for us. we get up and out early 7am and we're gone all day snorkeling, exploring ect. i think its perfect for couples or friends who like to be out and about. i would definitely return, it was a good time !", "title": "enjoyed our stay", "helpfulness": 12, "user": "ailinaaloha", "date": "May 26, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 3.0, "service": 4.0}, "id": 3501830}, {"rating": 3.0, "stay_parameters": "Stayed May 2005", "text": "Location, location, location...The Aqua Aloha Surf is just a stones throw away from everything. Although we spent quite a lot of money on an upgraded rental car we only used it twice in five days because it was so much easier (and nicer) to walk everywhere.", "title": "Its not the Wastoria People...but it was okay", "helpfulness": 8, "user": "Katelisdz", "date": "May 25, 2005", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 3.0, "service": 3.0}, "id": 3500062}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "This hotel was incredible. It has a microwave, fridge, balcony, free in-room safe and free in-room internet (ask for an ethernet cable). Coin laundry in basement ($1.25 each wash and dry). The elevators are fast, the location is convenient, and it's cheap. It was the perfect value. I ran into a guy who was staying at the Outrigger ($$$$!) and switched to this hotel because it offered a better value. It is absolutely close enough to the beach. We were lucky enough to get an ocean view. I estimate there are only 60 ocean view rooms in the entire hotel, so we were very lucky. We opted for the Superior room, a step up from the cheapest room, because it was larger and higher up. Complaints: Bed was not heavenly, but was plenty comfortable for me.", "title": "Great value", "helpfulness": 4, "user": "jelleric", "date": "June 8, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 7804068}, {"rating": 3.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "Maybe I was expecting more, but when I first arrived I couldn’t believe that this hotel was rated as high as it was. There were two main problems. First, the bathroom was like something out of the 50’s (and not in a cool retro way, but in an old decaying way.) Second, while the PROXIMITY to things like the beach, shops and the bus line is great, the LOCATION leaves something to be desired. The area is pretty run down, surrounded mostly by low end studio apartments with broken appliances and clothes hanging off the patios. Since I noticed those two things immediately upon check-in, my first impression was one of disappointment. I wouldn’t have rated it over a “2”.", "title": "Good value, Close In", "helpfulness": 5, "user": "glbtraveler", "date": "June 6, 2007", "detail_rating": {"front_desk": 2.0, "business": 4.0, "service": 2.0, "cleanliness": 3.0, "value": 3.0, "location": 3.0, "rooms": 3.0}, "id": 7790265, "likes": {"liked": "— Price", "disliked": "— Bathroom"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled solo", "text": "But I have to say that the positives grew on me and it gained a point or so after the first day. The room was clean and comfortable, the patio and small “kitchen” were convenient, the common areas were very nice and the closeness to activities was wonderful (I have stayed in the past at the Maile Sky Court, which has - or had – nice rooms but was so far away from everything that the walk was excruciating. Don’t be fooled, you will do that walk several times a day to come down to the beach or shops or restaurants.) I was also pleasantly surprised by how quiet it was. We never heard other guests or the traffic or construction noise that others have complained of.", "title": "Simple, but fine", "helpfulness": 2, "user": "Waterbid", "date": "May 26, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 3.0, "value": 4.0, "location": 4.0, "rooms": 3.0}, "id": 7701099, "likes": {"liked": "— price", "disliked": "— age of hotel and swimming pool"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled solo", "text": "So in the end I would have to say it was a good value for the money (we paid an average of $90 per night.) But don’t expect to want to hang out at the hotel much (either in the room or by the pool, which is small and stuck in between so many buildings that the sun never really hits it.) If you want more than a clean, comfortable place to sleep you will have to spend more money.", "title": "Great hotel for the money", "helpfulness": 5, "user": "rubhed", "date": "May 22, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 2.0, "rooms": 4.0}, "id": 7670167, "likes": {"liked": "— clean", "disliked": "— old"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled solo", "text": "Tip: Buy a few groceries like cereal and milk at the Food Pantry next to Perry’s Smorgy, it’s a full grocery store and cheaper than the ABC store on the corner.", "title": "Value For Money Stay", "helpfulness": 5, "user": "Jetstar(t)", "date": "May 20, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 7657027}, {"rating": 4.0, "stay_parameters": "Stayed December 2003", "text": "We got a good deal at this place and if you say you are honeymooning, you get an upgrade anywhere in Hawaii :)", "title": "Great deal - decent place", "helpfulness": 5, "user": "jokerji", "date": "February 16, 2006", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 4.0, "service": 3.0}, "id": 4463757}, {"rating": 5.0, "title": "Great hotel for the price!!! Don't hesitate booking here.", "text": "We got a room with a kitchenette on the 11th floor. We could hear garbage trucks pull up every morning, so if you are looking for a nice tranquil beachfront place, you are wrong. I was shocked at the parking rates and equally shocked at the measly breakfast. But this is Hawaii baby, everthing is expensive.", "helpfulness": 13, "user": "A TripAdvisor user", "date": "January 28, 2006", "id": 4392975}, {"rating": 1.0, "stay_parameters": "Stayed January 2006", "text": "Overall, the stay was pleasant. Free Kona coffee in the room was a plus..", "title": "Won't stay here again!", "helpfulness": 8, "user": "AlbertaGal44", "date": "January 21, 2006", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "rooms": 1.0, "service": 1.0}, "id": 4367509}, {"rating": 5.0, "title": "We'll be back!!", "text": "I'll keep it plain and simple. I took an impulsive trip to Oahu and stayed at the aloha surf from Jan 19-23 and I was pleasantly surprised. Most of the staff was extremely friendly especially this one guy at the front desk named Lance. I was on the seventh floor and I had a great view of the Ala Wai Canal and the houses on the mountain. The best part was walking around naked in my hotel room with a great view at hand. Now that's what I call fun. Newayz, the room was very well taken care of by the maids. Every afternoon, bed sheets would be folded, trash cans would be emptied, and towels would be replaced. The room itself included a tv with about 30 channels, an alarm clock, internet service for anyone who has a laptop, or for anyone stupid enough to bring their home computer, a coffee maker with coffee, a microwave, a hairdryer, and a large mirror in front of the bed for any exhibitionist out there. Every morning, complimentary breakfast was served which included muffins, juice and coffee. There were only two drawbacks to the hotel. #1 The toilet seat in my particular room looked like it had gone through world war 2 or as if a dog had chewed a chunk off the side. YUMMY! #2 I rented a car(almost a necessity if you plan on seeing other parts of oahu)and to park it for the day, i had to pay $15 dollars. Kind of a rip if you ask me. But all in all I think i got a bargain at the Aloha Surf. Hawaii freakin rawks!", "helpfulness": 17, "user": "A TripAdvisor user", "date": "December 30, 2005", "id": 4311264}, {"rating": 3.0, "title": "Better than I expected; not too shabby", "text": "I travelled with a friend and stayed at this hotel. We asked for two beds and got one bed and a pull out sofa bed. I'm only 5'4 and my feet hung over the edge of the bed. Also you could feel the springs digging into your back all night long. When we brought this up with the front desk clerk he shrugged his shoulders and said all two bed rooms in this hotel are like that. That's funny because I saw the maid in another room that had two beds not one bed and a pull out sofa. Breakfast was also a problem. We were to get a free continental breakfast each morning. Just fill out the card with the time slot you wish your breakfast to arrive at your room. We had to call every morning for our breakfast and twice one morning. When you have a tour bus to catch you can't afford to wait around for your breakfast. Finally the pool was only open for use once during our one week stay. So if you are wanting a pool I don't suggest booking here.", "helpfulness": 10, "user": "A TripAdvisor user", "date": "December 29, 2005", "id": 4310501}, {"rating": 3.0, "stay_parameters": "Stayed May 2006", "text": "Great rates, the rooms are clean and the staff is friendly. The pool is nice - smallish but the loungers are comfortable. The continental breakfast could have been a little more substantial (eg more then 1 muffin and a juice), and the rooms were a bit small (no bathtub - just shower) ... overall I would stay there again but pay the few extra dollars for the upgraded room on a higher floor with a balcony.", "title": "Perfect for the Price", "helpfulness": 6, "user": "Lexiee", "date": "May 23, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 2.0, "service": 3.0}, "id": 5205216}, {"rating": 2.0, "stay_parameters": "Stayed February 2006", "text": "Hotel is quite nice for the price.", "title": "Needs Better Privacy", "helpfulness": 9, "user": "davsyd", "date": "February 26, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 2.0}, "id": 4520349}, {"rating": 5.0, "stay_parameters": "Stayed November 2005", "text": "We were looking for a budget hotel that was clean and this place exceeded our expectations. The room (6th floor) was completely renovated, new furniture, carpeting,a/c, fridge, M/W, coffeemaker, and very expensive bronze art on the wall. At first, I was only hopeful that we wouldn't have the problems that other guests experienced, but this place was delightful. We called a week earlier for a non-smoking room and got an answering machine oh-oh, so called the booking agent, Travelocity, who called for us to ensure a non-smoking room. Within two hours, the manager also called us back to ensure our non-smoking room.", "title": "Don't be afraid of this hotel", "helpfulness": 12, "user": "capndrake", "date": "November 19, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 4127447}, {"rating": 1.0, "title": "Would Never stay here again…", "text": "If you want large rooms, good restaurants, security police, go to the Hilton and pay three times the rate. If you don't want to see cockroaches and hookers, stay away from Waikiki. I never saw a roach, but you've got to wade through the hookers to get back to any hotel in Waikiki, and as the night gets late, say after 10 pm, their pimps force them to accost any male. This hotel is one block off the main drag, Kuhio, so they don't hang around here, but once you get up to Kuhio around King's Village, watch out.", "helpfulness": 9, "user": "A TripAdvisor user", "date": "October 4, 2005", "id": 3991803}, {"rating": 5.0, "stay_parameters": "Stayed May 2005", "text": "Other plusses--1 block from only supermarket in Waikiki, 1 block from ABC store but everything is, short walk to main Waikiki beach, Intl Marketplace, and all the activities. Minuses--rather chintzy included breakfast (Coffee not bad), almost as chintzy as I was in looking for a price, rooms certainly not big enough for more than two, Waikiki street noise had to be remedied by earplugs, but I've stayed in many hotels in this class here and have had the same problem. Last problem, if you decide to rent a car, you'll pay $$ to store it for the night in Waikiki. The concierge here was good enough to give us a couple of places to see about car storage, since they were renovating their own parking garage which is nowhere near big enough for their guests and employees. One was $7 per night, with in an out privileges for 24 hours. Bottom line, we'd return in a second.", "title": "Spectacular vacation and a fantastic budget hotel!", "helpfulness": 26, "user": "sallyglam", "date": "June 6, 2005", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 3.0, "service": 5.0}, "id": 3534452}, {"rating": 3.0, "title": "Decent for the price-pool issues", "text": "I was a bit concerned about Aloha Surf after reading some reviews about it, but for the price, it turned out to be a decent hotel.", "helpfulness": 9, "user": "aunry79", "date": "June 23, 2006", "id": 5378349}, {"rating": 3.0, "title": "Good location. Decent price. No frills", "text": "It is a quick two block walk from the beach, which is good because you shouldn't plan on using the pool. The way the buildings around Aloha Surf are located, the pool only gets sun about 3 hours of the day. It was also super small and super cold! The pool closes at 7pm, so no evening, relaxing swimming after dinner.", "helpfulness": 8, "user": "OandO", "date": "June 18, 2006", "id": 5357169}, {"rating": 4.0, "title": "Fabulous Room, Service, Location", "text": "The rooms were nice. A double and twin bed, and couch w/hideaway bed. Flat screen tv, remote control operated AC, and a convenient kitchenette area that included a refrigerator, microwave and sink. No bathtub, just a shower, but that seems to be common of hotels in Waikiki. Everything was clean.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "June 6, 2006", "id": 5315105}, {"rating": 4.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "We stayed here for the U2 concert weekend. We were 'upgraded' from the Aqua Marina where we had originally booked. Staff at both places were friendly and welcoming. The front desk helped with shuttles and information that saved us $$$. The bed wasn't great, but for one night, it worked. Other room amenities were fine. Overall, an easy low-key place to crash. Walking to Waikiki took 5 minutes, so don't think that location is a negative.", "title": "Everything you need", "helpfulness": 1, "user": "njlillegard", "date": "December 11, 2006", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 4.0}, "id": 6363479, "likes": {"liked": "— Quiet location off the main Waikiki strips", "disliked": "— Bed was less than stellar"}}, {"rating": 2.0, "title": "Adequate if all you need is a place to sleep", "text": "About as far from Waikiki Beach that you can be without being in the Ala Wai Canal. You have to cross both busy Kuhio Avenue and Kalakaua Avenue to reach the beach. And when you walk down the street the hotel is on at night it is quite dark due to overhanging trees and inadequete lighting. There were also some iffy characters hanging out in that darkened section including 2 people who looked like they were about to come to blows.", "user": "Love_2_Travel_djkljd", "date": "December 2, 2006", "id": 6317486}, {"rating": 4.0, "stay_parameters": "Stayed July 2006, traveled on business", "text": "I was assigned a room on the 3rd floor. It had no balcony and no view - unless you count looking in other peoples windows a view. The windows in the room are the kind that are glass slats that you open and close by turning the handles. There are no screens to keep out the mosquitoes. Unfortunately when I entered my room one window was wide open and there was no way to close it as the handle was missing. My room was probably mosquito central by then. On my way out I informed the desk staff and it had been fixed when I returned an hour later.", "title": "Decent place for the price", "helpfulness": 3, "user": "gsnichol", "date": "November 19, 2006", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 6150603}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled with family", "text": "I had to have the window A/C unit on 24/7 it was so hot. The air conditioner would make a very loud noise every 15 minutes on schedule which can make getting to sleep difficult. I brought a white noise machine from home and put it on the loud setting right next to my ear, that helped some.", "title": "Aqua Aloha Surf Rocks", "helpfulness": 1, "user": "chris1916", "date": "November 14, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6131927, "likes": {"liked": "— Location was just right for us!", "disliked": "— n/a"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2006, traveled solo", "text": "The shower was the size of a phone booth so if you are a \"person of size\" you might get stuck in there. Also if you are over 5'8\" good luck getting a shampoo. I'm 6'2\" and the shower head was about 6 inches lower than my head. I had to sort of squat and bend over sideways to get my head wet. Also both faucets were labelled \"C\" for cold, so good luck your first time in figuring out which one is which. You might get scalded.", "title": "Satisfactory stay", "user": "westexmom", "date": "October 27, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 6018529, "likes": {"liked": "— Location", "disliked": "— My view was the apartment complex with the noisy night occupants."}}, {"rating": 2.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "I had researched this hotel plus many competitors before booking this trip. Its website raves it as a newly renovated \"boutique\" hotel. Their whole branding/marketing was also quite stylish. My BF and I booked a standard queen room, but had no idea it was going to be so small. Although it does seem to have new wallcovering/carpets, and furniture, there was really nothing they can do with the space limitation. The bathrooms were small, pedestal sink with no counter space, a very tight shower stall (with a faulty shower head that we had to ask to be replaced), and a sliding barn door into the bathroom because there was not enough space for a real door. The air conditioner was the worst, it was on the window wall and positioned right at bed level, the bed was literally less than 3 feet from the unit, so if you slept at night, you had a constant rush of cold air shooting directly at your face. Not to mention it was loud. We had to strategically move the guest chair in front of the unit and then clothes, bags, and anything on the chair to prevent the air from heating us. We would shut off the air, except the room gets very stuffy and also windows have no screens so we would be mosquito dinner if we had left the windows open.", "title": "Looks can be deceiving", "helpfulness": 1, "user": "SavvyDesigner", "date": "May 5, 2007", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 4.0, "cleanliness": 1.0, "value": 2.0, "location": 4.0, "rooms": 1.0}, "id": 7548588, "likes": {"liked": "— Location", "disliked": "— Hotel Room"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "The staff was friendly, very helpful, when we had our rooms cleaned it seems like they never replaced our bedsheets or pillow cases, they just fixed it up, not a great cleaning effort. Parking was also a rip-off, $15/day. So we only had a car for 2 days out of the 6 days we were there. Everything is walkable or can be accessible by bus, but you will want to have a car to drive to some other very beautiful places, otherwise you are really missing the true beauty of Oahu.", "title": "Loved the Hotel", "helpfulness": 2, "user": "Bobw1690", "date": "April 10, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 7303623, "likes": {"liked": "— Great helpful staff, good location, free high speed internet.", "disliked": "— Limited parking"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled solo", "text": "The only plus was the hotel was at a great convenient location. Close to public transportation and stores/restaurants. Somewhat quiet street.", "title": "Very cozy and great location", "user": "TomVancouverCanada", "date": "April 6, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 7285980, "likes": {"liked": "— location", "disliked": "— small pool"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled with family", "text": "My wife and I checked in on Wednesday, March 14. We spent seven nights at the hotel. We had a rough arrival as our airline lost our bags. Upon checkin at the hotel, the staff said they would make a note that the airline would deliver our bags. Being very tired, we went up to our room and turned in. During the night, I awoke and saw the phone message light blinking. I called the desk and they told me that the airline had delivered our luggage. They brought our luggage up to our room. That was the start of our very pleasant interaction with the staff. They were helpful with directions, recommendations. We have nothing but good to say about the staff. Even when we checked out on the March 21, one of the desk staff helped us carry our luggage to the rental car.", "title": "Incredible Aloha Spirit!", "user": "eggie62", "date": "March 31, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 3.0, "rooms": 5.0}, "id": 7260319}, {"rating": 2.0, "stay_parameters": "Stayed March 2007, traveled with family", "text": "We had a Superior room and there was more than enough room for my wife and I. The room was clean and well kept. The hotel had a good location and we were able to easily walk to most of our destinations in Wakiki. Some of the tours we took picked us up at the hotel. We plan to stay there on our next trip to Hawaii and we would recommend this hotel to our friends.", "title": "\"Boutique\" must be French for small!!", "user": "AlaskaLady", "date": "March 30, 2007", "detail_rating": {"business": 1.0, "service": 1.0, "cleanliness": 3.0, "value": 2.0, "rooms": 2.0, "location": 3.0}, "id": 7253720, "likes": {"liked": "— lobby area was comfortable", "disliked": "— the tiniest pool I have ever seen."}}], "location": {"country": "United States"}, "stars": 2.5, "variance": {"poor": 72, "average": 209, "very good": 429, "terrible": 47, "excellent": 333}, "aka": "Aqua Aloha Surf Waikiki Hotel Honolulu", "slim_ranking": 0.542168674699, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.5, "location": 4.0}, "description": "Aqua Aloha Surf Waikiki, one of Waikiki’s most popular hotels, is a boutique hotel located 2 blocks to the beach and steps from world class dining and shopping. This hotel, where surf style meets urban sophistication, offers the following FREE amenities: in-room Internet and WiFi Internet access in lobby & poolside, daily local newspaper, local & toll-free calls, AquaBLISS pillow top beds, LCD TV’s, mini-refrigerator, microwave, coffeemaker and safe. The large, open air lobby connects to a fitness area and Internet cafe as well as a relaxing pool area with cabanas and barbeque grill lit by tiki torches every evening. Continental breakfast is served complimentary daily for bookings made directly through Aqua. Select accommodations offer views of the magical Koolau Mountain range and Ala Wai Golf Course."}