{"user_rating": 4.0, "review_count": 1235, "name": "Aqua Bamboo Waikiki", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "Just got back from a wonderful holiday in Waikiki. We stayed in a condo within the Aqua Bamboo hotel. While I cannot comment on thier hotel rooms, I can comment on staff, facilities, location etc. The Bamboo is a wonderful find, centrally located ( 5 mins - 1 block or so to the beach) In busy Waikiki where huge hotels are abundant, I really appreciated the intimacy that the Bamboo provided. The staff were genuinely sweet and helpful. It was nice to see the same faces every day. The lobby is immaculate and newly re done. They have complementary newspapers and a bowl of apples out everyday. Breakfast, while we didint partake, from what I saw consisted of baked goods, fruit, juice, coffee & tea. There are two computers with internet access for guests to use ( free!). The pool area is lovely, lots of teak lounge chairs and tables and 2 cabana like areas. They light tiki torches at night which are very pretty. There is also a BBQ down in this area which was very nice - the bbq is new and works very well. We used it twice during our stay. A word of advice, the \"Food Pantry\" grocery store acouple of blacks down on Kuhio, will just hose you price wise (close to $10 for 4 litres of milk!!). I think this may be due to the fact that it is the only grocery store in this part of waikiki. Both Foodland and Safeway offer much better prices and are maybe 5 minuites away by car. I digress....there is also a spa at the hotel, which we didint use but offered alot of massages and body treatments. There isnt alot of parking at the hotel, we parked next door at the Pacific Monarch for $12 a day, which is an okay price but very convenient. Loved the Bamboo and would reccoment it to anyone in a heartbeat!", "title": "Great Spot!", "helpfulness": 1, "user": "ilovevacays2008", "date": "September 2, 2008", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "business": 5.0, "service": 5.0, "location": 5.0}, "id": 19628473, "likes": {"liked": "— everything", "disliked": "— lack of parking"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "We checked out the Aqua Bamboo from the internet before we got our travel agent to book it. We could only go by the photos and description on the site which looked quite good. After a dissappointing experience in a web-booked motel in San Francisco we weren't sure what to expect but we were pleasantly surprised.", "title": "Better Than Expected", "user": "Jeannie94", "date": "September 1, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 3.0, "rooms": 3.0}, "id": 19592184, "likes": {"liked": "— Relaxed atmosphere, clean surroundings.", "disliked": "— No fresh milk for coffee."}}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled with friends", "text": "The hotel and it's lovely surroundings were clean and neat and the room had everything we needed and was very comfortable. It even had a small kitchenette. While not on the beachfront it is only a short walk to Waikiki Beach, shops and restaurants.", "title": "Wonderful Surprise!", "user": "gate20", "date": "August 31, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 19560471, "likes": {"liked": "— Location and Staff", "disliked": "— Price of Parking"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled solo", "text": "The staff were friendly and helpful. My only gripe would be the continental breakfast which I felt could be expanded a little to include some toast and cereal as not everyone enjoys cake for breakfast. The customer relations manager was wonderful and went out of her way to ensure we were happy. It was definately great value for money and we would certainly stay there again next time we are in Hawaii.", "title": "A cozy, personable experience!", "helpfulness": 1, "user": "MinnesotaLisa", "date": "August 28, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 19465898, "likes": {"liked": "— Location; staff; room", "disliked": "— Pool was very small; breakfast was sketchy."}}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled with family", "text": "The Aqua Bamboo was a truly pleasant surprise upon arrival. Just 3 blocks from the beach, and great walking distance to anything and everything. All of the staff at the hotel were extremely friendly, and were more than willing to meet our needs. The price was good for what we got. Basic room, with small kitchenette and lanai. Didn't need anything more. Was cleaned on a consistent, daily basis, which is important! The room even had free WiFi access. The only downside was the price of parking at $18 per day. Didn't rent a car for more than a day because of this.", "title": "Really enjoyed my stay", "helpfulness": 1, "user": "rzngro", "date": "August 26, 2008", "detail_rating": {"cleanliness": 4.0, "front_desk": 3.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 19396152, "likes": {"liked": "— Spaciousness of room", "disliked": "— A bit noisy on the street side"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "Stayed 7 nights at the Aqua Bamboo for our two year anniversary. We were greeted with a bottle of champagne and macadamia chocolates for indicating a special occasion when we made the reservation. We were also upgraded to the Studio Kitchenette for sharing our stay on facebook/twitter for advertising purposes (based upon availability).", "title": "Great room for the price and location", "helpfulness": 1, "user": "jvuuu", "date": "September 29, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 118757975}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "Very old hotel, but renovated rooms. We were close to booking at the Aqua Aloha Surf and are sooo glad we didn't! Aqua Bamboo rooms are roomy enough and clean for the excellent price! Cute little oasis/pool/spa in the back and about 2 blocks from the beach! Customer service was outstanding--front desk staff was always super friendly and greeted us each time we came in and out of the hotel. Everyone (especially Puna) made the effort to reach out and genuinely seemed interested in what we were up to each day of our vacation!", "title": "Loved it!", "user": "greenie5356", "date": "September 28, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 118713423}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled with friends", "text": "Next time we travel to Hawaii, we would like to stay at a hotel right on the beach, but for our first college-students-on-a-budget trip together, this was a perfect choice.", "title": "Friendly throughout the renos!", "user": "missxanthropy", "date": "September 28, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 118711979}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "Had a great time here, stayed on three different occasions. Very reasonable, and walking distance to waikii beach, shopping, plenty of resturants. Internet service in Lobby, Pool area great.", "title": "The pool area makes our stay", "user": "flyok", "date": "September 24, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 118548276}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "Even tho there was annoying drilling going on which was unpreventable , the staff was very accomodating.", "title": "Some staff makes all the difference!", "user": "JWP1987", "date": "September 21, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 118432936}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "Finishing up our trip to Hawaii. The service is excellent and friendly and responsible. They did a wonderful job keeping the room clean. There are very useful amenities including working high-speed internet (bring a LAN cable - Wifi is only available in the lobby), free water/tea service in the lobby, coin-operated washer/dryer on certain floors. Parking is limited and $20/night which is very reasonable in this area. The rooms are as described and clean. We saw no roaches during our stay. There is a kitchenette (hotplate) with sink and coffeemaker and plates/microwave.", "title": "Excellent value, but bring earplugs", "user": "trustemd", "date": "October 22, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 119598598}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "The location is very central, which makes for noisy nights from the local traffic. Bring earplugs unless you're the most sound of sleepers.", "title": "Close to everything", "user": "Schiesl", "date": "October 22, 2011", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 119590857}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "I just got back from my stay at the Aqua bamboo and over all it was a nice stay. The staff goes above and beyond with the exception of a very rude dayshift front desk person. The building was nicely updated, pleasant, and comfortable. The location was great which allowed me to keep my rental car parked for most of my stay. The parking was a bit tight but I felt the parking was much safer than the building next store. I am already planning my vacation back to early next year and hope by than the remodel of the balconies will be complete by that time. Overall, this is a great place to stay.", "title": "Had a fantastic time here !", "user": "MissHove", "date": "October 22, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 119585089}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "Me and my boyfriend stayed here for 16 nights in September. We absolutely loved it here! The pool area and reception were relaxing and you wouldn't have thought you were next to the busiest part of the area. Nice little touches like the bamboozle and free coffee/apples made it extra special. The staff were all helpful and friendly and gave us tips and printed maps for when we were visiting places nearby.", "title": "An Oasis in the Middle of a Frenzy", "helpfulness": 2, "user": "sduncanae", "date": "October 20, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 119528532}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "The room was cleaned everyday, the only thing was the maid stopped leaving the coffee in the room towards the end but that was fine as there was coffe downstairs. They also give you shampoo conditioner and body lotion everyday so you dont even need to bring essentials. You also dont need to bring a towel as they supply you with one in return for a towel card.", "title": "5 months later", "helpfulness": 1, "user": "Bill L", "date": "October 18, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 119424282}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "Would highly recommend this hotel to travelers who need a comfortable place to stay, which is walking distance to everything you need.", "title": "Location is everything and Bamboo is the Location for You.", "helpfulness": 1, "user": "Tandem_Surfer", "date": "August 26, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 19362204, "likes": {"liked": "— Location & Cortyard Pool with Jaccuzi", "disliked": "— Low Ceiling in Garage"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2007, traveled on business", "text": "I stayed at the Aqua Bamboo from 10th January 2007 for six nights with my colleague on a conference/holiday. We found the staff friendly and helpful on arrival and instantly liked the laid back style of this hotel. (We have vast experience of hotels of all stars around the world). The room was compact but comfortable with everything we needed, i.e. coffee maker, toaster, fridge, safe (free to use). As we were on Kuhio we expected a little noise but our side room was quiet and comfortable with morning sun on the balcony. Room cleanliness was good with minimal staff intrusion on our privacy. The pool terrace breakfast of fruit, muffins and tea/coffee was just right for a start to the day. The hotel location was superb, just a few minutes walk from everything you needed, be it coach trips, restaurants, shops, entertainments etc. It's not four star, but it's a great place to stay to enjoy Waikiki without paying top dollar for flash that you just don't need. I would go back again and be happy with my choice.", "title": "Enjoyed the stay at the Bamboo", "helpfulness": 1, "user": "GordonToulson", "date": "January 23, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 6650320, "likes": {"liked": "— Totally unpretentious", "disliked": "— Would have preferred a bit more space in the room"}}, {"rating": 3.0, "stay_parameters": "Stayed June 2006, traveled with family", "text": "I stayed here with my mother and sister for a little reunion and found, for the price, it was a great value. We first stayed in a room on the street side and you'll need ear plugs it's so noisy from the traffic and the bus stop on the other side of the street. We requested to be moved to the other side of the building and were very happy with the room. Both rooms were clean (didn't see a single roach), if a bit rundown, but you can see where the hotel is really trying. The lobby and pool are very pleasant. I actually preferred the pool to the beach just because it was so quiet and relaxing. It's a great little location, only two blocks from the beach and within a few blocks walk from everything else. Tons of great shops and restraunts nearby. My only wish is if they would put a microwave in the rooms.", "title": "A great value for what you get", "helpfulness": 4, "user": "shann481", "date": "December 14, 2006", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 5.0, "location": 4.0, "rooms": 2.0}, "id": 6441550, "likes": {"liked": "— Location and pool", "disliked": "— no microwaves!"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled solo", "text": "Been to HI a dozen times and this was hands-down the best low priced hotel I've stayed at. People who slam this hotel are just pampered and silly, and the sort of folks who go to HI to sit in a hotel room 24/7. Clean, well maintained, super location on Kuhio, easy walk to everything, easy access to public transport. Front desk staff were charming and graciously upgraded me to a suite. Nice fluffy towels, clean bathroom. I was there during the earthquake and the hotel staff performed professionally and with great patience. There are 17 underground parking spaces. Forget about a car. I took very convenient shuttle service to the hotel from airport ($15 roundtrip). If you should need a car for a day trip, there is a car rental place two doors down from the Bamboo (prices start at $12 a day and go up). The free breakfast packs in the morning are a nice touch (a snack, really). I put mine in the mini frig and munched on the muffins later in the day.", "title": "I loved it and you can't beat the value for the $$", "helpfulness": 8, "user": "TravellerChicago", "date": "November 8, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6085398, "likes": {"liked": "— Price, comfort, convenience, and free in-room highspeed internet", "disliked": "— Nothing... it was just fine."}}, {"rating": 3.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "We spent 4 nights at the Aqua Bamboo. Overall, we would say that it was just adequate. We certainly wouldn't recommend it for honeymooners, but it would probably do for the casual vacationer who checks their expectations at the door.", "title": "Just Good Enough", "helpfulness": 3, "user": "Shawn D", "date": "October 8, 2006", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 2.0, "cleanliness": 2.0, "value": 3.0, "location": 5.0, "rooms": 2.0}, "id": 5926679, "likes": {"liked": "— Location", "disliked": "— Breakfast"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "Pros:", "title": "Good value", "helpfulness": 10, "user": "Nexusgirl", "date": "September 2, 2006", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 5762690, "likes": {"liked": "— Great location - close to everything but not overly crowded", "disliked": "— could use additional upgrades in the bathrooms"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2008, traveled as a couple", "text": "My wife and I are former Hawaii residents. We go back every year - at least once - for our anniversary. We typically stay outside of Waikiki (Northshore, Kailua, Waimanalo, etc.). This is the first time in 20 years we actually booked a room in Waikiki. We were a bit skeptical and our expectations were low - after all, it's Waikiki.", "title": "Aqua Bamboo was the right choice", "helpfulness": 1, "user": "DR87", "date": "December 12, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 22674230, "likes": {"liked": "— Staff"}}, {"rating": 5.0, "title": "A Great Place to Stay", "text": "The Aqua Bamboo turned out to be the perfect choice. It's a small boutique hotel, one block off the beach, in the heart of Waikiki. If you're looking for a \"resort experience\" - this is not for you - but if you want a private, comfortable place to relax and still be close to the beach and Waikiki night life, this is a solid choice.", "helpfulness": 2, "user": "MumFrankfort_Il", "date": "December 3, 2008", "id": 22409869}, {"rating": 5.0, "title": "Aqua Bamboo & Spa - Home away from home", "text": "We booked a studio room overlooking the courtyard/pool. The room was comfortable and just the right size for the two of us. The room has obviously been renovated recently - fresh paint, new carpet, etc. There were still signs of age however - the ceiling has some crumbling spots, the toilet didn't always flush completely. But all in all, it was a clean and comfortable room.", "helpfulness": 2, "user": "Happy_Family08", "date": "November 30, 2008", "id": 22319264}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled on business", "text": "The highlight of the hotel is the staff. WOW! Joy and her team are first rate all the way. Eager to help with any question - directions, access to the internet, etc. - always friendly and looking after the best interests of the guests. We were always greeted with a smile and an offer of \"is there anything we do for you today\" and when we had a question, we were helped right away.", "title": "Best Hotel Staff", "helpfulness": 1, "user": "ColoGrl4ever", "date": "November 25, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 22179928, "likes": {"liked": "— The staff and the Honeymoon Suite and Bamboozle!!", "disliked": "— The street noise"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "The Aqua Bamboo exceeded our expectations.", "title": "A Great Hideaway", "helpfulness": 1, "user": "Santaisretired", "date": "November 24, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 22141659, "likes": {"liked": "— Facilities", "disliked": "— Old airconditioner"}}, {"rating": 5.0, "title": "Loved Aqua Bamboo & Spa", "text": "This beautiful hotel is outstanding. In fact, August 2008 was our second trip to Honolulu and our second stay in this wonderful hotel; we did not even consider any other hotel. My husband, sister, daughter, and I had a fantastic time at the Agua Bamboo and Spa. First of all, it's beautiful. The fountain and hand-cut wooden bench out front, the lobby, and the pool area outside are all scenic, relaxing, and inviting-- without being overly pretentious, as some hotels tend to be. Our room was clean and remained clean the entire time due to the awesome staff, who very kindly put up with us tracking sand all over the floor (mahalo!). In fact, Leonor Wong and her staff are exceptional. She went out of her way every day to ensure that we were pampered and well cared for. Luxurious beach towels, exquisitely comfortable beds, and very appropriate and well-planned continental breakfasts were just a few of the goodies we experienced. Both my sister and I were given beautiful flower leis; I have never felt so special in any hotel in my life. We were honored also with a delicious guava cake and a bottle of champagne! We had a suite with a kitchen, 2 refrigerators, a stove, a balcony and a bit of a view of the ocean. I should also mention that the beautiful and very relaxing garden area features a real bamboo hut, deck chairs, and a kidney shaped pool. The hotel is 1 and 1/2 blocks from Waikiki Beach, 2 blocks from the International Market, and a short walk from the Ohana East restaurant which has great food at reasonable prices. Here you can dine among beautiful flower arrangements and see birds flying all around. We fed them a bit of pancakes. It is the closest to paradise I have ever been!", "helpfulness": 2, "user": "BobbiSuffolk_Va", "date": "September 8, 2008", "id": 19899184}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "we stayed at the Aqua Bamboo for 9 nights during our honeymoon trip to Waikiki and had such a great time!", "title": "Hooray for Bamboo", "user": "rihamSacramento_CA", "date": "September 7, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 19862900, "likes": {"liked": "— great staff", "disliked": "— we had to leave"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "Upon arriving at the hotel we were surprised to have a bottle of champagne and box of chocolates delivered to our room, since we were honeymooning there.", "title": "Great for the price", "helpfulness": 1, "user": "mom040", "date": "September 4, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 19731574}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "My wife and I are into healthy cooking so we enjoyed the in-room kitchenette, and the stainless steel, gas-grill on the pool patio.", "title": "the Bamboo rules", "helpfulness": 1, "user": "Rachel049", "date": "September 4, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 19729517, "likes": {"liked": "— the staff", "disliked": "— having to leave"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "The rooms are clean and there's a nice flat screen TV on the wall.", "title": "Loved our stay at the Aqua Bamboo", "helpfulness": 1, "user": "bubetta", "date": "September 2, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 19657729, "likes": {"liked": "— tranquility", "disliked": "— breakfast"}}, {"rating": 3.0, "stay_parameters": "Stayed November 2008, traveled with family", "text": "the hotel location is good and the staff were great..Joy is the best staff in this hotel..she's always ready to greet you with a very warm smile..", "title": "We had a comfortable stay in Aqua Bamboo", "user": "i_luv_tokyo", "date": "November 13, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 21807964, "likes": {"liked": "— no hassle check-in", "disliked": "— $22 for valet parking, cleanliness (they forgot to take our garbage in the living room, once)"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2008, traveled solo", "text": "Our room was in the 3rd floor and i was expecting a newly renovated one so i was a bit disappointed seeing the stains on the ceiling and the carpet seems old and dusty. but we had full kitchen facilities in our room which i badly needed for my kid's special diet. we are facing the main street but we don't mind the noise..afterall, we're in Hawaii to have fun, see the beaches and go shopping..not sleeping in the hotel the whole day..", "title": "A hidden gem for anyone traveling on a budget!", "user": "triptraveling", "date": "November 12, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 21797479, "likes": {"liked": "— The value for the price!", "disliked": "— N/A"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "the hotel pool is small but the atmosphere is great , makes you feel you're in a resort hotel and not in the middle of the busy streets in waikiki..", "title": "Perfect !", "user": "Shyte", "date": "November 10, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 21715455, "likes": {"liked": "— Location", "disliked": "— Elevators"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2008, traveled with friends", "text": "the breakfast is simple but tastes good..", "title": "Yay Bamboo!!!", "user": "Shirl2girl", "date": "November 10, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 21712165, "likes": {"liked": "— ROOM WAS UPDATED, NICE AND COMFORTABLE.", "disliked": "— INTERNET CHARGE"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled with family", "text": "and if you don't feel like packing your suitcase again full of laundry, there's a coin laundry on the 4th floor and if i'm not mistaken , on the 8th and 11th floor of the hotel either.", "title": "Great Hotel!", "user": "maitai8", "date": "November 10, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 21700720, "likes": {"liked": "— Staff", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "Our trip was planned 5 months in advance online so we were able to see what the hotel looked like,and what was offered.When we arrived for our stay we were happy to see that all of the research and online photos were exactly as we had hoped.Our family suite was smaller than we had expected,but it was clean and comfortable.The folks at the front desk(morning noon and night) were amazing.The Thursday night cocktail party is not to be missed;the \"BAMBOOZELS\"were wonderful.We were treated very well and our kids had a vacation of a lifetime.We would be more than pleased to stay at the\"AQUA BAMBOO & SPA\" in Waikiki again. ~MAHALO~The Sleepers", "title": "Great Family Vacation", "helpfulness": 2, "user": "Duke-and-Duchess", "date": "July 25, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8234360, "likes": {"liked": "— The pool & spa area", "disliked": "— Our room was smaller than we had antisipated"}}, {"rating": 4.0, "title": "Needs some changes, but would recommend", "text": "I was pleasantly surprised about some very basic amenities which other hotels don't offer. It was wonderful to have two computers available for usage 24/7. There was also coffee and tea available in the lobby 24/7. Between 7:30 and 9:30 a.m. there was free fruit, juice and some type of muffin or sweet bread each day. I hope that first time tourists know that this is a rarity.", "helpfulness": 2, "user": "Wahine57", "date": "July 24, 2007", "id": 8224906}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "My room was kept clean every day! When there were times housekeeping forgot something such as toilet paper, etc. it was delivered immediately! I found a few small coakroaches in my room. The front desk offered to spray w/pesticide the next morning, but I opted instead to buy \"sticky traps\" at the local grocery store: though they weren't that costly, I was somewhat surprised that the personnel at the front desk didn't offer to reimburse me (perhaps they weren't authorized to). Many of us cannot tolerate the fumes from pesticides!", "title": "Loved it!", "helpfulness": 3, "user": "CalgaryLady94", "date": "July 8, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 8075153, "likes": {"liked": "— The location and staff", "disliked": "— The tiredness of the room"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "Location of the hotel was great! Front desk employees were friendly and professional. \"Daniel\" was especially kind and helpful; though all staff was very kind and helpful including housekeeping.", "title": "Good deal at the Aqua Bamboo", "helpfulness": 3, "user": "YokohamaGeezer", "date": "July 5, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 8064929, "likes": {"liked": "— Location, internet, nice small pool, good views from 9th floor up, price very reasonable", "disliked": "— nothing"}}, {"rating": 3.0, "stay_parameters": "Stayed June 2007", "text": "Suggestion: how about \"Pay Movies\"? My trip was mostly business, so when I returned to my room it would've been nice to have the option to purchase a movie to view.", "title": "Disappointing", "user": "terrianne61", "date": "July 1, 2007", "detail_rating": {"front_desk": 2.0, "business": 1.0, "service": 2.0, "cleanliness": 2.0, "value": 2.0, "location": 3.0, "rooms": 2.0}, "id": 8036610, "likes": {"liked": "— Pool area was serene", "disliked": "— Dingy room"}}, {"rating": 1.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "The staff was very nice,but the hotel is terrible.I would not give the hotel even a star.We found bugs in the rooms and the rooms were dirty.I would not recommend this hotel to any one.", "title": "hated the aqua bamboo", "helpfulness": 1, "user": "jerome_7", "date": "August 7, 2007", "detail_rating": {"front_desk": 3.0, "service": 5.0, "cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "location": 3.0}, "id": 8368304, "likes": {"liked": "— staff", "disliked": "— bugs"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "Lovely lobby and pool, at first we were disappointed by the rooms and linens, (we are used to a higher thread count) but the staff and location made up for it. (we were hardly in our rooms anyway) Nice little breakfast of fruit and rolls every morning and a lovely little cocktail party. If you hate traffic you may want to ask for an off the road room. We played hard so slept well even with a road side room. Pay-Parking is limited at the Hotel, we did have a rental car and although pay parking is available nearby it is pricey and we were able to find free spots 4-5 blocks away. We would rebook.", "title": "Fantastic Location and staff", "user": "Sunny1204", "date": "August 7, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 3.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 8367637, "likes": {"liked": "— staff", "disliked": "— bed sheet thread count"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "The Van Dams", "title": "Beautiful hotel and great hospitality", "helpfulness": 1, "user": "Auntkelly1313", "date": "August 3, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 3.0, "rooms": 5.0}, "id": 8315887, "likes": {"liked": "— The spa and the pool", "disliked": "— Could of had a better view"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled solo", "text": "Everything was fantastic. The pool is amazing and everyone who stayed there and worked there made us feel right at home. The lomi lomi massage is the best, we did it twice.", "title": "feels like home", "helpfulness": 2, "user": "madfisho", "date": "July 31, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 8269090}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "excellent value for money, right in the heart of waikiki, the staff were very helpful & friendly.you dont need to spend big bucks to stay in a nice hotel with a pool, its all here, will definately return.", "title": "Huge room, minutes from Wakiki Beach", "helpfulness": 3, "user": "CdnTravelJunkie", "date": "July 31, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 8267165, "likes": {"liked": "— Huge room, prime location, comfortable feel.", "disliked": "— Small elevators due to it being an older, renovated hotel."}}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled with friends", "text": "My friend and I stayed here on a girlfriend getaway, and absolutely loved it. From the moment we stepped inside, we both agreed that we'd won the hotel lottery.", "title": "Mahalo Aqua Bamboo!", "helpfulness": 1, "user": "emariewilling", "date": "August 19, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 19119534}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled with friends", "text": "First of all, it's beautiful. The fountain out front, the lobby, and especially the pool area outside are all scenic, relaxing, and inviting-- without being overly pretentious, as some hotels tend to be. Our room was clean and remained clean the entire week due to the awesome staff, who very kindly put up with us tracking sand all over the floor (mahalo!).", "title": "Excellent choice!", "helpfulness": 1, "user": "IvoryMe", "date": "August 17, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 19029309, "likes": {"liked": "— Customer service, swimming pool, breakfast, and location", "disliked": "— Parking garage is too small"}}, {"rating": 1.0, "stay_parameters": "Stayed August 2008", "text": "There was a continental breakfast every morning with food enough to get us ready for the day, and some pretty amazing coffee. We enjoyed coming back from our adventures and having an afternoon coffee break out by the pool. I can't stress enough how pretty it was out there: quiet, calm, plenty of seating... really the perfect way to unwind and get ready for evening fun.", "title": "Don't Stay Here: Terrible Reception Staff", "user": "Baldy566", "date": "August 16, 2008", "detail_rating": {"front_desk": 1.0, "value": 1.0}, "id": 19026120}, {"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "I loved the fact that the hotel was small enough that I recognized the faces of the other guests and the staff. It felt a little more like home than a bigger luxury hotel might have been. Lenore Wong always took time out to talk to us and make us feel welcome, and every other staff member we met was friendly and accommodating.", "title": "Loved Bamboo", "helpfulness": 1, "user": "isiaVienna", "date": "July 30, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 18415442, "likes": {"liked": "— Pool, room, close to the beach, kitchenette in room, nice stuff", "disliked": "— room with view at the wall"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "If I ever return to Waikiki, I will definitely be staying at this hotel-- I won't even look anywhere else. I seriously think the people who gave it negative reviews are a little crazy.", "title": "Enjoyed our stay very much! Great staff.", "helpfulness": 1, "user": "happy4travel", "date": "July 25, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 18258041, "likes": {"liked": "— the upgrade to a suite", "disliked": "— maybe vary the selections in the continental breakfast?"}}, {"rating": 2.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "Wish I can write a better review but no. Cockroaches in a 3* hotel is unacceptable. We did some reseach and read great reviews about this hotel so we were very disappointed to get a medium-warm welcome at the check-in desk and have thumb-size running cockroaches in the room and the bathroom. We booked through the hotel's website and didn't get the supposedly included breakfast. Only + of this hotel: Location is great & rooms have good soundproofing.", "title": "Great location but cockroaches!", "helpfulness": 1, "user": "Tabemas", "date": "October 16, 2011", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 119371954}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "Stayed 5 nights. Location fantastic. In all directions 5 mins from anywhere you need to be. Day staff very good. Had problems with air conditioner noise for 2 nights and it was handled by reception immediately and with the upmost understanding. Staff even moved our luggage for us to new upgraded room. There are alterations being done and the noise is sometimes quite bad. But as we were out most days is didn't effect us greatly. Do feel sorry for the staff though, they have to work with this noise Monday to Friday. All in all would recommend this hotel to anyone who dos'nt expect a 5 star hotel. You ware not paying 5 star but you are certainly getting near to that grade for much less. The pool area is great and the free cold and hit drinks available 24/7 is appreciated.", "title": "Location execellent", "user": "LynB730", "date": "October 9, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 119091635}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "A very nice place to stay. Right in the actionzone! The rooms are not big, but spacious enough for a couple. Beds are comfy. It's also very clean, relatively quiet and the staff was friendly. However, we didn't like the fact that the supposedly included breakfast (we booked with expedia) did no longer excist. In fact, they had quit serving breakfast 9 month earlier. That was kind of a bummer because we were counting on it!", "title": "So fun!", "helpfulness": 2, "user": "Anchelle", "date": "October 5, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 118979298}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "The pool area was pretty sweet! Urban yet tropical, we loved it!", "title": "Incredible place - we want to come back!", "helpfulness": 1, "user": "lauralston", "date": "October 5, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 118952228}, {"rating": 3.0, "stay_parameters": "Stayed September 2011, traveled solo", "text": "On tuesday they arranged a managers reception, with their 'Bamboozle' cocktail and Hawaiian style snackes! All free of charge, very welcoming!", "title": "VERY VERY Friendly Staff", "user": "AlphaIrwin", "date": "September 30, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 2.0, "location": 5.0}, "id": 118796968}, {"rating": 5.0, "title": "Loved this place", "text": "I had read some earlier reports on the Aqua Bamboo which were not very complimentary, and I even contacted the hotel direct airing my concerns. Don’t know why, this hotel turned out to be one of the best, friendliest, most comfortable home away from home. My daughter and I had booked 9 nights at the Aqua Bamboo, and 6 nights at the Sheraton Princess Kauiliani, well when it came time to checkout we simply did not want to leave. Our room was great 2 x double beds, large flat screen TV, great shower/bath, washing machine at the end of the hall, a great swimming pool, free internet, fresh apples all day every day, yummy muffins and pastries for breakfast, and lovely reception staff and service staff. I don’t know what I was ever worried about WE LOVED THIS HOTEL! And I loved the lounge coat thanks Aqua Bamboo we had a great time", "user": "jayona2", "date": "September 11, 2008", "id": 19972680}, {"rating": 4.0, "title": "Aqua Bamboo Just like family", "text": "My wife and I were looking a for a medium priced hotel for our holiday in Hawaii when we came across the Aqua Bamboo & Spa.", "user": "surfwagon", "date": "September 10, 2008", "id": 19968982}, {"rating": 5.0, "title": "A Most Enjoyable Holiday", "text": "Beside the price, what sealed the deal to book was the fact that the room came with a kitchenette and not just a fridge and coffee maker as is the case in most of the hotels.", "user": "dawnt10", "date": "September 10, 2008", "id": 19947262}, {"rating": 5.0, "title": "MAKE ME FEEL LIKE PARADISE!", "text": "At the Aqau Bamboo the staff make you feel right at home just like a relative does and they are so friendly and ready to help you no matter what the request.", "user": "lisalisa1990", "date": "September 9, 2008", "id": 19900852}, {"rating": 4.0, "stay_parameters": "Stayed March 2007, traveled on business", "text": "I did a lot of research before picking Aqua Bamboo . . . mostly on the internet, but after narrowing to two, I called a wholesaler . . . [--] and spoke to Hermine . . . she had been to both locations and suggested Bamboo . . . it was \"less expensive, better managed and better location for the money\".", "title": "Way better than expected!", "helpfulness": 4, "user": "EVTiger", "date": "April 24, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 7428020, "likes": {"liked": "— value and location", "disliked": "— no restaurant on-site, noisy a/c"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled on business", "text": "She was right on all counts! We stayed in room 906 . . . not a huge room, but 3, count'em, 3 balconies. Sit up in bed and look through the sliding door at a decent (slightly obstructed) view of Waikiki Beach. The room has a small but functional kitchen, a comfortable queen size bed and a 32\", cable fed, flat-screen TV. We figured out that room 1106 would have an even better view with about the same layout for the same advertised price.", "title": "great staff,great stay", "helpfulness": 4, "user": "mobilemech.", "date": "March 22, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 7201395, "likes": {"liked": "— comfortable bed ,good t.v.", "disliked": "— no microwave"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled solo", "text": "The room also overlooks the pool area and some of the nearby shopping areas . . . it is on the quieter side of the hotel away from Kuhio Street.", "title": "Great Experience", "helpfulness": 2, "user": "mas6528", "date": "March 21, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7198001, "likes": {"liked": "— Location"}}, {"rating": 4.0, "title": "everything is good so far at the bamboo", "text": "Breakfast was muffins, fruit, juices and coffee . . . fresh and enough to get your day started. They also have apples on the counter all day, every day.", "helpfulness": 1, "user": "misterspaghetti", "date": "March 9, 2007", "id": 7000109}, {"rating": 3.0, "stay_parameters": "Stayed January 2007, traveled with family", "text": "Location . . . turn right out the front door, first corner (50') turn right, go two blocks, cross onto Waikiki Beach . . . 74 seconds without running!", "title": "Great Location, but noisy!", "helpfulness": 3, "user": "Vacationrus", "date": "March 2, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 3.0, "value": 4.0, "location": 5.0, "rooms": 2.0}, "id": 6900671, "likes": {"liked": "— Location", "disliked": "— Street Noise, Mattresses"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled solo", "text": "I was so surprised at how glamorous my room was. The bed was really comfortable, and the was a huge flat screen TV in my room. From my room, I could see Waikiki beach over the buildings. The location was excellent, just 2 streets back from the beach which was nothing to walk. The price was great considering the location and my room. I found that the hotel's website provided a better deal with prices that the cheap hotel booking websites. A simple breakfast was included in the price, however I generally missed it because it finished about 9 or 9.30. I would definately recommend this hotel to anyone - singles, married couples, families and would indeed stay there again myself.", "title": "Great location, great price!", "helpfulness": 1, "user": "Husseynany", "date": "November 22, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 22091637, "likes": {"liked": "— Location and room", "disliked": "— Internet was expensive"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled on business", "text": "Upon check in at Aqua Bamboo, after a long day of traveling mania, I could not have been more welcomed by any other resort. The eager and happy doorman immediately led me into the serene entrance for Aqau Bamboo that has a calming waterfall and many other nerve soothing affects that appeal to your senses of sight, smell and sound. The staff handed me a cold bottle of water immediately. Joy Adler and Lenore Wong, the best Guest Service managers in town, treated me to incredible spoiling treats and amenities for the complete duration of my stay. From an incredibly relaxing Lomi Lomi massage that they arranged to such surprising amenities in my beautiful one bedroom suite such as goodies in gift baskets and bringing me a breakfast tray one morning, I could never find such personalized service anywhere else. Lenore Wong even made me a special Lei out of yarn and cloth that brought tears to my eyes. I have it on the wall of my living room here at home and it still brings back all the happy memories of my stay with Aqua Bamboo this month. The last day I was there she presented me with a fragrant Ginger Lei and everyone was asking what the occasion was all day long! The complete staff at Aqua is extremely helpful with directions and special dinner reservations and information. They treat you like close friends and family!", "title": "Best Personal Service in Honolulu! Like staying with friends and family!", "helpfulness": 1, "user": "KimHarwood", "date": "November 17, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 21948819, "likes": {"liked": "— Personal Service and happy staff", "disliked": "— no comment"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "I highly recommend Aqua Bamboo & Spa to anyone seeking a relaxing and rewarding visit to Honolulu.", "title": "Loved this hotel! Will definitely go back!", "helpfulness": 1, "user": "beenie1976", "date": "November 15, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 21878222, "likes": {"liked": "— How homey it was."}}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled with friends", "text": "The Aqua Bamboo was perfect. It is a smaller, quieter hotel, which makes it more personable. There are alot of amenities we didn't expect, like the I Home, the big screen tv, chairs to take to the beach, and more. It's very clean, and the staff are very welcoming and accommodating. We had a room with a kitchenette, and there were dishes, dish soap, towels, glasses, silverware, pots, pans, a toaster, you name it! it was like we had our own little home away from home. They even hold the doors open for you upon entering and leaving every time! We would definitely visit this hotel again.", "title": "Great place to stay", "helpfulness": 1, "user": "mkauai24", "date": "November 15, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 21864058, "likes": {"liked": "— location"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2008", "text": "A very clean hotel and some of the most friendly front line staff we've meet. Actually most the people we meet were very happy to help.", "title": "Leonor wong is a keeper...and so is Aqua Bamboo & Spa!", "helpfulness": 1, "user": "twokila", "date": "November 14, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 21859350, "likes": {"liked": "— complilmentary breakfast and thursday reception & free internet in the lobby , basket of fruit", "disliked": "— can you offer fresh coffee from a coffee pot? thanks"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2008, traveled as a couple", "text": "The Aqua Bamboo is in a great location. It is close to the beach at Waikiki, it is close to shopping, and close to public buses. The hotel is a great value. The hotel offers amenities that enhance one's stay (newspaper, continental breakfast, weekly cocktail hour). However, most important is the friendliness and helpfulness of the staff. The personal touch made one feel welcome and very much at home. We look forward to our next visit.", "title": "We will be back to the Aqua Bamboo", "helpfulness": 2, "user": "Fred924", "date": "December 31, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 23135893, "likes": {"liked": "— friendlimess of staff", "disliked": "— no negatives"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2008, traveled as a couple", "text": "This is a great hotel,", "title": "What a great hotel!", "helpfulness": 3, "user": "totallywirednyc", "date": "December 22, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 22906644, "likes": {"liked": "— location, pool, staff", "disliked": "— the breakfast didnt have enuf food"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2008, traveled with family", "text": "it isnt one of those huge hotels that you get lost in, it has 12 floors and it is a block away from the Waikiki Beach. The smaller size makes it perfect in the fact that everytime you come back to the hotel they know you and greet you. The rooms are actually really cool. I had the \"moderate\" room, which is the nice way of saying cheap room, but I was really surprised, nice flat screen, it has a nice kitchenette equipped with everything you need. (stove, microwave, plates, forks, knives, spoons, coffee maker, pots, pans, etc) it is very new with nice modern expresso colored wood. It isn't a normal looking room at all, and it has a nice big balcony.", "title": "Nice Stay", "helpfulness": 2, "user": "CrocDundeeCanada", "date": "December 16, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 3.0}, "id": 22791722, "likes": {"liked": "— Friendly staff and small hotel", "disliked": "— Noise in the rooms at the front side of the hotel"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2008, traveled as a couple", "text": "Downstairs in the lobby is really nice looking, they have a breakfast every morning, but it could have more stuff, it has just small muffins, and coffee. I wanted some bagels or cereal. The pool is really nice, and the rates for massage are really good, I payed $65 for a full body massage and foot bath (they just placed my feet in a bowl and dried them off, took about 12 seconds, but nice thought) Wifi worked good in the lobby, but couldnt get my laptop to work in the room, and they didnt offer help.", "title": "Could not have asked for better", "helpfulness": 2, "user": "Mrs_M85", "date": "December 13, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 22688583, "likes": {"liked": "— the inner sactuary ( the spa, and surrounding area)", "disliked": "— the shower was alittle small for our liking"}}, {"rating": 5.0, "title": "Celebrating Birthdays & Christmas at the Aqua Bamboo & Spa", "text": "Joy is a nice fresh personality who seems to enjoy taking care of the guests, she went out of her way to make sure people were comfortable. I watched her throw out 4 locals who snuck into the pool and still took care of his bloody leg. ( i wold have just kicked them out), she was really nice.", "helpfulness": 1, "user": "sherrybinger", "date": "December 12, 2008", "id": 22684585}, {"rating": 3.0, "title": "Adequate for the price", "text": "The hotel was not quite as I expected after booking a room from the website. My 3rd floor room did not look like the room pictured online, and the furniture was worn. The kitchenette had no microwave and was immediately next to the bed. The room had a great view into rundown apartment units merely feets away. Parking was very sparse, and I had to park across the street for the first 3 days. However, service was wonderful, and the hotel provided for my basic needs during my 10-day stay, though nothing more. Upon my request, a microwave was provided. The amenities were nice, including the large flat screen TV and the high speed internet. The continental breakfast was more of a morning snack consisting only of juice, muffins, and fruit. Finally, the spa and spa services are very limited. I recommend booking your spa date at a larger hotel; the prices will be comparable.", "helpfulness": 1, "user": "Asheley77", "date": "June 13, 2007", "id": 7843402}, {"rating": 5.0, "title": "Perfect pick!", "text": "I was lucky to be able to stay at this hotel for my prom night. It was a very comfy hotel that offered everything i could possibly think of. Spacious room, a bathroom with a tub/shower, kitchenette that happened to be perfect size with every ementity, two twin beds, and on top of that another master bedroom. The hotel is in a conviniant location located in the busy center of Waikiki. Another plus was that parking and check in and out service was fast and easy! It was a friendly and comfortable atmoshpere. I felt very welcomed by staying at the Aqua Bamboo. I'll definitely be looking into staying there again and also telling my family and friends about it!", "helpfulness": 1, "user": "taptasha", "date": "June 5, 2007", "id": 7769949}, {"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "-Natasha David", "title": "Great budget hotel", "user": "flowerd2004", "date": "May 24, 2007", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 3.0, "cleanliness": 3.0, "value": 5.0, "location": 4.0, "rooms": 3.0}, "id": 7694572, "likes": {"liked": "— Location, kitchenette, price (found through outside travel site)", "disliked": "— View, outdated rooms"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled with friends", "text": "I stayed at this hotel from May 17th-24th with my boyfriend and another friend. We had a one bedroom suite with a kitchenette which was great for preparing breakfast sandwiches on several occasions and storing beverages in the full sized fridge. The lobby of the hotel is very nice and comfortable with places to sit and read, relax or use the internet. The pool was nice, although it closes at 10:00pm and the hot tub was barely big enough for the three people in my group to fit in at the same time. There are some nice loungers by the pool and even cabanas with nearly full sized beds that give it a spa feel. However, not many people hung out around the hotel since the beach is just a few blocks away. This was a great location for walking around day or night with easy access to the boardwalk and major shopping areas in Waikiki. It was also close to restaurants and nightclubs and there is a full size grocery store just a couple blocks away. Overall, a one bedroom suite for three people including air from Seattle booked for $500 p/p was a steal, but don't expect anything fancy (or even Motel 6 quality) in the rooms themselves. I wasn't disappointed though because we hardly spent any time in the room except for sleeping, bathing and the occasional meal. When looking at the website, 1 bedroom suites go for $177+, which we paid less than half that price.... my suggestion, book through a different site to get a package deal because this hotel is not worth paying full price for.", "title": "What a wonderful Hotel", "helpfulness": 1, "user": "collmesunshine", "date": "May 24, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 3.0}, "id": 7684404, "likes": {"liked": "— My balcony over the pool area", "disliked": "— the cot"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007", "text": "Stayed May 2- May 9th. The staff was wonderful, the pool I am still dreaming about. Older Hotel but clean and quaint. Make sure you stay on the pool side. Rooms are clean and the price is right. Would not hesitate to stay again.", "title": "Bamboo is super cute!!", "helpfulness": 2, "user": "Rachicle", "date": "May 20, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7657077, "likes": {"liked": "— Everything...REALLY!! Location, Staff, atmosphere, etc...", "disliked": "— N/A"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "The Aqua Bamboo is just two blocks from Waikiki beach. The rooms are spacious and clean. and decorated with simple elegance. We booked a one-bedroom suite for our family of four and we had plenty of room to spread out.", "title": "Great hotel in Waikiki", "helpfulness": 1, "user": "KimSpokaneWA", "date": "August 24, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 19319414, "likes": {"liked": "— Terrific staff, great central location, spacious room"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "The staff were terrific, from the front desk to the room attendants! All were friendly, gracious, and very interested in making sure our stay was comfortable.", "title": "great honeymoon", "helpfulness": 1, "user": "vandyoakland", "date": "August 24, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 19314508, "likes": {"liked": "— veiw and pool plus close to everything", "disliked": "— maid service and no take out or room service"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled with friends", "text": "Aqua Bamboo also serves a wonderful continental breakfast every morning. And, they have onsite spa services,a pool in the beautifully decorated patio, free daily newspaper, and 24/7 coffee or hot tea. They also have onsite coin-operated laundry facilities.", "title": "Wonderful Stay at the Aqua Bamboo", "helpfulness": 1, "user": "norcalboarder11", "date": "August 21, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 19206693, "likes": {"liked": "— The friendlyness of the staff", "disliked": "— n/a"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled with friends", "text": "The surrounding area is safe and just a short walk in any direction to shopping, eating, and beaching activities. A bus stop is across the street although we did not need this.", "title": "Dont be bamboozled stay at the aqua bamboo", "helpfulness": 1, "user": "valencia0811", "date": "August 19, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 19131338, "likes": {"liked": "— the ambience of the hotel, the management was awesome", "disliked": "— nothing!!!"}}, {"rating": 1.0, "stay_parameters": "Stayed May 2007, traveled with family", "text": "My first visit to Hawaii was absolutely terrible as a result of our hotel room (\"penthouse suite\") was robbed on our first night! Fortunately for my family and I, we weren't in the suite when the robbery occurred. All of our valuables were stolen (i.e. laptop, two GPS', iPod's, family jewelry, handheld game systems, etc.). I'm curious as to why only these items were taken when there were flat panel TV's, DVD players, and CD players in the rooms that were capable of being taken also. When we brought the robbery to the attention of Aqua's staff, they appeared as if they could care less. Being the hotel's \"first\" robbery, I would expect to see embarrassment, remorse, sympathy from the hotel staff and MANAGER. NOTHING. Were were left to fend for ourselves. That same night, we left immediately and headed straight to the JW Marriott where we were treated much better.", "title": "Our hotel room was robbed!", "helpfulness": 4, "user": "smd03", "date": "May 16, 2007", "detail_rating": {"front_desk": 1.0, "business": 2.0, "service": 2.0, "cleanliness": 2.0, "value": 2.0, "location": 1.0, "rooms": 1.0}, "id": 7632381, "likes": {"liked": "— Nothing", "disliked": "— Nothing"}}, {"rating": 2.0, "title": "We were disappointed!", "text": "Be forewarned. Things are not what they appear to be at this hotel.", "helpfulness": 3, "user": "lorelaigilmore", "date": "May 16, 2007", "id": 7631938}, {"rating": 4.0, "title": "Intimate Surprise", "text": "We had a bit of expectation about the Bamboo based on the reviews here and the pictures on their website, and so we very were much let down when we arrived at the room in person:", "helpfulness": 2, "user": "shorty25rochester", "date": "May 9, 2007", "id": 7573174}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled with friends", "text": "- Our room (superior studio?) was small and very basic.", "title": "Bamboo was beautiful", "helpfulness": 3, "user": "Niababe", "date": "April 26, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7438146, "likes": {"liked": "— The room", "disliked": "— none....everything was great!"}}, {"rating": 1.0, "title": "Do NOT Believe the Pictures", "text": "- There was a kitchette right next to the side of my bed literally. I was staring at the sink and fridge sitting on the bed.", "helpfulness": 5, "user": "aussieroo", "date": "April 24, 2007", "id": 7428788}, {"rating": 2.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "We arrived expecting this hotel to be a bit dated and pretty basic but had chosen it because Lonely Planet had recommended it highly. We were a bit disappointed.", "title": "Prepare yourself for the worst mattress in Hawaii", "user": "MrDBP", "date": "June 26, 2007", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 3.0, "value": 2.0, "rooms": 2.0, "location": 3.0}, "id": 7998051, "likes": {"liked": "— The TV", "disliked": "— The Bed"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "The decor is extremely outdated, the shower was poor, but the worst thing of all was the bed - it was absolutely appalling! I literally ended up sleeping on the floor for 3 nights in a row and my hips and back were aching during the day as a result.", "title": "I will be booking the Bamboo again for sure", "helpfulness": 3, "user": "cherylani", "date": "June 22, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "business": 4.0, "cleanliness": 4.0, "rooms": 4.0, "location": 5.0}, "id": 7959355, "likes": {"liked": "— Location and LCD TV"}}, {"rating": 5.0, "title": "great hotel and staff", "text": "It seems bizarre that they would put flat screen TVs in each room but not replace the beds.", "helpfulness": 2, "user": "lennyPerthAustralia", "date": "June 13, 2007", "id": 7844962}, {"rating": 3.0, "stay_parameters": "Stayed September 2011, traveled with friends", "text": "I'd have to say that I feel mislead by the high rating on Trip Advisor. Stayed at the Aqua Palms the last time I was in Oahu, which is why I chose to stay this time with the Aqua Bamboo. We had the room with a kitchenette and 2 double beds. The furniture looks worn and frayed, room is very small. The bathroom needs renovating. The bathroom sink was fitted with a large tall faucet, it would be more appropriate for a kitchen sink. We were on the 7th flr facing the street, very noisy. Did like the fact that they had tea in the lobby. Was a very short walk to Waikiki beach. I would not stay here again.", "title": "Not impressed", "helpfulness": 2, "user": "luvs2travelSfCa", "date": "October 28, 2011", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 4.0}, "id": 119844156}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled with friends", "text": "During a recent October trip we stayed at the Bamboo for 2 nights. The staff were lovely upon check in and all very helpful. The room was alright, large and clean but was on the second floor, near the laundry and I would recommend any visitor to ask to stay on a higher floor because there was a smell in the hallways and my view overlooked some resident flats, which is alright for 2 nights but not great for a longer period of time. Overall we were hardly in the hotel and the construction outside was not intrusive at all. The pool area was quiet and away from the noise of the main strip. I would definitely go to O'ahu again but unlikely to Waikiki but if I did, I would stay here again.", "title": "Great location", "user": "Andie2011", "date": "October 28, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 119820471}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "During a recent October vacation my girlfriend and I had the pleasure of staying a week at the Bamboo. I really liked this place,but first things first. This isn't no mega, cookie cutter hotel on the main strip. This is a smaller, older, more personable hotel off the beaten path. And when I say older it is very tastefully renovated with it's own classy style.", "title": "All good!!!", "helpfulness": 4, "user": "BobAbooey505", "date": "October 26, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 119762245}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled with friends", "text": "We were upgraded to a one bedroom suite, which I fully appreciated! The room was clean, comfortable and very nice. I really loved the feel of this place, it had the feeling of another time and place (well at least for Waikiki). The staff at the front desk was great, zero complaints at all! I would stay again at this hotel without hesitation and I would recommend this hotel to anyone looking for a nice affordable hotel off the beaten path.", "title": "Great location", "helpfulness": 1, "user": "Andie2011", "date": "October 23, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 119630728}, {"rating": 2.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "My only negative comment would be the noise on Kuhio Ave. I would recommend getting a room opposite the street. Kuhio Ave is a noisy street! I realize the hotel has no control over the traffic, sirens, the trash trucks or the drunks yelling in the street in the middle of the night but they're there...... Don't say I didn't warn you!", "title": "Room quality average, Major construction work, Good Location", "helpfulness": 1, "user": "Blackjack_123456", "date": "October 22, 2011", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 3.0, "sleep": 2.0, "rooms": 2.0, "location": 4.0}, "id": 119609699}], "location": {"country": "United States"}, "stars": 3, "variance": {"poor": 67, "average": 137, "very good": 415, "terrible": 38, "excellent": 578}, "aka": "Aqua Bamboo Waikiki Hotel Honolulu", "slim_ranking": 0.192771084337, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.0, "rooms": 4.0, "location": 4.5}, "description": "Aqua Bamboo Waikiki is an intimate, Southeast Asian-inspired, renovated boutique hotel located 1½ blocks to the beach. This oasis in the heart of Waikiki offers the following FREE amenities: in-room Internet access and WiFi Internet access in lobby & poolside, daily local newspaper, local & toll-free calls, 32-inch LCD TV’s, mini-refrigerator, microwave, coffeemaker, stove-top in studios & suites and safe. The lush outer sanctuary includes a saltwater pool with waterfall, jet spa, sauna, barbeque grill and cabana."}