{"user_rating": 4.5, "review_count": 745, "name": "Aquila Elounda Village Hotel", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "We booked our all inclusive package via Thomson and were very happy with the description on the website, which gives accurate information and pictures. On arrival we were very happy with the check-in process and concierge facilities. Everything was explained to us and the staff really couldn't have been more pleasant friendly and helpful (a common theme here). We had a sea-view bungalow room which was very pleasant and had a nice balcony with a good view of the bay. One slight niggle was the volume of noise from the nearby hotel, just behind and a little down the hill from us.. Whilst Elounda Village is a tranquil environment itself they can't control their neighbours.. Not a big hassle, just a small niggle really...", "title": "Summer holiday 2013", "helpfulness": 1, "user": "Gary J", "date": "July 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 169600357}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "One thing... If you are on an \"all inclusive\" package.. Make sure you understand the terms and what really is and is not included... Many drinks and menu items carry a charge so choose carefully as there are some pretty arbitrary rules in place.", "title": "Heaven on earth", "helpfulness": 2, "user": "jennifermilesskov", "date": "July 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 169517287}, {"rating": 5.0, "stay_parameters": "Stayed July 2013", "text": "Wi-Fi is available but not in the rooms so you need to go to the lobby or the wi-fi corner to check your mails etc (still on the fence on this one as on the positive side it checks the urge to read mail from work... I think on balance it's ok but the link when you do use it needs an upgrade as it's pretty slow).", "title": "Woooow fantastic", "helpfulness": 1, "user": "Apwilcox", "date": "July 28, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 169452434}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "Housekeeping was not up to 5 star standards however, and we felt that the room got a daily \"cursory going over\" rather than a proper clean and you don't want to look under the bed too hard! Also had to chase to get the \"included\" mini bar filled daily (and no we weren't overdoing it... a coke and a beer in the evening is all).", "title": "Wonderful relaxing holiday!", "user": "martyRedcar", "date": "July 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 169418388}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "While I'm on the negative (trust me I'll stop soon) Symposium, one of the 2 a la carte restaurants is simply not up to scratch either on food or service, we actually preferred the main buffet restaurant to be honest... This is unfortunate as two of the Theme nights (Asian and Greek) are held there.. Greek was ok-ish but the Asian night food resembled a pretty ropey chinese take-away back home.", "title": "Lovely holiday but a little isolated.", "helpfulness": 1, "user": "Jacqui F", "date": "July 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 169416298}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "This is by far the best hotel and holiday we have had so far!!. Just got back from 2 weeks of pure heaven!! We are already booking for next year! We met others that were already repeat guests and one gentleman was on his 5th year! The views are truly breathtaking and photos just cannot do it justice!", "title": "Outstanding!!! Truly Wonderfull. Simply The BEST", "helpfulness": 1, "user": "Jilly0140", "date": "July 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 168444005}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "We stayed on an all inclusive basis, and booked a room with a shared pool, so we were automatically upgraded to \"Mythica\" status. This gave us even greater privilages. We were greeted by Maria the Guest Relations lady who explained everything we needed to know about the hotel. She then personally showed us to our room. I was fighting back tears when I saw our room, pool and stunning views. There was a vase of red roses, an ice bucket contining a bottle of sparkling wine, some Greek sweets, a basket of fresh fruit and a bottle of white wine.", "title": "A fantastic and memorable holiday", "user": "Bearsted2", "date": "July 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 168407887}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "Our Mythica status also meant we had a newspaper of our choice delivered to our room every day. The fruit basket was renewed every other day. We had a lovely range of \"spa\" like shampoos and shower gels which were replenished as soon as we used them. We had \"turn down service\" in the evening with a chocolate waiting or us on our pillows. We had unlimited use of all the restaurants (we mainly ate both lunch and dinner at the wonderfull Mirabello, overlooking the bay). We could choose anything from the menu in the evenings (even the ones without the house sign) at no extra cost except for the \"Highlight\" dishes. We attended all the themed evenings at no extra cost except for the Lobster Night which we payed 35 euros each. Live music was played at these events and dinner was 5 courses. The food was amazing and I have gained over half a stone in weight!!. The main course was covered in a silver dome which they lifted off in unison. I dropped my knife and immediately it was retreived off the floor and a clean one was brought to me on a napkin covered plate. We usually had a bottle of white wine and a bottle of water which was sat in an ice bucket next to us (even at lunch time) We didnt even pour our own wine as our glasses were refilled as soon as we drank.", "title": "Lovely Hotel", "helpfulness": 1, "user": "Lucky_traveller_8", "date": "July 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 168295944}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "I found the range of drinks very good and a comprehensive list of cocktails. We need not have spent a penny and didnt move from the hotel for our whole 2 weeks (we didnt want to). I would not even entertain Half Board. We met a couple who started on half board but upgraded to all inclusive while they were there, however their holiday still cost them £600 more than we paid and they had a standard room and no Mythica Package!!", "title": "DID NOT DELIVER!", "helpfulness": 1, "user": "Chocolategin", "date": "July 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 2.0, "sleep": 5.0, "rooms": 5.0, "location": 1.0}, "id": 168264145}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "We had 2 weeks of blissfull relaxation and pampering!! I cant speak highly enough of this hotel and we really didnt want to come home!", "title": "Great hotel with fantastic food!", "helpfulness": 2, "user": "Janine H", "date": "July 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 168164029}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "just a couple of words.", "title": "simple perfect", "helpfulness": 4, "user": "OlyaKiseleva", "date": "July 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 135352611}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "delicious food with incomparable orange fresh, sophisticated interior, free wifi, luxury toiletry for lovely guests, the best sea ever, perfect staff with fluent english/german/russian, i don't actually know, but maybe hindi and mandarin too. great location.", "title": "Wow!", "helpfulness": 6, "user": "RussellSchultz", "date": "July 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 3.0}, "id": 135249392}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "visited this hotel 4 times and it's not the end. recommend it!", "title": "Very Relaxing Holiday", "helpfulness": 5, "user": "mildredmuffin", "date": "July 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 135243612}, {"rating": 5.0, "stay_parameters": "Stayed July 2012", "text": "What a stunning hotel. So beautifully laid out with low-rise bungalows and apartments and the gardens, the olive groves and the beach area were picturesque in the extreme.", "title": "Fabulous Hotel", "helpfulness": 3, "user": "ELE09", "date": "July 23, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 135155054}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "The hotel is a little remote, but the local taxi service is fast, efficient and not too extortionate.", "title": "Relaxing holiday in an excellent hotel", "helpfulness": 6, "user": "DavidGe0rge", "date": "July 22, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 135080090}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "We stayed at The Aquila Elounda Village Hotel 14-21 June 2012. First time to Crete and without hesitation we would stay there again. I have stayed in various places Canaries Canada USA Jamaica Bahamas and without doubt have never met more friendly helpful staff. I have looked at some reviews since we got back and wonder how some negative comments can be justified. This hotel warrants the 5 star rating, the setting is quite stunning.", "title": "Fantastic Holiday", "helpfulness": 2, "user": "andrew w", "date": "July 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 134947132}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "Couple of tips, the all inclusive package is essential, not just for alcohol, but water and soft drinks. A bottle of house wine E20 glass E5, beer E4.50, bottle of water E2-4. People we talked to on half board wished they had booked all-inclusive. There are a lot of steps from the hotel to beach/pool. The safari trip is a must. If money allows book a superior sea view, the upgrade is well worth it.", "title": "Perfect in every way.", "helpfulness": 6, "user": "ShuntManchester", "date": "July 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 134705074}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "Finally Thomson reps brilliant- our thanks especially to Liz for sorting the engagement for us. Nice touch thank you. Lorraine & Andy", "title": "Nice Holiday", "helpfulness": 5, "user": "tessa201103", "date": "July 17, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 2.0}, "id": 134611195}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "We're on the last couple of days of our stay at the Elounda Village, this really is a stunning place, every tiny detail is taken care of. I'd recommend upgrading your room to include a shared pool, especially if it's as hot as it has been this week.", "title": "Fantastic hotel", "helpfulness": 4, "user": "klleigh", "date": "July 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 134537937}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "I'd also recommend AI as the benefits far far outweigh the cost.", "title": "Best Holiday Ever .... Didnt Want to Leave", "helpfulness": 5, "user": "lisa d", "date": "July 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 134514079}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "Just returned back from a week all inclusive here, absolutely loved it!", "title": "Fantastic hotel with amazing views- feel refreshed and relaxed!", "helpfulness": 2, "user": "SARobinson", "date": "August 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 136388360}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "Good points- clean, tidy, beautiful scenery, stunning views, comfy big beds, good A/C, hot powerful showers, room serviced daily, beach towels provided, always managed to get a place on sunloungers- a massive plus! Choice of place to eat dinner and lunch- so didn't get bored, large range of foods/drinks provided on the all inclusive, particularly loved the local white wine. Mini-bar in room, great to have chilled water in your room. The staff were AMAZING- i so hope they are paid well, they deserve it!", "title": "Was good but wont come back", "helpfulness": 1, "user": "Noa B", "date": "August 5, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 136285765}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "Bad points- Very windy most days, can be quite annoying trying to read your book by the pool when its blowing a gale. Obviously nothing the hotel can do about this, just to note. There are lots of steps and slopes, would be a nightmare for less mobile people to get around- i don't recommend it if you struggle to climb stairs at all. I did get some bites, so don't forget your insect repellent. The mini bar wasn't re-stocked daily as promised in the literature. I hated having to NOT put tissue down the toilet, but just part of visiting Greece i guess.", "title": "Lovely setting for a complete chill-out", "user": "Nicki29Bath", "date": "August 5, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 136282220}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "Overall a very enjoyable and relaxing holiday!", "title": "Wonderful Holiday", "helpfulness": 8, "user": "Jacqui M", "date": "August 4, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 136198673}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "We stayed in the hotel for 4 nights 7/30-3/8. The location, if you rent a car or plan on never leaving the hotel is more than amazing. Eluanda is a beautiful area with great beaches and villages and the hotels private beach is amazing. The hotel itself, if you are not coming as a Thomsons guest isn't worth the visit. All the major activities were aimed to that group also the advisers, we felt no extra value from the hotel pretty much slept and had breakfast/dinner. The people working at the hotel were very very nice and pleasant. Food we expected much more after reading the reviews. Very romantic but a bit old.", "title": "We loved our stay !", "helpfulness": 4, "user": "Sunny075", "date": "July 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 135817466}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "Just returned from another wonderful week here all inclusive. This is the only time we have gone on holiday to the same place. We usually think its a bit boring to keep going back to the same place but we loved it that much we did just that! Staff pretty much the same as last year, all still keen, happy, polite, just great! Can't recommend it highly enough.", "title": "Still fantastic one year on", "helpfulness": 3, "user": "SARobinson", "date": "August 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 170445597}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "We booked this hotel through Thomson holidays and upgraded to a superior seaview room with the premium all inclusive. I would definitely recommend doing all inclusive if you can as it works out cheaper in the long run than paying as you go along. The hotel is adults only, which suited us perfectly and it is very quiet and relaxing as a result.", "title": "Fabulous Hotel", "helpfulness": 4, "user": "Daftbatt", "date": "August 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 170412847}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "We were in room 453 which was stunning, as was the amazing sea view from the good sized verandah. We did consider upgrading further to a swim up room with provate sunbeds on the verandah but from what we could see their verandahs spent a significant part of the day in the shade so decided not to bother. Our room was very generously proportioned, beatifully decorated and spotlessly clean (a standard maintained throughout out 2 week stay by our very thorough cleaning lady). There was a bottle of champaagne on ice waiting for us when we arrived in our room along with a welcome bottle of wine, pastries and a fruit bowl which was topped up throughout our stay. The bed was huge and very comfortable and they offer a choice of pillows, although we just stuck with the ones that were there on arrival. There is a free minibar which is restocked daily with water, a selection of soft drinks and fruit juice and beer which is a lovely touch. There is an excellent air conditioning system which is not too noisy and can be set to your personal preferences.", "title": "Wonderful romantic getaway!", "helpfulness": 3, "user": "UkBronte", "date": "August 1, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 170339441}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "The bathroom and dressing area can be shut off from the bedroom area with a sliding wall/screen. It contains generous wardrobe and storage space with, unusually for hotels, an abundance of hangers. There is also a programmable safe in teh wardrobe area. The \"bathroom\" is really a wet room with a bath and huge double shower area all enclosed by a glass screen wall. There is a choice of shower type with the standard shower head and a fabulous huge rainfall showerhead and there was always plenty of hot water. There is an area with twin sinks and a generous selection of complimentary toiletries, again restocked throughout the stay and a decent hairdryer in this area.", "title": "Definitely Heaven on Earth", "helpfulness": 7, "user": "Watty34", "date": "August 1, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 170266669}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled with friends", "text": "Although we had booked AI we did intend to eat out some nights but only actually did so once due to the variety of food available at the hotel. There are two a la carte restaurants, Mirabello and Symposium which you can book in advance, in addition to a buffet style restaurant. With premium AI you can eat luch and dinner in both a la cartes as much as you want, although you do have to book for dinner at least 24 hours in advance. Each restaurant also has themed nights - my advice would be to book any of these you want to attend for the week ahead in the first couple of days as the themed nights do get booked up quickly. If you are on AI all these themed nights are included except the lobster night for which there is an additional charge but with 7 courses it was definitely worth it.", "title": "Its good, dont worry............", "helpfulness": 1, "user": "Pete W", "date": "July 31, 2013", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 170138271}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "We stayed here beginning of July and had the most chilled out holiday!! The hotel is spotless and the rooms are lovely especially the extremely comfortable bed didn't want to get up every morning. We had a ground floor room with a fantastic sea view. We ate in the main dining room every night as we were half board,(hotel seems to cater more for all inclusive, we asked about upgrading but felt that 39e per person per day was a bit much especially as we aren't big drinkers or eaters!) we found the choice of salads, fresh bread and the desserts superb but didn't feel the main courses were up too much maybe we're just fussy as most other reviewers seem to love all the food. We felt the price of drinks was well over the top even by hotel standards nearly 17e for 2 gin and tonics did seem a bit steep. Loved the fact that they didn't allow people to reserve sunbeds anyone that did had their towels etc removed and it seemed to be mostly british people that did this! The sunbeds were also very comfortable and quite well spaced apart.The location is lovely and whilst you can walk to Elounda which we tried, its along a road with no pavements and is quite busy, it takes about 45 mins unless you're a marathon walker (see other reviews) we used taxis 7e each way. We also took a trip to Spinalonga which we booked in Elounda itself much cheaper than Thomson. The island is very interesting to wander around but you only get an hour there as they seem to like a steady flow of visitors. We also went on the Happy Train for a 3 hour trip into the mountains and would really recommend this, Ziggy and his driver (sorry can't remember his name) were extremely funny and very easy to listen to. We passed through Plaka, if you get time please visit this village as it is very pretty with lovely shops and restaurants. We also went to Agios Nikolaos which is very good for present shopping, eating especially around the lake and photo taking. If we go back to Crete will certainly return to this hotel.", "title": "The most relaxing holiday...................", "helpfulness": 3, "user": "whiteywhiteHilperton", "date": "July 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 135693786}, {"rating": 4.0, "stay_parameters": "Stayed June 2012", "text": "Mostly a very pleasant stay - location not ideal if you wish to stroll out of the complex - you need a taxi.", "title": "Shame about the food!", "helpfulness": 3, "user": "Breezeseeker", "date": "July 29, 2012", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 3.0, "service": 4.0, "rooms": 4.0}, "id": 135681187}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "The whole resort is well maintained, v clean and provides good service - entertainment fairly decent also. Plenty of sunbeds - we seemed to be able to secure the same most days and virtually had sole use of a small pool.", "title": "Fantastic Place", "helpfulness": 14, "user": "Dave_Erimus", "date": "July 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 135675770}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with friends", "text": "Bedrooms were good, v comfortable bed with comforter, duvet and stocked mini bar.", "title": "Superb five star luxury", "helpfulness": 9, "user": "Yorkie069", "date": "July 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 135451605}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "Only down side - didn't really enjoy the food that much - had better. It was ok - nothing awful but always in the cold side and not that interesting however having said that we didn't go hungry! Rose house wine very good!", "title": "\"Paradise\" - best holiday ever", "helpfulness": 5, "user": "Giggy23", "date": "July 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 135433845}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "We’ve just enjoyed an excellent week at this spacious and good quality hotel.", "title": "Really enjoyed it.", "helpfulness": 1, "user": "Cardiff2", "date": "July 26, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 169148291}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "We arrived very late and were gratified to find a meal and drinks awaiting us in our room.", "title": "Great value but not for beach-lovers", "helpfulness": 1, "user": "John G", "date": "July 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 3.0, "location": 3.0}, "id": 169143271}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "We’d booked a sea view room and, when we reached it, we saw that the sea view was a bit of a technicality. Yes, you could see a sliver of water in the far distance, but the main view was of the arrivals area at the front of the hotel.", "title": "Elounda Magic", "helpfulness": 3, "user": "Wooster50", "date": "July 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 168839251}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled with friends", "text": "We spoke to the rep who told us that we’d been ‘upgraded’ and that our room, though away from the main complex, was far larger than any others. It was indeed a good size, nicely appointed and relatively private, so we allowed ourselves to be persuaded. On balance, that was probably the best decision. The balcony was spacious, there was a chaise longue in the room and the bathroom was all marble (but with a glass door!)", "title": "Good time!", "helpfulness": 1, "user": "specialsix", "date": "July 22, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 168522867}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "The food at the hotel – particularly at the a la carte restaurants – was exceptionally good, and the buffet meals were high quality with plenty of choice. The staff were all very pleasant, cheerful and helpful.", "title": "11 nights of peace", "helpfulness": 2, "user": "norgroves", "date": "July 22, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 168522216}], "location": {"country": "Greece", "continent": "Europe"}, "stars": 5, "variance": {"poor": 14, "average": 60, "very good": 240, "terrible": 7, "excellent": 424}, "aka": "Aquila Hotel Elounda", "slim_ranking": 0.153846153846, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.0}, "description": "The Aquila Elounda Village ELOUNDA in Elounda, an exclusive couples and adults only Hotel, for those who seek privacy as long as luxury, set amongst beautiful gardens and magnificent view of the Mirabello bay."}