{"user_rating": 4.0, "review_count": 208, "name": "Arabella Hotel and Spa", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "Spent two nights at this lovely resort. The rooms are elegant, the views are incredible! We dined at both restaurants, the Laguna Bar serves the best burgers in SA! Jamani combines fine dining and hospitality easily. We also experienced the spa, where we had the African Rainforest experience. This was one of the best spas I have ever been to. Our therapist, Janine, saw to our every need!", "title": "Do yourself a favour...Stay here!", "user": "Bathory139", "date": "September 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 176254997}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "Our arrival was unplanned and we decided to turn a negative experience into an enjoyable family stay with the most interesting golf course and sufficient vibe and ambiance to relax for the weary traveller. It is truly remarkable what a positive change in management and ownership can do for a established hotel and golf paradise. I normally come to hermanus, kleinmond area to dive and swim now we come to rest, recover, rejuvenate and refresh. The team is awesome the food divine, the view to die for and the rest and recovery unparelleled. Take a short left or a long right and make this your conference or holiday destination of choice.", "title": "Arrival and advice", "user": "Robert Daniel P", "date": "September 3, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 175614966}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "I really enjoyed our stay at Arabella. The grounds are beautiful, the rooms are luxurious and the service is great - very friendly and overall professional.", "title": "Beautiful facilities, friendly staff", "user": "Deidre J", "date": "September 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 175225340}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled on business", "text": "I loved the fact that the bathroom wall slides open so that I can watch TV from my bubble bath :)", "title": "Everything Good", "user": "Glen W", "date": "August 28, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 174451988}, {"rating": 4.0, "title": "Anniversary getaway", "text": "I would definitely stay here again", "helpfulness": 1, "user": "Kay and Desmond C", "date": "August 12, 2013", "id": 171913001}, {"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "We stayed at Arabella from 22 Sept. 25 Sept and had mixed fortunes. The irrigation being put into the golf course spoiled some of the holes and the wind made it that much harder. The second day the halfway house was not up to speed. The room was very good especially overlooking the lagoon and golf course. The breakfast was excellent but the service in the Lagoon lounge on the Monday was very slow maybe because of the few waiters on duty. We also had a lot of problems with our room key card not working but overall it was a pleasant visit.", "title": "The golf experience", "helpfulness": 1, "user": "Thys W", "date": "September 26, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 178720443}, {"rating": 5.0, "stay_parameters": "Stayed September 2013", "text": "We spend 3 nights at this Hotel and enjoyed every moment. We were there during the week. Rooms great and clean,nice views - ask for lagoon view rooms from floor 3 - 5,the higher the better views , nice balconies.", "title": "Nice relaxing", "helpfulness": 1, "user": "tastinggirl", "date": "September 24, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 178461114}, {"rating": 3.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "Breakfast excellent and the best thin crisp pizza's for lunch or dinner, food great.", "title": "Remember to ask which floor your room is on", "helpfulness": 1, "user": "Roberta718", "date": "September 20, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 177876123}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "We went for a run early morning on golf course. ....before t off time ....stunning!!", "title": "Don't hesitate - Stay at The Arabella", "helpfulness": 1, "user": "SandyM053", "date": "September 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 177525753}, {"rating": 4.0, "stay_parameters": "Stayed September 2013", "text": "It was our 21th wedding anniversary and went for a back massage in a couples room that was great. Spend every day some time in the hydro pool and steamroom....the area is nice and relaxing. ....no kids and relaxing music....great spa.", "title": "Excellent", "user": "GusBehn", "date": "September 14, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 177112908}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "The Arabella Hotel is an amazing property located near Hermanus and the wine country in South Africa. Although this property is a little out of the way, it is so beautiful and has a great deal to offer for a couple days away. There is a good golf course, for those enthusiasts. It has a lovely spa, and a casual and nice restaurant on site. The rooms are spacious and the entire property is kept up so beautifully. The staff very warm and helpful. Definitely a relaxing place to get away.", "title": "Beautiful location near the wine country", "helpfulness": 2, "user": "BchVball", "date": "October 30, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 182974977}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled on business", "text": "This was my third visit to the hotel, once again for a conference. The setting is the single best feature, with views out towards the lagoon, although there is no beach to speak of. It also has a golf course for those that are that way inclined. I'm not, but it makes for wonderful early runs on the fairways before the golfers get underway.", "title": "Great setting, helpful staff", "helpfulness": 2, "user": "JamesSouthAfrica75", "date": "October 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 181582902}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled on business", "text": "Check in was efficient, but with the slight hiccup of my key card not working and having to make the walk back to reception to have the problem rectified. I had a view nice towards the pool, but not too close to it and with foliage screening it. Views towards the lagoon are however far superior. The room was clean and modern. The staff very helpfully supplied me with toothpaste, having forgotten my own. Spas are not really my thing, so didn't make use of it and thus can't comment on this aspect.", "title": "Amazing place....always happy to come back...", "helpfulness": 2, "user": "jollofmaster", "date": "October 14, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 180989725}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "Buffet breakfast was really good and service efficient and friendly. Check out was fast and friendly. I really enjoyed my stay and look forward to returning.", "title": "Stunning", "helpfulness": 2, "user": "Stevie19", "date": "October 11, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 180579626}, {"rating": 3.0, "title": "Disappointing", "text": "Was at the Arabella for a conference and stayed 3 nights...my 3rd trip", "helpfulness": 2, "user": "Akona N", "date": "September 29, 2013", "id": 179099567}, {"rating": 5.0, "title": "Great weekend away", "text": "Just returned from an enjoyable and much needed break at the Arabella. I was really looking forward to our weekend away, and the hotel did not disappoint. All the staff we encountered were friendly and helpful, the rooms were spacious and the breakfast was delicious.", "user": "Ms_Sadien", "date": "August 11, 2013", "id": 171765339}, {"rating": 5.0, "stay_parameters": "Stayed November 2012", "text": "The indoor pool was a lot cooler than we expected, but the sauna and steam room provided the heat we wanted.", "title": "Superb", "user": "mpougnet", "date": "August 4, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 170662945}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "We ordered a calamari salad from the in dining menu and I must say, the calamari resembled crumbs that you would find at the bottom of a KFC barrel. I'm not sure if the squid disintegrated when fried or what.", "title": "Excellent & Friendly Staff", "user": "Vincent M", "date": "August 1, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 170242416}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "Loved the stay at Hermanus Arabella. The pool is fantastic and the hotel is proper luxury! There are some awesome trails to mountain bike too. Perfect for golfers and anyone else... The indoor heated pool offers a nice relax after a long day in the sun!", "title": "A cut above the rest", "user": "Elaine M", "date": "July 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 169764280}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "My wife and I spent the weekend of 26 July 2013 at the Arabella Hotel and Spa near Hermanus. It was a quiet get away to celebrate her birthday. I contacted the spa and hotel beforehand to arrange a treatment and flowers respectively. When we arrived we were warmly greeted, the flowers were in the room and everything at the spa had been arranged.", "title": "an excellent holiday", "user": "Jynie S", "date": "July 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 168740945}], "location": {"country": "South Africa", "continent": "Africa"}, "stars": 5, "variance": {"poor": 10, "average": 19, "very good": 65, "terrible": 15, "excellent": 99}, "aka": "Arabella Hotel", "slim_ranking": 0.777777777778, "description": "The Arabella Hotel & Spa is situated just over an hour's drive from Cape Town, South Africa. The hotel delivers grandeur in design and style that pays homage to the rare beauty that surrounds it. Luminous colours, soaring wooden beam ceilings and unique designs welcome you while attentive and gracious service enhances the experience of complete comfort and warmth. As you are surrounded by the majestic Kogelberg Mountains and bordered by the vast Bot River Lagoon, indulge in a sensory experience that will leave you with treasured memories. Savour the beautiful aromas of fresh salty sea air and fynbos; distinctive sounds of exotic birdlife and enriching sights of emblematic green mountains and sparkling waters that meet an indigo sky. The Arabella Golf Course stretches through Rolling fairways, deceptive bunkers and challenging water traps await you in this golfer’s paradise. You may get distracted by the Bot River Lagoon and indigenous wild flowers, so concentration is a necessity. Your stay would not be complete without a visit to the Arabella Spa. This glorious retreat captures the essence of luxury, privacy and rejuvenation that is at the heart of your stay. Beyond this blissful escape, the destination offers a number of activities to guide you on your path towards complete relaxation. Explore the Overberg with its magnificent charms and treasures that await you. Be enriched by exciting quad bike rides, kayaking expeditions at sea and lazy horseback rides while golden shores and serene Botanical Gardens will leave you in awe of its unspoilt beauty. A valley of vineyards and wine and historic museums invite you to absorb the town's legacy; magnificent hiking and mountain biking trails and captivating boat rides with the ocean's big 5 will leave you inspired."}