{"user_rating": 4.5, "review_count": 25, "name": "Aramis Holiday Flats", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "My husband and I stayed for a week during the Christmas holidays.", "title": "Felt like locals - excellent apartment, great hosts", "user": "LagunaGrrl", "date": "January 3, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 52475806}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled with family", "text": "LOCATION: On the south end of the medieval core, the apartments are easy walking to everything you'd want to see as a tourist, yet just far enough away that we felt we were staying where the locals really live. It's an easy 10 minute walk from the train station or you can catch a quick cab ride. There are bakeries, a butcher, a grocery store and an excellent laundromat all within steps of the building - just about as convenient as it gets.", "title": "Perfect home away from home in Bruges", "user": "lulusmom", "date": "December 11, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 51068821}], "location": {"country": "Belgium", "region": "Flanders", "continent": "Europe"}, "variance": {"poor": 0, "average": 2, "very good": 4, "terrible": 0, "excellent": 19}, "aka": "Aramis Holiday Flats Hotel", "slim_ranking": 0.0833333333333, "description": "The Aramis property is an 18th-century stylish house entirely renovated into 6 elegant and inviting apartments, located a few minutes from all of Bruges' best attractions. The famous Museums, the romantic canals and beautiful churches are just a short stroll away. Around the corner you'll find the open space of the Minnewaterpark, the enchanting Lake of Love, and the 'world-Heritage Beguinage'. The Aramis apartment has a pleasant living room with a sitting and dining area, a fully equipped kitchenette, one generous bedroom with fitted wardrobes. The bathroom with white and blue tiles has a trendy shower, heated towel rails, hairdryer and large mirrors. There are also very comfortable sleeping facilities in the sitting area of the living room in each flat. Amenities include cable-TV, CD-DVD player, bed and bath and kitchen linen. Free Wi-Fi. The non-smoking holiday apartments can be rented by the week, midweek or weekend, min stay 3 nights. Special rates/longer stays. Railway station = 10min walk."}