{"user_rating": 4.0, "review_count": 249, "name": "Aranvert Hotel Kyoto", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled with family", "text": "We stayed for 5 nights - 2 adults & 1 child.", "title": "Loved it", "helpfulness": 4, "user": "tobegold", "date": "April 9, 2007", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 3.0}, "id": 7302679}, {"rating": 3.0, "stay_parameters": "Stayed March 2007, traveled with friends", "text": "Rooms are a good size, hotel is very clean, staff is very helpful. There are 2 coin washing machines & 2 dryers on the top floor. We did not use the baths, though saw many going to & from. The restaurant is very good and we ate dinner there twice, the breakfast buffet on the other hand is 1,732 Yen and we only tried it once. A very short walk to the subway and bus stops. I would stay here again. Taxi is 640 Yen (min charge) to the JR station.", "title": "Modest hotel but reasonable", "helpfulness": 4, "user": "Froggggie", "date": "April 4, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "location": 3.0, "rooms": 3.0}, "id": 7281771, "likes": {"liked": "— staff friendliness", "disliked": "— no in room safe"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled solo", "text": "A very clean hotel, rooms not too small by Japan's standards. Very helpful and friendly staff who were always very willing to provide directions, etc. Not a lot to see in the immediate vicinity of the hotel, but it's about 20 minutes walk to the main shopping street (Shijo). Overall, a positive experience!", "title": "Clean, with very helpful staff", "helpfulness": 1, "user": "Melbournite123", "date": "July 22, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 3.0, "rooms": 4.0}, "id": 8217838, "likes": {"liked": "— Cleanliness, friendly staff"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled with friends", "text": "We immediately booked a room here after discovering bed bugs at the New Miyako hotel. The staff was extremely accommodating and the room", "title": "Fantastic!", "helpfulness": 6, "user": "LC456", "date": "May 25, 2007", "detail_rating": {"cleanliness": 5.0, "front_desk": 5.0, "service": 5.0, "location": 5.0, "business": 4.0}, "id": 7696614, "likes": {"liked": "— Cleaniless, price, location", "disliked": "— none"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled solo", "text": "was very clean. Great location (within walking distance to the Gion district) and close to major subway stations and buses.", "title": "Excellent stay", "helpfulness": 6, "user": "Traedmawr", "date": "April 22, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7415098, "likes": {"liked": "— Excellent value for money and quality", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled on business", "text": "Stayed 5 days at this tower hotel, easy to find in central Kyoto very close to Gojo subway station. The hotel is modern and very clean, with very friendly and helpful English-speaking staff. The twin-bed rooms, although not spacious, are big enough and very well appointed, with tea/coffee making etc, but only Japanese TV channels. The buffet breakfast, with Japanese and European choices is excellent value at Yen1700, and the restaurant also offers reasonable meal deals throughout the day. The Onsen spa bath on the 13th floor is quite an experience (no bathing costumes, please!). We would definitely stay there again.", "title": "Conveniently central, clean and comfortable", "user": "tfc10", "date": "October 18, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 10114219, "likes": {"liked": "— Very modern with free unlimited internet access", "disliked": "— Lack of pool/gym"}}, {"rating": 3.0, "stay_parameters": "Stayed October 2007, traveled with family", "text": "Got a fairly good rate for the time of year. Would have liked to have stayed at one of the hotels by Kyoto train station/Bus Terminal (like the Granvia) as Kyoto is so easily navigated by bus, but rates for those hotels were very high. Still, the Aranvert was just down the street about 3 blocks from the station. A 15-minute walk or so. The hotel has a lovely lobby and the staff was very professional and courteous. You pay for your entire stay when you check in and they provide a receipt immediately. We had a double room and found the accomodations very clean. The carpet was stained by a bit of coffee, but looked fairly new otherwise. Bedspreads looked clean, and the bed was very comfortable. Great shower and bidet-toilet. My mother enjoyed the public bath very much - she went twice out of 4 nights. I wouldn't hesitate to recommend this hotel to anyone: families, elderly, singles, but I would try to book early and get into one of the hotels right across the the street from Kyoto station. Also, you could buy your one-day bus pass from the front desk, which was a nice service.", "title": "Nice 3-star hotel; well-located", "user": "ChgoGal11225", "date": "October 16, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 4.0}, "id": 10087810, "likes": {"liked": "— Comfortable Bed", "disliked": "— No free b'fast"}}, {"rating": 2.0, "title": "DIrty rooms, really basic, checked out before staying even one night", "text": "Dismal little room with stains on the bed cover and big clumps of someone else's hair on the floor by the window. The carpet had clearly not been cleaned. Its a pretty miserable little hotel, in dire need of a refurb. We were given a non smoking room which reeked of cigarettes too. I complained and was given a different room (having been told it was a \"non-smoking\" room because they had used air fresheners to get rid of the smell of smoke (ie its a smoking room, which they remove ash trays from!!). The new room was a true non-smoker but it was just as grotty and, having not been given an apology for the first room, we decided to check out and go to the Westin instead.", "helpfulness": 2, "user": "hotham26", "date": "October 14, 2007", "id": 10075986}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "This hotel might be cheap and central but that's about all it has going for it.", "title": "A little removed, but great hotel experience", "user": "kungpao", "date": "October 6, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 10045461, "likes": {"liked": "— Cleanliness, friendly staff"}}, {"rating": 3.0, "stay_parameters": "Stayed May 2007", "text": "By recommendation from the reviewers on this site, we stayed two nights in the Aranvert earlier this month. It was a very clean, affordable hotel, with very pleasant staff. The rooms were pleasantly sized, not the small rooms we expected to find in Japan. The location is conveniently 1 block away from the subway station, just one station away from the Kyoto Station, and very close to bus stops. There aren't many sights in the immediate vicinity of the hotel, but virtually all sights are within a short bus or train ride. The hotel staff speaks English, and has maps to help you guide your way around the city. There are also some Lonely Planet, Rough Guide, etc. travel guidebooks available on loan in the lobby of the hotel to help you plan your trip on the fly. This was a great hotel experience, and definitely recommendable for comfortable hotel stay, at an affordable price!", "title": "Average", "helpfulness": 1, "user": "jim7cary", "date": "September 13, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "location": 3.0, "rooms": 3.0}, "id": 8709194}, {"rating": 4.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "We stayed here for one night in april 08. The hotel itself is well located in Kyoto and price wise isn't bad considering the prices of other hotels. The rooms were a bit tired and needed work. Breakfast was ok but like other reviews the food was cold. Didn't have any problems with tour groups but there were a few in the hotel, we just had breakfast later in the day", "title": "Good location", "user": "T-A-UK", "date": "June 20, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 3.0, "rooms": 3.0}, "id": 17091787}, {"rating": 4.0, "stay_parameters": "Stayed November 2007, traveled solo", "text": "The location is okay, 15minutes walk to Kyoto main station (south) or main shopping area (north). River Kamo in the east can be reached within 10minutes (just follow the road in front of your hotel). The MRT is 2minutes outside on the corner...", "title": "very good service, good location, quite expensive", "helpfulness": 7, "user": "wimbox", "date": "February 4, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 2.0, "location": 4.0, "rooms": 2.0}, "id": 13259703, "likes": {"liked": "— the location... the English-speaking staff: never had commucication problems (which is very rare at Japan !!!)", "disliked": "— value for money... and even maybe the rooms might be big for Japan, it's not big enough for 2 European travellers :S"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2007, traveled solo", "text": "The rooms are so tiny that I always took a chair outside (!) to read my newspaper there, while the room service did their job ! :-))", "title": "very good service, good location, quite expensive", "helpfulness": 4, "user": "wimbox", "date": "December 22, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 2.0, "location": 4.0, "rooms": 2.0}, "id": 11898386, "likes": {"liked": "— the location... the English-speaking staff: never had commucication problems (which is very rare at Japan !!!)", "disliked": "— value for money... and even maybe the rooms might be big for Japan, it's not big enough for 2 European travellers :S"}}, {"rating": 3.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "The bath upstairs and the washing machine (plus dryer) are nice. Anyhow I thought the bath was a bit too hot (burning above 42°C)... and of course I was the only Gaijin... so of course many looks from the Japanese, \"if I knew to wash before and all this\"... but anyhow is a nice amenity of the hotel.", "title": "Average", "helpfulness": 1, "user": "TCNeville", "date": "November 30, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "location": 3.0}, "id": 11154642, "likes": {"liked": "— Cost", "disliked": "— Small room"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "The staff works efficient: Smooth service from first to last day, never a problem about English understanding (even the room service knew what \"thanks\" or \"good morning\" means => seems to be very rare knowledge in Japan ! ;-) and did change my room key within an hour, when it didn't work. They also translated Japanese manuals for me to English without any problem. Compared to my effort to get to know which type of Wasabi was the spiciest one in a supermarket, their English was world class.", "title": "Good Stay", "user": "flgal65", "date": "October 30, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "rooms": 4.0, "location": 5.0}, "id": 10443318, "likes": {"liked": "— Clean, god location to public transportation", "disliked": "— No english speaking TV; food in restaurant expensive"}}], "location": {"country": "Japan", "region": "Kinki", "continent": "Asia"}, "stars": 3, "variance": {"poor": 14, "average": 42, "very good": 135, "terrible": 5, "excellent": 53}, "aka": "Kyoto Aranvert Hotel", "slim_ranking": 0.321428571429}