{"user_rating": 3.5, "review_count": 56, "name": "Arbat Hotel", "reviews": [{"rating": 2.0, "title": "Soviet Hotel but very well situated", "text": "The situation is fantastic (200 meters to the pedestrian street Arbat) and very secure hotel, but too expensive (unfortunately Moscow hotels are always too expensive)", "helpfulness": 13, "user": "A TripAdvisor user", "date": "April 12, 2005", "id": 3353630}, {"rating": 4.0, "stay_parameters": "Stayed November 2006, traveled on business", "text": "This is my second review of the Arbat. After our first trip to Russia (we adopted our twins from the Russian Far East and the process required 2 trips) in March of 2006, I wrote a review and while our stay was not terrible, I vowed I would not stay in a hotel in Moscow that was not part of an American chain. Little did I know how the second trip (taken 8 months later in November of 2006) would find me, yet again, at the Arbat Hotel.", "title": "Back to the Arbat", "helpfulness": 2, "user": "MrsCaptainHenry", "date": "March 27, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 14586218, "likes": {"liked": "— The room was spacious and the buffet breakfast was plentiful and good"}}, {"rating": 2.0, "stay_parameters": "Stayed March 2008, traveled on business", "text": "Our second trip to Russia was carefully planned assuming that we would be in Moscow twice ... once on our way to the Far East, and again on our return through Moscow ... the second time with our 6 year old, newly adopted, twin boys in tow. When the judge in our region waived our two week waiting period, our return trip through Moscow was moved up by 14 days. Every American chain was fully booked. Every other \"recommended\" hotel was also booked. We even tried to find an rental apartment I was so opposed to staying at the Arbat. No luck. So back to the Arbat we went. Now here is the best part of the story: I don't know what we did right this time around, but the room we had at the Arbat in November was terrific! We had a bedroom to ourselves (my husband and I), another room with a large fold-out sofa for the boys (with a TV that had at least 1 channel of cartoons - hooray!), another room with a desk and sofa, a full bath with tub and shower, and a half bath! There was a fridge for sodas we bought on Arbat Street, which was an easy walk from the hotel. The buffet breakfast, included in the rate, was fabulous. A large assortment of Russian and Western style breakfast foods, including fresh fruit, juice, pancakes, eggs, blini, yogurt, pastries, etc. Since we had the boys with us, we needed to get out during the day, and Arbat Street was very entertaining for the kids. Santa and other cartoon characters (costumed adults) strolled Arbat Street as the holiday season approached. McDonalds is also on Arbat Street ... need I say more? A few surly looking characters as well, so keep the kids in sight. While a couple of the reviews posted here mention internet service not being very good, and the mention about the rates, paying in Rubles, etc., etc. are definitely an issue, I cannot comment on those issues as (1) we had no need (or time) to seek out internet availability, and (2) our trip was a necessity to complete our adoption, so we really could not quibble about the cost, etc. Suffice it to say, that if you are traveling to Moscow and the price and location work for you, consider the Arbat. I would request seeing the room first before agreeing to it. And unsmiling desk clerks? Well, just be lovely and polite and smile at them anyway ... they LIVE in Russia; you get to go home.", "title": "Useless internet connection and surly staff", "user": "szlwzl", "date": "March 7, 2008", "detail_rating": {"front_desk": 1.0, "business": 1.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 5.0}, "id": 14116110, "likes": {"liked": "— location and price", "disliked": "— surly staff and internet access"}}, {"rating": 2.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "Although this is supposed to be a business hotel their internet access is ridiculous, for the first 300 roubles(roughly £6) you get 5MB of data transfer and then you start paying more. If you are planning on using skype or any internet services at all then this is not the place for you.", "title": "A price given in US $ that is not converted to the correct exchange rate", "helpfulness": 2, "user": "Royst", "date": "October 9, 2006", "detail_rating": {"front_desk": 2.0, "service": 1.0, "cleanliness": 3.0, "value": 1.0, "rooms": 3.0, "location": 4.0}, "id": 5930586, "likes": {"liked": "— Location", "disliked": "— Quoting me a false price, using your own exchange rate. Very unfreindly staff, the inability to smile."}}, {"rating": 3.0, "stay_parameters": "Stayed September 2006", "text": "The hotel itself was absolutely fine and the room was clean and efficient (although decor could do with some updating).", "title": "A regular hotel", "helpfulness": 15, "user": "Achille C", "date": "October 3, 2006", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 5902159}, {"rating": 5.0, "title": "a better deal in Moscow", "text": "The staff were on the whole dreadful and I would pay special compliment to Irina on front desk for being the worst of the lot - she was surly and unhelpful at all times.", "helpfulness": 11, "user": "A TripAdvisor user", "date": "July 25, 2005", "id": 3698910}], "location": {"country": "Russia", "region": "Central Russia", "continent": "Europe", "city": "Moscow"}, "stars": 3, "variance": {"poor": 7, "average": 20, "very good": 25, "terrible": 0, "excellent": 4}, "aka": "Arbat Hotel Moscow", "slim_ranking": 0.412017167382}