{"user_rating": 3.5, "review_count": 13, "name": "Arbel Holiday Homes", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed May 2012, traveled with friends", "text": "These log home cabins are on a kibbutz about 10 minutes from the edge of Tiberias. The cabins offer a alternative to staying at a hotel in the city if you want to reduce costs and stay away from the city. The bedrooms, kitchen, and living room were all great. Beds were comfortable. Everything was very clean. The owner/operator was very helpful and friendly.", "title": "Nice log homes outside of Tiberias near the sea", "user": "brian796", "date": "May 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 2.0}, "id": 130302556}, {"rating": 3.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "If considering a stay here, there are a few expectations that should first be set. One, the cabins are immediately next to a dairy farm. Our experience was that the smell in the morning was very strong and the flies were troublesome. However, this was only outdoors and we had no issues indoors. The dairy farm operated very late the on Saturday evening, which wasn't a problem for us given how tired we were, but be aware. Also, in our particular cabin, the shower arrangements were not ideal given the lack of a shower curtain in the main bathroom and the limited size of the shower stall in the second bathroom.", "title": "Great Location - but average", "helpfulness": 1, "user": "robert092", "date": "April 23, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 128423713}, {"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled with friends", "text": "Finally, these cabins are on a kibbutz well outside of town, so if you're looking for any restaurants or shops, you'll be driving.", "title": "Log Home Hospitality! Perfect for Friday Evenings!", "user": "your_local_advisor", "date": "July 31, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 3.0, "value": 5.0, "service": 4.0}, "id": 116068990}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "If you want solitude in a clean log cabin at an affordable price, this is the place.", "title": "Great peaceful place in the beautiful Galilee", "user": "Tomas999", "date": "September 8, 2010", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "location": 3.0, "value": 4.0, "rooms": 5.0}, "id": 78742752}, {"rating": 4.0, "stay_parameters": "Stayed May 2009, traveled with family", "text": "We were looking for somewhere to stay in the eastern Galilee. From past experience we knew not to stay in Tiberias which is the Israeli equivalent of Benidorm ( Spain) and makes even Eilat seem upmarket. Arbel is a small settlement located on the mountain range overlooking the Kinneret ( Sea of Galilee) - which is fine as you have the breeze/winds that you don't get in Tiberias or for that matter anywhere around the Kinneret. Arbel is a great point to make a base for sightseeing ( Hula Valley, Safad, Golan etc). Also near by are the Arbel Cliffs - well worth the vist. On the website http://www.inisrael.com/arbel/cabins.cfm it looked ideal - when we arrived we thought the website rather oversold what we found. As we drove past the cow sheds we wondered how close our wooden house would be ...in fact through our stay ( 4 nights) we did not smell the cows whatsoever. When we arrived we were disappointed with the size of woodern house - two smallish bedrooms for parents & 3 older- larger- teenagers, the living room was also quite small. I think in hindsight if we had been told about the size of the house we would have chosen somewhere else to stay. That's all the downside. On the upside Arbel is a real haven away from the noise and constant on-the-go that is Israel. The BBQ's on the lawn outside we made in the evenings were great and the owners ( Carmel and Benny) could not do enough for us, and that included doing a pile of washing clothes for us. Carmel and Benny will advise you where to go and what to see. So would we stay there again - probably no. Should you consider it as a place to stay - certainly yes......but do call Benny and Carmel and understand which house/size etc you are actually going to stay in.", "title": "If you want cabin experience, it's great", "user": "wimmyjeil", "date": "July 1, 2009", "detail_rating": {"cleanliness": 3.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 3.0}, "id": 33672898}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled with family", "text": "Our family stayed at the Arbel Country Lodging homes for 5 nights in March of 2007. We stayed in a charming (and very clean) wooden cabin (called a “Tsimmer” in Hebrew), located inside a small, semi-agricultural community.", "title": "Great family stay just north of Tiberias", "helpfulness": 1, "user": "Skevanston-Traveler", "date": "July 25, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 18247064}], "location": {"country": "Israel", "continent": "Middle East"}, "variance": {"poor": 2, "average": 3, "very good": 5, "terrible": 0, "excellent": 3}, "slim_ranking": 0.625}