{"user_rating": 5.0, "review_count": 944, "name": "Arcadia Residence", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed September 2011", "text": "Kozna 6 apartments are one of the two groups of accommodation run by Pasquale as Arcadia Residences.", "title": "The very best accommodation on our five week European holiday", "user": "impossible50", "date": "September 24, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 118545339}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "The location of Kozna 6 is unbeatable- central to the old town, right near the town square with the astronomical clock. However quiet, being in a small lane.", "title": "What a great find!", "user": "gspdx2", "date": "September 24, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 118541888}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "For us two things made this place exceptional-", "title": "Style and Comfort close to Old Square.", "user": "CarlSydneyAustralia", "date": "September 24, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 118521387}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "Firstly our host Pasquale for whom absolutely nothing was too much trouble, and", "title": "Awesome B&B", "user": "LaRumu", "date": "September 23, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 118493458}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "Secondly, the quality, style and spaciousness of our apartment.", "title": "MARVELLOUS STAY", "user": "Rashmikd", "date": "September 15, 2011", "detail_rating": {"value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 118149971}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "Everything about Arcadia residence was superb - from the welcome from Max, his attentiveness during our stay, the attention to detail, furnishing, cleanliness - and especially the delicious breakfasts. Be aware that these apartments are in the Vysehrad area, 10 min by tram to Old Town and Charles Bridge. Nearest tram stop (Vyton) is 350-400 m away. But transport is good and on a fine day you can walk into the centre of Prague along the river in about 20/25minutes. There is nowhere else in this fantastic city that we would ever want to stay. And at 110 euros per night for the three of us, including breakfast, it was amazing value.", "title": "It exceeded all our expectations", "user": "Townmouse33", "date": "August 31, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117484409}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with friends", "text": "We chose Arcadia Residence due to reviews given on Trip Advisor and how pleased we were....", "title": "A Rare No Brainer", "helpfulness": 3, "user": "Steve_barrow", "date": "August 26, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117274023}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "Location - Perfectly situated between the Old Town Square (3 mins) and Wenceslas Square (7 mins). Apartments are off a quiet arcade which gets secured after 23:00 (you have a key) and so is very safe. A small cafe is situated opposite and this is where you take the included breakfast, more later.", "title": "Just Brilliant", "user": "dgee101", "date": "August 25, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117234980}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "Accommodation - We were in apartment 33 on the second floor (There is a lift), which was composed of a large open plan hall, excellent kitchen/diner, lounge area and separate bedroom. The bathroom comes with corner bath/shower and is a good size The apartment was spacious, very light, with 6 large windows running it's full length, and has high ceilings. Newly decorated, it was spotless when we arrived and has a large flatscreen TV and LG DVD player/radio. Very comfortable bed. Another bonus is the free wi-fi. The provision of remote-controlled air-con to the living and bedroom space is a bonus in summer.", "title": "Excellent place, would not stay anywhere else in Prague.", "helpfulness": 1, "user": "Anshul_Rustaggi", "date": "August 16, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 5.0, "service": 5.0}, "id": 116814840}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "Breakfast - This is included in the room rate and you use vouchers to pass over to the waitress. Essentially this covers anything you want from the small buffet table e.g. Cereals, fruit juice, yoghurt, tea, coffee, something sweet, honey and such like. Excellent bread and scrummy warm croissants are placed on the table. You then have a choice from 7 items on the menu such as ham omelette, blueberry pancakes, sausages and such like - very nice.", "title": "The best place to stay in Prague!", "helpfulness": 1, "user": "Blueman56", "date": "August 13, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116670859}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled on business", "text": "How sad that there is only one Pasquale in the world--he is far and away the most gracious and attentive host one could hope for. His Arcadia Residence is large and spotless. His recommendations are excellent. He is always around to help with requests. His staff is punctual and friendly. The delicious and varied breakfast is enough to live on all day if you choose. And it is all unbelievably reasonable. If you are lucky enough to find availability here, you are fortunate. Grazie mille, Pasquale.", "title": "You're fortunate if you're able to stay here", "helpfulness": 2, "user": "the_way_i_see_it22", "date": "November 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 144971487}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "We stayed in the attic room at Arcadia Old Town for three nights the first week of November and couldn't have been happier with the room (spacious, beautifully appointed, and clean as a whistle), the location, the value, and the service. The apartment had a kitchen that was larger than ours at home, a big bottle of water, teabags, etc. were there when we arrived, and the breakfasts that were brought each day at our requested time were plentiful and tasty, with fresh fruit, delicious croissants, meats, cheese, and eggs. Every night when we returned from our activities the apartment was as clean as when we arrived -- the bed, incidentally, was extremely comfortable, too. Pasquale is totally dedicated to providing his guests with an optimal experience in Prague -- he will go out of his way for you, provides maps and information (as well as a brief walking tour of the surroundings), and is an extremely kind, considerate, and friendly person. To give just one example, my cell phone wasn't allowing me to make calls to my office -- Pasquale met us in the Arcadia office at 10:30 at night so I could make an important call. He works tirelessly to make Arcadia a wonderful experience -- and succeeds.", "title": "Deserves all the accolades", "helpfulness": 1, "user": "crunchkin", "date": "November 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 144851215}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "The apartments were like a home away from home and Pasquale was fantastic - very helpful and welcoming. Can't say it better than all the other reviews - perfect place to stay in Prague to relax and spend time in the heart of the city.", "title": "Perfect", "helpfulness": 2, "user": "sarkin", "date": "November 4, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 144478802}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "We chose Arcadia Residence based on other reviewers, and I can concur that service is excellent. We staid in the recently refurbished apartment in Kozna 6 (apartment 3.4). I think we were one of the first guests to stay there. The apartment is spacious, decorated with a modern touch and quiet. It overlooks an inner courtyard so it's the perfect place to relax from the bustle of the Old city. The apartment is divided in a living room / kitchen (fully equiped). There's a large flatscreen TV with international channels. There's free Wifi access in the apartment. Then there's a small bedroom a hallway containing closets for clothing, and a large bathroom with a tub and shower, toilet, bidet and a laundry machine.", "title": "Haven of quiet in bustling Old Town", "helpfulness": 2, "user": "Timmie D", "date": "November 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 144298404}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled solo", "text": "The apartment is smack in the center of Prague and ideal for getting around in the city. What makes the service of Arcadia residence special, is the fact that Pasquale (the host) really takes his time for his guests and even gives you a little tour of the area surrounding the apartment. He shows you how to find the apartment, closest ATM, supermarket etc.", "title": "Faultless service, location and amenities", "helpfulness": 2, "user": "SydneyHols", "date": "November 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 144264773}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled with friends", "text": "All the glowing reviews of the Arcadia Residence are fully justified. I stayed here with a friend for 3 nights in May. We got a clean and spacious two-bedroom top-floor apartment -- decked out with beautiful Jugendstil furniture -- and had wonderful views over the city. Pasquale was there to meet us on arrival and helped us every step of the way to find our way around town, to make bookings at restaurants, and then saw us off on our last day. His mother delivered beautiful breakfasts every morning at the time we asked for. This was truly the personal touch without ever being intrusive. The residence is 3 stops on the tram (easy to use) from Charles Bridge, but in a quiet neighborhood. Pasquale was worried about noise from renovations nearby and emailed us beforehand, in case we wanted to cancel. How many hoteliers would do that? As it turned out, the problem was minimal and we are so glad we did not decide to move anywhere else. The Arcadia is wonderful value for money, of course, but the hospitality and the quality cannot be measured in cash alone.", "title": "The perfect host and the perfect apartment", "helpfulness": 3, "user": "ChrisfromLondon", "date": "June 17, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7870435, "likes": {"liked": "— The host's hospitality", "disliked": "— There was nothing we disliked"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "We stayed at the Old Town Apartments (Kozna 1) in May 2007 and could not fault a thing. Excellent central location, lovely traditional apartment and perfect host in Pasquale. Would recommend the pre arranged transfers as very reasonable and efficient. If we ever return to Prague would definitely stay here again. Would also recommend Davids restaurant (over the Charles Bridge) for an authentic fine dining experience.", "title": "Kozna 1", "helpfulness": 5, "user": "phoebeUk", "date": "June 17, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 7867945}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled with friends", "text": "My friend & I stayed in the Vlasska 2 apartment last weekend. We had one of the best stays ever! Pasquale was fantastic - he arranged for us to be picked up at the airport and dropped right to the door where he met us (same with going back). He showed us around and we could have contacted him at any point if we needed anything. There are cafe/bars nearby for breakfast etc... There is also a mini-mart directly across the way (which i would advise you buy your water there - 13Kc for small bottle as apposed to the 50Kc you will pay in town. The Vlasska 2 was amazing - the rooms were perfect size and even though we did no cooking while there it had every amenity. The ceiling is gorgeous! Its location was perfect - only approx 5 min walk to both Prague Castle (uphill) & Charles Bridge (downhill)! I would definitely stay there again when I come back to Prague and if you're reading this Pasquale thank you for everything. We look forward to coming back again!!", "title": "Brilliant Stay!!!!", "helpfulness": 4, "user": "Jscanner", "date": "June 12, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7837684, "likes": {"liked": "— Location", "disliked": "— Nothing!"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled with family", "text": "My family stayed at the Arcadia Residence for 3 nights in April. We rented the 2 bedroom unit on the top floor. Everything about our stay was excellent. This hotel is a small (8 unit) family owned and operated hotel, that can give any of the big name hotels a run for their money any day of the week.", "title": "Best Service in Prague", "helpfulness": 6, "user": "SNAFU23", "date": "June 11, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 7835931, "likes": {"liked": "— The personal attention from Pasquale, and the excellent service"}}, {"rating": 5.0, "title": "Ditto", "text": "From the moment you arrive Pasquale ensures that everything and anything you need is taken care of. Each morning Anna Maria delivers a delicious breakfast cart to your door with everthing you may desire; eggs, meats, cheese, breads, yogurt, cereal, juice, milk, nuts, etc... and each morning it's something different.", "helpfulness": 3, "user": "rozst", "date": "June 11, 2007", "id": 7831908}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "My husband and I stayed at the Arcadia for 4 nights earlier this month with our two teenagers, who are very hard to please. But no surprise, we all really, really loved the place and the City, too!", "title": "A great place to stay", "helpfulness": 4, "user": "gccc116", "date": "August 30, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8579744, "likes": {"liked": "— The owner's hospitality", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled with friends", "text": "The Apartment was a great departure from the usual large hotels we stayed in when we travel. We booked the 2-bedrooms unit on the top floor with a view of the Castle. Upon checking-in, Pasquale was worried that the construction noise next door would bother us. He need not have worried. The noise was sporadic and not intrusive at all. Besides, we were gone sightseeing most of the day anyway.", "title": "Fantastic!", "helpfulness": 2, "user": "laura1983", "date": "August 30, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8568620, "likes": {"liked": "— Location and Friendly Staff"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "The place was spotless, with great shower and Mama's breakfast every morning was delicious and filling, just like how all the other reviewers have raved. The morning we checked out was our 20th anniversary and Mama prepared a delicious fruit-topped cheesecake for us! Unfortunately, we had to rush to catch a flight and could not savor the cake as we would have liked. My daughter kept saying that we should have put the leftover in a box and took it on to the plane with us!", "title": "Fantastic place to stay :)", "helpfulness": 1, "user": "david79", "date": "August 28, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8520552, "likes": {"liked": "— Personal service and location", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "Pasquale's hospitality was unbelievable. He answered all our questions (there were many) and gave us a great deal of good information. He even charted out a schedule of different public transportation for us, so we would not get lost during our sightseeing. He and his mother treated us like family... I have not seen that during my many years of travel.", "title": "WOW!", "user": "AGDOC95", "date": "August 26, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8508649, "likes": {"liked": "— Location", "disliked": "— Nothing"}}, {"rating": 5.0, "title": "Old Town Residence", "text": "The location of the property was great, close enough to all the sites (by public transport), but not too close to all the crowd. There were two times when we chose to walk back from Charles Bridge and Old Town to the Apartment along the river and did not take the train. Those walks ended up to be our highlights! It is a great stroll with beautiful sights at every corner.", "helpfulness": 2, "user": "islandgirl50b", "date": "August 21, 2007", "id": 8461574}, {"rating": 5.0, "title": "Amazing service", "text": "We were unable to stay at this hotel because there was construction work going on nearby and the owner, Pasquale, felt we might be more comfortable elsewhere. He was extremely annoyed that we had to be moved but his concern for our comfort was commendable.", "helpfulness": 3, "user": "Eimear811", "date": "July 30, 2007", "id": 8256291}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled with family", "text": "Although we didn't stay here, Pasquale still arranged our airport transfers, rang me when I arrived, and at the end of my stay to make sure we had no problems with our check-out from the other hotel (which we did have but that was due to their incompetence rather than any mismanagment on his behalf).", "title": "Simply the best", "helpfulness": 3, "user": "CyberGreen", "date": "July 17, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8134189, "likes": {"liked": "— Breakfast, Pascale, Mama and the cleanliness", "disliked": "— Nothing."}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "If for no other reason, I would recommend staying at Arcadia Residence for the personable service given by Pasquale. The reviews here are a real credit to his business.", "title": "The Best, The Arcadia.....", "helpfulness": 5, "user": "Rubycairo", "date": "July 12, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8107533, "likes": {"liked": "— Everything!!!!", "disliked": "— Anything!!!!"}}, {"rating": 5.0, "title": "Fantastic", "text": "I could write about our experience, but it really would be just repeating what everyone else has said. We had a great time and were only sorry we didn't stay longer. They deserve to be number 1 and other hotels should come and see why, it isn't about having the flashest, it is about the human touch that counts the most. We hope you are all ok now Pascale and say hi to mama from us finally back home here in New Zealand.", "helpfulness": 4, "user": "greekaholic", "date": "June 29, 2007", "id": 8026218}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled with family", "text": "My boyfriend and I just returned from Prague three weeks ago.Since the first moment when I read all the reviews about the Arcadia I knew I had to book it without hesitation.", "title": "Personal touches make this a wonderful place to stay!", "helpfulness": 2, "user": "HGH", "date": "June 28, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 8022710, "likes": {"liked": "— The wonderful people who own and run it! The breakfasts, the comfort of having several rooms."}}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "Where do I begin and not repeat the same comments that have been made before, that is the challenge. I shall try. Location, could not be better, aside from being blocks from the Old Town Square, there are many interesting restaurants in the area and the wine bar and Italian food shop next door came in very handy. The apartment is spacious and clean. I would be remiss, though, if I didn't repeat what a gem Pasquale is, I have stayed at 5 star hotels before and the concierge there couldn't match Pasquale, genuine, can't do enough for you, so helpful, made sure we had everything we needed, he is the outstanding feature, and Eva is also very helpful. What a gem of an establishment.", "title": "I can't think of a better place!", "helpfulness": 2, "user": "GeoffL", "date": "December 31, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 148413959}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "My wife and I stayed at Pasquale's Arcadia Old Town B&B. It was awesome! Pasquale is the best host ever and helped us with whatever we needed. My wife and I are very independent and can find our way around anywhere without help but Pasquale overheard us talking of which restaurant to eat at on Christmas night and had a list of open traditional restaurants for us when we returned in the afternoon. He even marked them on our map. The room was great with a view of the old town-hall tower, breakfast was more that we could ask for and Pasquale even had arrangements for our car to be stored in a local car park for us. What an amazing time and we will defiantly be returning to this B&B in the future.", "title": "Arcadia Old Town is Tops!", "helpfulness": 1, "user": "Dave D", "date": "December 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 148312549}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "We have just returned from staying at the Arcadia apartments in old square Prague the one bedroom app. We stayed in was absolutley SPOTLESS fantastic location and very spacious we found Pascuale to be so helpfull and unassuming and gave us so much helpfull information and was very generous with his time The little tour on arrival was very informative. If we return to Prague (which I hope we do) we would not want to stay anywhere else but the Arcadia and would recommend it 100% to everybody", "title": "Arcadia apartments on old square", "helpfulness": 1, "user": "dientje v", "date": "December 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 148271066}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "We were blown away by our stay--we were in the best location in between old town and new town in the mini-apartment with vaulted ceilings, 1.5 baths, kitchen, and great sitting room. The breakfast every morning was enough for 4 and delicious. Pasquale was the best host. He immediately showed us where the best place to exchange money, food, etc. He helped us while we during our stay to find the best tours, activities, etc. By the time to add in breakfast, service, and location--this is quite the value too. If this place is still available for your stay--book immediately!", "title": "Best place in Prague--and our entire Europe trip!", "helpfulness": 2, "user": "Ashley M", "date": "December 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 148164411}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled with family", "text": "This is, quite simply, the perfect place to stay. We had read all the great reviews and our expectations were still exceeded.", "title": "Perfect", "helpfulness": 5, "user": "Deanna E", "date": "December 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 147460047}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "The personal touch given by Pasquale,Max and the family is unquestionable. As with any visit to a new city it's essential to get to know how the transport system works and Max went out of his way to help,advise and even take us to the tram stop..There were two local restaurants recomended by Pasquale and Max and i've got to say the steaks were some of the best we have ever had(and i work in the food industry)..One thing we would advise against though is any imported wine as it was horrendously expensive. After a busy day around Prague it was great to come back to a spotless room .It was a touch of luxury to have the superb breakfast served in your room.", "title": "The Rating Says It All", "helpfulness": 1, "user": "TandJ09", "date": "April 26, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 28782177}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "We stayed at Arcadia Kozna 13. Our entire Prag experience was amazing. The location is phenomenal, the rooms excellent and the service absolutely wonderful. Our room had a spacious bathroom, spacious bedroom and living area, which also included a full kitchen. Breakfast was served down the street in a trendy cafe, was tasty and more than plentiful. Pasquale was a brilliant host who arranged an opera and dinner evening for us, and who when we left at 7am the last day by car for Hamburg made us a breakfast bag with a variety and quantity that fed us for the entire day. I wish all hotels were like this. And of course Prag is a beautiful city!!!", "title": "Best ranked hotel in Europe for a reason", "helpfulness": 1, "user": "MapleLievie", "date": "April 20, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 28417320}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled with friends", "text": "Arcadia Residence was our first stop on our one month vacation in Europe. I decided to book at Arcadia after reading several reviews on TripAdvisor.", "title": "Wonderful Experience!", "helpfulness": 1, "user": "Pablo_M", "date": "April 12, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 27862423}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled with family", "text": "There is not much more that I can say that has not already been said,, our 6 night stay at Arcadia was wonderful, the staff were pleasant, professional and very warm, they certainly go out of their way to make you feel confortable and valued as a guest. The property is clean and secure and close to public transport. On our first day Max even walked us down to the tram stop and provided us with all relevant transort info in order to get around. In the following days Max provided us with excellent information on restaurants, bars, shopping as well as tours/sightseeing.", "title": "Warmest welcome, most thoughtful service, spotlessly clean, homey and comfortable", "helpfulness": 1, "user": "FrequentTraveler1058", "date": "April 12, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 27852684}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "The breakfast that Mama served up was fresh and delicious and got us off to a great start every morning!", "title": "We absolutely fell in love with the place.", "helpfulness": 2, "user": "RomanHans1", "date": "April 8, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 27655315}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled with friends", "text": "The other reviews are right: we had a great time in Prague, specially because of the nicest reception at Arcadia Residence we've ever had.", "title": "Wonderful stay!", "user": "Ali.Ale", "date": "October 1, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 118828688}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "Max received us and explained with pacience everything we needed to know about the hotel and the city.", "title": "Unforgettable Prague and Arcadiaresidence!", "user": "KENJI S", "date": "October 1, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 118813132}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "The room was so nice, with a small kitchen, and we could choose a time for the breakfast (delicious!) to be served in the room by the always smiling Maria.", "title": "Large apartment that exceeded all expectations", "user": "AmandaRose1515", "date": "September 27, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 118669696}, {"rating": 5.0, "stay_parameters": "Stayed September 2011", "text": "The hotel is close to Vysehrad National Cultural Monument, a tram stop (that takes you everywhere), and a market.", "title": "Exceeds high expectations", "user": "Cupertinocausa", "date": "September 26, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 118631769}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "Great experience!", "title": "Best place in Prague and best host dear Pasquale", "user": "ale64_11", "date": "September 25, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 118560572}, {"rating": 5.0, "title": "Super place to stay!", "text": "Well its easy to know why this is number 1! I stayed here for 3 nights with my girlfriend in the Kozna 2 apartment. I say apartment because thats exactly what it is. It is very central and has all the mod cons. The price is very reasonable & Pasquale was very helpful & arranged for us to store our luggage for 2hrs after we checked out while we did a bit of last minute sightseeing around Prague. I would have no hesitation in recommending this place to anyone & i will definitely be staying here again when i go back to Prague!", "helpfulness": 2, "user": "Evolution1000", "date": "August 20, 2007", "id": 8456971}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "Think this place can't be as great as all the reviewers say? Stop worrying and just book it!", "title": "Stop looking; stay here", "helpfulness": 3, "user": "Biblia", "date": "August 11, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 8394959, "likes": {"liked": "— Pasquale and Anna Maria; breakfast; room", "disliked": "— We loved everything!"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "Arcadia Residence is an awesome place to stay. Our room was more like a small apartment than a hotel room; the bedroom was roomy and comfy; the bathroom was well appointed and large; the kitchen was well equipped; the sitting room/dining room/living area was perfectly homey. Everything was clean and neat and we felt right at home immediately.", "title": "Vlasska2", "helpfulness": 2, "user": "rustyman", "date": "August 9, 2007", "detail_rating": {"cleanliness": 5.0, "location": 4.0, "value": 4.0, "rooms": 4.0}, "id": 8378850, "likes": {"liked": "— Location, cleanliness"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007", "text": "The location of the Residence was our only worry when we first booked it...because it wasn't right in the middle of the main tourist areas we wanted to visit. This, however, was not a problem. It is on a beautiful, quiet street in a very nice part of town and getting to the the tourist areas (Old Town Square, Charles Bridge, etc.) was very easy. We walked (it took us about 20 minutes to ramble along the river to Charles Bridge...) and we took the tram (easy, cheap, and Pasquale provides an orientation). We quickly found that we vastly preferred the Residence's location to any other we had considered from a far.", "title": "Great Place to Stay", "helpfulness": 2, "user": "Alberta-Canada", "date": "August 6, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "business": 5.0, "cleanliness": 5.0, "rooms": 5.0, "location": 5.0}, "id": 8360234}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled solo", "text": "Pasquale and Anna Maria were awesome...friendly, helpful, accomodating. We couldn't imagine having better hosts.", "title": "Felt like I was staying with family!!!", "helpfulness": 6, "user": "adnil1962", "date": "August 1, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8272532, "likes": {"liked": "— Pasquale, Mama Anna....EVERYTHING...", "disliked": "— that I had to leave to come home"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "I almost wasn't going to bother with a review - purely because it has all been said before and there is nothing I can add! I've been trying to think of something negative I can say about this trip, as to those who have not stayed here before, you must think we're all being paid to say such nice things! Well, the only thing I can think of is that the box of chocolates given to us at the end of our stay by the gorgeous Pasquale had one covered in white chocolate...which I don't really like. That really is it - this place is amazing! Beautiful spotless apartment and perfect location with the perfect host. For those of you thinking that such a central location (we stayed at Arcadia Old Town Kozna 5) is not for you - think again. We originally wanted to stay at Arcadia Residence but it was fully booked. We were a bit worried that being so close to Old Town that it may be too busy and a bit noisy. However, the apartments are down a small walkway off the main streets and with the windows open we could only hear the sound of a few birds and the distant chime of the bells.", "title": "The best holiday experience ever!", "helpfulness": 2, "user": "MELODYJANE", "date": "May 26, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 30834851}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "We spent 3 days walking around the main parts of the city - no need to use public transport - it's all easily within access. Petrin hill was definitely the highlight, though avoid the mirror maze if you're over 3 years old!", "title": "You must stay here if going to Prague!", "user": "slimw", "date": "May 26, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 30800328}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "Hope to go back sometime, though I fear if Pasquale ever moved on, it wouldn't be quite the same! One of the most charming people I have ever met! Thanks for a wonderful weekend.", "title": "Unbelievable value - a top place to stay", "helpfulness": 1, "user": "N1Sightseer", "date": "May 20, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 30377625}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "This is the place to stay if you're visiting Prague! You will never get anything like this with regard to both service and space staying at a hotel. In addition to all of the other reviews pointing out how wonderful Pasquale and the apartments are, a few additional points from our visit that should convince you to stay here.", "title": "Exceeded all our expectations", "helpfulness": 2, "user": "JulieTravelling", "date": "May 20, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 30354721}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled with friends", "text": "- When we first arrived Pasquale walked us around the old town a bit...this would never happen at a regular hotel.", "title": "QUITE SUPERB!", "helpfulness": 1, "user": "SDowns09", "date": "May 17, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 30162717}, {"rating": 5.0, "title": "ABSOLUTELY INCREDIBLE", "text": "My husband and 2 children (4.5 and 2) joined me for a 3 night, 4 day visit to Prague - our first time there. We booked the two bedroom apartment in the Visehrad neighborhood and were blown away. We arrived on a very hot day and there was a marathon of some sort blocking our way (we had our GPS and it wasn't helping) to the apartment and so we got very lost. We called and asked Pasquale for help and he stayed on the phone with us and helped us navigate our way to our destination - it took a lot of patience and kindness on his part - we were so grateful. When we arrived, we were greeted by Max, a marvelous, gracious, thoughtful man who turned out to be the most amazing host. He toured us around the area, helped us figure out trams to and from destinations, showed us the local grocery store and arranged to have us follow him to a nearby not-so-pricey parking lot for our car. Incredible. And he checked in with us, not intrusively, but thoughtfully, daily - making sure we had our needs met and answering any questions we might have had. I had read on Tripadvisor about the room service breakfasts, but nothing could have prepared us for the incredible food and beauty of the display that arrived on our doorstep early the first morning (at the time of our choosing). The food was healthy and indulgent and considerate and just completely delicious and fresh. They even thought of our kids and how picky kids can be. We were AMAZED. Our kids couldn't wait for breakfast each morning - and they are really picky eaters! The apartment was clean, warm, and the housekeepers kept it clean and lovely every single day. Prague is a phenomenal city - we wanted to spend much more time there - and we will go back. And when we do, we will pray that the Arcadia Residence has openings, and we will certainly plan around them so that we can stay there again and again. I recommend this place to ANYONE - the price is incredible and the service is memorable and the people who work there are amazing.", "helpfulness": 1, "user": "Jennifer R", "date": "September 14, 2011", "id": 118120742}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "My husband & I had a mini break in Prague before my son arrived, We stayed here and had the most wonderful time. The view was breath taking, the location was perfect as it is really central (very handy when 7 months pregnant), the place was very clean & warm (a must in January) and the staff were very helpful. Usually when staying in apartments the breakfast is not included but it was here and it was yummy. It was in a lovely cafe downstairs. Since I have come home I have recommended this place to other friends who are visiting Prague.", "title": "We had a fabulous time", "helpfulness": 1, "user": "Feelgood77", "date": "September 12, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117965285}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "It seems really unnecessary to add our praise to all the previous reviews but Pasquale proved to be such a wonderful and gracious host , the accommodation so pleasing, the location excellent ( Kozna 6) and the service beyond reproach, that I decided it is only right and proper to do so. I have had the good fortune to travel a great deal and have stayed in many lovely and fine places but I do not think I will find any service that could surpass that received by Pasquale. ( Note to Pasquale, if you do manage to open a similar place in Rome, as you mentioned, please let us all know!)", "title": "Perfection!", "helpfulness": 3, "user": "lovestotravel98", "date": "September 11, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117954967}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "We took a car from the airport to the residence where we were met by Max. There are two apartment blocks and ours was the one situated about five minutes walk from the gardens and Peter and Paul cathedral in Vysehrad. The apartment consisted of two very comfortable sized bedrooms- with wardrobe and spacious bed and lovely crisp linen,", "title": "Don't want to share this one with you!!!", "helpfulness": 4, "user": "glensy", "date": "September 10, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117905369}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "bathroom -with bath and shower, small kitchen with fridge, oven/ gas rings, toaster, kettle and crockery. A small but very functional sitting /dining room. The furnishing was just gorgeous. There is a staircase and lift in the block. Breakfast was unbelievable, I don't think the lovely ladies could have put more on the trolley!! Juice,cereal,cakes,nuts,rolls and bread, chocolates, fresh fruit, delicious fluffy omlette, tea and coffee, each day the fare varied. Max was a genial host, with helpful tips, he could not have done more for us, tickets, stamps you name it he has it!! Even chocolates for us girls on our departure. We had a lovely stay in a fabulous city and our accomodation made it even more enjoyable. Thanks Max and Ladies!", "title": "Beyond perfect in every way", "helpfulness": 1, "user": "melfed", "date": "September 8, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117839892}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "Visited Prague for the first time for my wife's birthday 23rd to 26th November. So delighted to have stayed at the Arcadia. So clean, so bright and fresh. Superbly located near the old town square allowed for walking to all of the best parts of Prague, yet very quiet.", "title": "The place to stay in Prague", "helpfulness": 1, "user": "haeledwards", "date": "November 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 146361685}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled with friends", "text": "Pasquale the host went out of his way to be helpful - I can't recommend thsi Aparthotel high enough. Great value for money too.", "title": "When in Prague, you want to stay here!", "helpfulness": 6, "user": "B L", "date": "November 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 146087592}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "If anyone is ever coming to Prague...first of all you need to visit Prague as it is a beautiful city and very inexpensive..but secondly you need to stay where we did...it is called Arcadia Residence run by Pasquale. The Arcadia Residence are apartments with a full kitchen, a huge bathroom with laundry, free internet, you get breakfast included which is a full breakfast...and it is brought to your apartment and set up on the table by 2 of his staff!! Yes, set up on the table with a table cloth and fresh juice! The apartments are right in the middle of the old town, literally a block away from the main square. As nice as the apartment is, Pasquale makes the stay here amazing. He takes complete care of you...he arranged for a car to pick us up at the airport with the driver holding up a sign with our name on it, when we arrived at the \"hotel\" he met us at the car, checked us in and then gave us a brief walking tour of the surrounding area so that we knew where we were and he pointed out important stuff like the best place to get money changed, good local restaurants and some of the highlight things to see. He gave us a bunch of information on things to do and he was always available by email or phone when we had questions. We are leaving tomorrow at 630 AM and he is going to meet us to give us a \"carry away breakfast\" and to say goodbye! You seriously want to stay here when you come to Prague.", "title": "A magical town, an impeccable host, and cherished memories!", "helpfulness": 1, "user": "Raconteur-at-Pgh", "date": "November 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 146079753}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "We simply fell in love with Prague -- Pasquale's generous, impeccable hospitality and Arcadia's cool comfort were key catalysts.", "title": "A perfect city, the perfect place to stay, and the perfect host", "helpfulness": 1, "user": "TraceyS1964", "date": "November 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 145801338}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "I wanted to keep the magic of Arcadia a secret and share it only with close friends and family (there are only a handful of rooms and I don't want them to get completely booked when they plan to visit) -- but seeing the number of excellent reviews, I think those plans won't work!", "title": "If Prague is the golden city, Pasquale is the golden host", "user": "sydneyc", "date": "November 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 145745721}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled solo", "text": "I just returned from my 5 night stay at Kozna 6 apartment and couldn't wait to write this review.", "title": "MY HOME AWAY FROM HOME...", "user": "Saisawan", "date": "June 13, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 32234065}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "Upon my arrival, the owner, Pasquale was waiting right in front of the building to greet and to help me with my bags. The apartment is spotlessly clean, huge, bright and airy. It's fully furnished and has more amenities you ever needed. I felt the most at home in this place other than any other places I have stayed. Prague is pretty and can be overcrowded by tourists, but this place made me feel like I lived there. After a long day of touring, I was psyched to come home to rest and relax. The location is just...PERFECT!!! And for the price that includes daily breakfast and free wi-fi, it was truly an AMAZING deal!!!", "title": "Simply the best", "user": "davin", "date": "June 7, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 31764550}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled on business", "text": "Thanks for everything Pasquale! Your place is my home away from home!", "title": "Oh what a stay!", "user": "mayisa", "date": "June 1, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 31345890}, {"rating": 5.0, "stay_parameters": "Stayed January 2009, traveled as a couple", "text": "Stayed for 4 nights May 19 -22 and based on all trip advisor reviews I 100% concur.Just the best location 10 seconds from the Old Town Square we could can see it if you looked out the window.Our host had a car pick us up from t he train station and drop us off as close as possible to the hotel.He also arranged for a taxi to take us back to the train station all included in the price.Breakfast each morning was delivered to our room where we had a little kitchen area.It was deilcious.Our host also picked up train tickets for us we were going on to Vienna and saved us some time.Great restaurant at the entrance to hotel Italian where we had 2 very good meals.Used the hotel as great base as we often popped out to see something and then came back for a snack of cup of of coffee./tea.", "title": "Incredible", "helpfulness": 1, "user": "Penny71", "date": "June 1, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 31260000}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "We just arrived from a week stay in Kozna 6 in Prague. I chose this place according to previous reviews from the trip advisor, and so happy about my choice. Everything was so perfect. Pasquale, our host was very attentive and helped us with a few problems with Air France (is there a site where we can review airlines? ).", "title": "Like staying with family", "user": "lepa", "date": "May 29, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 31107634}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "We stayed in Kozna Six and it was a beautiful apartment, amazing location, just around the corner from the main square. The apartment is a newly renovated builing, has all the mod cons and free wifi. Breakfast is downstairs in the cafe and will keep you going well into lunchtime!", "title": "Arcadia Old Town - Perfect location, perfect apartment", "user": "murphysicecream", "date": "May 6, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 29454011}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled on business", "text": "We spent 3 days in Arcadia downtown and it was a really pleasant experience.", "title": "Relaxing experience", "helpfulness": 1, "user": "MilanoSwimmer", "date": "May 1, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 29164945}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "The room was so spacious, clean, and silent... The location was perfect ... close to the old town square. The owner Pasquale was very nice in giving us all informations requested and organizing transfers to and from airport.", "title": "Simply loved the placeand the owners", "helpfulness": 2, "user": "link2hs", "date": "April 30, 2009", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 29068928, "likes": {"liked": "— Everything", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "Just some suggestions for getting to the perfection...", "title": "An Amazing hotel in an Amazing city", "helpfulness": 2, "user": "Aetatis", "date": "April 28, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 28981337}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "Please add some coffee, tea in the room as there is the kettle but no way to use it", "title": "Do believe the hype!", "helpfulness": 1, "user": "njdavis103", "date": "April 28, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 28963914}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "It's a good thing we came to Prague last because, although we stayed in some other really nice places, none could compare to The Arcadia Residence. We stayed in the attic apartment and everything about it was over the top. We travel a lot and have never stayed in such an amazing place for so many reasons. When we saw the room, my husband and I gasped. it has been completely remodeled and has every modern convenience, beautifully decorated. You actually walk down a wide hall from the large, fully equipped kitchen and dining room to the living room and bedroom area. The bathroom is a piece of heaven. Huge bathtub, separate shower, and a heated floor. The bath at the end of the day was sublime. There's a large outdoor patio. The bed was more comfortable than our sleep number at home and it was dark and quiet. It was hard to leave the room to go out sightseeing and shopping. Two ladies bring the breakfast, set it out on the table and you just leave everything on the table and they clean it all up. The view is beyond belief - the clock tower and cathedral are right there out of one of the many windows. Pasquale couldn't be a better host. He was so efficient in our interactions before we arrived I thought he would be \"all business\". That could not be further from the truth. He is laid back, warm, welcoming, and interacts with you as if he's known you for a long time. He walked us around the neighborhood, noting traditional places to eat, main plazas, supermarket, and very good instruction on finding the building when returning to the apartment. The price is extremely reasonable for accommodations in the Old Town even if this was a hotel room, but this was more like a large condo. You must stay here if you come to Prague!!!!!!!!", "title": "Over the top", "helpfulness": 4, "user": "nzbraughton", "date": "December 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 147352826}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled with family", "text": "My six year old son and I spent 10 nights staying in the attic apartment. The apartment was extremely spacious, very clean, and well decorated. And the views! Wow! The overall temperature was easy to control and the bathroom had floor heating and heated towel racks. A delicious breakfast was delivered every morning by two lovely ladies (the grilled zucchini and crepes especially amazing) and the apartment was cleaned daily. Pasquale was the perfect host. He organised a driver to and from the airport and was there on arrival and departure to help with the luggage. I highly recommend this accommodation.", "title": "Wonderful!", "helpfulness": 3, "user": "Sarah M", "date": "December 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 147201777}, {"rating": 5.0, "stay_parameters": "Stayed December 2012", "text": "I visited Prague for a quick 2 nights and stayed here after reading TA reviews.", "title": "This is the one!", "helpfulness": 4, "user": "jill w", "date": "December 10, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 147100922}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "I was a lone woman traveller but this apartment was just perfect, Pascale is so helpful and friendly - right down to organising a car to pick you up and take you to rail station ( highly suggest especially coming in when dark) $20 aud each way but well worth it - new mercedes.", "title": "The room's wonderful - the hospitality is even better.", "helpfulness": 8, "user": "Tilosrules", "date": "December 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 146836695}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "Position of the accommodation is perfect. The apartment is perfect right down to the breakfast being served daily at a arranged time by two friendly ladies.", "title": "Arcadia Residence is an ideal accommodation in Prague", "helpfulness": 1, "user": "Korky McC", "date": "December 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 146613528}], "location": {"country": "Czech Republic", "region": "Bohemia", "continent": "Europe", "city": "Prague"}, "stars": 3, "variance": {"poor": 0, "average": 1, "very good": 14, "terrible": 0, "excellent": 929}, "aka": "Arcadia Residence Hotel", "slim_ranking": 0.00148588410104, "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}}