{"user_rating": 4.5, "review_count": 216, "name": "Arcata/Eureka Holiday Inn Express", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed July 2005", "text": "Best stay in the area. Looks brand new. I love the new \"smart bath\" products. The shower head is great.", "title": "Best in area!", "helpfulness": 1, "user": "seethemoon", "date": "July 27, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 3705932}, {"rating": 4.0, "title": "great hotel", "text": "Nice views from some rooms.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "June 30, 2005", "id": 3623455}, {"rating": 5.0, "stay_parameters": "Stayed June 2005", "text": "Knowing that Arcata and Eureka have a lot of run down hotels, we were very happy when we stayed at this hotel located in the same general area, Mckinleyville. The hotel is very nice, seems like new, the shower was great (lots of water), and we enjoyed the continental breakfast, especially the hot cinnamon rolls and chocolate muffins. We also enjoyed the pool and jacuzzi. This is the place to stay when you're in the area.", "title": "The place to stay near Eureka", "helpfulness": 5, "user": "tooluser", "date": "June 16, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 3558740}, {"rating": 5.0, "stay_parameters": "Stayed March 2005", "text": "I was very glad I made reservations here. I had originally intended to stay in Eureka, but after reading reviews on tripadvisor, I changed my mind and stayed here instead. The reviews here were spot on in their recommendations for this motel.", "title": "Very nice!", "helpfulness": 7, "user": "Mtngrl", "date": "March 27, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3304870}, {"rating": 5.0, "stay_parameters": "Stayed September 2004", "text": "It is a well-run motel -- polite, professional staff, and a good motel breakfast. Clean, quiet room that looked like new. McKinleyville is a smaller town, and everyone I ran into was nice. The motel is not close to anything but the airport, so you will need a car to get to shopping/food/sightseeing.", "title": "What a welcome surprise!!", "helpfulness": 8, "user": "cydona", "date": "October 3, 2004", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 2616425}], "location": {"country": "United States", "city": "McKinleyville"}, "stars": 2.5, "variance": {"poor": 3, "average": 17, "very good": 78, "terrible": 6, "excellent": 112}, "aka": "Holiday Inn Express & Suites - Mckinleyville Hotel Mckinleyville", "slim_ranking": 0.5, "description": "Relax and enjoy yourself in the modern conveniences of Northern California's newest Holiday Inn Express Hotel & Suites, a 100% non-smoking hotel. Venture through misty ancient redwood groves or stroll along unspoiled sandy beaches with spectacular views of the Pacific and its rugged coastline, all within minutes of the hotel lobby. The Inn's mission style architecture and country setting reflect the natural beauty of the north coast environment. The hotel is located just minutes from Humboldt State University in Arcata. Old Town Eureka is an easy 20 minute drive south and the charming town of Trinidad and Patrick's Point State Park are just 10 minutes to the north. We are also the closest hotel to Cher-ae-Heights Casino. The hotel offers everything the business or leisure traveler needs for a comfortable visit, with 84 rooms plus meeting space for groups up to 60. *Indoor pool, whirlpool spa and exercise room*Generous size rooms and wet bar suites*Free deluxe Continental breakfast*Free wired and wireless high-speed Internet access (all rooms)*Business center with two work stations*phone/data port access/voice mail*Guest laundry*Free airport shuttle*Restaurants and charming downtown area within minutes*Beau Pre public golf course 1/2 mile away*Bike rentals available onsite"}