{"user_rating": 4.0, "review_count": 469, "name": "ARCOTEL Velvet", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "My husband and I enjoyed a 3 night city break in Berlin in December, staying at the Arcotel Velvet. We were very please with our choice and thought it was great value for money. The hotel was in an excellent location with the tram and UBahn (Oranienburger Tor) just outside/next street. The staff were very friendly and helpful and gave us an information pack on arrival. The hotel was very comfortable and stylish with a modern design and fantastic floor to ceiling windows. 2 PCs were in the bar where guests can access the internet free of charge. The breakfast buffet was very generous. The central location of the hotel allowed us to walk into the city centre, but we took the UBahn back after we were exhasuted from a full days sightseeing. Airport transfer: We took the SBahn to and from Schonefield Airport, it took about 1hour with 1 change (Route: UBahn Orienburger Tor to Friedrichstrasse, then changed to SBahn for Schonefield changing at Ostkreuz)", "title": "We were delighted with this hotel", "user": "MozartEdinburgh", "date": "December 30, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 52181352}, {"rating": 5.0, "stay_parameters": "Stayed January 2009, traveled as a couple", "text": "Fantastic boutique hotel in a fantastic location. We stayed 3 nights over New Year's Eve in 2008.", "title": "Great place to spend New Year's Eve", "user": "lemkinn", "date": "December 6, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 50758339}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "The room had great amenities, with a great view of Oranienburger Strasse so we could see the madness from a safe distance.", "title": "Excellent Hotel, Great Location", "user": "edandpam", "date": "October 27, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 47918143}, {"rating": 5.0, "title": "Excellent hotel,excellent location, amazing city", "text": "Would stay again.", "user": "J_HOMidlandsUK", "date": "August 20, 2009", "id": 38294659}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "This was a great hotel in a fun artsy area of the city. We stayed 4 nights at the Acrotel Velvet during our 3 week trip the Eastern and Central Europe.", "title": "Charming hotel in the middle of history", "user": "ChrisTheHaguearea", "date": "July 10, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 34395623}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled with friends", "text": "I have to say I am a bit mystified by the Stasi Prison comparisons. In my humble opinion the Arcotel is quite cool and not a little quirky. I found the reception and bar staff to be extremely friendly and helpful ( special mention for Suzanne at reception ). Great location too,just north of the city centre. The area is full of great bars and restaurants and right next door to the Kunsthaus Tacheles , an huge art gallery/music venue/club that you really should check out-there is something interesting happening here most nights.", "title": "Fine hotel and location", "user": "dermot14", "date": "April 30, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 62901487}, {"rating": 3.0, "stay_parameters": "Stayed March 2010, traveled on business", "text": "My only gripe is the lack of tea/coffee making facilites in rooms , though this seems to be the rule in most continental hotels.", "title": "We discovered the ex Stasi Prison turned hotel now known as Arcotel Velvet", "helpfulness": 1, "user": "SFjoe", "date": "March 19, 2010", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 2.0, "sleep": 3.0, "rooms": 1.0, "location": 4.0}, "id": 58989036}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "Because Berlin was filled with a major tourist convention in Berlin this March, hotels were charging outrageous prices for available rooms. As a result we booked what was rated by Trip Advisor reviews as a cool place hip and only 62 on the rating scale of places to stay. Well it was in an up and coming neighborhood but the hotel turned out to be a cheesy version of someone trying to mimic the Hotel W concept. They do not pull it off.", "title": "Excellent location and good hotel", "user": "barnsley245", "date": "March 16, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 58695143}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "Because the hotel is in the former East German side of Berlin, I jokingly referred to it must being a former Stasi (secret police) prison converted to a hotel. So here is the rundown of what to expect if you stay there:", "title": "Great hotel in a great location", "user": "fleur1104", "date": "March 8, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 58033351}, {"rating": 1.0, "stay_parameters": "Stayed February 2010, traveled on business", "text": "1. Lobby area is small rundown and there is a bar to the right of the entrance to get your lousy free coffee and stale rolls in the morning. I wonder if the same former Stasi prison cook is making those \"breakfast included\" breads for the guests? What I found funny is that whatever the paid guests don't eat they leave on a tray by the front desk. We came back one night and those miniature door stops were still there. Maybe it was chastise the guests that they did not finish the morning stack of nasty treats? You know how those Germans are on not wasting food.", "title": "WORST HOTEL EVER!!!!!", "user": "jvtms910", "date": "February 10, 2010", "detail_rating": {"service": 1.0, "cleanliness": 2.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 1.0}, "id": 55624519}, {"rating": 4.0, "title": "great hotel, great loaction", "text": "We stayed at the Arcotel in September 2007 and couldn't have picked a better hotel if we'd tried. We booked a suite (more of an apartment) on the top floor, which was great value compared to other cities. The suite was spotlessly clean, had 4 rooms with great views and a very comfy bed. We didn't have the breakfast, as we had read it was very expensive, but there was no shortage of places to eat on Oranienburger Strasse, so no problem there. Also, don't get too concerned about the 'Working Girl's', they don't bother anyone (who doesn't want to be). Also, the post atomic looking hippy centre (I can't remember the name sorry), is definatly worth a look. We were initially put off but went in on our last night and realised we'd almost missed out on a bit of gem.", "helpfulness": 3, "user": "woodymark2", "date": "December 21, 2007", "id": 11880817, "likes": {"liked": "— The location and the room", "disliked": "— Pushy barman"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "Myself and my partner are in our thirties, so were aprehensive about the hotel and area possibly being too young for us. But on the contry, we found it to be a bit of something for everyone.", "title": "Funky new hotel", "helpfulness": 6, "user": "Paupy", "date": "December 14, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 11540689, "likes": {"liked": "— Location, room design", "disliked": "— Terrible pillows, tiny duvets"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "The only bad point I can think of is on occasion the staff, while friendly, were lacking in customer service experience. When we were leaving, we were not informed that our cab had arrived (even though they booked it), eventually the cab driver asked us while sat in reception if we were his customer (luckily my German is good). Also, whenever we went to the bar, the barman was always trying to push us to buy cocktails, when the majority of the time, all we wanted was a beer.", "title": "Great Hotel and Location", "helpfulness": 8, "user": "JaseK", "date": "November 7, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 10664959, "likes": {"liked": "— Funky, great windows", "disliked": "— Sparse reception area and bar"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled with friends", "text": "But these were very minor gripes compared to the overall experience, which was very enjoyable. I definately recommend the Arcotel Velvet and Berlin, a great hotel and fantastic city!", "title": "Very Good Place", "helpfulness": 9, "user": "xxrrttyy", "date": "November 3, 2007", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 10562423, "likes": {"liked": "— Service & Location", "disliked": "— The room power supply thing took getting used to."}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled on business", "text": "My husband and I stayed here for a weekend and we really liked it.Room was extremely clean and we actually got what we requested - one that was far away from the elevator shaft - which is rare.", "title": "Cool, funky and exciting", "helpfulness": 6, "user": "stevewynnerival", "date": "October 31, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 10466673, "likes": {"liked": "— The room"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "It's 10 years since we were last in Berlin, and I suppose I was a bit worried that the place might have changed beyond all recognition - caught up in the homogeny that seems to be taking over the world. Happily that wasn't the case, and the Arcotel Velvet is living proof of that. We stayed 4 nights.", "title": "Looking for the funky side of Berlin? This is it!", "helpfulness": 2, "user": "Maree P", "date": "April 4, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 27394651}, {"rating": 5.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "Firstly, the location is fab - literally a 1-minute walk from the Orianienburger Tor U-Bahn station (which is the line that comes from Tegel Airport), and a couple of minutes' walk from the Orianienburger Strasse S-Bahn (only 2 stops from Unter den Linden - ie. the Brandenburg Gate and the Reichstag). Right outside the door is one of the tram lines and there are buses around the corner on Friedrichstrasse.", "title": "Great hotel at a great price, in a great location....", "user": "RaspberryTigerUK", "date": "March 1, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 25380976}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "Orianenburgerstrasse is typical Berlin, and the way I remembered it - cool glass and steel modern buildings cheek-by-jowl with crumbling stone buildings covered in graffiti and often serving as contemporary art spaces. There are fantastic cafes and eateries all along the street - Thai, Italian, Indian (warning: if you want 'proper' Indian food you need to tell your waiter. Otherwise you get bland, spice-bereft, creamy Indian food designed for the German palate). We are vegetarians and all the restaurants had a good selection of vegetarian options - much better than here in the UK. It's about a 30-minute walk to Alexanderplatz and the Fernsehturm, if you don't want to take public transport, and on the way you can explore the fabulous art nouveau courtyards of Hackesche Hoefe.", "title": "Best Hotel of our 3 week trip!", "user": "canyonlady", "date": "January 21, 2009", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 23768955, "likes": {"liked": "— The size and cleanliness of the rooms; location", "disliked": "— nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2007", "text": "A pleasant discovery was that The Ramones Museum was just up the street and around the corner. I knew about the Museum but it was a real bonus that it was so close to our hotel.", "title": "Red is my favorite colour", "user": "KarenBee", "date": "January 14, 2009", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 23557024}, {"rating": 4.0, "stay_parameters": "Stayed December 2008, traveled as a couple", "text": "The view from some of the rooms at Arcotel Velvet can be disconcerting if you're not expecting it; we had a standard queen room at the back of the hotel, and our windows looked out to - well, there's no other way to put it - a junkyard! But that's all part of the Berlin experience. Our room was funky, modern, comfortable, clean - with nice bed linen and towels etc. The staff are unbelievably nice and although I speak some German they were happy to switch to English when I apologised in German that my language skills were not fabulous, or whenever my partner spoke to them in English.", "title": "Nice place, nice location", "helpfulness": 1, "user": "neilyork", "date": "January 5, 2009", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 23275758, "likes": {"liked": "— Modern, location", "disliked": "— Chargeable room internet, expensive drinks"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled with friends", "text": "Just returned from Long weekend in Berlin, staying at the Arcotel. Really nice hotel with very comfortable trendy style rooms ideal. If you're planning to be out and about all day sightseeing, then this place is ideal, excellent location and most of the sites are 30 min walk away and there is a tram stop right outside and tube 100m away. Plenty of restaurants, bars and clubs around the hotel of all styles, no need to wander more than 15 mins of the hotel to find something you'll like. Found wandering back to the hotel bar after dinner was good way to finish the evening as the cocktails they serve are really good and the bar is nice place to unwind in. Other than the nice rooms and good bar, hotel doesn't offer many facilities, breakfast will set you back 15 euro pp and it's ok if you can't be bothered to go out and find somewhere. One word of warning. If you come out of the hotel late in the evening and turn right, after about 20m or so you will start to come across 'ladies of the night' standing around. Whilst it is a warning, don't be put off as that's the main direction of the bars and restaurants. Unless you are single or group of guy(s), then you'll have no hassle at all, otherwise you may have to say 'No' - a lot!!", "title": "Excellent hotel in excellent location", "helpfulness": 8, "user": "aMid-aSmi", "date": "October 30, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 10447757, "likes": {"liked": "— Location, Bar, Rooms", "disliked": "— Nothing, but I know it won't suit everyone"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2007", "text": "This is a lovely hotel in the Mitte area of Berlin. Very close to several U Bann Stations. Rooms were clean, good sized and well decorated with modern decor. There is a Flat Screen TV with DVD player - so be sure to bring some CD's if you are staying - we forgot! Rooms were quiet given the busy street outside,", "title": "Funky Hotel", "helpfulness": 4, "user": "travelight33", "date": "October 23, 2007", "detail_rating": {"cleanliness": 4.0, "front_desk": 4.0, "location": 4.0, "value": 3.0, "rooms": 4.0}, "id": 10250759, "likes": {"liked": "— The funky decor", "disliked": "— that breakfast wasn't included in the deal"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "The only thing that could have been included was breakfast - which there was a charge of 12 Euro per person for. If you walk outside the hotel there are plenty of eating placed closeby. The Indian place directly across the road was really nice for dinner and drinks - There are also a few italian's nearby.", "title": "Trendy hotel, with a great location", "helpfulness": 4, "user": "SelinaE", "date": "October 22, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 4.0}, "id": 10232952, "likes": {"liked": "— Location and room", "disliked": "— None"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "All in all a really nice 4 star hotel", "title": "Good choice for youg people", "helpfulness": 2, "user": "osk77", "date": "October 19, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 10137332}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "Decided to booked this hotel on our recent trip to Berlin based on the reviews given from Tripadvisor members and we were not disappointed. The location was just great and the hotel was new, trendy and it was a refreshing change from the standard hotel chains which we would usually stay in. The staff was friendly and efficient. We have requested for a late check out and was quickly obliged. Just outside the hotel are many restaurants. One in particular which we went to was a Cuban restaurant called QBA. The food was good, great cocktails and live Cuban music too. The place had a great atmosphere and was very reasonably priced. Both hotel and restaurant comes highly recommended !", "title": "Cool place, top location", "helpfulness": 6, "user": "NJS72", "date": "October 15, 2007", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 10082929}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "Great hotel. Greeted by friendly and efficient staff. Excellent room although probably not everyones taste. Comfy bed. Situated on Orianburger Strasse with many great Bars and Restaurants in easy walking distance. Most sites on east side of Berlin easily accessible even on foot, although S Bahn,U Bahn and Tram stop all within yards.", "title": "Great location, great hotel", "helpfulness": 2, "user": "ManchesterTartanLad", "date": "October 11, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 10067809, "likes": {"liked": "— Location", "disliked": "— Nothing"}}, {"rating": 2.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "Excellent bar, apparently one of the top 5 in Berlin which is a fair boast.", "title": "Nice hotel, shame about the noise", "user": "jft678", "date": "October 8, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 2.0, "rooms": 4.0, "location": 5.0}, "id": 10052737}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled on business", "text": "First impressions were of a really nice hotel, in a great location, with pleasant, helpful staff. We had asked for a quiet room and were pleased to be allocated one at the back, given that the hotel is on a busy street. Unfortunately the noise from the surrounding bars and clubs kept us awake all three nights we were there, well into the early hours. One night, at 2am, it was so bad I had to take the mattress off my bed and drag it to the small corridor by the bathroom to get some respite. A great shame as otherwise the hotel is good value for money and I would have been very happy to go there again.", "title": "Great hotel - great location", "helpfulness": 3, "user": "Delaware012", "date": "October 3, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 10036963, "likes": {"liked": "— Location", "disliked": "— pillows and bed"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "I just returned from a week at the Arcotel and had a wonderful time. What a fun hotel! The hotel has an unusual design and great floorplan. We were looking for a hotel that reflected the international travel, yet provided a spacious and comfortable living area. We stayed in a suite and had more room than we needed. The floor to ceiling windows were fabulous and gave a great view of the area. When needed, there were shutters and blinds you could use to afford privacy. The hotel staff were very helpful and friendly. Checkin and checkout were efficient. Our only complaints were that the bed was a bit hard and the pillows were lumpy and not great. However, we would stay here again in a heartbeat. The hotel is in a great location - near the U-bahn and S-bahn. There are great restaurants right across the street. We felt perfectly safe and did not find the night life uncomfortable. If you are looking for a \"funky\" hotel with lots of personality, then this is a great choice.", "title": "Loved it!", "helpfulness": 4, "user": "PoosieMelbourne", "date": "September 24, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 8875346, "likes": {"liked": "— Unique and stylish rooms", "disliked": "— Expensive bar and breakfast"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "We booked this hotel because of its unique rooms and great location and were not disappointed. The hotel is in a great location with lots of restaurants and really great shops nearby - no chains in sight!! The other great benefit of this place was its proximity to the main sights and public transport.", "title": "Love at first sight", "user": "Ullodea", "date": "September 21, 2007", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8839233}, {"rating": 4.0, "stay_parameters": "Stayed September 2007", "text": "It's a nice hotel and right in the middle of everything. It's very modern. The shower and sink were in the room, separated by a curtain and the toilet was in a separate room. Our room looked onto the street which was hopping even at 4am. It's a little odd that anyone walking down the hall could find out if you were in the room or not (room numbers are lit in red or green)", "title": "Very Modern", "user": "dopee36", "date": "September 12, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 5.0, "value": 4.0, "rooms": 3.0, "location": 4.0}, "id": 8704335}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled with friends", "text": "All in all, it's a very nice hotel, but I don't know if I'd stay there again.", "title": "Loved the hotel", "helpfulness": 3, "user": "maturecouple60plus", "date": "September 12, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 3.0}, "id": 8699130, "likes": {"liked": "— The Rooms"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "Have just returned from a 4 day trip to Berlin. This hotel was 1st class. The rooms were really nice. We had a quite room with a conventional bathroom. It is very close to the Uban and the Sban which made it really easy to travel around. A really good place to eat was just on the corner from the Sban underground. We ate there morning and evening and the staff were great. Turn right when you leave the hotel and walk to the Sban underground.", "title": "Very good", "user": "gorka", "date": "September 2, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 8606120, "likes": {"liked": "— Location", "disliked": "— breakfast, little bit expensive"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled solo", "text": "If you really want to shop you should stay near the main shopping area. The KaDaWe is like Harrods.", "title": "Hipster paradise and the best hotel of the trip by far.", "helpfulness": 5, "user": "cityscaped", "date": "August 30, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8580129, "likes": {"liked": "— Service, room, location, quality for money spent, bar (and constant teasing from the bartender).", "disliked": "— Having to leave!"}}, {"rating": 2.0, "title": "Our \"Velvet Comfort\" room was neither velvety nor comfortable!", "text": "A very nice hotel in a fantastic location. The hotel decoration is diferent and the location fantastic, if i return to Berlin I will stay here again.", "user": "A TripAdvisor user", "date": "August 18, 2007", "id": 8446510}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "The best thing about the hotel is its location. It's near major sights and close to the subway station. The bus stops right in front of the hotel. The hotel is very beautiful with lovely but very impractical design. The tubs don't have curtains so water comes out when you shower. We had a beautiful enormous sink but you had to stretch far to get your hands under the water. After a couple of days of that your back starts to hurt. The beds were very comfortable.", "title": "Good hotel but some problems", "user": "msague", "date": "June 28, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 3.0, "rooms": 3.0}, "id": 33392133}, {"rating": 4.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "We didn't have breakfast there because at 12 euros per person it was a bit too much and we are not big breakfast eaters, but right next door there's Expresso Ambulanz, where you can have a large capuccino and a freshly made croissant (they are baked there) for about 4.50 Euro.", "title": "a bit overrated", "user": "bari_ttc", "date": "June 10, 2009", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 5.0, "service": 3.0, "rooms": 4.0}, "id": 32069733}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled solo", "text": "The staff at the Arcotel Velvet was very helpful but they forgot about our wake up call the day we were to depart Berlin and we almost did not make the flight. That is unacceptable.", "title": "Cozy Design Hotel", "user": "moky_berlin", "date": "June 9, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 31973477}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "However, I do recommend the hotel and would return.", "title": "Berln at his best", "helpfulness": 1, "user": "Venti_caratteruzzi", "date": "May 2, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 29194523}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "This hotel chain is a bit overrated recently, the room is nice not nothing special, the bed is not particularly comfortable and the so called ' design' is just trying to make it different with the traditional hotel. I will recommend this hotel to friends if the price can pull down a bit.", "title": "Berlin no longer the divided city.", "user": "planetearth", "date": "April 14, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 28022829}], "location": {"country": "Germany", "continent": "Europe"}, "stars": 4, "variance": {"poor": 22, "average": 48, "very good": 183, "terrible": 6, "excellent": 210}, "aka": "Arcotel Velvet Berlin", "slim_ranking": 0.188905547226}