{"user_rating": 4.5, "review_count": 315, "name": "Arcotel Camino", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "Very nice staff, beautifully renovated historical building, lovely outside and inside décor, clean and very comfortable room. The only thing was, it’s not on GPS, and although it’s located at one of the main streets it’s easy to miss the hotel sign – drive slowly!", "title": "Very good choice!", "user": "Gosia79", "date": "August 9, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 37160799}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled with family", "text": "We only came to Stuttgart because I wanted to see the Porsche museum/factory tour. In doing my reserach, the Arcotel Camino seemed liked the best option: close to the train station and city center, a brief train ride from Porsche. This was by far the most elegant hotel we stayed in during our two-week trip in Switzerland and Germany, for a reasonable price. We were in room 143 - a triple room, that had a double bed for my parents, and a double couch bed for me. The room was very spacious with high ceilings and a comfortable bathroom. As others noted, it is a brief 5-10 minute walk from the main train station in Stuttgart, but if you are towing a lot of luggage, take a 5 Euro cab ride (we walked with our luggage for our departure, since it was downhill). The local shopping/dining district is also within about a 10-15 minute walk. Since I was just off from a business trip and was keeping in touch with my husband at home, I was using the wired internet access they offered for free, which was spotty at best. You can pay to upgrade, but I tried to do that on my last morning there and it didn't work so well. Also, we checked out before leaving for our Porsche tour (which is an easy train ride from the main train station) and asked to leave our luggage in their \"secure luggage room\" - when we returned 5-6 hours later, it was still sitting on a cart in the lobby. We ate in their bar restaurant when we arrived - their main restaurant looks very nice, but you can only order their more expensive meals to eat there; if you want a sandwich or other casual dining, you need to eat in the bar. Overall, a very nice, comfortable hotel, and a quiet stay.", "title": "Great stop for experiencing the Porsche museum", "user": "pandah88", "date": "July 21, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 4.0, "service": 3.0, "rooms": 5.0}, "id": 35322817}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled on business", "text": "This hotel is very close to the Hauptbanhof, about 5 minuts walking, but far enough for being quiet and nice.", "title": "Great modern and nice hotel", "user": "parracule", "date": "June 24, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 33056315}, {"rating": 4.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "It's nicely decorated, with everythig that you can need. Personel is kind and smily.", "title": "who chose the carpet?", "user": "bagg10", "date": "April 28, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 28973511}, {"rating": 5.0, "stay_parameters": "Stayed December 2008, traveled with family", "text": "Breakfast is complete and quite good, and room service is very good as well.", "title": "Great hotel, great service, and great location!!", "user": "luv2trvl4", "date": "January 7, 2009", "detail_rating": {"cleanliness": 5.0, "front_desk": 5.0, "location": 5.0, "value": 5.0, "rooms": 5.0}, "id": 23351499, "likes": {"liked": "— Beautiful hotel and great location", "disliked": "— Nothing!!"}}, {"rating": 5.0, "title": "fabulous hotel--medium location", "text": "This hotel was outstanding in everyway. good size rooms, good sise bathroom, wonderful help, free internet in lobby, beautifully designed. inside new--outside looks like an old castle. very near railroad station--about 3 blocks away. nothing near hotel, but once you get to the station, you are near the city center and the metro there goes everywhere.", "user": "mickey75", "date": "November 5, 2009", "id": 48604179}, {"rating": 4.0, "title": "Very clean - almost sterile - but the carpet... whoa!", "text": "The new mercedes-benz museum is fabulous and every single bit of information is written in english as well as german. it is beautiful and fascinating if you are interested in the history of transportation and also how concentration camp survivors were used as laborers int the factories. There is also a very beautiul town about 20 minutes away by subway that goes dirctly from the train station. ZI can't recall the name, but it is something like isseling or essling. ask--it is so beautiful, any will know it.", "user": "Jennifer T", "date": "October 26, 2009", "id": 47795415}, {"rating": 5.0, "title": "Excellent!!", "text": "We stayed at the Arcotel Camino October 2009. Having just come from Amsterdam, we found the Amsterdam hotel staff to be more friendly, but the Arcotel staff was definitely helpful. The hotel was very, very clean, in a great location in terms of hopping on the city trains, and offered a great breakfast in the morning. The only complaint we really had was my husband felt the carpet made him dizzy and that perhaps the hotel had bit of sterile feel. I'd rather have a hotel too tidy than be on the dirty side, however.", "user": "JaguarXF", "date": "August 25, 2009", "id": 38761516}, {"rating": 3.0, "title": "Nice hotel in Stuttgart", "text": "We did not eat at the hotel restaurant, but it looked good. We did enjoy the bar and the bartenders were very friendly and recommended great wines to try.", "user": "Solsikke", "date": "August 11, 2009", "id": 37374480}, {"rating": 4.0, "title": "Perfect location for exploring Stuttgart", "text": "I would probably try some other place in the future with more ambiance, but I would definitely recommend it to friends for the cleanliness, value and the convience of location.", "user": "R4chyroo", "date": "August 10, 2009", "id": 37287700}, {"rating": 3.0, "title": "Decent hotel", "text": "I chose the Arcotel Camino because I wanted a place near the train station and near the downtown where I could stay with my wife and daughter and not pay too much money. I booked a suite, with my daughter sleeping in the adjoining room.", "user": "CaracasCorrespondent", "date": "May 15, 2010", "id": 64225331}, {"rating": 5.0, "title": "Very impressed by this hotel", "text": "The suite was fine. The Internet connection was good. The front desk staff went out of its way to help me when I was trying to find a candle for a small birthday cake for my daughter.", "user": "Live4Dance", "date": "May 14, 2010", "id": 64152392}, {"rating": 5.0, "title": "Very friendly staff, lovely hotel", "text": "One warning: the hotel is up a slight incline, about 300 meters from the train station, in case you are planning to walk. I did it, but I huffed and puffed a bit.", "user": "susiemc", "date": "May 11, 2010", "id": 63868228}, {"rating": 5.0, "title": "Great hotel", "text": "The hotel faces a busy thoroughfare with nothing charming around it. It's about a five-block walk to a pedestrian area with shops and restaurants.", "user": "harry1701", "date": "March 31, 2010", "id": 59990843}, {"rating": 5.0, "title": "Lovely Hotel", "text": "The room was big and very nicely decorated. We really liked the contemporary look which was a big contrast with the other Europeans hotel we saw during the length of our stay. The bathroom was big as well. Everything seemed new and very clean. They had free \"56kb wired\" internet, which was great!", "user": "MissJennb", "date": "March 24, 2010", "id": 59406508}, {"rating": 4.0, "title": "Comfotable hotel with a very good breakfast", "text": "The hotel is kind of trendy but also comfortable with big rooms. Some people have complained about the odd bathroom layout but it works out quite alright unless you are total strangers.", "user": "eh_64", "date": "March 1, 2010", "id": 57474507}, {"rating": 4.0, "title": "New hotel, Good service, Trendy room", "text": "One of the best things was the buffet breakfast which was very extensive and I thought quite good value at 17 Euros. The weekend rate was a bargain at 80 Euros per room and with an adjoining room for our children worked out very well.", "user": "chufa", "date": "January 31, 2010", "id": 54818790}, {"rating": 5.0, "title": "Fantastic hotel suberb staff A1", "text": "The only negative point for us was the location. We arrived by rental car from the South and it's not easy to find the hotel entrance - it's not well sign-posted and we actually had to stop in a side street to look around for the entrance even though the hotel is on a major road.", "user": "MissElainey", "date": "December 21, 2009", "id": 51596776}, {"rating": 5.0, "title": "Excellent Hotel", "text": "All in all a good choice although it lacks the luxury of the Hotel am Schlossgarten where we stayed a few days earlier.", "user": "Atl30309", "date": "November 18, 2009", "id": 49497865}, {"rating": 4.0, "title": "Good designer hotel, but some hiccups", "text": "Central location, New interior, Decent value", "user": "smartnik", "date": "November 8, 2009", "id": 48758656}], "location": {"country": "Germany", "continent": "Europe", "city": "Stuttgart"}, "stars": 4.5, "variance": {"poor": 6, "average": 35, "very good": 135, "terrible": 2, "excellent": 137}, "aka": "Arcotel Camino Hotel", "slim_ranking": 0.0584415584416}