{"user_rating": 4.5, "review_count": 64, "name": "Arenal Oasis", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "My family (me, my wife, 21 and 20 year old daughters) stayed at Arenal Oasis for 4 days in Mid-July. Upon check in we met Senora Bonilla who was very cordial and helpful. Despite the pouring rain she showed me to our cabin to make sure it was satisfactory. All the staff at the lodge were great. Our room was cleaned well each day and the breakfast (included in price) was very good. The nature trail in the surrounding forest and butterfly garden were beautiful. The lodge is off the main road outside La Fortuna and the road is bumpy but not impassable. It's location is perfect if you want a quiet retreat, which we did. There is no view of the volcano but you will see it every time you travel around the area since it is so close and huge. The cabins don't have AC but are equipped with a fan. I would definitely recommend this lodge to friends and family.", "title": "Great Stay!!!", "user": "CalTraveler45", "date": "July 27, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 72641900}, {"rating": 5.0, "stay_parameters": "Stayed May 2010", "text": "We spent three nights at Arenal Oasis. What a great place! It's a short distance away from La Fortuna, away from all the grinding gears and constant noise, and the air is fresher and cooler, since it's a little ways up a hillside. The taxi into town was $3. But there was a small village nearby with restaurants and a grocery store, so we had all that we needed close by. Arenal Oasis has its own trails through the jungle, complete with a butterfly dome, live animal exhibits, and frog ponds. The morning breakfast in the open air dining area was a real treat. We enjoyed excellent gallo pinto and fruit while watching the exotic birds feast at the bird feeder and the chickens pecking around in the grass. The host family was very quiet but friendly and helpful with our activities. Since virtually all activities include pick-up at your hotel, the distance from Fortuna was never a problem. We felt very much at home here.", "title": "Great place!", "user": "Nancy052", "date": "May 13, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 64092835}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled with family", "text": "Once we arrived up the bumpy road, we knew that we'd found a remarkable place. While it's not far at all from La Fortuna, you feel as if you are staying in a jungle lodge - a lodge with beautiful and cozy accommodations, delicious breakfast, and friendly staff. Our casita was peaceful and felt isolated, though it was steps away from the dining area. Actually, our best sleep of the trip was at Arenal Oasis, free-range roosters notwithstanding! As detailed in New Key to Costa Rica, Arenal Oasis includes some really added value in its mini-zoo, which includes a butterfly aviary and exhibits of frogs, spiders, snakes, and lizards. My 5-year-old son again found another friendly child to play with and show him the exhibits and forest, which made this extra fun.", "title": "True Oasis at the Base of Volcan Arenal and near Cataracta La Fortuna", "user": "idmaster", "date": "February 27, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 57238303}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled with friends", "text": "We found that the hotel made a great base for excursions to the thermal springs at Eco Termales, to Arenal Ecoglide canopy tour, and to Catarata la Fortuna (3 hot uphill kilometers on same bumpy road). The staff is incredibly helpful and friendly - note that while most of the time English was spoken fluently, when Dona Rosa was running reception there were more limitations. I speak Spanish decently, so it wasn't a problem for us but for others it could be. The staff was great at booking services and even gave us a ride over to Eco Termales.", "title": "Puts the Eco in Eco Lodge!", "user": "Remko_R", "date": "October 25, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 3.0, "rooms": 4.0}, "id": 47705304}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled with family", "text": "While I see other reviews say there is a restaurant on-site, at the time of our visit only the included breakfast was available. Because we were walkers without a car, we did have to work a little harder for food: one (relatively expensive) dinner at Catarata Eco Lodge, 1 km up the road, and the following day just having our cab driver from Eco Termales stop at a soda while we rounded up some comida tipica to take back with us to our casita.", "title": "Fanastic lodge in Arenal", "user": "Postvoormarijn", "date": "October 12, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 20816654, "likes": {"liked": "— Very close to nature."}}, {"rating": 3.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "New place with rooms in seperate casita's.", "title": "New hotel with casita's in development", "user": "baron1953", "date": "April 30, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "location": 3.0}, "id": 15490999, "likes": {"liked": "— Restaurant", "disliked": "— Quality of interior; still in good condition, but likely to wear quickly"}}, {"rating": 4.0, "title": "Quiet and Rustic!", "text": "In march 2008 there were 5 casita's. Each containing one room.", "helpfulness": 1, "user": "lynnelawrenceville", "date": "January 24, 2007", "id": 6686916}], "location": {"country": "Costa Rica", "continent": "Central America"}, "stars": 2.5, "variance": {"poor": 1, "average": 2, "very good": 21, "terrible": 1, "excellent": 39}, "aka": "Arenal Oasis Hotel", "slim_ranking": 0.170212765957, "description": "This wonderful place is the results of several years of conservation, allowing to a different species of animal a new home; at the beginning of the 80’s was a big cattle field and now it is a paradise for Sloths, Mexican Anteater, Gray Fox, Ocelots, howler Monkeys, Toucans, Manakines, Hummingbirds, Turkeys, Tree Frogs, Glass Frogs and Poison Dart Frogs, Snakes, Lizards and much more...Accomplishing this rich natural environment, the Rojas Bonilla family created some cabins out in the woods, restaurant and one thematic trail of a several stations all along the refuge, where the visitors get a speech about natural history of the species."}