{"user_rating": 4.5, "review_count": 3097, "name": "Argonaut Hotel", "reviews": [{"rating": 5.0, "title": "They had me at \"Would you like a goldfish in your room\"....!!", "text": "We stayed at the Argonaut as part of a three week road trip around West Coast USA. We had booked the hotel following a recommendation from a friend who had stayed there, and after reading the largely positive reviews on the Tripadvisor.", "user": "A TripAdvisor user", "date": "October 18, 2010", "id": 83980271}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "After a bit of a nightmare drive into Fishermans Wharf (be warned, the traffic + pedestrians + bikes = driving stress!) we found the hotel with ease and pulled up out front for Valet Parking. On booking the hotel we booked their \"Perfect Parking\" package which included complimentary valet parking for the duration of our stay - we were so glad we had when we saw the parking rates were over 40 dollars a day!!", "title": "The perfect place to stay in SF", "user": "Zman27", "date": "October 18, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 83923044}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "We were greeted by a super friendly bell hop who took our bags, directed us to the reception and fetched us a glass of wine from the wine hour - what a lovely time to arrive!! The receptionist was so warm and friendly: on seeing us saying hello to the goldfish on reception, she asked if we'd like one in our room for the duration of our stay. What a lovely idea! She asked if we were staying for any special occasion, and when we told her it was our first wedding anniversay, she immediately offered us some complimentary champagne to be sent to our room. On top of that, we were offered a voucher for a free in-room movie during our stay: we hadn't even got to our room yet!", "title": "Recommend - Funky Decor", "user": "Michellebentravellin", "date": "October 14, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 83417345}, {"rating": 4.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "We had booked a King Inner room and it more than lived up to expectations: large, clean and complete with pet goldfish! I was a little worried, after reading the reviews on the website, about privacy but there was nothing to worry about - the room did look out on others, but if you were bothered by it - just shut the blinds!!", "title": "Loved It!!", "user": "Charlene351", "date": "October 13, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 83326718}, {"rating": 5.0, "stay_parameters": "Stayed September 2010", "text": "The hotel is located at the bottom end of Fishermans Wharf, right next to the cable car turning station and just a short walk to an abundance of restaurants and shops. Next door is a bike rental place where you can rent bikes to ride over the Golden Gate bridge, should you wish (it's a great experience). Breakfast wasn't included for us and so we ate in a number of different cafes, including the one attached to the hotel, which was great, but not amazing.", "title": "What a find!!!", "user": "Borrego1234", "date": "October 11, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 82930566}, {"rating": 5.0, "title": "First Class!", "text": "I am writing this review from the hotel's free internet access computer,just one of the many little touches that make this place special.The door is always opened for you and everyone says hello,nothing is too much trouble,for me that is what makes a hotel.The location is perfect,right on Fishermans Wharf,but at the quiet end.We can see Alcatraz and the Golden Gate Bridge from our room window,so it is out of the hassle,hustle and bustle of the city,but still only 5 minutes on a cable car away,the stop is 30 seconds from the hotel door.The Concierge can't do enough for you and will help plan anything you want to do in the finest detail.Very reasonably priced for the level of service,decor and feel of the place,our room is very comfortable and still smells new.We have never visited San Francisco before so we hoped that we had chosen a good hotel for our stay,we were not at all disappointed.It is nice to find places like these as i think it really makes your stay that bit more of an experience rather than just a holiday.", "helpfulness": 5, "user": "simeon_1", "date": "January 13, 2005", "id": 3005617}, {"rating": 5.0, "stay_parameters": "Stayed December 2004, traveled on business", "text": "Where could you be more in the center of SF's tourist attractions than at Fisherman's Wharf. The ferry to Alcatraz and the cable car to downtown leave just a couple of blocks from the hotel. The rooms are particularly nice, emphasizing the natutical theme of the hotel. If you can afford, take a harbor view room for one of the most spectacular hotel rooms views in the city. Parking and breakfast could definitely be significantly cheaper, but all in all we were very satisfied and would return again.", "title": "Excellent place to stay.", "user": "olleee", "date": "January 12, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 4.0}, "id": 3002981}, {"rating": 5.0, "title": "Wonderful hotel...book now!", "text": "Just returned from a four night stay at The Argonaut. The hotel is situated in the best bit of Fisherman's Wharf. On the whole the Wharf is tacky, but not as bad as I expected. The proximity to the cable car stop is a definate bonus (especially if you are on your own and worried about safety).", "helpfulness": 2, "user": "A TripAdvisor user", "date": "January 10, 2005", "id": 2993314}, {"rating": 1.0, "title": "Noisy + Rude does not equal good hotel", "text": "The staff were friendly at all times and always acknowledged you, and you always received a friendly welcome from the doorman. The decor, although wacky, is very tasteful and not at all overpowering.", "helpfulness": 8, "user": "A TripAdvisor user", "date": "January 8, 2005", "id": 2989803}, {"rating": 5.0, "title": "Best Hotel in SF", "text": "I had a room facing the courtyard (a view would have been nice, but I was hardly in the room during daylight hours). It was totally spotless, you would honestly think that it had been furnished and renovated especially for your visit. Lots of extra touches that set the hotel apart, such as flat screen TV, DVD, Starbucks coffee, modern phone and clock radio.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "January 6, 2005", "id": 2982883}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled with family", "text": "we had initially been recommended to the holiday in by the travel agent but after reading the reviews of both that and the Argonaut on trip advisor I went back and asked her to get us into this hotel.", "title": "very impressive", "helpfulness": 1, "user": "tobey4", "date": "December 13, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 11517979}, {"rating": 5.0, "title": "Impeccable service: Three cheers for the staff here", "text": "It was all we had expected. The room was very nice, although a bit of a walk from the lift. fitted all of us in without a problem. The staff were all very nice and the door staff very knowledgeable. Corserge was a bit limited in her skills but others in front of house made up for this.", "helpfulness": 1, "user": "herculepoirot", "date": "December 10, 2007", "id": 11436046}, {"rating": 3.0, "stay_parameters": "Stayed November 2007", "text": "I've stayed here many times -- it's a great property no question about it -- even if you don't have a room with a view. This time I have to say that everyone I spoke with/met -- from bellmen to housekeeping to front desk and beyond...truly one of the nicest, most accomodating teams I've encountered in a long time. It makes the stay even more enjoyable. Thanks!", "title": "Thought on the Argonaut", "helpfulness": 3, "user": "LeBristolUK", "date": "December 9, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 11397452, "likes": {"liked": "— High quality of rooms", "disliked": "— Some noisy rooms ant atrocious breakfast"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2007, traveled with friends", "text": "I had to be in San Francisco for work on Monday so flew out the Friday before. It seemed obvious to look for somewhere at Fisherman’s Wharf and I was very impressed that the Argonaut had rooms available for only $150 a night. It took a while for work to confirm the meeting, by that time I realised that Fisherman’s Wharf is full of burger bars and t-shirt shops and the price had risen to $250. But it still seemed a good place to be based so I booked it.", "title": "Great Hotel - good location", "helpfulness": 2, "user": "Colszy", "date": "December 9, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 11382740, "likes": {"liked": "— Well managed and nothing was a problem", "disliked": "— uneven sizing of rooms on the same tariff"}}, {"rating": 3.0, "stay_parameters": "Stayed November 2007, traveled with family", "text": "Was it worth it?", "title": "Mixed Feelings", "helpfulness": 2, "user": "vinoguy", "date": "December 1, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "rooms": 2.0, "location": 5.0}, "id": 11184754, "likes": {"liked": "— Location and size of room", "disliked": "— Level of noise in the room and difficulty regulating room temp"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2006", "text": "We stayed at the Argonaut March 13-17, 2006, and had a 4th floor bay view room (which I highly recommend). From the room we got a fabulous view of SF Bay, the Golden Gate Bridge, the Powell & Hyde Cable Car turnaround and Ghiradelli Square. The rooms here are charming--neat nautical theme, great beds, and nice touches like a Sony flat screen TV. And the hotel was quiet throughout the week. The service was excellent, and all of the staff members we dealt with were courteous and friendly--especially the doormen. Didn't particularly like waiting for the car (valet parking) every time, and $36 (plus $5 tax) parking per night is steep. But the hotel otherwise is great! And don't miss their Blue Mermaid restaurant. It too is terrific. All in all, this place is a real gem.", "title": "Argonaut Was Great--a real Gem", "helpfulness": 8, "user": "willSA", "date": "March 18, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4690003}, {"rating": 5.0, "stay_parameters": "Stayed March 2006", "text": "We stayed at the Argonaut on March 7-11. Upon arrival we upgraded our room to larger room overlooking the bay. The room was huge by today's standards. We could not have been more pleased. The concierge was helpful and the wine reception every evening is a nice touch. We never had any trouble with the valet service, the wait for our car each time was not excessive. The parking fee each night was $36 and there is no other option, but, keep in mind this is San Francisco and there is no free or budget parking. I'm sure if you check with other properties in the area this is a competitive rate. Also, I didn't see any other fisherman's wharf hotels that seemed as nice as the Argonaut.", "title": "Great stay at the Argonaut!", "helpfulness": 6, "user": "1Beachgirl", "date": "March 16, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4627030}, {"rating": 5.0, "stay_parameters": "Stayed March 2006, traveled on business", "text": "The location is great-within walking distance to all of the Fisherman's Wharf attractions, Ghiradelli Square is right around the corner, Lombard Street is four or five block up the hill and don't miss The Buena Vista around the corner for an Irish coffee!", "title": "I'm coming back...", "helpfulness": 4, "user": "Tracy98110", "date": "March 15, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 4626002}, {"rating": 1.0, "title": "Horrible experience - car stolen from valet parking", "text": "I would definately stay again at this property and will recommend it to all my friends.", "helpfulness": 12, "user": "ChezNoodles", "date": "March 8, 2006", "id": 4592439}, {"rating": 5.0, "title": "FANTASTIC HOTEL AND SERVICE!!!!", "text": "The Argonaut is quite lovely, the staff were great, the rooms are different, I enjoyed the nautical theme. And the location is simply great for seeing this part of San Fran. I was there for a quick i.e. less than 24 hr stay for a business meeting, but will definitely be back with my wife to spend some time there. One quick note, the rooms looking into the stark interior space, or on the 2nd floor looking at the street, certainly don't give you any reason to open the windows, but in these rooms you can just stay within, and pretend you are on a ship.....", "helpfulness": 6, "user": "tarilyn", "date": "March 5, 2006", "id": 4584381}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled with family", "text": "This is our first experience with a Kimpton Hotel, but if all Kimpton properties offer the same level of service as the Argonaut, then there will surely be Kimpton Hotel stays in our future.. My 12 year old daugter and I are currenly staying at the Argonaurt for a mother/daughter weekend and the level of service, cleanliness and charming rooms have won us over! This is a busy weekend as it is Fleet Week and the hotel was unable to accomodate our request for a room with a view, however, the manager has really raised the bar and had a whole bag of \"San Francsico Treats\" delivered to our room including a wonderful book on San Fran history to help my daughter with a school project, a telescope, notepad, and message in a bottle kit. All of this along with water bottles and a personal note from the manager. The hotel is in a convenient location to restaurants, shops, cable car stop and Ghiardelli Square. The evening wine (sparkling cider for my daugther) by the fire is a nice touch. Every staff member at this hotel is friendly and accomodating. We also enjoyed delicious chowder in bread bowls and a lovely salald in the hotel restaurant \"The Blue Mermaid\". Catching glimpses of the Blue Angels from our hotel room window has been an unexpected treat. We'll be back for sure.", "title": "Outstanding Service", "user": "LILSTER06", "date": "October 8, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 82667733}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "We got off a cruise ship in San Francisco and stayed for three nights at the Argonaut Hotel. I was not feeling well when we arrived and they immdiately ordered tea from the restaurant. The hotel staff and conscierge were wonderful. Every night there was a wine reception which everyone enjoyed! They were very generous with the wine!", "title": "Argonaut Hotel - a great stay!", "user": "Roberta6568", "date": "October 8, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 82638454}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "I didn't like our room the first night because it was one that the window didn't open so they changed us to another room for our remaining two nights with no extra charge. The location was superb. We were right on Jefferson near Heyd Park Pier which is a great tourist attraction. The cable car was right next to the hotel on Heyd Street and the Ghiradelli Centre is not even a block away. Everything that you want on Fisherman's Wharf is just out the door.", "title": "Fabulous Hotel", "user": "ILBahamas", "date": "October 8, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 82634351}, {"rating": 4.0, "title": "Great Location!", "text": "This hotel is not cheap but I would not go anywhere else. One more thing, consider Mr. Toad's Tour for sightseeing. It was wonderful.", "user": "satkinson", "date": "October 8, 2010", "id": 82612052}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "We recently visited San Francisco for the first time. That being said, we wanted to be near Fisherman's Wharf and found the Argonaut online. The service, location, rooms, wine hour, restaurant, bartenders, wine bar, cleanliness, etc. all derserve 5 stars. Any trip to San Francisco in my future will include a stay at the Argonaut.", "title": "Very comfortable and great location", "user": "JulieK58", "date": "October 6, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 82339765}, {"rating": 4.0, "title": "Argonaut was superb", "text": "Recently stayed in the Argonaut hotel in Fisherman's Wharf, good room nicely decorated, hotel bar and food was good, nice touch by hotel offering free wine tasting in the evening. Very convenient for the whole of Fisherman's Wharf, great location, easy to get to trams and about 15-20 mins on tram to downtown San Fran. Service on trams can be a little slow at times, Hotel needs to brush up on a more personal touch as it can seem a little heartless. Would stay again.", "user": "KJBerkshire", "date": "March 5, 2006", "id": 4583165}, {"rating": 5.0, "title": "Don't Believe the Negative Reviews", "text": "My wife & I spent a week here, on the 4th floor with a view of the bay & Ghirardelli Square.", "user": "A TripAdvisor user", "date": "March 4, 2006", "id": 4582955}, {"rating": 5.0, "title": "Had a great stay at Kimpton Fisherman's Wharf", "text": "First - the staff was great. Everyone was extremely friendly and very helpful. I understand that a guest may encounter an employee on a bad day, but don't let that color your opinion of the staff overall.", "user": "SLWilliams", "date": "March 4, 2006", "id": 4581263}, {"rating": 5.0, "title": "great Wharf choice", "text": "Second - The room was great. I suggest the 4th floor, as there is no one walking above you. Also, I suggest paying the extra for the view rooms, even if you don't plan to spend too much time in the room (otherwise you get a view of a tiny concrete courtyard, not too great). While other reviews mentioned noise outside, my wife & I didn't notice anything more than the occasional cable car bell. Yes, the room is somewhat small - but folks, this is a hotel. If I want bigger rooms, I'll stay home. How much space do you need to sleep and brush your teeth (and maybe shower once in a while)? The only issue I had, and this is minor, was the somewhat thin walls between rooms and the hallway. Some noise can be heard from adjacent rooms and the hall outside the door. But this was in no way a deal-breaker.", "user": "Nigel129", "date": "March 4, 2006", "id": 4581070}, {"rating": 5.0, "title": "The Royal Treatment", "text": "Our first visit to San Francisco for our 30th wedding anniversary on Valentines Day this year was perfect. The professional staff at the Argonaut Hotel treated us like royalty. From the door man to the maintenance staff, this hotel is by far the best managed group we have ever encountered.", "helpfulness": 2, "user": "heavyweight", "date": "April 11, 2006", "id": 4965508}, {"rating": 5.0, "stay_parameters": "Stayed March 2006", "text": "Our expectations for a clean room were exceeded each day of our trip. We have traveled from Mexico through Texas and all stops along the East coast to Boston and the only room that even approached our standards was the Mandalay Bay in Las Vegas the first year it opened.", "title": "We'll be back!", "helpfulness": 4, "user": "bevsboy", "date": "April 7, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4943846}, {"rating": 5.0, "stay_parameters": "Stayed March 2006", "text": "We simply can't complement the hotel staff enough for making our visit a trip to remember!", "title": "Amazing Waterfront Hotel", "helpfulness": 5, "user": "spadogs", "date": "April 4, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 4933058}, {"rating": 5.0, "title": "A Must if you have kids!", "text": "My family, including two teenage daughters, stayed at the Argonaut for five nights from 30th March to 4th April. I have previously stayed at both the Radisson, and Sheraton at Fisherman's Wharf, and whilst both of these hotels were perfectly adequate, the Argonaut is definitely a step up in class. The rooms are a good size, and suitable for a family of four. The furnishings were excellent, and the rooms are kept spotlessly clean by the efficient housekeeping staff. The whole hotel has an ambience of quality, fully justifying its four-star rating. The staff were all very helpful and friendly, and nothing appeared too much trouble for them. If only the weather had been better, it would have been the perfect stay! As we left, John the doorman said \"Don't be a stranger\". We certainly won't, and in the words of the \"Governator\" of California, \"We'll be back!\"", "helpfulness": 5, "user": "fivecents6", "date": "March 29, 2006", "id": 4771991}, {"rating": 5.0, "title": "great-great-great", "text": "The staff were unbelieveably competent and friendly. We had a couple of boxes shipped in advance of our arrival and they were held with no problems and delivered promptly when we arrived. The Fisherman's Wharf/Hyde Street Pier/Cable Car turn-table location was wonderful for tourists. The evening wine-tasting was fun, the wines were excellent, and a great opporunity to chat with other guests. The restaurant also gets high marks. Check out your room for the \"free glass of wine\" coupon.", "helpfulness": 6, "user": "ninnasuttle", "date": "March 28, 2006", "id": 4741874}, {"rating": 5.0, "title": "Brilliant hotel", "text": "Third - Great location. I don't like the idea of being stuck in the middle of all the buildings downtown or in other more congested areas of the city. This hotel's spot on Fisherman's Wharf was perfect for me, as I prefer being close to the water. If we wanted to go into town, we either drove or took the trolley. There are plenty of excellent restaurants within walking distance of this hotel; likewise Pier 39 & Ghirardelli Square are nearby.", "helpfulness": 4, "user": "McClures", "date": "March 4, 2006", "id": 4580004}, {"rating": 5.0, "title": "Awesome", "text": "We stayed here in October 2004 for three nights with our four year old son and three year old daughter on a Hotwire special for $125 a night. The first room they gave us only had one king size bed but staff were quick to switch us to a room with two beds. The rooms were immaculate and spacious. Our children loved the nautical themed beds. The huge mirrors in the room were gorgeous. Our children also loved the restaurant and sun lounge chairs in the lobby. Easily the best of four hotels that our family has stayed at in San Francisco in the past two years. The location for tourists was also wonderful. The cable car was just out the door. The maritime museum across the street. The italian restaurants of North Beach only a 15 minute walk away. Would stay there again in a heartbeat.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "December 5, 2004", "id": 2863544}, {"rating": 5.0, "title": "Strongly recommended", "text": "E'nogh said, The French Guy.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "November 29, 2004", "id": 2853586}, {"rating": 5.0, "title": "Wonderful!", "text": "Absolutely amazing hotel. Location can't be topped. Rooms were cleaner than in more-luxurious-in-name hotels, as a matter of fact probably cleanest I've seen anywhere. Staff friendly, wine hour at 5pm, restaurant great. When I go back, that's where I'm staying.", "helpfulness": 8, "user": "A TripAdvisor user", "date": "November 29, 2004", "id": 2852484}, {"rating": 5.0, "title": "Great Trip", "text": "My husband and I could not have been more pleased with this wonderful hotel! We made reservations based upon much internet research and were not once disappointed during our three night stay. The location of The Argonaut is perfect...at the quieter end of Fisherman's Wharf, near the Hyde/Powell Cable Car turnaround, an easy walk to all of the sights along that part of the bay (including a lovely 45 minute walk to the Golden Gate Bridge if you are so inclined, but if not, an easy bus ride), and convenient to all public transportation. The room was quite comfortable, completely immaculate, and the nautical decor was a welcome change from the standard hotel room. Every member of the hotel staff was friendly and always happy to be of assistance. The concierge was especially helpful in directing us on the easiest ways to see the sights we were interested in. We would recommend this hotel without hesitation and would stay there again in a heartbeat.", "user": "Czechbrewer", "date": "November 28, 2004", "id": 2851244}, {"rating": 5.0, "title": "Fantastic Hotel", "text": "One recommendation that we found very helpful was to purchase a public transportation pass (available at the Cable Car turnaround) which gives you unlimited access to the cable cars, bus lines, and street cars. Also, ahead of time we booked a night tour of Alcatraz online directly through the Blue and Gold Fleet. This was an experience not to be missed if you have the time.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "November 22, 2004", "id": 2839547}, {"rating": 5.0, "stay_parameters": "Stayed March 2006", "text": "Stayed here for 3 nights in March. A very nice hotel, loved the room, lots of space, and despite it only being a de luxe king size room, and having spent the previous night elsewhere in a huge suite, it didnt feel small, although I suspect the rooms with 2 beds wouldnt have felt so spacious. Nice location, just on the end of fishermans wharf. Just bear in mind that it is a very touristy area, particularly on Saturday and Sunday, its much quieter during the week.", "title": "Superb hotel, nice location and service", "helpfulness": 2, "user": "NeilMacUK", "date": "March 28, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 4740556}, {"rating": 5.0, "stay_parameters": "Stayed August 2005", "text": "Can't fault the service given, and always with a smile.", "title": "Luxury and value!", "helpfulness": 10, "user": "SherriK", "date": "March 26, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4734841}, {"rating": 5.0, "stay_parameters": "Stayed March 2006", "text": "My husband and I stayed at the Argonaut for 3 nights last August and I have been meaning to write this review since then. One word to sum up our experience - WOW. Our stay there was perfect. We took advantage of a package that included parking and breakfast - a full breakfast from the regular menu. The food and service were great. The location was ideal - easy to find and right next to the trolley, easy walks to the Wharf and Piers, great restaurants and places to spend the evening. From the moment when we checked in, we were thoroughly impressed by the friendliness and sincerity of the staff - no \"in-your-face\" forced-smile attitudes, just people who seemed happy with their jobs and interested in making our stay perfect. The comlimentary wine hour was a great time - a gorgeous comfortable lobby, good wine generously served, pleasant way to relax before heading out for the evening and chat with staff and other visitors. We checked in just as the hour was beginning, were encouraged to take a glass up to our rooms and come back down for more. Everywhere we turned, there was comfort and ease. The rooms were a delight - not a single complaint. Nicely decorated (the theme wasn't overdone at all), spotless, impeccable condition, VERY luxurious bedding, Starbucks coffee in rooms - we both said that if we tried, we couldn't have found a single thing not to our liking. We've stayed in all sorts of places and this is def tops - would have been worth it at twice the price. We will look for other hotels in the same chain and I would love to stay at this place again.", "title": "Must Stay at the Argonaut", "helpfulness": 3, "user": "Donna S", "date": "March 24, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 4729832}, {"rating": 5.0, "stay_parameters": "Stayed March 2006", "text": "My daughter, sister in-law and I stayed at the Argonaut March 14th thru 19th. So glad we choose this Hotel. LOCATION!! SERVICE!!! Everyone at this hotel treated us like Queens. Starbucks coffee in the room a plus for me since I'm a big coffee drinker. The wine tasting (glass full) in the Lobby by the fireplace every evening is very enjoyable. While in San Francisco you must dine at Cliff House Sutro's Restaurant at least once. A bit expensive but go for the view. Make sure you arrive early around 4 or 5 to enjoy the view and sunset. It's not near the hotel and the cable cars do not go there so we had to take a taxi, but its worth it. Everything else is in walking distance or jump on cable cars next door and see the city. Go to Chinatown and eat at Cathay. They had the best chinese food! Locals including cops recommended it. I'm going back to San Francisco in September and will stay at the Argonaut. I will ask for a different room, only because next time I want a view. We were in room #427 which looked out to the other rooms, but it was very comfortable and quiet.", "title": "Fabulous stay at the Argonaut", "helpfulness": 5, "user": "SammyG", "date": "March 22, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 4.0}, "id": 4724046}, {"rating": 5.0, "stay_parameters": "Stayed March 2006", "text": "We stayed at the Argonaut for 5 nights this month from 9th to 14th March and had a fabulous stay. Quick and efficient check in with Mikel. Room very clean, beds comfortable, no view though as standard rooms overlooking each other.Problems encountered with T.V. and safe resolved quickly. Good location and next door to cable car turnaround that takes you right through to Union Square. Never had to open the door once the doormen always there to hand. Blue Mermaid restaurant disappointing we had a poor meal there. Wine tasting in the evening very relaxed and friendly altough my only criticism of this hotel would be on our last night, we were chatting to some people we had met and it was close to 6 o'clock. I had drunk half my glass of wine so my husband took it back along with his for a top up. The man serving this night refused to do this stating the glass was half full, this embarrassed my husband as everyone else had received more than one glass in fact the people stopping at the conference had someone circulating with the wine topping them up. This guy must of realised he had been rude and embarrassed my husband as he approached him 10 minutes later and offered to top the glasses up as the wine tasting had finished. Shame this encounter happened as it would be my only criticsm of the hotel, I would definately stop there again but drink my wine faster to avoid any embarrassment!!", "title": "Great Location, Delightful Property", "helpfulness": 10, "user": "CalvinR", "date": "March 19, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4692677}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "This is the best hotel I ever stayed!", "title": "Best hotel ever stayed!", "helpfulness": 1, "user": "Worldtraveler-SWE", "date": "November 28, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "business": 5.0, "cleanliness": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6230811}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "Nice, big and clean rooms.", "title": "Very nice Hotel", "helpfulness": 5, "user": "TanR", "date": "November 19, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 6153202, "likes": {"liked": "— Location"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "I would rate this hotel as a 5 star.", "title": "Great Location - Restaurant a bit fishy", "helpfulness": 12, "user": "Wolfsbait", "date": "November 14, 2006", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 6124352, "likes": {"liked": "— The funky naval theme", "disliked": "— The non existant view"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled with friends", "text": "Very nice hotel, all the staff were very friendly and helpful. We did not have any problems at all, our room over looked the courtyard which had pleasent music playing in the evening until 10pm. We only ate at the hotel once - clam chowder which was very tasty. For breakfast we went to the restaurant across the road - i recommend this as it was delicious (especially the omlettes!)", "title": "Loved it!!!", "helpfulness": 5, "user": "TPI1400", "date": "November 5, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6060057, "likes": {"liked": "— Clean, comfortable, location, friendly staff", "disliked": "— The small rip in the bathroom wallpaper - THAT was the only thing."}}, {"rating": 5.0, "stay_parameters": "Stayed October 2006", "text": "The tram line was just across the road - which takes you into the central shopping area. There were loads of restaurants, coffee shops and bars within walking distance too.", "title": "Hat's Off to The Argonaut", "helpfulness": 6, "user": "shonerm", "date": "November 4, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6055782}, {"rating": 5.0, "title": "It is as good as it seems", "text": "We stayed three nights at the Argonaut last week and it was fabulous. I can only give accolades to this hotel. We particularly liked the design, the location and the incredibly comfortable beds. Yes, they had charged us 57 dollars for a meal in the restaurant we never had, but they took this charge away without too much discussion. We will be happy to stay at the Argonaut next time we are in the Bay area.", "user": "xp01321", "date": "December 12, 2004", "id": 2877026}, {"rating": 5.0, "title": "Great Place to Stay", "text": "My wife and I stayed there on a stay in early December. Very nice hotel, great amenities, free high speed internet, great location. Would definitely stay again and recommend. Had a deal that included breakfast at the accompanying restaurant, which was also outstanding.", "helpfulness": 1, "user": "austintx", "date": "December 12, 2004", "id": 2876343}, {"rating": 5.0, "title": "Great Location", "text": "My wife and I just got back from 4 days/nights in San Francisco, and stayed at the Argonaut because of the great reviews. Like the other reviews said, the location is great: walking distance to everything on the Wharf, and a Cable Car stop is a block away to go to Union Square, Chinatown, etc. The rooms were very nice and the staff/service was friendly and helpful. The restaurant was a little slow; maybe understaffed. But everything else was great. We will definitey stay here again.", "user": "A TripAdvisor user", "date": "December 10, 2004", "id": 2875544}, {"rating": 5.0, "title": "Wonderful Hotel - Well Done", "text": "Stayed for 4 night early November 2004. This is a lovely hotel, very good standard, wonderful rooms, free internet access. The hotel bar is good with friendly staff and serves good food. The location is ideal, on Fishermans Wharf, but at the quiet end, around the corner from the Cable Car turnaround. The Doorman Donavan was friendly and very helpful. We highly recommend this hotel and would diffinately stay there again.", "helpfulness": 2, "user": "eneri39", "date": "December 10, 2004", "id": 2874886}, {"rating": 5.0, "title": "Absolutely the Best", "text": "Just got back from San Francisco, and the argonaut. I took a chance and went on hotwire for a room. We stayed at the White Swan Inn last time, and loved it, but wanted to be more on the wharf this time. I did call the hotel ahead of time, since we were going to be arriving after midnight, and reading some of the reviews it sounded like the hotel overbooked at times. They were very accomodating and promised my room would be ready.", "user": "A TripAdvisor user", "date": "December 7, 2004", "id": 2868954}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled with friends", "text": "We were leaving out of SF on a cruise and I had checked out the reviews of a variety of hotels. A fan of great service, I decided to give this property a try. Boy, am I glad I did!", "title": "Amazing Argonaut & Perfect Pre-Cruise Property", "helpfulness": 13, "user": "YetAnotherTraveler", "date": "January 15, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6596725, "likes": {"liked": "— Full package - staff, service, comfort, decor, location", "disliked": "— Nothing bad to report!"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled with family", "text": "We arrived well before check-in time and had a lot of luggage. Before we even got out of the cab, the staff greeted us in our van and started to help. We inquired about the possibility of an early check-in, and were personally escorted right to the desk by Kevin - an outgoing personality offering a personal warm welcome to the Argonaut service. Check-in was a breeze, no problem whatsoever with the early time, and staff was ready to help with questions about the area, recommendations for food, and even an unrequested weather forecast. The staff has some unique uniforms - which adds to the servicescape. Some shirts reminded some of us of the \"puffy\" shirt episode from Seinfeld - which the staff took in stride with playful yet respectful sarcasm.", "title": "Great Hotel!", "helpfulness": 9, "user": "Mayarimom", "date": "January 7, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6563666}, {"rating": 4.0, "stay_parameters": "Stayed November 2006, traveled with family", "text": "I travel quite a bit for work, and I've not yet had such a welcome at a property. From start to finish, the staff is a real gem. And, that's the highlight even before you get to see your room. I was a little worried about size - we had a group of 4. No worries. Rooms were fantastic - historic yet completely comfortable. Check out the pictures - you can see the style of the rooms. The pictures (in my opinion) made the rooms look smaller than in real life. And, what some feared might be overbearing in decor was actually quite warm and classy. Beds were amazing, and we had a window view of Ghiradelli Square. Couldn't have asked for more.", "title": "Above average hotel", "helpfulness": 4, "user": "jjjnnn", "date": "January 7, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 3.0, "rooms": 4.0}, "id": 6561448, "likes": {"liked": "— functional and clean. very helpful check in staff", "disliked": "— location Fishermans wharf is tacky"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "While some properties are closer to Pier 39, Wharf and Cruise Terminal - skip the average properties and head here. Walking the area was easy and streetcars right adjacent to the property. Reasonably priced and close enough to everything, with spectacular service and impressive rooms. I didn't pass one staff member who didn't smile and offer a warm 'hello.'", "title": "Great hotel, huge room", "helpfulness": 7, "user": "DixieToronto", "date": "December 30, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6520127, "likes": {"liked": "— Lovely staff, clean rooms", "disliked": "— None"}}, {"rating": 4.0, "title": "A smart hotel in a very handy location", "text": "This is my first Kimpton experience. It won't be my last. While I'm sure every hotel and staff are somewhat different, the impression was strong enough to have me checking for the Kimpton name wherever I go next. Hope they can keep the smiles and match this level of service - somehow, I think they will.", "helpfulness": 4, "user": "Creekville", "date": "December 29, 2006", "id": 6517652}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled with family", "text": "The Argonaut at Fisherman's Wharf in San Francisco is the nicest hotel we have stayed in...not the most expensive or most fancy, but the whole experience was five star!", "title": "Outstanding room, view, service & location!", "helpfulness": 5, "user": "sabrinaswc", "date": "December 29, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6517235, "likes": {"liked": "— Location & comfort", "disliked": "— nothing!"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "The rooms had great beds and bedding, were quiet, had Nintendo for the kids plus high speed internet, coffee and a refrigerator.", "title": "Lovely place to stay", "helpfulness": 10, "user": "domandbecky", "date": "December 22, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6482084, "likes": {"liked": "— The service, the rooms, feeling like royalty", "disliked": "— Ok well the prices were very high!!!"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled solo", "text": "The staff from the Doorman who greeted us upon arrival to the Valet who watched over our car at the curb for two hours was exceptional.", "title": "Brilliant Customer Service", "helpfulness": 8, "user": "Crazy-Gracie", "date": "December 19, 2006", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 6473425, "likes": {"liked": "— Customer Service, location, comfort", "disliked": "— None I can think of"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled with family", "text": "The lobby had a lovely fireplace and complimentary wine in the evening.", "title": "This one's a keeper!", "helpfulness": 8, "user": "basquegal", "date": "December 15, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6442058}, {"rating": 4.0, "stay_parameters": "Stayed November 2006, traveled with family", "text": "The price and the location were unbeatable - highly recommend this one to ANYONE going to San Francisco!", "title": "Beautiful Hotel", "helpfulness": 4, "user": "abcxyz38", "date": "December 1, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "business": 5.0, "cleanliness": 5.0, "rooms": 4.0, "location": 4.0}, "id": 6314609, "likes": {"liked": "— Lobby was beautiful", "disliked": "— isolation at night"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled solo", "text": "Very comfortable. Not quite as funky as other Kimpton's I've stayed in, but not a Ramada either. Smack in the middle of major tourist area. Get an interior room for quiet. Very comfortable bed. Wine reception from 5-6 like other Kimpton's. Helpful staff and concierge. Right next to aquatic park and Ghiradelli square.", "title": "comfortable Kimpton hotel", "helpfulness": 3, "user": "erdocmdca", "date": "November 3, 2006", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 6053796, "likes": {"liked": "— comfortable and quiet", "disliked": "— clunky air conditioner"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled with family", "text": "Always use Trip Advisor to check out Hotels so I thought its only fair to contribute to the system too.", "title": "Loved Loved Loved the Argonaut", "helpfulness": 16, "user": "PamLudlow", "date": "October 31, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6034115, "likes": {"liked": "— Location - close to amenities but quiet location; Friendly staff", "disliked": "— Nothing!"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "We (husband, 10yr old son and myself) stayed at the Argonaut 16 - 21 October 2006. As we couldn't find the accommodation dates we wanted on any internet searches we booked direct with the Hotel - very efficient and got what we wanted - King room with bay view (Golden Gate) and sofa bed. On arriving we were allocated exactly what we booked.", "title": "Honeymoon at Argonaut", "helpfulness": 3, "user": "BadgerAlumn", "date": "October 30, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 6030693, "likes": {"liked": "— Location, cleanliness of rooms", "disliked": "— Room service, dry cleaning"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled with family", "text": "The room was spacious, clean and lovely - nautical theme does work. The views from the room were lovely (see pics) over the bay to the GG bridge and the cable car turnaround - its close but was not noisy. My husband who is a bit of a twitcher was delighted to see humming birds on the bushes in the park opposite out of the bedroom window.", "title": "Loved this hotel", "helpfulness": 10, "user": "clgamm", "date": "October 30, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 6030087, "likes": {"liked": "— Rooms, location", "disliked": "— Some noise in some rooms"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled with family", "text": "The Hotel is ideally suited - its styled as being in Fishermans Wharf but it is at the quiet end and right next to Memorial Park which was lovely to sit in and look over the bay - even a tiny bit of beach. Pier 39 is walkable even for me with a crocked knee!", "title": "Great experience in a fab location!", "helpfulness": 1, "user": "mrsz", "date": "October 28, 2006", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 6022590, "likes": {"liked": "— location", "disliked": "— no pool"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "My husband & I stayed here for 4 nights, its a great location and unique design...the nautical theme is fantastic! despite being allocated the wrong room type on arrival (we made our booking months in advance!) we were upgraded for the first night, then moved to the booked room type for the remainder of our trip. The King Deluxe Bay View rooms are great; we had a fab view of Alcatraz...worth the extra cost!", "title": "unique hotel, great location", "helpfulness": 1, "user": "gracat", "date": "October 10, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 82844192}, {"rating": 5.0, "title": "A wonderful place to stay!", "text": "One thing to mention is that you can hear folk in the other rooms / corridor, its not too loud but you hear it... on our first night we were woken at 5.30am by a couple going at it....we thought the bed was going to fall through the floor or break the wall at one point! it was that loud / crazy - not a great way to get woken up....round two started couple of hours later! thankfully they checked out that day...we checked with reception!", "helpfulness": 1, "user": "OldBruns", "date": "October 9, 2010", "id": 82795329}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled on business", "text": "breakfast was included in our rate; and for that you got a cup of coffee and a glass of juice, croissant, danish or toast and a bowl of mixed fresh fruit. this was adequate for us but if you like to eat more in the morning you can pay an additional (reduced) price for other breakfast items, e.g. bacon, eggs etc.", "title": "Great boutique hotel in tourist area of San Francisco", "user": "SF94597", "date": "October 9, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 82731206}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "the chowder in the restaurant is superb, we'd recommend you try the Crab & Corn Chowder - its award winning; and once you taste it you'll see why!", "title": "once again, a gem !", "user": "fizzengland", "date": "October 9, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 82721000}, {"rating": 2.0, "stay_parameters": "Stayed September 2010, traveled on business", "text": "there is a pc at reception, which is handy for checking-in/printing boarding passes; they limit your use to 5-10mins ish; which is fair enough; and after all you're on holiday so don't need to be on the internet for hours....when you can be out exploring the area!", "title": "Lots of money, relatively little value", "user": "Inaarlene", "date": "October 8, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 1.0, "sleep": 2.0, "rooms": 3.0, "location": 5.0}, "id": 82667946}, {"rating": 4.0, "title": "Unique Hotel", "text": "Unique hotel and definitely a must if that is what you are looking for. My fiance and I stayed at the Argonaut last week and with the exception of a couple of minor kinks, I would give it two thumbs up. I was lucky in that I read some reviews to prepare me but was still very pleased! First of all, they have a great little happy hour from 5-6 pm in the lobby with free wine and beer. It's also in a great neighborhood (Fisherman's wharf), very touristy, but when in Rome, you should probably be a tourist for the day. The breakfast at the Blue Mermaid (hotel restaurant) was really good. The hotel staff was pleasant and helpful. The room was very unique as is the hotel (as you can see from other reviewers pics) and that was what I was looking for. My main complaint was the bed wasn't as comfortable as many other high end hotels (it crowned a little in the middle and was kind of soft). Another minor kink, that could and should be easily fixed by the hotel property, is that the shower curtains don't have magnets to hold them down to the tub, so don't be surprised if you find the curtain clinging to you as you are showering. Beyond that, I still found this a fabulous place to stay, and it also happens to be two blocks from one of the most amazing restaurants I have ever been to in the world.....Gary Danko's (and I am a foodie ;-). Be sure to make reservations there weeks in advance though.", "helpfulness": 3, "user": "Chicago60614", "date": "November 26, 2007", "id": 11075482}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "This is such an histric and beautiful hotel!!!!!! We stayed one night but it was wonderful. There is a nightly manager's reception in the lobby - very nice and a great way to meet other guests.", "title": "Oh my goodness!!!!", "helpfulness": 4, "user": "lovestotravel101", "date": "November 25, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 11052624}, {"rating": 2.0, "stay_parameters": "Stayed November 2007, traveled on business", "text": "We had a city view room and it was wonderful. We could see many of the", "title": "Lousy Walls, Lousy Internet, Lousy Room Service", "helpfulness": 2, "user": "drbobak", "date": "November 19, 2007", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 2.0, "cleanliness": 4.0, "value": 2.0, "location": 4.0, "rooms": 2.0}, "id": 10914563, "likes": {"liked": "— Decor was cute", "disliked": "— Thin wall, slow internet, slow room servie"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "landmarks in the city. Fisherman's Wharf and Ghirdalli Square are a 2 minute walk from the hotel (in opposite directions) so it was a busy area. There is no shortage of restaurants and places to eat. The hotel", "title": "Fantastic Hotel in Fisherman's Wharf", "user": "PhilGab", "date": "November 18, 2007", "detail_rating": {"cleanliness": 5.0, "front_desk": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 10898066}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled with family", "text": "is the old Del Monte Cannery building - very nice. Exposed brick and beams. The rooms are decorated in a nautical theme.", "title": "Location location location", "helpfulness": 1, "user": "ballybeg", "date": "November 6, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 10655904, "likes": {"liked": "— Location and helpfulness of staff", "disliked": "— Our original room allocated was right above cafes-too noisy so we asked for another room"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2004", "text": "There's a very good reason this place is at the top of this list - it is absolutely magnificent.", "title": "Magnificent", "helpfulness": 1, "user": "LucyKate", "date": "January 6, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 2981976}, {"rating": 5.0, "stay_parameters": "Stayed November 2004", "text": "Superb location - right across the road from the wharves, right next to the Cable Car, views of the Bridge, but it's what they have done with this location that makes it superb.", "title": "Great hotel!", "helpfulness": 2, "user": "Wendy Low", "date": "January 5, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 4.0}, "id": 2977955}, {"rating": 4.0, "title": "Thoroughly enjoyable", "text": "The hotel is in a restored warehouse, and the attention to detail throughout is wonderful with exposed beams and bricks making this a standout building. The rooms are magnificently decorated in a nautical theme, the lobby is very well done, and front desk staff, porters, doormen, everyone, extremely helpful and knowledgeable about the city and its surrounds.", "helpfulness": 3, "user": "Padong", "date": "January 4, 2005", "id": 2974522}, {"rating": 3.0, "title": "Nice Hotel, poor food", "text": "The wine reception was a nice touch, as were the two free internet terminals in the lobby area, and the attached Blue Mermaid restaurant on site was so good we ate there three nights in a row.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "January 1, 2005", "id": 2968864}, {"rating": 5.0, "title": "Better than great", "text": "For cheap breakfasts there's also a Starbucks out back.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "December 12, 2004", "id": 2877163}, {"rating": 3.0, "stay_parameters": "Stayed February 2006", "text": "Great location close and/or easily accessible to fun activities in San Franciso. Directly across the street from the cable cars with easy access to downtown and Chinatown. Within walking distance to Ghiradelli Square, Fisherman's Wharf and Pier 39. Much safer than hotels located in Union Square area. Hotel decor was beautiful, similar to being on a cruise ship, with great wine gathering each evening at 5 p.m. Rooms were small and narrow. Rooms on the interior face other rooms, with no view. Rooms on the exterior face bay, cannery or park. Cannery side is noisy during the day and evening, even on the higher levels. Fourth floor rooms do not have old wood decor like other levels. Most of the staff is very friendly, however, some have an attitude that borders on arrogance. Overall a nice hotel, but I would hesitate to pay the higher price for the Cannery or Park View rooms versus the interior rooms.", "title": "Nice Hotel, Great Location", "helpfulness": 4, "user": "Olliebuba", "date": "March 2, 2006", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "service": 2.0}, "id": 4570155}, {"rating": 4.0, "stay_parameters": "Stayed February 2006", "text": "We stayed Feb 22-25 as part of our 20th anniversary to San Francisco & Sonoma. The Argonaut was a perfect location for exploring the city and the staff (with 1 exception) was excellent and very helpful. Our room had a view of the ocean & Alcatraz, was clean, spacious and all was as described and as expected. The only problem was on the 1st day when I went to check with the concierge (lady; L...) to see what was happening with the local music scene, where to go etc. for live music......she reached under her desk, tossed a newspaper to me and said to check it out myself. Wasn't expecting *that* response!! I went down the next morning and there was someone else there who gave the expected assistance and comments. She asked the right questions, gave the right answers, tried booking an event (which was unfortunately sold out) and did all this on her own initiative. What a difference from her grumpy colleague!!", "title": "Great hotel........lousy concierge!!", "helpfulness": 10, "user": "kelownatraveller", "date": "March 1, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 2.0}, "id": 4565620}, {"rating": 5.0, "title": "Loved it!", "text": "Did manage to find some great acts at the Boom Boom Room & Lou's Blues so had a great time at those.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "February 28, 2006", "id": 4565029}, {"rating": 5.0, "stay_parameters": "Stayed February 2006", "text": "Cable cars are a few steps away, the Fisherman's Wharf strip is right there, and the city is easy to navigate. All in all a great time at a great hotel.", "title": "The Best Hotel. I hope they don't raise the rates!", "helpfulness": 3, "user": "KC_FLA", "date": "February 25, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4520221}, {"rating": 4.0, "stay_parameters": "Stayed December 2007", "text": "Fine hotel but beware of the $40 per night parking charge", "title": "Parking fine print", "helpfulness": 2, "user": "blacksmithLosAngeles", "date": "December 31, 2007", "detail_rating": {"value": 2.0}, "id": 12174136}, {"rating": 5.0, "title": "I love it here!", "text": "We always love this hotel! However, we can only afford to stay here when it is off season. The prices can range from under $200 all the way up to around $500 depending on the season.", "helpfulness": 4, "user": "AmyMitchell", "date": "December 28, 2007", "id": 12002263}, {"rating": 4.0, "title": "Good Choice for Fisherman's Wharf", "text": "I love the cruise ship look of this hotel and the location. This is in Fisherman's Wharf, but on the quieter side which is a particulary good location for tourists or those on business. It is also surprisingly dog friendly, which you wouldn't expect.", "helpfulness": 4, "user": "sf1943", "date": "December 24, 2007", "id": 11934347}, {"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "This hotel is spotless. The rooms are the cleanest I have ever seen and I have very high standards. They have a lovely free wine hour and a well-stocked mini-bar.", "title": "Lovely hotel with quirky rooms", "helpfulness": 1, "user": "Gemma1977", "date": "December 20, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 11713433, "likes": {"liked": "— Position", "disliked": "— Paying for car parking"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "My only complaint would be that much of the staff seems overly agressive in expecting tips (so bring plenty of dollars to avoid discomfort) and the front desk staff seemed a bit snooty. This was a surprise to us as normally Kimpton hotels have an over the top friendly staff. My guess is that this was a fluke.", "title": "A really great hotel", "helpfulness": 1, "user": "Lrothfl", "date": "December 18, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 11653868}, {"rating": 4.0, "stay_parameters": "Stayed October 2010", "text": "I spent 5 nights at the Argonaunt with my daughter. The reason we choose this hotel was because the rooms looked very different from the norm that you find in the USA. We weren't disappointed. The nautical theme and the rooms was exactly as shown in the pictures. The wine reception every evening was very good and the wine was a very good standard. Breakfast was included which was continental style with plenty of juice, coffee etc.", "title": "Just as the brochure described", "user": "S.S.S.M.L.A", "date": "October 25, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 84737224}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "We chose this location as being two females travelling alone we thought it would be a good area to enable us to get out in the evening without having to walk down too many back streets.", "title": "Excellent Argonaut, Perfect Location.", "user": "Graham K", "date": "October 22, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 84413671}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "The staff were excellent, very helpful, pleasant and friendly. Would certainly recommend this hotel if you want to stay near Fishermans Wharf. Just around the corner is the cable car and about 5 mins walk is Pier 39 - not to be missed! Also a very convenient place to visit Alcatraz and to join the tours. Staying here made our trip much easer as if you plan to stay near Union Square you do have get either the cable car or taxi to enjoy the bay area.", "title": "Nice Place", "user": "RWeaver54", "date": "October 20, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 84218121}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "On the third leg of our USA trip, my wife and I booked in at the Argonaut Hotel, Fisherman's Wharf for 3 nights 18th - 21st September 2010. Having experienced the heat in Las Vegas the first thing we did was buy a fleece each, although still warm, high 70's we felt the cold breeze from the sea. Our room was quite cluastrophobic, one small window at the end of the room facing out towards the Golden Gate Bridge. Maybe because we had been used to large 5 star rooms on this trip that we had come back down to earth, although having said that, the room was comfortable with 2 large queen beds, coffee making facilities (in the bathroom?) flat screen t.v., fridge, comfortable easy chair, desk and chair. I noted the complaints on previous reviews before we travelled regarding the noise from other rooms, but this wasn't our experience.", "title": "LOVED IT!!!", "user": "TANJAMIO", "date": "October 19, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 84124750}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "On opening our cases we discovered a bottle of sun lotion had burst and marked some of our clothes. The reception staff were very helpful in advising us re laundry facilities.", "title": "excellant hotel", "user": "Mar46_10", "date": "October 18, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 83990254}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "I took my husband to San Francisco on a surprise trip for Christmas. This hotel was absolutely amazing. The service was super and so was the quality for the price. The location is great if you are hoping to do many of the \"tourist\" activities like pier 39, alcatraz, ghiradelli square, and cable cars. I would definately stay here again!", "title": "Great piece of history and a great location!", "helpfulness": 3, "user": "ayeyii", "date": "January 6, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 12387721, "likes": {"liked": "— great theme and cleanliness", "disliked": "— n/a"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "My husband and I stayed at this hotel after travelling from Chicago on the Amtrak train. The spacious and comfortable rooms were amazing after the confined space we had on the train. We found the staff to be very helpful and the hotel was a great base as it was so near the streetcar terminus. We also used the bike hire shop nearby and biked over the Golden Gate bridge - what a wonderful experience.We enjoyed the food at the hotel dining room and sat in the lounge with a glass of wine relaxing one night watching the world go by. We would both highly recommend this hotel.", "title": "very stylish hotel", "helpfulness": 3, "user": "carrotsarered", "date": "January 5, 2008", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 12357335, "likes": {"liked": "— comfortable rooms", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "the +++", "title": "Pacific Spirit", "helpfulness": 2, "user": "FrenchTrotteuse", "date": "January 4, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 2.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 12316519, "likes": {"liked": "— Nice Lobby, nice room, perfect location, cocktail offered to guests", "disliked": "— view, minor issues with room service"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled with family", "text": "Location @ Fisherman wharf if perfect to discover the city, and the animated & marine atmospher is great.", "title": "The Argonaut is THE only place to stay", "helpfulness": 4, "user": "3SanFranLovers", "date": "January 2, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 12274631, "likes": {"liked": "— the staff and the location", "disliked": "— n/a"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled with friends", "text": "The hotel is beautiful. The lobby is great and everyday a cocktail is offered to guests near the huge fireplace.", "title": "Great Break", "helpfulness": 4, "user": "jjc666", "date": "January 1, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 12194768, "likes": {"liked": "— location", "disliked": "— nothing"}}], "location": {"country": "United States", "city": "San Francisco"}, "stars": 4, "variance": {"poor": 76, "average": 193, "very good": 807, "terrible": 40, "excellent": 1981}, "aka": "Kimpton San Francisco", "slim_ranking": 0.0297872340426, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "Located in the heart of Fisherman's Wharf, San Francisco's most popular destination, the boutique Argonaut Hotel features breathtaking views of the Golden Gate Bridge and Alcatraz Island. This luxury hotel, a Kimpton Hotel, is historically set in a former timber and brick warehouse across from the waterfront. With its exceptional service, its charming style and the adjacent family-friendly Blue Mermaid Chowder House, the Argonaut Hotel is an ideal spot to enjoy San Francisco."}