{"user_rating": 5.0, "review_count": 427, "name": "Aris Caves", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "We spent 5 days at Aris Caves in Santorini at the beginning of May. We selected the Caves after reading the reviews on Trip Advisor. They did not dissapoint. Christa is a wonderful hoist and always available to her guests. The Caves are expremely comfortable with a terrace with magical views. The town of Oia is just a gem. May was an excellent time to be in Satorini, warm but not to many tourists.", "title": "Fabulous", "user": "Upland99", "date": "May 27, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 65532384}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "Our stay at Aris Caves was one of the best experiences we have had, we look forward to returning sometime.", "title": "Best Stay at Santorini", "user": "Overseasingaporean", "date": "May 6, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 63442712}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "Thank you Christa for the early warning regarding the Strike situation in Greece, otherwise we would have been back home later. Christa had been very helpful during this situation.", "title": "The Place To Stay In Santorini", "helpfulness": 2, "user": "Indynmarion", "date": "March 28, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 59755274}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "Excellent stay at the honeymoon suite, excellent view, clean etc.. I had stayed 7 nights over in Santorini(with 2 addtional nights due to Strike situation), Aris Caves was definitely the best accomodation in 3 different hotels/b&b we stayed.", "title": "Perfect Location, Incredible Views, Amazing Hosts - Best Vacation Ever", "helpfulness": 9, "user": "cali1682", "date": "February 24, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 57011162}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "However, one thing to improve is the wireless internet which signal was too weak inside the room. And Aspa, which my wife was a bit afraid of as he was too active.", "title": "Memorable Stay", "user": "AB121212", "date": "December 28, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 52010243}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "Stayed in Aris Caves based on the reviews and cant say I was dissapointed at all. The location is excellent...the views are great...the rooms are nice and cosy... Christa lives upto all the good reviews...she gave us lots of great tips about where to eat traditional greek food and what to see.. because we reached very early and the other guest hadnt cheked out Christa even found us a room with her friend next door where me and my wife could take a nap, since we had been sitting at the athens airport the entire night before...that was really special!", "title": "Good Choice", "user": "dasgupta", "date": "October 15, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 3.0, "rooms": 5.0}, "id": 46936457}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "The value is somewhat debateable since €130 close to the end of season just for the room (no breakfast) felt somewhat of a luxury. I did have a small argument with Christa on an booking cancellation related issue in a different hotel for an additional night and she did not hesitate to tell me I was wrong, although I am still sure that I was right, but she took care of things finally.", "title": "Heaven on earth...", "helpfulness": 1, "user": "slempjohnson", "date": "September 28, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 45339543}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "Just a word of caution, dont choose this hotel, if you cant do steps...it is definitely climb down to get to your room...esepcially if you have any luggage at all...and the steps are quite uneven so you have to be careful always.", "title": "Up Close & Personal", "helpfulness": 2, "user": "shiny_ainie", "date": "August 31, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 39392204}, {"rating": 5.0, "stay_parameters": "Stayed August 2009", "text": "We basically built our entire Greece trip around the fact that we knew we were staying at Aris Caves. After much research, I believed it to be exactly what we were looking for. I could not have been more right! Aris and Christa were fabulous hosts and friends. Their door was always open to us (usually literally!). The room itself (we stayed in \"Folia\" or \"nest\") was traditional and incredibly charming. Due to the location of the caves, it would have been difficult for it to feel more private, or for the views to be any more fantastical. If you want a place that feels very personal, simple - but comfortable, NO televisions. This is the place! Be very aware of the 130 or so steps down to the rooms. It is certainly a factor. We actually loved that about the place. Can't wait to return.", "title": "Beautiful Location; Amazing Views", "helpfulness": 3, "user": "travelchicusa", "date": "August 18, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 38076332}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "Christa has been so helpful even before my stay in Aris Caves. She replies to my many questions/concerns that i have prior to my trip and not to mention her tips during our stay.", "title": "The perfect 3 days in Oia", "helpfulness": 2, "user": "kjwardakee", "date": "August 18, 2009", "detail_rating": {"cleanliness": 5.0, "location": 5.0, "value": 4.0, "rooms": 5.0}, "id": 38062872}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "Traveled to Greece for an extended vacation in June/July of 2009. Spent a few days in Athens on the way out and back and 15 wonderful days in Oia at Aris Caves. It was our first time in Greece and while we knew going in that 15 days was a lot for such a small island - that was one of the reasons we wanted to do it. We did want to try to engage more with the locals and really take time to enjoy the surroundings. And we did.", "title": "Shocking value + personal/attentive service + fantastic location = Great vacation.", "helpfulness": 7, "user": "4RealBeach", "date": "August 11, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 37388587}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "Aris and Crista do a fantastic job with their \"caves\". It is also their home as well, so that tells you something about the location and surroundings. There were times that we felt bad as guests tend to go to them for everything... but every time they would happily chat away discussing what places to visit, what restaurants to eat at, and what tours to take (and when to take them). It is like living with a Santorini Guidebook. Same thing with us.", "title": "A Stay Worthy of Six Stars", "helpfulness": 3, "user": "Dacamic", "date": "August 10, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 37266382}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "We were in #3 (fournos). The furnishings are traditional (a nice way of saying a bit old) but the only furnishings that matter are the bed (comfortable) and the kitchen (fridge works, hotplate works, coffee maker works) - and both were great. The shower/bathroom is roomy and although unique at first, by the time I left I was convinced I wanted a cave shower in my house someday, too. The lofted bed area does cause you to duck a bit... but if you are doing a whole lot of walking around up there, I don't have a lot to offer you anyways. The area below the loft has two comfortable twin beds and a small closet. It was just the two of us, so this became one big walk-in closet for the 2 weeks.", "title": "Like a fairytale setting", "helpfulness": 6, "user": "pgolden", "date": "July 22, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 35507709}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "The key is the patio area. You have a small private one attached to your unit - which is nice for eating or having a cocktail before braving the stairs (the actual number is 94 up from #3... but you get used to it... sort of...). The larger public patio is much larger and has great seating places. \"Public\" is an odd word to use. The place is small enough that it was rare to have more than a couple people milling around at any one time.", "title": "Amazing place. Greta Service.", "helpfulness": 4, "user": "chesthair_utopia", "date": "July 19, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 35182802}, {"rating": 5.0, "title": "I will be dreaming of Aris Caves for the rest of my days", "text": "The wired internet was a nice touch... and it worked fine. The whole placed was cleaned daily - and I mean cleaned - by a fantastic couple. If you left early, it was cleaned when you got back. if you didn't leave until you snuck away for an afternoon bite, it was magically cleaned when you returned. Want someone to pick you up some fresh baked goods and are too lazy to get up in the morning and brave the stairs? You can probably talk someone into that, too.", "helpfulness": 9, "user": "gretchenenders", "date": "June 30, 2009", "id": 33609439}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "Aris Caves in Oia is the place--- and the owners, Aris and Christa are wonderful hosts who treated us like family. The rooms are stylishly decorated, spacious and comfortable and the view is breathtaking. We particularly liked the kitchens, where we prepared our breakfasts and kept our wonderful Santorini wine. (don't pass up Vinsanto). We had a schedule change with our return air which really caused us problems but Christa took care of it all and was able to rebook us on another carrier. I can understand why people love this place! Beware that some travel agents will steer you away from Aris Caves. We believe that it is because booking is done directly which may effect the agent's commission but it keeps the rates very competitive.", "title": "Exceeded my high expectations!", "helpfulness": 2, "user": "Rassaslaw", "date": "November 15, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 49224287}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "Aris caves is a good hotel if you dont want to spead a lot of money for an amazing view.", "title": "Good value for money", "user": "miriambilbao", "date": "November 12, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 49026017}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "As we found Santorini and espesially hotels with caldera view too much expensive this hotel is good value for money.Rooms are not cosy but are simple and clean.", "title": "Relaxed, cosy, and friendly.", "helpfulness": 1, "user": "Rodimusnz", "date": "November 10, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 48929207}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "I spent a number of months planning our trip to Greece. I found this little gem through trip advisor, and had wonderful contact with Christa throughout the booking process. Christa answered all my questions promptly. My wife and I found it to be a charming property with a real community feel. We got to know most of the other couples staying there, going on meals and tours with them. Great views from all of the rooms, and a fantastic view from the main patio. Yes there are stairs up and down from the cave apartments to the main walkway, so pack a good pair of shoes and bring easy to carry luggage (porters are available). I noted from previous reviews that stairs were found to be a negative, well..... welcome to Santorini. The rooms were clean with all the basic ammenities you'd need. We stayed in \"the corner\" apartment, it had a great little kitchenette, though found oursleves eating out locally most nights. Stayed for four nights, which was our only mistake, should have booked a longer stay. It is a great place to relax and watch the world go by. I found the bonus to be no TV's, though there is wireless service. Note, book early it fills up fast.", "title": "Great and friendly stay!", "user": "fsms", "date": "November 5, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 48566198}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "All the great reviews about the hotel were absolutely right! The room was really comfortable, with a stunning view of the sea. Lovely kitchenette with all the appliances needed! It is very romantic to cook a delicious meal and have you dinner under the stars and gazing out the sea!", "title": "Beautiful View and Great Service", "user": "pmoynahan", "date": "October 18, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 47187198}], "location": {"country": "Greece", "continent": "Europe"}, "stars": 4, "variance": {"poor": 3, "average": 3, "very good": 24, "terrible": 2, "excellent": 395}, "aka": "Aris Caves Oia", "slim_ranking": 0.0666666666667, "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.5, "rooms": 5.0, "location": 5.0}, "description": "Literally, like an eagle’s nest hanging in the cliff of the island, Aris Caves is located only a few minutes down from the center of the lovely village of Oia. Yet the placing of the houses is configured like an amphitheatre, tranquil and ideal to relax, to dream and to enjoy the breathtaking view over the Santorini Caldera, the volcano Nea Kameni and the deep blue Aegean Sea.Spread over 4 levels are 6 self-catering, fully equipped and separate studios, apartments and a suite, each with kitchenette, shower/toilet, air conditioning, internet and its own terrace. The large terrace in the center and the sun terrace at the bottom of Aris Caves are open to all guests and offer probably one of the best views in Oia."}