{"user_rating": 4.0, "review_count": 1724, "name": "Arizona Biltmore, A Waldorf Astoria Resort", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "What a stunning property! I may be biased being an architect but it was certainly a thrill staying in a hotel Frank Lloyd Wright had a hand in.", "title": "Wanted to stay longer!", "helpfulness": 3, "user": "Whinbrook", "date": "October 1, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5896761, "likes": {"liked": "— Everything", "disliked": "— Nothing"}}, {"rating": 2.0, "stay_parameters": "Stayed September 2006, traveled on business", "text": "Everything lived up to expectations from the excellent and faultless check-in (helpful, gracious and willing staff) to the delightful, probably recently refurbished room we had in the Paradise Wing. It was very tastefully designed with some good period touches to keep the history and atmosphere alive. The bathroom was totally state of the art with a massive drencher shower head in the shower and quality toilteries from the Bitlmore Spa. The other public areas of the hotel were also beautifully designed and kept and the spirit of the original design was totally intact.", "title": "At best: OK", "helpfulness": 4, "user": "rzngro", "date": "September 29, 2006", "detail_rating": {"front_desk": 1.0, "business": 3.0, "service": 2.0, "cleanliness": 5.0, "value": 2.0, "location": 4.0, "rooms": 4.0}, "id": 5892677, "likes": {"liked": "— Location & food", "disliked": "— The quality of the service"}}, {"rating": 3.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "We over looked the Paradise pool which was close to being just that! There was no noise, just a refined atmosphere - maybe the time of year?", "title": "The Phoenician is way better", "helpfulness": 4, "user": "STABEVRAY", "date": "September 15, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "rooms": 5.0, "location": 3.0}, "id": 5804247}, {"rating": 2.0, "stay_parameters": "Stayed September 2005", "text": "We dined in Wrights which had recently reopened after being smartly refurbished. This was a little disappointing in that the service was slow (but friendly and with a certain charm). The food was actually very good - went it arrived and at the correct temperature. My main course was tepid and was sent back. Must have caused a stir because not only did I get a fresh dish at the right temperature, but it was on the house as were any deserts of our choice. So in the end it turned out fine and they did go out of there way to rectify this shortcoming - could have been a different story.", "title": "Disappointing", "helpfulness": 4, "user": "My_Visit", "date": "September 9, 2006", "detail_rating": {"value": 1.0}, "id": 5783930}, {"rating": 3.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "We also did valet parking which was going to be more convenient than self parking and it was and with excellent service. The outstanding reception staff also checked us in on line and printed our bording passes for our flight home the next day.", "title": "nice hotel", "helpfulness": 3, "user": "aleponti", "date": "September 6, 2006", "detail_rating": {"front_desk": 5.0, "business": 1.0, "service": 4.0, "cleanliness": 2.0, "value": 3.0, "location": 3.0, "rooms": 4.0}, "id": 5775319, "likes": {"liked": "— the pool", "disliked": "— it was dirty"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled on business", "text": "Attended a 4-day conference here at the end of November. Gorgeous grounds, wonderful conference halls, very good conference food catered by the Biltmore, and a spectacular room! Have seen comments here that the rooms seem quite outdated so perhaps I was lucky, but my room was very up-to-date, very large (with a very nice, and very large, bathroom--separate tub and shower), and had a full balcony (third floor) with a beautiful view of the Biltmore grounds (and absolutely lovely view of the fall Arizona sunsets). None of my conference companions had any complaints about their rooms either (although none of them had as big of a room with a full balcony). Huge LCD TV with a large number of channels, including 2 HD channels (HBO and Showtime if I remember correctly), very comfortable bed. My only complaint about the resort is the exorbitant cost of eating there---even breakfast is outlandishly priced---and the main dining room, ridiculous. And the Resort is not really near any other places to eat (although, during the day, there is a free shuttle to a shopping mall with several semi-decent, not fancy places to eat---think the shuttle goes until 6 p.m.). But really, had one of the most relaxing times in a very long time and at one of the most beautiful venues I've ever stayed at. And the staff was very good and very competent----based on other reviews, that is apparently not always the case.", "title": "Spectacularly at Peace at Arizona Biltmore", "user": "Quizzler", "date": "January 3, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 12302343, "likes": {"liked": "— My excellent room with full balcony", "disliked": "— The very, very expensive eating options---no reasonably-priced places to eat"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "We stayed at this hotel for two nights. This is very much a conference hotel, but we found it was fine for tourists as well.", "title": "Wish we could have stayed longer", "user": "GranolaGal", "date": "December 15, 2007", "detail_rating": {"front_desk": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 11577554, "likes": {"liked": "— landscaping, our balcony and view, drinks on the terrace", "disliked": "— Closet is in the bathroom"}}, {"rating": 4.0, "title": "Historic and Pleasant", "text": "The Frank Lloyd Wright inspired cast block lobby and buildings are very formal and monolithic compared to some places we've stayed, and the interior spaces are a little darker than some hotels. But it's comfortable and relaxing.", "user": "Dan_S_NYC", "date": "October 28, 2007", "id": 10396177}, {"rating": 3.0, "stay_parameters": "Stayed October 2007", "text": "We found the staff here to be friendly.", "title": "A resort, get your wallet", "user": "roadwarrior30", "date": "October 18, 2007", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 3.0, "rooms": 3.0}, "id": 10113796}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled on business", "text": "The gardens, fountains, pools and landscaping are georgous. The hotel terrace in the late afternoon has a fabulous view of the mountains and is a marvelous place to sink into the comfy rattan chairs and have a drink - they light the fire pits when it gets cool out. The prices are a bit on the high side but the ambience is worth it.", "title": "Special Place in Phoenix", "user": "Marmont", "date": "October 10, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 10064560, "likes": {"liked": "— Superb pools.", "disliked": "— Need a car to get out of the resort or take the hotel transport."}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled with friends", "text": "This is a charming historic property with all the modern amenities. The rooms are quite spacious. The dining selections are wonderful with excellent service. Charming gardens surround the buildings and include a croquet lawn and large lawn-chess set. The hotel has an interesting history, of which they are very proud. The setting has a resort feel but is only minutes from many fine dining and shopping options.", "title": "Charming", "user": "zanderc", "date": "October 5, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 10044369, "likes": {"liked": "— very large", "disliked": "— lighting could be better"}}, {"rating": 3.0, "title": "Nice hotel with average rooms", "text": "The hotel grounds are excellent but I was disappointed by the quality of the rooms. Although the room was large, it had little or no ambience and was in a wing of a hotel that seemed to be built as a significant afterthought in an effort to create more space to generate more rooms for conferences held nearby. Generally not impressed for a hotel of this calibre/price range.", "user": "traavel74", "date": "September 19, 2007", "id": 8824462}, {"rating": 1.0, "stay_parameters": "Stayed September 2007, traveled on business", "text": "This hotel is overprice!!!", "title": "Horrible place", "user": "mmvvl", "date": "September 17, 2007", "detail_rating": {"front_desk": 1.0, "business": 3.0, "service": 1.0, "cleanliness": 4.0, "value": 1.0, "location": 5.0, "rooms": 2.0}, "id": 8737738, "likes": {"liked": "— nothing", "disliked": "— everything"}}, {"rating": 3.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "To be honest is not worth spending the money. the food and all the is overprice and is not good. There is no coffee pot, the water cost 5 dollars for a little bottle. A glass of milk is 4 dollars. the staff is very rude and they don't know anything. the rooms are very small with no views. the pools are always closed when you want to go, or there is no towels.", "title": "Okay for a very SHORT stay only", "user": "MollyMick", "date": "August 23, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "business": 4.0, "cleanliness": 4.0, "rooms": 2.0, "location": 4.0}, "id": 8485219, "likes": {"liked": "— Beautiful grounds and architecture", "disliked": "— Very average room, getting charged for every little thing"}}, {"rating": 1.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "The only people who are helpful are the hispanics that work there.", "title": "Don't Stay Here- Too Many Mosquitos", "user": "JohnG412112", "date": "August 15, 2007", "detail_rating": {"value": 1.0}, "id": 8431985, "likes": {"liked": "— checking out to Hotel Valley Ho", "disliked": "— The Mosquitos will eat you alive"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled on business", "text": "Stayed at the Biltomore as part of a conference. The service was excellent; from bellmen to front desk, to consierge, etc., etc. Tried the spa, and found the quality to be excellent and prices/value better than I expected. At first I was put into a room with a very noisy airconditioner, but was quickly moved to another room which was fine. Consierge was especially helpful with anything we needed. Overall, I was expecting great service and that is what I got.", "title": "Great Hotel, as you would expect", "helpfulness": 1, "user": "pr123", "date": "November 28, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 6231316, "likes": {"liked": "— Quality of Service & Physical Location", "disliked": "— Nothing significant"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2006, traveled with family", "text": "Our second trip to the Arizona Biltmore was even better than the first. We went in 2005 for two nights after traveling throughout the southwest. This year (2006) was for seven nights. Although not designed by Wright (as some think), his influence as consultant pervades the entire complex. Numerous pools, a variety of lodging options, and fabulous restaurant (Wright's) makes for a great stay.", "title": "Frank Lloyd Wright Heaven", "helpfulness": 1, "user": "Spy-Guy-Dad", "date": "November 18, 2006", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 6149546, "likes": {"liked": "— Number of pools", "disliked": "— Too much construcion around the hotel"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled on business", "text": "This is a very classic and historic hotel, one of a kind. The grounds are beautiful, every president since Herbert Hoover has stayed here as well as many of the celeb's from the 40's, 50's and 60's. It is worth staying here just to be a part of that history. However, simple things like not having a coffee maker in your room can be annoying, especially for the price you are paying.", "title": "Historic Resort", "helpfulness": 2, "user": "regosnell", "date": "November 9, 2006", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 6093319, "likes": {"liked": "— history", "disliked": "— No coffee maker in room"}}, {"rating": 2.0, "stay_parameters": "Stayed November 2006, traveled on business", "text": "Arriving at the Arizona Biltmore gives you a sense of what a \"5-star\" resort must have been like for movie stars and millionaires during the early part of the last century.", "title": "4 Star Grounds, 1-3 Star Service", "helpfulness": 6, "user": "applegator", "date": "November 4, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 1.0, "cleanliness": 5.0, "value": 2.0, "location": 5.0, "rooms": 3.0}, "id": 6057007, "likes": {"liked": "— The grounds and pools", "disliked": "— the service"}}, {"rating": 5.0, "title": "First Class all the way....", "text": "You can tell that the place definitely had its moments of elite history, and while it may have truly been one of the most glamourous hotels back then, it shows its age in both good and bad ways.", "helpfulness": 3, "user": "justmewonderinginyuma", "date": "October 3, 2006", "id": 5905814}, {"rating": 5.0, "stay_parameters": "Stayed December 2005", "text": "This is the third Christmas we spent at the Biltmore, but my first review.", "title": "Beauty in the Desert Sun", "helpfulness": 13, "user": "joepinstripe", "date": "December 28, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 4.0}, "id": 4308004}, {"rating": 2.0, "title": "Extra costs and things not included", "text": "On this trip, my husband and I stayed in room 3115 from December 23 - 25, 2005. This was termed a \"Premier\" room and we had a special promotional rate of $299/night.", "helpfulness": 16, "user": "A TripAdvisor user", "date": "December 11, 2005", "id": 4232275}, {"rating": 3.0, "title": "Need of Tender Loving care", "text": "We arrived at the Biltmore around 12:30pm, well before check-in time, to find our room ready and waiting. We were in the Valley Wing (built in 1979) which was immediately adjacent to the original, main building. Our room had a private porch area with 2 chairs, a table and a chaise longue. A hedgerow seperated us from the pool area (a lovely, smaller pool with Catalina tile, a fountain and a hot tub, more private than the large, main pool).", "helpfulness": 11, "user": "M G", "date": "November 17, 2005", "id": 4123379}, {"rating": 2.0, "title": "Watch out for room 1148", "text": "The decor of the room was Craftsman in feel with some desert-color touches and leather and wood touches. Handsome, and plenty of storage for hanging and folded clothes.", "helpfulness": 18, "user": "lojasNJ", "date": "November 15, 2005", "id": 4118138}, {"rating": 2.0, "stay_parameters": "Stayed October 2005, traveled on business", "text": "The King bed was very comfortable and the linens were soft. Bathroom products were present and accounted for, although nothing spectacular. The Biltmore Spa shampoo they provide smells great, though! The shower pressure was very strong and there is plenty of shelf space in the shower/bath to place razors, shave cream, toothpaste, etc., upon.", "title": "Come see the architecture, but don't stay here", "helpfulness": 11, "user": "BigDiveNut", "date": "November 3, 2005", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "rooms": 2.0, "service": 1.0}, "id": 4085173}, {"rating": 4.0, "stay_parameters": "Stayed January 2007, traveled on business", "text": "My husband and I were there for a conference in January. Gorgeous property with lovely clean room. Service was excellent; everyone was very friendly and tried their best to accomodate our needs - some mix-ups with housekeeping due to language barrier - but all confusion was fixed with cheerful follow-up. The pools and grounds were lovely. Only serious complaint was much-too-soft beds. Both my husband and I and our colleagues at the conference got serious backaches as a result. I ended up sleeping on the floor! Ridiculous for such a high-end hotel. I only hope they invest in some more firm, substantial mattresses. It's hard to function without a good night's sleep!", "title": "Great service, bad bed", "helpfulness": 1, "user": "KathyNewJersey", "date": "January 31, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 2.0}, "id": 6719125, "likes": {"liked": "— Beautiful", "disliked": "— Uncomfortable, too-soft beds"}}, {"rating": 5.0, "title": "i loved it", "text": "the resort was amazing there was enough space and there was a lot to do. I was not at all bored.", "helpfulness": 1, "user": "terri011", "date": "January 26, 2007", "id": 6698896}, {"rating": 2.0, "stay_parameters": "Stayed January 2007, traveled on business", "text": "The ONLY reason to stay at this resort is if you love Frank Lloyd-Wright-INSPIRED architecture (he was merely a consultant to the architecht-of-record). Admittedly, the main building's exterior and interior are stunning and worth seeing, even if you are not an architecture buff. It is probably one of the most beautiful hotel lobbies in the world.", "title": "The Negative Reviews are Correct", "helpfulness": 5, "user": "Critical_But_Fair", "date": "January 25, 2007", "detail_rating": {"front_desk": 1.0, "business": 2.0, "service": 1.0, "cleanliness": 4.0, "value": 1.0, "location": 4.0, "rooms": 2.0}, "id": 6694485, "likes": {"liked": "— Architecture", "disliked": "— Everything but the architecture"}}, {"rating": 3.0, "stay_parameters": "Stayed February 2006, traveled as a couple", "text": "However, once you get past the main public areas, everything changes for the very worse. The rooms are not a good value (conference rate is $300) and, more importantly for me, the service is erratic and mostly well below average. My wife and I stayed at this resort for four nights, which gave us time to get to know a number of the staff, particularly those working in the lobby area. They are generally very good people, but I believe they (and, consequently, the guests) are victims of horrible service training. Too many times I had to call a manager over or begin to make a scene before I would receive the service you deserve at a self-proclaimed high-end hotel.", "title": "Mixed review", "helpfulness": 2, "user": "nwwriter", "date": "January 21, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 3.0}, "id": 6636358, "likes": {"liked": "— History of the hotel, architecture", "disliked": "— Stuffy and pretentious"}}, {"rating": 2.0, "title": "really average hotel", "text": "For example, most nights it was nearly impossible to find a server on patio areas near the fire pits. Once, I went inside to the bar and asked a server for assistance. She told me that the patio was not her area and that she could not help me. I found the chief bartender and told him about my exchange. He apologized and took my drink order. Later, the server came outside and offered help; she then explained that she had been trained not to \"take over\" another server's area. I doubt very much you would ever have a Four Seasons or Ritz employee say \"No\" to a simple and reasonable request.", "helpfulness": 4, "user": "slumberdudes", "date": "January 20, 2007", "id": 6628562}, {"rating": 4.0, "stay_parameters": "Stayed February 2008, traveled on business", "text": "Having stayed - in the last year - at the Sanctuary and the Montage, I expected the Biltmore to be of the same caliber, given that it was in the same price range. Don't get me wrong - it was good, but not that good. Sure, the unique architecture of the \"old building,\" both inside and out, is remarkable. The service is impeccable. However, the inside of the \"new\" buildings was not up to my expectations. I stayed in the Arizona building, built long after the original building, but a long time ago. The hallways reminded me of a run-of-the-mill Marriott. The \"half-moon\" lights down the hallway doubled as dead bug receptacles. The room was spacious and the furniture and appointments okay, but not plush. It really reminded me of an apartment I lived in 20 years ago: hard plastic sink and bathtub, '80's style light switches, and double-mirrored closet doors that won't stay on their tracks. The carpet had stains as did some of the chairs. And the sliding glass door to the outside (no balcony, just iron bars), had a shabby \"afterthought\" night lock that looked like \"Uncle Bob\" slapped up. In this era of \"Spa Resorts,\" it seems like the emphasis is more on the spas and not so much on the facilities. (I had a similar impression of the Phoenician also.) Next time I go to Phoenix, I'll try the Ritz or Four Seasons (if they have locations in Phoenix).", "title": "Alright, but not spectacular.", "user": "Pramstroker", "date": "February 8, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 3.0, "value": 2.0, "rooms": 2.0, "location": 4.0}, "id": 13392894, "likes": {"liked": "— Old time", "disliked": "— Rather common interior of the"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled on business", "text": "Have stayed here many times, and the customer service maintains its super high level. This is true across all types of employees from bellman to front desk to housekeepers. Food at the Biltmore is also quite good for a hotel...", "title": "Best Customer Service", "user": "GlendaleCA", "date": "January 21, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 12844140, "likes": {"liked": "— service and the grounds", "disliked": "— need to update bathrooms."}}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "The grounds are kept up very well. Now they just need to freshen up the rooms a bit to match the grounds. Plastic sinks and shower inserts is kind of a surprise at such a high level resort.", "title": "If you love history and architecure, this is a must-stay resort", "user": "illflyaway", "date": "January 14, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 12623011, "likes": {"liked": "— Beautiful historical resort", "disliked": "— Noisy at times in room"}}, {"rating": 5.0, "title": "Beauty in the Desert", "text": "The prices for such a high level resort are surprisingly low as well.", "user": "devotedtoarizona", "date": "January 9, 2008", "id": 12471256}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "I have read many of the reviews of the Arizona Biltmore and have been so surprised at some of the negative ones. If you are a lover of history and a lover of architecture, you MUST stay at this hotel. It is a true gem, a return to the 1930s. It was designed in 1929 by a student of Frank Lloyd Wright, and Wright served as the consulting architect.", "title": "Old time sophistication", "user": "sanfrannie", "date": "January 4, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 3.0, "location": 5.0, "rooms": 4.0}, "id": 12318186, "likes": {"liked": "— Service"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2006, traveled on business", "text": "My 11 year old and I were accompanying my husband for a conference there. Since they had overbooked, we were upgraded to a suite overlooking the golf course. The accomodations were fantastic: huge living room with full kitchen (to prepare our own breakfast), fireplace, big bedroom, walk-in closet and a gigantic private patio. My daughter's favorite part of the hotel was the pool with its 70ft slide that she must have gone on a few hundred times. On the week-end they used the pool as a movie theatre showing kids' movies on a screen between 2 palm trees, the seats replaced by floaties. During the week end, the hotel also made smores for the guests. A cowboy was singing by the firepit. Other free attractions included wine tasting and cigar rolling. Contrarily to the previous review the staff was very friendly and we never had any problems with housekeeping. The food at the restaurant was pricy but this is to be expected for a hotel of this class, however it was also very good.", "title": "Great Time at the Biltmore", "helpfulness": 6, "user": "Vbg", "date": "July 12, 2006", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 5460444}, {"rating": 1.0, "title": "Bad,Bad and Nice", "text": "The hotel is close to a very nice mall (Meiman Marcus...) and some very nice restaurants. We particularly enjoyed Sam's Cafe for its great food, very reasonable prices and friendly service.", "helpfulness": 8, "user": "A TripAdvisor user", "date": "June 30, 2006", "id": 5413282}, {"rating": 4.0, "stay_parameters": "Stayed June 2006", "text": "We would go back without any hesitations to the Arizona Biltmore.", "title": "Great Hotel, Can't Say the Same for the Clientele", "helpfulness": 7, "user": "jillypgh", "date": "June 29, 2006", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 5.0, "service": 4.0}, "id": 5409517}, {"rating": 4.0, "title": "Overall a Good Experience, there are a few 'buts'", "text": "We left the Biltmore early the service was beyond bad. My children and I wanted a mini vacation so we booked a room for a week 6/24-7/1. The room (399. a night) was lovely a kitchen and living area with a hug bathroom and king size bed over looking the golf course. The problems started with the maid service after having no cream for my coffee on our first morning I wrote a note with tip for the maid to leave cream. I received only two packages of cream. The whole week I was without shampoo and Toilet paper at times and forever out of cream for my coffee. Nothing was being restocked in my room. The mantence department was called every day water coming from dishwasher to toilet over flow. The Spa employees are inexsperienced I had the worst massage ever.They made a big deal about my teenagers having a massage without me in the room even though they had on bathing suit's which ruined my daughter b-day since she chosed not to have a spa day.( We have booked her into a kids spa at our local resort back home.)My teenagers where with me when I booked the spa day their is no mistake they are under 18 no one told us the parent present rule nor 24 hour cancilation. I would have had to spend all day in the spa with my kids. My kids would be the first one from the room if some one started touching them threw there bathing suits they have had massages since they were 9 yrs old at kids spa in resorts all over the world. The next was the room service, 22% service charge means you get a tray put on the table and the waiter leaves for you to set up. No glass or ice for the soda's and the pizza where always under cooked. The food was terrible the Wright dining room was closed so we went to the Grill. the food was like it was reheated and dried out and small portions. The service at the pool was hit or miss. Twice they plain forgot to place our order just like the Cafe we ate at once. I called the manager twice and no responce my husband called from our home and got right threw. The manager called me and offered a free night I declined I just wanted to leave. He offered a VIP treatment where someone comes after the maid to make sure you have everything you need like shampoo or TP. I asked why do I have to join a travel club to get special treatment. I'm not asking for special treatment just what I paid for. The staff needs to learn to great people and work on service. I will not go back I travel to resort all over the world and this is the worst service and food I have ever had. It seems from the reviews that if you are not their for a convention the exsperience is poor.", "helpfulness": 7, "user": "cc_bean", "date": "June 15, 2006", "id": 5351314}, {"rating": 3.0, "stay_parameters": "Stayed May 2006", "text": "This was my second stay at the AZ Biltmore; the first was in 2002 with a convention, where I could expense everything and not feel the hole burning in my wallet. Ah!", "title": "Maybe once, but not now", "helpfulness": 10, "user": "gr8passage", "date": "June 13, 2006", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "rooms": 3.0, "service": 3.0}, "id": 5343060}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled with family", "text": "We just returned from a lovely stay at the Arizona Biltmore. The property is beautiful. Anyone who is a fan of art deco decor will be totally smitten with this hotel. The public areas are fantastic. Our room, though one of the least expensive, was very spacious with a very large bathroom. We found the pools to be lovely and clean. We ate at both the cafe and one of the casual restaurants and both had very accomodating service and good food with prices typical of an upscale hotel. There are many planned activities going on at the hotel such as \"smores by the fire\" and makeup make overs for teens which we thought were very fun. We are looking forward to returning to this fabulous hotel.", "title": "It was Great!", "helpfulness": 1, "user": "teedeeandchelchel", "date": "January 2, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 6544030, "likes": {"liked": "— Art deco design", "disliked": "— Nothing"}}, {"rating": 2.0, "stay_parameters": "Stayed December 2006, traveled solo", "text": "NOT a five star by any stretch of the imagination. A two or three at most. Overpriced to the nth degree. Do NOT believe good reviews about this place, really truly. I can't imagine why anybody would stay here at these prices. I am used to five star places and love that level of service. When in Phoenix, stay anywhere but here.", "title": "NOT a five star hotel--no way", "helpfulness": 7, "user": "girlbird", "date": "December 29, 2006", "detail_rating": {"front_desk": 4.0, "business": 1.0, "service": 3.0, "cleanliness": 3.0, "value": 1.0, "location": 2.0, "rooms": 2.0}, "id": 6517881, "likes": {"liked": "— Interesting architecture, desert climate", "disliked": "— Bad food, horrible value for the money."}}, {"rating": 5.0, "stay_parameters": "Stayed February 2006, traveled as a couple", "text": "PROS: The golf course was ok. The architecture of the main building is really interesting, especially at night. Worth a trip if your'e into that.", "title": "Can't wait to return.", "user": "penguinitis", "date": "December 22, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 6481164, "likes": {"liked": "— rooms were gorgeous. spa services were wonderful.", "disliked": "— nothing."}}, {"rating": 2.0, "stay_parameters": "Stayed August 2006, traveled on business", "text": "However... The service on the links was awful. The architecture is not Frank Lloyd Wright, however. It's just inspried by him. Worse yet, everything except the lobby and the main common areas have been gutted beyond recognition, like by the worst common denominator 70s Hilton type mediocrity. The pools are nice, but badly updated. Even the rooms have tacky arts and crafts knock off fake furniture you'd see at an Embassy Suites. So if you want to stay here for the architecture, forget it. Stop by and have a drink at the bar, walk around for ten minutes, but stay somewhere else. They took the soul out of this 1929 resort. Having said that, if only the Four Seasons or somebody would restore it to look original 1929 and take over management, it could be a special place, like the many upscale mid-century places in Palm Srings.", "title": "Bilkmore", "helpfulness": 4, "user": "iwanttowin", "date": "December 18, 2006", "detail_rating": {"front_desk": 1.0, "business": 2.0, "service": 2.0, "cleanliness": 4.0, "value": 2.0, "location": 2.0, "rooms": 4.0}, "id": 6470266, "likes": {"liked": "— The grounds... well maintained", "disliked": "— The lack of service."}}, {"rating": 1.0, "stay_parameters": "Stayed August 2006", "text": "CONS: During my stay, a partial list: They mow the lawn at 7:30 am with really loud mowers. The tv stations didn't work. No internet in the room, and the business center charged $40 per hour!! EVERYTHING is overpriced as to be a joke!! The porno cost $15 per movie. Sheesh! The honor bar was higway robbery: The teeny little water bottle was $5. This is the desert for heaven's sake--no complimentary water?? The teeny little half coke bottle was $5.50. The thing of cashews, all 23 of them, cost $11. There are flourescent lights in the rooms. I love the environment and all, but flourescent lighting is the worst cheapskate thing in a nice hotel. The gifts shops had tacky tacky 1980 preppie stuff. The food was HORRIFIC. At the Grill, at the Wrights dining room--it's as if the cook saw a picture of a fancy restaurant in NYC or San Francisco, and made the food look like the picture, but the tastes are truly gruesome. Bad tomatoes, broken recipes. The shrimp was yellow, the fish and chips frozen. The staff do not respect the do not distirb signs--we're talking three or four knocks late at night kind of thing. The staff is rather ignorant--they mean well, but they don't have the hotel to back it up.", "title": "Horrific, overrated hotel!", "helpfulness": 6, "user": "santoki", "date": "December 18, 2006", "detail_rating": {"front_desk": 1.0, "service": 2.0, "cleanliness": 2.0, "value": 1.0, "rooms": 1.0, "location": 1.0}, "id": 6455288, "likes": {"liked": "— nothing", "disliked": "— staff"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled solo", "text": "I just returned from a 3 day, 3 night stay at the Biltmore (Wed - Sat) and I think there were tears in my eyes when I pulled away last evening! It was truly a pleasure from the moment I checked in until I left. I paid in advance for a deluxe resort room in the Valley wing which was large with a lovely balcony overlooking Camel Mountain to the left and the large lawn and a glimpse of the Paradise Pool to the right.", "title": "a wonderful stay", "user": "JLSToronto_Ontario", "date": "March 2, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 13995184}, {"rating": 5.0, "stay_parameters": "Stayed February 2008", "text": "I was travelling alone (woman, mid 30s) and the staff made extra sure I was comfortable regardless of what I was doing. They remembered me from the front desk, to the restaurant, to the pool. Normally when I travel, I use the hotel for sleeping only, this was not the case for this vacation. The only time I left the resort was when I went shopping on Friday at the Biltmore Fashion Park (free shuttle service) and the Fashion Square (5 miles down on Camelback Rd).", "title": "This Grande Dame is holding up beautifully!", "user": "OCTravelAgent", "date": "February 29, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 13939056}, {"rating": 1.0, "title": "Huge Disapointment! Not a luxury hotel.", "text": "Two of the evenings I ate on the outdoor patio of Wright's Bar and was able to order food from the Grille. I also spent 2 full days in a cabana by the pool where the staff were attentive and lovely and I also had a terrific, relaxing massage at the spa one of the early evenings.", "user": "sunlovingPortland_OR", "date": "February 18, 2008", "id": 13636524}, {"rating": 3.0, "stay_parameters": "Stayed February 2008, traveled on business", "text": "Because I was there mid-week through the weekend, I noticed a huge difference in clientele. Mostly business men and women Wed-Fri and then families on the weekend. The pool was much livelier on Saturday and I recommend splurging for the cabana to escape from the noise and sun if necessary.", "title": "Beautiful escape from the snow, however....", "user": "Ozblossom", "date": "February 12, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 2.0, "location": 4.0, "rooms": 4.0}, "id": 13492073, "likes": {"liked": "— Scenery, fire pits/lounge area, walking trails", "disliked": "— Expensive, hidden charges, dining disappointing"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled on business", "text": "I loved my stay here and would recommend it to single travellers or families. I hope to return for many more vacations.", "title": "Biltmore has the Wright stuff!", "user": "GeneDC", "date": "February 8, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 13395306, "likes": {"liked": "— Historic, glamorous setting with modern convenience"}}, {"rating": 3.0, "stay_parameters": "Stayed March 2006, traveled on business", "text": "The Arizona Biltmore Spa has a very nicely manicured grounds and nice staff. However, looking at the prices, I somehow expected more. We stayed first in a room with a \"Mtn View\", unfortunately the noise of the unloading trucks, the garbage bins back behind the buildings, did not make this in my opinion a very desirable room. We opted for a change to the Paradise Wing overlooking the pool and they were able to accomodate. The \"pool exposure\" isn't entirely the greatest because we were a bit toward the rear. I am not a golfer so this resort did not have much appeal in that respect, but they do have a shuttle to the fashion mall. The assorted cafe's on the grounds are very overpriced as are the shops. In excess of $2.50 for a diet coke, not to mention mixed drink prices. Interestingly enough they had a nice lobby table set up with wine glasses, etc... appearred like an evening welcoming reception like they had at Sanctuary (in Arizona) but our hands were quickly slapped away as this was for \"wine dinner\" participants only. Very sad, then at least I might rope off the area or put out a sign! I think if you do a golf package you might be happier, again, I am not a golfer. My spa trip was average, my wife had the Lemongrass Thai Bamboo body scrub and she really enjoyed it. I think we will try the Phoenician the next time or back to the Sanctuary on Camelback.", "title": "A bit Pricey at the Biltmore for a non golfer", "helpfulness": 12, "user": "Frank S", "date": "March 6, 2006", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "rooms": 3.0, "service": 5.0}, "id": 4587796}, {"rating": 4.0, "title": "relaxation at the biltmore", "text": "i recently visited the biltmore for the second time. we stayed in a classic room in the arizona wing. the room was spacious and clean. the bathroom was huge and the amenities were very nice. the beds were extremely comfortable, fluffy white duvets and pillows. we felt that the service was excellent. when we first arrived our room was ready, 4 hours before check in time. we had great service in all the restaurants and bars. we ate at the poolside restaurant and the biltmore grill for dinner and breakfast. we also visited the lounge each evening.", "helpfulness": 12, "user": "A TripAdvisor user", "date": "February 24, 2006", "id": 4517201}, {"rating": 1.0, "stay_parameters": "Stayed January 2006", "text": "the resort itself is very well maintained. the grounds are gorgeous- so many gardens with beautiful flowers.", "title": "Watch out for scorpions- ouch", "helpfulness": 22, "user": "97Speedracer97", "date": "February 9, 2006", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "service": 2.0}, "id": 4450046}, {"rating": 4.0, "stay_parameters": "Stayed January 2006, traveled on business", "text": "we used the spa and took part in some of the classes offered- the power walk and an upper body conditioning class. they charge $15 per class which is a little ridiculous since they also charge you $20/night resort fee. we hiked squaw peak on our own which is much better than paying $25/p.p. to do it with a guide from the resort. we felt that our spa treatments were just ok, nothing spectacular.", "title": "Enjoyed the Biltmore", "helpfulness": 17, "user": "joelmari", "date": "January 26, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 4.0}, "id": 4389775}, {"rating": 3.0, "stay_parameters": "Stayed March 2005, traveled on business", "text": "all in all, i love this resort. i would go back every year if i could. it's a great place to relax in the sun and in a beautiful setting.", "title": "Dodgy Service, and a ripp off!!", "helpfulness": 15, "user": "emdee", "date": "January 7, 2006", "detail_rating": {"value": 1.0, "service": 1.0}, "id": 4330433}, {"rating": 5.0, "title": "Lovely, lovely, lovely", "text": "My girlfiends and I spent one night at the Biltmore on Memorial Day weekend after days spent hiking in Sedona. What a wonderful place to get cleaned up! The buildings and landscaping is beautiful! We had a resort room with a balcony which overlooked the small parking lot in the rear but also the lovely Camel Mountains. Our room was clean and the bathroom was huge enough to handle three women, no problem. The beds are luscious, pillow top, down everything, crisp clean sheets.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "May 31, 2006", "id": 5287490}, {"rating": 5.0, "title": "Loved the Biltmore!", "text": "We headed to the Paradise Pool, there are eight pools on the property, as well as hot tubs. Knowing the history of the hotel I had visions of Old Hollywood Glamour. Unfortunately the Paradise Pool was more like Spring Break, very crowded, loud rock music playing and a bunch of TVs playing in the private cabanas that open up to the pool area. There is a bar a water slide. We hit the water slide and then headed over to the more serene Catlina Pool, that provided more of what I had expected.", "helpfulness": 7, "user": "ccwilshire", "date": "May 9, 2006", "id": 5044721}, {"rating": 2.0, "stay_parameters": "Stayed March 2006, traveled on business", "text": "For dinner we checked in with the Concierge to ask about Southwest food in the area. HIs response was almost robotic and the directions to the restaraunt were already printed out on cards. We felt that the Hotel was probably getting kickbacks from the place so we asked the Valet guys instead and they were able to recommend some local, authentic places. The Valet guys were helpfull and friendly, I recommend talking to them.", "title": "Service on the decline", "helpfulness": 21, "user": "Jneen", "date": "March 27, 2006", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "rooms": 4.0, "service": 2.0}, "id": 4737876}, {"rating": 5.0, "stay_parameters": "Stayed February 2006, traveled on business", "text": "When we returned from dinner we had the great pleasure of finding a complimentary s'mores buffet set up around a camp fire with large Adirondack Chairs. There were sticks provided for the raosting and also multiple beverages. It was magical, the Hotel and grounds look particularly gorgeousl at night. A movie was being shown to kids above the pool so they could float and watch. The historical tour is only available on certain days of the week. There is printed material available but it mostly just lists the owners. We enjoyed strolling around the building looking at al the old potographs and exploring the ballrooms.", "title": "Pleasantly surprised", "helpfulness": 14, "user": "travel JR", "date": "March 12, 2006", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 4.0, "service": 4.0}, "id": 4602566}, {"rating": 4.0, "title": "Architecture Is Great, User-Centeredness is Low", "text": "We slept like babies and awoke to our ordered room service breakfast promptly delivered and hot. We ate on the balcony and watched the sunrise. On the way out I stopped at The Cafe to pick up some food for my flight home. The line tok a very long time. Other than the mild inconveniences everyone was friendly and the Biltmore provided activites and serentiy. And we didn't even try the spa! Some people there looked bored, maybe they go to places like that all the time...I was thrilled to be in a historical and beautiful setting. Go, go, go!", "helpfulness": 14, "user": "Thegoodegg", "date": "March 7, 2006", "id": 4591943}], "location": {"country": "United States"}, "stars": 4.5, "variance": {"poor": 137, "average": 235, "very good": 444, "terrible": 74, "excellent": 834}, "aka": "Arizona Biltmore Hotel Phoenix", "slim_ranking": 0.19209039548, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.5, "rooms": 4.0, "location": 4.5}}