{"user_rating": 4.0, "review_count": 1157, "name": "Arlington Hotel O'Connell Bridge", "reviews": [{"rating": 2.0, "title": "More average than average", "text": "After attempting conversation with the receptionist (young male colleague slouching over the desk on a smart phone) I asked if my room was a nice room: \"we only have nice rooms\". How wrong could they could have been. By the way like most hotels don't trust the promotional hotel room pictures or when you book clearly state I want that room on picture 7 etc. A tiny room (smaller than any other room every stayed in; inc London and Manhattan) right next to the stairwell and the fire security door that you hear bang close every 15 mins. I haven't seen a box TV in about 10 years, almost ironic as all the channels are broadcast in widescreen format; really can't be that much to negotiate a special rate for 40 plasma 20\" TVA.... Really!!! Don't forget the charming bar downstairs, charming if you've maybe had a few. Last time I allow someone else to book my hotel. I'm sure I was just unfortunate...", "helpfulness": 1, "user": "Martin H", "date": "November 9, 2013", "id": 184175629}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled with friends", "text": "Great hotel very central. Breakfast was amazing everything you could want and more! Irish dancing was very good, followed by a live band in the bar and then disco to follow! Perfect. The meal was set for the dancing evening and was ok if i had to say one negative it would be that therecwas more of it.", "title": "Great weekend away with the girls", "helpfulness": 2, "user": "sm48_13", "date": "November 9, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 184161088}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled on business", "text": "I stayed on the 4th floor and the room was clean and well appointed and quiet. The breakfast was excellent but the thing that made for a memorable stay was the friendly staff especially the bar staff. Whilst this was a business visit i thought that i'd just have a quick drink and then head for bed. I didn't realize that this simple task wasn't possible because once you get to the bar it's very difficult to leave. The traditional Irish band playing was first rate as was the atmosphere and I didn't want to leave because everybody was having such a great time. I've got another visit to Dublin in a couple of weeks time and i'll be going back to The Arlington Hotel for certain.", "title": "Recent Stay at The Arlington Hotel Dublin", "helpfulness": 1, "user": "Julia R", "date": "November 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 183891720}, {"rating": 4.0, "title": "Great location", "text": "Room was basic but clean,perfect location for temple bar,shops and bus tours,we did the Irish dance night at the hotel,the meal was a little disappointing but the band and dancers were great,the staff are very friendly and helpful,I will definitely stay here again,breakfast was good too,", "helpfulness": 2, "user": "soxy_9", "date": "November 3, 2013", "id": 183398238}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled with family", "text": "Stayed in The Arlington over midterm with my young daughters, Location is absolutely perfect, walking distance to all tourist attractions, our room was large, warm and bright ,a little noisy as we were on the first floor but thats to be expected in such a busy hotel so central. We will stay here again, staff were welcoming and helpful, Hotel is old but charming , I would recommend The Arlington for all age groups and families", "title": "Family break", "helpfulness": 1, "user": "Tracey-ann M", "date": "November 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 183382804}, {"rating": 4.0, "stay_parameters": "Stayed October 2013, traveled with family", "text": "We stayed here in October 2013 (myself, husband, 3 boys aged 4,8,11) and it was lovely. Breakfast staff were amazing, remembering the kids' names n all! Ate so well at breakfast we barely needed anything at lunch. Service was excellent whenever we needed it. Rooms were cleaned to perfection!. Water pressure was great. Some noise on the 2nd floor from the dance show/night club but we were at the back so it was minimal. The rooms were huge for Irish standards and we had 2 rooms on the 2nd floor which were inter-connecting (I think it was 208 and 209)...weird thing though...when we woke on the first morning and walked into the interconnecting room where the boys were, there was a strong smell of cigarette smoke! We don't smoke and the windows weren't even open! We mentioned it after breakfast on our way out for the day and when we came back it was gone (odd swiff of it now and again if you concentrated hard) so we thought problem sorted! Woke up on the second morning and same thing! Like as if one of our boys had been smoking LOTS in the room! (the oldest was 11yrs)...Both nights we heard someone putting money into the vending machine around 2-3am but then it continued...they didn't press any buttons to get a snack, they just kept putting money in! But when one of us (first night it was my son) got up to use the toilet, the money clinking stopped! Second night I heard the money again, so I waited and waited and someone kept putting money in and not retrieving anything!?!?! So I got up to use the toilet and immediately, it stopped...I didn't sleep after this! My husband would not be a \"believer\" of ghosts per say, but we both believe \"something/someone\" was in our room or very near. I would NEVER stay on this floor again and would NOT stay here without my husband/teddy bear to snuggle up to at night for fear of it happening again! I did not tell my kids about this as we may stay here again because of the central location, friendly staff, and cheap offers, but I personally would avoid rooms 208/209 at all costs! Other than that, amazing hotel...only lost one star in my mind because of the \"ghost\"", "title": "Wonderful Service! Ghosts???", "helpfulness": 2, "user": "3CrazyBoys3", "date": "November 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 185046573}, {"rating": 4.0, "stay_parameters": "Stayed November 2013, traveled as a couple", "text": "We arrived early afternoon to be told the room would not be available until 3pm, not a problem. Receptionist acknowledged we had paid for the room in advance but asked to swipe our credit card to secure payment of incidentals. We were asked to tap in our pin number which we duly did. As the transaction completed we noticed a debit of 69 Euros on the screen.... what ! We asked what the payment was for, the receptionist apologised - it was mistake, and were given a credit on the transaction. Returned for our room key at 3pm, given a first floor room, not a front view, smallish room, again not a problem. I opened the net curtain to find a variety of large ducting and a row of large noisy ventilating fans right out side the window - aaargh. Returned to reception - not a good start.", "title": "Not a good start - but not disappointed", "helpfulness": 2, "user": "swiisgirlBirmingham", "date": "November 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 184907390}, {"rating": 4.0, "stay_parameters": "Stayed November 2013, traveled as a couple", "text": "Dealt with quickly, efficiently and politely by reception, the room we were then given was on the fourth floor and it was superb. Breakfast is buffet style, fresh and plentiful. Staff are so welcoming and friendly. On the ground floor there is a huge bar & eating place which has live bands in the evening and has a real buzz about it, there is a great little heated veranda at the front of the hotel where you can take an evening drink.", "title": "Very friendly hotel in the centre of the city", "helpfulness": 1, "user": "jackie o", "date": "November 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 184879154}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "The hotel is centrally located, looks out onto the Liffey and close to temple bar. Several of the must see sites are within walking distance. All in all would recommend this hotel.", "title": "amazing hotel!!", "helpfulness": 2, "user": "vital d", "date": "November 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 184859363}, {"rating": 3.0, "stay_parameters": "Stayed November 2013, traveled with friends", "text": "Stayed on 13 November, and had a very good experience. We booked dinner to watch the nightly show of Irish dancing and music. Pleasantly surprised with the quality of the meal for mass catering, with great service from bar and food staff. The show was amazing, 2 hours of non stop dancing and singing, extremely professional and great enjoyment.", "title": "Great location", "helpfulness": 1, "user": "Sher71", "date": "November 14, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 184670096}, {"rating": 4.0, "stay_parameters": "Stayed November 2013, traveled as a couple", "text": "Be aware this is your typical older budget mid-ranged priced hotel in the city, not advertising the standards of your branded hilton.", "title": "Great mid-ranged hotel in central location", "helpfulness": 1, "user": "lurch1", "date": "November 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 185901173}, {"rating": 4.0, "stay_parameters": "Stayed November 2013, traveled with friends", "text": "I found this hotel to be clean and friendly. The rooms, while older and a bit dated and worn where expected for the price and location, were comfortable for my 2 day stay. The bed and pillows a little stiff for my standards, but most hotels are the same.", "title": "Live music, centrel location hotel", "helpfulness": 1, "user": "Nikki G", "date": "November 24, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 185693539}, {"rating": 5.0, "stay_parameters": "Stayed November 2013", "text": "I got a room on the 4th floor and to the west side and you could barely hear the bar noise down below and it did not bother me.", "title": "Top of the range !!!!!!!!!!", "helpfulness": 3, "user": "Gerwil666", "date": "November 23, 2013", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 185611750}, {"rating": 3.0, "stay_parameters": "Stayed April 2013", "text": "I ate lunch at the pub below one day and the food was excellent. I also came for the Celtic show the second night I was there....skipping the dinner and showing up right at the 8:30 start I got a bar seat center stage. The show itself was a bit campy but fun and entertaining and lasted about an hour and a half.", "title": "Hen night", "helpfulness": 1, "user": "JaJen_10", "date": "November 20, 2013", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 3.0, "rooms": 4.0}, "id": 185288531}, {"rating": 3.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "The location was very central off lower O'Connell. Easy bus ride from Airport via Airlink and a short 3-4 block walk from the stop. Tour buses stop right in front of hotel to boot! Easy way to get around for 2 days. Also easy walking distance from trinity College, Grafton Street and the parks as well as Temple Bar and Dublin Castle.", "title": "disapointed", "user": "tom123Brighton", "date": "November 20, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 185266119}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled as a couple", "text": "This hotel -specifically the O'Connell bridge location- is great.", "title": "Great Location. Friendly Staff.", "helpfulness": 1, "user": "l b", "date": "November 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 184599223}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled as a couple", "text": "A super friendly girl checked us in (unfortunately didn't get her name) but she was very helpful. She kindly sorted out directions for us to get our car into the car park as we were very confused with all the one way streets. The man who helped us in and out of car park was also friendly. Parking is FREE in the basement! ..which is spectacular for a stay in any city. The parking fills up quick apparently (based on other reviews) but we had no trouble getting in day and night. If it is full they supposedly have discounted parking in another lot.", "title": "Great Character", "helpfulness": 2, "user": "PatKav63", "date": "November 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 184525047}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled with friends", "text": "The location is so centrally located to everything. Right on O'Connell street, short walk to Trinity college, St. Stephen's green, shopping centers, etc. Right on water so great for photos.", "title": "Fantastic hotel…..would visit again for definite!", "helpfulness": 2, "user": "DHDJ50", "date": "November 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 184489793}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled with friends", "text": "The Irish show at night is pretty awesome since you don't have to bother traveling at all, and once it finishes you can go right upstairs. We didn't check out the nightclub as I didn't realize it was open on Sunday (bit disappointed we missed out).", "title": "Brilliant!", "helpfulness": 2, "user": "siobhan w", "date": "November 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 184456689}, {"rating": 5.0, "stay_parameters": "Stayed November 2013", "text": "All around very impressed with this hotel.", "title": "Great Hotel", "helpfulness": 2, "user": "irishpaddyOffaly", "date": "November 12, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 184448240}], "location": {"country": "Ireland", "continent": "Europe"}, "stars": 3, "variance": {"poor": 74, "average": 195, "very good": 484, "terrible": 35, "excellent": 369}, "aka": "Arlington Hotel Dublin", "slim_ranking": 0.312849162011, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}}