{"user_rating": 4.5, "review_count": 32, "name": "Arnolds Bed & Breakfast", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "15 minute walk from the main train station and easy access to downtown Interlaken. Very clean, and great value in very expensive Switzerland. Armin is a very gracious and helpful host. Do not overlook the breakfast, well worth the money. Location provided a spectacular view of the snow covered mountains from our outside patio. We had the double room on the 2nd floor which had a small refrigerator and sitting area. Private bathroom with shower was spotlessly clean. Excellent stay for the money, thanks Armin.", "title": "Loved our stay", "user": "tony838", "date": "November 7, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 183912434}, {"rating": 4.0, "stay_parameters": "Stayed September 2013", "text": "We stayed here for a night and enjoyed it thoroughly. It was in close walking distance to the shops. It was close to the train station. A lot of good places to visit like Jungfraujoch, Grindelwald etc.", "title": "A nice cosy B & B stay.", "user": "Peter C", "date": "September 14, 2013", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 177155404}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "Armin was very nice and provided us with a wholesome breakfast. They seemed to trust their guests a lot and were happy for us to pay at the end if the stay. The price was reasonable too considering how expensive everything is in Switzerland. I recommend a stay at Arnold's if you want that nice B & B feel to your stay.", "title": "Great place at a reasonable price", "user": "paulzimmer", "date": "September 5, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "location": 5.0, "service": 5.0}, "id": 175973855}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "We really enjoyed our stay at Arnolds and wish we could have stayed longer. Convenient location, nice rooms, excellent breakfast. Price was quite reasonable for Interlaken (Interlaken is very expensive place to stay).", "title": "very friendly and heartful host", "user": "Dedee_C12", "date": "September 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 175657219}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "I travled with my parents in late July to Interlaken, and we booked this B&B in advance. all things are excellent and Beatice was so friendly that we feel that we were staying a home away from home. When we arrived that day in the afternoon, The Arnolds were not at home, but they are so considerable and put the key and all the instructions that we needed in a bag with my name sticking in front of the door. We were feel truely trusted by the Arnolds family.", "title": "Just perfect", "helpfulness": 1, "user": "nsoin", "date": "August 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 172214098}], "location": {"country": "Switzerland", "continent": "Europe"}, "variance": {"poor": 0, "average": 1, "very good": 9, "terrible": 0, "excellent": 22}, "slim_ranking": 0.238095238095, "description": "Welcome to Arnolds Bed & Breakfast. Our nice and cozy house with a fantastic view to the Jungfrau and the surrounding mountains is the ideal place to stay in Interlaken. Located very centrally in a quiet area. Big garden. Rich breakfast."}