{"user_rating": 4.5, "review_count": 968, "name": "Art Series - The Blackman", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "Took advantage of affordable opening special, and stayed five nights. Great room on 16th floor, with awesome views. Fantastic amenities and very comfy bed, but we felt a few more instructions on where things were located and how some things work would be handy. I also think that the lighting in the room could be much better. It was hard to even read by. Guest experience staff were always helpful and friendly, however i do feel that i must point out some shortcomings that you wouldnt expect from a 5 star hotel, that need to be looked at. I was offered a choice of 4 newspapers, from which i chose three. Normally in other hotels i have stayed in, these were left outside your door before 6am. I had to chase these up, and never received 3 papers at any one time, and none at all on check out day. Milk and sugar was not replenished, and we also had to request more dishwashing liquid as well, so the hotel is being let down by housekeeping. This should not happen ever in a 5 star hotel in my opinion. Also, as i had paid for my hotel & flights in full through Expedia, i was alarmed to see that on my hotel bill that you could access on your TV screen, that each day we stayed was showing in arrears. I had to sort this out with them, which was something i would also not expect to happen. These things aside, The Blackman is in a great location, with trams virtually at your door, it was really quiet, but so close to all Marvellous Melbourne has to offer, and once they iron out some teething problems, will always be a popular destination to stay at.", "title": "Very Good Location", "helpfulness": 1, "user": "Bearcat30", "date": "October 18, 2010", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 84006535}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "We had a great weekend at the Blackman. We enjoyed the artwork throughout the entire hotel. Our room was 5 star, amazingly comfortable bed and everything we needed to relax and enjoy ourselves. The art pack was a lovely touch. Dinner at classico and breakfast at the French cafe downstairs were also very enjoyable. We'll be back.", "title": "Lovely boutique hotel, ticked every box", "helpfulness": 1, "user": "Melbournite12", "date": "October 18, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 83893957}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled with family", "text": "My family and I enjoyed a single night here last weekend, and I was very impressed from check in to check out.", "title": "Exceeded expectations", "helpfulness": 1, "user": "Tough_Job", "date": "October 15, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 83568030}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled with friends", "text": "Having only opened a few short weeks ago, I expected there to be some teething problems, particularly with the service. There were none!", "title": "Sensational in everyway... AAAAAAAAA+++++++", "helpfulness": 1, "user": "swoshsista", "date": "October 13, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 83293564}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled solo", "text": "I also believed that they genuinely delivered on the art theme, with gorgeous details such as the rabbit silhouettes a testament to their integrity.", "title": "If you are into Australian art, this is the place to stay!", "helpfulness": 1, "user": "jennieMountGambier", "date": "October 8, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 82679725}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "we stayed one night only, having tried Sofitel, Crown and others - and this place tops them all... not overly big and intimidating, just friendly warm and great value. we will stop trying other hotels now that we've found the blackman!", "title": "loved it! best value hotel in Melbourne", "user": "steffimax", "date": "September 20, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 80270638}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "My stay here was excellent. The hotel is well located to public transport with trams at the doorstep to head towards the city, St Kilda or Chapel St. As I stayed on a Friday night, parking in the area is free on the weekends which is very handy. The rooms are spacious, well appointed, comfortable, modern with LCD TV, microwave, sink etc., The view from my room (which was a basic room) was exceptional with clear views of Albert Park Lake and also the sea in the distance.", "title": "Clean, Quiet, Modern, Traveller friendly, Great Location, Superb!", "helpfulness": 1, "user": "Melkol", "date": "September 18, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 80030081}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled on business", "text": "The front desk service was okay. The room was booked through a travel website at a substantially discounted rate and included a late checkout (1pm) and a small gift on arrival which aptly consisted of a small canvas and paint set. Very thoughtful.", "title": "Great Hotel and the art isn't bad either", "user": "PeterOwens", "date": "September 18, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 79986239}, {"rating": 5.0, "title": "Great new funky hotel just outside of the CBD", "text": "Will definitely stay here again, congratulations to hotel management and staff for doing things well. Will also be recommending this hotel for colleagues when they visit Melbourne as it is conveniently located to the CBD without being smack bang in the middle of it and also good for St Kilda Rd/Sth Melbourne etc.,", "user": "MaggsandMe", "date": "September 15, 2010", "id": 79608378}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled on business", "text": "I stayed at the Blackman having been watching the development of Art Series hotel with some interest - great location, close to the city (and the tram) but without the city noise etc. Large well appointed room with views to the city and albert park. Great to have a balcony and to be able to get outside. Great service. Didn't eat at the hotel. Only problem was the room key cards that seemed to need to be recut (reprogrammed) by reception ever day - and no it wasn't because they were in my wallet with other cards). Also a fan of Blackman's work it was nice to see so many prints in the room and in the public spaces - also the quirky use of the rabbit cut-outs here and there. Would stay again. For the taxi, the hotel is actually on Arthur street not St. Kilda road.", "title": "Excellence All Around", "user": "CanOz11", "date": "September 6, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 78554199}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled on business", "text": "What a hotel at a fantastic hotel - i would say it is 4 star ammeneties but 5 star fit out. Everything you could want from a hotel apart from a pool/spa. When we arrived we were upgraded from a deluxe room to the alice suite on the 17th floor. A one bedroom suite with seperate lounge,kitchenette and two balconies with amazing views of the bay/st kilda and beyond. The room is decorated beautifully although a little glam fro my personal taste with wifi and 42 inch giant plasma and designer furniture. Beds are the best i have slept in, like another reviewer has said \"Cloud like\", bathroom was lovely with spa bath and monsoon shower plus all the usual toileteries and fluffy bathrobes, slippers ect. We got the suite for a cracking rate and a bottle of champers and late 1pm check out thrown in. I will look no further than the blackman but if i were unabale to get a room there i would also check out there other hotels the cullen or olsen or probably the Hyatt as the rooms there have been refurbished in recent times.", "title": "BEAUTIFUL BLACKMAN", "helpfulness": 2, "user": "phukdesign", "date": "October 5, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 82236775}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "Foot steps away from the trams, just on the edge of the CBD about a 5minute tram ride. lovely staff, courteous mindful and friendly. quick swift check in. clean rooms, comfortable, and inviting.", "title": "Just a touch from CBD, far enough for a sweet sleep close enough to walk", "user": "cultureseacher", "date": "October 1, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 81689446}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled solo", "text": "All amenities on site. small kitchen with EVERYTHING. loved the view from the balcony, and we got the cheapest room!!", "title": "Really, Very Good", "user": "winks72", "date": "September 28, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 81406570}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "Loved that we could be far enough away from it all, felt like going back to a home. house keeping were spot on, mindful of our items, and made the room look like a brand new check in.", "title": "Like sleeping on clouds", "user": "ElHaych", "date": "September 26, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 3.0}, "id": 81033630}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled on business", "text": "Have decided this series of hotel is the only one i will stay in. Best location, roomy, trendy, parking on site, parking free on weekends on the street, car rental from hotel, bicycle rental. Only thing is, no breakfast included, however its Melbourne... lose yourself in the alleyways!", "title": "Delightful Stay", "user": "DinkumMackay", "date": "September 25, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 80913342}, {"rating": 4.0, "title": "The Perfect Melbourne \"Bolt Hole\"", "text": "Having searched Tripadvisor for ages to find a decent hotel for a Melbourne weekend without breaking the bank - we settled on The Blackman ,one of the newish Art Series Hotels, on St Kilda's road . The room we had was the cheapest balcony studio and although it was a tad on the small side it really was superbly appointed with a huge bed, quality fittings, ipod dock and a large LCD HDD TV screen, the bathroom was small but well appointed and had a great walk in shower (no bath) and a small kitchenette area for longer stays. WifFi/Broadband was $9 a day in room. The lovely balcony with table and chairs had views across the city and was perfect to sit on with a glass of wine at the end of the day. We did a number of long trips so getting up early and watching the sun rise from one's bed was a little luxury. We got a deal online at $169 a night and at this price the room was amazing value. Most other hotels I looked at of equal quality were well into the $200's easily. Location wise The Blackman is well situated as it sits almost halfway between the City and St Kilda's and the Tram is right outside. We didn't use it as we had a hire car - and there is secure parking directly under the hotel. This was $20 a night which is a tad on the expensive side but fantastically convenient. If I had one gripe about the hotel - it would be that the food is a tad average.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "October 24, 2010", "id": 84699964}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled with friends", "text": "I stayed for a weekend and loved it. Already booked my next stay in January.", "title": "Easily the Best Hotel Experience", "helpfulness": 2, "user": "tictok", "date": "October 24, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 84589232}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled on business", "text": "Classy features and fittings and lovely art peices. Easily the most comfortable bed I've slept in. The reception staff are very helpful with great tips for eating out on Lygon Street. What a weekend, great Melbourne food, great stay and service. And an easy walk to Federation Square. Breakfast at the Fleur Depot de Pain was a really nice. I look forward to coming back to Melbourne and the Blackman Hotel", "title": "This place makes my heart happy", "helpfulness": 2, "user": "pixieloz85", "date": "October 21, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 84281965}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "Absolutely loved The Blackman.", "title": "The service and attention to detail made for a magical experience", "helpfulness": 2, "user": "skyerush", "date": "October 19, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 84143268}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled on business", "text": "Its a unique hotel on St Kilda road. Rooms were immaculate, staff were friendly and very helpful.", "title": "Excellent Brand new hotel..excellent staff, amazing rooms", "helpfulness": 1, "user": "sydsam", "date": "October 19, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 84025628}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled solo", "text": "This is the second time I've stayed at the Blackman. This time however I spent nearly two weeks there to recuperate after having surgery at the Royal Woman's Hospital (to ensure I had adequate rest away from the house & kids!). I was upgraded from a studio to a deluxe studio, which was much appreciated. The staff were friendly & always helpful. The room as always, was lovely, clean & modern. Love love love the Depot de Pain downstairs, and even though the room enables one to self cater (good sized fridge, microwave, cook top etc) I really enjoyed my daily brunches or lunch there. Thank you Blackman Hotel for a wonderful & relaxing stay during my recent convalescence!", "title": "A wonderful stay & a great place to recuperate!!", "helpfulness": 1, "user": "ashjoel", "date": "June 5, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 111687030}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "From the excellent staff when checking in, to the well appointed, stylish room with the most comfortable bed that I have EVER slept in when away from home, the yummy food in the french bakery/cafe, yet again professional desk staff when checking out, to the central location of the hotel in regard to getting out and about in Melbourne, The Blackman Hotel has it all.", "title": "fantastic and they will see us again", "user": "cwitana", "date": "June 5, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 5.0, "service": 4.0}, "id": 111674516}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "Cannot fail to impress the most jaded traveller, well worth a visit and a gem that I will be passing on to my friends.", "title": "Absolutely fantastic", "user": "muncher67", "date": "June 5, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 111664710}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "Great visit, couldnt be happier with the hotel, beds very comfortable", "title": "Lovely, friendly and memorable!", "user": "DanielV_3136", "date": "June 5, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 111526428}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled on business", "text": "From the moment my wife and I entered The Blackman, we were met with excellent design, high maintenance quality and great customer service. Our room was surprisingly spacious, with excellent use of mirrors to expand the apparent space. The bed was an absolute winner in terms of space and comfort.", "title": "Really lovely", "helpfulness": 1, "user": "TonWin", "date": "June 4, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 4.0}, "id": 111392943}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "The Blackman is excellent, stayed at the Cullen previously and this is just as good. Love the ambience, decoration and the fact that you feel as if you've been to an exhibition of the artist's work and slept over! Super comfy beds, quiet, spotless, all just great.", "title": "Love the Art Series", "helpfulness": 1, "user": "albertst", "date": "June 4, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 3.0, "service": 3.0}, "id": 111383006}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "Stayed @ the Blackman for couple of nights, in the studio room", "title": "Very Good place to stay in St Kilda", "user": "Jestress", "date": "June 2, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 4.0}, "id": 111041702}, {"rating": 5.0, "stay_parameters": "Stayed April 2011", "text": "Mostly positive experience: modern, clean rooms, great design, nice bed linen, big TV, T2 tea, decent food from room service.", "title": "Great modern hotel, just a quick tram ride from the city.", "helpfulness": 1, "user": "Luckow", "date": "May 27, 2011", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 110057795}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled on business", "text": "Just couple of small things to watch out for:", "title": "Awesome and unusual", "helpfulness": 1, "user": "Shaundra", "date": "May 24, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 109710192}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "Avoid rooms on lower levels, otherwise you get face to face with people from buildings across the lane (the buildings are very close to each other). The balcony is useless for the same reason.", "title": "Had a great experience", "user": "LaraJ73", "date": "May 22, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 109382453}, {"rating": 3.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "A lovely room with views across Albert Park lake, but slight lack of atmosphere - more like serviced apartments than a hotel. Was not impressed with the lobby area. Staff at check-in and departure were OK, but not overly friendly or helpful. Its located between the city and St. Kilda. Trams were handy on St. Kilda rd. Not much within walking distance. Nice coffee in the cafe next to the lobby.", "title": "Quite good, could be better", "helpfulness": 1, "user": "CiaraB", "date": "June 14, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 3.0, "value": 2.0, "service": 2.0}, "id": 113391402}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "We spent three wonderful nights at The Blackman. We have stayed in many beautiful hotel all over the world, but this was an experience! The rooms were huge with 2 balconies.", "title": "FANTASTIC!", "user": "mxtoronto", "date": "June 13, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 113315660}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "The artwork in the room was spectacular! Edgy and very different! The door to the bathroom was a floor to ceiling painting! The bed was heavern!!! The hotel staff was the most accomodating of any hotel that we have ever stayed in. We did not want to leave! The hotel is out of the city center, but it was well worth the short tram/cab ride in. And there are many excellent restaurants in the area to choose from. Be sure to have breakfast at the authentic French patisserie", "title": "Gorgeous, stylish and fun!!", "user": "cherryred55", "date": "June 13, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 5.0, "value": 3.0, "service": 4.0}, "id": 113297930}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "I recently stayed at the Blackman with my mum and my sister for a girls weekend away, and can I say we loved it!!! The room we had was super stylish and suited our needs perfectly, being 6 months pregnant the beds were amongst the best and most comfortable I have ever stayed in. The only complaints I have to make was the lack of milk upon arrival in the room, which was promptly rectified and the very limited room service avaliable particularly for my sister who is a coeliac. Overall a very nice location, lovely contemporary styling with a very handy tram stop directly opposite to the city.", "title": "Great place to stay", "user": "rawpine", "date": "June 13, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 113033640}, {"rating": 5.0, "stay_parameters": "Stayed June 2011", "text": "Spent 2 nights in a standard room and found it very comfortable. Nicely furnished and plenty of space in the room and a great location for access to the city with trams at the door. Station du Pain was excellent for breakfast and a bit different t the usual hotel fare. Overall a very pleasant stay.", "title": "The best hotel in melbourne", "user": "Andybtravel", "date": "June 12, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 112977272}, {"rating": 3.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "Booking service was just ordinary, a poor start to our weekend. Hotel lacks the friendliness of city hotels and treated me with indifference.", "title": "Very average, not for me again.", "helpfulness": 1, "user": "regularguy55", "date": "June 9, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 3.0, "value": 1.0, "service": 2.0}, "id": 112496404}, {"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled with family", "text": "Stayed with the family for 5 nights. Reception service varied depending on who was on. The females were fantastic but the males sadly unhelpful. I can understand the mixed reviews. Room set up superb. Linen was not changed during our stay.", "title": "Perfect. On the tram line", "helpfulness": 1, "user": "Under_fifty", "date": "June 9, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 4.0, "value": 5.0, "service": 3.0}, "id": 112356527}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "I just spent another night at an Art Series hotel. Hadn't tried The Blackman yet, as I am more of a Cullen regular. Blackman did not disappoint. Slightly more \"business-focused\" given location on the prime St. Kilda strip. Was on the 10th floor studio with balcony. Love the bed. Love the kitchenette and full-size fridge. Love the art work. Service is casual yet professional. Had lunch at Classico - excellent, authentic, reasonably priced Italian. Depot de Pain is everything a coffee shop/bakery should be. All in all, another excellent Art Series hotel.", "title": "Art Series are the best hotels in Oz. I hope they take this brand international. It works.", "user": "m2010x", "date": "June 9, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 112355968}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled on business", "text": "We stayed at The Blackman for 4 nights, booked via their website. We had a room on the 9th floor with a great view. The room had a small studio sized kitchen with a fride and micorwave, so great if we wanted to just chill out in the room and get takeaway. The hotel also has two restaurants, a french patisserie/coffee house and an Italian, both excellent. This hotel was a breeze, cleaning delivered on time, staff very helpful and friendly, easy access into town with the tram stop being close by, confortable bed, great shower room. The only thing that I did find a bit odd was the position of the TV....not opposite the bed, not a deal breaker though.", "title": "***Loving the Art***", "helpfulness": 2, "user": "travelgirl2106", "date": "June 8, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 112195613}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "Stayed for three nights at The Blackman....everything was fantastic! Checkin staff were friendly and helpful, the room was gorgeous, so many unique touches. The mini kitchen was amazing..although we only made tea and coffee. I think the bed was the most comfortable I've ever had in a hotel. It was great having a balcony and being able to open a door to get fresh air. We had breakfast in the cafe downstairs every morning - fantastic quality, value and service.", "title": "Loved everything about it", "helpfulness": 1, "user": "Louie67", "date": "June 7, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 112100062}], "location": {"country": "Australia", "continent": "South Pacific", "city": "Melbourne"}, "stars": 5, "variance": {"poor": 15, "average": 63, "very good": 221, "terrible": 17, "excellent": 652}, "aka": "Art Series - The Blackman Hotel", "slim_ranking": 0.0280898876404, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "With a contemporary, boutique interior and an enviable St Kilda Road location, just a stones throw from Melbourne’s CBD, The Blackman Hotel will inspire Melbourne’s imagination. A destination perfect for business or leisure travellers, this unique Melbourne hotel boasts 209 guest accommodations and suites, a selection of which host private terraces.Built within and above the historic Airlie Mansion, The Blackman Hotel will charm and inspire guests with the works of one of Australia’s most celebrated artists, Charles Blackman, showcased throughout this unique hotel space.The Blackman Hotel is also dedicated to ensuring your visit to Melbourne is complete with dining options to tempt your tastebuds. Experience two of Melbourne’s hottest new restaurants right at your own doorstop. Couple this with our state-of-art gymnasium and your luxurious five-star experience is complete."}