{"user_rating": 4.0, "review_count": 171, "name": "Art Hotel Commercianti", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed May 2005", "text": "The location is outstanding, next to the centre of town, walking distance to almost everything. They provide bicycles if you want to get away further. The hotel has a great breakfast but no restaurant on site. There are lots of places to eat nearby. The room is modern (has A/C) but the hotel is historic. The staff are excellent and helpful. There is computer in the lobby for internet use and printing which is free to use. Would highly recommend this hotel.", "title": "The hotel is great!", "user": "MarianaG", "date": "June 7, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3535268}, {"rating": 4.0, "stay_parameters": "Stayed August 2004", "text": "I stayed at the Commercianti for a night in August 2004 - and I must say I was impressed. I am not a fan of any hotel that resembles anything corporate but I found the staff perfectly warm and friendly and prepared to help a single girl who had never gone to Bologna before a decent restaurant to eat in. I was charged a very good rate 100 euros for the night including breakfast for a large room, single occupancy. The breakfast was impressive and the hotel was perfectly located. I would stay here a again without a doubt.", "title": "A Good Hotel perfectly located in Bologna", "helpfulness": 5, "user": "Lots66", "date": "March 24, 2005", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 3298540}, {"rating": 3.0, "title": "A Good Place to start...", "text": "The Commericianti has a unique problem faced by non-generic hotels; you either love them or loathe them. An example of what I mean being that I was on the third floor where the room was light and airy - my friend had a second floor room where the medieval beams where too low for her head. That's the kind of place it is. You'll wither marvel at the history surrounding you, or pine for something glass-fronted and souless...", "helpfulness": 8, "user": "mixip", "date": "March 16, 2005", "id": 3277689}, {"rating": 4.0, "stay_parameters": "Stayed August 2004", "text": "I must say that I found the hotel to be adequate in most respects so pro's and cons';", "title": "Great location and nicely appointed, but not cheap", "helpfulness": 5, "user": "AshesToProveIt", "date": "September 6, 2004", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 5.0, "service": 4.0}, "id": 2515503}, {"rating": 3.0, "title": "Great location - not the best hotel", "text": "PROS; 1) If you've never been to Bologna before, this is a great place to start. It's on the main piazza, and everything for the weekend traveller is within very easy walking distance.", "helpfulness": 9, "user": "A TripAdvisor user", "date": "August 18, 2004", "id": 2458632}], "location": {"country": "Italy", "region": "Emilia-Romagna", "continent": "Europe"}, "stars": 4, "variance": {"poor": 3, "average": 19, "very good": 71, "terrible": 5, "excellent": 73}, "aka": "Art Hotel Bologna", "slim_ranking": 0.205607476636, "description": "Small hotel in city center set in early 13th century structure blending modern furnishings & amenities with old world charm."}