{"user_rating": 4.0, "review_count": 89, "name": "Ascott Mayfair", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed February 2008, traveled on business", "text": "Lovely helpful staff, pleasant reception area with bowls of red apples and an honesty bar. Booked 1 bedroom apartment - for up to 4 people. 1bedroom and a bed settee in sitting room. Funtional kitchenette - well equipped. Dining area with beautiful orchid on table.Large comfortable bed,lovely towels and waffle robe. Continental buffet breakfast plus can boil eggs.Situated round the corner from the Dorchester Hotel. Only criticism is that the bathroom while adequate, is in my opinion, due for a refurbishment. Shower difficult to control.", "title": "Comfortable in London Mayfair", "helpfulness": 1, "user": "fairdealHartlepoolUk", "date": "February 29, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 13925708, "likes": {"liked": "— Easy atmosphere. lovely staff, comfort of apartment", "disliked": "— bathroom"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled on business", "text": "This is by far the best kept secret in London. We stayed for a month at this amazing apartment-style hotel in Mayfair London and cried when we had to leave. The staff is lovely, the hotel is relaxing and the location can not be better.", "title": "Best Kept Secret in London", "helpfulness": 3, "user": "BizTVL", "date": "December 27, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 12001027, "likes": {"liked": "— Layout of the rooms", "disliked": "— Nothing"}}, {"rating": 1.0, "stay_parameters": "Stayed November 2007, traveled on business", "text": "Our suite was well appointed with everything you would ever need ... we could live in this place!", "title": "Has gone downhill fast!", "helpfulness": 1, "user": "businesswoman1", "date": "November 24, 2007", "detail_rating": {"front_desk": 1.0, "business": 3.0, "service": 2.0, "cleanliness": 2.0, "value": 1.0, "location": 3.0, "rooms": 2.0}, "id": 11021054, "likes": {"liked": "— Location and option to prepare some meals", "disliked": "— Cleanliness and service"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled with family", "text": "Give it a try, we found that the rates were very good, worth every penny!", "title": "Plenty of room, great price", "helpfulness": 2, "user": "Pharmamom", "date": "November 1, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 10522054, "likes": {"liked": "— Price and Size of apartment", "disliked": "— Front desk staff"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "A year ago, I had a great experience at the Ascott. This year was anything but. The front desk staff were incompetent, at best, and I thought dismissed my concerns in part because I was a woman travelling alone. After seeing three rooms either at street level and/or full of cigarette smoke, I finally agreed to stay one night in the third, with the understanding that I would be moved to another room the next day. I was assured that this new room would have a dining table and be non-smoking. Neither was true. Basically, they lied. The hotel was full, so switching to yet another room was not possible (I had had it by then anyhow). The rugs were badly spotted, the duvet was well past its toss-by date, the shower sometimes worked and sometimes didn't, the kitchen was ill-equipped and some of the dishes not clean, and I was aghast to discover they charged for teabags and biscuits provided in the room--these routinely are complimentary in even the cheapest British hotel! The staff in the breakfast room appeared to be equally incompetent, claiming that the coffee/hot water machine was broken and would not work \"for several days,\" but making no attempt to provide an alternative. Another member of the staff later fixed this \"broken\" machine in about 10 seconds. This has gone from a classy, clean, well-appointed and pleasant apartment hotel to a dump.", "title": "Great Location", "user": "DallasCPSmom", "date": "August 20, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 8460058, "likes": {"liked": "— Room Size and Location", "disliked": "— Sub-par Air Conditioning, Inconsistent Water Temperature in Shower"}}, {"rating": 3.0, "stay_parameters": "Stayed March 2007", "text": "Pros: Location, kitchen facilities, room sizes, clean-ish, free internet, privacy, quiet.", "title": "Reasonable", "user": "AlvinGB", "date": "June 18, 2007", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 2.0, "cleanliness": 3.0, "value": 3.0, "location": 3.0, "rooms": 2.0}, "id": 7871970}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled with family", "text": "Cons: Very hard beds, a little worn, poor aircon, no hotel switchboard", "title": "A+ at the Ascott!", "helpfulness": 2, "user": "AFBT", "date": "December 1, 2006", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 6313035, "likes": {"liked": "— Relaxing atmosphere", "disliked": "— Hard bed"}}], "location": {"country": "United Kingdom (UK)", "continent": "Europe", "city": "London"}, "stars": 4.5, "variance": {"poor": 9, "average": 11, "very good": 29, "terrible": 8, "excellent": 32}, "aka": "Ascott Mayfair Hotel", "slim_ranking": 0.564126394052, "description": "Operated by the world's leading serviced residence company - The Ascott Limited - experience luxury and ultimate service while residing in Mayfair, London's most exclusive district. Surrounded by museums, stylish restaurants and grand theatres, you can relax and enjoy the sophistication of these boutique accommodations while on business travel or a weekend retreat. The 1920s Art Deco building combines all the comforts and amenities of home with an extensive range of facilities and personalised services. Enjoy the best of London while indulging in the spacious comfort of a luxury London serviced apartment. Choice of Serviced Residence Designed and furnished to reflect the sophistication of the Art Deco period, the apartment sizes range from studios residences to expansive three-bedroom suites. Each apartment has a fully-equipped kitchen and optional separate living area. They are ideal for those who desire spacious comfort when on business trips and leisure vacations. Ideal Location: Guests staying at the Ascott’s London serviced apartments are within walking distance or a short journey from many of the most popular attractions and shopping areas. The rich vibrancy of the city, highlighted through the various museums, opera and dining locations, are just at our doorsteps. Spacious Comfort & Personalised Service: Experience the exceptional services you desire and the benefits of exclusive luxury accommodation in London. Breakfast leisurely in The Terrace while viewing the gardens and unwind with cocktails at The Club Lounge. You can relax in the comfort and security of your own private apartment. 24-Hour reception, Board room, Broadband Internet access, 6-day maid service (excluding Sundays), Fitness centre, Grocery shopping services, Laundry & dry cleaning services, Room service from external restaurants, Steam & sauna room."}