{"user_rating": 4.5, "review_count": 500, "name": "Ashdown Park Hotel & Country Club", "reviews": [{"rating": 1.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "I've just returned from an evening's stay at the Ashdown Park Hotel, which was supposed to be a quiet weekend of relaxation to celebrate an anniversary with my girlfriend. I so wish I'd read the reviews here first.", "title": "Oh dear - avoid weekends", "helpfulness": 1, "user": "BillyCTravel", "date": "October 12, 2009", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "location": 4.0, "service": 2.0, "rooms": 3.0}, "id": 46624269}, {"rating": 1.0, "title": "shambles", "text": "I'd chosen the Romantic Getaway package that was advertised on the APH website, and had chosen to upgrade this to a room with a park view. I'm well aware of the Ashdown Park Hotel, and have many friends and family that have visited over the years. I booked our stay a month in advance, and was looking forward to springing the surprise.", "helpfulness": 1, "user": "SQUIRMA", "date": "October 4, 2009", "id": 45804961}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "Things started to go wrong as soon as we checked in. Despite having booked weeks in advance, and with a package that included dinner - I was only offered a seating at 10pm. I was amazed! \"Is that okay sir?\". \"If that's all you can offer me, it will have to do\".", "title": "A very nice weekend", "helpfulness": 2, "user": "frequentholidayers", "date": "September 30, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 4.0, "service": 4.0, "rooms": 5.0}, "id": 45491490}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled with family", "text": "I can't really fault the room or the dinner much, both were perfectly pleasant. I will say that if room 88 is their idea of a Parkland View, then a few trees neither constitutes a park, or a view. Dinner was pleasant, but nothing spectacular; our late seating meant that we weren't allowed to enjoy the dining room's pianist for the entirity, he obviously finished his shift and went home. I was litterally also only offerred the scraps from the cheese trolley too.", "title": "Good, but more attention to detail needed.", "user": "gribblewok", "date": "September 26, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 44644957}, {"rating": 1.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "Breakfast was the real joke though. Once we were seated, and given toast and coffee, we started to queue for our breakfast. This in itself is pathetic - a four star hotel, where you have to queue for breakfast. We gave up, returning to our now cold coffee and toast. We tried later, and were successful... but the breakfast was cold, with small portions. A very unsatisfying experience. All the guests queuing were clearly not happy.", "title": "Unnecessarily pretentious", "helpfulness": 1, "user": "misssilvester", "date": "September 25, 2009", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "location": 4.0, "service": 1.0}, "id": 44330635}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled with friends", "text": "Myself and a friend stayed at Ashdown Park for one night, on their Spa Pamper package, which turned out to be amazing value. We had a one bedroom suite overlooking park land with gorgeous views. The bedroom was clean, well appointed with a luxurious bathroom full of Molton Brown products and fluffy white towels and robes. The spa itself included everything you expect, as well as a wonderful complimentary facial. This was followed by afternoon tea - also included with the room rate - with a delicious selection of cakes. However, the highlight of the stay was dinner at the hotel restaurant, where we had 3 delicious course and a glass of champagne in the drawing room next door. The service was impeccable, and nothing was too much trouble. The following morning we went for a long walk around the grounds and explored the different gardens, followed by a good quality breakfast with lovely herby sausages and unlimited continental fare from the buffet. Overall, a relaxing night's stay in lovely surroundings.", "title": "Splendid luxury - should be 5*", "user": "gingerwife", "date": "September 6, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 39927767}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "Lovely country house surrounded by a large country estate. Good quality accommodation, with helpful friendly staff, and an excellent restaurant.", "title": "Excellent country house hotel", "user": "AHInes3", "date": "September 2, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 39599302}, {"rating": 1.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "Having stayed before my partner booked a break for my 51st Birthday. She made a point of asking for a specific window table and champagne on ice. She even saw the waiter write the details in the reservations book.", "title": "Truly Awful", "helpfulness": 1, "user": "Davescat", "date": "September 2, 2009", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 5.0, "service": 1.0, "rooms": 3.0}, "id": 39582695}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "We sat in the lounge drinking aperitifs with other couples and went into the restaurant only to be seated at the worst table in the restaurant. An older and more \"affluent looking\" couple were at the table we reserved.", "title": "Surprise 80th birthday party", "user": "mghEastSussex", "date": "September 2, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 39539828}, {"rating": 2.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "a complaint brought complete indifference, nay even worse, we were treated like leapers after complaining by the restaurant manager, who fussed over the \"affluent couple\" all evening. Obviously saw them as bigger tippers!", "title": "beautiful location, poor food service", "helpfulness": 2, "user": "sparklehorse11", "date": "August 27, 2009", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 5.0, "service": 2.0, "rooms": 2.0}, "id": 38943367}, {"rating": 4.0, "stay_parameters": "Stayed February 2010, traveled with family", "text": "We (family with 2 boys aged 8 & 11) stayed 5 nights over February half term. We had room 23, a large comfortable 2-room suite overlooking the gardens, lake and forest. We enjoyed the pool, the extensive grounds and the food (alternating each night between the formal restaurant and by the log fire in the drawing room). Breakfast was an excellent buffet of hot English breakfast and fruit, breads and cereals. The evening meal was varied each night and there was something good for all ages. The extensive wine list was excellent. The indoor pool (a short walk to the country club) was large and we swam everyday. I used the well equiped gym and running trails. The staff was happy, super friendly and always ready to help. During our stay we visited the Ashdown Forest, Wakehurst Place, the Bluebell Railway and Sheffield Park Gardens, all a short drive away. I would recommend this hotel as a great base to visit the local gardens and houses.", "title": "Excellent break in 200 acres of Ashdown Forest", "user": "Traveller118", "date": "February 21, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 56663176}, {"rating": 1.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "We booked a romantic weekend away at the ashdown park hotel, the total stay including dinner was £365 so you expect it to be a little special", "title": "Overpriced hotel", "user": "noopster88", "date": "February 18, 2010", "detail_rating": {"service": 1.0, "cleanliness": 2.0, "value": 1.0, "sleep": 2.0, "rooms": 1.0, "location": 5.0}, "id": 56338648}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "The rooms are very dated and so is the decor, the waiting staff were short staffed so we had to keep asking where are dinner was and at breakfast we asked for coffee and tea five times.", "title": "Wonderful hotel for a relaxing break", "user": "lchallice", "date": "February 15, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 56021529}, {"rating": 4.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "The food was below average standard and we were asked how are dinner was we said ok, we were greeted with a response which basically meant he could not care less if we enjoyed our dinner or not", "title": "Luxurious location and very relaxing", "user": "MUHH57", "date": "February 12, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 55804231}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "The ambience is very old fashioned and the place needs cheering up a bit.", "title": "Don't go there - we want to keep it to ourselves!!", "user": "trekkinglovers", "date": "February 9, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 55587641}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "I've just come back from a wonderful stay at this hotel - a surprise birthday weekend for my husband. From start to finish it couldn't be faulted (and I'm a picky guest!). The reception staff went out of their way to get me a lovely room with a view (Executive), made me aware of the special offers,and ensured I got the dinner reservation time I wanted. On arrival we got a very warm welcome, the bellboy was knowledgeable and enthusiastic about the history of the stunning building - used to be a convent, complete with chapel - they have done a fabulous restoration. Dinner was superb and the waiting staff appropriately attentive. We walked in the grounds the following day, amidst a herd of deer, explored the secret garden and woodland trails. My husband would have had a game of golf too had it not been for the wetness of the ground (the thaw had begun). All in all a hugely memorable experience and comes highly recommended.", "title": "Beautiful hotel and grounds - and world class service", "helpfulness": 3, "user": "Sheredah", "date": "January 20, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 53950532}, {"rating": 3.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "I booked a room with a view but it was tiny. Any smaller and I would be asking for a refund. The bathroom was the size of something from holiday inn, maybe smaller. I did ask if they had anything bigger and after lots of umming and errring they suggested another room without a view. Slightly bigger but still the holiday inn bathroom so we stayed put.", "title": "So nearly what it tries to be", "helpfulness": 1, "user": "Uuug", "date": "January 4, 2010", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 1.0}, "id": 52598699}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled with family", "text": "The Maitre d' seemed to be slightly flummoxed by us collecting our breakfast from the buffet before sitting down, as it was on the way to our table. Likewise for dinner after we had ordered they didnt want us to take our dining seats until they had fetched the wine. Im all for ceremony but if I ask to sit at my table I expect to be seated not sent back for thirty seconds so they can follow protocol.", "title": "Nearly - but not quite - perfect", "helpfulness": 2, "user": "Queensparker", "date": "December 30, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 52192974}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "Other bad points:", "title": "First Class Break", "helpfulness": 2, "user": "xxxxyyyy", "date": "October 27, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 47926856}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "The radiator made a whooshing noise all night.", "title": "I Wish We Could Have Stayed Longer", "helpfulness": 2, "user": "MickmanLondon", "date": "October 14, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 3.0}, "id": 46826344}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "stars": 4, "variance": {"poor": 26, "average": 57, "very good": 126, "terrible": 14, "excellent": 277}, "aka": "Ashdown Park Hotel And Country Club", "slim_ranking": 1.0}