{"user_rating": 4.0, "review_count": 427, "name": "Ashworth by the Sea", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "My husband and I along with another couple stayed April 13-14 at Ashworth by the Sea, our first time staying there. It was also our first time staying at Hampton Beach, and after researching on Trip Advisor (and once again the reviews were spot on), we chose this nice hotel. We wanted a place within walking distance to the attractions especially the Casino Ballroom since we had tickets to see the band America who were playing there that night (they were excellent!). The location is awesome, right across the street from the ocean, the staff is so friendly and efficient, and it's very clean. For lunch we had some appetizers in their Breakers restaurant and also ate dinner there that evening, and we had breakfast the next morning in the Wharfside Cafe, all very good. The wait staff were so friendly, and service was great.", "title": "Great location, friendly staff", "user": "SuzanneE", "date": "April 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 158361149}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with friends", "text": "Our room was clean, fairly small, and we got a good off-season rate, but the walls were thin where we could hear a lot of noise from others in surrounding rooms.", "title": "Ashworth Rocks!!!", "user": "Sarah N", "date": "April 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 158326828}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with friends", "text": "All in all, Ashworth was a great find, and we would not hesitate to stay there again the next time we are in the Hampton Beach area.", "title": "Perfect in every way", "user": "Linihan", "date": "April 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 157679938}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "I stayed with a group of friends there last weekend and we had an absolute blast! From the guy who came out and drove my car to the parking place to the random employees I dealt with while there, they were all awesome!!! It was the off season, but you'd never know it. The place was sold out-packed and I couldn't possibly come up with a bad thing to say about the place! We stayed in the summer cottage. It was beautiful, well stocked, and super comfortable. I'd recommend anyone stay there. Whether you stay in the hotel or the cottage, you will have fun for sure. Super helpful employees all over to help you with whatever your needs may be!", "title": "Best place to stay at Hampton Beach", "helpfulness": 1, "user": "John S", "date": "April 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 157207346}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "This was our first time to Hampton Beach and we were there to enjoy a concert for the weekend. It was important that the room be right because there were 4 of us sharing and it was. We all loved it and the beach in the morning was beautiful and sunny and warm. Couldn't have asked for more. Everyone from the Valet boys to the front desk were very welcoming and eager to please.", "title": "A great place to stay!", "user": "Kimberly W", "date": "March 30, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 156067391}, {"rating": 4.0, "title": "Great service, awesome place to stay", "text": "Loved the kindness and professionalism of your front desk staff. We especially enjoyed Thalia and Liz at the Wharfside Coffee shop. The food was amazing, especially the Cinnamon bun pancakes. They really added to our stay and were so welcoming. We highly recommend a stop to the coffee shop. A trip to the Ashworth in the winter is also a great idea.", "user": "Clarkohana", "date": "February 24, 2013", "id": 152984358}, {"rating": 5.0, "title": "A 5 star stay", "text": "My husband and I stayed at the Ashworth on one of their romantic weekends. Upon arriving we were greeted with a bucket filled with a bottle of champagne and two flutes along with a single red rose, so we were off to a good start. The package also came with two dinners in their restaurant. Both entrees were delicious and the desserts were fantastic. The rooms were very clean and the employees were helpful and efficient.", "user": "CharleenD", "date": "February 24, 2013", "id": 152960102}, {"rating": 4.0, "title": "Very nice place; extremely friendly staff", "text": "My husband and I spent our third New Years Eve there in the ballroom. The food was great; the 7 piece band \"Hush\" is FABULOUS!!! We come from CT every year. We've net some great people and book our table with them each year. It's the best New Years Eve package.", "user": "PandaCT", "date": "January 3, 2013", "id": 148698474}, {"rating": 5.0, "title": "Fantastic Place", "text": "Ashworth is clean and a beautiful place to stay. The staff is so nice and very accommodating. They do everything within their ability to make your stay comfortable and convenient. It is the most enjoyable vacation I have ever had. The food is absolutely delicious, cooked to perfection. The gorgeous view from our room was so very relaxing. My husband and I were there for the New Year's party for our second time. It was fabulous, food, music, all at a great price. If you ever get the opportunity to visit the Ashworth By The Sea in Hampton Beach, NH, please do so. You won't be sorry.", "user": "deeuhl", "date": "January 1, 2013", "id": 148550520}, {"rating": 4.0, "title": "ASHWORTH NEVER DISAPPOINTS", "text": "We have been staying at the Ashworth for quite a few years,it has always been a great hotel.We generally come in the winter and love walking the beach and the town when things quiet down.You can always count on the DJ in the bar ,or there others places to here live music.The people of Hampton Beach are always friendly,the local establishments are aways welcoming. If you come to Hampton Beach check out the Ashworth,you'll never be disappointed.", "user": "frednmo", "date": "December 14, 2012", "id": 147442123}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "Ashworth by the Sea is located on the Hampton Beach strip across the street from the beach. The hotel is divided into North and South towers with a sort of outside deck connecting the two on the outside and ramp connection into restaurant on the inside. Had a good time. Bar was nice, restaurant was good. Great view of the ocean. We had a room mix up, but they cleared it up and got us into a great room. Really great location.", "title": "Beautiful hotel", "user": "Staceykay76", "date": "March 29, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 155975773}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "Ashworth by the Sea is located on the Hampton Beach strip across the street from the beach. The hotel is divided into North and South towers with a sort of outside deck connecting the two on the outside and ramp connection into restaurant on the inside. We stayed in the North tower for two nights during the off-season.", "title": "It's really a 3.0 to 3.5 but a 4 for Hampton Beach", "user": "2havtrav4", "date": "March 17, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 154876874}, {"rating": 2.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "Hotel had free valet parking. Hotel lobby is oddly shaped but well appointed. The front desk staff (make that most of the staff) appear to be quite young but did their jobs cheerfully. There is a pool somewhere in the hotel but we were not informed of it at check in. There is a full service restaurant with bar and a small coffee shop with access from inside and outside the hotel that serves breakfast and lunch. Both have limited menus-not a complaint just an observation. In the off season there isn't much else open on the HB strip.", "title": "A painful review", "helpfulness": 16, "user": "ml13204", "date": "March 3, 2013", "detail_rating": {"service": 1.0, "cleanliness": 5.0, "value": 1.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 153628226}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled with family", "text": "The room had an ocean view. It was very clean with no signs of overuse, has a bathroom with a full tub/shower combination, flat screen TV with cable service, a slightly worn love seat and chair, and a tiny balcony unto which two people can squeeze themselves to sit and catch an ocean breeze. Our room had a king size bed which was comfortable. They provide 5 pillows which are slightly thin. You may need one or two more.", "title": "Always a great stay The Ashworth!", "helpfulness": 1, "user": "Joestrata", "date": "March 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 153539497}, {"rating": 3.0, "stay_parameters": "Stayed June 2012", "text": "The walls are thin. You can hear the muffled (and sometimes not so muffled) conversations of the next door occupants. You can hear street noise however during full season I assume the air conditioner noises will block out both internal and external noise.", "title": "Only stay here if you get a very discounted price.", "helpfulness": 1, "user": "Familyof5onthego", "date": "February 25, 2013", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 5.0, "service": 3.0, "rooms": 4.0}, "id": 153146369}, {"rating": 5.0, "title": "Two day getaway", "text": "My wife and I Went to The Ashworth for a Thursday - Friday getaway through a Groupon reservation. Wonderful Weekend with clean rooms and a great view.The staff was very friendly and accommodating, especially Thalia in the coffee shop and Brenda at the front desk. Friday night dancing was fun. We will definitely return again.", "user": "Thomas C", "date": "December 13, 2012", "id": 147382615}, {"rating": 5.0, "title": "last minute getaway!", "text": "My husband and I stayed for one night in mid-November. The valet helped with the luggage and parking the car. We had a great room looking out on the ocean. The room was big and comfortable with 2 queen beds and imagine a heated bathroom. Beds and pillows were very comfortable.We had dinner and breakfast at the hotel and both were generous servings. The staff provided directions and info and were more than cheerful and accommodating. Can't say enough good things about the Ashworth except that we will defintely be back.", "user": "GeraldineRhodeIsland", "date": "November 26, 2012", "id": 146256793}, {"rating": 5.0, "title": "Weekend Getaway!!", "text": "WOW!! What a great weekend we had!!!", "user": "kimlaugh", "date": "November 22, 2012", "id": 145985073}, {"rating": 5.0, "title": "Great Fall Getaway!", "text": "My husband and I hadn't taken any summer vacation this year and we sure needed a get-a-way!!! We choose Ashworth by the Sea because we wanted to be close to the ocean. WELL we sure were close to the ocean, we had an awesome view. The weather was great, the rooms were clean and tidy.", "user": "massachusetts_home", "date": "November 19, 2012", "id": 145725351}, {"rating": 5.0, "title": "local gem even for the locals \")", "text": "One of the main reasons we choose the Ashworth by the Sea is because they accepted dogs on the off season. We had a great vacation with our cock-a-poo!! We walked on the beach every morning!!!", "user": "AMLacroix", "date": "November 11, 2012", "id": 145194926}], "location": {"country": "United States", "city": "Hampton"}, "stars": 3, "variance": {"poor": 29, "average": 66, "very good": 127, "terrible": 24, "excellent": 181}, "aka": "Ashworth By The Sea Hotel Hampton", "slim_ranking": 0.116279069767, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.5}}