{"user_rating": 4.0, "review_count": 363, "name": "Aspen Suites Bangkok", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled with friends", "text": "This hotel has it all for those looking to feel secure ,comfortable and close to the sky train.Our first time in Bangkok and thanks to TripAdvisor we stayed at Aspen Suites, we had a Jr.suite it had a large bedroom and great living space with a kitchen.a two min walk brings you to great food and lots of evening entertainment.the staff were very helpful and the breakfast was great! Two thumbs up Aspen suites!", "title": "Location,location", "user": "travelbugN_s_", "date": "February 25, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 153140389}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "I first started coming to Aspen when holidaying from the UAE nearly 5 years ago. I haven't stopped coming here. I always find the staff friendly and recently the buffet has been delicious with plenty of choices between Thai dishes and your regular American or British fare. Fried rice, noodles, and phad Thai sit alongside pancakes and toast, so plenty to choose from. The juices are good, too. Try the kiwi. Recently, the coffee has changed and wow...it's awesome. Wish I could remember the name of it.", "title": "Holidaying in Bangkok while in Thailand", "user": "James P", "date": "January 29, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 150902973}, {"rating": 2.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "The rooms are clean and the staff is efficient in helping maintain them on your visit. Perhaps because I now bring my Thai family there, there is a sense of community when the cleaning staff enter the room. I like the personal touch. It's genuine.", "title": "Not as good as I expected it to be...rather disappointed....", "helpfulness": 1, "user": "Cbson", "date": "January 22, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 2.0, "rooms": 3.0, "location": 1.0}, "id": 150245675}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled on business", "text": "The pool is small, but adequate for laps if only one or two people are in it. I took advantage of the gym on my last visit and found it very helpful in kickstarting my days in Bangkok. Running machines are working and the towels are big and clean.", "title": "A good short or long term stay option in Bangkok", "user": "nomad633", "date": "January 21, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 150190323}, {"rating": 3.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "The location is nice as it's near major entertainment venues, but tucked down the soi far enough to be quiet at night.", "title": "average", "helpfulness": 1, "user": "chrrul", "date": "January 11, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 3.0}, "id": 149428669}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled on business", "text": "Very friendly hotel, stayed for 2 weeks at the beginning of October 2012, very central to Sukhumvit and affordable, all the staff were pretty good, the rooms were nicely cleaned and they left me alone when I needed to do work. 3 notable staff were Lek the security guard who went beyond the call of duty to sort out my laundry when I had no time, Yuth the friendly Tuk Tuk driver and Jeab the manager, who was smiley and very polite. Swimming pool was clean as was the entire hotel. A couple of let downs that stopped it from being perfect were that the lift was terribly slow and the food was a bit haphazard, with buffet breakfast just poor. I'm not a big breakfast eater so that didn't trouble me too much. All in all a pleasant stay", "title": "Great Stay", "helpfulness": 1, "user": "Jonny_large", "date": "November 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 146517027}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "We booked this hotel online for a Superior room. Upon arrival at the hotel around 2pm, we were upgraded to a Delux Room which was very huge with all the kitchen,microwave and bath tub and dressing room.", "title": "Value and location plus food ;-)", "user": "Marigoldp", "date": "November 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 146247732}, {"rating": 2.0, "stay_parameters": "Stayed November 2012, traveled on business", "text": "My husband said the property is in a good/quiet location in Soi 2 since he has been in business meetings at the JW Marriott at the entrance of Soi 2 and indeed it was. Though is quite a walk about 5-8 minutes to the road but they have free tuk2 shuttle going to and out of the hotel- just call them 10 minutes before for them to fetch you outside.", "title": "Noisy and a stone's throw from the Nana red light district...", "helpfulness": 1, "user": "Jewels_Gva", "date": "November 17, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 1.0, "rooms": 3.0, "location": 2.0}, "id": 145587528}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled solo", "text": "Water was very splashy and AC works really cool, our room was at the 4th floor and it faces the street. Rooms are very clean and still looks new. Our bed was king size, big and very comfotable. we even requested additional pillows (2) which they gave for free.", "title": "Excellent Hotel and Service", "user": "Bill R", "date": "November 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 145117969}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled with friends", "text": "The ABF is average, though not a big selection to choose from, it would satisfy your morning hunger. They have a variety of juices to choose from too and yogurt as well.", "title": "Good Hotel and Good Staff", "user": "Yuki_kOikOi", "date": "November 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 144981004}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "clean and wonderful desk staff. Two free computers for internet were good. good pool for cooling off at night - not for lounging though. Breakfast appeared good - we are vegetarian though and there wasnt too too much for us. Our room was clean and big. Nothing fancy - but good.", "title": "good for what we needed", "user": "annaoverseas", "date": "January 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 149426755}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "Nice and close to bts and Sukhumvit shopping. It is one block off of Nana Centre BUT you really arent touched by the dirtiness there (Unless you want to be hahah)", "title": "Great rooms. Location Not Great", "user": "ColinX100", "date": "January 11, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 2.0}, "id": 149395884}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled solo", "text": "Food can be expensive in this area (17 percent tax is normal) but its easy to walk everywhere you need to.", "title": "Great People and location", "user": "Michael D", "date": "January 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 149249655}, {"rating": 3.0, "stay_parameters": "Stayed December 2012, traveled with friends", "text": "Well I usually stay at Soi 8 but thought to change to somewhere different. We booked Juniour Suite at Aspen and the room is great, very large 1 bedroom apartment with also separate working desk if you must to some work. fast wifi if you cannot do without the internet, 2 flat screen tvs and nice bed and nice bathroom with shower over bath.", "title": "Just average accommodation !", "helpfulness": 1, "user": "Kendy M", "date": "January 2, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 3.0}, "id": 148569062}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled solo", "text": "It is located a 5-10 minute walk up Sukhumvit Soi 2. The hotel thankfully offers a Tuk Tuk service which can drop you off at the main road and pick you up if you phone reception.", "title": "My #1 hotel for staying in Bangkok!", "user": "Gill_2007", "date": "December 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 148318577}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "Good access to the skytrain, but some way to the river. Yut, the concierge, was very helpful and friendly, as were all the staff. The rooms are very modern and clean. Breakfast is good and restaurant OK too. Just need to watch out for annoying noises - like an intermitent pump, or air con compressors. They changed our room with no fuss however.", "title": "Enjoyable stay!", "user": "Silvers over", "date": "December 21, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 147839791}, {"rating": 2.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "Soi 11 nearby is great for restaurants, bars and clubs. Particularly liked Above 11, a rooftop bar ontop of Fraser Suites on Soi 11. Was surprised to find that Nana (Soi 4) is an 'entertainment' district, but the road Aspen is on is quiet and away from it all.", "title": "Value for money but...", "user": "JiiBird", "date": "December 20, 2012", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 147794832}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled on business", "text": "Helpful staff, comfy beds, good value for money overall.", "title": "Great low cost option in soi 2 surkumvit", "user": "Mark S", "date": "December 16, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 147539911}, {"rating": 4.0, "title": "Very big room, clean and friendly stuff", "text": "I chose this hotel for its spacious rooms (we had like 6 backpacks), central location and good price rate. For the given price and compared to my experiences during a half a year in BKK, it was really a good choice. The rooms were a bit out of date but nice, clean and spacious. The breakfast was included and for that price is was abundant as well. The pool, again, was a bit disappointment: really small, shadows were crawling over it and it was a bit dirty (the first pool I have ever left untouched so far).", "user": "Jani K", "date": "December 14, 2012", "id": 147422489}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "I would have given this place 3 stars due to the price rate but I had one problem which bothered me quite a bit: While booking, I specifically asked for a room with bathtub but noticed upon arrival that even though I had requested it and paid for it, we didn't have it in our room and the front desk couldn't delver it. I needed to go to talk about it multiple times before getting the answer that I would get the room I requested for 4/7 days we stayed there.", "title": "Good hotel and location but get the address", "user": "oaxacaone", "date": "December 5, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 146830184}], "location": {"country": "Thailand", "continent": "Asia"}, "stars": 4, "variance": {"poor": 24, "average": 60, "very good": 140, "terrible": 11, "excellent": 128}, "aka": "Aspen Suites Bangkok Hotel", "slim_ranking": 0.326530612245, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "description": "Trendy city hotel located in a quiet lane just off the bustling Sukhumvit Road and within walking distance to the Nana and Phloenchit BTS Skytrain stations, alternatively, take our free tuk-tuk shuttle service. Also just minutes away are shopping centers, dining and entertainment outlets. Aspen Suites features 59 guestrooms comprising of studios and one bedroom suites. Room amenities include an LCD TV with satellite channels, a fully-equipped kitchenette and more. Hotel facilities include 24-hour reception and security, Aspen Cafe, Internet stations and more."}