{"user_rating": 4.5, "review_count": 1230, "name": "Aston Mahana at Kaanapali", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled with family", "text": "Let me first say WOW! about this property. We stayed here from May 28 - June 4 and everything was perfect. It felt like home and not a couple of rooms.", "title": "The Mahana is awesome!", "helpfulness": 6, "user": "ljthumper", "date": "June 8, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7805030, "likes": {"liked": "— All rooms are oceanfront with a private lanai", "disliked": "— the parking spaces were very tight"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "There were four of us in our party so we had reserved a 2B/2B condo. I had researched extensively on where to stay and this certainly did not disappoint at all.", "title": "Great Place!", "helpfulness": 2, "user": "rynoSanFrancisco", "date": "June 7, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 7803025, "likes": {"liked": "— The view from the room and the quiet peaceful setting.", "disliked": "— Not the BEST beach for swimming. But, you just have to walk a little ways down."}}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled with family", "text": "We were in the Molokai Wing #701. Words can't express how wonderful this unit was. Updated everything with marble counter-tops, a flat screen tv, a 2 person shower in the master and a stocked kitchen that even included a spice rack. Something that I wasn't expecting at all. We rented this directly with the property so it also included daily maid service. We used the Entertainment Book to get a discount of 50% and that just made this place even better.", "title": "Great Views, Good Value But Not For Everyone", "helpfulness": 13, "user": "greenlakegirl", "date": "June 7, 2007", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 7796755, "likes": {"liked": "— Fantastic View, Location", "disliked": "— Old Unit, Small Pool, and Unswimable Beach"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "We had breakfast most mornings on the lanai and walks on the beach afterwards. As has been mentioned before, the beach directly in front is not a swimming beach. However, that didn't detract from it's beauty at all. We just walked south about 150 yards and there was a nice sandy entry. We also snorkeled out there and saw lots of fish.", "title": "Absolutely Wonderful", "helpfulness": 10, "user": "rocknrunner", "date": "May 31, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7726225, "likes": {"liked": "— location and layout", "disliked": "— not a good swimming beach"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "Since this property is all oceanfront, going to sleep with the sound of the waves was wonderful. The other bedroom faces the mountains and also had a wonderful view. We often saw rainbows out the back windows in the late afternoon.", "title": "Absolutely Unbelievable", "helpfulness": 7, "user": "jillmill", "date": "May 31, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7724849, "likes": {"liked": "— It was very quiet and relaxing", "disliked": "— narrow parking spaces"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "After 3 month of research in TA, I decided Mahana unit #1104. I booked through Chase ‘n Rainbows which customer service was very efficient and everything was done in 20 min. An advantage to book directly through owners is you get a room exactly what you want, and a disadvantage is when you arrive, even if you don’t like the room with some reasons, you are stuck with it. I liked the fact that the owners had 3 other units in Mahana and if emergency, I could contact Chase ‘n Rainbows which had a local office in Maui. The unit 1104 was exactly what shown in the pictures. It was very clean, high quality, tasty decoration and very comfortable. I am picky about a bed. The still new king size bed was not too hard and not too soft, very comfy bed. The kitchen had all the basic stuff you need, not for a heavy duty cooking but who wants to do in vacation in hot weather. I recommend checking in the room first and see what the unit has in the kitchen such as salt, paper, coffee, sugar, BBQ spices,… then go to a store. There were 6 beach chairs, 2 of which were high quality ones and we borrowed them every day to beaches. There were also 2 cooler boxes. The refrigerator had an ice maker, so we didn’t’ need to buy ice. When we went to Hana, we took both cooler boxes packed with a salad, bread, lunch ham and drinks we bought from Times and we had a nice lunch at Hana Beach Park. Someone posted about the building repair construction recently, but I didn’t see any construction guys or didn’t hear any noise even in daytime. Also many people posted that Internet connection was not so good in rooms, but I was surprised we didn’t have any problem in our room. I think we had a modem in the room. The dual sinks in bathroom were large enough for two of us and were convenient to get ready in early morning. There was a plenty of bath towels and kitchen towels but not a hair dryer there. There were 2 elevators in each building, which were fast and never crowded. We used a pool and a hot tub, which were never crowded either.", "title": "Exellent Mahana unit 1104", "helpfulness": 10, "user": "kittyboo2011", "date": "October 24, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119648228}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "Tip: You can rent a beach towel through Chase ‘n Rainbows $2/each. It is an oversized blue color and quality is good. We rented 4 and didn’t need to pack our own in our luggage.", "title": "Maui at it's Best", "helpfulness": 2, "user": "Patricia H", "date": "October 23, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119645439}, {"rating": 3.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "We stayed on the Aston Mahana at Kaanapali this past week Oct 18-21, 2011. We stayed in a studio condo unit - it was very nice. Unit #913. Everything in the unit was clean and in perfect working order. The staff was very friendly. Garrett the night desk clerk was very helpful when we needed to send a fax. The concierge Lyn booked several activities for us. Each one she recommended was exactly as she said it would be. The Beach walk ajacent to the property allowed us lovely walks along the shore without sand in the shoes. We had a wonderful trip. The Mahana was really great.", "title": "Paradise at a budget", "helpfulness": 2, "user": "ALJeff", "date": "October 23, 2011", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 119640684}, {"rating": 5.0, "stay_parameters": "Stayed October 2011", "text": "My husband and I stayed at the Mahana for the first half of our trip. Since the location of this resort is in the busier area of Lahaina, we decided to keep the R&R towards the end. The great thing about the Mahana is how genuine and nice the staff is at the resort. Our flight from our hometown was cancelled at the last minute, and we would not be able to fly out until the next day. Since we'd be losing a day, I immediately called the resort to inform them. However, they said we would still be charged for the 4th night. When we finally arrived at the resort the following day, the front-desk personnel informed us they would waive our first night. This is a gesture that they didn't have to do since American Airlines was fully responsible for the cancellation. It's refreshing to know they were kind enough to just charge us for our 3 night stay instead of the original 4 nights.", "title": "Fabulous vacation of a lifetime!", "helpfulness": 2, "user": "Lezahp", "date": "October 16, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 119368307}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "Also, we were upgraded to a 2-bedroom suite since our original booked 1-bedroom was booked. It was nice to have a lot more space. The nice thing about this unit was the new kitchen and the fantastic view. The appliances were upgraded within the past few years. However, they have major issues with bugs all over the unit. We were not able to leave out any pastries or anything since we were afraid of all of it being attacked by unwanted bugs.", "title": "How staying in paradise should be", "helpfulness": 2, "user": "Dwight G", "date": "October 14, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119312455}, {"rating": 3.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "I will caveat this review and say that, before we went here we did not realize these were condos with private owners, not a typical hotel. The rooms have great views, and having the refrigerator, microwave, and Washer Dryer was super useful. The rooms were clean though they looked a little outdated.", "title": "Good for a privately owned condos, average for a hotel.", "helpfulness": 3, "user": "justoneraj", "date": "October 31, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 119920100}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "The thing that bugged us is that as soon as we checked in, we were asked to pay a $10 daily amenities fee. This included refilling of coffee packets in the morning, a daily newspaper, and use of the Safe.", "title": "Outstanding snorkeling", "helpfulness": 2, "user": "Kmryan1985", "date": "October 27, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119778871}, {"rating": 4.0, "title": "Great laidback time in a fabulous setting", "text": "We always use the hotel safe when we travel, and asking for an addiitonal fee to do so was very unexpected. At a typical hotel, these would all be included in the daily charge. We will likely not stay here again.", "helpfulness": 2, "user": "amilkPA", "date": "October 24, 2011", "id": 119689278}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "Other than that, everything was perfectly average, not bad, not great.", "title": "Mahana 301 (2BR/2BATH) WITH PICTURES", "helpfulness": 17, "user": "SnorkelKitty", "date": "October 24, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "location": 5.0, "value": 5.0, "rooms": 5.0}, "id": 119680487}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "P.S. If you are looking for a romantic hotel this is not it. If you are coming with family and want to cook clean in duirng your stay in Maui, it's not a bad option.", "title": "Amazing!", "user": "Tina C", "date": "October 24, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119669844}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "We stayed as guests of a private owner (Room 717) and were wonderfully pleased with our stay. Tip - we definitely recommend booking with a private owner (ie: VRBO) and not through ResortQuest themselves. You'll usually save a little money that way and will know exactly which unit you'll be staying in (rooms all vary). We wanted West Maui location without the overpriced expense of places on Ka'anapali. Lahaina is a quick 10 minute trip to the southeast, which made this a great place to be for our week in Maui. The common facilities themselves are fairly standard. Ample parking, concierge desk, pool, and WiFi that reached our room. Each unit has its own spacious lana'i, directly on the water. The owners of our unit take exceptional care and we were extremely pleased with the creature comforts of home that they provided - kitchen amenities, snorkel gear, plenty of clean towels. The palm trees just about reach the 7th floor, so views of Molokai and Lanai are enhanced by palm fronds. At night, we fell asleep to the crashing of waves beneath us and we found it hard to leave on our last day. Despite not having the best beach at their front door, this is more than made up for by it's proximity to many wonderful beaches nearby.", "title": "Exactly What We Were Looking For", "helpfulness": 2, "user": "MTipper59", "date": "January 26, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 13016008, "likes": {"liked": "— Neat, clean, with touches of home", "disliked": "— Nothing!"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled with family", "text": "Myself, husband (50/52) and my parents (69) were at the Mahana January 12-19 and stayed in unit 1109, rented through owner. I went that route because I wanted to make sure I could see the room online that I was getting and also, their rates were very reasonable for a peak time. Some other 2 bedrooms were much more. Some of those may have granite counters and plasma TV's, but that is not important enough to me, for a week of vacation, to pay a lot extra.", "title": "Awesome views at the Mahana!", "helpfulness": 7, "user": "bingo3", "date": "January 23, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 12934644, "likes": {"liked": "— The view, washer/dryer - didn't have to pack as much, kitchen availability, spaciousness", "disliked": "— I could only stay a week!"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "Our room was VERY spacious, approximately 1400 Sq. feet (don't know exact measurements). The master bedroom had a king bed, two bedside tables, closet, dresser and TV. There was a large picture window/sliding door to the lanai. The bathroom had a separate toilet and shower. The water pressure was excellent. There was a washer/dryer combo between the bathroom and bedroom with a linen closet. There was another large closet with iron, board, vacumn and other items. We also left a styrofoam cooler. Hopefully, others will use it and leave it as well. There was a hairdryer, but I always take my own. We could hear the ocean waves every night, even though we were all the way up to the 11th floor. Very soothing!", "title": "Great Place...Still Felt At Home", "helpfulness": 6, "user": "stlsportsgirl", "date": "January 22, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 12894155, "likes": {"liked": "— Location! It doesn't get better than this!", "disliked": "— Not being able to sleep in since you could hear the waves crashing in the morning....serious problem right!!??"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled with family", "text": "The second bedroom had two twin beds and faced the mountains, also an awesome view. There was a TV in there and dresser, bedside tables. The bathroom had a tub/shower combo. The shower and toilet were also separate from the sink area. There was a linen closet and another closet. It also held beach chairs, boogie board, tennis racket and balls, fins, beach umbrella, and some other things.", "title": "What a GREAT place!", "helpfulness": 5, "user": "mgdriver", "date": "January 21, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 12861261, "likes": {"liked": "— size of room", "disliked": "— construction noise--no fault of facility"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2008, traveled with family", "text": "There was an ample supply of towels in each linen closet and they left 6 large beach towels for the 4 of us.", "title": "Great ocean view", "helpfulness": 4, "user": "katandkel", "date": "January 11, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 12513983, "likes": {"liked": "— Ocean view, large lanai, close to the beach", "disliked": "— Inability to swim in front of the condo"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "The Mahana surpassed our expectations from the moment we stepped foot into our room. The views were unbeatable, true \"oceanfront\" lodging. The private balcony is a plus for private sunsets, sunrises and meals. You can do lots of private things on the balcony! The service at the front desk was great. Great location on the island, easy parking. market, shaved ice, snorkel renting is 5 min walk away. The full kitchen was a great way to save money on food and have more intimate meals without having to worry about getting ready to go out. Easy drive to Lahaina for dining/bars. the beach/ocean right infront of resort isn't the best, but better beaches are a short drive away. Loved our stay and the Mahana and will definitly stay there again when we go back!!", "title": "Loved the Mahana!!!", "helpfulness": 3, "user": "SanFranciscoLishie", "date": "September 6, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8662707, "likes": {"liked": "— Ocean Front Location", "disliked": "— Nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "We stayed at the Mahana August 22nd to September 1st. Our first impression was great...the grounds are neat and the lobby is pretty, especially with the pool and ocean view in the background.", "title": "We had a wonderful time!", "helpfulness": 11, "user": "maui_lovers_07", "date": "September 4, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 5.0, "location": 4.0}, "id": 8656362, "likes": {"liked": "— location and views", "disliked": "— beach"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "We were treated very nicely by all the staff. Our travel agent did specify however, that we wanted a newly renovated room. We weren't given one and didn't like the condo we were shown. We checked another one, which wasn't renovated either and were turned off (we were spending 10 days at the Mahana and wanted to love it). Third time is the charm, as they say. The third and final condo we looked at was lovely and we grabbed it before they changed their minds (814). The staff were very good about letting us look at other condos, so don't settle for something you are uncomfortable in.", "title": "Greatest place in paradise!", "helpfulness": 9, "user": "montiep", "date": "September 4, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8619453, "likes": {"liked": "— Hotel is right on the water, very quite, beautifl views", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "The beach wasn't the greatest, but we drove to several different ones. The Mahana is an excellent base to come back to. Great location, good pool for the kids and nice and quiet with incredible views. We looked at other oceanfront condos before booking, but the ocean views included views of surrounding condos which we didn't want...at the Mahana everyone gets an 'ocean only view ' with a very private lanai...that's the biggest reason we chose the Mahana. Having a pretty condo to stay in was icing on the cake!!", "title": "Amazing time at the Mahana!!", "helpfulness": 8, "user": "cmingee", "date": "September 3, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 8614165, "likes": {"liked": "— Amazing views and hospitality of the staff", "disliked": "— Nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "My husband went to Maui for our 30th. I did lots of research on different places to stay, using Trip Advisor as a source.", "title": "Very comfortable", "helpfulness": 4, "user": "ZeusMonster", "date": "September 1, 2007", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "location": 5.0}, "id": 8603572, "likes": {"liked": "— Awesome view!", "disliked": "— Outdated furniture / carpets"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "We stayed for 14 nights in early November 2011, and coming from the UK (18 hour flight if you don't stopover!) researched pretty thoroughly where to stay. I'm so glad we chose the Mahana, it lived up to all expectations...and then some! Perfectly located right on the beach with amazing views. We saw whales, dolphins and turtles on different days all from the balcony in the morning with breakfast! The kitchen was well stocked, washer,dryer, dishwasher etc all v helpful.", "title": "The right side go Black Rock...", "helpfulness": 4, "user": "Eagles1", "date": "November 23, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 120940345}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "The one thing I was concerned about before the trip was that there was no beach to swim in directly in front of the Mahana. Literally turn left or right and walk 100 metres max and swim away! In fact actually having reef outside the hotel enabled more wildlife and less people to view from the balcony which was a blessing in disguise.", "title": "Great Hotel - Amazing Views, A Great Choice for a longer Stay", "helpfulness": 1, "user": "windsova", "date": "November 22, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 120932018}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "Didn't use the pool at all as we were too busy exploring the island, snorkelling etc and when we did encounter the staff they were very helpful. No restaurant onsite but Dukes next door at Honua Kai is excellent both for food and a cocktail. The Organic Farmers Market store down the road is great for fruit, granola, homemade guacamole etc.....and weirdly a lot cheaper for certain things than Times store across the road (e.g. bottles of mineral water).", "title": "Aloha 2011", "helpfulness": 2, "user": "weigela", "date": "November 11, 2011", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 120465873}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "The walk to Black Rock takes about 20-25 minutes and the path goes alongside the beach then through the gardens of a couple of resorts. We nearly booked at Whalers or Kaanapali Beach Hotel and are glad we didn't. There is a lot of construction going on there (at Whalers mainly I think), and whilst the beach is beautiful, you do notice a change in vibe that side of Black Rock. Maybe it was just the couple of times we went but people seem less friendly and more interested in pouting and doing press-ups on the beach! We're both in our 30's and keep ourselves in quite good shape, but come on people you're on holiday....relax and smile and Aloha!", "title": "Great Stay!", "helpfulness": 1, "user": "whachmacallit", "date": "November 10, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120435219}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "Final thing, Napili beach just up the coast is BEAUTIFUL and the Gazebo there is highly recommended! Lunch there is great, and breakfast too although you queue for a while unless you get there around 7am (we turned up at 9am along with the rest of Maui on our visit). Staff are very friendly too.", "title": "Very good lower cost place", "helpfulness": 1, "user": "bottlerocketsci", "date": "November 10, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 120431977}, {"rating": 5.0, "title": "We really liked the ResortQuest Mahana", "text": "We stayed on the 11th floor at the ResortQuest Mahana for a week for our first trip to Maui. It was great. The view was unbeatable - a whole wall in our living room and another wall in our bedroom were windows, and we had a great balcony with a table and chairs. On our first morning there, we woke up to the sound of the waves, and saw a seal, spinner dolphins and whales within 20 minutes of each other. That alone made our stay there more than worthwhile.", "user": "TexasCone", "date": "May 2, 2007", "id": 7494434}, {"rating": 5.0, "title": "The best vacation we have ever had.", "text": "If we'd have known what to expect, we might have packed a little differently. We knew we'd have a kitchen and that Maui is expensive, so we brought a few things to eat (bagels, snacks, etc.). We also brought a lot of clothes, and found that we had a washer and dryer in our suite. If we'd have realized we'd have free, convenient laundry and that the groceries at the Star Market across the street literally cost four times what we pay at home, we probably would have packed fewer clothes, a small box of laundry detergent and more groceries. I definitely recommend staying someplace with a little kitchen if you are in Maui on a budget and/or don't want to have to eat out every time you're hungry (I am pregnant though, so not only do I eat a lot, I'm very concerned about where my next meal's coming from and don't want to scout something out and wait for it every time I'm hungry!). We had a lot of exhausting days in the water and sun, so it was nice to be able to come home, throw together a sandwich and hit the sack. Also, it made packing a lunch to take to the beach or on the Road to Hana drive easier than having to stop to pick up sandwiches somewhere.", "user": "Michien", "date": "April 13, 2007", "id": 7344809}, {"rating": 5.0, "title": "Absolutely wonderful!!", "text": "For what we paid for the room, we thought the Mahana was great. Honestly, I wouldn't have wanted to stay in the more upscale, more corporate hotels/areas (like around Whaler's Village). I thought the Mahana had character and the people who worked there were very nice. It is very windy in that area, but it wasn't a problem for us. On a side note, we worked with our jet lag and got up very early in the morning. It was a good move. We wanted to do a lot of snorkeling and because of the wind, it's better to do it early in the day anyway.", "user": "cdimzon", "date": "April 13, 2007", "id": 7343372}, {"rating": 5.0, "title": "Spring Break from Arizona to Maui with Teenage boys", "text": "The only thing we didn't love at the Mahana was that the pool area is small and kind of boring (it is clean and perfectly fine for a quick dip though), so we went to the pool at the hotel next door. The shuffleboard at the Mahana is fun.", "user": "AnnaAZ", "date": "April 1, 2007", "id": 7266998}, {"rating": 5.0, "title": "Fabulous Experience and Condo!", "text": "The other thing I'll do differently if I go back to Maui again is I will spend a night over in Hana to break up the Road to Hana drive, have more time to check out more of that side of the island, do one of the longer hikes at Oheo Gulch and get a break from touristy West Maui.", "user": "mrsbee123", "date": "March 28, 2007", "id": 7236136}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "Before booking the Mahana, we read the many reviews and were leary of getting an outdated room. Not the case, we were on the third floor and were happy with the room. The only negative was a slight musty odor in the flivingroom furniture. We attributed this to the location, i.e. being on the oceanfront. The condo was beautifully decorated with a pull down bed from a huge wall unit, unusual but it worked. The location gives an air of private because it is set back quite a bit from the main road, very quite, and all oceanfront. The sound of the waves was mesmerizing. Supermarket close by, and fully equipped kitchen allowed for breakfast in the room. Bubba Gumps In neighboring Lahaina was very good, Kimo's was delicious and the shopping choices on Front Street in Lahaina was extraordinary, especially if jewelry is your passion. Lots of selection which means you can make deals. Don't be shy about suggesting a counterprice, it's expected due to the competition. Shop and eat, enjoy going back to your condo for the roar of the waves in the evening. Truly, our stay at the Mahana was paradise. We would recommend the Manaha, just be careful to get an updated room.", "title": "Better than good!", "helpfulness": 2, "user": "Ladygriff", "date": "September 21, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 8829812, "likes": {"liked": "— musty odor in furniture"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "My husband and I, along with another couple, recently traveled to Maui to celebrate our first anniversary. We chose the Mahana after reading several reviews from various sites. I must admit that pictures don't do justice for the beauty and location of the Mahana. We had a two bedroom, two bathroom condo for our week stay. I would highly recommend calling ahead of time and requesting a newly remolded condo and placement on a higher floor(although all of the rooms are ocean front) Not sure how the other condos looked, but ours was more than we expected. Spacious living room, flat screen television, full kitchen with supplies, washer/dryer, dishwasher, balcony, etc. All of this for the same price of a hotel room! The hotel staff was average, and housekeeping services are provided. Be sure to ask for extra towels however as they seem to provide the bare minimal. As for the condition of the condo, no complaints here. But as I said before, this may be due to my request of a newly remolded condo. There are a few cons however to the Mahana. There are no on-site restaurants. This isn't a big problem however because mostly everyone rents a car and there are a couple of restaurants located in the hotels next door if you chose to dine there. I would recommend going to a grocery store and purchasing a few breakfast items to save money. There is a grocery store Star Market located across the street, but be warned that prices in Hawaii are much higher. Also, the crowd at the Mahana is a little bit \"older\" so don't expect a party scene at night. This was perfect for us however since we were celebrating our anniversary. We simply took a 15 minute drive to Lahania's Front Street at night for the bar scene. Also, the beach in front of the Mahana is not suitable for swimming(it's very rocky). This also was not a problem because we simply walked 3 yards down Kaanapali Beach to a strip in front of the next hotel that was perfect. There is one pool at the Mahana also that was average. It never appeared crowded, as I believe everyone opted for swimming in the ocean. The Mahana also had a couple of activities during the week which is why some people chose a big hotel chain. There was \"Learning to Hula\" and a movie showing poolside. Overall I would highly recommend the Mahana if you are traveling for romance or with a group/family. The quality of the Mahana is well worth the price, as my husband and I plan to return.", "title": "Mahana is the best", "helpfulness": 5, "user": "cocoabear01", "date": "September 19, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 8755191, "likes": {"liked": "— The quality of the condo", "disliked": "— The"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "My husband and I went on our honeymoon to maui and happens to be our first trip to maui. If your looking for quietness and some alone time, I would highly recommend this hotel. We stayed on the 12th floor, room 1203. As soon as we walked it, AC was on (big plus) and the view was breath taking. Our room faced the ocean and it was to die for. No one bothered us on our one week trip and the housekeepers were nice enough to leave us alone even though we didn't put the do not disturb sign. Our room was the oceanfront studio which came with a washer, dryer, kitchen and FREE Parking !!! Big +++. I would really recommend these 4 things since everything happens to be expensive and having these really helped. For shopping, try K-mart near the airport or costco.", "title": "Honeymooners !", "helpfulness": 4, "user": "Soniya80", "date": "September 12, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 8704355, "likes": {"liked": "— No one bothered us and left us alone.", "disliked": "— Bed seemed very small even for a queen size"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "Definetly try the maui helicopter Trip: FUN !! We did the whole island and it was worth paying that much. There are plenty to do and if you haven't booked anything, don't worry. We didn't either and on our second day went to expedia local experts and they arranged everything for us. Majority of the hotels can help set up your activities for you.", "title": "Oh my gosh", "helpfulness": 12, "user": "brumleyr", "date": "September 7, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8669176, "likes": {"liked": "— the honu turtle", "disliked": "— Leaving it behind"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "This is a half of a lime throw away from hitting the ocean from your lanai. First thing you need to realize is that this will be by far the best place you will stay. Other resorts offer nice pools, bars and shops. But that garden/ocean view no good, Quick walk down the beach, you are there using all those pools, not once where we asked \"who are you?\" my 7 year old was loving it.", "title": "Great view but lousy room", "helpfulness": 2, "user": "aknm62", "date": "September 7, 2007", "detail_rating": {"front_desk": 2.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "rooms": 2.0, "location": 5.0}, "id": 8668574, "likes": {"liked": "— The View", "disliked": "— The"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "We booked our unit on www.vrbo.com directly through an owner. We stayed in unit 803 and it was perfect for my husband and I. The view as everyone says is AMAZING. You are staying as close as you can to the ocean on Maui as this building was built prior to codes regulating you from building this close to the water. We watched whales and sunsets from our balcony and fell asleep to the sound of waves crashing on the shore. The location was a perfect \"launching pad\" for all of our activities during our stay. We love both Lahaina Town and Whaler's Village and both are within a short 5-10 minute drive. We enjoyed having the kitchen for keeping drinks and snacks as well as the laundry in the unit. The unit was clean and well appointed. The pool and jacuzzi work was done when we were there but we did not try them out as we were too busy visiting different beaches! I would recommend the Mahana and this unit. I really have to say I also thought the Mahana was much nicer in person than the pictures on the ResortQuest website. It is a really nice property.", "title": "Mahana Even Better Than Expected", "helpfulness": 4, "user": "BornToTravel", "date": "March 6, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 14103009, "likes": {"liked": "— The View!", "disliked": "— Having to leave!"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "I booked through VRBO Room 804 1 bedroom 1 bath, I absolutley loved it! I didnt want to leave the view was breathtaking whales everywhere you looked. Very nice weather all week, The pool was not crowded at all very quiet, Only thing is cant really frolic in the water lots of coral in front but i didnt mind at all...", "title": "Loved, loved The Mahana!!!", "helpfulness": 1, "user": "bebe1467", "date": "March 2, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 13995717, "likes": {"liked": "— The views!!!", "disliked": "— couldnt swim in the beach but thats okay"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled with family", "text": "We booked a two bedroom condo through the property and stayed in room 609 Feb 16-23, 2008. Very nice in every way; gorgeous view from the lanai with whales visible to the naked eye in the bay. We had some problems with the washer/dryer and the bathroom but they were addressed very quickly to our satisfaction. The kitchen is very nice, bathrooms as well. The construction noise next door was only noticeable once we left the room.", "title": "perfect place", "helpfulness": 4, "user": "jal58", "date": "March 2, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 13991275, "likes": {"liked": "— The view from the lanai, but the condo amenities were also great", "disliked": "— The beach is a bit rocky, but definitely not a big deal"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "The beach is good for snorkeling but the entry to the ocean is tough because of rocks; just walk 20 yards in either direction for easier access, though.", "title": "Can't wait to return to the Mahana!", "helpfulness": 4, "user": "jennalulu", "date": "February 28, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 4.0}, "id": 13916108, "likes": {"liked": "— The Views!!!", "disliked": "— Not much, minor construction noise"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "We hope to come back net year.", "title": "Outstanding", "helpfulness": 1, "user": "grm", "date": "February 26, 2008", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 13874742, "likes": {"liked": "— The Private Owner who cared", "disliked": "— No complaint"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "Just got back from a week at the Mahana. The place is great! Really nice room that we stayed in and the people there are so friendly and very helpful. The view at this place cannot be beat! It was amazing waking up every morning and just sitting on the lanai and watching and listening to the waves. I definitely plan to stay there again each and every time I go to Maui from now on.", "title": "Great place with an excellent view!", "helpfulness": 4, "user": "hulagirlca", "date": "May 27, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7702419, "likes": {"liked": "— the view", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "I really can't say enough good things about my stay at the Mahana. I would recommend it to anyone. I loved it!", "title": "10 days in paradise", "helpfulness": 3, "user": "crunch413", "date": "May 20, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 7655732, "likes": {"liked": "— quiet."}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "We stayed at the Mahana 14 Apr - 23 Apr 2007. I found it to be a great place to stay. Although you can't swim right in front of the hotel, you can go either right or left for a 100 yards or so and swim there. Our room on the 4th floor was clean. I had no complaints at all. This is the perfect place if you want to get away from all of the crowds at the bigger resorts. I will come back. We went to the Feast at Lele which was wonderful. We snorkled Molokini crater which was a disappointment. We saw more sea life at Black Rock than we did at Molokini crater. We took a cruise with Triology to Lana'i which I would recommend. We saw several dolphins and whales. We didn't see any whales from our hotel room until the last day though. It was very difficult coming back to our home after living in paradise. I'm planning our return trip now. Aloha", "title": "Simply Wonderful!", "helpfulness": 5, "user": "nfm", "date": "May 16, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7630358, "likes": {"liked": "— Location/View"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "Aloha,", "title": "Awesome view, older building", "helpfulness": 3, "user": "zoe92", "date": "May 15, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 3.0, "location": 5.0}, "id": 7626237, "likes": {"liked": "— The View", "disliked": "— Some of the place wa renovated, but the rest was very outdated"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "We stayed at the Mahana May 3 -11 and loved every minute of it. I simply don't get negative reviews. If you've done any research at all, you know it is away from the main Kaanapali area, does not have a restaurant, and the beach isn't swimmable. All of these things I've read complaints about were a plus for us. It is very quiet and peaceful. The sound of the ocean is unbelievable!! The grounds are pretty, simply done, and well maintained. The lobby and other common areas are lovely. The pictures you see do not do it justice. Even the outside of the buildings themselves are more attractive than they appear in pictures.", "title": "Unit #701--Fantastic!", "helpfulness": 6, "user": "morgoth3", "date": "May 14, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7608937, "likes": {"liked": "— Location and Views", "disliked": "— No complaints at all."}}, {"rating": 4.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "We loved our stay here! We booked a studio room and it was perfect for just the two of us. The entire condo was updated and the washer/dryer were a big plus - there is nothing like fresh beach towels! We really didn't use the pool or beach area since we were exploring the island during the day but loved our lanai for the sunsets and cool evenings. The hotel is close to Kaanapali and Lahaina but also convenient to Kapalua.", "title": "A great find!", "helpfulness": 2, "user": "kfio", "date": "October 23, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 10255393, "likes": {"liked": "— The oceanfront setting"}}, {"rating": 5.0, "title": "Magical experience at the Mahana", "text": "We booked an anniversary vacation through David at Royal Hawaiian Condos. He was very professional and took note of our special requests; bed size, preferred floor levels, etc. We were very impressed with the online pictures of the condo, especially the floor to ceiling, wall-to-wall windows overlooking the ocean, but very seldom find do we find reality exceeding our wildest expectations. When we walked in the door it was like walking into an upscale island paradise. Everything, from the furniture to the bed linen to the granite counters in the kitchen, was tastefully but richly done. Falling asleep and waking up to the sound of the ocean was heaven on earth and the sunsets on the Lanai were so magical that we still go online to watch them on the Mahana webcam at least twice a week. There are no hotel ameneties at the Mahana but that made it much more like home to us and nearby hotels are a short beach stroll away for breakfast or drinks. Speaking of beaches, we found a nice quiet one another short walk from our hotel and snorkeled the morning away. We took advantage of the two-for-one lua coupon and chose the one at the Hyatt. It was wonderful, as was the Ulalena show in Lahaina. You must chek it out if you are in Maui. We rented a car and explored Maui at our leisure but whatever we did we always found ourselves anxious to return \"home\" at the end of the day to enjoy our sunset and the beautiful grounds. Having kona coffee(thoughtfully provided to us each morning.........the full kitchen was amazing), relaxing on the lanai, star-filled nigths, feeling rich in spirit, and grateful for having found the Mahana. We can't wait to return. Aloha!", "helpfulness": 5, "user": "soulmateLA", "date": "October 22, 2007", "id": 10230579}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "We had always stayed at the Royal Lahaina and loved it; since it was being renovated and we heard that could be a problem, we were afraid to stay there. We got a lot of advice from members of the Maui Forum at TripAdvisor and finally chose The Mahana at Kaanapali. We were absolutely blown away by this place, it is located in a very quiet place and every condo overlooks the ocean; the view from the large lanai was awesome. We will stay there when we return and may just sit out on the lanai all day and watch the ocean. This place is condos that are privately owned and managed by The Mahana and I guess you could get one that you did not like, however, I think they would change you to another if at all possible. We were in #812, a studio, that suited us just fine and was very clean and looked as if it had been recently painted. It is a little hard to find The Mahana; we passed the road we needed to turn on, however, once you find it you never forget how to get back. It is close to Lahaina town and there is a grocery store very close by. I highly recommend The Mahana if you like peace and quiet and like to view the beauty of the ocean.", "title": "Loved the Mahana", "helpfulness": 6, "user": "msj57", "date": "October 21, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 10206296, "likes": {"liked": "— Ocean view, private and quiet area", "disliked": "— I liked everything"}}, {"rating": 5.0, "title": "Excellent!", "text": "We stayed here just last week and it was great! The room was updated and comfy. I was unsure about the pull down bed, but it was easy to sleep on. The oceanfront view was amazing! I plan to stay here and to tell all my friends to stay here when we return. The pool is out of service until Nov of 07 but they gave us a nice food basket for the troubles. The hotel was close to a supermarket which was nice for breakfast and the pizza place down from the supermarket was good. All and all this was a great place to stay. As far as the problem with getting a reservation, I made mine thru Blue Hawaii vacations, however, I know several other people who have done it over the phone and on the internet without problems. I am not sure what happened with the previous poster.", "helpfulness": 4, "user": "tnshsms", "date": "October 16, 2007", "id": 10088459}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "My wife and I called the Mahana home for 10 wonderful days. The grounds were beautiful as was our unit. While I don’t recommend the Mahana for young active adults looking for a restaurant and pool bar, I was great for us to come back to the quiet serenity each night after our busy day of checking out the island. They greeted us with a gift basket and a 10% discount to offset the lack of using the pool while it was down for upgrades. They also arranged for us to use the pool down 3 doors which we did on several occasions. As everyone talks of the view was to die for, each unit is right on the oceans edge. We loved having our morning coffee and island fresh fruit each morning on our balcony. The help was very good to us, especially Larisa. Thanks for a once in a life time vacation. We will definitely try and get back ASAP. If you need snorkel gear try the Maui Dive Shop right across the street, they too were great to us.", "title": "Very beautiful", "helpfulness": 3, "user": "SBLbs", "date": "October 16, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 10086470}, {"rating": 1.0, "stay_parameters": "Stayed October 2007", "text": "Tried to call and make a reservation from all these great reviews only to be yelled at told i could not get any rates until check in and the room I reserved may not be the room i get......then she hung up on me.", "title": "Can't take reservations?", "helpfulness": 12, "user": "carmodygal", "date": "October 7, 2007", "detail_rating": {"value": 1.0, "service": 1.0}, "id": 10047915}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "Guess I wont be staying here. Next........", "title": "Great Place To Stay", "helpfulness": 2, "user": "dburgess5", "date": "October 4, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 10039143, "likes": {"liked": "— View"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "Clean rooms, very helpfull staff, and very friendly. would stay with them again...", "title": "Couldn't have been any better!", "helpfulness": 5, "user": "JHC1973", "date": "October 3, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 10034534, "likes": {"liked": "— View", "disliked": "— They won't let me stay forever....."}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled with friends", "text": "This place was simply amazing! When we arrived, we immediately loved the property, beautiful well-kept grounds. Gives you a private, secluded feel while being minutes from all the action. At check-in, I asked about the pool closing because I had read on this site the day before that the pool would be closed during our stay for repairs. Turns out that's true, and sounds like they're getting a hot tub as many people had hoped! BUT, since the pool was closed, they gave access to a pool at another resort three doors to the north (a short walk along the beach at Ka'anapli Shores). AND they gave us 10% off our unit. Hard to complain about that! We never used the substitute pool, but did walk over to see it, very fine substitute if you ask me. After our trip we realized we never would have used the pool even if it was available, as we preferred the ocean.", "title": "The Best experience you could hope for", "helpfulness": 9, "user": "DEIDRE07", "date": "September 29, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 10019192, "likes": {"liked": "— Everything", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "Our unit? Gorgeous! Ninth floor one bedroom. Unbelievable view, as everyone raves about! Appears to be recently updated, or at least maintained very well! They let us take a look at it before we took our bags up to make sure we'd be happy with it. We immediately went back down and said we'd take it!", "title": "best vacation ever ! ! !", "helpfulness": 5, "user": "mahola", "date": "September 25, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 10004092, "likes": {"liked": "— it was clean and updated with a beautiful view of the ocean", "disliked": "— I can't think of anything it was perfect"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled with family", "text": "I was searching the internet, mainly tripadvisor, for a nice but affordable place to bring 11 family and friends for a destination wedding, for my daughter, in Maui. Having never been to Maui before I relied heavily on all the positive reviews I read about the Mahana. I booked the whole package, air, rooms, and cars for all 11 people through united vacations. When we arrived we were all amazed at how beautiful the property is. the staff at the front desk were polite, friendly, and professional. My wife and I booked a one bedroom and I called ahead to request one of the nicer rooms. even though they couldn't promise anything until we arrived we were most happy to find we had been upgraded to a beautifully decorated 2 bedroom condo on the 5th floor. No matter which room your in you will instantly fall in love with the views. 24 hour ocean complete with whales jumping right in front of your lanai, Hawaiian sunsets, and waves lulling you to sleep at night. Not having a restaurant or bar on the property was no problem since we stocked up the kitchen with all our munchies and drinks from the star market right across the street. If you really need a bar or restaurant you can go right next door to their sister property and use your hotel card to charge to your room if you like. No one in our party had any complaints about the Mahana. It was the perfect place to stay. Just a footnote. I highly recomend the pride of maui for snorkeling and the Ma'alaea grill for lunch or dinner. Both are at the Ma'alaea horbor", "title": "will always go back to the mahana", "helpfulness": 3, "user": "CaliforniaRiverrat", "date": "February 23, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 13797234, "likes": {"liked": "— location and view", "disliked": "— no complaints"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "We stayed at the ResortQuest Mahana Feb 3-8, 2008 and stayed in rm 912. The room was updated, well equipped and clean...but the ocean view was the spectacular part!! There was some construction going on in the pool area, but it was not a problem. The Mahana is in the perfect location to explore, we walked everywhere (but we did have a rented car for longer distance excursions!) and found great restaurants and shops. We are planning to return next year. We would book an extra day next time to avoid the noon checkout, with the only flight to Vancouver being at 945pm. Enjoy!!", "title": "The Mahana was everything we hoped for!", "helpfulness": 3, "user": "lovemaui08", "date": "February 15, 2008", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 13573615, "likes": {"liked": "— The view and the location", "disliked": "— Nothing!"}}, {"rating": 4.0, "title": "Avoid the carpeted units at all costs", "text": "Let me tell you what we loved: the incredible views (you could see whales from the bathroom sink, and just about everywhere from the condo); the location of the property, extremely quiet, the lanai, kitchen was fully stocked and roomy, the sheets and pillow cases were very nice. You truly are ocean front and that makes up for a lot--doesn't quite make up for the carpeting, but almost.", "helpfulness": 6, "user": "dlcuster", "date": "February 7, 2008", "id": 13366912}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled with friends", "text": "Let me tell you what we hated: the carpeting in our unit was disgusting. No one should have carpeting in a tropical setting.", "title": "Spectacular Views", "helpfulness": 5, "user": "infineon2004", "date": "February 6, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 13328381, "likes": {"liked": "— The view", "disliked": "— Can't think of anything we didn't like!"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "We were told we were \"upgraded\" to a unit with two bathrooms, but one of the bathroom doors was locked because the bathroom needed repair. That is not an upgrade to two bathrooms, that's an upgrade to a locked bathroom door. The bedspread was old, ugly and faded. Very dated design.", "title": "Loved the Mahana!", "helpfulness": 6, "user": "ktstravels", "date": "January 31, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 13157730, "likes": {"liked": "— The view", "disliked": "— nothing- loved everything"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "Aloha,", "title": "Loved Mahana 1008!", "helpfulness": 6, "user": "MahalofromCanada", "date": "January 10, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 12500841, "likes": {"liked": "— Views", "disliked": "— No Spa or Restaurant on site"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled with friends", "text": "My husband and I stayed at “Mahana at Kaanapali” from December 23, 2007 to January 3, 2008 and booked directly through ResortQuest. After reading some of the TripAdvisor reviews, I was worried about not getting a renovated unit but was absolutely thrilled when we were assigned Unit #1008.", "title": "A gorgeous condo", "helpfulness": 7, "user": "sigalachic", "date": "January 5, 2008", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 2.0}, "id": 12343096, "likes": {"liked": "— beds, kitchen, furnishings", "disliked": "— weather was not great"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "It was a newly renovated one bedroom-one bath condo, with even some price tags still on the furniture and decorative pillows. We had heard from Claire, the 10th floor housekeeper (great lady) that they had rushed the day before to get the unit ready for us and had forgotten to take off some of the tags. We felt very lucky to be enjoying the unit first, even before the owners! The unit had all the luxury and comforts of our home. New kitchen and bathroom, granite counter tops, stainless appliances, new furniture, two plasma televisions, and magnificent views of rainbows, Lanai, Molokai and the ocean are some of the real assets of Unit #1008. The view and the sound of waves continually mesmerized us. It was non-stop shows of whales breaching, blowing and tail waving over the 12 days we spent in heaven. It pleased us as well that the noise between the units (above/below and to our sides) was non-existent. The pool is completely brand new and the hot tub is almost complete.", "title": "Loved the Mahana", "helpfulness": 4, "user": "JTPCalifornia", "date": "January 4, 2008", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 12327948, "likes": {"liked": "— View", "disliked": "— staff"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "As far as the weather, yes it was windy and sometimes cloudy, but to us, sun deprived Canadians, it was still hot and well worth the trip. Our tan lines aren’t as noticeable as we would like, but considering it is also Hawaii’s winter as well we are not complaining.", "title": "Great Condo Bad Weather", "helpfulness": 5, "user": "lobsta1", "date": "January 1, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 12193723, "likes": {"liked": "— ocean view units", "disliked": "— no onsite restaurant"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled with family", "text": "Since we had a rental car, we ventured to Safeway in Lahaina to get our groceries. Make sure to get a Safeway discount card at the Safeway Customer Service Desk before purchasing groceries. Having the card does save you some cash. We ate a lot of the Ahi Tuna and Poke from the fish counter at Safeway and it was always fresh. The condo has a BBQ area that was available to all units. For a great authentic Hawaiian meal, go to Aloha Mixed Plate on Front Street in Lahaina (behind Cannery Mall). It has great food, views and value.", "title": "Excellent choice", "helpfulness": 3, "user": "DaisyPa", "date": "December 31, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 12172014, "likes": {"liked": "— cleanliness of room--spacious", "disliked": "— nothing--everything was excellent"}}, {"rating": 3.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "Our trip was October 23rd 2011-November 2nd. We asked for a higher room and was terribly disapointed to find out we were on the 4th floor right by the elevator. The room was not updated at all and the bed was horrible. I went down to complain and the guy was a jerk about it. Phoned my travel agent and she told me to ask for a manager so returned to the check in desk again. Karen was kind and took care of us. Moved us to a premium room on the 7th floor. Was much better and updated. The beds could be newer. Not a big comfy bed at all. The view is awesome. Lots of parking at all times. Their beach out front is off limits to any kind of water sport and swimming. Nothing but coral. You have to walk a bit to find that nice spot but that was worth it as the views were amazing. Nice patios but furniture was outdated. Would I stay there again? Probably Thanks so much Karen for taking care of us.", "title": "ALOHA MAHANA", "user": "OregonGirl78", "date": "November 10, 2011", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 1.0, "rooms": 2.0, "location": 3.0}, "id": 120406213}, {"rating": 4.0, "stay_parameters": "Stayed December 2010, traveled with family", "text": "Great place, nice hotel. I would definitely want to come back again.", "title": "Great place, good waterfront", "user": "Ting-yi Y", "date": "November 7, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 120298468}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "My husband and I ended our honeymoon at the Mahana in privately owned condo #307. We were thrilled with the clean, well appointed condo, and the view couldn't be beat.", "title": "Mahana Room 307 is a great value with a great view", "helpfulness": 3, "user": "Ashley R", "date": "November 6, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 120249082}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled with family", "text": "The sound of the surf is quite loud during the night, so bring ear plugs if you are a light sleeper, but we didn't mind the constant waves during our stay. While we were at the condo, the neighbors above our condo were apparently doing some sort of remodeling which meant a pretty steady stream of furniture being scraped across floors and nails being pounded into walls. This was certainly not the fault of the owners of 307, but it did put a damper on some of our quieter moments in the condo. The spa was also being repaired for a few of the nights we stayed. When you have the ocean at your fingertips, the spa isn't an absolute necessity, but after a long day of snorkeling, a relaxing dip in the spa would have just hit the spot.", "title": "You feel like you are located right on the Beach", "helpfulness": 2, "user": "Cyndi-Ryan", "date": "November 4, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 120147847}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "We enjoyed having the beach access, even though it is a little walk either North or South to get to the swimming beaches. We also made use of the Maui Revealed book that is part of the collection left at the condo. I would recommend this condo to a friend without hesitation. This is a place to come if you want to cook most of your own meals and enjoy a cocktail on your lanai, and during whale season I imagine you could take full advantage of the binoculars and telescope that reside in the condo!", "title": "Wonderful week in Maui", "helpfulness": 3, "user": "Marj D", "date": "October 31, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 119985843}, {"rating": 5.0, "title": "Loved the View!", "text": "Stayed at the Mahana, from 1st may to may 8, 2007, After a 12 hour flight, was hoping that check-in condo was going to go smooth. After a 50 min drive, that was really awesome ,I was glad to see the Mahana, pictures just don't serve this place justice ... Checked in, no problem, staff were real nice and pleasant. Lobby was nice and grounds too, alot of beautiful flowers/plants at entrance.. Was orginally given room 213, asked for a higher floor room, and was given Studio room 513, wanted a higher view then 213. Room was nice, standard room, except for alot more extas, fridge wash/dryer, stove, microwave, ect... The carpet was a little worn, with some stains, defenitly needed replaced, however this didn't bother us, we come to expect this from alot of Beach ocean front rooms, kind of hard to keep carpet like new.. Maid service everyday kept the room nice and clean..Now the best part of the room, \"THE VIEW\", Words can't describe the view from this room, it was picture perfect! Palm trees, ocean, and beach, just great view, at fraction of the cost you would pay for at the resorts just a little up the beach.. All rooms are OCEAN FRONT, not view or partical, but right on the Ocean! We checked out most of the resorts in this area, by far the best views out of all the reorts and hotels, the only one that had a closer one was the Maui kai, but hotel, looked out dated to us, plus alot of the rooms there did not have the lanais. The pool was ok, didn't use it, too busy at the beach, would have like to have a hot tub though... The beach infront of the mahana has alot of rocks/coral in the water, not good to swim in, but great for snorkal, however if you don't like to snorkal, if you walk either way a few minutes, you'll find better swim areas. This beach is a great walking beach, about a 15-20 min walk to black rock, saw alot of sea life just walking the beach, water is really clear and warm.. There was very few people out on this beach, which was perfect for us, very romatic, and peaceful.", "user": "Jimmy F", "date": "May 11, 2007", "id": 7588220}, {"rating": 5.0, "title": "Memorable stay at the Mahana", "text": "Wife an I tried to conquer the road to Hana, Unfortunally, it conquered us, wife got really sick, alot of turns on this road/narrow, got to mile 18 and turned around, the water falls/sceenery we saw were really beautiful though, especially the 200 ft water fall(forget what mile marker/ see maui reveal book). Defenitly worth the trip, if you have a strong stomach, for the drive.", "user": "jpl88", "date": "May 6, 2007", "id": 7550794}, {"rating": 5.0, "title": "Fantastic stay at the Mahana", "text": "Ate at several restaurants, Aloha Mixed Plate(local food(alot for $, decent taste/price), Bubba Gump,(same as all bubba gumps only better view), Hula Grill ( seafood was ok , nice location, price was adverage for location), Kool Cats( great Hamburger, best I ever had, decent $, worth the stop), Kimo's( seafood good food, great location, decent $$), PIONEER INN (only ate breakfast here, good decent $), Rusty Harpoon, (nice location, got the prime rib specials, good decent $) Ruths steakhouse(excellent steak, too much money though, went on our anniversary 6th may). MOOSE MCGILLYCUDDY'S(nasty hamburgers, wife liked the pork tacos, I loved there onion rings), soup kitchen by Mahana(over priced, food was ok, no view at all, decor was intersting though). Sunrise Cafe(breakfast only, little place, food was ok good $) also ate at the Embassy and K. shores next to Mahana, both were good, K shores, has some killer seafood linguine. Of course we had to drink our Lava flows. Also had to go to the grocery store right across the street from the Mahana and get some POG, great drink, really good!", "user": "sunsetchaser", "date": "May 5, 2007", "id": 7549369}, {"rating": 2.0, "title": "The Mahana Is The Best Value In Maui", "text": "All in all, I really enjoyed the Mahana, and recondmend it to anyone that wants a nice loacation/decent price for Maui, close to most activities, don't like to be around alot of crowds, romance, and Outstanding views/best in area, we hope to be back soon.. Will post pics...", "user": "LovMaui", "date": "May 5, 2007", "id": 7548893}, {"rating": 5.0, "title": "Can't wait to go back!", "text": "We stayed in a high-floor 1 bedroom / 2 bath unit booked through ResortQuest for the first half of our stay on Maui. The location of the buildings is simply amazing, as close as feasible to the sea. The views of the ocean and islands is breathtaking from the floor to ceiling windows and lanai. The area infront of the condos is always calm and quiet as the swimmable areas are steps away at the side.", "user": "crock", "date": "May 5, 2007", "id": 7548182}], "location": {"country": "United States"}, "stars": 3.5, "variance": {"poor": 37, "average": 61, "very good": 320, "terrible": 8, "excellent": 804}, "aka": "Aston Mahana At Kaanapali Hotel", "slim_ranking": 0.142857142857, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "Enjoy the seclusion of this beachfront condominium resort where each custom-furnished oceanfront suite features floor-to-ceiling windows and a private lanai with panoramic views of the Pacific and Maui's magical sunsets. Nearby attractions include Lahaina Town and the Sugar Cane Train. At the Mahana, you can experience the tranquility of Maui."}