{"user_rating": 4.0, "review_count": 257, "name": "Aston Waimea Plantation Cottages", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "When we arrived I was initially disappointed, not sure what I expected but it was a hot little cottage. However within the hour I loved \"our cottage\". It was a very peaceful place. The grounds are beautiful and the rocking chairs in the breezeway became a favourite place to sit.", "title": "loved it", "helpfulness": 3, "user": "elizabethWollongong", "date": "November 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 145573132}, {"rating": 3.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "Yes the beach is not suitable for swimming, the town is small and the cottages somewhat basic, however this just added to the experience. we did day trips to the canyon, Napali coast and another highlight was the free lei making classes at the historic centre on Friday morning.", "title": "Nice but dated cottages, be sure to ask for air conditioning", "helpfulness": 5, "user": "pgscmk", "date": "November 5, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 3.0, "location": 4.0}, "id": 144602497}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "It was kind of expensive but we loved it.", "title": "Absolutely Lovely!", "user": "Dlanderson", "date": "October 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 143701584}, {"rating": 3.0, "stay_parameters": "Stayed October 2012", "text": "The location is a collection of old standalone cottages that were moved from plantations to one location. Each cottage is somewhat different from the others, including the extent to which it has been updated. We stayed here as we thought it the best location to go to the Waimea Canyon, for which it is perfectly located. The only problem is that some cottages have air conditioning, and some do not. Any a/c in any cottage is from a window unit in the bedroom only. And frankly I think that calling any of them \"modernized\" (which they do) is not really accurate either, decor, kitchens, bathrooms were all dated, although clean and comfortable (with possible exception of temperature). We were first put into a cottage that had no a/c, and it was a very hot time in August. We asked to be moved, and they did in fact move us to an overall much, much nicer cottage, which we were lucky was available. The staff was friendly and helpful, We found it perfectly adequate to have a/c in the bedroom only. Location is excellent only if you're going to the canyon, restaurants are pretty limited in this area. Hotel restaurant was fine.", "title": "Historic Shouldn't Mean Rundown", "helpfulness": 7, "user": "Joeysdoll", "date": "October 22, 2012", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "location": 3.0, "service": 4.0, "rooms": 3.0}, "id": 143466047}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "This was a 'home away from home'. Much nicer than a hotel room; at least for our taste. We had a kitchen, living room, beautiful surroundings. We could see the ocean, and hear the waves crash on the shore. Plus a very nice pool area on the grassy grounds. The beach is not the best to swim in or lay out on since it's black sand.", "title": "A Perfect Honeymoon", "helpfulness": 1, "user": "Douglas P", "date": "October 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 142784977}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled with family", "text": "We stopped by the restaurant for a late lunch after visiting Waimea Canyon. Hesitant at first because it seemed very quiet, we ended up enjoying a delicious meal with excellent service. The property is very well maintained: clean restrooms and a nice outdoor seating area. Plenty of parking. We were invited to have a stroll around the grounds after our meal, and we did. There are some amazing trees onsite, and the cottages look in good condition. Interesting history of the Plantation is posted in one of the main public areas. Highly recommend visiting for a meal, even if you are not staying here.", "title": "Excellent Restaurant!", "helpfulness": 3, "user": "ladytez", "date": "February 19, 2013", "detail_rating": {"value": 4.0, "service": 5.0}, "id": 152570693}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "Our “cottage” was one back from the Pacific. It was just my wife and I on vacation, but our place had four double beds and a couple of singles. It had three bathrooms, and a fully equipped kitchen, and could arguably have accommodated 12. Our toughest choice, on arrival, was in which bedroom to sleep. We decided on the one whose bed and window were oriented so in the morning we could see the ocean between our feet. The cottages are set in acres of well-tended grass – think huge croquet course, and provide well-furnished verandas for eating or just sitting and reading a book. There are beautiful trees, lots of twittering birds, a hammock, a swimming pool, shuffleboard – basically everything you need for a dolce far niente.", "title": "Didn’t want to leave", "helpfulness": 4, "user": "TerribleIvan", "date": "February 16, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 152298398}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "The Cottages’ Grove Café provided a decent, if not spectacular or inexpensive meal. Thursday evening, there’s live Hawaiian music, which we enjoyed. Waimea itself is a serviceable town. It’s got a couple of markets, including Ishihara’s with an irresistible seafood deli. It has a movie house, a public library, and of course, a memorial to Captain Cook, the 1st European to lay eyes on Hawaii. It is also the entryway to the famous Grand Canyon of the Pacific, and the beginning of a drive to utterly spectacular Na Pali Coast overlooks and many trails. A couple of the boat tours for whale-watching and viewing the coast from the sea start in Waimea, which was convenient. I unfortunately did not heed the advice to take Dramamine for such a tour, and did not enjoy getting seasick.", "title": "Cottage 75 is Awesome. Bring Earplugs.", "helpfulness": 6, "user": "cbestard", "date": "January 25, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 150627431}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "There weren’t many downsides to the Plantation accommodations. One is that the beach there is unswimmable. You have to drive to a snorkeling or surfing spot. Driving is slow on Kauai. So, anything you might want to do on the North Shore involves 1 to 2 hours in the car. The restaurants and touristy shopping of Poipu are 18 miles away. Typically that means a half hour’s drive each way and $10 worth of gas.", "title": "Best vacation ever", "helpfulness": 1, "user": "rabry7", "date": "January 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 150069046}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "In the buyer-beware department: I was not pleased to be charged a $15/day “Amenity Fee.” I was informed that that was to cover pool towels (we had our own), in-cottage coffee in the morning (wasn’t good – we bought our own down the street) and a free DVD lending library (weren’t in Hawaii to stare at a screen). So, basically, our bill included $90 + tax for nothing that we actually wanted. If you can just think of this as a hike in the price of the room, OK. For me, it left a sour taste.", "title": "Relaxing and Charming", "helpfulness": 1, "user": "Nancy D", "date": "January 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 149824248}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "This is definitely for people who want to relax, share the great semi-rustic cottages, expanses of green lawns, lovely pool and friendly staff. We like being off the beaten path and this was really out of the way -- if you are looking for luaus or lots of restaurants and beaches you should stop in Poipu or go on up toward the North Shore. We were just there for seven nights in September-October 2012. We were upgraded to a two bedroom cottage with a view of a giant banyan tree and the beach. There were not many people there, but there was a teenager's sleepover birthday party, a wedding on Saturday and a family reunion on Sunday. So we did have company in neighboring cottages - since there was no air conditioning in the cottage, the windows were open and fans going all night. If the kids want to party you might have a problem, but our neighbors did quiet down in a timely manner. Most of the time we felt we were there by ourselves. We quickly learned to bring home food to heat up in the kitchen and eat on the lanai, although we did try to restaurant connected to the hotel and some places in town.", "title": "Cozy cottages and peaceful setting (except chickens)", "user": "tindelk", "date": "October 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 142601398}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "We spent two nights at the Cottages in September. We were in Cottage 57 I believe. This was in September 2012 and it was somewhat deserted. The highlight for me was the chickens running around. We had previously in been in Maui so the beach here is really pretty crappy. The pool was fine however.", "title": "Land of the Wild Chicken!", "helpfulness": 1, "user": "Jeff S", "date": "September 23, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 2.0}, "id": 141027754}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "The Restaurant was kind of bad. I really liked the chickens running around everywhere. Its a very sleepy place and a great place to just kick back and relax. The bedroom had an AC unit but everything else was un airconditioned (not an issue really because theres a good breeze).", "title": "Historic Buildings, gracious landscaping", "user": "Christa G", "date": "September 20, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 140772451}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "We stayed 6 nights on the north shore, then two nights at Waimea Plantation Cottages for access to this other side of the island. We loved our stay here. Cottages are rustic, so if you want a modern luxury hotel experience, this is not the place for you. We loved all the palms and other mature trees, and the layout of the grounds. The main building and cottages are charming. There was great bird watching - saw a few birds I had not seen elsewhere on the islands. The beach here is not swimmable, but Salt Pond Beach Park is just down the road and is gorgeous. There are protected areas for kids to go in the water, and we always seem to find a Monk Seal on the beach.", "title": "A Slice of History", "helpfulness": 1, "user": "Val R", "date": "September 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 139947287}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "Dining at Grove Cafe was delightful. Food is simple but healthy and good. The seating in the back terrace is one of the more romantic dining settings you could hope to find anywhere. Fragrant flowers, palm leaves rustling, soft breezes, crickets chirping - delicious! We wanted to run it back the second night, but the back terrace was taken over by a convention. We sat in front - it was karioki night - totally different to romantic first evening, but fun & hilarious.", "title": "BEST CHOISE ON THE WEST SIDE, GO FOR IT!!!!", "helpfulness": 1, "user": "StrollerShopper99", "date": "August 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 138883786}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "Checked into Cottage 86 in the Waimea Plantation Cottages. Technically a garden view with ocean view also. Free Wi-Fi provided. Has a full size refrigerator, stove and coffee maker. Nice set up. Loved the beautiful grounds and (4 foot deep) swimming pool. Plenty of lounge chairs around the pool and even a couple big hammocks by the beach.A discount in the Entertainment Book (Hawaii edition) saved us about $50.00 on our 2 night stay.Walked the beach each morning. Beach is not swimmable. Bathroom was huge and had a big bath tub and separate shower with a vintage shower head that was awesome. Very quiet (which is why we decided to stay here to start our island vacation after the hustle & bustle of a week in Waikiki.) The roosters start crowing very early. I know it bothers some people a lot, but I kinda like it. Reminds me I am lucky to wake up in Kauai.The only negatives: Did not find the living room furniture very comfortable and an overwhelming mildew smell whenever we entered the kitchen/living room. The bedroom & bathroom had no odor. Would stay here again. Don't forget the happy hour at the on site Grove Cafe for their $4.00 Mai Tais..", "title": "Quiet Romantic Cottages", "helpfulness": 1, "user": "trixi", "date": "January 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 149539045}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled with friends", "text": "Quaint \"old time\" plantation houses on a large property. We had a 2 bedroom house which was clean and well maintained. The beds were comfortable and the master bathroom had a large soaking tub. No air conditioning, but since we visited during winter, the breeze and ceiling fans kept us very cool and comfortable. The staff was very friendly during check in and the grounds are beautiful and quiet. The property fronts the beach and is very secluded. It was very peaceful except for the chickens which woke me up at 6:00AM (don't forget, it is Kauai after all). It is the exact opposite of a modern full service hotel, and we loved it. Seems like it would be a great place for a family vacation with kids!", "title": "Quaint and unique accomodations", "helpfulness": 3, "user": "EinHI", "date": "December 30, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 148367060}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "This location provides the perfect Hawaiian vacation if you are looking for peace and relaxation on a gloriously landscaped ocean-side property with charming, well-stocked cottages. We have wanted to stay here for years, but the resort was always booked, so this time I reserved 6 months in advance. It exceeded my high expectations. Our party of five adults stayed in the 3 bedroom garden cottage. Surprisingly, this cottage has a lovely view of the sea as you look down the well-manicured lawn, dotted with frangipani, koa, orchid, and other beautiful Hawaiian trees. The cottage has everything you could want, including a rice maker and blender for smoothies.", "title": "Charming resort", "helpfulness": 1, "user": "hanalei", "date": "December 27, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 148153309}, {"rating": 5.0, "title": "Perfect", "text": "The beach is beautiful even if not good for swimming. Relaxing in a hammock is great way to spend a couple of hours. A plus side to this location is the sunny weather on this side of the island.", "helpfulness": 3, "user": "Greg E", "date": "December 14, 2012", "id": 147468026}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "Great little spot away from all the hassle of a bigger city / town. Friendly staff and atmosphere with a great cottage and easy walk in to town for lunch or supplies. The best way to spend an afternoon is lazing on the front porch watching the world go by. Hire a car is my only recommendation to get around the island. Highly recommended.", "title": "Historic Hawaii Cottages at its best...", "helpfulness": 4, "user": "Uwe W", "date": "November 29, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 146455501}], "location": {"country": "United States"}, "stars": 3.5, "variance": {"poor": 21, "average": 25, "very good": 68, "terrible": 9, "excellent": 134}, "aka": "Aston Waimea Plantation Cottages Hotel Waimea", "slim_ranking": 1.0, "description": "Private, individual plantation cottages set on a historic 27-acre coconut plantation in a beachside setting close to Kauai's famous Napali Coast and Waimea Canyon. Each self-contained cottage has been fully restored with modern appliances, full kitchens, and amenities. The simple, comfortable charm, genuine history and beautiful grounds allow guests to enjoy a unique experience unlike any other in the islands. Waimea Plantation Cottages offers beautiful settings for Wedding Celebrations, Anniversaries, Family Reunions, and Corporate Business meetings. Note: The restaurant will be closed temporarily as we remodel and transition the restaurant to a new restaurant operator and will re-open in mid-to-late fall of 2013. We apologize for this temporary inconvenience. During this transition, we suggest trying some of the other dining options in Waimea Town such as Wrangler's Steak House. But do come and try our new restaurant once it reopens!"}