{"user_rating": 3.5, "review_count": 443, "name": "Aston Waikiki Beachside Hotel", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed April 2003", "text": "My boyfriend and I stayed at the Aston Waikiki Beachside Hotel on our travel agent's recommendation. We were a little nervous since we booked a room with no windows, but we were on a budget and figured we wouldn't be spending much time in our room anyway.", "title": "Unique Hotel in a Great Location", "helpfulness": 3, "user": "NewYork41", "date": "August 30, 2004", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 3.0, "service": 5.0}, "id": 2503096}, {"rating": 4.0, "title": "Location, Location", "text": "Far and away the best thing about this hotel is the staff. They were as friendly and helpful as could be. I called them and asked about the windowless rooms, and they said that if, upon arrival, there were partial or ocean view rooms available, they would upgrade us for less money than it would be if we booked a partial or ocean view room in advance. It added a little excitement to the experience and when we arrived that was precisely the case. They offered to upgrade us to a partial ocean view for $10 more a night, or to a full ocean view for $20 a night (as opposed to I think $80 if we booked an ocean view in advance.)", "helpfulness": 20, "user": "A TripAdvisor user", "date": "August 20, 2004", "id": 2477806}, {"rating": 2.0, "title": "Boutique must mean something else in the USA", "text": "As other reviewers have said, this hotel lacks bells and whistles, but my thoughts are that in Waikiki you don't need your hotel to have bells and whistles. All of the excitement at this hotel is right out the front door on the beach. This hotel truly could not be in a better location.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "July 14, 2004", "id": 2299110}, {"rating": 4.0, "title": "Great Ocean View!", "text": "I would recommend this hotel to anyone who wants to go to Waikiki and not spend a fortune.", "helpfulness": 3, "user": "twilsonb", "date": "July 2, 2004", "id": 2263349}, {"rating": 3.0, "stay_parameters": "Stayed January 2004", "text": "My wife and I were both nervous to see our windowless hotel room since we booked a standard room. We read the other reviews and we were expecting to be disappointed, but once we got there, we were quite relieved. The room was small but it was fine for two people. Yes, there were no windows but it didn't really matter to us since we were hardly in the room anyways. The major perk for this hotel is its location, location, location. It is right across the kuhio beach (part of waikiki beach) and closed to everything. The zoo is just a few blocks away and so was the international market. Most of the trolleys make a stop in front of the duke statue, and most of our tour pick ups were behind the Hyatt Hotel on Koa Ave which is only one block away. Yes, it is a small hotel with no restuarant or pools but their service was excellent. Trevor and Shane provided a lot of good advices about tours and transportation and most of the staff were helpful and friendly. They even played the ukelele.", "title": "Very average!", "helpfulness": 3, "user": "hookedonbonaire", "date": "June 22, 2004", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 2.0, "service": 5.0}, "id": 2215841}, {"rating": 4.0, "title": "Location, Location, Location!!!!!", "text": "This is a nice little hotel. Not a 5 Star but they more than make up with the EXCELLENT way they take care of you. We were there 6/06/04 - 6/11/04. We were greeted by Trevor and Shane and was assured we would have the best of times, which we did. Trevor tool care of all of our attractions. You can not beat the Location, Location, Location!!!!!", "helpfulness": 4, "user": "Texas409", "date": "June 14, 2004", "id": 2187229}, {"rating": 4.0, "title": "Fair and balanced review", "text": "My family and I stayed at the Aston Waikiki Beachside Hotel in late May, 2004 and had a fantastic time.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "June 10, 2004", "id": 2181159}, {"rating": 4.0, "title": "Great little Hotel!", "text": "The hotel was clean and well kept but the carpets and rugs did appear worn (but clean.) Our bed was very comfortable and was in good condition. The room size is smaller than the average hotel room in the mainland and could only fit two people comfortably. The décor was nice and the bathrooms were very cool with black marble, glass walk-in shower, and plenty of storage space.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "February 20, 2004", "id": 1662525}, {"rating": 3.0, "stay_parameters": "Stayed March 2002, traveled on business", "text": "My only complaint was that after five days with the AC on, the room smelled slightly musty. That was no big deal because we had a FANTASTIC view of the ocean (Kuhio beach park) and we just left the patio door open. If you stay at the AWBH you must get a room with an ocean view.", "title": "watch out for the entry level rooms", "helpfulness": 6, "user": "mistermaui", "date": "January 10, 2004", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "rooms": 2.0, "service": 3.0}, "id": 1544936}, {"rating": 5.0, "title": "Great location and hotel for the money!", "text": "The entire staff, as mentioned in other reviews, was top notch. They went out of their way to assist you and make you feel at home. Simply a great bunch of people.", "helpfulness": 5, "user": "alafans", "date": "December 1, 2003", "id": 1503610}, {"rating": 3.0, "title": "Best room on the Strip", "text": "We put the two twin beds together and asked for the wall to wall carpet to be shampooed in our room and we had the best value in Waikiki. The beach is literally across the street, the towels and beach mat available in the lobby in the morning are fabulous, as you return them there on your way in. No swimming pool but there's the beach and boogie boarding and surfing lessons right there in front. Get your Maui Babe suntan lotion and feast on the sun tanning opportunity. The view was superb from our balcony. The free continental breakfast was great and with the bed tray, you can bring the muffins, croissants, coffee and juice (real!) up to your room. This is a small boutique hotel with friendly staff and location, location, location! We got a great room with a great view but yes some rooms are without windows or look out onto a wall. Get out of the room and see Oahu and the North Shore and the malls and just sleep in there! You're not buying the place but just sleeping there. It isn't for honeymooners cause the beds are a little old but worth every penny.", "helpfulness": 5, "user": "WESTMOUNTGAL", "date": "December 10, 2004", "id": 2875238}, {"rating": 1.0, "title": "Nice location, junk hotel", "text": "I would not recommend this hotel to anyone. If u book it through Pleasant Holidays, better call the hotel and make sure you get a queen or king size bed. The hotel staff and manager insisted I booked 2 twins. I was stuck with this the first night and the manager was reluctant to give me a queen or king when I know for a fact it was available.", "helpfulness": 8, "user": "A TripAdvisor user", "date": "November 29, 2004", "id": 2854379}, {"rating": 1.0, "title": "Poor Choice", "text": "The lobby is small but looks decent at first glance. Then you see the area rug and the furniture and you can tell it's just not well maintained. The worse part was the elevator! It is tiny, dirty and disgusting. If I hadn't been on the top floor I would have opted to take the stairs.", "helpfulness": 5, "user": "Alnol", "date": "November 26, 2004", "id": 2848515}, {"rating": 3.0, "stay_parameters": "Stayed November 2004", "text": "The rooms are so small I barely had enough space for my luggage. The carpet is in dire need of being replaced and the TV was a junky old Zenith. I had to wear slippers around the room cause I didn't want to step on the filthy carpet. Also, we ended up with a lovely view of a building wall.", "title": "Small room....Great view", "helpfulness": 7, "user": "shee28", "date": "November 24, 2004", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "service": 4.0}, "id": 2844522}], "location": {"country": "United States"}, "stars": 2, "variance": {"poor": 43, "average": 104, "very good": 158, "terrible": 48, "excellent": 90}, "aka": "Aqua Waikiki Beachside Honolulu", "slim_ranking": 0.795180722892}