{"user_rating": 4.5, "review_count": 595, "name": "Aston at The Whaler on Kaanapali Beach", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed February 2008, traveled with family", "text": "We arrived at The Whaler's on February 6th, 2008 and stayed until February 28th, 2008. After staying at the Sheraton Maui several times, we decided to book a condo for its' kitchen and extra space. We booked through a Maui Vacation Specialist, so we had seen many pictures of each of the units we were considering, and chose this one for it's sofa sleeper in the living room as we had our teenaged son with us. We didn't feel we needed a whole extra bedroom for him, and he loved having the big screen TV all to himself after we went to bed.", "title": "Unit #759 Tower II", "helpfulness": 6, "user": "PikesPeakGirl", "date": "February 28, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 2.0, "value": 3.0, "location": 5.0, "rooms": 3.0}, "id": 13900559, "likes": {"liked": "— The location on Kaanapali Beach", "disliked": "— The noise from construction"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled with family", "text": "The unit was large and airy, with high ceilings and lots of room. We had one bedroom that was very large, one bathroom with the toilet and shower closed off for privacy, a full, extremely well equipped kitchen, and a wonderful LR and DR. We faced south and had 180 degree views of the ocean, sunset over the island of Lanai, and beautiful mountain views. The furnishings were perfect; rattan with pineapple motifs on the upholstery. There was a 52\" TV, DVD, CD and wireless (free) internet in the LR. The bedroom had a king sized bed, large TV, DVD and CD player. The closets are HUGE, and with all the furniture having cabinets or drawers, storage was definitely not a problem. The kitchen had all the large appliances as well as an iced tea maker, coffee maker, hand mixer, salad spinner, Cuisinart, coffee grinder, frozen yogurt maker, rice cooker/vegetable steamer, can opener, toaster oven, blender and toaster (that was totally destroyed). The furniture was very comfortable and the king sized bed had a pillow top on the mattress. There were an abundance of games and books in the LR cabinets, mirrored walls throughout the unit, and lots of beach accessories--chairs, boogie board, umbrellas, coolers, etc. There was even a huge supply of plasticware for taking food or drink to the pool. The entry and kitchen floors are tiled, the bathroom is faux marble.", "title": "Home Away from Home", "helpfulness": 5, "user": "Kiki1010", "date": "February 22, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 13763662, "likes": {"liked": "— The size of the room and the view", "disliked": "— The construction and the room needed to be upgraded"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "Now, for the cons: Hot water took a long time, and at peak times, we didn't have any at all. Our ice maker flooded the kitchen until we called maintenance (who responded immediately), and the tile floor on the lanai got very hot from the sun. Our carpets were so filthy, our bare feet turned black. There was vomit on our bed blanket, but fortunately, there were several extra blankets in the hall storage closet. There is no washer or dryer in the unit, but there is a pay laundry ($1.25 washer/$1.00 dryer) on each floor. Even though the owners say this unit was completely remodelled in 2002, tennants have been very hard on it. The white kitchen Formica has knife cuts all over it, wallpaper is peeling, there are a couple of large holes in the drywall, the trim on the kitchen cabinets is gone, and the unit needs painting. The aluminum screen doors to the lanai kept coming off the track, and never really closed properly.", "title": "GREAT", "helpfulness": 2, "user": "jrsvphr", "date": "February 20, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 13709836}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "But the biggest drawback was the NOISE. Our unit overlooked Whaler's Village, and the noise from the refrigeration trucks early in the morning supplying the Hula Grill and the Rusty Harpoon was horrible; the backing up beeping from delivery trucks, clanging of sliverware, smoke and fumes from the Hula Grill and constant construction noise from the Whaler's was deafening. Many days our unit filled with wafting smoke from the oven ducts on the roof of the Hula Grill, and the stench of fetid cooking grease was unbearable at times. When you can hear the beautiful sounds of waves breaking on the surf, you don't want it drowned out by loud city-like noises or closed lanai doors.", "title": "great condo, great location", "helpfulness": 4, "user": "ilovechristianrock", "date": "February 5, 2008", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 13278040, "likes": {"liked": "— it's location", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled with family", "text": "The pool was small and rectangular, not particularly kid friendly like the mega pools at the Sheraton or the Marriott, but more than adequate for adults. Seating around it was very good, and the pool attendants were extremely helpful (as was all the hotel staff), and the beach was wonderful.", "title": "Whaler Maui Condo #802 - Fabulous!!!", "helpfulness": 5, "user": "KayeFP", "date": "February 3, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 13231333, "likes": {"liked": "— Loved the gorgeous condo lanai, view and close proximity to shopping restaurants.", "disliked": "— Nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "This was our second trip to Maui and the second stay at The Whaler and we love both.It's nice to have a kitchen in Maui ,you'll save money to spend on other things.There is a Safeway grocery about 3 miles down the road.The Whaler has very nice condos for a very good price compared to other properties.There is some minor constuction jobs going on, in the center court of the property, but it shouldn't bother anyone.The construction is shut down on weekends.All the fish you want to see right down the beach at Black Rock.We will return.......", "title": "Love The Whaler", "helpfulness": 3, "user": "harleybonz", "date": "June 13, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 16900530, "likes": {"liked": "— views", "disliked": "— minor construction"}}, {"rating": 5.0, "title": "Maui Honeymoon", "text": "We just spent 6 nights in Maui for our honeymoon. The top things we'd recommend are: snorkeling with Pride of Maui, Mama's Fish House, an Oceanside massage at the Four Seasons and a catamaran Sunset Sail. The shopping in Lahaina was very touristy but fun. We ended up buying a painting at gallery night as a remembrance. The store Maui Hands in Paia and Lahaina has some great pieces at affordable prices. Also, the Maui's own art and craft fair has some wonderful deals at low prices. The price tags at this craft fair were usually reduced by 40-50% when asked what the price was and dealers were willing to negotiate. We stayed on West Maui at The Whaler and it was a great location. Right on the beach. The pool always had chairs available as well. The location with the shopping center right next door and restaurants was awesome at Whaler's Village. We drove the road to Hana. Even though it was beautiful, I would take 2 days instead of one to do this. We started at 6 AM and made it to the seven sacred pools by 2:30 PM. The Twin Falls waterfalls was amazing. I would skip driving up to the Haleakala crater. Maybe we were just tired of driving, but we did this one morning, and definitely saw better sites on the road to Hana. Do the Road to Hana or the crater, not both. We will definitely return to Maui for another vacation...probably would stay in West Maui for a few nights and then in South Maui a few nights. The island is spectacular! My husband did a helicopter ride and it was his most amazing event. I shopped in Paia while he did that, which I enjoyed as well.", "helpfulness": 3, "user": "Cheryl-Madison", "date": "May 28, 2008", "id": 16474780}, {"rating": 2.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "We stayed at the Whaler in March, but I have only now found the time to write a review. We have been to Maui seven times, and this was our first and last stay at the Whaler. Yes, the location is fabulous, but the hotel itself is in dire need of repair. The hallways need new carpet and paint. The grounds are just okay, with very stiff grass. The pool is old old old. AND you park your car on the tennis court.", "title": "Disappointment", "helpfulness": 1, "user": "parisparisparis", "date": "May 20, 2008", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 2.0, "cleanliness": 2.0, "value": 2.0, "location": 5.0, "rooms": 2.0}, "id": 16262322, "likes": {"liked": "— Location", "disliked": "— It is terribly run-down"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled with friends", "text": "We shared a 2 bedroom/2 bath oceanfront condo with another couple. I always wondered if it was worth the extra money for oceanfront, but it absolutely is (at least for this property). Our lanai directly faced the ocean, and we had floor to ceiling sliding glass doors on the two outside walls of the condo.", "title": "our condo was AWESOME (#602, Tower 1)", "helpfulness": 2, "user": "sdveggie", "date": "May 19, 2008", "detail_rating": {"cleanliness": 4.0, "front_desk": 5.0, "location": 5.0, "value": 4.0, "rooms": 5.0}, "id": 16200351}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "I was a little nervous because it seems like a crapshoot when you book the Whaler since each unit is individually owned, but I can tell you that #602 in Tower 1 was worth every penny. We booked through Costco Travel so we didn't pay published rates.", "title": "Check for construction", "user": "Newmania", "date": "May 14, 2008", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 3.0, "cleanliness": 3.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 16034681, "likes": {"liked": "— Location", "disliked": "— Construction"}}, {"rating": 4.0, "title": "Loving life in unit #159", "text": "We rented through Maui Beachfront Rentals and they were great. When ATA went under a mere two days before we were supposed to arrive we panicked; the condo was paid for and we had no way to get to it! Lesli at Maui Beachfront was so helpful and understanding, really cannot say what that meant to us! Ended up in Maui a week later than planned and could not have been happier with our room at The Whaler. All week long the praises rang for mom picking a winner! The unit is clean and well cared for, nothing fancy but great for the price. The best part of this unit is location! Our unit was ground floor on the side nearest Whalers Village. This was great for our kids, large grassy area and only 51 steps to the beach! This unit has a fantastic ocean view for a ground floor unit and with the grass area and bbqs so close it was like home immediately!We ate almost all our meals on the lanai, even dinner. It was nice at sunset each night as everyone seemed drawn to the beach.", "helpfulness": 3, "user": "Teamsims", "date": "May 6, 2008", "id": 15734097}, {"rating": 5.0, "stay_parameters": "Stayed July 2007", "text": "We did go to Whalers Village alot, if you have kids there is a great toy store downstairs. Mostly went over to walk around or grab a shave ice in the afternoon. Are there nicer places to stay in Kaanapali? Sure but when you figure we payed about a third of what you pay for a one bedroom condo right on the beach it seemed like paradise. Take your kids to unit 159 and you will hear \"Mom no ka oi\" , Mom is the best!", "title": "A Incredible Experience", "user": "love2travel06", "date": "April 8, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 14899437, "likes": {"liked": "— The view", "disliked": "— The high table and chairs on the lanai"}}, {"rating": 5.0, "title": "Great Room & View", "text": "I enjoyed it so much that I couldn't leave! So I extended my vacation two more days. The staff was very friendly and accommodating. The ocean view was outstanding. I enjoyed the free entertainment and the conveniece of Whaler's Village. My room exceeded my expectations. I was on the 11th floor.Be sure to try the spa in Lahaina. I received the best massage that I have ever had. Enjoy!", "helpfulness": 4, "user": "EagleMonroe", "date": "March 9, 2008", "id": 14164270}, {"rating": 4.0, "title": "Great Location", "text": "My wife and I stayed in #964 (Tower-2) and we were well pleased with everything. The Lanai over looked the pool and ocean to the left and mountains on the right. We were buying a \"pig in a poke\" without knowing the room, view and etc. We asked for ocean view as high up as possible. The ninth floor was great. We had originally planned for another two couples to be with us but they cancelled. We then asked for a studio with ocean view on a high floor. You need to be above the trees to really enjoy the spectacular view. We saw plenty of whales and frequented the Hula Grill nearly nightly. We have stayed at other locations on Kaanapali Beach but plan a returned visit here next year. The Whaler on Kaanapali Beach in our opinion is a great choice. We were there from 02/24 thru 03/02/2008.", "helpfulness": 5, "user": "ILIVEFORVACATIONS", "date": "March 8, 2008", "id": 14149233}, {"rating": 2.0, "title": "hit or miss", "text": "Tom & Marta", "helpfulness": 4, "user": "sweethomechitown", "date": "March 3, 2008", "id": 14021145}, {"rating": 2.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "We celebrated a late 30th anniversary by staying at the Whaler from Jan 23 to 28, 2008. This was our 1st visit to Maui, and we expected a little better for what we paid.", "title": "Be careful of your room assignment", "helpfulness": 6, "user": "sld7", "date": "January 31, 2008", "detail_rating": {"front_desk": 3.0, "service": 5.0, "cleanliness": 3.0, "value": 2.0, "rooms": 3.0, "location": 4.0}, "id": 13159301, "likes": {"liked": "— Kitchenettes in the Studio Rooms", "disliked": "— Incessant beeping of construction equipment"}}, {"rating": 5.0, "title": "Best Spot on Maui", "text": "Strengths of the Whaler: (1) central location to the beach and water activities, (2) studio rooms with kitchenettes, (3) very responsive maintenance and housekeeping staff, (4) beautiful blue-tiled linai, (5) pretty flowers on the linais, (6) washers and driers on each floor, and (7) right next to the Whaler Village with shops & restaurants.", "helpfulness": 5, "user": "angel09", "date": "January 29, 2008", "id": 13096790}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "Weaknesses: (1) the incessant beeping from construction equipment on the southeast side of Tower # 2, (2) small ants in the kitchen, (3) on-going basement garage repairs, (4) and some rooms below the 6th floor on the southeastern side of Tower # 2 have limited views of the ocean, like maybe 30to 60 degrees.", "title": "Will Certainly Return to #315 at The Whaler", "helpfulness": 9, "user": "jlwfishman", "date": "January 25, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 12990054, "likes": {"liked": "— That everything was new and the beach view was great from the balcony", "disliked": "— The parking was sometimes hard to find a place at night."}}, {"rating": 3.0, "stay_parameters": "Stayed January 2008, traveled with family", "text": "The bottom line in my opinion regarding the Whaler is that the views from the various rooms range from 5-star (oceanfront, above the 6th floor or outside of Tower 1 overlooking Black Rock) down to 2-star views. I felt we got a 3-star view on the 5th floor of the southeastern side of Tower 2; however, the constant beeping of construction equipment made it feel like 2-star lodging. Fortunately, trees obscured the rooftops of shops in the Whaler's Village, and we had greater privacy and more of a natural view with some of the ocean visible from our linai. We asked for a room on a higher floor, and were offered a 9th floor room on the inside of Tower 2. The insides of both towers face each other, and there's a significant loss of privacy. We kept the 5th floor room, kept our privacy, but had to live with the incessant beeping of construction equipment. Got some relief on Sat. & Sun. when there was no construction. Therefore, I would definitely inspect the view from a room, and make sure there was no audible construction noise nearby before paying for any room.", "title": "Overpriced", "helpfulness": 5, "user": "r2klopp", "date": "January 14, 2008", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 2.0, "cleanliness": 2.0, "value": 2.0, "location": 5.0, "rooms": 2.0}, "id": 12621574, "likes": {"liked": "— Liked having a kitchen.", "disliked": "— Room seemed gross, needed updating."}}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "We stayed at the Whaler on our honeymoon. We had a room on the 11th floor in Tower 2. The room was huge and spacious and nicely furnished with a kitchen, bathroom and dressing room. The lanai (balcony) was huge with amazing views over the beach. We got a room which had all day sun and it was beautiful to sit and watch the sunset from our balcony. I would recommend asking for a room high up to be able to enjoy the view.", "title": "Comfortable but without flair", "helpfulness": 7, "user": "tcro1234", "date": "January 14, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 12617848, "likes": {"liked": "— Comfortable and convenient", "disliked": "— Parking"}}], "location": {"country": "United States"}, "stars": 3.5, "variance": {"poor": 30, "average": 41, "very good": 185, "terrible": 11, "excellent": 328}, "aka": "The Whaler On Kaanapali Beach Hotel", "slim_ranking": 0.25, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.5, "rooms": 4.5, "location": 5.0}, "description": "This exclusive luxury condominium boasts an idyllic location on Maui's famous Kaanapali Beach across from two championship golf courses and minutes from Lahaina. Each spacious unit features a full kitchen and a spectacular view. A beachfront pathway and private access allows guests easy entry to adjacent Whalers Village's 65 shops and restaurants."}