{"user_rating": 3.5, "review_count": 294, "name": "Aston Paki Maui", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed May 2006", "text": "Consider the Paki Maui to be a Motel 6 or a Super 8 with the world's most fabulous view. If you are going to stay there, definitely pay extra for an ocean view room.", "title": "Motel 6 with a great view", "helpfulness": 9, "user": "sassycutefishbug", "date": "June 2, 2006", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "rooms": 2.0, "service": 2.0}, "id": 5293403}, {"rating": 5.0, "title": "Loved it!", "text": "Specifics:", "helpfulness": 9, "user": "A TripAdvisor user", "date": "May 28, 2006", "id": 5229588}, {"rating": 5.0, "title": "Great stay", "text": "1) Ancient decor: The Paki Maui is one of the older \"resorts\" there, and is essentially comprised of converted condos. I can't speak for all the rooms, since many of them are privately owned, but the decor in our room left a LOT to be desired. I haven't encountered pink carpet and fake floral wall-hangings like that since 1979. However, the kitchen portion of the room was new and nice and helped us keep down the cost of eating out constantly.", "helpfulness": 8, "user": "A TripAdvisor user", "date": "May 16, 2006", "id": 5145318}, {"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled with family", "text": "I really enjoyed this hotel, and would stay there again.", "title": "Great view and comfortable accomodations for the budget traveler.", "helpfulness": 3, "user": "LMcC123", "date": "November 3, 2006", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 4.0, "location": 4.0, "rooms": 3.0}, "id": 6053585, "likes": {"liked": "— The View", "disliked": "— No Air Conditioning"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled on business", "text": "It is good for people on a budget, and although there isn't a beach, it's great for snorkeling. I would probably recommend getting a rental car if you are staying here, since there isn't a lot in the area, but it isn't a far drive from nice shops and beaches, and the parking isn’t very expensive. The room looked like it had been updated, but it looked like it still needed some final touches done in the bathroom, and the furniture was a little dated but the unit was clean, and was decent for the price we paid. (I stayed in unit 101A)", "title": "nice remodeled unit and tranquil garden view", "helpfulness": 4, "user": "halemalu", "date": "October 27, 2006", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 3.0, "cleanliness": 3.0, "value": 4.0, "location": 3.0, "rooms": 3.0}, "id": 6016584, "likes": {"liked": "— the garden and waterfall"}}, {"rating": 2.0, "title": "Room 105", "text": "The only thing to really mention was the air conditioning, being on the first floor, even though it's not right on the ground I didn't feel comfortable leaving the sliding windows open, and so it became very hot at night.", "helpfulness": 4, "user": "Meekala", "date": "September 12, 2006", "id": 5792232}, {"rating": 1.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "But the view you get for the price is wonderful. I was able to enjoy beautiful sunsets from the patio.", "title": "dont stay in this hotel", "helpfulness": 4, "user": "fromvirginia", "date": "August 30, 2006", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "location": 2.0, "rooms": 1.0}, "id": 5728917, "likes": {"liked": "— nothing", "disliked": "— no air conditioning"}}, {"rating": 4.0, "title": "Paki Maui - room 322", "text": "we go to maui twice a year (we live on moloka'i) and need something quiet and peaceful for a few days while we need to get errands and shopping done on maui.", "helpfulness": 14, "user": "jwg01776", "date": "July 20, 2006", "id": 5491461}, {"rating": 4.0, "stay_parameters": "Stayed June 2006", "text": "Our first trip to Maui and we were fortunate to stay at Paki Maui. We were on the third floor and overlooked a beautiful tropical garden that made you feel you were in the midst of a forest. Koi fish and geckos entertained us. Our room was wonderful. It was stuffy when we arrived at night because all the windows and doors were closed and the ceiling fans were not on but once we opened it up it was wonderful with the warm breezes flowing through. We never closed our windows or the sliding glass door going out to our patio and always felt safe with lots of privacy.", "title": "Loved Paki Maui", "helpfulness": 10, "user": "sarabeth715", "date": "July 18, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 3.0}, "id": 5480541}, {"rating": 1.0, "stay_parameters": "Stayed November 2005", "text": "We were there 6 nights and saw only one other person staying there, it was if we were the only visitors there. The beach was a 3 minute walk from our room and a perfect shallow beach for little kids witha wonderful park next door. Very quiet neighborhood with all kinds of stores within walking distance, no need to go anywhere if you are looking just to rest and relax. ABC stores are the greatest and I found Hawaiian attire was actually cheaper than what I paid at home. Can't wait to go back and hope it will be the Paki Maui again.", "title": "Never again", "helpfulness": 12, "user": "nfog", "date": "July 7, 2006", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "rooms": 1.0, "service": 2.0}, "id": 5437686}, {"rating": 5.0, "title": "Great place, Great Island", "text": "This was my first trip back to Hawaii after many years. We booked this trip (budget package) through our auto club travel agency and thought everything would be great, although the club did not rate the accommodations in Hawaii. We were given a one-bedroom ground floor garden condo. First thing we noticed upon entering the unit: the bedroom was dark and airless with only one long relatively narrow window strip containing louvered glass in one corner of the room near the outside walkway and front door. The ceiling fan provided inadequate cooling and that explained why a table fan sat on the dresser. Later we learned that having a window opening to a walkway near the parking lot does not provide much privacy and we could hear everything that happened outside. The toilet flushed periodically by itself, the rusted dishwasher door cable snapped and the door would fall if I didn't hold it. Two burners on the stove did not work, and cockroaches crawled around the kitchen and bathroom sinks and dishwasher. There was black mold in the shower door frames. Had we been more experienced travelers, we would have demanded an upgrade on a higher floor where security might have been better and then we could have left our sliding doors in the living room open to keep the unit cooler while we were out. As it was, we felt we had to lock the door when we went to bed or left the rooms. We did complain about problems needing correction and the workman was able to repair the toilet problem. The stove and dishwasher were not fixed (dishwasher was deemed too old to repair).", "helpfulness": 6, "user": "A TripAdvisor user", "date": "July 6, 2006", "id": 5435001}, {"rating": 5.0, "stay_parameters": "Stayed July 2006", "text": "Staff were without execption OK and friendly. Laundry facilities were convenient. Why did they put us in a room that needed renovation?", "title": "Great place, epecially if you have young children under 5", "helpfulness": 6, "user": "VinSanJose", "date": "July 5, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 3.0, "service": 5.0}, "id": 5429873}, {"rating": 5.0, "title": "No ka oi-The Very Best", "text": "We read the reviews and we're concerned. It was so much better than we could have ever expected. The condo was clean, the employees were great and the area was perfect. We will only stay here when we return.", "helpfulness": 15, "user": "A TripAdvisor user", "date": "June 3, 2006", "id": 5295093}], "location": {"country": "United States"}, "stars": 2.5, "variance": {"poor": 27, "average": 41, "very good": 93, "terrible": 40, "excellent": 93}, "aka": "Aston Paki Maui Hotel", "slim_ranking": 0.767441860465, "description": "The best oceanfront value on the Kaanapali Coast. Spacious suites, breathtaking views and an ideal location between the exclusive Kaanapali and Kapalua resort areas. Located next to the beach with guest suites encircling the interior garden atrium's soothing waterfall, this resort is a perfect place to relax and make new friends."}