{"user_rating": 4.5, "review_count": 685, "name": "Aston Waikiki Beach Tower", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed October 2006, traveled with family", "text": "This property is a little dated and in need of renovations to some of it's units. The appliances and mechanical works of the unit were very old as were the bathroom fixtures. The location of the building is great, right on the north side of the main strip across the street from the beach. The staff could not have been better and made the stay very pleasant by giving advice on places to see and beaches to go to away from the regular tourist areas. Parking is free with a valet and the bell service is top notch. If you can overlook the dated decor and the age of the paint on the walls of the units everything else is very good.", "title": "Excellent staff", "helpfulness": 8, "user": "Wayne Derek", "date": "October 31, 2006", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 3.0, "value": 3.0, "location": 5.0, "rooms": 3.0}, "id": 6034763, "likes": {"liked": "— The staff was great", "disliked": "— Old building in need of some work in the rooms, exterior and public areas are good"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "After quite a bit of research online, I selected this property for my husband's and my first trip to Hawaii. We don't have kids and we're 39 and 49 yrs old (he's the older one). We were hesitant to stay in Waikiki partly because we are sick to death of construction (we live in Orange County and there's always something going on construction-wise), and partly because we thought we'd like to be in a more natural setting.", "title": "What a delight. A perfect experience.", "helpfulness": 17, "user": "NLCSMVP96", "date": "October 31, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6034329, "likes": {"liked": "— Beachfront location and amazing friendly helpful welcoming staff", "disliked": "— Sofa was crummy and uncomfortable, but big deal!"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled with family", "text": "Well. We selected this property nonetheless, and we haven't had a bit of regret. We stayed there from October 21 thru the 27th and booked the whole shebang thru Aloha Airlines Vacations. I always panic that when you book indirectly, something will get mixed up. But the whole trip went smoothly like buttah. And this includes when we pulled up to the RQ Waikiki Beach Tower. Bellman Ed and another guy whose name I forget actually anticipated our arrival and guessed our names as we got out of our car. Nice. Immediately alleviated our fears that our reservation would be screwed up.", "title": "Great time at the Waikiki Beach Tower", "helpfulness": 12, "user": "PATTYC44", "date": "October 5, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 5913069, "likes": {"liked": "— Location and Atmosphere", "disliked": "— Pool Area could have been better"}}, {"rating": 5.0, "title": "Our own slice of paradise", "text": "Our room was ginormous. We had a 1 BR condo unit on the 9th floor. As others have said, the view is stunning. You don't believe the ocean is really that color til you're staring at it. The lanai was huge, stretching the width of the unit, prolly 25 ft or more.", "helpfulness": 6, "user": "knorpp", "date": "October 3, 2006", "id": 5906318}, {"rating": 3.0, "stay_parameters": "Stayed July 2006, traveled with family", "text": "The full kitchen was awesome. There was silver service and dishes for 6 people. Plenty of glasses and mugs of various sizes. A knife block with a big carving knife and one small paring knife. Salt and pepper. A sauce pan, a frying pan, some glass bakeware, a measuring cup. Coffee maker, rice maker, toaster, blender. We found the kitchen more than adequate. There is a dishwasher and soap provided daily. The housekeepers ran the dishwasher for us incl putting our dishes from the sink to the dishwasher. We cooked a couple times for dinner and ate in for all breakfasts. Lunch most days was sandwiches and fruit we made in the kitchen and took with us.", "title": "Not up to expectations", "helpfulness": 11, "user": "Highhat", "date": "August 4, 2006", "detail_rating": {"front_desk": 4.0, "business": 1.0, "service": 3.0, "cleanliness": 4.0, "value": 2.0, "location": 2.0, "rooms": 3.0}, "id": 5558663}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled with family", "text": "Was pretty sure I knew what to expect after reading many reviews of this hotel. It pretty much lived up to the expectations.", "title": "Was a great vacation", "helpfulness": 2, "user": "dmacalli", "date": "April 19, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 3.0, "location": 5.0}, "id": 15150265, "likes": {"liked": "— location / service", "disliked": "— dated rooms"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled with family", "text": "There was a total of 10 of us travelling together, 4 adult and 6 kids. One family stayed in a 1 bedroom, and we stayed in a 2 bedroom. In our room there was 2 adults and 4 kids. Sounds kind of cramped, it wasen`t at all. The room was kind of dated, but very spacious, which worked for us. We were on the 6th floor, so I was not sure what kind view we were going to have, but the view still was very nice, we were able to see the entire beach from our lanai (it was a huge lanai as well). The entire staff here were great. Always willing to go out of their way, at any time, for anything that you may need.", "title": "5th year we plan on coming!!", "helpfulness": 1, "user": "4Throgies", "date": "April 13, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 15003845, "likes": {"liked": "— the size of the room & the washer dryer", "disliked": "— I liked it all!"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "The location was perfect, right across the street from the beach, with all of the amenities that one would need / expect.", "title": "Excellent Location - Weak on the Interior", "helpfulness": 1, "user": "YYZ1977", "date": "March 17, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 14346806, "likes": {"liked": "— Friendly Staff - espiacally Eddy and Karin", "disliked": "— Dated furnishings"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "The beach was awesome, the surfing was great (all 6 kids in the party surfed often), the resturants were very good, although rather expensive, and the people were super friendly.", "title": "Great location, fabulous views", "user": "odd3", "date": "March 9, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 14172629, "likes": {"liked": "— Location and views, especially from the higher floors", "disliked": "— A bit dated"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled with family", "text": "All in all, both families had an extremely good time, and we would go back to this hotel for sure.", "title": "A pearl on Waikiki!", "user": "KenCarol", "date": "February 27, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 13890036, "likes": {"liked": "— One of the few places in Honolulu that has multiple rooms in a suite configuration. And the service was phenomenal!", "disliked": "— Nothing negative to comment on."}}, {"rating": 4.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "We enjoyed our stay. The property is in a great location and the unit we had was spacious and contemporary with a beautiful view west toward the ocean. The pool and sun deck area are disappointing. We thought the lobby/ entry/concierge area needed some work.", "title": "The Tower;s Tops", "helpfulness": 1, "user": "ddbertoncin", "date": "January 26, 2008", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 13019688, "likes": {"liked": "— Location and size of unit", "disliked": "— Pool area"}}, {"rating": 5.0, "title": "Gem in Waikiki", "text": "The staff was friendly. Housekeeping kept us in clean towels and also made sure we had dishwashing and laundry detergent. We did miss some of the amenities we're used to receiving at conventional hotels - restaurant, lobby bar, spa, etc. are all nice and would make the tower a 5 star resort.", "helpfulness": 5, "user": "HulahandsLA", "date": "January 22, 2008", "id": 12893444}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled with family", "text": "My husband and I returned from our 6th stay and each time is better than before. Deluxe ocean view 2-bdrom suites have sweeping views of the Pacific Ocean from the wall-to-wall lanai. Everyone from the General Manager to valet staff exude the 'aloha spirit.'", "title": "Loved the Waikiki Beach Tower!", "helpfulness": 6, "user": "AlbertaShell", "date": "January 16, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 12694262, "likes": {"liked": "— The location", "disliked": "— There is nothing I didn't like about this place!"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2007", "text": "The restrictions on hosting parties after 10pm make this a perfect, and quiet hotel/residence. Each kitchen is appointed with all the cooking utensils, dinnerware, glassware, flatware and cookware. The furnishings are lovely. There is twice-a-day maid service, if you wish, and a small washer/dryer tucked into the master bathroom - terrific for small loads.", "title": "Great Hotel, good value, highly recommended", "helpfulness": 1, "user": "ckmajesty", "date": "January 3, 2008", "detail_rating": {"value": 5.0}, "id": 12296049}, {"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled with family", "text": "Waikiki Beach Tower has become our home when we visit!", "title": "perfect for families", "helpfulness": 6, "user": "chikuben", "date": "December 31, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 12176770}, {"rating": 5.0, "title": "The Best 05/27 - 06/02", "text": "6 nights from May 27 to June 2nd", "helpfulness": 23, "user": "algas123", "date": "June 4, 2006", "id": 5296705}, {"rating": 5.0, "stay_parameters": "Stayed May 2006", "text": "We booked this trip one month in advance, so it was kind of a last minute trip. We are a family of 4 so, i was looking for at least a one bedroom suite that was close to the beach. And of course everything was sold out (well all the rooms at the Waikiki Beach Towers). When i read about the rooms at Waikiki Beach Towers I knew that's where i wanted to stay. So, I narrowed my choices down to the Waikiki Sunset, and the Waikiki Banyan. There where some negative reviews about the Banyan and the Sunset but some good reviews also, so I had a hard time making my decision. My main concern was the distance from the beach. Once i got there I saw that the 2 and 3 blocks that people talked about from the beach and whatever you wanted to do. Was not really that far away. The Banyan and the Sunset are just around the block from the Waikik Beach Towers. And if you are looking at a hotel map, (like i did before going) things look farther away than they actually are. We rented a car for the 6 days that we where there, but never drove to any location in Waikiki. We traveled to other parts of the island in the car. Anyway, my point is: if location is what you are looking for and you want a suite. Don't think that the Banyan and Sunset are too far from the beach because they are not. We paid about $1000.00 more to stay at the Waikiki Beach Towers than we would have paid to stay at the Sunset or Banyan. I don't know how the rooms are at Banyan or Sunset but the location is fine.", "title": "Great stay in Waikiki Beach Tower", "helpfulness": 6, "user": "gowaikiki", "date": "May 31, 2006", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 5287878}, {"rating": 5.0, "stay_parameters": "Stayed May 2006", "text": "Ok, anyway. After searching the web I found a site that still had a couple of rooms at the Waikiki Beach Towers. (greathawaiivacations) We paid for at 2 bedroom partial ocean view. When we arrived they upgraded us to a 2 bedroom deluxe oceanview room. We where on the 31st floor, both bedrooms and the living room had at TV (living room had the dvd player). The kitchen had all the dishes and everything that you would need. Frig had ice and water dispenser. Free Internet in the livingroom, just plug the cord in and you are connected (no wireless internet, but it's dsl). Washer and dryer(and they provide detergent), microwave, iron and board, robes, beach towles, nightly turn down service( if that's something you need), free valet parking, and you can walk right out the door and across the street to the beach. This place is within walking distance to everything in Waikiki. There is a mcdonalds and an Asain resturant just downstairs. You can't go wrong by staying here. And if you come across a negative review. They must be Rulers of some other country, because this place spoils you.", "title": "Loved IT", "helpfulness": 7, "user": "piloti5", "date": "May 20, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "service": 5.0}, "id": 5184811}, {"rating": 4.0, "stay_parameters": "Stayed May 2006", "text": "Our family enjoyed our one week stay in the Wakiki Beach Tower very much. We got upgraded to a 2 bedroom ocean view, the ocean view from the big lani is breathtaking! We enjoyed waking up to such a beautiful view every mornings! The condo is very spacious, clean, the hotel staff is very friendly and helpful. The condo is located in an excellent location in Wakiki and it is across the street from the beach. The free valet parking is great especially we had a baby with us - we didn't have to spend time finding parking and walking between the hotel and the parking lot. I'd highly recommend this hotel to anyone.", "title": "Excellent Condo,Great Service!!Loved it!! We'll be back!!", "helpfulness": 8, "user": "mandyncat", "date": "May 17, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "service": 5.0}, "id": 5148281}, {"rating": 4.0, "stay_parameters": "Stayed April 2006", "text": "We just returned from a week at the Resortquest Waikiki Beach Tower! It was awesome! The view from the lanai, the great staff, free valet parking, twice daily maid service, in room laundry facilities, full kitchen, and great location combined to make this a dream trip for my husband, myself, our adult daughter and my 80 year old mother. This was my mother's first trip to the islands so we wanted to make it special. The staff were very accomadating of our few specail requests. Our room wasn't quite ready by three but they gave us a bottle of champange, Godiva chocolates and a $100 in-room dining credit so we didn't mind the delay, just went next door for a snack until it was ready! Every staff member we encountered was friendly and willing to help with anything we needed. We had a two bedroom partial ocean view on the 17th floor. It was certainly better than most \"partial ocean-view\" rooms! We watched the surfers and swimmers every morning as we enjoyed our coffe on the lanai. The condo was a little dated and needed a few repairs but the beds were comfotable and everything worked so that was minor. We never had to wait long for the elevator even though one was being used by the renovation crew. We would recommend this condo to our friends and will definitely stay there again.", "title": "Great for a family of 5", "helpfulness": 4, "user": "TiQue", "date": "May 15, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 5.0}, "id": 5077095}, {"rating": 4.0, "stay_parameters": "Stayed June 2006", "text": "Even tough you are right in the hustle and bustle of Waikiki the hotel is quiet and peaceful and you feel like you are the only person there.", "title": "Loved Waikiki Beach Tower", "helpfulness": 11, "user": "anne1125", "date": "July 17, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 5.0}, "id": 5476743}, {"rating": 5.0, "stay_parameters": "Stayed June 2006", "text": "The staff is friendly and extremly helpful always there if you have a question or just for a nice \"Aloha\".", "title": "awesome condo!", "helpfulness": 8, "user": "toddlynn3", "date": "July 4, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 5425242}, {"rating": 4.0, "title": "Very pleasant hotel", "text": "The staff were extremely helpful and friendly. On new years eve we came home to be surprised by a bottle of complimentary champaign and some goodies!", "helpfulness": 3, "user": "VacationgirlSeattle", "date": "December 18, 2007", "id": 11677162}, {"rating": 3.0, "title": "above average condo, good location", "text": "The hotel was slightly on the older side, but overall still a well-kept hotel. Recommend floor 20 and up for better view of the entire beach.", "helpfulness": 3, "user": "schererd", "date": "December 4, 2007", "id": 11248714}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled with family", "text": "Would definitely return!", "title": "Fabulous for families", "helpfulness": 9, "user": "CCTraveler01", "date": "November 12, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 10774509, "likes": {"liked": "— Fabulous staff, lots of space, outstanding location", "disliked": "— Some outdated amenities"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "My husband and I stayed at the Resortquest Waikiki Tower with my parents and brother last summer. The location is pefect. Right across", "title": "Great place for families", "helpfulness": 2, "user": "OC_Traveler27", "date": "April 13, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 7347120, "likes": {"liked": "— Location"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled with family", "text": "the street from Waikiki Beach. The whole area is grossly commercialized and touristy but it is convenient. Close to everything", "title": "Great Location!", "helpfulness": 7, "user": "ColleenK", "date": "March 16, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 7171278, "likes": {"liked": "— Location"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2007, traveled with family", "text": "..restaurants, grocery stores, shopping, etc. We stayed in a 2 bedroom with partial ocean view. The view from our patio was fantastic. The rooms are nothing fancy and some of the furniture and fixtures are older and could use some sprucing up but overall, the condo is very well maintained and clean. My husband and I have stayed", "title": "An Excellent choice for families", "helpfulness": 11, "user": "VacationingParent", "date": "March 3, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 6907201, "likes": {"liked": "— Amazing View", "disliked": "— Dated Lobby"}}, {"rating": 1.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "at the Princeville Resort in Kauai and Grand Wailea in Maui so we like luxury, but this place was very do-able for us since we had 3 extra family members staying with us. At about $2500 for 6 nights, much more economical than staying at a resort. The staff is very helpful and friendly, especially the bell boys..always smiling and eager to help. If you're looking for luxury, this is definitely not the place but if you're with kids or a larger family, this place is perfect and I would highly recommend it.", "title": "Absolutely Horrible, Dont Bother", "helpfulness": 23, "user": "AprilAries", "date": "January 23, 2007", "detail_rating": {"front_desk": 1.0, "business": 3.0, "service": 1.0, "cleanliness": 3.0, "value": 1.0, "location": 2.0, "rooms": 1.0}, "id": 6650507, "likes": {"liked": "— nothing, the entire experience ruined our honeymoon", "disliked": "— everything. at this point i never want to go back to oahu. i'll stay at a different island"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled with family", "text": "We just returned from a trip to Waikiki and Maui - we spent six nights on each island.", "title": "Great place to stay", "helpfulness": 16, "user": "twinsfan-7", "date": "January 21, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 6635495, "likes": {"liked": "— location,friendly staff,rooms", "disliked": "— nothing!"}}, {"rating": 5.0, "title": "Very Nice", "text": "My wife and I recently returned from a five day visit to Oahu and a seven day NCL cruise to the islands of Kauai, Hawaii and Maui. We saw many spectacular sights and enjoyed our visit. I can add little to reviews by other Trip Advisor travelers on Hawaii’s natural beauty, Honolulu’s shopping opportunities or the high cost of goods and services in Hawaii. However, I agree with those that say Hawaii is a “must do”.", "helpfulness": 23, "user": "derPenguin", "date": "January 20, 2007", "id": 6628704}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "I am an avid Trip Advisor reader and always look forward to user reviews and recommendations as part of any vacation planning. This trip was no exception.", "title": "This place rocks", "helpfulness": 18, "user": "sitkadave", "date": "November 13, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6122252, "likes": {"liked": "— The attentiveness and dedication of the staff.", "disliked": "— N/A"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled with family", "text": "Our itinerary included two days before the cruise and three days after the cruise in Honolulu so selecting superior but good value lodging on or near Waikiki Beach was a priority. We were traveling with another couple so we could add condos to the list of properties we would consider.", "title": "Great location, great price", "helpfulness": 15, "user": "jon2211", "date": "November 9, 2006", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 6089899, "likes": {"liked": "— Location, Location, Location", "disliked": "— Nothing - excet confusing elevators"}}, {"rating": 5.0, "title": "Excellent for Families, Great Location", "text": "We just came back from at great 6 night stay at the Resort Quest Beach Tower. We were a group of 7, including a grandparent. This worked perfect for our Family, a kitchenette, washer/dryer, 3 TV's and full ocean view. Upon checkin, we were upgraded to ocean front, given the coupon book, the kids were given their cards and their pails. The bell men and the cleaning ladies were awesome.", "helpfulness": 8, "user": "tmucker05", "date": "June 13, 2007", "id": 7846579}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled with family", "text": "It was not \"luxurious\" but very clean. I would definitely stay there again. We booked through bookit.com for around $2000 and rented a minivan through Hotwire for $239.25, they run a car rental \"extra\" discount about once a month. A lady at AVIS gave us exact directions to the Condo, as it was dark and late when we arrived.", "title": "Wonderful place for families", "helpfulness": 17, "user": "UnitedStatesfan", "date": "June 13, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "business": 3.0, "cleanliness": 5.0, "rooms": 4.0, "location": 5.0}, "id": 7844162, "likes": {"liked": "— Location to beach, room size, close to tourist attractions", "disliked": "— nothing"}}, {"rating": 5.0, "title": "Great Views & Price and Remodelled", "text": "My family and I spent 5 nights at this place and loved it. We booked it through Pleasant Holidays. While Pleasant Holidays has it rated as a four star, the beds, furniture and linens are probably more in line with a AAA rated 3 star similar to a Double Tree or Embassy Suites.", "helpfulness": 1, "user": "applecopter", "date": "May 24, 2007", "id": 7693388}, {"rating": 5.0, "title": "Spot on - location, location, location.", "text": "What the facility lacks in these areas they clearly make up for it in customer service. The front desk goes out of their way to please and the bell boys bend over backwards to assist in what ever your needs are. I dealt with Eddy and Ed almost entirely during the trip and they were wonderful.", "helpfulness": 10, "user": "GumLeaves", "date": "May 4, 2007", "id": 7544122}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled with family", "text": "The rooms are large with 2 bedrooms, 2 baths, full size kitchen and livingroom with dining area. Each room and the livingroom have TV's with extended cable programming. There are large balconies that face the ocean. They suites are approximately 1200 sq. feet in size. There is a washer and dryer in the hallway closet and all cooking utensils needed plus service pieces for 6. While the furniture was a bit outdated and showed signs of wear, the wear is probably no different than most guests' own homes. The plus to this is that if you are travelling with children you don't have to concern yourself with then bringing in sand or sitting with wet clothes on the couches. The kitchen and baths are also stuck in the 80's but are in excellent working condition.", "title": "What a view!!!", "helpfulness": 4, "user": "daphne95", "date": "April 23, 2007", "detail_rating": {"front_desk": 4.0, "business": 1.0, "service": 4.0, "cleanliness": 3.0, "value": 3.0, "location": 5.0, "rooms": 3.0}, "id": 7418632, "likes": {"liked": "— view", "disliked": "— amenities"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2007, traveled with family", "text": "We only stayed one night as we came into Oahu a day before our timeshare rental was available. I rented a 2 bedroom oceanfront deluxe room. We were very pleasantly surprised upon check-in when we were informed that we had been upgraded to the Penthouse suite!Though this room was very nice, I could never see paying the $1300/", "title": "Just One Night", "helpfulness": 2, "user": "myeyegal", "date": "April 21, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 7407862, "likes": {"liked": "— Location", "disliked": "— Price"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled with family", "text": "night it rents for. But what the room lacked, the view more than made", "title": "Solid, spacious condos w/ good amenities; not really 'luxurious,' though", "helpfulness": 18, "user": "richsf", "date": "April 13, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7347803, "likes": {"liked": "— Enormous living space", "disliked": "— 1 rude service encounter (but service excellent overall)"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "My husband and I had a wonderful stay. We especially enjoyed the breakfast at the beach concept and took our breakfast with us on many trips away from the beach.", "title": "Had a great time", "user": "BirthdayGirl83", "date": "May 7, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 15784188, "likes": {"liked": "— Location", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled with family", "text": "The room was nice, clean and we had a great view.", "title": "Fantastic - We'll be back !", "helpfulness": 2, "user": "travelbugss", "date": "May 3, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 15624411, "likes": {"liked": "— Very comfortable and plenty of space for storage / great views / kitchen was great", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled with family", "text": "The restaurant in the hotel has good food and is a nice place to relax after a day of sightseeing, etc.", "title": "Wonderful Family Experience", "helpfulness": 1, "user": "Hope-boy", "date": "April 30, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 15483034, "likes": {"liked": "— Location", "disliked": "— Slightly dated"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled with family", "text": "The staff was very helpful when we needed directions.", "title": "Fantastic Stay at Beach Tower", "helpfulness": 2, "user": "blondelinda", "date": "April 26, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 15371803, "likes": {"liked": "— Location", "disliked": "— Nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2008, traveled with family", "text": "Would love to come back again.", "title": "Will be back again", "helpfulness": 1, "user": "jillch", "date": "April 25, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 15338437, "likes": {"liked": "— Size of rooma", "disliked": "— Slow lifts"}}, {"rating": 4.0, "title": "Nice but", "text": "The staff have always been extremely courteous and helpful to us. Amenities are lacking; no pool or exercise area but there is free internet. Of course, each unit has a complete and very adequate kitchen along with all of the basics, including a small washer/dryer combo (adequate, but not the best).", "user": "cbjim", "date": "February 19, 2008", "id": 13691638}, {"rating": 5.0, "title": "A perfect Apartment Hotel, centrally located with great views", "text": "Unfortunately, the units do show a bit of wear. Decorations are a little dated, paint is dingy in spots, and the bedroom door in both units tended to rattle a bit. Beds were comfortable enough, but not the best.", "user": "Australiahome", "date": "February 2, 2008", "id": 13218240}, {"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled with family", "text": "Our stay at the Resort Quest Beach Tower was very nice. I just love the Resort Quest properties and this one certainly did not disappoint. Our group of 4 stayed from May 16 - 21, 2008 in a 2B/2B condo. It was mostly updated and had a wonderfully large lanai to enjoy breakfast on each morning.", "title": "Great location with plenty of room. Excellent staff! Lovely.", "helpfulness": 1, "user": "ljthumper", "date": "June 4, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 16665737, "likes": {"liked": "— First, location. Second full kitchen with maid service.", "disliked": "— The city noise"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled with friends", "text": "We had a view of Diamond Head from the kitchen window and out one of the master bedroom and bath windows.", "title": "Best place EVER!!!", "user": "gabecagwin", "date": "June 3, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 16646006, "likes": {"liked": "— the room and service"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled with friends", "text": "This condo gave all of us plenty of room without feeling crowded. The exception to this was the guest bathroom was very small and the hall closets were filled with shelving which made it challenging to find a place for the suitcases to live. We managed just fine.", "title": "Paradise within paradise", "user": "wildobuffalo", "date": "June 2, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 16592171, "likes": {"liked": "— everything", "disliked": "— I have returned for 20 years. I love the place and the staff."}}], "location": {"country": "United States"}, "stars": 4, "variance": {"poor": 12, "average": 29, "very good": 185, "terrible": 7, "excellent": 452}, "aka": "Aston Waikiki Beach Tower Hotel", "slim_ranking": 0.0963855421687, "description": "One of Waikiki's most luxurious condominium resorts, Aston Waikiki Beach Tower provides the perfect combination of condominium living and exclusive hotel-quality service. Conveniently located near the center of Waikiki's main stretch, the hotel offers easy access to an eclectic mix of shopping, dining, activities and exciting nightlife. The resort is also just steps away from a wide variety of ocean activities from surfing to snorkeling and parasailing to sunset cruises."}