{"user_rating": 4.0, "review_count": 1084, "name": "Aston Islander on the Beach", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled with family", "text": "There is simply not one bad experience to relate! My daughter, two granddaughters and I had searched Kauai hotels on the internet and decided this was where we wanted to stay. Wow! We could not have been more pleased. They upgraded us to a two room suite that had its own reserved parking spot! Now THAT was wonderful! We had a large lanai with four chairs and two tables. . . and a lovely view of the pool area and the ocean beyond. We took advantage of the hot tub (and large towels picked up at the desk), the lounge chairs on the beach, and the Sand Bar. We had clean, fresh beds every night and plenty of towels for the four of us. Everybody we encountered was friendly and nice. It was quiet, peaceful and perfect!", "title": "Absolutely perfect!", "helpfulness": 5, "user": "PaloDuro", "date": "July 4, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8057229, "likes": {"liked": "— Our room was located in the main building and had a reserved parking spot just steps away from the entrance!", "disliked": "— Ice machine located in another building . . . but it was only a short walk . . . and it was so beautiful, I really didn't mind!"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled solo", "text": "We enjoyed that it was just a short walk from the hotel to the Coconut Marketplace. Not a bad experience there, either. We LOVED Eggbert's for breakfast and we picked up food from the pizza place and took back to our room more than once! There are many nice shops to browse, too!", "title": "Aloha! Beautiful Island...", "helpfulness": 4, "user": "jberry28", "date": "July 3, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8043493, "likes": {"liked": "— Safe and secure, good location.", "disliked": "— Price, choppy waves"}}, {"rating": 5.0, "title": "Great deal, very secluded, perfect honeymoon!", "text": "We loved the chickens and roosters, too!", "helpfulness": 3, "user": "maryk24", "date": "June 29, 2007", "id": 8025717}, {"rating": 4.0, "title": "Great stay, except for the roach", "text": "I have stayed in the ResortQuest in February of 2007 and August of 2006. Overall, the hotel is a great stay in a good location with pretty good weather. The location is good because you can venture to the north and south parts of the island in relatively good time.", "helpfulness": 2, "user": "brown_boiler", "date": "June 26, 2007", "id": 8002157}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "The hotel is located across the street from the Coconut Marketplace, which is a commercial shopping center with tourist stores, food and a small grocery store. The center also has a bar. The hotel does not have a restaurant, so this is a fine compensation. I am not a picky traveler. I traveled alone and I bought some groceries from the grocery store and food from the Coconut Marketplace, and that worked for me. One hut has a barbeque chicken sandwich with pineapple to die for! However, me and a friend did eat at a surrounding hotel and that was good. All of the food I had was excellent. I also felt relatively safe.", "title": "Honeymoon Dream!", "helpfulness": 3, "user": "janel0213", "date": "June 26, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 8001510, "likes": {"liked": "— noise level is so quiet!", "disliked": "— internet access not free in the room."}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "You get more for your money at Islander on the Beach! This was our second stay (June 10-19) at this wonderful resort, and it was even better than our first trip. We stayed in Rm. 249 in the Niihau building. We were literally 30 steps from the beach and the view was incredible!", "title": "Just keeps getting better!", "helpfulness": 3, "user": "MOtravelers", "date": "June 24, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7975489, "likes": {"liked": "— This was an immaculate room with a spectacular view! Oh, and the awesome staff (Aloha and Mahalo, Hattie!).", "disliked": "— Not a thing!"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "Our room was comfortably appointed: queen bed, sitting area, spacious bathroom with plenty of cabinets, including a large linen closet that can also accomodate large pieces of luggage, a kitchenette, in-room safe, and relaxing lanai.", "title": ".....But beware the Partial View", "helpfulness": 3, "user": "Ronaldo72", "date": "June 12, 2007", "detail_rating": {"front_desk": 2.0, "business": 1.0, "service": 3.0, "cleanliness": 4.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 7839265, "likes": {"liked": "— The solitude", "disliked": "— The lack of sea view"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "This resort is well-maintained and clean. The grounds are immaculate and colorful. The pool, hot tub, and Tiki bar (loved the tiki lights at night) were great places to hang out and visit with other travelers and the warm, friendly staff.", "title": "Great View", "helpfulness": 6, "user": "ziona", "date": "May 25, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 7695367, "likes": {"liked": "— great view", "disliked": "— too small kitchenette"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "Honestly, the location is central to everything on the island - shopping (just steps from the Coconut Marketplace), North Shore, South Shore, great snorkeling beaches, restaurants - everything.", "title": "Unpretentious, affordable, very nice!", "helpfulness": 11, "user": "wickedtravel", "date": "May 11, 2007", "detail_rating": {"front_desk": 4.0, "service": 3.0, "business": 4.0, "cleanliness": 3.0, "rooms": 3.0, "location": 5.0}, "id": 7587312, "likes": {"liked": "— Location and cleanliness"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled with family", "text": "We will continue to stay at Islander and, yes, we do recommend it to our family and friends as well!", "title": "We really liked this place!!", "helpfulness": 7, "user": "sitter", "date": "April 16, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 4.0}, "id": 7371652, "likes": {"liked": "— Location & view from rooms.", "disliked": "— Bedding on the pull-out beds & extra towels for 4 females in one room!"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "After staying in Waikiki for a week, this Resortquest Property was a laid back ending to a vacation, as is Kauai. A lot has been written of the postiive of this location and it is all very true, so i won't repeat other than to confirm these highlights:", "title": "Laid Back & Perfect", "helpfulness": 8, "user": "kasey363", "date": "August 22, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8471359, "likes": {"liked": "— Localized feel, oceanfront", "disliked": "— Lugging the luggage up three flights"}}, {"rating": 3.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "Rooms, bathrooms and lanais are spacious and clean, and partial and ocean view have amazing views of the ocean. We had a 3rd floor front ocean view (note to some, there are no elevators, so you have to lug the luggage up). Beautiful. the best part was that you could keep the sliding door open (it has a screen!) and listen to the shorebreak constantly. Great way to fall asleep. The AC is on a timer and will shut off if slider open, still very comfortable temp wise and you can't beat the ocean sounds! Plenty of closet space and drawers, larger fridge, free safe, iron etc)", "title": "Quiet location right on the ocean", "helpfulness": 3, "user": "smartgirl247", "date": "July 27, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 3.0, "value": 3.0, "location": 3.0, "rooms": 2.0}, "id": 8244426, "likes": {"liked": "— Location", "disliked": "— Dark rooms"}}, {"rating": 4.0, "title": "Relaxing, simple, perfect location - highly recommend if no frills are needed !", "text": "Entire grounds are well kept, clean, and no chickens! Pool area with bar is great - maybe very small in comparison to other resorts - but you got the ocean - what are you doing in the pool? Lots of chairs and chairs/loungers on the beachfront - so you can chill out at night under the stars with pineapple wine and listen to the waves. Few huts with large pads on platforms to stay in the shade and snooze.", "helpfulness": 16, "user": "tascorpio11", "date": "July 20, 2007", "id": 8205026}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "Beach isn't exactly \"swimmable\" due to it's constant shorebreak - but it is definietly doable to cool off and extremely clean. If you like to body surf, it's a great spot for a while and definitely convenient. Nice for long walks too.", "title": "Great option on Kauai", "helpfulness": 1, "user": "travelgirl219", "date": "July 16, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 8127413, "likes": {"liked": "— Location", "disliked": "— Not very flexible with check-out times"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "Staff is welcoming and extremely responsive. Location for eats is great in a pinch - Coconut Marketplace had restaurant, fast food huts, and a few bars. Eggberts great for breakfast, banana mac-nut pancakes awesome! Tropical burger was decent, and we got takeout at the rib joint to enjoy on our lanai - and it was really good! Shops are conveneint and there is a rather large market type store - but just drive a mile toward Kapaa and you'll hit strip shopping of Foodland, Big Save, Longs Drugs - stock up there for eats, booze, coffee, and picnic items - much, much cheaper! Cold Stone Creamery for you ice creamaholics too!", "title": "Perfect Describes it Best!!!", "helpfulness": 4, "user": "artofwar", "date": "July 7, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8074114, "likes": {"liked": "— Location", "disliked": "— Can't think of anything"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "We absolutely loved the room, the view, the sounds, the location, the friendliness of the staff - all in all, an amazing visit to the most beautiful island on the planet.", "title": "Affordable home base", "helpfulness": 6, "user": "grskodacek", "date": "April 14, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 7348744, "likes": {"liked": "— Oceanfront", "disliked": "— Difficult parking"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2006, traveled as a couple", "text": "An oceanfront condo is definately worth the extra dollars. Sunrises from our lanai were incredible. We will definately stay here again on our next visit to Kauai.", "title": "Great experience!", "helpfulness": 4, "user": "happyniseiperuana", "date": "March 29, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7245544, "likes": {"liked": "— value for the price"}}, {"rating": 4.0, "title": "Great accomodations!", "text": "I went to Kauai for my 10th wedding anniversary. It was my first time going to HI and I was hesitant to book online. The hotel was great! It is located within walking distance from the Coconut Marketplace where there are many shops and eateries. There is a McDonald's and a grocery store about two blocks away. The hotel is good for couples that do not want room service or any extra pampering. The rooms include microwaves and refrigerators...you can even have a barbeque by the pool if you like. There is beach access from the hotel but it is not the best for swimming but it provides a great view.", "helpfulness": 4, "user": "Smallu", "date": "March 17, 2007", "id": 7173977}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled with friends", "text": "Highly recommended for independent do-it-yourself travelers and would definitely stay there again!", "title": "Friendly, Beautiful and Immaculate", "helpfulness": 3, "user": "blutrtlfreak77", "date": "March 14, 2007", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 7162927, "likes": {"liked": "— The view from our room and the cleanliness", "disliked": "— No restaurants in the hotel"}}, {"rating": 3.0, "title": "Two beds", "text": "At first glance, I wasn't overly impressed with our hotel, but I wasn't turned off by it either. After perusing the grounds, I came to like the layout of the mulitple hotel buildings and the wandering grounds that are meticulously maintained. The beach here is long and glorious to stroll from hotel bar to hotel bar or to watch sunrises and sunsets. The surf is too rough (at least this time of year) to do much more than that. The complex was quiet and we were some of the youngest people there (we are in our 30s). The staff were friendly, helpful, knowledgeable. Bring a laptop, though, if you want free internet (otherwise it's $0.15 per minute). The location of this hotel is great, in my opinion. It is well off the street, right on the beach, yet within walking distance of the Coconut Marketplace shopping center. Many restaurants, a Long's Drug, and a Safeway are a short drive away. If you are going to be out exploring the island a lot, as we did, you'll like the East shore, because you're halfway between the North and South shore \"action\". After visting the massively populated beaches (and their surrounding resorts) near Po'ipu and Princeville, I came to appreciate my temporary community even more. This hotel provides you with a free copy of Newsweek and the Newspaper (daily). The bathrooms are huge with a full linen closet. We made many breakfasts in our mini-kitchen and were able to fully unpack our clothes thanks to the large wardrobe and dresser. The reasons why I don't give this hotel an excellent rating: the room cleaning (especially floor) could've been better (additionally, they seemed to remember to give us a bathmat only every other day), the coffee pot went out, there were two sets of hollow-cored doors (each interior-locking) between us and a somewhat loud next-door neighbor, the bar doesn't open until 2 p.m., there are no restaurant or spa facilities (but there are at the very next hotel over).", "helpfulness": 3, "user": "rhnepal", "date": "March 11, 2007", "id": 7013429}], "location": {"country": "United States"}, "stars": 3, "variance": {"poor": 69, "average": 161, "very good": 435, "terrible": 37, "excellent": 382}, "aka": "Aston Islander On The Beach Hotel Kapaa", "slim_ranking": 0.5, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.5}, "description": "This newly-renovated oceanfront resort offers guests contemporary island-inspired decor, six acres of beautifully landscaped grounds, a sparkling pool and a stunning beachfront location. Enjoy the convenience of the adjacent Coconut Marketplace's 60 boutiques and restaurants. Oceanfront location and plantation-style charm make this relaxing resort the most enticing retreat on Kauai."}