{"user_rating": 4.5, "review_count": 275, "name": "At Home Wellington", "reviews": [{"rating": 5.0, "title": "Great location and comfort for a reasonable price!", "text": "We stayed at the At Home Apartments for one night and were very pleasantly surprised by the location of the apartments, cleanliness and comfort of the room.", "user": "Angelco", "date": "March 15, 2009", "id": 26233914}, {"rating": 4.0, "title": "Great location, room, and friendly managers", "text": "We had an early flight into Wellington and thought we'd drop off our bags and return later to check into our room. The manager kindly let us in and, as our room was ready, checked us in straight away. He also encouraged us to take it easy in the morning and check out around lunchtime, which was most appreciated.", "user": "NikauTrampr", "date": "March 8, 2009", "id": 25835767}, {"rating": 4.0, "title": "Great little independent hotel in a great location", "text": "The apartments are very well appointed with self catering kitchens and laundry facilities. The bathroom was roomy and the bed was very comfortable. There was a reasonably sized flatscreen television and small balcony looking down onto Te Papa museum. The location is great- close to Courtney Place and the waterfront.", "user": "PixieChick69", "date": "March 6, 2009", "id": 25674973}, {"rating": 5.0, "title": "This place is wonderful", "text": "I was very happy with the accommodation and will definitely stay again.", "user": "TomStuber", "date": "March 5, 2009", "id": 25650572}, {"rating": 5.0, "title": "A home away from home", "text": "We usually stay in Oriental Bay but were meeting friends so wanted a balcony for evening G&Ts. Our balcony was small and faced the business end of Te Papa but with ample afternoon sun definitely did the trick.", "user": "LetsDoLunch", "date": "March 5, 2009", "id": 25611848}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "We were very well welcomed in this boutique hotel. The room was clean, spacious, extremely well designed. And the café beneath the hotel offered great breakfasts.", "title": "Superbe Boutique Hotel in Wellington!", "helpfulness": 7, "user": "cyberanto", "date": "April 7, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7290279, "likes": {"disliked": "— Hard to find front enterance."}}, {"rating": 5.0, "title": "the best hotel in Wellington and one of the best in the world", "text": "From booking to arrival to stay, this hotel differentiated itself as being superior.", "user": "MJ_OZ3000", "date": "March 4, 2009", "id": 25589230}, {"rating": 5.0, "title": "Perfect Spot!", "text": "At last Wellington has a hotel that befits its status as a capital city.", "user": "PinkNZ", "date": "January 1, 2009", "id": 23149415}, {"rating": 5.0, "title": "Feels like your own apartment", "text": "I won t stay elsewhere in Wellington.", "user": "wenbryant", "date": "October 28, 2008", "id": 21360977}, {"rating": 5.0, "title": "Home away from home", "text": "First up the location is brilliant- handy to Te Papa (National Museum of NZ), the waterfront, supermarkets, entertainment areas, shopping precincts and within an easy waterfront walk to most business offices in Wellington (and that waterfront stroll has got to be one of the best commutes in the world!)", "user": "Diana_and_Sho", "date": "August 28, 2008", "id": 19457389}, {"rating": 4.0, "title": "Felt right at home...", "text": "What works for me next are the very generous rooms with ALL of the facilities you might need IN YOUR ROOM such as washer, TV, generous cupboards, crockery, cutlery, indoor and outdoor easting areas.Free wifi- Thank you! Stunning balcony areas which do make you feel at home are a superb feature.", "user": "portugal2006", "date": "May 16, 2007", "id": 7629587}], "location": {}, "stars": 4, "variance": {"poor": 2, "average": 13, "very good": 60, "terrible": 1, "excellent": 199}, "aka": "At Home Wellington Hotel Wellington", "slim_ranking": 0.0196078431373, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 5.0}, "description": "If you are looking for a place that makes you feel like you are home, then At Home is the place. All our rooms have balconies, wireless internet, kitchens, TVs/DVD, IPOD dock/charger and en-suite bathroom. Being Located right in the heart of Wellington with one side looking out at Te Papa, and the other the night life hub means that whilst you stay with us you can enjoy all that Wellington has to offer easily. We look forward to meeting you soon."}