{"user_rating": 3.5, "review_count": 376, "name": "At Wind Chimes Boutique Hotel", "reviews": [{"rating": 3.0, "title": "reserve early", "text": "After vacating a rundown hotel, we were scrambling for somewhere quiet & clean to stay. Our first room here was outside of the bar area, noisy. The next room was beside the front desk where the phone rang throughout the night and guests departed from all hours of the night. The 3rd room was finally much better. We had to pay for the 6 nights in advance when we checked in. They were going to penalize us one night stay if we cancelled early and left, (even in the morning).", "helpfulness": 4, "user": "gulfislanders", "date": "March 2, 2007", "id": 6898995}, {"rating": 4.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "The pool was lovely. The lounge chairs had gorgeous thick cushions perfect for napping. The beach is only a block away. It is only a few blocks away from lots of restaurants in Condado. The food at the bar was very good and the staff very nice.", "title": "Great quiet place to stay", "helpfulness": 6, "user": "Jasubar", "date": "February 16, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 6800849, "likes": {"liked": "— Homey feeling, especially at the Boat Bar", "disliked": "— Lack of storage space in room for suitcases"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2005, traveled as a couple", "text": "At Windchimes has a very homey feeling to it...the kind of place where by the end of the first day, the bartender knows your name and you know what he does as his passion when he’s not pouring drinks to pay the bills. It’s this kind of feeling that will definitely have us coming back again. The inn’s Boat Bar creates a central gathering spot that makes for congenial interaction with other guests. In addition to a full selection of libations, the Boat Bar also features a handful of menu items for breakfast, lunch and dinner, and the bartenders bent over backwards to meet special requests, whether they be for food or drink.", "title": "Nice Little Hotel", "helpfulness": 5, "user": "jmsny", "date": "January 24, 2007", "detail_rating": {"front_desk": 4.0, "business": 1.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 2.0, "rooms": 3.0}, "id": 6687461, "likes": {"liked": "— proximity to the beach", "disliked": "— location from restaraunts and nightlife"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "The room itself was well-kept, spacious and with plenty of light. Our top-floor room had a king-size bed and a separate sitting area with a futon couch. The sitting area also had a small table and two chairs, along with a mini-fridge and a microwave. There was also a tiny, tiny balcony that was only large enough for one person to stand on at a time. A lot of windows let in ample light, although I understand the first-floor rooms are much darker.", "title": "Charming Hidden Hideaway", "helpfulness": 5, "user": "TexasWebfeet", "date": "January 24, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 6655046, "likes": {"liked": "— Small, intimate and warm", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2004, traveled with friends", "text": "In the hallway outside of our room was a “lending library” of paperbacks...take one, leave one. There was also a table and chairs where one could sit outside of the room. The free wi-fi extended up to this area, although not into our room. The public areas of the inn also feature many cozy sitting areas. There is a small pool, which we never actually used, and a separate sun deck. Condado Beach can easily be walked to within a couple of minutes, and many restaurants and shops are also nearby. We felt quite safe walking in the area – it is very residential and every evening we would pass people out walking their dogs or taking an after-dinner stroll. As in all of the Condado area as well as Old San Juan, police patrols are frequent and obvious, countering any reputation the city has as a place for crime.", "title": "Wonderful little hotel", "helpfulness": 6, "user": "mmweaver", "date": "November 20, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 6157239, "likes": {"liked": "— the outdoor bar", "disliked": "— the small pool"}}, {"rating": 1.0, "title": "Will not come back", "text": "We stayed here over Christmas break and will not be coming back. Our room was very uncomfortable, the towels were mouldy and when we requested fresh ones, we got others that were marginally better. Slimy stuff on the window-sill. Staff was helpful when we could track them down, but tracking them down was the hard part. Overall, very poor use of money. Not going back.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "January 19, 2005", "id": 3018455}, {"rating": 1.0, "title": "Horribly Unprofessional", "text": "This was our second trip to Puerto Rico and we learnt the day of arrival that the staff at Wind Chimes Inn had lost our reservation and could not accommodate us, even though I had called in 3 weeks before arrival and they had confirmed our reservation. When I made my reservation (months ahead) I asked them to send me an e-mail with the reservation details. They did not. When I called 3 weeks before arrival, I asked them to send me an e-mail with the reservation details. They did not.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "January 19, 2005", "id": 3018331}, {"rating": 4.0, "stay_parameters": "Stayed January 2005", "text": "Net result, we arrived in San Juan without a place to stay.", "title": "great place to stay!", "helpfulness": 1, "user": "pekkleloca", "date": "January 17, 2005", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 3012736}, {"rating": 5.0, "title": "coming home", "text": "Found the staff to be horribly rude and unprofessional when we talked to them over the phone. I dont like to put up with such prima donna like behavior on my vacation, and especially when I'm paying for it!!!", "user": "papoulos1", "date": "January 16, 2005", "id": 3010042}, {"rating": 5.0, "title": "Nicest Guest House in Ocean Park", "text": "THANK GOODNESS for the Andalucia, a couple of blocks down the street from the totally unprofessional Wind Chimes Inn. Small, clean place with tasteful decor. Reasonable prices. Above all, professional and friendly proprietors who strive to please. Hope to go back again soon.", "helpfulness": 2, "user": "still-Wandering", "date": "January 7, 2005", "id": 2987713}, {"rating": 3.0, "title": "Positive and Negative", "text": "We just returned from a three night stay, pre cruise, at the Inn.", "helpfulness": 12, "user": "hollywoodChicago", "date": "February 21, 2005", "id": 3214798}, {"rating": 4.0, "title": "great boutique hotel", "text": "Positives about the Inn: Very clean, expert housekeeping and friendly staff. Location near the beach and nightlife is good. 25 cent bus ride to Old San Juan is a great value and fun. Bebo's restaurant, don't miss it. A full breakfast for two will cost about $10.00. The Inn arranged a trip to the rain forest with Hector, from Eco tours. He was great. If you do this tour ask for him. Our king corner room was bright and tastefully decorated. However, from previous reviews there seems to be a disparity among the rooms. We didn't use the pool, but it appeared clean. The pictures on the internet correctly depict the Inn.", "helpfulness": 11, "user": "A TripAdvisor user", "date": "February 8, 2005", "id": 3172620}, {"rating": 1.0, "title": "worst experience in PR", "text": "Negatives from our perspective: The Inn sits on a busy street (Mc Cleary). We stayed the weekend and the street noise (motorcycles, loud music from the bar and dogs barking) kept me awake most of the night. True, we could have turned on the air conditioning, but that was also noisy. Because the weather was not too hot I preferred to sleep with the windows open. The food at the bar was overpriced and not too good. I have never seen an omelet made on a George Foreman grill before! Go to Bebo's.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "February 8, 2005", "id": 3172584}, {"rating": 5.0, "title": "What a great place!", "text": "This Inn is a good value compared to the overpriced hotels on the island, so if you don't mind the noise I would recommend it. Had it not been for the noise I would have given it an Excellent rating.", "helpfulness": 8, "user": "A TripAdvisor user", "date": "January 28, 2005", "id": 3092529}, {"rating": 5.0, "stay_parameters": "Stayed October 2003", "text": "This hotel is nice. We just came back from Puerto Rico and managed to squeeze one night at the WindChimes. The only problem I found is that when you try to make a reservation online or over the phone, they demand you reserve for 3 consecutive nights. However, once I was there they were able to accomodate us. I got a guest room with all the ammenities that I needed. It's not luxurious, but for the reasonable price you get a clean room, fresh towels, clean sheets, and cable... The bartender was great. She gave us suggestions of the hot spots in old San Juan. The staff was very helpful and the security of the place was top notch. You needed a key to come in and out of the gates. I would recommend this hotel, especially for single women. It's 5 minutes away from Isla Verde and 15 minutes away from old San Juan. There are several places to eat within walking distance. The pool was of good size, however, it was a bit chilly to dip in.. It's February.....", "title": "Wonderful!", "helpfulness": 5, "user": "juju32", "date": "January 27, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 3091493}, {"rating": 1.0, "title": "Disappointment....Will not return!", "text": "Although the staff was warm and friendly, they were not terriblly helpful or accommodating. The room was dingy and badly in need of updating. There was no door to the bathroom. The room was tiny, you could barely walk around the bed and there were no amenities. The television was tiny and the cable kept going out. The shower temperature was erratic and it took about twenty minutes to get lukewarm water. On two of the three nights we were there we were kept up by loud and rowdy guests who were partying right outside of our door. When we called the desk to complain, nobody answered the phone. When we complained the next morning the manager told us that it was spring break and we should have expected noise. There are much nicer hotels that have amenities and are near the beach. I will stay in one of those hotels the next time.", "user": "A TripAdvisor user", "date": "April 23, 2006", "id": 4998320}, {"rating": 4.0, "title": "Fabulous!", "text": "We were three runaway housewifes in need of \"me\" time. Wind Chimes was what we needed. This place is a FABULOUS place to relax and mingle with mature and friendly people. Exotic and secluded. Not open to the public (unless you have a key). There are so many corners in this inn to just relax and mellow in. The staff from the desk to the cleaning is very professional and friendly. Food in the Bar is great as well as the drinks. Closed to everything (even a Seven-eleven nearby!!). Great Room! Great tanning decks! No hustle & bustle! They even do your laundry for a small fee. Room was clean every day. Front desk was very helpful with information. We have vowed to return to Wind Chime and make it our getaway place. I stayed 5 days and could have stayed 5 more!!", "user": "Bestmom42sons", "date": "April 20, 2006", "id": 4990638}, {"rating": 3.0, "title": "cute place, nice staff", "text": "Stayed here for 5 nights with 2 other friends. THe room was adequate and faced the street out front. The staff was courteous and helpful at all times. This place is quaint and our room was comfortable, though I think there is a WIDE variance in room quality. I only have 2 complaints for this hotel. One, the shower was terrible. The water pressure was such that it felt like you were being pelted by 100 little needles, and the temperature was impossible to regulate. Two, the hotel is a little removed from the main strip of stores and restaurants, which meant you had a minimum 10 minute walk to get anywhere, and as much as a 30 minute walk to get to the far end of the strip(maybe longer, but that was as far my friendsand I felt like walking).", "user": "wtebeau", "date": "April 1, 2006", "id": 4826422}, {"rating": 4.0, "title": "Always fun!", "text": "As far as the housekeeping, the staff again is friendly and accomodating but they did not change the sheets one time the whole 5 nights we were there, and I doubt they ever swept. By the end of our stay, the sand on the floor was a little gross. Otherwise, everything was great, the place is cute, and adequate for a trip where you don't really plan to hang out in your room.", "user": "LatinoGuy", "date": "April 1, 2006", "id": 4825965}, {"rating": 3.0, "title": "moderte", "text": "This was our second visit to the oddly-named \"At Windchimes Inn\" in Condado. It's a great little place with excellent service and the most agreeable professional staff ever.", "user": "overniteTPE", "date": "March 19, 2006", "id": 4692416}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "At Wind Chimes Inn was exactly as pictured on its website - charming and clean. The staff was very friendly and helpful. The location was good - in the residential area of Condado, a 5-minute walk to the beautiful beach, and a 10-minute walk to the local bakery (there is an authentic bakery a few blocks east of the inn, in Ocean Park). You have to take a cab or drive to Old San Juan and to the nightlife in Condado (bars, casinos, restaurants). The cab ride to the nightlife in Condado was $8, or a 20-25 minute (sweaty) walk. We did not go to the inn bar and restaurant, but there were always people there, and we have heard that the food is good. Our room was perfect - the only one located on the top floor with the terrace. The terrace is open to the patrons, but no one goes up there. The only small downfall to the inn is the lack of parking in the parking lot - we saved $10, but had to park on a busy street a block away. We would stay at At Wind Chimes Inn again.", "title": "Great!", "helpfulness": 5, "user": "1SCREEN1NAME1", "date": "November 14, 2006", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6131849, "likes": {"liked": "— Privacy", "disliked": "— Parking"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "My husband and I stayed here from Oct. 13 - 16. Nice location.- it was easy to get to Isla Verde, Condado and Old San Juan. We rented a car and paid the extra $10 a day for parking which worked out fine. We only used the pool once but it was very relaxing. We had breakfast one morning at the bar and the food was just great.", "title": "Nice place to stay", "helpfulness": 4, "user": "ct968", "date": "October 17, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 3.0, "value": 4.0, "rooms": 3.0, "location": 5.0}, "id": 5964281, "likes": {"liked": "— Location, ambiance and staff", "disliked": "— Bathroom was a litle small"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled with friends", "text": "We stayed in room 103 which had a king size bed, and kitchenette. We didn't use the stove but it was really nice having the mini-refrigerator. The bed was comfy enough. The bathroom was very small but that didn't bother us much.", "title": "Absolutely loved At Wind Chimes! (try using the 1-800# to reserve:)", "helpfulness": 7, "user": "rootsie", "date": "October 11, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 5942752, "likes": {"liked": "— The charm of the Inn itself - very beautiful", "disliked": "— Parking"}}, {"rating": 1.0, "title": "Unreliable Reservation System", "text": "We'd definately stay here again.", "helpfulness": 1, "user": "willshabshis", "date": "October 8, 2006", "id": 5927389}, {"rating": 4.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "I need to start by saying that I returned from AWCI yesterday and the poster who made the rude comments below could have phoned the hotel directly for his reservation via the 1-800# as we did to ensure they had one. It was in fact because of my conversation with the reservation staff that I decided to book my stay there. I was so glad that I did as they, and AWCI, were among the highlights of our trip. Not sure if they were trying to book for a cheaper rate than the $99 room that they offer but trust me when I say that it was more than worth the price and there were DEFINITELY no bugs there!", "title": "lOVED it", "helpfulness": 3, "user": "juani55", "date": "August 5, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 3.0}, "id": 5561217}, {"rating": 5.0, "title": "Great!", "text": "I stayed at this inn over the Christmas holiday and loved the place. The staff were helpful and professional. They gave us towels for the beach and told us how to get around the city (can't beat the 25 cent bus ride to Old San Juan - the bus stop was a 3 minute walk away). The hotel bar's food was simple, but did the job after coming in from a day in the sun. The bar served great drinks at reasonable prices. I felt at home at the hotel.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "January 5, 2005", "id": 2978966}, {"rating": 4.0, "title": "Thumbs up", "text": "My husband and I were at the Wind Chimes from Nov. 14 - 27, 2004. I booked on-line and there was no choice in rooms. Upon arrival I asked for an upgrade and we were accomodated the next day. We stayed at the additional house which looked to be still in progress 1/2 block down the road > closer to the beach. Rooms were somewhat small but very clean and nicely furnished. The bathromm was also in good condition. Both rooms were kept in imacioulous conditions by the cleaning staff during our stay. The gated doors of that house were kept closed (guests had a key) and we felt safe and comfy there. We checked out the breakfast bar twice. The first time was great. A German lady most efficient and very friendly served us a sumptious breakfast. On our last morning, our second breakfast, it was a little less uplifting > mix-up in the order, missing food item, food came at different times for my husband and myselve etc. We were served by 2 people of which one said he didn't do the breakfast bar for a while and the second one spoke Spanish only and was just given instructions. So Ok Breakast bar was soso. Parking is a problem. Not many spaces and you have to make reservation otherwise you find yourselve circleling the blocks. The pool was a dissapointment. It looked nice in the pictures but turned out to be just a little more than a bath tup. The staff at the reception/concierge desk was fantastic. Always extremely helpfull and really friendly and sincere. Thumbs way up for these ladies. THANK YOU!!! To the neighorhood. At first it looked a little run down which it was. But for the people in the stores and restaurants they were warm and friendly to us tourists and made us feel ok and safe. No problem there. Buses are readily accessable and a bargain for 25 cents just one block off the hotel. No need for taxis. The beach looked nice and clean and hardly anybody enjoying it at the time we were there. For somebody who doesn't like the hype of the big hotel chains this hotel is perfect. It's clean, quite, private and everything is easily accessable. Also, Puerto Ricans are special people. Respect and kindness is in full swing. That's what we have experienced at our stay at this lovely island. My husbad and I are 48 and 54 years young of mixed race and culture and like to do things our way especially on our vacation. We hate to be put on a schedule or box, or told when to do and what to wear or being insulted or disrespected by other guests or anybody or anything for that matter. PEACE", "helpfulness": 5, "user": "A TripAdvisor user", "date": "January 4, 2005", "id": 2975424}, {"rating": 4.0, "title": "Very nice hotel", "text": "We recently spent 3 nites at the Wind Chimes. Staff very helpful, rooms nice (but small) and a little bit of a walk to restaurants in the Condado area. The area the hotel is in (at the edge of the Condado) seemed a little desolate at night. The way the hotel is set up makes it very conducive to interacting with other guests at the bar & pool. Make sure you ask to be in the main building, there is an annex building as well. Overall it was a positive experience and a good value for the money.", "helpfulness": 2, "user": "smdnyc", "date": "January 4, 2005", "id": 2974347}, {"rating": 4.0, "title": "A ringing success", "text": "My wife and I stayed at Wind Chimes for three nights prior to a cruise departure and found the accommodations to be very nice. Our room was clean and comfortable. It's a uniquely attractive inn and while the pool was far from large it made for a great cool evening dip. The staff was very helpful. It arranged a rain forest tour for us and offered a great tip for breakfast at Kasalta, a local restaurant a few blocks from the inn. As advertised, the inn is just a short block from the beach. Generally, this place earns high marks. Figure 30-40 minute bus ride to Old San Juan. But who's complaining at a 25-cent fare.", "helpfulness": 4, "user": "gastup", "date": "December 29, 2004", "id": 2963985}, {"rating": 1.0, "title": "uncomfortable", "text": "Dear friends,", "helpfulness": 4, "user": "A TripAdvisor user", "date": "September 21, 2004", "id": 2589091}, {"rating": 3.0, "title": "not bad..", "text": "This place is okay--nice location, quiet street, with delicious local places to eat.", "helpfulness": 2, "user": "cocofri32", "date": "August 31, 2004", "id": 2505343}, {"rating": 4.0, "stay_parameters": "Stayed July 2004", "text": "The food at the place is overcharged, the bar staff are great.", "title": "We really enjoyed it!", "helpfulness": 5, "user": "sunnytrees", "date": "August 12, 2004", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "service": 3.0}, "id": 2443961}, {"rating": 3.0, "title": "Nice but not FABULOUS", "text": "The rooms are clean.", "helpfulness": 5, "user": "clm2006", "date": "August 8, 2004", "id": 2430414}, {"rating": 2.0, "title": "Don't go here if you can afford not to..", "text": "Don't like the fact that they take the full cost up front.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "August 7, 2004", "id": 2427855}, {"rating": 3.0, "title": "Good but is it safe?", "text": "Front desk attendants are hit or miss.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "July 30, 2004", "id": 2335470}, {"rating": 3.0, "title": "Charming, pleasant staff", "text": "We stayed here three nights in July. I would recommend the hotel for stays no longer than three nights, and for couples/singles without children: there isn’t much that children can walk to.", "user": "cdillard", "date": "July 31, 2006", "id": 5533047}, {"rating": 4.0, "title": "Nice Place To Stay!!!", "text": "Accommodations. Our room was in the back, past the boat bar. Accommodations were comfortable, slightly above basic. The ceiling fan made the room actually quite cool, even with the A/C turned to low. The bathroom door was slotted (like blinds) so there was almost no privacy. The shower had a curtain, but was otherwise open; the size of a tub. I agree with comments that the water takes awhile to warm up: let it run about five minutes before jumping in. The pool is small, but is great if you can snag it to yourselves (which isn’t hard to do).", "user": "A TripAdvisor user", "date": "July 11, 2006", "id": 5457362}, {"rating": 3.0, "title": "not fancy; but nice.", "text": "Staff. The staff was very friendly. They directed us to restaurants, the bus stop and the Pueblo. When it came time for us to venture beyond San Juan, they assisted us with a car rental and a flight back from Vieques. The man at the front desk was very informative about the flights, ferries and car rentals, providing us with information to help make our decision about transportation to and from Vieques. The beach is just one block from the hotel, and is not at all crowded. If you have a rental car while staying here, check with the hotel first (in advance) to find out if they have a parking space available (very limited parking). If not, you will have to park on the street—and there is not much space on the street, either. For the one night we had our car at the hotel, we had to park illegally on the street, along with about a dozen other cars. There were no problems, but it made me nervous.", "user": "graceCP", "date": "June 9, 2006", "id": 5328457}, {"rating": 2.0, "title": "just \"ok\"", "text": "Dining. Most of the Condado restaurants are about a mile up Ashford Avenue (which is called McLeary in front of the hotel). Bebo’s is a Puerto Rican cuisine restaurant a bit closer, about two blocks toward Condado on Calle Loiza. They are fairly inexpensive ($10pp) and seem to be quite popular with locals.", "user": "cdillard", "date": "June 6, 2006", "id": 5315322}, {"rating": 4.0, "title": "Perfect Little Getaway !!", "text": "Transportation. The A5 bus runs to Old San Juan for $.75/person each way. It picks up on Calle Loiza; ask the front desk to direct you. If you take a taxi back from Old San Juan, go to the Plaza Colon (in front of San Cristobal). There is a taxi stand here, and because it’s at the edge of town, you won’t have to sit in OSJ traffic. We took a taxi from Plaza Colon to At Wind Chimes Inn and it was $12.", "user": "blondiejan", "date": "June 1, 2006", "id": 5289031}], "location": {"country": "Caribbean", "city": "San Juan"}, "stars": 2.5, "variance": {"poor": 31, "average": 60, "very good": 118, "terrible": 35, "excellent": 132}, "aka": "At Wind Chimes Hotel San Juan", "slim_ranking": 0.446808510638, "description": "A truly intimate boutique hotel, At Wind Chimes Inn is a restored Colonial Spanish Villa located in Condado, San Juan. The inn is a short block away from the nicest beach on the North Shore. Our tropical rooms have 10' ceilings, terracotta floors & private bathrooms, A/C, and basic cable TV. WIFI is available in the common areas. Visit our famous Tiki Boat Bar!"}