{"user_rating": 4.0, "review_count": 405, "name": "Athenaeum Hotel", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled with friends", "text": "We were pleasantly surprised by the state and location of this hotel. Although some reviews complain about it being far away, I beg to differ. I will clarify that I am under the age of 30 but I hope I've got a good few more years in me before I consider a 10 minute walk to the centre of town a distance worthy of note.", "title": "Contemporary and spotless", "helpfulness": 3, "user": "Serendipity80", "date": "August 29, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 3.0, "rooms": 5.0}, "id": 8535194, "likes": {"liked": "— Modern feel of rooms, spotless bathrooms, bathrobes/slippers", "disliked": "— breakfast"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "The breakfast was nothing to write home about but given that we only got up in time for breakfast once that was not an issue.", "title": "A Gem!", "helpfulness": 2, "user": "kerrl6", "date": "August 20, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 8457708, "likes": {"liked": "— It was modern and had lots of special touches.", "disliked": "— The spare pillow smelled a little musty."}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "The hotel staff were pleasant and helpful and all in all we had a great time.", "title": "Brilliant Stay", "helpfulness": 4, "user": "TrueRed", "date": "August 17, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8441245, "likes": {"liked": "— Cleanliness and friendliness of staff", "disliked": "— Nothing"}}, {"rating": 1.0, "stay_parameters": "Stayed July 2007", "text": "On the downside, I did notice some women arriving only to be sent to a sister hotel up the road for the first night when told there was no availability...even when they had the confirmation email with them in their hands. So perhaps we were just the lucky ones and you should probably call the hotel in advance to confirm that they have received your reservation.", "title": "4 stars it's a joke", "helpfulness": 2, "user": "davidRio", "date": "August 1, 2007", "detail_rating": {"front_desk": 1.0, "business": 2.0, "service": 2.0, "cleanliness": 2.0, "value": 1.0, "location": 1.0, "rooms": 1.0}, "id": 8272450, "likes": {"liked": "— the smell of smokers in the room and no choise to change"}}, {"rating": 1.0, "stay_parameters": "Stayed May 2007, traveled on business", "text": "I had read great reviews about this hotel so was expecting it to be nice and wasn't disappointed! This is a great hotel with lots of extra little touches to make you feel really special.", "title": "This Will Take the Shine Off Florence", "helpfulness": 3, "user": "larrythelamb", "date": "July 27, 2007", "detail_rating": {"front_desk": 2.0, "business": 2.0, "service": 1.0, "cleanliness": 2.0, "value": 1.0, "location": 1.0, "rooms": 1.0}, "id": 8240566, "likes": {"liked": "— very 2nd class"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled with friends", "text": "Lovely hotel, with superb staff but with one big problem. I stay there from 4 to 10 April and i have to fight for my breakfast..... I have to explain this, so... the bread was always to little for all the roomers and you have to wait to refill the hamper. I have to face the same problem with water, cheese, ham but the problem was fixed (not at all) after a conversation i had with the reception. These was the bad things all the others was good enough for me. The staff was friendly and ready to help, the hotel was clean, with a modern decoration and the distance from the center was only a 5-7 minutes walk. Florence probably is the most beautifull city all over the world, so i'm waiting to go again soon.", "title": "Good hotel with one fool problem", "helpfulness": 3, "user": "pirros77", "date": "April 13, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 7344429, "likes": {"liked": "— The decoration", "disliked": "— The breakfast"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "Hotel Athenaeum was indeed a very nice hotel, with a modern look and feel. It was very clean, the staff very helpful, offered free use of a computer with internet access, and had particularly nice bathrooms. The major downside in my opinion would be the location. It is a fair walk (15 minutes down a regular city street) to the main attractions of the city. My fiancee and I are young and walked every where in Italy, but found this walk more rather annoying. Unlike Rome or Venice there was nothing to see walking to and from the hotel. After a full day of touring we typically would return back to the room before dinner. Who wants to walk another 15-20 min at night through a non spectacular part of the city just o reach a restaurant? The the amenities were great for the price but I would have downgraded for something more centrally located.", "title": "Very modern, but not a great location", "helpfulness": 2, "user": "wsjester", "date": "April 11, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 3.0, "location": 2.0, "rooms": 5.0}, "id": 7331004, "likes": {"liked": "— the modern amenities", "disliked": "— lthe ocation"}}], "location": {"country": "Italy", "region": "Tuscany", "continent": "Europe"}, "stars": 4, "variance": {"poor": 12, "average": 65, "very good": 173, "terrible": 12, "excellent": 143}, "aka": "Athenaeum Hotel Florence", "slim_ranking": 0.380952380952, "description": "Design, art and business in a 4-star Hotel in Florence. The Academy of Fine Art and the David statue are just round the corner! The ideal location for business or leisure visitors, Hotel Athenaeum in Florence is where contemporary design, modern style and classic materials skillfully combine with art and culture. Hotel Athenaeum’ strategic location in the heart of Florence is the perfect starting point for visitors willing to discover the town or business people alike. The Hotel offers a top international service and a warm welcome.Hotel Athenaeum has 60 rooms, a conference room, a restaurant, a bar and a capacious private garage."}