{"user_rating": 3.5, "review_count": 94, "name": "Atlanta Hotel", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed April 2006, traveled with family", "text": "The Atlanta was conveniently located just 2 tram stops from Schottentor, and plenty of trams to choose from. Getting around in Vienna was no problem by trams and U-Bahn. My room was on the top floor, with a quirky old fashioned cage lift rising through the centre of the spiral staircase (which only went to the 4th floor), then a long flight of steep stairs to the 5th floor (unfortunately). Room was nice and quiet, with an excellent bathroom and very good bed. Breakfast room was very nice, just off a beautiful piano lounge, and with a reasonable variety of foods, but no hot choices. Good value for money.", "title": "Elegant medium price hotel", "helpfulness": 7, "user": "Wombat_Sydney", "date": "January 14, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 6594094, "likes": {"liked": "— CONVENIENT LOCATION TO CITY CENTRE", "disliked": "— Stairs from 4th to 5th floor"}}, {"rating": 1.0, "stay_parameters": "Stayed August 2006, traveled on business", "text": "I have been in Vienna in September 2006; we have stayed in Atlanta Hotel for 5 nights.", "title": "this is not a 4 star hotel", "helpfulness": 8, "user": "Alina77", "date": "September 25, 2006", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 3.0, "value": 1.0, "location": 4.0, "rooms": 2.0}, "id": 5833878, "likes": {"liked": "— the location", "disliked": "— personnel"}}, {"rating": 1.0, "title": "Too noisy to sleep, too much smoking", "text": "They don’t have a place to park your car when you first arrive to the hotel. After our check in, they allow us to park our car in their parking place. They asked us to move our car 5 times in the first 1 hour. We were with 2 cars. At the end of the first day, one of our cars was on the hotel parking place and another in a free place, in the same court; because they didn’t have any another available places. They told us that next day they will notice us if would have a place available. They didn’t do this but at the end charged us with 2 parking place, they tried to convince us that one more parking place was reserved for us, but we have not be aware of this.", "helpfulness": 9, "user": "Jennih60", "date": "May 18, 2006", "id": 5180685}, {"rating": 4.0, "stay_parameters": "Stayed July 2005", "text": "The personnel is extremely rude, doesn’t know to count, the receptionist tried hardly to explain us that 9 x 5 is 54.", "title": "Great hotel", "helpfulness": 5, "user": "Wijo_Koek", "date": "March 26, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "service": 3.0}, "id": 4734679}, {"rating": 4.0, "stay_parameters": "Stayed December 2005", "text": "The internet access in one computer in the hotel lobby, I couldn’t connect my notebook to the internet.", "title": "Great Value", "helpfulness": 6, "user": "Jenny K", "date": "January 20, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4365360}, {"rating": 3.0, "title": "Mixed bag", "text": "The Atlanta is ok but nothing special. The rooms were reasonably large, comfortable and clean. However, as with previous reviews we found that there was little/no service at all. We were dissapointed with breakfast as not only was the food unimaginative but they did not provide enough seats for the number of guests in their hotel - one morning we had to stand outside the breakfast room and wait for 20 minutes to eat because there were no seats available - and we were not the only guests having to wait like this. In terms of location it is ok - a good 20 minute walk from the main attractions though. There is no hotel restaurant though there is a doorway connecting the hotel to the restaurant next door. We ate in there once but wouldn't do so again - the food was mediocre and the room smoke-filled. For the price I definitely would go to a different hotel next time.", "helpfulness": 8, "user": "A TripAdvisor user", "date": "October 29, 2005", "id": 4070251}, {"rating": 1.0, "title": "be careful, very dissapointing place", "text": "On a different note - I would be very interested to hear from anybody who may have had a somewhat spooky experience whilst staying in this hotel?", "helpfulness": 8, "user": "A TripAdvisor user", "date": "October 17, 2005", "id": 4028297}, {"rating": 2.0, "title": "be careful", "text": "The hotel is located by a very busy main road. It is very noise and all of us (group of 5) did hardly sleep at all. There is almost no service. The hotel did not allow us for eraly departure, they charged us a extra night. We were very dissapointed with our stay at this place.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "September 25, 2005", "id": 3936933}, {"rating": 4.0, "stay_parameters": "Stayed August 2004", "text": "me and others i was travelling with were disappointed with this hotel due to noise and lack of services. we therefore wanted to cut short a 4 night stay, giving more than 24 hours notice. we were informed that we would not be able to change our reservation and would have to pay anyway. we were so upset that we left anyway and will try to deal with these guys through the travel agent or our credit card. bottom line, don't commit to these guys up front - you will be in trouble if you change your mind.", "title": "Pleasant stay", "helpfulness": 5, "user": "jws207", "date": "September 8, 2004", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "service": 3.0}, "id": 2518942}, {"rating": 4.0, "title": "Friendly Small Hotel in Good Location", "text": "this is a noisy hotel with little sound insulation in the rooms, little/no tv, no internet access, noisy creaky floors. with so many choices in vienna, stay away from this one.", "helpfulness": 24, "user": "maxnosk", "date": "March 17, 2004", "id": 1729125}], "location": {"country": "Austria", "continent": "Europe"}, "stars": 4, "variance": {"poor": 9, "average": 19, "very good": 42, "terrible": 8, "excellent": 16}, "aka": "Atlanta Hotel Vienna", "slim_ranking": 0.632152588556, "description": "Old Vienna"}