{"user_rating": 3.5, "review_count": 742, "name": "Atlante Garden Hotel", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled with family", "text": "Family vacation in Rome this past October and we stayed at the Atlante Garden Hotel. Rented 3 rooms, all on the same floor and right next to each other, though would have been nice to have some space between family!! What was odd, was that each room was so different and each room had very different comforts. We were on the 3rd floor facing the side street, which is much quieter than the main street. Rooms all clean, however you have to enter the bathroom, and step up a step to use the toliet and or tub. The tub is a jacuzzi tub, but when I used mine (room #344), the water ran out from under the tub onto the marble title floor, making it very slippery. It only leaked when the jets were on. The tub is also the shower, and stepping out of it, on to the first step is a bit scary. The breakfast served each morning was excellent, probably the best I have had in my many trips to Italy. The female staff, from the servers, bar maid, room cleaners, etc...were all very friendly and polite. The male staff was professional, but never overtly friendly. Location can't be beat, 5 blocks or so from the Vatican. Metro station is also about 5 blocks away. Would stay here again. P.S. take advantage of the 5th floor patio area. We would share a bottle of wine each night under the stars and the staff was always helpful with getting us glasses or ice when need free of charge.", "title": "Comfortable Hotel with professional Staff", "user": "Lawin4cr", "date": "October 15, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 83549905}, {"rating": 5.0, "stay_parameters": "Stayed September 2010", "text": "I have just completed my fourth visit to Rome and each time I have stayed at the Atlante Garden. On this occasion I spent 14 nights here and enjoyed each and every one of them. The twin room was very clean and comfortable, as is the rest of the hotel. House keeping is exceptionally good here. The continental style breakfast is more than adequate and the young ladies who take care of the breakfast room are friendly and helpful. All the staff that I came into contact with were very friendly and very helpful, and knowledgable. I wouldnt want to stay anywhere else, in fact I am already planning my next visit to Rome and looking forward to returning to the Atlante Garden.", "title": "The ONLY hotel I want to stay at", "user": "nollymac", "date": "October 12, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 83237512}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "I visited Rome with my girlfriend back in August this year for her birthday and was very happy with the hotel. The free-transfer from the airport direct to the hotel was very useful and the location of the hotel itself made getting around the city very easy, with buses and the subway running nearby.", "title": "Had a great time and a great stay, would very much recommend", "user": "k_dopson", "date": "October 4, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 82037027}, {"rating": 3.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "The room was clean and comfortable and the staff were very helpful with any questions we had to ask.", "title": "Gutes Hotel, in de Nähe vom Vatikan, nettes Personal", "user": "SWH2010", "date": "October 3, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 81906770}, {"rating": 3.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "Great time and great memories!", "title": "Nice hotel, great location for sights", "user": "brummiesi1979", "date": "September 27, 2010", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 81235926}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "Atlante Garden Hotel is a nice hotel - good value for the money. Polite and nice staff, good service - and we liked the location; 10 minutes walk to the main street to the Vatican where all the 'hop on-hop-off' buses were assembled; and we used such a bus to get around all of Rome. And a cozy bar where we could round off an evening or two.", "title": "A pleasant stay!", "user": "Lenny10Oslo", "date": "September 3, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 78102237}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "So why not this hotel next time (2nd time..) we visit this fantastic city??", "title": "Very nice hotel", "user": "Norjost", "date": "September 2, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 77995778}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "We stayed for four days and had a superiour double room. Nice and quiet room (away from traffic), attractive bathroom with jacuzzi, even better, a teracce on the roof of the hotel. We purchased some parma and fruit from the local market - the old style, just a block away. They changed carpets on a few rooms we observed. Obviously, the management knows that clean, nice and tidy makes a huge difference.", "title": "Wonderful people, pretty little room", "user": "philzaga", "date": "September 1, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 77818657}, {"rating": 1.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "My fiance and I stayed at this hotel in mid-August. They had a driver pick us up from the airport (shuttle bus, minivan kind of thing) and took us directly to the hotel. Once we got there, they were kind enough to let us leave our luggage with them until check-in time so that we could walk around (we went to Castel San Angelo 3 blocks away and then to the Pantheon, about a 20 minute walk away). When we got back, our room was ready and they kindly showed us our way. The room was small, by US standards, but it was cozy and clean. It was prettier than I expected and had all the things that I needed. The only minor thing that I didn't like about this hotel was that it was not near central Rome. It is by the Vatican, on the left bank of the Tiber River. In order to get to ancient Rome, you'd either have to take a cab (about 7 euros) or walk (about 30 minutes) or take public transportation (we didn't do this so I can't tell you how it is). Also, it is much quieter on the left bank of the Tiber than it is on the right bank (perhaps more so than usual since we went in August). Almost all of the shopping, good dining, and the tourist attractions (except for the Vatican of course) is on the right bank of the Tiber, and pretty far from the hotel. Luckily for us, we booked all our tours with hotel pick-up so none of this was an issue. Don't let me scare you though, the location is not terrible. It's not in the middle of nowhere. It's 4 blocks from the river, so you can get to the right bank by foot with no problems, if that's what you want to do. Also, a 7 euro cab ride to the center of the city is not bad at all, and we did it quite a number of times. Both of us enjoyed this hotel very much and would stay there again in the future.", "title": "Rip off hotel - stay at UNA Hotel instead.", "user": "Eli155019", "date": "August 31, 2010", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 3.0, "rooms": 1.0, "location": 3.0}, "id": 77618853}, {"rating": 5.0, "stay_parameters": "Stayed July 2010", "text": "My husband and I stayed at the Atlante Garden for two nights and were sorely disappointed.", "title": "fabulous", "user": "jackie186470", "date": "August 26, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 76930125}, {"rating": 3.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "Atlante Garden hotel experience was fantastic. I travel globally for a living, and must say, the value was excellent. First, we arrived at the airport, bags took 1.5 hours, but the dirver was still waiting for us, the free transportation to the hotel is a fantastic benefit. The staff were extremely kind and helpful. We had a room for a family of 4. The room was very large. TV lacked some good English stations, but we were not in Rome for TV. Beds comfortable, AC worked fantastic, which is hard to find in Rome. Bathroom was large, with jacuzzi tub. Decor was loud, but fit our needs. We loved this hotel and will be back. The neighborhood was full of great restaurants, Ottavania metro was a very short walk. Staff booked and recommended a tour, overall very good, not a luxury hotel, but for seeing Rome, great!", "title": "Great experience at Atlante Garden", "user": "scottbug2", "date": "August 19, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 75940297}, {"rating": 3.0, "stay_parameters": "Stayed August 2010", "text": "The location to the Vatican and St. Peter's square couldn't be better. Just a short walk away. Breakfast was good. Front desk service great. Rooms too humid and warm for me. Way too noisy at night. Could hear outside traffic all night long. Room service was greatly missed. Like having coffee in my room first thing in the morning, before having to get ready for the day. Seems to be the norm in Europe, unless you stay in an American chain hotel. If you want a nice place to stay for a visit to the Vatican, this one would be good. Just ask for a room away from night traffic noise.", "title": "Location great, service great, rooms gloomy and too warm.", "user": "mamanana25", "date": "August 13, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 2.0, "rooms": 3.0, "location": 5.0}, "id": 75003408}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "Perfect location for the Vatican,literally 2 minute walk.Walking distance to every where else-Spanish steps,Trevi fountain,Colloseum etc etc etc.Hotel is amazing.staff very helpful and accomodating.Rooms are beautiful,jacuzzi bath is a must!Location is perfect,lots of restaurants nearby.We can't rate this hotel highly enough,can't wait to go back again", "title": "An absolutely beautiful hotel.Staff amazing.Will definately stay again", "user": "Lyndsay-Tim", "date": "August 11, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 74722529}, {"rating": 2.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "The location of this hotel is great for the vatican, but further away from everything else. This hotel is just not a 4 star by any standards. It isn't even a 3 star. The reception is in the basement. The room we had (132) was small, very dark and dingy. The carpets were visibly worn out in places and dirty. The decor was old, dark and drab. The bathroom was slightly better, but you could see from grout lines where the tiles were missing from the side of the bath. The room was crying out for refurbishment and was also very small. The shower flooded the floor after every use. We had to request extra towels and pillows, as they only provided 2 of each. These items were delivered promptly. No breakfast was provided in our priceline rate and cost 12 euros per person - we ate out for breakfast, so I can't comment on the food quality. There were no tea/coffee making facilities in the rooms. The room looked directly onto the street, and when I asked to change to a quieter room, I was told both nights that there was no availability.", "title": "Not a 4 star", "user": "lwilliams75", "date": "August 4, 2010", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 2.0, "sleep": 3.0, "rooms": 1.0, "location": 4.0}, "id": 73813905}, {"rating": 3.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "We stayed here for 2 nights, and then we moved to a different hotel on the other side of Rome, which was MUCH better (Starhotels Metropole) and provided a free breakfast. The nightly rate was similar at both hotels. I would not return to this hotel again.", "title": "Not in city center, but close to the Vatican and free airport pick-up is well worth it.", "user": "Nightingale0527", "date": "August 4, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 3.0}, "id": 73686101}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "From the free transfer they were friendly and helpful, and very informative. The room was bigger than we expected, and a jacuzzi was a nice surprise. Would definitely go back.", "title": "The friendliest hotel I've stayed in.", "user": "steveo123456", "date": "September 27, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 81224214}, {"rating": 3.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "This is not The Ritz, but then it doesn’t pretend to be and, for traveling on a budget, this was a good deal for the price paid in downtown Rome literally a five minute walk to the Vatican. The property and room were clean and the staff very friendly and helpful. The advertised rooftop restaurant no longer exists and anyone asking for it is referred to a sister hotel a few blocks away which apparently has one. We didn’t try the breakfast service but it looked attractive and appetizing.", "title": "Overall, a nice, quiet hotel and good value for the money!", "user": "Blarnee", "date": "September 16, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 79799319}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "The electrical was scary. The TV cable connection had to be “jiggled” every so often to recover the signal which kept cutting out. The TV power plug also had to be regularly “jiggled” after unexpected cut outs. Upon removing a bedside plug from the wall the entire faceplate of the plug came away too. When coupled with the fact that the only fire exits seem to be the stairs alongside the single, central (tiny) elevator, I was not left feeling at all comfortable about my means of emergency exit in the event of a fire.", "title": "Good value with friendly,helpful staff", "helpfulness": 1, "user": "Jumick", "date": "September 15, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 79689922}, {"rating": 1.0, "stay_parameters": "Stayed September 2010, traveled with family", "text": "The wall shower Faucet was loosely connected to the wall and the showerhead was ill-fitting making showering a bit difficult. Otherwise the bathroom was very clean and daily, freshly laundered, towels were exceptionally good. Air Conditioning controls did not seem to function properly so the room tended to vary between too hot or too cold.", "title": "Not anywhere close to a four star hotel.", "user": "singerlady", "date": "September 14, 2010", "detail_rating": {"service": 2.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 4.0}, "id": 79523833}, {"rating": 4.0, "title": "Good position, comfortable, friendly, a little tired but a good price", "text": "The hotel was quiet, the beds comfortable and overall we enjoyed our stay and would probably return.", "user": "rholland", "date": "September 8, 2010", "id": 78768698}], "location": {"country": "Italy", "region": "Lazio", "continent": "Europe", "city": "Rome"}, "stars": 4, "variance": {"poor": 79, "average": 139, "very good": 285, "terrible": 48, "excellent": 191}, "aka": "Hotel Atlante Garden", "slim_ranking": 0.377760252366, "description": "The 4 star Hotel Atlante Garden is situated in the heart of Rome, two blocks on foot from the Vatican City, five from Navona Square and the Spanish Steps, in one of the most famous shopping areas The Hotel offers 50 completely renovated guest rooms, all with Jacuzzi bath tubs and all other comforts. Our clients may take advantage of the exclusive free of charge FCO - Leonardo da Vinci airport pick-up service, upon request. Moreover, if they wish, clients can dine on the panoramic Roof Garden Restaurant “Les Etoiles” of the sister Hotel Atlante Star, located right next door."}