{"user_rating": 4.5, "review_count": 228, "name": "Atlanta Marriott Alpharetta", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "We are from Tampa, FL and visit Atlanta often. We debated staying in Alpharetta due to the distance away from Atlanta. Being right off of GA 400 this hotel is quite a drive from downtown Atlanta however close to the North Point Mall and several restaurants. We visited Lake Lanier Islands and the N Georgia Premium outlets which were only about 30 minutes away. Our last stay in downtown Atlanta at the Marriott Marquis 8/2006 was dreadful. The Marriott Alpharetta was simply a flawless stay. Downtown Atlanta doesn't have much to offer at night, other than Hard Rock Cafe and who wants to hassle with valet parking. The Marriott Alpharetta however offers free self parking. The hotel exceeded our expectations. We booked a King Room with breakfast included (either in room or hotel restaurant) through Marriott.com. Being Marriott Rewards/Elite Members we expect each stay to be perfect which this one was. The breakfast buffet was wonderful. Overall, very nice hotel, clean rooms and a very comfortable bed.", "title": "Dec 27- Dec 30 Great Hotel!!", "helpfulness": 5, "user": "Mikeucfknights", "date": "January 9, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 6568457, "likes": {"liked": "— Clean Rooms, Pleasant Staff and Great Breakfast", "disliked": "— Distance from MARTA trains, Park & Ride is nearby"}}, {"rating": 4.0, "title": "Great hotel for business travelers", "text": "I recently stayed here on a business trip and we really enjoyed our stay. Clean, comfortable rooms (typical of a Marriott) and friendly staff members. Great atmosphere as there is a large bar area downstairs for people to congregate and it was busy almost every night.", "user": "NicoleandKyle", "date": "April 2, 2008", "id": 14753915}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "Only problem is that there are a TON of people here and parking was a nightmare - I walked a ton to get to the lobby from my car. Also, very easy to miss the entrance to the hotel and get on the expressway instead, so be careful!", "title": "Wow, was that the right nightly Rate?", "user": "jeffpriz", "date": "March 31, 2008", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 14681332, "likes": {"liked": "— our room, the pool, the fitness room, the food......", "disliked": "— Marriott's internet policy"}}, {"rating": 5.0, "title": "Every Marriott should be like this.", "text": "We paid a lot for this stay - $235 per night, but I imagine that's more the weekday business rate and weekends are cheaper.", "user": "briny319", "date": "January 5, 2008", "id": 12341873}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled on business", "text": "My wife, 2 boys, and I just returned from a Saturday overnight stay at the Alpharetta Marriott, and we loved it! Nice, Marriott hotel experience, great location, and an unbelievable rate. I booked from the marriott website, and took the rate that included the breakfast for the family (well worth it!), and the whole time we were there my wife kept asking me how much we were paying, because she just didn't think it was right... :)", "title": "The Best in the Area", "helpfulness": 1, "user": "Mighty-Red", "date": "July 17, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 8132170, "likes": {"liked": "— Location just off GA400", "disliked": "— Breakfast was too formal"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "The hotel was very nice, the room was comfortable and clean, the staff was friendly and helpful, I even had good luck and was able to check in early without any troubles. The pool was perfect for me and my boys, the workout room had several nice treadmills and eliptical machines (there were weights too.. but I was there for a run). Finally, the breakfast buffet in the vidalia restaurant was very very good.", "title": "Nice hotel to stay in", "helpfulness": 2, "user": "MaryK404", "date": "April 2, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 7270341, "likes": {"liked": "— Clean and bright rooms, and right off major hiway making it easier to get to planned events", "disliked": "— Nothing comes to mind. Everything was just fine for what we were looking for."}}], "location": {"country": "United States", "city": "Alpharetta"}, "stars": 3.5, "variance": {"poor": 6, "average": 20, "very good": 84, "terrible": 4, "excellent": 114}, "aka": "Atlanta Marriott Alpharetta Hotel Alpharetta", "slim_ranking": 0.214285714286}