{"user_rating": 4.0, "review_count": 41, "name": "Atlantic Host Hotel", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed May 2011, traveled on business", "text": "The Atlantic Host Hotel is a typical North American hotel built in the 1980s (in terms of layout and decor), however despite being an older facility, the hotel is maintained very well and kept neat and clean. During my stay, we utilized one of the number of conference rooms. The staff was prompt and the rooms were set-up and stocked to our satisfaction. The onsite restaurant and lounge offered a great spot to continue our meeting over supper. The meals were very enjoyable and at a fair price. The hotel has done its best to keep the rooms acceptable with updates such as flat screen televisions and some furniture items, however decor and bedding give the reminder that the hotel is older. Despite this, the hotel has done a great job maintaining the rooms' cleanliness and fuctionality; evident that the hotel keeps up on maintainence, which also demonstrates the hotel's commitment. Apart from the conference rooms and onsite restaurant/lounge, the hotel offers a nice indoor pool and fitness room. In the main lobby, guest can utilize the \"single\" internet accessible computer, however a good wireless internet connection is available through the hotel. The choices are limited for hotels in the Bathurst area. By simply having the understanding that this hotel is not a \"5 Star\" and your stay at the Atlantic Host should be an acceptable one. I would stay again at the Atlantic Host Hotel.", "title": "Great Conference Location with Good Onsite Amenties.", "helpfulness": 2, "user": "StandingRoom", "date": "May 14, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 108239746}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled on business", "text": "Let me start this review by saying there is limited choice when it comes to Hotels in Bathurst. I was surprised by the location of the hotel. Needless to say if you're expecting a 5 star resort this is not it. For its location and age (Let's not kid ourselves) this hotel was very well maintained (Currently being remodeled) I stayed in a nice \"Business\" Suite. The room was SPOTLESS (and I'm picky about this!). The Internet was quite fast for a Hotel and I had no problems to teleconference with colleagues.", "title": "Great Hotel in for the Bathurst Area!", "user": "MatthewBarrington", "date": "March 23, 2011", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 101266724}, {"rating": 3.0, "stay_parameters": "Stayed November 2009, traveled on business", "text": "The bed was the best part. One of the most comfortable I’ve had in quite a while.", "title": "Hockey hotel", "user": "sarafima86", "date": "May 24, 2010", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "sleep": 2.0, "location": 4.0, "service": 5.0}, "id": 65214149}, {"rating": 5.0, "title": "Honeymoon in 1994", "text": "Now this hotel is a bit lacking in the product and service they offer. Don't forget any toiletries, they will send you to the drug store.", "user": "Roosternutz", "date": "February 13, 2010", "id": 55879789}], "location": {"country": "Canada", "city": "Bathurst"}, "variance": {"poor": 5, "average": 7, "very good": 17, "terrible": 1, "excellent": 11}, "aka": "Atlantic Host Hotel Bathurst, New Brunswick", "slim_ranking": 0.833333333333, "description": "If you or someone you know are travelling to Bathurst, come see us here at The Atlantic Host Hotel. With all our guest rooms having been newly renovated you will have the comforts of \"home away from home\" with our luxurious pillow top mattresses and great amenities to ensure you a great night's rest. \"Always the Perfect Host\""}