{"user_rating": 3.5, "review_count": 2368, "name": "Atlantis - Beach Tower", "reviews": [{"rating": 2.0, "title": "Customer service was horrible!", "text": "We just returned a few days ago from a 4-day, 3 night \"girls vacation\".", "helpfulness": 11, "user": "A TripAdvisor user", "date": "April 15, 2005", "id": 3366461}, {"rating": 1.0, "title": "Stay somewhere else", "text": "One of the people on this trip had been to Atlantis last year and had no problems. We however experienced many if not all of the problems the other reviews have detailed.", "helpfulness": 16, "user": "A TripAdvisor user", "date": "April 12, 2005", "id": 3352919}, {"rating": 2.0, "title": "Family Trip to Nassau", "text": "Our biggest complaint was that some of the restaurants on our meal plan were closed without notice on multiple nights. We never truly had a choice of places to eat. One particular night- we went to the 6:30 Movie of Oceans Twelve -to have the sound break with 15 minutes left to the movie- what a waste of time. We went to the casino to play and then eat at the Atlas bar and grill- the only one open late- only to find it was closed. We went to guest services to complain because at this point all the other restaurants were closing- they did nothing for us, except agree we had nowhere to eat!! They sent us to the night manager - Sherry- who didn't even look at us when were talking- extremely rude- and she said room service was our only option and this would be covered under our meal plan as a \"comp\". We explained our frustration with lack of choices to eat every night and no notice of closings- she told us the staff needed \"days off\", and didn't seem to care. So we ate on our bed that night~", "helpfulness": 7, "user": "A TripAdvisor user", "date": "April 12, 2005", "id": 3352269}, {"rating": 1.0, "title": "Rude and Overpriced!!", "text": "The next morning we took our complaints to the Manager of the front desk- Ruth- she didn't really want to hear our complaint either so she said we could have lunch at Atlas and they would pay for it. We tried to ask what would be closed later in the week and she didn't know at that time. So there was no use trying to plan out our meals.", "helpfulness": 11, "user": "A TripAdvisor user", "date": "April 11, 2005", "id": 3350899}, {"rating": 2.0, "title": "Atlantis-Terrible Service & Little Relaxation", "text": "We had other run in's with the hotel staff not worth mentioning but we were shocked at the lack of professionalism and rudeness.", "helpfulness": 14, "user": "brookiewoo", "date": "April 11, 2005", "id": 3349525}, {"rating": 4.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "This was our second time returning to the Atlantis in Nassau Bahamas. We went last year in early December and stayed in the Beach tower. The resort is amazing. We loved it so much my husband and I decided to treat each other for Christmas again this year.", "title": "Coral Towers Atlantis - Not bad at all", "helpfulness": 10, "user": "gucci913", "date": "January 15, 2007", "detail_rating": {"front_desk": 3.0, "service": 2.0, "cleanliness": 3.0, "value": 4.0, "rooms": 3.0, "location": 5.0}, "id": 6599297, "likes": {"liked": "— can't find a pay phone that accepts calling cards", "disliked": "— the library in the coral towers allows 15 minutes free daily of internet access"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "We loved the Atlantis last year, the overall experience was fantastic. You never need to leave the resort. There are several dining choices, comedy club, movie theater, casino, sea life/aquariums and much more. There is something to do for all ages. We did feel that once we returned to our room in the Beach tower we felt like we were in the Holiday inn. The rooms were ample and clean but the decor was very blah. But we were never in the room so it wasn't much of a concern to us.", "title": "Loved Atlantis", "helpfulness": 11, "user": "nadia_y", "date": "January 13, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 6590091, "likes": {"liked": "— Pools, beach, scenery", "disliked": "— Crowded"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2005, traveled with family", "text": "This year we returned to Atlantis again. They were running so many specials and we were able to get the Coral Tower for even cheaper than what we paid last year for the beach. The Coral is more centrally located and the room seemed a bit fresher in my opinion. I woulnd't exactly say it was a huge upgrade, but none the less we were okay with it.", "title": "It Was A Gorgeous Place!!!!!!!!!!", "helpfulness": 12, "user": "RBBR", "date": "January 13, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 6588586, "likes": {"liked": "— I loved that we had great views, and great pools!", "disliked": "— I loved everything I don't think that there really were any big problems!"}}, {"rating": 4.0, "title": "Nothing to complain about", "text": "The dining is exceptional. We've been to a lot of the places to eat dinner over our last few trips. We knew what we were in for when we booked. Dinner can easily cost a couple $100+ for dinner and drinks. We like to drink a few cocktails with our dinners and had budgeted for that expense. The Breakfast buffet was not that great in my opinion. No one can really screw up breakfast but I didn't think the Vegas prices were worth the experience. There is a Jamba juice in the Marina and bagel/coffee carts in the hotel lobby (even that is outrageous). We love Luciano's outside of the resort, it's the one place where you can actually get outside dining at night by the water. It was well worth the short cab ride over the bridge.", "helpfulness": 7, "user": "eamesToronto", "date": "January 11, 2007", "id": 6577054}, {"rating": 4.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "The service: It really depends on where you are, I found most people to be very friendly. However I must warn you that My mother was rushed into the hospital on our 2nd night and my family had tried to contact me for an emergency. And the hotel stated they had no way of getting in touch with me besides leaving a message in our room. They have no PA system. One would have thought they would have looked to see if we had a dinner reservation (which we did). They will not go out of their way for you. But I must mention the night manager was empathetic and allowed me to use their office PCs to check for outgoing flights at 1:00am.", "title": "Had a great time! Resort was beautiful but definitely overrated", "helpfulness": 16, "user": "LilEllie", "date": "January 11, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 3.0, "rooms": 3.0}, "id": 6575061}, {"rating": 5.0, "title": "Atlantis Paradise Resort", "text": "A while back me and my family went to Atlantis resort for a 3 night 4 day stay. I recommend that amount of time to be able to take a 30 minute ferry ride to downtown Nassau to check out the straw market. The rest of your time should be used, and rightly so, exploring the Aqautic life exhibits and other hotel activites. The hotel grounds are so large that it would be impossible to see it all in one trip, they offer so many excursions and activities that you never really get the whole experience. When at at Atlantis I suggest that you go to the excursion booth and have a swim with the Dolphins at Blue Lagoon Island. The ride over and back is lengthy but well worth the wait as the dolphins over there are wonderfully playful, and well trained. The food is the only objectionable flaw on the whole. It is pricey so beware and make it worth it. To breakaway from the pricey food at the resort go down to the Excursion Booth and book a dinner on a Viking ship only 5 minutes away at the Nassau Marina. The food is wonderful, and the culture the excursion offers is once in a life time. The crew definitely makes you feel relaxed and in the Bahaman feel. Only eat at the predator's lagoon to see one of the main aquatic exhibits underneath and the gorgeous painted ceiling. The Predator's Lagoon's building is a wonder in itself, shaped like a giant shell help up by seaweed covered pedastals. Food there is pricey, and it is your basic soup shop food. The Atlas Bar and Grill is probably the way to go. The food is wonderful there, and only a short while away from the ice cream shop for kids and located in the casino for adults. The rooms in the Royal towers where we stayed are absolutely made for royalty. However in getting a room with a view of the ocean and expecting panaramic beaches and such you will probably be disappointed and end up wishing you had paid less for a regular royal room. The beach view is a bit industrial and has a gym right next to it. The artwork such as the Chihuly glass sculptures and the murals on the ceilings are awe inspiring. The casino offers a thrilling experience for anyone willing to spend a buck or two. The pools and water slides of the Mayan Temple will leave you wanting to ride it again and again and again though the line is lengthy. Atlantis is simply in a league of its own when it comes to regal hotels, beautiful wild life, awe inspiring art, and an experience that you will remember all your life.", "helpfulness": 26, "user": "A TripAdvisor user", "date": "April 25, 2005", "id": 3402654}, {"rating": 2.0, "stay_parameters": "Stayed April 2005", "text": "We just returned from our stay at the Atlantis for April vacation, so I am writing this while it is fresh in my mind. On a scale of 1 to 10, I rate our vacation as a 5. We stayed in the Royal Towers. I had heard such great things about this hotel and how beautiful it was, and this was all true. The grounds are beautifully landscaped and there is so much to see around each corner. I was also told it was very expensive there, but I had no idea how expensive! I have travelled quite a bit and am not afraid when things cost $$$, but this was ridiculous! Nothing was included in our rates except for that 15% gratuity. You have to pay $15 per person per day to use the gym facilities which is not right. The paddle boats, etc. that are located at the beautiful lagoon are extra - I believe it was $45 for 30 minutes. A large bottle of water was almost $5 at one stand and $6 at another! One cheeseburger at the grill was $9. I got a grilled chicken sandwich for $8.50 which was comprised of a piece of chicken the size of 3 fingers on a hamburger roll. No tomatoes, no lettuce - nothing! We purchased the Modified Meal Plan, but the choices of restaurants was so limited, we only used it for 4 dinners. We did use it for the breakfast buffet which was okay, but we couldn't get a decent cup of coffee one day! You'd think a 4 star hotel could give you at least a decent cup of coffee. I did get tired of my feet sticking to the floor in front of the fruit station! And on the days you didn't want a huge breakfast, you couldn't even get a free cup of coffee from the continental breakfast! The staff was friendly, most of the time. I did have to call housekeeping because I was sick of looking at the room service tray that was left beside our door for 2 days!! And it wasn't even ours! I tried to call the front desk and/or dinner reservations - I eventually put the phone on speakerphone because it must have rang for 10 minutes straight with no one picking up at the other end - and that is no exaggeration! The hotel is too big and not enough staff. We definitely will not be going back.", "title": "Won't be going back!", "helpfulness": 14, "user": "jensemBoston", "date": "April 24, 2005", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "rooms": 4.0, "service": 2.0}, "id": 3401311}, {"rating": 1.0, "stay_parameters": "Stayed August 2004", "text": "Althought the grounds are beutiful, my family will NEVER go back. Hearburn and indigestion have no place on a family vacation. After arriving at the Atlantis with prepaid (over $8,000) reservations in hand, My wife and 4 daughters were told that the resort was overbooked and that a room was not be available. I was told that they \"might\" be able to find me a hotel for the night back down the street (pointing in the direction of the locals drinking on the street corner we just passed). I requested to speak with the manager and after a long wait, an equally uncaring person emerged from the back room with the same \"no problem man\" attitude. After a lengthy effort, my family was split up for the first night. The manager insisted that I would be paying for the \"upgrade,\" however, his supervisor assured me there would be no additional charge. At checkout, I was not surprised to see that I was being charged an additional amount for the first night for BOTH rooms. I was pleased just to pay the regular room rate, although I expected either a discount of some type or maybe an apoligy, neither of which occurred.", "title": "Never going back", "helpfulness": 15, "user": "Scott805", "date": "April 23, 2005", "detail_rating": {"cleanliness": 4.0, "value": 1.0, "rooms": 2.0, "service": 1.0}, "id": 3400439}, {"rating": 5.0, "stay_parameters": "Stayed April 2005", "text": "Reservations at the restaurants were running 1-2 hours behind every night (again overbooked) and the added gratuity every time you purchased anything was an absolute rip off as I never found ONE employee that cared (or even acted like they cared) about the guests. EVERYTHING was overpriced. If the employees moved any slower, they would be going backwards. After a few days, my wife and I just laughed, as the service and attitudes were a joke. We have traveled to many Carribean destinations, and the service and professionalism at the Atlantis has been the absolute worst...by far. Save your money and avoid the hearburn and indigestion like we will since we are NEVER GOING BACK!", "title": "Loved it", "helpfulness": 7, "user": "rocky20", "date": "April 23, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3399995}, {"rating": 4.0, "stay_parameters": "Stayed April 2005", "text": "We traveled with our two children 6 and9 and had a great time. Yes food is a little expensive for kids, but you can certainly get a burger by the beach which was more affordable. We were there for spring break and the beach was closed so the pools were busy. However, there are enough pools that I did not feel overcrowded. We stayed at the hotel and did not leave for our three night stay.", "title": "Beautiful", "helpfulness": 12, "user": "GROOMANDBRIDE", "date": "April 20, 2005", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 5.0, "service": 5.0}, "id": 3394307}, {"rating": 2.0, "title": "overwhelming and overcrowded Atlantis", "text": "The perfect trip to Atlantis is 2 days, just enough so that the children can take some of the water slides and a jet ski ride. If you must have the casino, this is definately the place, if you want relaxation and island living, stay away. The rates are high and the rooms are small, the food is expensive and average. The beach is awful and full of jet skis, boats and locals wanting to make a quick buck. Walk to the other side of the beach towards the Ocean Club Hotel, there it is more relaxing and the waters are surprisingly calmer. The place is overcrowded, it feels like you have not arrived in the islands but in downtown Manahattan. If you must visit Atlantis with your children, make it short and sweet.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "April 20, 2005", "id": 3393664}, {"rating": 4.0, "stay_parameters": "Stayed April 2005", "text": "We were at Atlantis for three days and two nights, April 9-12, 2005. We had our 15 month old son with us. We stayed at the Beach tower, which is at best, a decent Holiday Inn. They tried to upgrade the room a little with new marble vanities in the bathroom, but still, it wasnt that nice. Having read other reviews though, I expected this. We did have a quite nice ocean view with a small balcony. They gave us a crib for our son, which was pretty flimsy, though serviceable.", "title": "We loved it despite sub par rooms", "helpfulness": 19, "user": "amy1229", "date": "April 17, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 2.0, "service": 4.0}, "id": 3371222}, {"rating": 4.0, "stay_parameters": "Stayed April 2005", "text": "We thought the grounds were amazing and beautiful. There are water slides and attraction for every age and thrill level. There is a lazy river our son really liked. There are tons of pools and coves and other areas to hide off in, so you can really limit your time spent in your hotel room. The beach is nice, but we were going to the Four Seasons for four nights after this stop, which is known for its beach, so we didnt spend much time there.", "title": "Atlantis is Great", "helpfulness": 7, "user": "jkpemay", "date": "April 17, 2005", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "rooms": 2.0, "service": 3.0}, "id": 3369805}, {"rating": 4.0, "title": "Loved it, will definately go back", "text": "The acquariums are wonderful. We went through several times. The Dolphin Encounter is unforgettable and a must do. However, they do keep you at the Encounter location for at least an hour after the event ends. There is a little snack bar, etc there so it isnt so bad, but we didnt expect to be there so long. Maybe 3 hours for the total trip. It is amazing though. Also, expect to spend at least $75 in pictures there, you will buy some, trust me. If you go with another couple, dont get in the same group (but stay on same platform) so you can video each other. You cant really take pictures if you are just with your immediate family.", "helpfulness": 16, "user": "A TripAdvisor user", "date": "April 17, 2005", "id": 3369036}, {"rating": 5.0, "title": "Best holiday ever!!!!", "text": "All I can recommend on food, is diet while in the Bahamas. Ive never seen such pricey food and its not even that good. We did not do the meal plan at Atlantis. We had the buffet at Marketplace one night, it was fine, you will be amazed at the variety but the quality is average. Lunch at SharkBites was fine, burger, fries, etc. but I recommend ducking around the corner to the Sharkbites express for a better deal. We also ate at Anthonys and the News Cafe offsite, they were fine, much cheaper, huge portions. The plaza is *right* there so its not a problem to eat over there. The Comfort Suites there also seemed fine if you are considering them. We didnt go in them however.", "helpfulness": 14, "user": "A TripAdvisor user", "date": "April 17, 2005", "id": 3368850}, {"rating": 5.0, "stay_parameters": "Stayed February 2006, traveled with family", "text": "My adult niece and I stayed at the Beach Towers for 4 days in February of 2006. We both needed a little R & R and a stay at the Atlantis was just what we needed.", "title": "Relaxing and fun! Meal plan questions?", "helpfulness": 8, "user": "Lislcat", "date": "January 10, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 4.0}, "id": 6571977, "likes": {"liked": "— The hotel itself and how beautiful it was!", "disliked": "— The cost."}}, {"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "We had the Modified American Plan and it worked great for us, since neither of us really wanted to have to think about where we were going to eat. We both enjoyed eating at the dinner buffet at the Marketplace. So many things to choose from! The breakfast buffets were fine for us and we always took a banana, apple or muffin with us for a light lunch. I think that by the third day, we would of decided that we didn't need the meal plan. We could of eaten much cheaper and with a better selection, than the meal plan offered. Bimini Road was wonderful and lively. We could of eaten a couple of dinners there and still saved money.", "title": "Young Married Couple on a Budget (Beach Towers)", "helpfulness": 15, "user": "marcyinmb", "date": "January 7, 2007", "detail_rating": {"front_desk": 2.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 6563615, "likes": {"liked": "— Fun in the sun", "disliked": "— Food prices"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2003, traveled with family", "text": "The room at the Beach Towers was nothing fancy, but it was clean and had plenty of towels and toiletries, so it was great for the limited amount of time we spent in it.", "title": "Beautiful!", "helpfulness": 5, "user": "AngCee", "date": "January 5, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 6556830, "likes": {"liked": "— cleanliness", "disliked": "— There's this place (I don't quite remember where) that you can walk under a tank and see sharks and other fish swimming overhead."}}, {"rating": 5.0, "title": "has it changed this much", "text": "Walking the grounds is a beautiful experience and you will never tire of the views. Yes, to get from the Beach Towers to the Casino or Marina is a long walk. By the second day, my legs were screaming when I climbed the stairs near the casino. I don't consider this a negative, since many people, including myself, could use a little more exercise. It felt good!", "helpfulness": 1, "user": "nygrl", "date": "January 4, 2007", "id": 6552080}, {"rating": 4.0, "stay_parameters": "Stayed December 2006, traveled with family", "text": "The Hurricane Hole shopping center is great for just about anything you need and don't want to pay Atlantis prices for.", "title": "Its Big!!! And Pretty Dang Nice Too", "helpfulness": 8, "user": "jscozz", "date": "January 2, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 6541134, "likes": {"liked": "— Design and layout", "disliked": "— Cost"}}, {"rating": 2.0, "title": "If you like crowds and water parks, but not a great beach", "text": "We spent 2 nights at the Atlantis (preceeded by a fabulous stay at a smaller Bahamian island hotel that I'll keep secret) and I'd say that we had a good time.", "helpfulness": 16, "user": "blondfromBeantown", "date": "April 28, 2005", "id": 3420967}, {"rating": 3.0, "title": "Overpriced and crowded ", "text": "What we liked: -my 3 boys (16, 12, 5) loved the slides and pools. We liked that they were entertained for hours doing the slides/pools.", "helpfulness": 21, "user": "A TripAdvisor user", "date": "April 26, 2005", "id": 3416773}, {"rating": 4.0, "title": "Do it for the kids!", "text": "- quick and efficient food service at all restaurants we went to.", "helpfulness": 12, "user": "A TripAdvisor user", "date": "April 25, 2005", "id": 3414201}, {"rating": 1.0, "title": "Thieves have accessto your room. ( Please watch out)", "text": "- cleanliness of our room in the Royal Towers. I've stayed in hotels all over the world and this room was perfectly fine, but not worth $600+ a night and not comparable with a Four Seasons or Ritz. Think a nice Hyatt or Westin, with a more dramatic lobby and an aquarium, a casino and lots of shops/restaurants.", "helpfulness": 20, "user": "A TripAdvisor user", "date": "April 25, 2005", "id": 3414121}, {"rating": 2.0, "title": "Once Was Enough", "text": "- the sealife and grounds were enjoyable to walk around and view, but if you come from a city with a good aquarium, it's nothing that life changing.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "April 25, 2005", "id": 3414066}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled with family", "text": "I booked to go to the Atlantis in October and then thought it might be an idea to read some comments on the hotel via this website........... big mistake!! I read nearly every comment ever written by guests and I was scared..... really scared! All everyone seemed to mention was how expensive the resort was, how rude the staff were and how they would not recommend or return to the resort. By the time I was due to fly out I was actually dreading leaving England!", "title": "English People you must read this!!!!!", "helpfulness": 42, "user": "NorfolkBalloonGirl", "date": "December 30, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 6520709, "likes": {"liked": "— The Views", "disliked": "— Read my rewiew"}}, {"rating": 2.0, "stay_parameters": "Stayed December 2006, traveled with family", "text": "HOW WRONG WAS I!", "title": "For selfless parents only...", "helpfulness": 6, "user": "Travel-LovingDad", "date": "December 28, 2006", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 2.0, "cleanliness": 2.0, "value": 3.0, "location": 3.0, "rooms": 3.0}, "id": 6510375, "likes": {"liked": "— Good location, right on the water, good pools for children", "disliked": "— prices too high, no internet/BlackBerry service, mediocre expensive food, unhappy employees"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "This has to be the most spectacular place on the planet! My family party consists of my fiance (proposed to on cabbage beach) my 10 year old and my 14 month old daughters. We booked to stay for 2 weeks and I can honestly say that everyday was filled with something different.", "title": "Return to Atlantis..Worth the Wait", "helpfulness": 10, "user": "GSDiva", "date": "December 26, 2006", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 4.0}, "id": 6500767, "likes": {"liked": "— You don't have to leave the resort, something for everyone", "disliked": "— Nothing at all."}}, {"rating": 5.0, "title": "Disney in Nassau", "text": "The slides and pools are fantastic and the fish are awsome walking alongside sharks and stingrays is such a humble feeling. Both my daughters were, for want of a better word, gobsmacked by what they saw as was I.", "helpfulness": 14, "user": "ManhattanFamily", "date": "December 22, 2006", "id": 6483302}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "Our room was fine, nothing extraordinary but clean and large enough for our cot and pushchair and all the other bits you need when travelling with a small child. We were on the top floor of the beach towers with a sea view which would take your breath away.", "title": "Superb experience", "helpfulness": 7, "user": "JennWhit", "date": "December 22, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 6482555, "likes": {"liked": "— Variety of offerings at property and close proximity to downtown Nassau.", "disliked": "— N/A"}}, {"rating": 3.0, "title": "eh.. it was just okay...", "text": "My boyfriend and I stayed in the Coral Towers this past weekend. We booked a king bed terrace view and the front desk said there was a water view available if we didn't mind two double beds (\"californian queen\"). The hotel room was not luxurious at all (think very dated motel on Jersey shore.. ew!), but then I didn't expect it to be so I was not surprised. We had a nice view of the lazy river, palm trees, Beach Tower, and could see the ocean. If I went back (which is unlikely), I would definitely pay up for the Royal Towers even though that would double the cost.", "helpfulness": 6, "user": "fly39", "date": "December 19, 2006", "id": 6473833}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "I knew when we booked the trip that food was going to be expensive. However, I was a bit surprised that the quality was pretty low. Think cruise food. We were disappointed to discover that Nobu wasn't fully open (just the sushi bar was open) as well as a few other closures.", "title": "Here's why you have to go there for your next vacation...also some Dos & Don'ts", "helpfulness": 28, "user": "s1118", "date": "December 19, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6473376, "likes": {"liked": "— The Hotel Itself", "disliked": "— nothing!!"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "The pool and slides were aplenty. There were very few lines since we went before peak season. The beach is just okay. I've seen better. It was certainly nice though to be in close proximity to pool, slides, and the beach. We had a fun time enjoying the water amenities.", "title": "best vacation ever!!!!!", "helpfulness": 8, "user": "mor6an", "date": "December 18, 2006", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "location": 5.0, "rooms": 3.0}, "id": 6470649, "likes": {"liked": "— EVERYTHING!", "disliked": "— others letting their children play in the hotel hallway early in the AM."}}, {"rating": 4.0, "stay_parameters": "Stayed November 2006, traveled with family", "text": "The actual property is quite large. I thought the decor was a bit tacky. I'm not sure why by the corridor from Coral Towers to Beach Towers is foul smelling area. It's a bit odd. The comedy club was very entertaining, worth the $20/person.", "title": "Fantastic Time We'll Be Back", "helpfulness": 10, "user": "3boysintow", "date": "December 17, 2006", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 6453680}, {"rating": 2.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "Weather.com had noted 30-60% chance of rain for the weekend. We got pretty lucky. Just a few sprinkles during the day and some heavier rain in the evening. The sky cleared up pretty quickly.", "title": "watch out for thiefs!", "helpfulness": 7, "user": "Dallas007", "date": "December 16, 2006", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 2.0, "location": 3.0, "rooms": 3.0}, "id": 6448043, "likes": {"liked": "— The Aquarium", "disliked": "— Too Big"}}], "location": {"country": "Caribbean"}, "stars": 3.5, "variance": {"poor": 296, "average": 335, "very good": 705, "terrible": 224, "excellent": 808}, "aka": "Atlantis Paradise Island", "slim_ranking": 0.857142857143, "detail_rating": {"service": 3.5, "cleanliness": 4.0, "value": 3.5, "sleep": 4.0, "rooms": 3.5, "location": 4.0}, "description": "With the beauty of the Atlantis beach just steps away, the Beach Tower delivers a true Caribbean feel in a laid-back environment. Guestrooms have one king bed or two double beds, full balconies with water or terrace views. Beach Tower is perfect for young families and budget conscious travelers, and is closest to the beach, many marine exhibits, the Lazy River, Seagrapes Restaurant, Club Rush, Earth & Fire Pottery Studio, Gamer’s Reef arcade, River Pool, Atlantis Theatre and the Conference Center."}