{"user_rating": 4.0, "review_count": 54, "name": "Au Petit Hotel", "reviews": [{"rating": 1.0, "title": "What a Dump!", "text": "This place was a dump. dank smell upon entering, staff not friendly...rooms were shabby and horribly decorated. We checked in, paid up front for our one night and then decided neither of us could stand to wake up there in the morning...we ended up booking a night at the Acadia around the corner and forfeited our money. It was worth it.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "February 11, 2005", "id": 3179594}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled solo", "text": "Stay there for 3 nights for the Labor Day weekend. Great location, less then 10 minutes to Citadel or Chateau Frontenac, and lots of restaurants around. The manager is nice and friendly. The room is very nice and clean, a big room for a New Yorker! I'll go back to stay there again for sure.", "title": "Lovely, charming, and clean little hotel", "helpfulness": 4, "user": "magtien", "date": "September 5, 2006", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5771754, "likes": {"liked": "— Location, price", "disliked": "— NA"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2005", "text": "We stayed several nights during the music festival at this charming little hotel. The hotel is family owned, they are friendly and efficient. The location is great, on a cul de sac, it was quiet and peaceful. A very nice breakfast was provided for a slight charge. The location is great, they have parking available [we never moved our car]. It was uncharacteristically hot, the fan provided was adequate. We have to attend a conference near Quebec in the summer of 2006 and plan to go a few days early and stay again at this very pleasant hotel.", "title": "charming little hotel, great value", "helpfulness": 10, "user": "fallsrun", "date": "February 25, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 4519916}, {"rating": 4.0, "stay_parameters": "Stayed July 2005", "text": "We absolutely enjoyed our 4 nights stay at Au Petit Hotel in Quebec City. The location was perfect (inside the Citadelle), the room and bathroom were spotless, the staff was friendly, the service flawless and the price was excellent. When we made reservations, we were warned there was no air-conditioned, but a big fan was provided and, since Quebec is on top of a hill and often windy, even in the hottest days of summer, our room was cool. We will stay there again.", "title": "Loved Au Petit Hotel", "helpfulness": 11, "user": "Jaybird70", "date": "July 28, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 3710266}, {"rating": 5.0, "stay_parameters": "Stayed July 2005", "text": "I enjoyed Au Petit Hotel-very inexpensive and in a great location for site seeing in old Quebec City. Friendly staff and clean, comfy rooms. I will definitely be staying here on my next visit to this wonderful city.", "title": "charming little hotel with character", "helpfulness": 6, "user": "aluna1964", "date": "July 27, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 3703432}, {"rating": 4.0, "title": "Charming small hotel; ignore previous review", "text": "Hotel is on a cul-de sac off the main busy street in old Quebec; convenient to everything. Clean room, renovated bathroom, comfortable bed, excellent pillows. We had a room with a window overlooking the back courtyards of the places around us; quiet. Breakfast in your room for only 2.50$: fresh warm croissant, toast, juice, coffee/tea, fruit. Our experience totally unlike the first review. Friendly staff. Would stay here again.", "helpfulness": 9, "user": "A TripAdvisor user", "date": "July 11, 2005", "id": 3655814}], "location": {"country": "Canada", "city": "Quebec City"}, "variance": {"poor": 2, "average": 3, "very good": 31, "terrible": 4, "excellent": 14}, "aka": "Au Petit Hotel Quebec/Quebec City", "slim_ranking": 0.333333333333}