{"user_rating": 4.5, "review_count": 30, "name": "Auberge de la Petite Anse", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled solo", "text": "This place is adorable and right above the water about 10ft! Its PRIVATE , you look out and see only water , rocks, and cliff side. I arrived ,no place , other place gave away my room! So I was guided to Petite Anse. What a great guy. St Barths native, kind, sweet, will do anything to make you happy. And know Ive been to Capri , Greek Islands, Tahiti, and many more greats. If you want 5 star go to Isle De France, Flamands little ruff beach but gorgeous, or Toms hotel right on StJeans beach, or Eden Rock, old time,. tradition. BUT This place was perfect for me. It had a firm bed, clean room, white sheets, great view,huge balcony, a HIKE entrance to Columbia beach, (which people drive and walk to do) so if your a hiker, look no further. When Im in Turks n Caqouis or other tropics, there are mosquitos. This hotel had them but I put ac on when I left for dinner, on 23 and lit, 1 raid smoker kills mosquitos. I took dramatic measures, so when I was home , Id put air 23-24 and slept like a baby. I hate bugs, and there are some there, like normal, tropics. I used OFF 30 sunscreen daily for beach and found it great at night also(believe me I hate chemicals, but mosq bites suck, so off lotion is great. I think I got 2 bites in 10 days(also we had rain, so, we had more than the norm) Also fair skinned mosquitos love me. So this place clean, spacious, great view, over looking bay. Simple, no tv , radio, refreshing, huge balconys , seperate kitchens. Truly Suger(pron. shoe sher) was such a kind wonderful host , if you need him hes there, if not he stays away. Also daily maid service. This is a very simple clean nice hotel. Its like 5 ,2 story houses , side by side, hanging off a cliff, and you pull your car right up to your door, which I loved!", "title": "What a great deal !", "helpfulness": 6, "user": "30000ft", "date": "April 5, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 7285591, "likes": {"liked": "— Friendliness, had answers and requests on demand! He was so accomadating and nice", "disliked": "— Nothing."}}, {"rating": 5.0, "title": "Smart Choice", "text": "Go to Govenear Beach, Salines, Columbia, for nature, and go to StJeans for a little life, drinks, ice creme from LaPlague right on beach chair rentals or Nikki beach other side of Eden Rock. Truly an amazing vacation! Also sometimes they will include rental cars with a package, great to go April 15 ish-Nov, off season, half price rates. I like water, and need to be on it , in it", "helpfulness": 6, "user": "A TripAdvisor user", "date": "December 20, 2005", "id": 4252489}], "location": {"country": "Caribbean"}, "variance": {"poor": 0, "average": 0, "very good": 5, "terrible": 1, "excellent": 24}, "aka": "Auberge De La Petite Anse Hotel", "slim_ranking": 0.448275862069}