{"user_rating": 5.0, "review_count": 788, "name": "Auberge Saint-Antoine", "reviews": [{"rating": 5.0, "title": "Fantastic Stay", "text": "Unbelievable stay at the Auberge Saint-Antoine. My wife and I went for a weekend getaway and were dazzled by the customer service. From the valet parking to checkout, the customer service was absolutely superb. The concierge service was a highlight from our stay. Genevieve was extremely helpful, assisting us with our dinner reservations, directions in the city, and offering suggestions of must-see destinations in the city. Her eagerness to help was very refreshing.", "user": "briancave", "date": "July 16, 2012", "id": 134537616}, {"rating": 5.0, "title": "Don't miss this one", "text": "The hotel is ideally situated in order to visit all of the tourist attractions the city has to offer. The rooms are immaculate, and the common areas are stunning. All in all, you cannot go wrong with this Hotel.", "user": "beren314", "date": "July 11, 2012", "id": 134144047}, {"rating": 5.0, "title": "Perfect Stay!!! You Can't Go Wrong Here!!", "text": "An outstanding hotel. The rooms were very well appointed, clean, and comfortable. Common areas were also excellent. The hotel is also in an outstanding location, within walking distance of everything we wanted to see. As great as the physical plant was, it was the people at the hotel, the concierge, front desk staff, and doormen which make this a memorable place to stay. Extremely friendly and went out of their way to provide us with everything we asked for and more. Will definitely use this hotel again when we go back and will recommend it to friends.", "user": "DWFRN", "date": "July 10, 2012", "id": 134034743}, {"rating": 5.0, "title": "Surpassed my expectations", "text": "This Hotel is BEAUTIFUL inside & out!! Located in the oldest section of Quebec City with friendly, helpful service from staff that genuinely seemed to enjoy working there. We stayed in Room 407 which was immaculately clean with a bed SO COMFORTABLE that my Wife & I slept for 11 hours straight and I'm not one to over sleep. The Hotel has historical artifacts of Quebec City on display and integrated through out the grounds giving it a nice touch. The location is perfectly located and walking distance to everything!!! The bar adjacent to the lobby is nice, comfortable and was never crowded. The window from our room opened up giving a great view of the terrace below.", "user": "alexisd", "date": "July 9, 2012", "id": 133862094}, {"rating": 5.0, "title": "An Amazing Hotel with Highly Attentive Staff - A Home Away from Home", "text": "The restaurant Panache is attached to the Hotel and Initiale is one block away which are both Quebec Cities top eats!!!", "user": "ChicagoLooper", "date": "July 8, 2012", "id": 133723124}, {"rating": 5.0, "title": "Best hotel I have ever stayed at", "text": "Awesome in multiple ways! Great spacious room with comfortable bed and great view from balcony. Plus, great breakfast with friendly staff. It is the nicest hotel I have ever stayed at. Was a great romantic spot for me and my love.", "helpfulness": 1, "user": "Laurie W", "date": "July 6, 2013", "id": 166537914}, {"rating": 5.0, "title": "A Must Stay", "text": "We stayed six nights from June to July. When we come back we would not even consider staying elsewhere. We had a room with a deck overlooking the river which was very nice.", "helpfulness": 2, "user": "Chris K", "date": "July 6, 2013", "id": 166534973}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "Definitely consult the concierges as they are so helpful. We talked with both Charles and Genevieve whom gave us great ideas. Genevieve was especially helpful and recommended taking the train to Baie St. Paul. Have her do the same for you as this is a perfect day trip. The scenery is so nice and the food and service is excellent. Another recommendation was to visit the island of D'Orleans and tour the many vineyards. We did it via a Vespa we rented which was very nice but would not recommend unless you are very comfortable driving one.", "title": "Everything is Fabulous", "user": "mun0", "date": "July 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 166450090}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "The hotel is very well located right next to the water and old QC. We walked everywhere we wanted to go in the city.", "title": "Chic in Quebec City", "user": "GymJockey67", "date": "July 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 166347664}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "Panache the in house restaurant is definitely worth a visit with excellent food and service although a bit pricey.", "title": "Definitely the place to stay in Quebec City", "user": "L R", "date": "July 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 166341786}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "This hotel has spoiled us for any other. It is beautifully decorated in tones of gray and brown. The lighting is very high tech. We had a very large room overlooking the river (There was a little noise from traffic on the main road but not much). Our room had a piece of the original stone wall, but everything in the room was very modern. The bed was very comfortable and with good pillows. The bathroom had a tub and a shower with a rain head and a wand - your choice.", "title": "Modern Luxury in the Old Town", "user": "gourmetgirlBoston", "date": "July 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 134999285}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled on business", "text": "The Staff at the Auberge was exceedingly pleasant, from the desk check in to the housekeeping and bellman staff.", "title": "One of the best hotels I have ever stayed at", "user": "John D", "date": "July 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 134940095}, {"rating": 5.0, "title": "Second honeymoon", "text": "The location is perfect. The Basse Ville is much livelier that the Haute Ville, and it is easy enough to take the funicular to the Upper Town. We had a rainy day, so we popped into the Musee de a Civilisation, right next door to the Auberge, for a fabulous exhibit of Samurai costumes.", "user": "tbw880", "date": "July 20, 2012", "id": 134872634}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "We were sorry to leave such a wonderful hotel.", "title": "Sainthood for the Auberge", "user": "Daniellex1976", "date": "July 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 134767782}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "I have had the opportunity to stay at many of the best hotels all around the world, and the Auberge Saint-Antoine is in the top two or three.", "title": "Auberege St. Wonderful!!!", "user": "NorgeGuy", "date": "July 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 134631501}, {"rating": 5.0, "title": "Loved this hotel", "text": "Just completing a 4 night stay and have loved this hotel. It is understated but lovely. Charles, the concierge was super helpful, patient and nice. He helped me with all my reservations in a very prompt manner. We stayed in a deluxe king with a courtyard view. I wish we'd had a river view but our room was large and very comfortable. We had plenty of room for me, my husband and our 24 year old daughter. Loved this hotel highly recommend it to other travelers", "user": "Dora F", "date": "July 14, 2013", "id": 167570242}, {"rating": 5.0, "title": "We loved our stay and will be back!", "text": "We stayed in a Junior Suite with a river view (201) and loved our room and all the staff have been a great team to make our visit outstanding. Such a friendly helpful staff from the minute we opened the car door to planning our stay with the concierge. The room was great and the restaurant \"Panache\" was fabulous both on sight and at the mobile trailer at the vineyard on ills Orleans so much that we had several meals there. The location is great for access to all parts of the city and easy to find. We will return and thankful we found such a wonderful place to stay. Thank you Auberge Saint-Antoine!!", "helpfulness": 1, "user": "dbhaynes", "date": "July 12, 2013", "id": 167344988}, {"rating": 5.0, "title": "Wonderful 3 night stay. Great hotel.", "text": "I do agree it is the staff who make this hotel. We just loved our stay here. The rooms were reasonable size, the bathrooms lovely & the location perfect for exploring the area. We found the staff just amazing in their professional friendliness & ability to help & advise. The breakfasts were the best I have ever had in a hotel. We particularly enjoyed the healthy choices which were delicious. We would definitely recommend this hotel.", "helpfulness": 1, "user": "CallySydney", "date": "July 9, 2013", "id": 166892957}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "Superb! Nice touches such as coming back from dinner to find the turndown service included putting music on and filling the ice bucket. Lovely rooms too, with nice size bathrooms. The service was impeccable, especially Charles in the cafe/bar and the receptionists. Location is central to everything you need in Vieux Quebec (take the funiculaire up to the rest of the old town!)", "title": "Great stay - hope to be back soon!", "user": "Bee_ALondon", "date": "July 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 166746465}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "The staff makes this property excellent! Everyone we encountered were professional and helpful. From the front desk to painters we encountered in the hall. It is in a great location! Everyhing is within easy travel. We had a wonderful time on our trip to Quebec. We would stay there again!", "title": "A Great Place", "helpfulness": 2, "user": "LDS1973", "date": "July 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 166562581}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "Fantastic rustic room in the historic building (there are only 4 rooms in the historic building). Windows on three sides, great wood floors, and late 1700's beamed ceiling rafters. Just tremendous. These letters are to make the 200 character minimum!", "title": "No better place to stay", "helpfulness": 1, "user": "traveltoomuchToronto", "date": "August 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 171386148}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "This is a fabulous hotel with huge rooms and attentive and friendly service. It was our 25th anniversary trip and we wanted to stay in an excellent place. We were not disappointed. We had a terrace, but did not use it since it was 33 degrees centigrade every day we were there over the 4 nights. The location is excellent for getting in and out of town by auto since it is just off the road that hugs the north bank of the river. It is located in the middle of the lower town historical district and only a few blocks from the lift that takes you to the Chateau Frontenac's back door plaza. That hotel's rooms are half the size of this ones at a similar cost. Breakfast is not included, but it is excellent. They give you each a bottle of water each day, and more if you ask for it. The concierge service was knowledgeable and friendly. When we come back, we will certainly stay here again.", "title": "Luxury Plus", "user": "BonVivant39", "date": "August 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 171260126}, {"rating": 5.0, "title": "SUPER, SUPER, SUPER.....", "text": "We spent 2 nights treated as real special guests", "helpfulness": 1, "user": "Elena G", "date": "August 7, 2013", "id": 171227304}, {"rating": 5.0, "stay_parameters": "Stayed July 2013", "text": "At arrival first surprise: upgrade from standard to de luxe room", "title": "Beautiful city beautiful hotel", "user": "Jellyroller", "date": "August 3, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 170558356}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "Anyway the hotel is really perfect: located in the centre close to the most interesting areas and able to give you the feeling of being isolated while living in the middle of the city center.", "title": "Luxurious", "user": "Carol A", "date": "August 1, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 170332604}, {"rating": 5.0, "title": "fantastic hotel, would definitely stay here again", "text": "My husband and I spent 5 nights here and it was one of our most memorable hotel stays ever. It was quite the splurge, but definitely worth it. It is perfectly situated in the Lower Town, just steps away from the lovely pedestrian street of Quartier Petit Champlain. Also next door is the Musee de la Civilisation, which is a great museum to visit if you have time. The lobby and bar area of the hotel is beautifully decorated. The customer service was amazing. Anytime we asked for restaurant recommendations or directions to a particular place, the reps were attentive and helpful. Our room had a nice terrace which offered a view of the Chateau Frontenac. Also not far was the Old Port, where we would take a stroll and had nice views of the St. Lawrence river. The room was a good size, did not feel cramped at all, and there was a separate area for hanging your clothes; not exactly a walk-in closet but just separate from the area where the bed is. The bathroom was quite spacious as well. In addition to the amazing room, what I loved most about the Auberge Saint-Antoine was its location and proximity to nearby attractions and a huge variety of restaurants and cafes. I would most definitely stay here again and again!", "user": "mmmsogood", "date": "July 7, 2012", "id": 133706279}, {"rating": 4.0, "title": "Great Business Hotel", "text": "I stayed 4 nights at the Auberge Saint-Antoine with my wife and 3 young children. The hotel is in an excellent location and is a short walk from great shopping and restaurants and across the street from the St Lawrence River and a great place for walking.", "user": "emansouri", "date": "July 7, 2012", "id": 133672450}, {"rating": 5.0, "title": "Amazing Auberge St. Antoine", "text": "I found the hotel concierges as well as the front desk staff to be very helpful, knowledgeable, and accommodating and they helped arrange babysitting services, a family tour to a petting farm, and dinner at an upscale restaurant for us.", "user": "Renae S", "date": "July 5, 2012", "id": 133560571}, {"rating": 3.0, "title": "The facilities lovely, the service, not so much.", "text": "The hotel tries to accommodate families. Each of our 3 children had a hotel-branded teddy bear waiting for them in our room. Breakfast at the hotel's restaurant was top-notch. Dinner was hit or miss. The first night, my dinner was outstanding. The last night, my salmon tasted stale. The menu explains that \"a children's menu is available upon request\". When inquiring about it, they explain that you can choose any item from the menu and it is 1/2 off but there are no child-friendly items. They need to improve this and have a proper children's menu if they do indeed want to cater to families.", "user": "Chandra G", "date": "July 5, 2012", "id": 133487141}, {"rating": 5.0, "title": "Wonderful stay, we'll be back!", "text": "The workout facility was small but sufficient. I didn't get a chance to take advantage of the hotel's spa services. The decor and ambience of the hotel is uplifting and cheerful. The guest room we stayed in was an interesting experience. It was in an old part of the hotel and it was very rustic and spacious but had no outside view whatsoever. There is a very comfortable lounge area adjacent to the hotel lobby.", "user": "CanadaTravelgal2009", "date": "July 4, 2012", "id": 133443731}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "I am not sure of too much of the back ground story of the building in which Auberge Saint-Antoine is located but given its location and outside facades, it is somewhat older and was a different use at one point. Historic or boutique hotels have charms but often lack amenities and/or feel dirty and aged. New hotels are new and shiny but are often in secondary locations and feel like you could be in any suburb in the world. People often try to take the \"best of both worlds\" but rarely does it seem to come together. I would say that Auberge Saint-Antoine is the exception where it really does come together and offer the best of all worlds.", "title": "Great hotel and impressive restoration", "user": "TripFan045", "date": "July 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 135432546}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "We loved the location which is in the lower town, about half way between the water and the Hotel Frontenac. The area where the Hotel Frontenac is located is probably closer to the middle of the town's activities, but I think I like the location of the Auberge Saint-Antoine better. It is on historic streets and tucked in the lower city only a few block from the bustle up the hill but feels like a very quaint, historic and authentic part of the lower city.", "title": "That certain je ne sais quoi - Quebec style.", "user": "Nomads1984", "date": "July 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 135297021}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled on business", "text": "The room was spacious for a boutique hotel and the bathroom was nice, new and clean but classic as well. One wall of our room was exposed brick which I thought was a nice touch and made the room feel warm and inviting, and was all a good way to explain the entire hotel. There were many well done small touches aroudn the hotel that made it warm and inviting while also being new and clean feeling. They have little artifacts next to the room numbers outside of each door. It is a little hard to describe but was well done. Also, a good amount of wood and brick exposure around the wall ways and lobby.", "title": "Beyond expectations", "user": "AmalfiRegina", "date": "July 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 135251547}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with friends", "text": "The staff was also great. Nothing in particular but attentive and helpful. We changed dinner reservations one night and asked the conceirge to cancel the reservation we were no longer needing and she was great. It was a little thing but that way in which she responded was perfect and exactly how you would want her too.", "title": "One of the best!", "user": "me2755", "date": "July 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 135194183}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "This is probably one of the most glowing reviews I have ever given a hotel and truthfully, I didn't necessarily even leave the hotel blown away by it, but almost in hindsight everything about the hotel was a cut above and then taken in totality, it is one of the better hotels that I have stayed at. I would definitely recommend it to anyone.", "title": "Can I Stay Longer.", "helpfulness": 2, "user": "EttieneR", "date": "July 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 135147023}, {"rating": 5.0, "stay_parameters": "Stayed July 2013", "text": "We arrived early, but they took our car and check our luggage in and registered us though our room was not ready. This allowed us to explore this beautiful city full of history, cafe and shops. They upgraded us to a great room with a balcony and sitting room. All lovely. And we really appreciated Felix , extending the extra service to drive us to our restaurant . It was much appreciated . The", "title": "Wonderful weekend", "helpfulness": 1, "user": "Lisecm", "date": "July 30, 2013", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 170042660}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "staff is exemplary. The hotel is centrally located . We loved that we could walk to everything. When we return we plan to come back to Auberge St. Antoine wonderful service.", "title": "Unexplainable Awesome", "user": "Marjorie H", "date": "July 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 169541291}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "I walked in the room and knew it was the nicest hotel room I've ever been in. I liked that the design was super modern. It had television in the bathroom! Food was awesome. Try the filet mignon. We were three in a room and the cot was better then the bed in most hotels.", "title": "Warm and friendly", "helpfulness": 1, "user": "dnghols", "date": "July 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 168353114}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "We stayed at this hotel for 5 nights back in May 2013 as part of our trip around the world. We arrived by taxi from the airport and were greeted at the door and ushered to the reception. Now, our French is pretty ordinary but the guy at the desk was understanding and soon switched to English to help us through. We had chosen a River View Room with king bed and were not disappointed. If you discount the carpark between, the view across the St Lawrence River was spectacular. This hotel has been constructed by incorporating the existing 17th/18th century buildings into the new construction. It is clear that the site formed part of the old port from early times and it is apparent that a large number of the archaeological artifacts found during construction have been incorporated into displays around the hotel.", "title": "A Unique Experience", "user": "Travel_Hints", "date": "July 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 168068266}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "The welcome at this hotel is warm and friendly and there is nothing the staff could not do to make sure our stay was comfortable; even the bar staff who helped us with our French.", "title": "Charming 17th Century Luxury", "user": "David H", "date": "July 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 167604542}], "location": {}, "stars": 4, "variance": {"poor": 5, "average": 23, "very good": 79, "terrible": 5, "excellent": 676}, "aka": "Auberge Saint-Antoine Hotel Quebec City", "slim_ranking": 0.0102040816327, "detail_rating": {"service": 4.5, "cleanliness": 5.0, "value": 4.5, "sleep": 5.0, "rooms": 5.0, "location": 5.0}}