{"user_rating": 5.0, "review_count": 92, "name": "Auberge Sonoma", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled with friends", "text": "What an incredible place and right around the corner from the Square. We and another couple wanted to book Cottage Sonoma but it was already taken for the dates we needed. We were told that a new place, Auberge Sonoma, would be ready for our visit so we booked it. It was an old home that was completely renovated. So glad we did. We were the first people to rent Auberge Sonoma. In fact it was just furnished a few days before we arrived. As with any new place a few things weren't perfect but the owner made every effort to correct any problems very quickly, even asking for our suggestions. We rented the front suite which we loved because of the front porch, a perfect place for wine and appetizers before dinner and a great place for people watching. Many locals would go by and wave and ask about the house. My son and his wife rented the back suite which is very similar to the front and also has a porch which faces the back yard. There is a larger upstairs suite which was not yet complete but was shown to us. It looks fabulous. Auberge Sonoma is walking distance to so many restaurants and, if you feel like just staying in and having dinner, there's a Whole Foods, also in walking distance. We look forward to another stay at Auberge Sonoma. We definitely give this wonderful place 5 stars. If you're visiting the wine country and want a great place to stay, don't look any further than Auberge Sonoma. Tom and Mary, Sagamore Hills, OH (April 17, 2009)", "title": "Great location, don't pass up the chance to stay here", "user": "Butcher.T", "date": "April 17, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 28244344}], "location": {"country": "United States"}, "variance": {"poor": 0, "average": 0, "very good": 4, "terrible": 0, "excellent": 88}, "aka": "Auberge Sonoma Hotel Sonoma", "slim_ranking": 0.142857142857, "description": "Two bedroom luxury suites in the heart of Sonoma’s WineCountry – ½ block from Sonoma’s Historic Town Square. Historic building, newly renovated. Full kitchens, fireplace, private porch, and private entrances. Sonoma Valley Winery Pass, valid for free wine tasting at over 30 Sonoma Valley Wineries, included!"}