{"user_rating": 4.0, "review_count": 91, "name": "Auberge de la Baie", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "The staff was very accommodating, friendly with good prices. We came to tour Mont Saint-Michel but the B&B we booked was a bust! To our luck right around the corner was Auberge de la Baie. We stopped in and to our delight they had an extra room with free wi-fi. We had dinner that night in the restaurant and it was fantastic (great sea food) and In the morning they have a good breakfast. Only a 5 minute drive to the parking lot to visit Mont Saint-Michel.", "title": "Great location with a very good Restaurant", "helpfulness": 2, "user": "skylane9", "date": "October 16, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 142982362}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled with friends", "text": "This hotel was a kilometer away from the main parking lot for the Mont in a rural area. The rooms have been modernized, and they are quiet and comfortable. Waking up to the parade of sheep going to pasture,as they have done for centuries, is a definite plus for this hotel.", "title": "A quiet, nice hotel near Mt. Saint Michel", "helpfulness": 2, "user": "mth_man", "date": "October 3, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 141941503}, {"rating": 1.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "Very rude staff, suprise! Room very dirty and noisy. We are so disappointed for the price we payed. You should certainly make sure that your room is not besides the big road. otherwise the circulation is horrible. But I don't think it makes difference for the property. The room is really duty, I've never seen any hotel like this! And rude staff might ruin your stay.", "title": "horrible", "helpfulness": 1, "user": "Julie F", "date": "August 20, 2012", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "service": 1.0}, "id": 137700453}, {"rating": 1.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "I want to rate this place higher, but it is a place of contradictions.", "title": "Bring earplugs", "helpfulness": 1, "user": "Heather C", "date": "July 17, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 2.0, "rooms": 2.0, "location": 5.0}, "id": 134637348}, {"rating": 3.0, "stay_parameters": "Stayed May 2012", "text": "First off, they spent good money on the decor, including a fancy sink that sits on top of the counter (which made the counter low and uncomfortable). They had good sound walls, and windows that blocked out traffic, but they put in hollow core doors, so with the hard floors everywhere including the halls, any coming and going by the neighbors was heard. Bring earplugs (we had just come from a charming 18th C B&B with paper thin walls, but the charm there made us consider going back, but this place is more worthy of complaining). There is also a window in the bathroom to the main area, so it is not family friendly, and the steam from the shower goes into your room. My husband stepped out of the room for a moment and came back in to have his glasses fog up. Stuff gets wet. It also had a small shower with a shower curtain that attacked you and your hip would adjust the water temp, but we found that to be kind of \"normal\" for other hotels in Normandy at this price point. This is just the only hotel I am complaining about.", "title": "Cheap and a good location to Mont", "helpfulness": 1, "user": "NiHaoTom", "date": "June 6, 2012", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 3.0, "service": 2.0, "rooms": 3.0}, "id": 131394462}, {"rating": 2.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "This hotel is way too out in the woods for proximity to Mont St Michel. We had to change our hotel reservation to Mercure in Mont St Michel.If you don't have a car, it is wise not to book this hotel.", "title": "too far from mont st michel", "helpfulness": 1, "user": "Knowledge S", "date": "May 22, 2012", "detail_rating": {"location": 1.0}, "id": 130390117}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled with family", "text": "All these hotels/B&B's are almost around the same price in this area. The close location to Mont-Saint-Michel means you can enjoy the rural aspect without the long line of vehicle fumes that line up on the \"route de mont\" where most of the other hotels are located.", "title": "Great location, clean rooms and good breakfast", "helpfulness": 3, "user": "minnie_globetrotter", "date": "November 4, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 120161728}, {"rating": 2.0, "stay_parameters": "Stayed September 2011", "text": "We had two rooms comprising for 2 persons and 3 persons. Our 3rd bed was ridiculously small for an adult and not comfortable to sleep in. For 2 persons these beds are perfect. Room is spacious, tv is good, showers and bathroom is clean but no hooks to attach the shower head.", "title": "Good view and friendly staff, poor quality rooms and breakfast", "helpfulness": 1, "user": "OffALark", "date": "September 25, 2011", "detail_rating": {"cleanliness": 2.0, "value": 3.0, "location": 3.0, "service": 4.0, "rooms": 2.0}, "id": 118577724}, {"rating": 3.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "We like the rural aspect of sheep walking on the main street early in the morning, after all this is a farming region.", "title": "great location, functional, agriculture smell!", "helpfulness": 2, "user": "pourpre", "date": "August 5, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 5.0, "value": 4.0}, "id": 116301264}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "Dinner at the restaurant is really mediocore. The portions compared to English/Australian portions are \"entree\" size. Breakfast was ok, French style delicious croissant, baguette, yougurt, tea and coffee (from the 6 in 1 coffee machine). The difficult thing was that the menu was only in French and the waiter was not helpful with the translation.", "title": "rural, well priced, newish", "user": "womblewa", "date": "September 29, 2010", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 81509720}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "Pretty good vaue, lovely walk across fields to Mont St Michel, lovely new accomodation blocks (well designed and laid out and immaculate; should be French 4-5 star), so far undiscovered by the English but no doubt that will change soon", "title": "Surprisingly good hotel, thoroughly recommended", "user": "EUROPETRAVELLER1234", "date": "August 15, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 75343109}, {"rating": 3.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "We stayed in their apartment because we're a family of 6. It had one bedroom with a double bed, then 4 twin beds (cots) in another room. A family room with a tv and coffee table and an OK bathroom and shower.", "title": "Apartment good for our large family, but too many flies!", "user": "tripletmomohio", "date": "July 24, 2010", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 72190443}], "location": {"country": "France", "region": "Normandy", "continent": "Europe"}, "stars": 2, "variance": {"poor": 5, "average": 20, "very good": 36, "terrible": 5, "excellent": 25}, "aka": "Auberge De La Baie France/Ardevon", "slim_ranking": 0.75, "description": "The Auberge de la Baie has 31 fully equipped rooms, most of which are air-conditioned, and there are 4 family rooms for between 3 and 5 guests. The hotel rooms are available for your week-ends in the Bay of Mont Saint-Michel, or by the week."}