{"user_rating": 4.5, "review_count": 118, "name": "Auckland Waterfront Serviced Apartments", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "We came down from the far north for 4 days to celebrate my birthday, and booked a 2bdrm apartment, so that our daughters (who live in Auckland) could come and stay if they wanted. I had all sorts of things I wanted to do, but in the end all I wanted was to spend time with my children, and Auckland Waterfront gave us the space and comfort to have everyone together and relax. My husband has worked on the water all his life, so thoroughly enjoyed sitting on the balcony, watching all the activity that was happening at the viaduct. Also, a great location!! Everything was just within a short walk...great restaurants, shopping, markets, shows, plenty of play areas for young children, just amazed at what has been developed in the area, and how well it has been thought out! The apartment had everything that we required, and was tastefully furnished and comfortable. We were made to feel welcome, and it was great not to feel pressured, like a motel/hotel can sometimes make you feel. We will definitely be staying again.", "title": "Ideal location and accommodation for everyone!!", "helpfulness": 1, "user": "Al-Louise", "date": "April 18, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 158144949}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "we booked directly through the web site and got a quick response. stayed in a 1br in shed 23 4th floor overlooking water. the apartments are independently owned so not sure what other ones are like. ours was well equipped with washer dryer in bathroom (they supply soap). Kitchen had tea and coffee. milk, champagne, and chocolates on bed when we arrived. The patio was beauitful and we kept the sliding glass door open all the time. Our apt did not have central air but it is late march so none was needed. i might think twice if I was visiting in the summer. There may be some apts that do have central air. The only thing missing is shampoo but not a problem to find. Location cant be beat. a wharf away from where all the ferries come and go for day trips. near wyndam area for restaurants. Airbus to and from airport drops you off a wharf away so we took it back to airport for 16 nz per person rather than a 80nz taxi. check out is at 11am but the info kiosk at the wharf near ferries will keep your bags for 5nz which is right where airbus pics up. all in all it is perfect. dont expect maid service or a concierge but do expect a great location, lots of space, full kitchen, tons of restaurants in area. a great find.", "title": "great stay, location, and price", "helpfulness": 2, "user": "ilovenyc", "date": "April 1, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 156211878}, {"rating": 4.0, "title": "Business and Lesure", "text": "I rented a 3 bedroom apartment while attending a conference in the Viaduct district. I had just flown in from overseas on business and wanted to spend time with my family while having to attend a conference.", "user": "Jevtash", "date": "March 30, 2013", "id": 156037786}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "The pros I found were;", "title": "Loved The apartment & Location,We would stay here again!!!", "helpfulness": 2, "user": "942SusanD942", "date": "March 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 155752944}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "the location excellent, the apartment well equipped with amendments for family. We did find having the living room upstairs good for the family so children could sleep in a quieter area downstairs in the evenings. Washer machining, dryer and two bathrooms were handy also. Champagne and chocolates on arrival, cheap wifi in room Internet $8 a day and secured undercover parking for $25 a day, restaurants, shops, train station and buses very close by.", "title": "Alternativ to hotel, min.stay 3 days", "helpfulness": 3, "user": "voyager-liese", "date": "March 19, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 155066390}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "stylish, clean and great location - what's not to like! We needed a place to get over jet lag before traveling around NZ - this was perfect. Quiet at night- good views- close to restaurants and the quay for boat trips", "title": "great place to stay", "helpfulness": 1, "user": "898sarah", "date": "March 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 153548047}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "Spent 5 days over New Year. Great spot to see all the action around the harbour but peaceful at night.Easy to get around all the local spots - shopping at Downtown and Queen Street and dining at Viaduct Harbour. The apartment was clean, comfortable and well equipped. Sitting on the balcony watching the harbour views was a highlight. Would definitely stay again and would recommend to friends.", "title": "Relaxing views close to the action", "helpfulness": 2, "user": "Marg C", "date": "February 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 152300273}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "Had a great week in Auckland Waterfront Appartments. Great location, great view at waterfront. Quiet located, although in middle of everything. Pulsing life at Vidaduct restaurant and bars, and few metres away from ferries for excursion and Queens Street shopping.", "title": "Great location, great stay !", "helpfulness": 1, "user": "Elin B", "date": "February 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 151569185}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "We have stayed here for a month in each of the last two years.", "title": "Fabulous facility", "helpfulness": 2, "user": "66Frequent_Traveller", "date": "February 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 151475898}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled on business", "text": "Auckland Waterfront Apartments is a terrific facility. The location is perfect for access to the downtown and the Viaduct areas. The facility is well maintained, the rooms are well equipped and the staff are great.", "title": "Peaceful while right in the middle of all the action", "helpfulness": 1, "user": "Lisa S", "date": "February 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 151425373}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "Stayed 3 nights here and internet speed is fabulous after too many nights of poor internet access in NZ. :)", "title": "Love this place!", "helpfulness": 1, "user": "SuperShan1", "date": "March 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 125915321}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled with family", "text": "Views at Balcony is fantastic! Modern layout, dishwasher and laundry are great!", "title": "Perfect location; fabulous views", "helpfulness": 3, "user": "KiwiKatonah", "date": "February 16, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 124688244}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "Location is fantastic as it is away from the noisy pubs yet within short walking distance.", "title": "Excellent Location", "helpfulness": 4, "user": "Watson_Inc", "date": "February 6, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 1.0, "rooms": 4.0, "location": 5.0}, "id": 124218397}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "Only downside is there's no gym.", "title": "Most beautiful accommodation", "helpfulness": 1, "user": "Dimitriou1", "date": "January 31, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 123934634}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "We were very happy with our stay at Auckland Waterfront Apartments from Feb 4-11. The location is perfect -- easy walking distance to restaurants and cafes in the Viaduct Basin, a somewhat longer but delightful walk to the new Wynyard Wharf area with more restaurant choices, 5-10 minutes' walk to Queen Street, the Britomart area, the Links buses that circle the city, and to the ferries.", "title": "Shed 24 is better than 1st floor shed 23", "helpfulness": 2, "user": "Goodysk", "date": "January 28, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 123732901}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "We stayed at the Auckland waterfront apartment for 5 nights in August. This is a great place to stay as it is well priced, beautifully presented and in a great area. The owners are very friendly and helpful. The view from the wrap around deck was second to none! The complementary champagne, chocolates and breakfast starter pack was a great touch and meant that I could fly in at night, collapse and not have to worry about rushing out to get food for breakfast. The only slight issue was the noise from the pubs on Friday and Saturday night and the blast from the cruise ship horn really scared my infant son but none of that would prevent us from staying there again. I highly recommend this place should you be looking for an apartment in Auckland.", "title": "Great place to stay", "user": "T-A-UK", "date": "August 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 138937606}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled on business", "text": "Apartment was tastefully furnished, spacious, light and airy, with a large balcony overlooking the water. Highly recommend apartments. Will book again next time I am in Auckland to watch the Wallabies (hopefully win!!)", "title": "Great location, great value", "user": "Peter H", "date": "August 29, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 138830254}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "Celebrating 30 years of marriage, we decided on a long weekend in Auckland and are so glad we did. We could not have found a more inviting and welcoming place to stay than the Auckland Waterfont apartments.", "title": "Absolutely Fab", "user": "ian4sueSydney", "date": "August 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 138271373}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "From the moment we walked in to our apartment we felt at home, everything was sparkling clean and inviting. The view from the apartment was fantastic, stepping onto the balcony even better watching the many sailing boats go by whilst drinking the lovely chilled bottle of wine and eating the chocolates which were both complimentary another added touch that made our stay enjoyable.", "title": "So great!", "user": "Sam L", "date": "August 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 136874855}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "You could not want for anymore inclusions everything was there for our use, meeting our host Alison was great as she was able to let us know some ideal places to eat and as the location of the apartments was situated close to all the major restaurants we were able to walk everywhere to get our meals.", "title": "Simply the best!", "user": "Ortiz M", "date": "August 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 136867894}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "We've been staying at the Auckland Waterfront Serviced Apartments on and off for almost 10 years. The apartments have great water views and the location couldn't be better for walking and sightseeing. The bus from the airport stops approximately 3 blocks, an easy walk to the apartment, even with both of us pulling suitcases. There are many restaurants close, along with shopping centers. The grocery store is a bit further but not that long of a walk. The personnel who greet us are the best and we look forward to seeing them again in November.", "title": "Great Apartments and great views", "helpfulness": 1, "user": "E Dianne L", "date": "June 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 131992380}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "Auckland was our last pit stop during our 19 days of North & South Island road trip and we are definitely looking for a perfect stay where we could really relax, chill and enjoy our last few days of stay in NZ. We had indeed chosen a perfect place. It was a superbly clean, spick & span apartment. I love super nice fragrance smell that greeted us the minute we step in the apartment. Fully equipped with cooking facilities, kitchen utensils, washer & dryer, snacks for the kids, good security, wonderful view etc... internet access is fast & good too. My kids enjoyed the spacious space. However, for those who do not drive, I would suggest you get your cooking stuff in advance as the nearest supermarket is about 20 - 25 minutes walk from the apartment. A convenience store is nearby about 7mins walk though if you do not mind to settle with just instant noodles and some junk foods. Restaurants are everywhere around the vicinity of the apartment, all within 7minutes walk. Dophin & Whale Watching Safari counter is also very nearby about 7 mins walk. Lots of shopping can be done at the shopping mall just behind the HSBC building, approximately about 10mins walk. We spent a whole good afternoon going from one shop to another all in the same mall. :-) A nice MOVENPICK icecream parlor is about 5mins walk.", "title": "Perfect for Everyone... Single / with families", "helpfulness": 1, "user": "IdaMarz", "date": "June 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 131939297}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled on business", "text": "However, for those who have kids with them, I was advised to try to avoid wandering around at night especially after 9pm, especially over the weekend. There are a lot of pubs nearby, hence there'll be quite a bit of drunkards and nuisance during those hours especially after midnight. So, if there is not a necessary to be out, I would advice to stay in and enjoy the good television show, nicely cuddled up in the comfortable apartment with the wonderful view. Hope you guys will enjoy your stay as much as we did....", "title": "Fantastic Views", "helpfulness": 2, "user": "Possum0875", "date": "May 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 129490172}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "We stayed for 3 nights in May. Awesome service from Graham and Alison when we arrived. The room and views were just fantastic. Sitting on the balony when the sun goes down and the boats come in with a glass (or bottle) of wine in hand - its just the best!", "title": "Luxury apartment- excellent alternative to a hotel.", "user": "mynatty", "date": "March 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 126462478}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "Will be staying again.", "title": "Birthday Weekend", "user": "Ryan C", "date": "March 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 125953459}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "Stayed in a 1 bedroom apartment on the 2sd floor in shed 25 for 5 nights in May. No reception lobby you have to ring when you arrive and they come down to meet you. Graeme met us and explained how to use the secure carpark & where to park and then helped carry our bags to the apartment. Alison was waiting for us there & showed us where everything was and where we could get meals or buy supplies.", "title": "Top Spot", "helpfulness": 2, "user": "wiskey", "date": "June 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 163517413}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "The kitchen had all that you would need to make & serve most meals. Bathroom was a bit cramped but did also house the washing machine & drier. No bath but full size shower & large basin.", "title": "Appartments with Harbour View", "user": "JunM59", "date": "May 3, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 159520416}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled on business", "text": "Bedroom could be shut off from main living area but chose to leave open and enjoy the view over the water. King size bed a bit too firm for us & more/ better pillows would have been nice. Floor to ceiling windows / sliding doors opened up to good sized balcony with table & chairs.", "title": "Perfect in every way..!!", "user": "Greenshell", "date": "April 29, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 159188802}, {"rating": 5.0, "stay_parameters": "Stayed February 2013", "text": "Lounge & dining area added to the overall open feel.", "title": "Friendly staff and excellent location make this the best stay in Auckland.", "user": "emansakinareviews", "date": "April 22, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 158434081}, {"rating": 5.0, "stay_parameters": "Stayed April 2013", "text": "Very short walk to just about everything, plenty of good eating places & pubs, sailing & ferries next door. And the ever changing harbour views.", "title": "Outstanding location, great value and superb, friendly hosts", "user": "Attorneyjoe", "date": "April 18, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 158146897}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled on business", "text": "This is the best kept secret in Auckland!", "title": "OUR PERFECT HOME FOR 3 MONTHS", "helpfulness": 2, "user": "joyful_sun", "date": "July 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 134787410}, {"rating": 5.0, "stay_parameters": "Stayed May 2012", "text": "This is our second time here. The first was just so great (stayed 1.5 months in April-May '12) that we came back and stayed another 1.5 months.", "title": "Great, just great!", "helpfulness": 3, "user": "John V", "date": "July 16, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 134492201}, {"rating": 4.0, "title": "Recommended", "text": "The apartment is open plan living, spacious (my estimate is 70 sqm) and has all the amenities you need ... silverware, cookware, laundry and dryer, stove and oven, fridge, coffee press, toaster, can opener, vacuum cleaner, iron, heater, fan, aircon etc etc etc They also provide you with eco friendly cleaning supplies / laundry soap plus complimentary tea/coffee, muesli. It is serviced once a week with a change of linens and a thorough scrub down by 3 wonderful cleaning ladies. Oh and also, a nice bottle of sparkling wine, pillow chocolate and a jug of fresh milk is placed in-room to welcome your arrival.", "helpfulness": 1, "user": "David R", "date": "July 2, 2012", "id": 133306233}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "The balcony with its friendly birds, fiery sunset view and the occasional rainbow is just excellent you never want to leave your room. Best view for me is when the sailboats are out on a nice day, they're like butterflies in the harbour.", "title": "A good view and location.", "user": "whyateery", "date": "June 21, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 132489333}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "TV channels are excellent and complete (50+) most importantly, 4 or 5 blockbuster movie channels, learning channels such as Discovery / Nat Geo etc, News, Kids channels etc", "title": "Location + View + Value = Perfect", "helpfulness": 2, "user": "ATL-Travelbug", "date": "June 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 132102138}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled with family", "text": "I thoroughly enjoyed my stay here, it felt like a home away from home, only with amazing views in a really handy location. It has everything you need, plus some lovely touches like a bottle of bubbly, chocolates on the pillows and handmade soaps. The manager was very accommodating and sent up a portacot and a highchair to use, and gave us lots of tips on places to go etc. The living area was nice and spacious and the deck was lovely in the evenings. The bed was super comfy, and there were no issues with noise from outside even on the weekend. I would love to stay here again sometime.", "title": "Love this place", "helpfulness": 1, "user": "Vicki R", "date": "January 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 150473633}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "I honestly do not know how anyone could be disappointed in these apartments. We stayed pre cruise for 5 nights over new year and the service, accommodation, views across the harbour and close proximty to everything made our stay an absolute joy. To pay the price we paid over the busy period we were ecstatic and would stay there every visit to Auckland. Even on New Years Eve we were not disturbed by noise and can only say thank you to our hosts for ensuring everything was wonderful. And we had air conditioning! The best part of course was just taking the bags across the wharf on cruise day. Do yourself a favour - if you are cruising in or out of Auckland, you can't beat these apartments for value.", "title": "Kilberry", "helpfulness": 2, "user": "Jan K", "date": "January 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 149997891}, {"rating": 3.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "The owner was very friendly and provided comprehensive advice about using the secure car park and the amenities in the room.", "title": "Ok", "helpfulness": 2, "user": "Hathersage", "date": "January 18, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 149936883}, {"rating": 1.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "The room was well equipped for self catering and was a good size.", "title": "Disappointing", "user": "sutina2671", "date": "January 13, 2013", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 5.0}, "id": 149611695}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "We felt the room was adequately clean but had a 'tired' appearance. The tables were marked and dented and the settee smelt a bit fusty. The entire kitchen tap rotated when used as did the soap dish in the shower! These minor details should be addressed as they are annoying.", "title": "Excellent location, great service, top class apartments", "helpfulness": 3, "user": "AndrewP_UK", "date": "January 5, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 148865931}], "location": {"country": "New Zealand", "region": "North Island", "continent": "South Pacific"}, "variance": {"poor": 0, "average": 3, "very good": 18, "terrible": 2, "excellent": 95}, "aka": "Auckland Waterfront Serviced Apartments Hotel Auckland Central", "slim_ranking": 0.0144927536232, "description": "Luxury 1, 2 & 3 bedroom self contained apartment accommodation with fabulous harbour views at Prince's Wharf, right on Auckland's waterfront - the perfect hotel alternative. Minimum 3 night stay.All apartments have fully equipped kitchen with dishwasher, fridge/freezer, oven, microwave, toaster and tea/coffee making facilities. Also Wi-Fi Internet, telephone, television, CD player/radio, cooling fan, heater, auto washer, clothes drier, iron and balcony with outdoor furniture. Secure on site car parking available on request."}