{"user_rating": 3.5, "review_count": 131, "name": "Auris First Central Hotel Suites", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "Good service, excellent executive apartment suit on 22nd floor - very spacious, comfy bed, very clean.", "title": "Excellent Suits !", "user": "goldma", "date": "May 19, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 161193457}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "Only wish, there was walk-in shower, as bathtubs slippery - Shower screen very awkward !", "title": "Good impression", "helpfulness": 1, "user": "Bojana_Karic", "date": "May 7, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 160000252}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "Location very good - short taxi drive to Jumeira beach - also near metro and carrefour supermarket !", "title": "It did the job (My 10th anniversary)", "helpfulness": 1, "user": "Najd B", "date": "April 6, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 156759179}, {"rating": 3.0, "stay_parameters": "Stayed February 2013, traveled solo", "text": "There is small roof pool, but lacks shade - Gym looks good though !", "title": "Not good, not terrible. Mixed feelings", "helpfulness": 2, "user": "supahotchick", "date": "March 15, 2013", "detail_rating": {"service": 1.0, "cleanliness": 2.0, "value": 1.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 154611319}, {"rating": 4.0, "stay_parameters": "Stayed February 2013", "text": "I must say I was pretty impressed with this property after reading so many not so good reviews. The location fit its purpose, since it took us maximum of 5 mins walking to Dubai Internet City metro station as well as to Carrefour supermarket. We used metro to longer distances as to Dubai mall and old city, but needed none to go to Palm, beaches or Burj Al Arab, since the hotel is near these attractions and can be cheaply reached by taxi.", "title": "range of well furnished suites to fit ur budget", "helpfulness": 1, "user": "tourister78", "date": "February 18, 2013", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 4.0, "service": 2.0, "rooms": 4.0}, "id": 152470714}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled with friends", "text": "We have just came back from our trip in Dubai. We chose Auris for the price (64 euros/room/night), with breakfast included and because it is a 4 star. The hotel's location is ok (Tecom area), considering that the distances are very big. The metro station is 5 walking minutes far from the hotel, taxis are 24h available. Fare per km is 1,76 AED, price per metro ticket is 2.2 AED. The staff is helpful, cleanliness is ok, with small exceptions, not worth mentioning, very nice gym at the top floor with a beautiful view, the rooms and bathrooms are big enough.", "title": "Good value for money", "helpfulness": 1, "user": "horiab", "date": "January 22, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 150249840}, {"rating": 2.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "Cons: very small pool, breakfast the same for 7 days (pretty poor), free wi-fi only in lobby.", "title": "Average in everytning", "helpfulness": 1, "user": "IvanZlatarski", "date": "January 4, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 148808958}, {"rating": 2.0, "title": "Mites in the sheets!", "text": "My wife and I stayed for 6 nights in a room for two (I would not call it a double bedroom) on 25th floor. Our passports were taken by the administration on check-in and we did not see them before check-out. Hot water takes 20-30 minutes to reach the upper floors (on our near the roof floor we used to open the hot water tap before going to breakfast and take a lukewarm shower 30-45 min. later). The breakfast itself is a hard to describe experience - it is absolutely atrocious (the 'feta' cheese deserves special mentioning: I hope it is not a slow acting poison). Believe me, I am Bulgarian and the worst hotel in my country offers better breakfast than the 4* Auris First Central. Only the mango juice was good. The exchange service at the hotel should not be left unmentioned too: the hotel rate for US dollar is 3.48 Dhm, while at the metro station only 5 min. away it is 3.65 (a 5% difference)! There is no storage room: when you check-out your luggage it taken outside and put a a rope surrounded place left unwatched by anyone from the hotel staff. Just at the door of the hotel there is a huge construction site and this affects both the view and noise level. Speaking about the noise, the hotel is occupied mostly by Russian families whose small children run stomping in the corridor and don't give you a chance to rest before 11:00 p.m.", "user": "Ilias C", "date": "December 24, 2012", "id": 147985850}, {"rating": 3.0, "stay_parameters": "Stayed November 2012, traveled on business", "text": "On the positive side: the hotel is clean, the staff friendly and helpful, the location not so bad (you you love living next to a big construction site) - 5-7 min walking distance from a metro station, and 2 stations away from Mall of the Emirates. There is a Carefour and a 'Park and shop' shops nearby if you prefer to personally select what you are eating.", "title": "I was a little disapointed", "helpfulness": 2, "user": "Always0nthemove", "date": "December 18, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 147659609}, {"rating": 3.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "Never in my life I felt like making such review on a place that hosted me, but this time I was treated as if I was not paying for my staying. Estetically the hotel looks very nice, even if quite far from the city center - just contraddicting its name -, but after the first night I and the rest of my family found our bodies full of bites from mites! They were everywhere in the room, from pillows in the bed, to the sheets... We spent most of our holiday in Dubai scratching ourselves! The cleaning of the room was very poor, as you can easily imagine, and sometimes they didn`t even make my bed... The service was also very slow, and when I had even a simple request I had to ask again and again after hours, that made me think they didn`t care at all and probably forgot my request the first time.", "title": "Excellent place except for the staff and poor service", "user": "Becks A", "date": "December 13, 2012", "detail_rating": {"service": 1.0, "cleanliness": 2.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 147385386}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "We booked a studio and got a free upgrade to a one bedroom apartment, which we really appreciated. Well appointed rooms in a nice style, only drawback was the fact that we had no view, just another tall office building. Kitchenette a bit restricted, though provided with a large fridge. It worked properly, so we cooked our own meal and arranged our own breakfast which was great as we saw the queing for the restaurant in the morning! Very convenient was the nearby Geant shop. Nice rooftop swimming pool with a great view. Free wirless internet in the lobby, paid in the room.", "title": "Nice place in every respect", "helpfulness": 2, "user": "Truus58", "date": "November 23, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 146006372}, {"rating": 3.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "1- Small hotel", "title": "My feedback about the hotel", "helpfulness": 1, "user": "asedki", "date": "November 3, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 144366282}, {"rating": 2.0, "stay_parameters": "Stayed November 2012, traveled with friends", "text": "2- Clean 90 %", "title": "15 minutes wait for breakfast", "helpfulness": 6, "user": "LjupcoSkopje", "date": "November 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 2.0, "location": 1.0}, "id": 144277110}, {"rating": 3.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "3- Room space good", "title": "Was okay", "user": "nixstix", "date": "October 20, 2012", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 143281081}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled solo", "text": "4- The have small GYM with nice view", "title": "Good hotel in a convenient location", "helpfulness": 3, "user": "bigar", "date": "October 15, 2012", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "location": 5.0, "value": 5.0, "rooms": 5.0}, "id": 142879731}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "Great hotel. Very clean, very nice. Staying for 5 nights - no complains. We stayed at the 28th floor and always had a very strong water pressure! Breakfast could be a little bit better, but the room and staff kindness compensate for it. Great location, maximum 5 mins walk to the metro station, 2 mins from Carrefour.", "title": "Auris First Central Hotel Suites - a nice stay", "helpfulness": 3, "user": "VO_BG", "date": "February 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 152422774}, {"rating": 3.0, "stay_parameters": "Stayed February 2013, traveled with friends", "text": "Overall - excellent hotel for a good deal of money! :)", "title": "Going backwards", "user": "imagine_kok", "date": "February 18, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 152403139}, {"rating": 3.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "Having stayed in this hotel on two previous occasions, I can honestly say that it has gone a bit backwards since my last stay a year ago. The service has just become a little bit lethargic, for example on the morning of our check-out, there was only one receptionist available for a whole group of travellers. The breakfast was terrible, we even decided not to have breakfast at the hotel on the third day and rather went to Emirates Mall for breakfast. The Auris Hotel must pull up their socks if they want to maintain the excellent service I received during my first two visits!", "title": "Good Room, bad food", "user": "LizaRios", "date": "February 17, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 152309155}, {"rating": 3.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "Stayed here for 5 nights during our visit in Dubai. Our 1-bedrom suite is spacious for just 2 of us, helpful personnel & good location (near to Metro Station). However, there is no wifi in the room, just the lobby. The in-room wired internet is chargeable on daily rate which is not suitable since we're always outdoor. So the lobby is always crowded & the internet speed is poor. The worst thing is the daily breakfast which i consider not eatable, tasteless & blurghh!!... always the same menu everyday too. The only eatable are breads with jam or butter. We got rid of it's FREE breakfast after the 3rd day. Overall, the hotel is ok for it's location & personnel service.", "title": "Average hotel in a great location.", "user": "As02", "date": "February 13, 2013", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 152041416}, {"rating": 3.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "We stayed here for over a month when we relocated to DXB. Service is very average. The location is perfect for tourists. Mall of the Emirates is 5 mts by taxi. The hotel is in a convenient location for everything.The Internet city metro is 2 mts away. There will never be a problem for Taxis near the hotel. Carrefour is just across the hotel. There is also a laundry store just behind the hotel. In all, the hotel is perfect to tour around Dubai whilst you can also get your errands done.", "title": "No meals packege!", "helpfulness": 1, "user": "Anamaria M", "date": "January 31, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 151076715}], "location": {"country": "United Arab Emirates", "continent": "Middle East", "city": "Dubai"}, "stars": 4, "variance": {"poor": 8, "average": 39, "very good": 33, "terrible": 12, "excellent": 39}, "aka": "Auris First Central Hotel", "slim_ranking": 0.466950959488}