{"user_rating": 4.0, "review_count": 226, "name": "Austria Trend Hotel Ljubljana", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed August 2005", "text": "The Domina Grand Media pitches itself as technologically advanced, \"wired\", a hotel for the 21st century - and they do try to fulfill that promise, but the staff have a lot of work to do before the hotel matches its promise. A few examples: you control the room's features through the flat-screen TV, but a faulty remote control (weak battery?) meant it was impossible to work these much of the time - which meant in turn it was impossible to turn the TV off. Ah, you might think, one can just switch it off manually, which was true; but that only turned off the TV proper, leaving the sound still piping merrily, at full volume, in the bathroom. The in-room internet, also access via tv, was a strangely limited set of preselected websites rather than a real internet portal. The soap in the bathroom was exactly the right shape to get stuck, irretrievably, in the stylish and modern frosted-glass soapdish. That said, the room was generously sized, they often run specials that are good value, the breakfast is nice (though crowded, and when we were there the servers were overworked), and the distance from the center is not really a problem. There is no pool and no fitness center, which is odd (in nice weather, you can go for a run at the nearby hippodrome). The spa is pleasant and the massages very good.", "title": "Good concept, iffy execution", "helpfulness": 5, "user": "MarkoP", "date": "January 28, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "service": 3.0}, "id": 4393423}, {"rating": 3.0, "stay_parameters": "Stayed January 2006", "text": "It's never going to be a great hotel (to be fair, it doesn't claim to be); with some improvement it could be a very good one but when we stayed there it was seriously flawed.", "title": "not great", "helpfulness": 4, "user": "WharfTrader", "date": "January 10, 2006", "detail_rating": {"cleanliness": 2.0, "value": 3.0, "rooms": 3.0, "service": 4.0}, "id": 4335327}, {"rating": 5.0, "stay_parameters": "Stayed August 2005", "text": "wasn't that impressed at all with this hotel - room was fine but pretty standard - could've been anywhere in the world - flat screen media centre is a nice touch but a pain to work out - corridors shabby - 'Casino' not exactly classy! - short cab ride from town - but too far out for such a small place - the city itself is beautiful - couldn't see the need to spend more than a couple of days - Castle a must see, and would recommend a restaurant call Sokol (i think!) which is near the city centre -", "title": "awesome place", "helpfulness": 5, "user": "nireno", "date": "December 14, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4243285}, {"rating": 5.0, "stay_parameters": "Stayed November 2005", "text": "I stayed at this hotel two times and whats there to say but excellent hotel in the city.", "title": "fantastic", "helpfulness": 6, "user": "aeronaut", "date": "December 14, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4241655}, {"rating": 5.0, "title": "Loved Grand Media", "text": "The breakfast is one of the best I had in Europe, can compare with any 5 star hotel, the selection is great, you wont leave the restaurant hungry.", "helpfulness": 5, "user": "PaulT95", "date": "October 6, 2005", "id": 3998295}, {"rating": 5.0, "stay_parameters": "Stayed September 2005", "text": "I would echo all the other positive reviews. I booked the weekend package at 65 euros/night single room, turned out to be a jr. suite. The free Internet was fantastic, though some of the sites did not load properly on their TV screen. The free phone calls to fixed lines around the world was great. The breakfast buffets were of five-star hotel quality. The hotel is a ways out from the tourist center, but there is the hotel shuttle that is pretty efficient, and the city buses stop right in front of the hotel and run right into the Old Town area. Great stay.", "title": "Fantastic Hotel With Lots of Features", "helpfulness": 4, "user": "Available", "date": "October 3, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 4.0}, "id": 3986799}, {"rating": 5.0, "stay_parameters": "Stayed September 2005", "text": "This is a great hotel but don't expect it to be anywhere near the old town (and don't try to walk it). However, the hotel does have an excellent shuttle service to and from the hotel to the old town. Get a schedule of the shuttle service times when you check in -- and use it -- it's great as is the hotel. Sit on your bed and use the wireless remote to control a giant flat pasma screen for TV and free internet. Also free long distance calls around the world as clear as a bell. The rooms are more like suites and are reasonably priced for what you get. The breakfast (included) is the best we had in Europe.", "title": "Wonderful, Very Modern Hotel", "helpfulness": 3, "user": "Albo007", "date": "September 30, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3980392}], "location": {"country": "Slovenia", "region": "Upper Carniola Region", "continent": "Europe", "city": "Ljubljana"}, "stars": 4, "variance": {"poor": 9, "average": 24, "very good": 123, "terrible": 6, "excellent": 64}, "aka": "Austria Trend Ljubljana", "slim_ranking": 0.571428571429}