{"user_rating": 3.5, "review_count": 948, "name": "Avalon Reef Club Isla Mujeres", "reviews": [{"rating": 2.0, "title": "Could be worse... but could be so much better", "text": "Unless you must be at an all-inclusive hotel, Avalon is far from the best place to stay on Isla Mujeres. While nothing is more than a 10 minute walk from the hotel, it is the most isolated hotel from the main restaurants and the pier area - this might put off some people.", "user": "ibreak4coffee", "date": "July 3, 2008", "id": 17501287}, {"rating": 4.0, "stay_parameters": "Stayed June 2008", "text": "While the hotel is far from a dump, it is showing serious signs of aging. Check-in took almost 20 minutes, the rooms are extremely small, the showers never seem to have hot water, and the whole property is far shabbier than the pictures show.", "title": "Comfortable and friendly", "helpfulness": 4, "user": "jaleha", "date": "June 26, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 17250846, "likes": {"liked": "— Location and friendly staff.", "disliked": "— Nothing."}}, {"rating": 3.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "The beach is terrible - walk a few minutes to Playa Norte, which is wonderful - and on two separate occasions we were relaxing at the pool only to have a series of dead cockroaches float past us.", "title": "Lost some charms, still not bad!", "helpfulness": 1, "user": "thl1025", "date": "June 24, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 17171402, "likes": {"liked": "— Location, surrounding", "disliked": "— Excessive, smelly sea weeds piled up near beach"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "Isla Mujeres is a great place to spend your vacation, but there are far better options on the island for quality and price than the Avalon.", "title": "Simply Splendid!", "helpfulness": 5, "user": "Breanna B", "date": "June 19, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 17038350, "likes": {"liked": "— Great views, awesome food, excellent service", "disliked": "— nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled with family", "text": "My daughter and I just returned from a week stay at the Avalon. We really enjoyed ourselves. We did not opt for the all-inclusive as we did not plan on drinking much, and we wanted to eat at several different locations on the island. We stayed in a studio facing the island and were quite comfortable. The rooms are not luxurious but are certainly attractive and spacious enough. The maid service was very good, and it was helpful to have the mini frig in the room. Our air conditioner worked well and we had good water pressure. I have always loved the location of the Avalon and still find it one of the best on the island. The beach is not what it was a couple of years ago, but that cannot be helped. There was some seaweed around the resort, but they have people working to remove what they can. All the staff were friendly and helpful. The breakfast buffet turned out to be included in our package, which was a very nice surprise. All in all, I still think the Avalon is a very lovely property and a very good buy. I would definitely return.", "title": "Loved it!", "helpfulness": 5, "user": "CavortingCarol", "date": "June 5, 2008", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 16698576, "likes": {"liked": "— The location", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "Wish we could have stayed here longer. We left the Posada Del Mar after 2 nights...what a pleasant surprize this hotel was..great beach and lagoon. Nice pool with swim up bar. Beach chairs and umbrellas at no extra charge. The resteraunt was clean and the food was good. We did not buy the all inclussive package because we wanted to go to some of the other resteraunts in town. The room was beautiful and comfortable. It would have been perfect if our 3 night stay on the island had been here. This was our 4th time on Isla Mujeres and each time it gets more crowded and more expensive, but if you are a new commer here it would be fabulous. Keep an eye on the ferry schedule for your return if you are catching a flight back home.", "title": "Great and wonderful", "helpfulness": 4, "user": "davebamboo", "date": "May 21, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 16291238, "likes": {"liked": "— the beach and lagoon", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "While staying at the Reef’s sister resort in Cancun, The Baccara, we took a day trip to the incredible Isla Mujeres. The island itself is like something out of a movie. If you’re looking for isolation and authentic Mexican charm, look no further. La Isla is easy to navigate, after stepping off the affordable ferry ride from Puerto Juarez, a taxi was waiting to transport us to the Reef resort. All taxis on the island are 2 dollars no matter where you go. 2 minutes later we were crossing a bridge that is the only access to and from the Reef.", "title": "Simply Amazing", "helpfulness": 4, "user": "skycruiser13", "date": "May 20, 2008", "detail_rating": {"front_desk": 5.0, "value": 5.0, "location": 5.0, "service": 5.0}, "id": 16248563, "likes": {"liked": "— The beach and the Island!"}}, {"rating": 3.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "We were stunned. The facilities were amazing. The view is unparalleled. We arrived early in the morning and ate a wonderful breakfast on a deck overlooking the sea. The front desk arranged a golf cart rental and booked an appointment for a swim with the dolphins. We spent hours driving the golf cart around the island exploring the many different sections of Mujeres. We stopped by the sea turtle farm and for 2 dollars a piece we enjoyed some time with the endangered animals. We went to the house shaped like a conch shell, checked out the Gaffaron Park which had post card worthy views. Finally we swam with the dolphins, an experience worth every single penny. We high tailed it back to the resort and spent some time at the beach and checking out the Reef. The condos were amazing and the outside looked freshly painted. The views from the Caribbean Sea side were breathtaking. We walked to the king’s bath and saw numerous fish, urchins, crabs and other sea life. The beach at the Reef is large and uncrowded. You can walk out 300+ yards and still be in waist deep water. We regret not spending at least a night or 2 away from the hustle and bustle of Cancun. If you’re looking for a truly unique vacation, look no further than the Reef.", "title": "\"The good, the bad and the ugly\"", "helpfulness": 2, "user": "elroy", "date": "May 18, 2008", "detail_rating": {"front_desk": 4.0, "service": 2.0, "cleanliness": 5.0, "value": 3.0, "rooms": 3.0, "location": 5.0}, "id": 16179318, "likes": {"liked": "— Cleanliness", "disliked": "— weak shower, no hot water, no fan"}}, {"rating": 2.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "We just returned from the Avalon Reef. We previously stayed there in January 2006. The beach is indeed much smaller than in '06 and as other travelers mentioned, it does smell at times. They have to clean the seaweed from the shore every day. They haul it with a wheel barrow and dump it over by the pier. There is a huge pile of dried up seaweed there. It was not like this in '06 either. We did not find out why there is so much less beach and so much seaweed and rocks. One side, by the bridge, is better than the side by the pier. You used to be able to walk in front of the restaurant, but not anymore because the beach is gone. I think it was nicer when the beach was there because now, you have to walk through the restaurant to get to the other side. They have signs up that say you should not enter that area if you are wet, have no shirt or are barefoot -- well, that is ridiculous. The only other place to get to the other side of the beach is literally through the pool. There is no place else to cross!! We also noticed some other things that I thought I would mention. Their toiletries are just cheap junk. They used to give you nice stuff with the Avalon name on it; now, it is very cheap stuff. You will get one small bottle of shampoo and two soaps and that is it. We decided to buy some shampoo, which was expensive. As other travelers have mentioned, they did turn off the electricity one day and there was no hot water on another day. It must be something they just do, I think to save money?? At 6 pm there was still no hot water and when I asked about this, he said, well, just take a cold shower then. How many of you like to do that? We stayed in a one-bedroom villa. The room was very clean. Yes, the bed was hard. The water in the shower trickled out, so if you have long hair, it takes forever to rinse. The overhead fan did not work in the room, the air conditioner was down one day, the TV remote did not work. Nevermind calling for maintenance -- you are wasting your breath. The pool area was the same. I can tell you they WERE preparing to open the swim-up bar. I have to tell you that I did not think the staff were so friendly. Courteous, at best and yes, we did tip. You have to sign for everything -- even for one drink at the bar. My husband did get sick from something, not sure what. The fancy restaurant was only OK. What ticked us off was that we were boldly told that men MUST where long pants, cannot wear sandals or a T-shirt. Well, guess what -- we look over next to us and there was a guy sitting with cut off shorts and flip flops, yet they would not let this other guy in who was wearing shorts. Rules for some, not others??? I'm sorry, buy my husband was roasting in there. The air conditioning was not on very high. We requested to sit under a fan so he could stand it. The grounds are kept up very nicely though. They are beautiful. The hammocks were great and as before, the King's Pool was a lot of fun. If you like to watch TV and I know a lot of people do, there were not many stations in English. If you like soccer, there was probably 3 channels with that on. They had CNN from, I think, England. We did choose the all-inclusive plan. Some of the food was very good, some was not so good . . . . I did not think much of the breakfast buffet. The self-help portion had some stuff that looked awful. They used to have scrambled eggs, french toast in there. Now, you have to special order the eggs and there is no french toast or waffles. They will make you pancakes though. No oatmeal either. I like oatmeal and when I asked for some, they gave me a bowl of dried oats!! They still have nice fruit although not always bananas. We did have to pay for the transportation too. This was included the first time we visited -- not anymore. There was only a couple of nights where there was some entertainment. Don't expect that. No bingo by the pool!! One afternoon they had trivia at the beach. There was one day of volleyball in the pool. Yoga at 11 am. in the pool. All in all, please know that it is STILL a very pretty location, in fact, there was a wedding there on Wednesday. I am just trying to give people a \"heads up\" about some things. We went into town a couple of times. There is a lot of construction going on, as one other traveler pointed out. Someone told us that the Avalon was being sold to the Mayan Palace organization and that they were going to rip down the Avalon and build something else at that location. I have no idea if this is true! I wish I did. This person said the owner of the Avalon Resorts needs the money. Being an owner, this is a bit scary.", "title": "Mixed Results", "helpfulness": 1, "user": "ClaireSleboda", "date": "May 13, 2008", "detail_rating": {"front_desk": 2.0, "business": 2.0, "service": 4.0, "cleanliness": 5.0, "value": 2.0, "location": 4.0, "rooms": 2.0}, "id": 15977631, "likes": {"liked": "— Location", "disliked": "— food"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "The Avalon Reef is a study in contradictions. The location is breath taking but the Avalon Reef itself, misses the mark. The housekeeping staff was excellent, the service staff were pleasant and cheerful and we had no trouble with room service. In fact the food through room service was better and cheaper than what was available in the dining rooms. Skip the all inclusive, there are many great places to eat on the island. Everything in the hotel seemed overpriced, especially, in view of what was available in town. The front desk staff and concierge seemed uninterested and aloof. We were supposed to get a villa, but were told nothing was available that compared to the unit we exchanged. Yet the unit we did get, did not compare to our home unit either. We felt we were treated like 2nd class citizens because we did not own at the Avalon ( we exchanged through Int. Int'l.) We were told how important our wrist bands were but not what they meant .ie: as members you can drink free from 9a-5p. We found out from other guests after paying for drinks for 2 days. Isla Mujeres has many breath taking sites to see, Snorkeling in King's bath was awesome, pay the $3 and see all of Punta Sur, Don't miss Bally Hoo, Sunset Grill and Picus restaurants.", "title": "Great Vacation", "helpfulness": 4, "user": "dnicks", "date": "May 11, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 3.0, "location": 5.0}, "id": 15939856, "likes": {"liked": "— Location", "disliked": "— Bed"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "A group of seven cousins traveled to Isla in late June for a four night stay at the Avalon Reef Club. Many in the group had never been to Mexico and this was their first all-inclusive experience.", "title": "Great Location, Relaxing Isla, a few suggestions", "helpfulness": 3, "user": "Kerri W", "date": "July 18, 2008", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 5.0}, "id": 18010641, "likes": {"liked": "— Location", "disliked": "— Service in restaurant"}}, {"rating": 1.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "First off I loved the island. A perfect mix of restaurants, relaxed atmosphere, nice beaches, and you can't be traveling by golf cart. The Avalon Reef is situated on a very nice beach, just minutes from restaurants and shops. The grounds are well maintained, the rooms are basic, and the food is decent.", "title": "We left after one night but I can see why some people enjoy this hotel", "helpfulness": 4, "user": "lolaherman25", "date": "July 17, 2008", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 3.0, "cleanliness": 2.0, "value": 2.0, "location": 4.0, "rooms": 2.0}, "id": 17989609, "likes": {"liked": "— the view", "disliked": "— the food and hotel"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "Doing an all-inclusive was important to us since we were in a large group. But there are so many restaurants and street vendors that if it was just me and my husband we would probably skip the all-inclusive.", "title": "First trip to Mexico, and we'll be going back", "helpfulness": 4, "user": "zephyr64", "date": "July 16, 2008", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 17927721, "likes": {"liked": "— Being waited on at every turn."}}, {"rating": 4.0, "title": "Hotel is good. Island is amazing!", "text": "Martin the activity director was very helpful with information about ferrys, golfcarts, and excursions. My only real complaint was what appeared to be a management problem in the restaurant area. The employees did not go out of their way to bring drinks, be friendly, or accommodating. This was with plenty of tips. We also had to sign for meals, which seemed ridiculous with our all-inclusive bracelets. We were told we could not sit at the bar to eat, and I was reprimanded for taking a breakfast bar off a display at 6:58am on the way to an excursion. A different, upbeat manager would probably do this place a world of good.", "helpfulness": 4, "user": "ana_bella10543", "date": "July 14, 2008", "id": 17875927}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "Read this whole review before booking!", "title": "Great Spot", "helpfulness": 4, "user": "melinade", "date": "July 12, 2008", "detail_rating": {"front_desk": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 17819068, "likes": {"liked": "— Views, cleanliness, Staff", "disliked": "— No balcony."}}, {"rating": 2.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "My husband and I stayed 3 nights in July, we enjoyed our time at the Reef hotel on Isla Mujeras but I wouldn't go back.", "title": "not bad, but I won't go back", "helpfulness": 1, "user": "Pufflit", "date": "July 10, 2008", "detail_rating": {"front_desk": 2.0, "service": 1.0, "cleanliness": 3.0, "value": 2.0, "rooms": 2.0, "location": 3.0}, "id": 17767739, "likes": {"liked": "— The Island was nice and the hotel was close the the downtown area", "disliked": "— the very poor service"}}, {"rating": 2.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "It's a quite little hotel, and I mean quite. Everything (town included) closed up early, this may not be the case during the peak season...we were there diring the low season. We did get plenty of rest and relaxation, as all the (2) bars were empty or closed when we finished dinner.", "title": "Good location, bad room.", "helpfulness": 2, "user": "SantiagoDelValle", "date": "July 8, 2008", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 2.0, "cleanliness": 2.0, "value": 2.0, "location": 3.0, "rooms": 2.0}, "id": 17670001, "likes": {"liked": "— location", "disliked": "— small rooms with no view."}}, {"rating": 3.0, "stay_parameters": "Stayed June 2008, traveled with friends", "text": "The hotel is ok...nothing special. The regular rooms are very small, but we didn't mind since we didn't spend much time there.The rooms and hotel is clean and has AC. The pool is also fairly small and there is very little beach left. The seaweed was noticeable but not a deal-breaker.", "title": "Resort on Isla Mujeres?", "helpfulness": 6, "user": "UndrH2O", "date": "July 7, 2008", "detail_rating": {"cleanliness": 4.0, "front_desk": 4.0, "value": 4.0, "location": 5.0, "service": 5.0}, "id": 17624096}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "The real deal breaker was the lack of service. We had decent service at lunch only because my husband put some cash on the table as a kind of incentive.", "title": "My husband and I just returned from 9 days at Avalon Reef on Isla Mujeres. It wa", "helpfulness": 3, "user": "Farrah_eliza", "date": "July 6, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 17589327, "likes": {"liked": "— location", "disliked": "— NOTHING"}}, {"rating": 5.0, "title": "Avalon Reef", "text": "The worst was the dinner that we had at the \"reservations only\" restaurant (and they enforce that even when the place is empty), which consequently is the only non-buffett restaurant in the hotel. But you do have access to the 2 other Avalon properties in Cancun....however the staff wont freely offer that (or any other) info....you must ask specifically about everything!! At our dinner in the \"reservations only\" restaurant the waiter brought me the wrong meal and knew it, but the only thing he did was appologize for the error....he didn't correct his mistake!! And then he has the nerve to ask how it is and when I told him that it was just ok, he again just appologized. Never offered to bring me anything else. Just not what we expected from a resort like this. Also the waiter forgot our coffee and desserts! We found that the wait staff was really not to eager to help, as they were not getting rewarded for busting their butts. Tips are included with the all-inclusive plan, and boy did some of them act like it.", "helpfulness": 3, "user": "Love2campNc", "date": "July 5, 2008", "id": 17554732}], "location": {"country": "Mexico", "region": "Yucatan Peninsula"}, "stars": 3, "variance": {"poor": 132, "average": 180, "very good": 316, "terrible": 119, "excellent": 201}, "aka": "Avalon Reef Club Isla Mujeres Hotel", "slim_ranking": 0.657142857143, "detail_rating": {"service": 3.5, "cleanliness": 3.5, "value": 3.5, "sleep": 3.0, "rooms": 3.0, "location": 4.5}}