{"user_rating": 4.0, "review_count": 434, "name": "Avalon Hotel Beverly Hills", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "The Avalon is a nice, modern, retro hotel in a very safe area of LA, in the heart of Beverly Hills. The staff are very friendly; we got free wifi for the duration of our stay, as a gift. The rooms are spacious and nicely decorated. The hotel gym is probably one of the nicest I've been to. You can watch Netflix movies while running on the treadmill. Valet parking is sharp at $31 per day, that's the only reason I wouldn't give a 5* rating.", "title": "Retro hotel in the heart of Beverly Hills", "helpfulness": 1, "user": "EKGK", "date": "June 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 165622574}, {"rating": 3.0, "title": "I really wanted to like this place ....", "text": "There's a Brooklyn Water Bagel cafe 5 mins walk from the hotel and their bagels are amazing. Also, the Burger Lounge (also 5mins walk from the hotel) does excellent quality burgers.", "helpfulness": 1, "user": "Weloveed", "date": "June 25, 2013", "id": 165171714}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "The Avalon is a beautiful hotel, located in the perfect location to explore LA and Santa Monica.", "title": "Hate to let the secret out", "user": "Babs D", "date": "June 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 165062662}, {"rating": 3.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "but to be honest was a little disappointed . I dont know how much we paid as it was part of a package so cant comment on value . The down sides for me were ,1) the room we had was probably half the size of any other room we had on our recent route 66 road trip across America 2) On 2 of our 3 nights there , there was a function in the evening by the pool which was really noisy,and as we were out sightseeing in the day and the pool was closed when we got back we never got chance to take advantage of it , although it did look nice 3) I would have thought a couple of touches in the room like free coffe/water woud have enhanced the experience as I guess the place doesnt come cheap .", "title": "Mixed feelings for the nice hotel", "user": "Jenniferhlv H", "date": "June 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 164913130}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled with friends", "text": "On the postive side ,yes the place is beautifully decorated but I feel that maybe style has won out over comfort , or maybe I am the wrong demographic for this hotel .It is convenient for reasonably priced shops and restaurants , which suprised me .", "title": "Absolute Gem!", "user": "Kami R", "date": "June 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 164528362}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "Nice art deco style hotel on main street but still tucked away in a quiet residential area of Beverly Hills. The front desk staff was always so helpful and friendly, as was everyone we encountered at The Avalon.", "title": "art deco haven in quiet residential Beverly Hills", "user": "brandbridgeltd", "date": "July 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 168926496}, {"rating": 1.0, "stay_parameters": "Stayed July 2013, traveled on business", "text": "Nice outdoor courtyard pool (although hard to get any real sun rays since it sits surrounded by the hotel rooms), with comfortable seating and great food and beverage service.", "title": "Noisy", "helpfulness": 1, "user": "NJmember", "date": "July 23, 2013", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 2.0, "sleep": 1.0, "rooms": 1.0, "location": 4.0}, "id": 168698180}, {"rating": 5.0, "stay_parameters": "Stayed July 2013", "text": "Our room was a little dated with minimal amenities (old school style wall air conditioners).", "title": "Excellent boutique hotel. Best service in US", "user": "uberd", "date": "July 20, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 168262518}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "There are 3 different buildings...we were in the \"tower\" across the alley, which seemed to be an older building, but we're not sure how it compares to the rooms in the other buildings.", "title": "Gorgeous and confortable", "helpfulness": 1, "user": "Fernanda S", "date": "July 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 167585651}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled on business", "text": "This is a very nice spot in a very nice part of LA with a very nice staff...all at a great price.", "title": "Great customer service very cute hotel", "helpfulness": 1, "user": "EstelleHNewYork_NY", "date": "July 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 167518382}, {"rating": 3.0, "stay_parameters": "Stayed June 2007, traveled solo", "text": "What is this hotel trying to be ? Boutique ? Edgy ? Layed-back ? Exclusive ? I couldn’t figure it out.", "title": "Different, but not for me", "helpfulness": 1, "user": "DooCue", "date": "July 4, 2007", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 5.0, "rooms": 5.0}, "id": 8055789, "likes": {"liked": "— Location met my needs", "disliked": "— Everything felt crampted"}}, {"rating": 1.0, "stay_parameters": "Stayed June 2007, traveled on business", "text": "I wanted a quiet place in Beverly Hills but more than a B&B. The Avalon certainly meets that criteria. And the area is lovely and walkable.", "title": "MAnagers", "helpfulness": 2, "user": "symsa", "date": "June 6, 2007", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 2.0, "cleanliness": 2.0, "value": 1.0, "rooms": 2.0}, "id": 7790759}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "The lobby, pool and restaurant all share the same generally smallish space and this made registering, lounging and eating feel awkward. Who wants to eat lunch when someone dripping wet is drying off right next to you ? Who wants to lounge in the sun (which only briefly enters the cavernous pool area) while waiters are carrying food past you to nearby tables with chatting and smoking guests. One day there was a hip hop music party being filmed, the next day there was a loud birthday party celebration by people who did not appear to be hotel guests. Except for one 8:00am breakfast, I never stayed by the pool, but saw other guests who did. There's a party-like atmosphere at night where groups mingle in semi-enclosed spaces.", "title": "Accomodating, good value, swank place", "user": "DawnWeins", "date": "June 6, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 7790708, "likes": {"liked": "— Swank atmosphere with no pretention", "disliked": "— The food in the restaurant"}}, {"rating": 3.0, "title": "A bit misleading...", "text": "The hotel is about modern design and none of it seemed very inspiring. Were it not about design, I might not mention: the tiniest toilet seat I ever sat on – a veritable baby pooper; impossible to reach toilet paper holder; absence of towel racks; a massive bathroom door with a square frosted window that would keep clanking closed and a green bi-toned color scheme that made it fell like being in a prison cell. The bathroom had no working ventilation and the door was so tight-fitting that my towels were still wet 6-hours after a shower, in the bone-dry southern California climate!", "helpfulness": 3, "user": "gtothelo", "date": "May 21, 2007", "id": 7669320}, {"rating": 3.0, "stay_parameters": "Stayed April 2007, traveled on business", "text": "The bed and pillows were super comfortable and the sheets were very high quality. The air conditioner too noisy. The room was well-stocked with bar goodies and there was apparently 24-hour room service. The front desk staff were friendly, attentive and helpful. My one breakfast and one lunch in the restaurant were expensive but very good tasting and nicely presented. The valet parking was snappy. (It aught to be at $28 per night !)", "title": "Avalon - great service, nice vibe, but room for improvement", "helpfulness": 2, "user": "Bugs1012", "date": "April 30, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 3.0, "location": 3.0, "rooms": 2.0}, "id": 7483726, "likes": {"liked": "— the 1950s vibe, the pool area", "disliked": "— sound proofing in some of the rooms"}}, {"rating": 4.0, "title": "A gem in Beverly Hills...", "text": "Where else in Beverly Hills can you sit in a more chic environment and be treated like a queen? The Avalon Hotel's staff is there for your every need, and what's more, they seem to genuinely care about making you have the best possible stay. There is nothing better than coming back from a long day of work and sitting poolside sipping a martinin and eating from their eclectic bar menu...the atmosphere is so very LA, but without the pretense that we all see at other hotels. I have been coming to this hotel for years, and I will continue to come back. After a recent discussion with their staff I have come to learn that they are going to be renovating in the next year...after seeing what Kelly Wearstler has done at the Avalon and the rest of the Kor Hotels, I am beyond excited to see what she will do with this already stylish hotel. Hat's off to the Kor Hotel Group and the Avalon Hotel....If you haven't stayed here yet, you are missing out.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "May 31, 2006", "id": 5287657}, {"rating": 1.0, "stay_parameters": "Stayed May 2006", "text": "I could not agree more with the reviews below. The rooms are small, which is ok, but the furniture is cheapo (Ikea like), TV is at least 7 years old with crummy picture, no flat screens here...you would think based on the sheik lobby it would have room finishies of similar respects, but it does not. The linens seemed like a cotton-poly blend, comforter was nice though. $11/day internet, no bath-tub, standing shower only, cheap counter-top in bathroom made of formaica...not even marble. The faucet looks like an industrial faucet used to clean paint brush's. Lacking art work on the walls as well.", "title": "Old tired kitschy bs hotel", "helpfulness": 11, "user": "bigtimetravelguy", "date": "May 28, 2006", "detail_rating": {"cleanliness": 4.0, "value": 1.0, "rooms": 1.0, "service": 5.0}, "id": 5229859}, {"rating": 2.0, "stay_parameters": "Stayed May 2006, traveled on business", "text": "The positives of the Hotel are the staff, they were very friendly and well dressed. Additionally, I did order room service which was excellent, so not all is lot. I would think for the $200+ rates they are charging they would spend the $15,000/room and clean the place up, I'm sure it would pay huge dividends...I would have a hard time ever staying at another Kor Hotel, or at least one that they remodeled, I would probably stay at The Tides b/c they didn't do the renovation, they just took over the mgmt.", "title": "Not what reviews promise", "helpfulness": 9, "user": "raven40", "date": "May 12, 2006", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "rooms": 1.0, "service": 4.0}, "id": 5057478}, {"rating": 1.0, "title": "Overpriced Dump", "text": "I am not sure where all those great reviews are coming from. The last one is accurate. This old gal has seen its days. Do NOT expect what you see in the on line photos. DO expect something tattered from the 60's.", "helpfulness": 8, "user": "A TripAdvisor user", "date": "April 22, 2006", "id": 4994397}, {"rating": 5.0, "stay_parameters": "Stayed February 2006", "text": "If you expect to see Dean Martin and the rest of the Rat Pack emerge from the mists in the Avalon lobby then this may be the place for you. It is the 4th Kor hotel I have been booked into and hopefully it will be the last. Their style seems to be quirky at best. The people could not be nicer BUT it is NOT a 21st century property. And none of their hotels are close to being good value.", "title": "A great find in LA", "helpfulness": 6, "user": "JohnNL", "date": "April 3, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 5.0}, "id": 4831434}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled with friends", "text": "Lovely small hotel - with big rooms, friendly service. Lovely pool area. My only minus would be the location it's about a 15 minute walk to Rodeo drive. But there aren't really any bars or restaurants that close. As much as i enjoyed my stay at the Avalon I think if I went back to LA I would choose to stay in Sunset BLVD in The Standard or Mondrian simply because of location. However if Beverly Hills is where you want to be then you must stay in this gorgous hotel.", "title": "Lovely hotel", "user": "cl0dagh", "date": "April 24, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 3.0, "rooms": 4.0}, "id": 7430610, "likes": {"liked": "— The Bar and pool area", "disliked": "— Location"}}, {"rating": 1.0, "stay_parameters": "Stayed March 2007, traveled on business", "text": "I booked a room at the Avalon for a two week stay while there on a business. I was bringing not only my significant other (she works with me), but our dog. We were given a Canon Studio which it turns out is actually located in a small apartment complex across the street from the main hotel.", "title": "GIve me a break!", "helpfulness": 3, "user": "maroon_wolverine", "date": "April 3, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 3.0, "value": 1.0, "rooms": 1.0, "location": 1.0}, "id": 7278768, "likes": {"liked": "— pleasant staff, cool lobby", "disliked": "— Just about everything else"}}, {"rating": 4.0, "title": "Friendly, Quiet and definately worth the money!", "text": "We were told it was 500 square feet. That was not even close to true, even if you added in the patio and bathroom and closets and whatever. It is at most 300ft. It did have a kitchenette with a small fridge, sink and microwave.", "helpfulness": 2, "user": "Mugglesnuffin", "date": "February 12, 2007", "id": 6781112}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled with friends", "text": "The decor is run down art deco/LA. But that was not the biggest problem. The Canon building at least is an old, early 20th century apartment building and, as one would expect from such humble beginnings, it had the worst sound proofing of any hotel I've ever stayed at. Period. And I travel A LOT! Every step the man above us took sounded like he was coming through the ceiling, and my dog would bark. Middle of the night, he gets up for a drink of water and my dog starts barking thinking the house is being invaded (she is not a barker, either). Total nightmare.", "title": "1950's Feel with Modern Touch", "helpfulness": 1, "user": "GreenStarfish", "date": "December 5, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 6333885, "likes": {"liked": "— The ambiance", "disliked": "— The smell in my room"}}, {"rating": 3.0, "stay_parameters": "Stayed November 2006, traveled on business", "text": "On the plus side, after complaining the second time in the middle of the night, the staff was courteous enough to ship us to their sister hotel the Chamberlain. And, despite my very unpleasant demeanor (I did not raise my voice, but I was very clear about being upset), the staff was very professional about resolving the problem. They even called the next day to make sure my room at the Chamberlain was acceptable (which it was).", "title": "Average. Too noisy, but kinda cool in a Dean Martin/ Frank Sinatra way", "helpfulness": 1, "user": "KMET", "date": "December 2, 2006", "detail_rating": {"front_desk": 4.0, "service": 4.0, "business": 3.0, "cleanliness": 3.0, "rooms": 2.0, "location": 3.0}, "id": 6318406, "likes": {"liked": "— Too noisy", "disliked": "— Bring ear plugs"}}, {"rating": 3.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "Hotel staff was extremely nice and friendly which made a lot of difference! Lovely pool area with cabanas, and restaurant. The standard queen room is quite small, but clean, some furniture was a little used (tv stand, bathroom stand), but overall not bad. Also there is a valet parking charge of 26$/night.", "title": "Hotel Staff Extremely Nice and Helpful", "helpfulness": 3, "user": "cat_79", "date": "October 9, 2006", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 5932907}, {"rating": 1.0, "stay_parameters": "Stayed September 2006, traveled with friends", "text": "I have never had a bad experience at a hotel before until I stayed at the Avalon. We arrived at our check-in time of 3 p.m. And they took about 10 minutes to finally let me know that the room wasn't ready, and it would be about another half hour. This was okay and they offered to buy us 1 drink each at the bar. After an hour (and only 1 drink while we sat there waiting) I finally got up to see what the deal was.", "title": "Didn't go the extra mile for their guests after their own mess up.", "helpfulness": 6, "user": "chloekennedy", "date": "September 5, 2006", "detail_rating": {"front_desk": 1.0, "business": 2.0, "service": 1.0, "cleanliness": 3.0, "value": 1.0, "location": 3.0, "rooms": 2.0}, "id": 5769745, "likes": {"liked": "— Nothing.", "disliked": "— Everything."}}, {"rating": 4.0, "stay_parameters": "Stayed July 2006", "text": "The kid (he looked younger than me and I'm 21) finally called to check on the room and it was finally ready. He didn't bother to keep us updated during that hour on the condition of the room, or how much longer it would be. We finally made our way up to the room and waited for our belongings to arrive from the bell boy. 15 minutes later we decided to call the front desk to make sure they didn't forget about our stuff - they did. They promised it right away, and 10 minutes later it showed up to our room on the 2nd level.", "title": "Great hotel if you have a pet.", "helpfulness": 7, "user": "Amiee L", "date": "July 20, 2006", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 3.0}, "id": 5488933, "likes": {"liked": "— That they take pets", "disliked": "— On the small side & the bathroom"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2006", "text": "We called for ice a couple of times and the guy who brought it was CREEPY. The room was very small, the bathroom was too close to the bed. We had to keep calling the front desk because the cable connection to our computer wouldn't work, and they kept saying they would call us back with the instructions - they never did. All in all, the hotel was nice looking, but the staff made it ugly. I hated the Avalon and will never stay there again.", "title": "Trendy Treat in Beverly Hills", "helpfulness": 7, "user": "kd11605", "date": "July 7, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 5437569}, {"rating": 5.0, "title": "Stylish Decor and Friendly Staff", "text": "I was a little unsure when I booked this hotel because it's such a hit of miss with the little hotels that look \"trendy\" & since we just got a puppy we did not have much choice in mid-range priced hotels.", "helpfulness": 8, "user": "A TripAdvisor user", "date": "June 15, 2006", "id": 5352008}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled with friends", "text": "Amazing - the place is beautiful, achingly lovely.", "title": "Treated like a star", "user": "Nic S", "date": "June 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 164497437}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled on business", "text": "The pool and surrounds are lush and the rooms are perfect.", "title": "Nice little hotel.", "user": "Lisa P", "date": "June 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 163984491}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled on business", "text": "BUT...the thing that won my heart over all of that beauty were the staff. A HUGE thank you and much love, especially to Amber, but also to Maria & Alessandro who just treated us so well - guys we cannot thank you enough for your kindness and attentive service.", "title": "Good Hotel", "user": "Tygr22", "date": "June 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 163624169}, {"rating": 5.0, "stay_parameters": "Stayed July 2012", "text": "Hope to see you again soon!", "title": "Thoroughly enjoyed our stay", "user": "KSnVC", "date": "June 6, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 163227973}, {"rating": 3.0, "title": "We expected more...", "text": "Nic", "user": "Tim289", "date": "June 1, 2013", "id": 162675678}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "We stayed at the Avalon at the end of June. I had not been back to the hotel since the week it originally opened! It was even better than I remember. The staff was outstanding from the moment we pulled up outside. Amber gave us a gracious and warm welcome at the front desk and really has a knack for making people feel special! She made a point of getting to know us a bit and was a delight to speak with throughout our stay. We even received an upgrade to have a patio during our stay. A real treat!", "title": "Fabulous stay! Looking forward to our return!", "user": "KL_Hedberg", "date": "July 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 167407570}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "The staff of the restaurant were exceptional, as well. Everyone was very attentive and truly cared about our experience. The cocktails are out of this world! I could sit and sip next to the pool all day long. We chose to have breakfast at the pool the following morning and it could not have been better. The Sunday paper, delicious coffee and mimosas coupled with terrific service made our last day in LA a memorable one.", "title": "Cool home away from home", "user": "babielo", "date": "July 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 167196443}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "I'm not sure what took me so long to come back, but I can assure you it won't be that long again. I think we've found our regular spot for future visits! Kudos to Amber and the entire staff! We look forward to our return.", "title": "Great Customer Service!", "user": "mbw009", "date": "July 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 166832694}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled on business", "text": "I stayed at Avalon this past weekend, for 3 nights in a Jr. Suite. At first we couldn't find the hotel from the address stated on our GPS, because there are no clear signs or lights to direct us. From the outside, the hotel does look a bit worn, but stepping inside... everything is modern, nice, and retro. I loved the color scheme of the hotel, our room.. white, grey and turquoise decor. Loved the room, very homey and didn't feel like a stuffy steril hotel. The $31 a day valet was a bit steep but the hotel staff was very accommodating bringing the car around anytime of the day or night. Wonderful service, great members of the staff, very accommodating. I feel valued at the hotel because they learned my name. Had a great time with the Viceroy brand.", "title": "A home away from home.", "user": "Steve E", "date": "July 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 166314153}, {"rating": 5.0, "stay_parameters": "Stayed June 2013", "text": "I stayed here for one night on business and booked it last minute so I didn't have time to research in advance. I was really blown away by the front desk staff that were down to earth, gracious and happy. So often you see front desk people who seem barely alive. I did not book direct as I used HotelTonight so I was concerned I might get a tiny room. They treated me like a VIP guest and actually gave me a couple of options between the two different buildings and went through the pros and cons of each. I choose the quieter building with the larger room. The front desk guy (cant remember his name but he was from CT) actually walked me to the room while telling me about the hotel. Again, great service. Its a converted apartment building but its very hip and cool without being pretentious. I didn't have a view; however, the room was very spacious and the bed comfortable. When I came down in the evening I was called by name and asked if I needed any help for restaurant ideas or directions. Just very nice to be recognized. I highly recommend this for a business or leisure trip for adults. Probably not great very young kids but older kids might like it. Also, the restaurant by the pool was excellent. Try the Kale Caesar salad if still on the menu.", "title": "Serene mid century perfection!", "helpfulness": 1, "user": "Gmabitt9", "date": "June 29, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 165691904}], "location": {"country": "United States", "city": "Beverly Hills"}, "stars": 4, "variance": {"poor": 30, "average": 57, "very good": 131, "terrible": 28, "excellent": 188}, "aka": "Avalon Beverly Hills", "slim_ranking": 0.642857142857, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.0, "rooms": 4.0, "location": 4.5}, "description": "Distinguished by its novel physical space, this Beverly Hills California luxury hotel is set around a dramatic pool terrace with private cabanas and the chic Oliverio restaurant- all just steps from shopping at the finest boutiques, galleries and restaurants nearby.Avalon Hotel Beverly Hills offers luxurious amenities, stylish accommodations, and creative meeting and event space in the heart of Beverly Hills, California.Inspired by the relaxed \"patio lifestyle\" of mid-20th Century Southern California, Avalon's 83 Beverly Hills hotel rooms, suites and penthouse studios offer guests comfort and style in the heart of Beverly Hills.Custom-designed and classic furnishings by Kelly Wearstler. Pampering Beverly Hills accommodations include custom furnishings and beds with sumptuous Italian designer lines and Neil George amenities."}