{"user_rating": 4.5, "review_count": 1115, "name": "Avanti Hotel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed June 2012", "text": "Stayed to attend a wedding, not in this hotel, lovely hotel, food excellent, hotel is pegged at a 4star, it is more like a 3star, there are much more luxurious hotels that are 4star but also triple the cost! This is a great value hotel, also have the use of the avanti village facilities, we stayed half board, which I would recommend. The avanti village is a self catering village, also of a high standard. Don't stay here for luxury but do stay for value.", "title": "Good value, friendly, clean hotel", "user": "SussexSmiths", "date": "June 18, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 132228605}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "My only moan would be that the beds are hard! But I did hear that they are gradually renewing them.", "title": "Would stay here again", "user": "LeaLea80", "date": "June 18, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 132220447}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "Myself and my partner stayed at the Avanti for a week 3-10 June 2012. We were in Cyprus for a friends wedding so only booked B&B due to everyone staying in different hotels. On our arrival we were allocated a room on the reception side of the hotel (room 3080) which didn't have much of a view and debated on requesting a pool view the following day. Our mind was made up the following morning, the sun was shining directly on the room and I couldn't open the doors as the metal was so hot. We went to reception and were offered a room which had a pool/sea view room (4004) for a few Euros extra per night which we were pleased with and switched rooms after 12noon that day. The bed in the first room was rock hard but our next room was a little more comfortable. The rest of the hotel was absolutely faultless, clean, the staff were pleasant. The rooms are a little dated but that's not a problem as long as everything is clean and tidy. I cannot pass comment on the food other than breakfast. There was plenty to choose from and I only ate breakfast three out of the seven days through personal choice rather than the food itself. The pool area is very clean and tidy and the pool was immaculate. Drinks prices are reasonable and there is a seclection of foods available although we didn't eat there, the salad bar looked good. The only down side to the pool area is they could do with more sun beds. We quite often had to lie on our towels on the grass because all of the loungers were taken or a lot of the time selfish guests who left their towels on loungers whilst they disappeared elsewhere for a few hours, but I suppose you get that anywhere and is not a black mark on the hotel. The location of the hotel is brilliant, there are plenty of restaurants and bars in the area and it is quiet at night. If you are looking for something more lively at night it is just a 20minute stroll down to the harbour where you have even more choice and there is Bar Street for the party animals with lots of lively bars and clubs to choose from. The beach is just a 5 minute stroll away with a lovely beach bar and water sports just down the side of the hotel opposite which we used as a meeting point with the rest of our party. I would definitely stay at the Avanti again if I visit Paphos in the future.", "title": "An Excellent Wedding Experience", "user": "Rosemary G", "date": "June 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 132090269}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "This was the 2nd time we have visited this hotel, the 1st being September 2011. Such was our experience then, that when our son suggested he wanted to get married abroad, my husband and I were delighted to recall all the excellent facilities the Avanti Hotel has to offer namely:- friendly/helpful staff, high quality and excellent value for money breakfast and evening meals, the beautiful gardens and pool areas and the cleaniless of the WHOLE hotel, both inside and out. The wedding ceremony was superb, professionally organised and nothing was too much trouble. We have some amazing photographs will stunning backdrops of beautiful gardens/foliage/mini waterfall complete with bridge/stone steps etc. We have heard of friends booking weddings abroad where the hotel promote their venue with an enticing private beach. However, bear in mind, the private beach is for the numerous holidaymakers and not exclusively for the wedding party.Thus, they have been disappointed with the photographs because they have relatively few that haven't got parasols/sunbeds/bystanders on them. If you book this hotel for your 'wedding', you will not be disappointed. The designated area for the gazebo and chairs, the registrar table complete with floral arrangement, the stand displaying the cake and champagne, set the scene for what was a truly amazing day. All the staff are worthy of a mention but Liza was excellent. She frequently asked if she could assist in anyway and if she did, the process was handled expertly. The whole of the staff where happy to participate in the excitement of the day and on the 'hen night', the hotel porter (sorry didn't catch his name) came to our rescue with a mini phillips screwdrive - he didn't have to go out of his way, but the point is - he did!", "title": "would go again", "helpfulness": 2, "user": "avril m", "date": "June 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 132078080}, {"rating": 5.0, "stay_parameters": "Stayed June 2012", "text": "Just spent a week at the Avanti Hotel in Cyprus on half board. We have been to Cyprus several times, but not stayed here before. The hotel was brilliant. We wern't sure about going half board as we like to go out at night to different eating places. We need not have worried, each night had a different theme and if you didn't like 'foreign food' there was always 2 roast, fresh veg and potatoes. We did decide to eat out one night and went to somewhere we had been several times in previous years, but there was no comparison. the Avanti won hands down. The only small niggle we would have is children in the dining room. The Avanti village is close by and guests can use the hotel restaurant for evening meals. One night we counted 14 buggies outside the dining room. Our suggestion would be for an area of the dining room to be set aside for families, perhaps the raised areas. Families could then enjoy their evenings together and adults theirs without children running about The avanti is not far from the harbour and an easy walk. You can also catch the local bus which has a very good service. Paphos,has really improved over the years.We first went in 1992 and lot of money's been spent on it over the years.", "title": "Superb!", "helpfulness": 1, "user": "Mcnab43", "date": "June 15, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 132052620}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "Everybody, from the room service till the reception staff was so friendly, helpfully. The \"Avanti\" hotel is a \"family\" hotel: Each child is being treated like a princess/prince. In the restaurant there is even a children's buffet. Indoor and outdoor swimming pool for children.", "title": "Lodging in the \"Avanti\"", "helpfulness": 3, "user": "Martial D", "date": "June 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 131964798}, {"rating": 4.0, "stay_parameters": "Stayed June 2012", "text": "Within walking distance of the beach, beautiful large pool, park with plenty of sun beds. A hotel where everyone feels at home.", "title": "Excellent", "helpfulness": 2, "user": "gunnebo", "date": "June 14, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 4.0, "rooms": 5.0}, "id": 131952702}, {"rating": 3.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "Impossible is not in their dictionary.", "title": "Back Yesterday", "user": "SLJ72", "date": "June 14, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 2.0, "rooms": 3.0, "location": 3.0}, "id": 131942483}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "Just returned from Cyprus stayed at avanti hotel. The rooms and public areas were excellent and spotless. The management spoke to us on regular basis to check all was how we wished and enjoying holiday which has never happened before. Plenty of choice in buffet breakfast and was good. only comment needed more bar staff in cocktail hour as this was very popular. would definitely go back.", "title": "Great holiday, fantastic wedding", "user": "Sue G", "date": "June 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 131921371}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "Just returned from the Avanti Hotel which has been lovely, Really clean, nice rooms only downside was the breakfast, some mornings the hot food was cold and the choice wasnt fantastic. The pool was fantastic and always enough sunbeds again downside was entertainment for children my son is 11 and the entertainment team did not encourage any of the kids to get involved they seemed more concerned about the adults. Staff really friendly and always helpful - however I think we were spoilt last year after visting Athena Beach its a different class but overall a really nice holiday", "title": "here now", "helpfulness": 1, "user": "Mustrum", "date": "June 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 131827973}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "Spent a week at this hotel and i really loved it.", "title": "Lovely Hotel", "helpfulness": 1, "user": "wendywuredhill", "date": "June 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 131820129}, {"rating": 5.0, "stay_parameters": "Stayed June 2012", "text": "Lovely large room with sea views. Water left in the fridge and coffee and tea in the room.", "title": "Great Stay - Great Wedding", "user": "xlolz", "date": "June 12, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 3.0, "service": 5.0, "rooms": 4.0}, "id": 131800845}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "The lounge is a great place to relax in the evening.", "title": "Wonderful Hotel!", "helpfulness": 1, "user": "Young75", "date": "June 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 131738063}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "The staff were so friendly.", "title": "DEFINITE MUST!", "helpfulness": 2, "user": "JANJIM", "date": "June 11, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 3.0}, "id": 131726732}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "Loved the breakfast, plently of choice and a lady making crepes to order.", "title": "first family holiday in europe", "helpfulness": 3, "user": "julie g", "date": "June 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 131720593}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "We returned to the Avanti this year from 13th to 30th May for our second visit. Konstantin met us off the coach, and remembered us from last year. We were allocated a room in the area we had asked for and a complimentary basket of fruit and a bottle of wine in the room added to our welcome.", "title": "Happy Return", "helpfulness": 2, "user": "surfer0608", "date": "June 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 131542290}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "As last year, all the staff were very friendly. The food was good, the accommodation bright and clean, the pool area excellent, and overall we were very pleased with the hotel and holiday.", "title": "Great Hotel!!!", "helpfulness": 2, "user": "Sanne A", "date": "June 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 131536671}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "We find the hotel location, whilst not on the sea front, is very convenient for the bus, and for walks into Paphos and along the sea front.", "title": "DenGlenWales", "helpfulness": 3, "user": "DennisHarris186459", "date": "June 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 131486606}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "New for this year was a very enthusiastic entertainment team.", "title": "Perfect, Relaxing Holiday", "helpfulness": 2, "user": "Caroline E", "date": "June 7, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 131483456}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with friends", "text": "We certainly hope to return again.", "title": "Stayed before, been again, would happily return!", "user": "Richie S", "date": "June 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 131470533}], "location": {"country": "Cyprus", "continent": "Europe", "city": "Paphos"}, "stars": 4, "variance": {"poor": 26, "average": 91, "very good": 266, "terrible": 15, "excellent": 717}, "aka": "Avanti Hotel Paphos", "slim_ranking": 0.136842105263, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "The Avanti Hotel is an outstanding four star establishment with five star facilities, situated in a prime position in the heart of the popular Cyprus coastal resort of Pafos. The hotel's modern architecture and luxurious interior decoration are designed to attract discerning holidaymakers in search of that something that makes a good holiday great. The hotel is set in over 40.000 square metres of landscaped gardens, and situated just 250 metres away from the beach. A family owned and run hotel which offers you the very heart of Pafos!"}