{"user_rating": 4.5, "review_count": 3706, "name": "Aventura Spa Palace", "reviews": [{"rating": 1.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "This Resort was terrible from check-in. I booked a King Suite at this resort and when I arrived was put in a Double Room. I said that I was confirmed in a King and they told me it was based on availability. No where in my documents does it say based on availability. I double checked! The resort did not care if I stayed or left, they simply said \"it was up to me on if I wanted to stay or go\" Of course we pre-paid so they really didn't care. My husband is 6'3\" and doesn't fit on a double and they just didn't care at all. I would have booked somewhere else if there was even the slightest possibility that we would not have a king bed. Then when we went to one of the restaurants and asked for a particular table by the window we were told \"that wasn't for us\" it was reserved for honeymooners, no other option was given and the table was never used while we ate. Again, the resort doesn't care because you are locked into their eateries so if we left we would just have to go to another of their restaurants. We also requested a different liquor than what was in our room and were told that those bottles were not available to us despite them being offered in the bars all over the property. Room service was not able to bring any alcohol drinks with food either. Our room service dishes (which we were specifically told to put in the hall) sat in the hall for up to 24 hours during our stay. Every time we asked for something that was readily available at other resorts we have stayed in in the area, we were told no and given no other options. Also, our shower was not clean when we arrived. There was a gob of hair backed up over the shower drain, it was quite disgusting. The in room safes are also not digital and require a key that obviously then you must keep track of and carry around wherever you go. The hammock was quite disgusting because if it gets wet at all the blue from the hammock gets all over your clothing and stains. Despite the fact that the website of this resort states that the restaurants require no reservations, apparently if you are a \"premier\" guest you can make a reservation and cut the line at any restaurant. We were never told of \"premier\" status nor offered anything of this kind. The property also has several different colors of bracelets to designate what type of guest you are. Apparently we got the crap color because that is how we were treated!!!", "title": "Horrible \"Resort\" stay", "helpfulness": 5, "user": "MDCSTravel", "date": "February 19, 2008", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "location": 3.0}, "id": 13679991, "likes": {"liked": "— The scenery", "disliked": "— Everything except the scenery"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "What an incredible experience we had during our stay at", "title": "Incredible Resort", "helpfulness": 18, "user": "carrera1", "date": "February 19, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 3.0, "rooms": 4.0}, "id": 13675872, "likes": {"liked": "— Incredible service and the food", "disliked": "— Nothing negative to say"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "Aventura Spa resort the week of 2/9/08 - 2/16/08. We had", "title": "Twice is Nice", "helpfulness": 4, "user": "krisencalade", "date": "February 18, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 2.0, "rooms": 5.0}, "id": 13659835, "likes": {"liked": "— The food and staff", "disliked": "— Distanc efrom Airport"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "read so many reviews about this resort prior to our trip and", "title": "Good time, older crowd", "helpfulness": 14, "user": "tdroiwn", "date": "February 18, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 3.0, "rooms": 5.0}, "id": 13656422, "likes": {"liked": "— Cleanliness of the whole facility", "disliked": "— How far away from everything it was"}}, {"rating": 3.0, "title": "Time share at the Spa?", "text": "believe me there is absolutely nothing negative to report on", "helpfulness": 14, "user": "jakester1955", "date": "February 17, 2008", "id": 13619060}, {"rating": 1.0, "stay_parameters": "Stayed February 2008, traveled with friends", "text": "We got booted over to Aventura Spa Palace after the Royal at Playa Del Carmen overbooked us at their hotel. We stayed one night before being tranferred back to The Royal. In comparison, the Royal is much nicer. Aventura does not have a beach. It is situated on a coral reef and it is not safe to swim in the ocean at this resort. They have a little lagoon you could swim around in, but it's not the same as being on the beach. They do have sand spread around, but again, not the same. We went to go have dinner at the Italian restaurant (can't remember the name) and when we got there, they said it would be an hour wait and gave us a buzzer. An hour later, we went back because they still hadn't called us and there were 3 or 4 other couples in the same situation. We were all irritated because there were plenty of empty tables available and no one had buzzed us. On top of that my food was lousy - fettucine alfredo - pasta was all stuck together and impossible to eat. The resort is too big and you have to walk forever to get anywhere. The rooms are teeny-tiny. The toilet had a running problem. You couldn't see the TV from the in-room jacuzzi. The beds were hard. It is in the middle of nowhere. The poolside bar/food area is chaotic. The only good thing I have to say is that the front-desk staff were very nice and helpful and the landscaping was lovely.", "title": "Not as nice as the Royal at Playa Del Carmen", "helpfulness": 5, "user": "austintexassenorita", "date": "March 1, 2008", "detail_rating": {"cleanliness": 2.0, "front_desk": 5.0, "location": 1.0, "value": 1.0, "rooms": 2.0}, "id": 13951881, "likes": {"liked": "— landscaping", "disliked": "— everything else"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "Just returned back from ASP and I have mixed emotions. First I need to say my parents are Palace Premiere members and we stayed in the Presidential Suite. I will try my best to add my 2 cents, that I have not read on here. Ok, here I go:", "title": "Beautiful resort, relaxing, service needs work!", "helpfulness": 9, "user": "work_is_overrated", "date": "February 28, 2008", "detail_rating": {"front_desk": 5.0, "service": 2.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 13913503, "likes": {"liked": "— Exercise facilities, NO KIDS!", "disliked": "— Service, no bang for your buck in presidential suites"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled with friends", "text": "1) Shuttle from airport-Make sure you are ready to be pushy. Chavas Travel is now Elite travel. This changed in January, so they are working out the bugs. When you leave the airport go to the right and look for stall number 12. This is where Elite (red shirts) should be located. You will need to get your return shuttle voucher at the time you are taken to the resort. This seems to be the hold up and too few staff helping. Be ready to wait, and be pushy.", "title": "Wow!!!!!!!", "helpfulness": 15, "user": "JuleneMichigan", "date": "February 27, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 13886505, "likes": {"liked": "— Everything!!!", "disliked": "— That the trip didn't last longer!"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "2) Presidential Suite-The long and short is that at presidential prices, you don't get presidential service. Kitchenette didn't have plates, bowls, silverware. If you have a dining room table, give us the goods! You can make reservations for the restaurants, but only at 6 and 8pm. When I ordered room service, it was cold (more on this later), we had a microwave so no big deal for me. They need staff catering to the presidential suites. If you pay the extra money, you have higher expectations. The day we were leaving, I put the card out for morning room service. They never came and grabbed the card. Not a good way to finish the trip. View was amazing!", "title": "Loved the Spa Palace", "helpfulness": 5, "user": "AnkenyCyclone", "date": "February 26, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 13867871, "likes": {"liked": "— Great views from the room. Feeding the iguanas", "disliked": "— Small business center"}}, {"rating": 2.0, "title": "Good, but not great", "text": "3) Food-I agree with the people that say it is buffet style food. After going on the kitchen tour, I understand why. All food is cooked downstairs in one kitchen. The waiter/waitress need to go downstairs and get food and bring it back to the restaurant. Plus, just think of the quantity of people. The staff works extremely hard! But, they are completely understaffed!! My Italian food was good at La Trattoria. La Hacienda had very good braised lamb. They present the food nice, but quality compared to what I am used to lacks.", "helpfulness": 1, "user": "Swishbaby", "date": "February 26, 2008", "id": 13862068}, {"rating": 4.0, "stay_parameters": "Stayed February 2008, traveled with friends", "text": "Let me start off by saying that if you are the type of traveler that likes to just lay out by the pool and sip great drinks at a spectacular all-inclusive resort, the Aventura Spa Palace does not disappoint.", "title": "Aventura Spa Palace + Playa del Carmen = Great Vacation!", "helpfulness": 11, "user": "shakenjake75", "date": "February 26, 2008", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 4.0}, "id": 13861601, "likes": {"liked": "— Pool, lagoon, and rooms", "disliked": "— Nightly entertainment"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "ROOMS", "title": "Aventura Spa is great romantic getaway", "helpfulness": 2, "user": "wloofire", "date": "February 25, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 13844009, "likes": {"liked": "— Everything was first class", "disliked": "— room maid service"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "Our rooms were very clean and the maids did a great job of making sure we had clean towels for both the hot tub and shower every day. I would say that the rooms are above average for a resort room. The hammock and hot tub are great amenities that we used just about every day. And of course, there are the refrigerator filled with waters, sodas, and beers and the liquor dispenser stocked with rum, vodka, tequila, and scotch. I don't particularly like scotch, so I called down to Guest Services and asked if I could get a bottle of Jack Daniel's instead. The next day, I had a fifth of Jack Daniel's in my room. It was great!", "title": "nice stay at ASP", "helpfulness": 3, "user": "ldg4283", "date": "February 23, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 13796167, "likes": {"liked": "— staff, location, pools"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled with friends", "text": "GROUNDS & POOLS", "title": "Adventure at Aventura Spa Resort", "helpfulness": 13, "user": "Ellen57", "date": "February 19, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 13691488, "likes": {"liked": "— The great food, drinks and service.", "disliked": "— No beach"}}, {"rating": 5.0, "title": "ASP A Little Piece of Heaven", "text": "The property and pools are immaculate, constantly tended to by the grounds & maintenance staff. The grounds on the north end of the resort are a lot prettier than those on the south end. But the south pool is the place to be if you want to do more than just lay out. There are play crazy games, volleyball, and a more upbeat crowd on the south end. And the south pool is much bigger than the north pool. There are also plenty of sun chairs, but get there early to get a prime location because those fill up quick.", "helpfulness": 11, "user": "Crystal6384", "date": "February 19, 2008", "id": 13682237}, {"rating": 4.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "My girlfriend and I just got back from a week at the ASP (October 25 -- November 1). Overall, we had a great time and would likely go back, that said there are some areas where the ASP could improve.", "title": "Good Time But Could Be Better", "helpfulness": 8, "user": "mcsquired", "date": "November 3, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 4.0}, "id": 21505426, "likes": {"liked": "— The fantastic service, great rooms!", "disliked": "— Some of the dinner restaurants were just okay."}}, {"rating": 4.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "A little background first. My girlfriend and I are both professionals. We appreciate great food, upscale hotels, amneties, etc. We're willing to spend money to have a great vacation. We were both interested in doing an all inclusive vacation at a luxury resort (having never done one before). We did a lot of research and narrowed it down to one of the Secrets Resorts (Maroma Beach) or ASP. We opted for ASP because it seemed Secrets Maroma Beach was still getting its act together.", "title": "very,very good but not totally as we expected", "helpfulness": 1, "user": "pebblesa", "date": "November 2, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 3.0, "cleanliness": 5.0, "value": 4.0, "location": 3.0, "rooms": 5.0}, "id": 21480445, "likes": {"liked": "— cleanliness and service", "disliked": "— needs one pool to be noise and games free"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "We arrived on Saturday at Cancun Aiport. First, I was surprised by the airport itself. It's a very nice facility and not what I was suspecting. After waiting in am immigration line for about 25 minutes and then wading through the hordes of time share salesman outside of baggage claim (watch these guys) we got our hotel shuttle (local transportation was through Best Day -- great outfit). First word of warning, the trip to ASP from Cancun is about an hour and half or more depending on the number of stops. That distance becomes especially inconvenient on the way back, especially if you have an early morning flight (we had a 6AM flight back which means we had to leave ASP at 2AM!!!!). (TIP -- Avoid early morning flights home unless you want to get up real, real early). Also, just a note on the weather. Late October into November and December begins the \"rainy season\" in Mexico. While we never had a complete wash-out of a day, it was often cloudy for period of time.", "title": "The best holiday ever", "helpfulness": 3, "user": "mrsmower", "date": "October 29, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 21381462, "likes": {"liked": "— Everything", "disliked": "— Nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "ARRIVAL. We arrived at ASP and check-in was a breeze. Beautiful lobby (they have 2) and we were served champagne (much needed at that point). Many reviews deal with the size and layout of ASP. Suffice it to say it's big. Our room was located half way between the North and South side of the hotel. As discussed in other reviews, the South side is the more lively side in terms of pool and other activities, while the North side (where the spa is located) is a bit more sedate. Restaurants are evenly divided between North and South (with at least one in the middle) so halfway in between turned out to be great because we could easily walk to either side depending on what kind of mood we were in. (TIP -- Unless you want to role out of your room into one of the pools, being located somewhere in the middle of the resort is a good way to go).", "title": "Great resort", "helpfulness": 4, "user": "KJC03", "date": "October 28, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 3.0}, "id": 21333917, "likes": {"liked": "— The room.", "disliked": "— No real beach."}}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "ROOMS. We were generally impressed with our room. King sized bed dominates one half of the room, the in room jacuzzi the other half. Not a lot of space to sit or otherwise hang out apart from the porch. Apart from sleeping and, ummm \"sleeping\" we weren't in the room that much. By the way, the website suggests that their beds are along the lines of Westin's \"heavenly beds.\" Not so (at least in our room). Fairly firm mattress with okay linens -- nothing fancy however. I loved the fact that the minifridge was always stocked with water, beer, soda, etc. There was also a wall cabinet that had four bottles of pretty good liquor (Smirnoff vodka, Bacardi Rum, Jose Cuervo tequilla and some off brand single malt Scoth) for making drinks in the room. (TIP -- Minibar is restocked daily but they're always on call). Based on other reviews, we tipped the maid a couple of buck each day (TIP -- bring LOTS of singles with you) and as a result we were constantly resupplied with bath products. When we arrived they were using all Biosilk products (which impressed my girlfriend but meant little to me) but towards the end of the trip they seemed to have switched to a \"Palace\" brand (at least for some of the products). Nonetheless, by that point we had amassed a small suit case worth of stuff that will take us a lifetime to use. We hung out on the patio a couple of times and the hammocks are great. Our view was okay (we could see the water if we stretched). If having a great view is a big deal, I'd suggest nailing that down at check-in, otherwise my impression is that it can be a hassle to move later on (especially if it's busy). (TIP-- Ask a check-in about your view and room upgrades). We noticed that some of the wings had some signs of wear and tear. For example, outside our room there was a hole in the hall ceiling and what looked to be water damage. Again, not a huge deal and overall the resort seemed to be in great shape.", "title": "The Perfect Place for our Honeymoon", "helpfulness": 2, "user": "salex19", "date": "October 26, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 21251177, "likes": {"liked": "— Service", "disliked": "— Food"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "My wife and I stayed as “referred guests” of Palace Members Nov. 4-11 at Aventura Spa Palace (ASP). Through Trip Advisor, I received a message from a Palace Member regarding a guest referral program with Palace Resorts. I was a bit skeptical and scared about booking this way, but the more I learned about it the more comfortable I became with the arrangement. I decided to do it this way after I learned it was safe, and it was cheaper than booking online. I just want to say a quick “thank you” to this particular Palace Member as she was so nice, helpful, and informative. She really helped us plan our vacation time at ASP. As I see it, Palace Resorts cannot do enough for their Members and need to provide them with more perks as they are an invaluable asset to Palace Resorts. Anyway, nuff said, back to the review. Due to major incompetence at Delta airlines we arrived 9 hours later than we should have. However, ASP offers free transportation to Members or their “referred guests” via Elite transportation. We were able to inform Elite about our delay and therefore we had transportation from the airport when we walked out of the airport around 11:00 p.m. It took about an hour to get to ASP from the airport. When we arrived, we were offered a flower and champagne which was nice. My wife took the flower but we declined the champagne being that we were very tired from our airline fiasco.", "title": "Nice resort!", "helpfulness": 3, "user": "bmemphis", "date": "November 15, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 21886382, "likes": {"liked": "— The service and the spa", "disliked": "— The sales presentation"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "To begin, the employees at ASP are incredible. They work tirelessly to make sure you have everything you want. Most of the staff knows enough English to understand your preferences regarding food and beverages. They are constantly keeping the grounds, pools, and facilities clean. They clean your room and do turn-down service. If they have time, they will talk to you but they usually are very busy. We had one waiter who showed us a few bar tricks with toothpicks and forks. It was fun! They are all smiles and friendly even when you can see how tired they are after a long day of work. I would return to ASP just because of the service I received from the staff.", "title": "Can't wait to go back!!!", "helpfulness": 4, "user": "Mrsk8r", "date": "November 8, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 21652125, "likes": {"liked": "— The unlimited food and drinks!", "disliked": "— I loved everything"}}, {"rating": 2.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "The spa facilities are very nice. I recommend that you use the hydrotherapy room to relax a bit even if you don’t get a massage. My wife and I had two different massages on different days and they were phenomenal. I really enjoyed the Spa at ASP.", "title": "Not A 5 Star Hotel", "user": "manuelito99", "date": "November 8, 2008", "detail_rating": {"front_desk": 1.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 2.0, "location": 3.0, "rooms": 3.0}, "id": 21647004}, {"rating": 4.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "ASP is huge but well-maintained. Parts of ASP landscaping and lobby areas are simply gorgeous. Our room had a partial ocean view. Our room location was not the best but good. We were placed on the third floor of the Accordion Building, south side. It was quiet in this area except for the screeching birds in the morning. The two-person Jacuzzi is great. The flat screen TV is nice (could use a few more channels). The furniture in our room looked a bit worn. They need to replace the showerhead in our room for more water pressure. Our shower had hot water which was good. They do need to re-grout the walk-in shower. I talked to ASP mgmt and they told me they are in the process of updating a majority of their rooms. If I could pick buildings, I would do Accordion Building, north side; or French Horn building, south side. As a reminder, ASP does not have a beach. So if you crave a beach, you will need to go somewhere else.", "title": "Not a Perfect 10 but still a great resort!", "helpfulness": 2, "user": "DenverMusiclovers", "date": "November 6, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 3.0}, "id": 21580248, "likes": {"liked": "— Pools and Spa, All Inclusive", "disliked": "— Corporate groups and room location"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled with friends", "text": "The food for the most part ranked an 8 out of 10. It was really good but not the best you’ll ever have. The reason I don’t give it a 10 is because we had 10 ranked food at Excellence Riviera Cancun last year. Regarding the food at ASP, we loved the breakfast buffets. They had made-to-order omelets, waffles pancakes, and French toast. They also served fresh fruits (though no berries, i.e., strawberries, blueberries). They also served cereals, oatmeal, breads, pastries, and many different hot breakfast dishes. Lunch buffets also had a wide variety of things to choose from and included a nice salad bar. Waiters will bring you any kind of drink you want from the bar and as many refills as you want. We are not avid drinkers so I would have liked to have seen more alcoholic-drink menus around the resort to help us pick a drink. We usually ordered drinks by pointing at our neighbor's drink and saying, “That looks good, I’ll try that.” If you don't want to bother with the lunch buffet, you can get snack-type foods like hamburgers, nachos, and pizza at the pool bars.", "title": "Wonderful resort!!! A+++++++", "helpfulness": 3, "user": "lovethebeach07", "date": "November 5, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 21564647, "likes": {"liked": "— The staff, the pools", "disliked": "— the nail salon"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "Summary of our stay at the Aventura Spa Palace from November 14-21 (booked through RCI) for relaxation and our 1st anniversary. Many of the past reviews have included all you need to know (and more) about the resort. Overall, we had a great trip and enjoyed the resort especially the current “Adults Only” status.", "title": "7 days of Paradise....Sigh!", "helpfulness": 8, "user": "Daphne418", "date": "November 30, 2008", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "location": 4.0}, "id": 22326291, "likes": {"liked": "— Customer Service, NO KIDS!, Mexican dishes", "disliked": "— 80s decor, poor lighting and footing for walkways"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "Room: At check in we requested a quiet room with a good view, which ended up being in the Tuba Building, 3rd floor, far North side. We could sort of see and hear the ocean (depending on the wind) from our balcony. A great room location compared other buildings on the resort. We did not find this resort as large as the other resort we stayed at last year (See my Grand Mayan review) and did not think it was a long walk to the South side. The maid service was average. Tipping didn’t improve level of cleaning or service. There was some noise from the rooms next door and hallway with the hard stone floors but nothing that was annoying or woke us up. Tips: Place card on room for daily linen service. Tip the minibar guy – he responded well. Ask for 3rd floor room. Do NOT leave your food or beverages in the room, put out in the hallway. (Ants) Be careful in the shower! There is no shower mat inside and it gets slick and I fell hard.", "title": "Aventura Spa Palace – Excellent Service", "helpfulness": 6, "user": "liveyourlifebefree", "date": "November 30, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 4.0}, "id": 22307086, "likes": {"liked": "— Excellent staff", "disliked": "— Nothing really significant to mention"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2008", "text": "Restaurants: Our favorite was El Greco for quality of food and service. We had most of our breakfast and lunch and 2 dinners there. Compared to the other restaurants, we thought it was the best. We only tipped for truly extra good service. The food was not overly impressive but All Inclusive are not known for their 5 star restaurants. However any of the Mexican dishes were delicious. My husband wants me to point out he thought all his meals were good or great. My hubby brought a pair of khaki pants and leather sandals and had no issues with the dress code. In fact, we saw men in shorts, flip-flops etc. so we were not sure how strict they were on the dress code at the “Le/La” restaurants. Tip: Ask for the upgraded alcohol brands and try the Mayan coffee!", "title": "Wedding and Vacation!", "helpfulness": 3, "user": "nathanandmallori", "date": "November 23, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 22114906}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "Tours/Rental Car/Airport Transport: We ended doing none of the tours since we had been to the area before. We did rent a through the Avis car rental desk at ASP. There were only a few cars and a Jeep available to choose from. We ended up with a Dodge Attitude for $150 for 2 days. The car was tiny and beat up, but we made it to and back from Coba and Tulum just fine. You can get a MUCH better deal at the airport for a week rental. There was plenty of free parking at the resort. Don’t be afraid to drive in this area, it’s very easy to get around and if you can drive in any large US/European cities, you’ll be more than fine. Airport transport was included with our stay through Elite. We had no issues finding them when we arrived and a direct trip to the resort. The trip back to the airport included a stop which seemed to make the trip back even longer. In any case, it is a long drive to/from airport when staying south of Playa del Carmen. Tip: Take a taxi to airport otherwise you’ll be leaving 4+ hours before your flight departs. A few extra hours in paradise is worth the $.", "title": "Great Experience at the ASP", "helpfulness": 3, "user": "altivoid", "date": "November 21, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 4.0}, "id": 22065206, "likes": {"liked": "— Location, cleanliness,", "disliked": "— under construction due to hurricane"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "Pools/Snorkeling: Our favorite daily lounging spot was the Current Pool (North side). We were seeking peace and quiet and the sun. There was a small bar right there at the pool, easy access for drinks, good sun and shade spots and a nice little pool to cool off in. Very quite area as the senior citizens like to hang out here and do their walking in the pool and also were quiet and courteous neighbors. I wasn’t overly impressed with the pools compared to the Grand Mayan but they were nice. My husband tried snorkeling in the lagoon but didn’t find it very entertaining. We did an amazing snorkeling trip last year out of Puerto Morales. The lagoon is a good place try out your snorkeling gear if it’s your first time…then do a snorkeling trip! Tips: Get/exchange your towels the night before for the next day. There are bathrooms near each of the pools…but sort of hidden away. Pack a shirt for your hubby (or yourself) and send him(you) to the buffet to get “To Go” lunches. Tip bartender well first drink – he’ll remember you the next trip up.", "title": "Excellent customer service; money well spent", "helpfulness": 1, "user": "cruisefanatic01", "date": "November 20, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 3.0, "cleanliness": 5.0, "value": 5.0, "location": 3.0, "rooms": 5.0}, "id": 22047509, "likes": {"liked": "— The great customer service", "disliked": "— There were things stolen from my room"}}, {"rating": 3.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "A little disappointed. The room was small and dated, with dark wood, a tiny safe and old white tile, with plenty of silicone repairs, in the bathroom. Our room was far from any staircase, so getting downstairs was always a hassle, keep that in mind when requesting a room. However, it was spotless and the turn down service (2X a day) was exceptional. We loved the tropical birds outside our room every morning, and the daily breakfast room service made us feel so pampered.", "title": "Nice - But Some Problems", "helpfulness": 5, "user": "ChampagnePrincess", "date": "March 7, 2008", "detail_rating": {"cleanliness": 5.0, "front_desk": 5.0, "location": 2.0, "service": 5.0, "rooms": 2.0}, "id": 14127575, "likes": {"liked": "— the staff", "disliked": "— the food"}}, {"rating": 1.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "The man made beach/lagoon was really nice. Very private, with drink service , palm thatched huts (palapas) and snorkeling/kayak equipment just steps away. The water was always warmer than the pool and the fish were literally at your feet the second you stepped into the lagoon. The water was probably only a foot deep when you step in and gradually gets deeper as you swim out. But you never feel as though you are in deep water, so it's a really comfortable way to snorkel, especially if you've never done it before. Keep in mind, there is no sand in the lagoon, only silt, which is white, so the fish almost appear transparent as they naturally adapt to their environment .) The most anxiety producing daily event was running down to put towels on the shady lounge chairs (6:30 AM was not unusual), both at the pool and the lagoon.", "title": "Bad old rooms, terrible management, nasty Lagoon.", "helpfulness": 5, "user": "SophieDoll", "date": "March 6, 2008", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "location": 1.0}, "id": 14101965, "likes": {"liked": "— Nothing", "disliked": "— Everything"}}, {"rating": 5.0, "title": "A little Piece Of Heaven", "text": "The mixed drinks always seemed watery, no matter how many times I said \"Very little ice, please\" . They also never tasted the way you expected. The Champagne was DuBois, which is a cheap, but somewhat palatable choice, if you just don't know what else to try. The only drink that came close to tasting normal was the Bailey's. I usually drink 7&7's (retro, but tasty). However, there is no such thing as Rye in Mexico. So, if you drink Seagram's, take it from home, or buy it in the duty free shop (at your U.S. airport). If you drink JW Black they will always show you a bottle that has just a shot or two left. Keep in mind, they always have a bottle hidden in the cabinet behind the bar - without fail. Just don't be shy - ask nicely - and you'll learn this trick will work every time.", "helpfulness": 17, "user": "rskeller", "date": "March 4, 2008", "id": 14045980}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "The food - this was the most disappointing aspect of the trip. The specialty restaurants just weren't that good - plain and simple. Especially after waiting over a hour each night for a seat.", "title": "Best Hotel Ever", "helpfulness": 15, "user": "Ariadna_Castan", "date": "March 2, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 13997772, "likes": {"liked": "— I loved everything, from the hotel grounds, to the room, the service, the acommodations, the pool, the foo", "disliked": "— the cost of spa and massages-just too much!"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "We actually preferred the buffets and room service. The pizza was gross and the burgers were so/so. However the guacamole and string fries were great. The grilled fish at lunch was my favorite. Note: My husband and I both suffered intestinal problems on this trip, as did some other couples we spoke to, so bring the Pepto.", "title": "Great honeymoon", "helpfulness": 5, "user": "CtRhino", "date": "March 2, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 13991588, "likes": {"liked": "— service", "disliked": "— Everyone went to sleep pretty early and got up early"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2006, traveled as a couple", "text": "My husband and I spent a week here for our honeymoon....we LOVED it!", "title": "Great Honeymoon!", "helpfulness": 1, "user": "Suz259", "date": "November 19, 2008", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 5.0, "location": 3.0}, "id": 22013723}, {"rating": 4.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "-Slightly far from the airport, but no big deal.", "title": "Relaxing Vacation!", "helpfulness": 2, "user": "rgodreigns", "date": "November 19, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 22011574, "likes": {"liked": "— Room", "disliked": "— Food"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "-Beautiful spa - guests can take advantage of many of the services free of charge (such as steam rooms, showers etc)", "title": "Great honeymoon!......didn't want it to end !!!!!!!", "helpfulness": 2, "user": "hippeechik", "date": "November 19, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 4.0}, "id": 22004834, "likes": {"liked": "— The hammocks and the lush grounds", "disliked": "— Not having an ocean view room"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2008, traveled with family", "text": "-Jacuzzi in the room, with minibar and mini fridge were wonderful. Very luxurious bathrooms in the rooms", "title": "Good but not as good as before", "helpfulness": 6, "user": "Doug4", "date": "November 17, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 3.0, "rooms": 4.0}, "id": 21956594, "likes": {"liked": "— Friendly and helpful staff", "disliked": "— South lobby closed"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled with friends", "text": "- Many gorgeous pools", "title": "90% Perfect!", "helpfulness": 7, "user": "Ladybird50", "date": "November 17, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 3.0, "rooms": 4.0}, "id": 21936594, "likes": {"liked": "— Beautiful grounds, Great Spa, Great Service", "disliked": "— location"}}], "location": {"country": "Mexico", "region": "Yucatan Peninsula"}, "stars": 4, "variance": {"poor": 219, "average": 297, "very good": 861, "terrible": 159, "excellent": 2170}, "aka": "Aventura Hotel Palace", "slim_ranking": 0.625, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.0, "rooms": 4.5, "location": 4.0}, "description": "A blend of relaxation and adventure awaits you at this adults only retreat. Set in the Riviera Maya overlooking the aquamarine Caribbean Sea, enjoy 1,266 luxurious accommodations with double Jacuzzi, balcony (most with hammock), and 24 hr. room service. Among the facilities to highlight is the state-of-the-art spa offering a perfect day of pampering. Guests can also enjoy seven restaurants, several bars, a disco, outdoor/indoor pools, and unlimited tours as part of the all-inclusive package."}