{"user_rating": 4.0, "review_count": 368, "name": "Avenue Hotel Copenhagen", "reviews": [{"rating": 4.0, "title": "fantastic hotel", "text": "my husband and I stayed in this hotel for 4 day while I was attending a conference at the Copenhagen Business School. the hotel is very well decorated, modern, and clean and very well located, although in the center of town. But in the summer and using the Copenhagen card, we used to walk everywhere or use the very efficient transportation system and it was great. we even found a very good greek restaurant just behind the hotel.", "user": "Padova", "date": "January 6, 2008", "id": 12378057}, {"rating": 4.0, "title": "Very good stay at the Avenue Hotel", "text": "there is in fact a bus that takes you from the airport and the main train station, to just across the street from the hotel and there is one subway stop just 5 min walk from the hotel. our room was clean, spacious, very modern and quiet (we were overlooking the back). the breakfast is also very good, lots of variety of cheeses, bread and cold cuts and you can request also to have eggs. fresh fruit is always available and the personnel is really helpful and nice. we strongly recommend this place, we loved it and if you are ok with not being in the center of things, this hotel is a great deal too.", "user": "Travellers286", "date": "November 4, 2007", "id": 10579442}, {"rating": 4.0, "title": "Wonderful Hotel, just a little too far from city centre by foot", "text": "We stayed at the Avenue Hotel for two nights in August 2007, having booked on the basis of Tripadvisor reviews.", "user": "yoda-leia-akbar", "date": "October 30, 2007", "id": 10457150}, {"rating": 5.0, "title": "Good value and good location", "text": "We were very happy with all aspects of our stay at the Avenue. Our room faced the rear of the hotel, and was of a good size for a European hotel. The decor was modern, the bed was extremely comfortable, and we could not fault the quality of the housekeeping.", "user": "jrjlondon", "date": "October 18, 2007", "id": 10109196}, {"rating": 3.0, "title": "Okay/Good", "text": "The included breakfast buffet was excellent, and we enjoyed the ambience of the bar for a pre-dinner drink. There are a number of good restaurants within a few minutes walk of the hotel for evening meals, and there are also a couple of convenience stores nearby in the event you don't want to eat out.", "user": "AtlantaMember", "date": "October 8, 2007", "id": 10055202}, {"rating": 5.0, "title": "Wonderful surprise", "text": "We had a lovely stay at the Avenue Hotel. I will list the positives first: large room, large bathroom, nice LCD tv mounted on the wall, free WIFI internet and breakfast.", "user": "beekay458", "date": "June 25, 2008", "id": 17216665}, {"rating": 2.0, "title": "classic case of website photos do not match reality", "text": "Negatives are: 20 minute walk to center town, iffy-not-so-good commercial neighborhood, no AC.", "user": "balmoralsailing", "date": "May 28, 2008", "id": 16477882}, {"rating": 2.0, "title": "Terrible", "text": "We were fortunate during our stay last weekend as the hotel owner hosted a catered promotional party to which we were invited. It was quite fun and lavish.", "user": "Tony33ON", "date": "April 21, 2008", "id": 15204310}, {"rating": 4.0, "title": "fairly good", "text": "After much deliberation of where to stay in Copenhagen we settled on Avenue Hotel, as it appeared to be charming but modern and offer a special atmosphere. There seemed to be mixed reviews on Trip Advisor and I now see why!", "user": "mike w", "date": "April 19, 2008", "id": 15147873}, {"rating": 3.0, "title": "isolated", "text": "We had to check out after one night.", "user": "carmenharra", "date": "March 21, 2008", "id": 14437186}, {"rating": 2.0, "title": "First, really good; then, dissapointing", "text": "I was in this hotel for five nights, so I had enough time to appreciate the bad and the good points of it. During the week all run smoothly: well cleaned rooms, a cold but good breakfast, some good tips from the reception desk (but always when asked, never a forwarding greeting or tip)...but, in the weekend, things seemed to change utterly: problems with the hotel not-well-kept computers, plugs and curtains not working at all, not helping people at the reception desk, rooms and beds uncleaned and not well tide up...the weekend was thus very dissapointing for my wife and me. In any case, I have visited some countries in Europe and stayed in medium range hotels; to date, I have had no problems with the normal services: here, I had.", "user": "MIGLG", "date": "September 28, 2007", "id": 10014234}, {"rating": 5.0, "title": "I loved it!!", "text": "We all have different opinions on hotel reviews, but I would have to say that I loved The Avenue Hotel! We looked the hotel up before our stay, emailed the hotel directly on useful questions (how to get there, taxi costs, how far places were, etc) and they replied ASAP. So we narrowed our search down to this hotel and when we got there, we were satisfied! I enjoyed everything about it! It is such a beautiful boutique hotel with such good management. I really have to say that I was happy with my stay overall and will DEFINITELY go back to The Avenue and also recommend this hotel to others. A bit of a walk to the city centre, but it could not be better located. Too tired of walking? Take a taxi, metro or the bus.", "user": "kmgk", "date": "September 22, 2007", "id": 8850455}, {"rating": 3.0, "title": "Good value - however breakfast could improve", "text": "Nice and clean hotel. The outside sitting area is well designed. Rooms are big and clean, but it seems that they vary in size. If you are to the front the street is quiet noise, but the windows are well soundproof (if closed :) ) The hotel is a bit outside and it takes about 30 minutes to walk into the center. You can also take the bus (stops in front of the hotel) or rent a bike from the hotel (extra charge!). The breakfast is not of the standard I would expect it from a 3star hotel. The quality is good, but little choice.", "user": "Obelix72", "date": "September 14, 2007", "id": 8712074}, {"rating": 2.0, "title": "Definitely a 2 star hotel", "text": "Stayed here in early September, not very satisfied. Paper thin walls (to the point of being able to hear normal conversations in adjacent rooms), not to mention the street noise. Furniture was nice, but the bathroom was dirty. Also paid for an A+ room and got a standard double. Location is way out of town, although along the bus route to the airport. Would stay somewhere else next time.", "user": "mko78", "date": "September 11, 2007", "id": 8693909}, {"rating": 4.0, "title": "Stylish Hotel with Great Value,", "text": "Based on the great reviews on this site, we booked this hotel for 3 nights before and after the Baltic cruise. We highly recommend this hotel.", "user": "GlobalKuidaore", "date": "September 4, 2007", "id": 8656529}, {"rating": 4.0, "title": "Dazzling Copenhagen", "text": "Last weekend we stayed at the Avenue Hotel in dazzling Copenhagen: we had a great time! The room was well furnished and tidy. The charming old hotel building was easy to reach from the airport (bus 250S). And last but not least, the staff was friendly, helpful and polite. Our conclusion: excellent value for money at the Avenue.", "user": "MVB/JK", "date": "September 3, 2007", "id": 8614339}, {"rating": 4.0, "title": "Great option if you're willing to be away from the action", "text": "Avenue is a terrific hotel with a very cool exterior (older design) and interior (modern design). The staff was very friendly and helpful. The breakfast was good (though we had fewer options than we had at other hotels throughout Scandinavia), and the breakfast room was attractive. Our room was large and extremely comfortable. The hotel isn't centrally located but we could easily and quickly get to all the attractions by bus (a stop is right outside) and metro (5 minutes away). The few empty storefronts adjacent to the hotel might be off-putting to some, but we did not feel unsafe at all (particularly because the hotel is in such a busy area). Some other thoughts: the lounge area in front of the hotel looked like a cool place to hang out (though we never did); the carpet (both in and out of our room) was a mess (though everything else seemed \"newish\" and stylish); the street noise can be loud at night; and the website directions to walk from the train station to the hotel are awful. But, all in all, the Avenue was a great option for us, particularly because we got a terrific deal on Orbitz. We would definitely recommend it.", "user": "Noslo", "date": "September 3, 2007", "id": 8614023}, {"rating": 5.0, "title": "Best deal in Scandinavia", "text": "Having spent considerable time in this part of the world I can assert definitively that the Avenue is the best deal in Scandinavia.", "user": "mea17", "date": "August 18, 2007", "id": 8446532}, {"rating": 5.0, "title": "Charming stay", "text": "From the moment I arrived at this charming hotel I was greeted by a knowledgeable, warm and helpful staff. Throughout my stay they assisted my friends and I with top notch service, whether it be regarding dinner reservations, general directions, helpful suggestions or domestic needs.", "user": "caren921", "date": "August 14, 2007", "id": 8421019}, {"rating": 4.0, "title": "Lovely hotel", "text": "Aesthetically I was equally impressed. The lobby is most welcoming and accompanied by a beautiful bar. Our room was well appointed with cutting edge Danish furnishings. The back patio is another plus for the Avenue; lined with tables and plush pillow seating. I also appreciated the location which put some distance between our venue and the hub of tourist frenzy.", "user": "Brookh", "date": "August 13, 2007", "id": 8403963}], "location": {}, "stars": 3, "variance": {"poor": 18, "average": 49, "very good": 171, "terrible": 8, "excellent": 122}, "aka": "Avenue Hotel Copenhagen Denmark", "slim_ranking": 0.142857142857, "detail_rating": {"service": 4.5, "cleanliness": 4.0, "value": 4.5, "sleep": 4.0, "rooms": 4.0, "location": 3.5}, "description": "The Avenue is an up-to-the-minute, welcoming boutique hotel situated in the heart of Copenhagen. Whether your stay is for business or pleasure, the modernity of the interior decoration and furnishings combined with the very special personal touch make you feel comfortable and at home. Enjoy the cozy lounge or charming patio or take a ride on one of the popular Avenue bikes. Our friendly team is always there to make your visit a memorable one."}