{"user_rating": 3.5, "review_count": 320, "name": "Avignon Grand Hotel", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed August 2005", "text": "Overall we thought the hotel was a great value. Our room was on the ground floor and opened to the garden - very quiet. The room was very large. It was like a suite, having living and bedrooms. The bed was great and had a trundle bed underneath. It was clean. We did not do breakfast. The hotel's restaurant was great- excellent food and presentation for such a low price. Staff was friendly. The pool was ok. Parking underneath in the garage was expensive. The hotel was only a 10 min walk from the Palais and 5 min from the main drag that had some great restaurants.", "title": "Pretty Nice Hotel", "helpfulness": 7, "user": "capturedplanet", "date": "August 14, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 5.0, "service": 3.0}, "id": 3761540}, {"rating": 4.0, "title": "Great location, great price", "text": "This hotel was perfectly located for sightseeing in Avignon and the staff was very helpful. The rooms were roomy and clean and the bed was excellent. We would love to stay here again!", "helpfulness": 4, "user": "A TripAdvisor user", "date": "June 5, 2005", "id": 3530651}, {"rating": 4.0, "title": "Great Hotel", "text": "My husband and I stayed at this hotel for five nights. Overall we thought the hotel was a great value. Our room was on the ground floor and opened to the garden - very quiet. The room was spacious, clean and comfortable. Breakfast was great. Staff was OK, not friendly sometimes. They gave us a recommendation for dinner which was a tourist trap.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "May 28, 2005", "id": 3505686}, {"rating": 5.0, "stay_parameters": "Stayed May 2005", "text": "I chose the Grand Hotel at Avignon after reading the reviews on tripadvisor. I was not disappointed. The hotel is absolutely charming and the staff offer wonderful old fashioned friendly service. My husband and I had a double suite which was beautifully furnished and also enjoyed a delicious breakfast each morning. An absolute gem!", "title": "Thanks to tripadvisor!", "helpfulness": 4, "user": "UkLucycat", "date": "May 18, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3481398}], "location": {"country": "France", "region": "Provence", "continent": "Europe"}, "stars": 4, "variance": {"poor": 40, "average": 74, "very good": 129, "terrible": 21, "excellent": 56}, "slim_ranking": 0.430555555556, "description": "At the foot of the Avignon remparts, the Avignon Grand Hotel provides 122 rooms and suites spacious of 40 m² and more with terrace or balcony. The hotel is also equipped with a relaxation area with a swimming-pool. It is perfectly located on the heart of the historic centre of the city and adapted for relaxing or working stay. It provides modern and traditional wide confortable spaces. You only have to get over the remaprts to reach the Cloitre Saint-Louis restaurant which is unique and full of history. All over the year, the restaurant offers you a sophisticated and light cooking."}