{"user_rating": 4.0, "review_count": 872, "name": "Axel Hotel Berlin", "reviews": [{"rating": 1.0, "stay_parameters": "Stayed August 2011, traveled solo", "text": "I stayed here because I stayed at the Axel in Barcelona a few years back and liked it. Big mistake - the Berlin property was horrible! I won't even speak about design or decor of the hotel - that's subjective and some people would like it and some won't - it's an all black hotel - probably to hide the dirt. I didn't like the design but that's not my issue with this hotel at all.", "title": "The worst hotel service ever! The Axel brand should be ashamed!", "helpfulness": 8, "user": "sdjlg", "date": "August 19, 2011", "detail_rating": {"cleanliness": 1.0, "sleep": 1.0, "value": 1.0, "service": 1.0}, "id": 116949914}, {"rating": 1.0, "stay_parameters": "Stayed July 2011, traveled with friends", "text": "The issue was with the complete garbage they call service. The General Manager, Oliver Boehme likes to respond to trip advisor reviews I see, but perhaps he should focus on training his staff or getting rid of them and hiring better ones to make better use of his time.", "title": "Hetero friendly or LGTA rip-off? Either way, better stay somewhere else.", "helpfulness": 7, "user": "Seasonedtraveller023", "date": "August 16, 2011", "detail_rating": {"cleanliness": 1.0, "sleep": 1.0, "value": 1.0, "service": 1.0}, "id": 116796370}, {"rating": 3.0, "stay_parameters": "Stayed August 2011, traveled on business", "text": "There are the same few people working at the front desk every day - they have no Concierge, or any other services to speak of besides a rooftop fitness room/sauna. The lobby bar and restaurant never had a soul in them - even on the weekends in the summer ....in a gay hotel...in the gay neighborhood - kind of a sign right there that it's a poorly run establishment.", "title": "Back to black ...", "helpfulness": 3, "user": "Traveller_Europe_78", "date": "August 14, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 2.0, "value": 3.0, "service": 3.0}, "id": 116695836}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled solo", "text": "I arrived around 9am and the front desk clerk looked at me and said \"you're too early, you can't check in\" - not, \"I'm sorry, we have no rooms available\", not, \"let me see how long it will be\" - just - \"you're too early, you can't check in\". Later in my stay I asked that same clerk some reccommendations on where to go out. I was floored when his response was \"I don't know\". You're gay, working in a gay hotel, in a gay area and a paying guest asks for some suggestions and you say \"I don't know\"?? - I mean even if you don't go out yourself - being a hotel employee you should be aware of your area so you can help guests (a far cry from what they do at Axel).", "title": "The staff was very friendly and helpful and the room was very clean and comfortable. I highly recommend it.", "user": "smjoe", "date": "August 9, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116464740}, {"rating": 3.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "One morning asked a female desk clerk directions, which she rattled off as if I was born and raised in Berlin. When I asked her to write them down, she rolled her eyes like it was the greatest chore. The other female desk clerk never looked up from the desk - she would keep her head down even when guests approached. I asked the original desk clerk for a wake up call on my final night which he confirmed. When I got home later that evening and double checked, sure enough - no wake up call noted. The evening clerk's response to my dismay was \"I don't know - I've been on vacation and just got back\" - Thank god I double checked knowing the shoddy service levels.", "title": "Very very small rooms and gets hot and stuffy. Fab location though.", "helpfulness": 3, "user": "Southamptonboy", "date": "August 8, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 2.0, "value": 2.0, "service": 5.0}, "id": 116438981}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "Having stayed at the Axel in Barcelona we thought we'd give this hotel a go for a long weekend (Thurs to Sun).", "title": "I give it a B-", "helpfulness": 1, "user": "MatthewGreen", "date": "September 26, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 118604997}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "It's modern, trendy, clean and has a nice spa on the 6th floor. Additionally the location is good, especially for visiting the gay neighbourhood which seems to be concentrated in this area. I know the hotel chain goes with the tag-line \"heterofriendly\" and there were quite a few straight couples staying, but if I'm honest I'd probably warn straight people off staying unless they are comfortably open minded!", "title": "Booking it again!", "user": "Charles G", "date": "September 24, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 118541421}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled with friends", "text": "We paid a little bit more for a superior room and to be honest, I'm not sure if it was worth it. The room was oppressively dark and didn't have a wardrobe but it was spotlessly clean and the bed was very comfortable with good quality linen. Slightly annoying that there was only one bathrobe and one pair of slippers although I'm sure they would have provided another if asked.", "title": "Great times", "user": "Katie_I_Essex", "date": "September 21, 2011", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 118399825}, {"rating": 3.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "The 6th floor spa/gym was very pleasant with a small gym, showers, sauna, steam room and hot tub. Be warned most guests are men and the spa (despite requests for people to be appropriately attired) tended to be a \"naked zone\" for many of the guests. However, we didn't see anything untoward going on so fortunately it wasn't like a gay sauna. Also it was slightly disappointing that the hot tub was more a \"lukewarm tub\" and that there were no additional towels available.", "title": "Close to KaDeWe", "helpfulness": 1, "user": "2travelguys", "date": "September 19, 2011", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 118331291}, {"rating": 2.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "To sum up, it was a comfortable and well located hotel although a bit dark and dingy and perhaps a little soulless. It doesn't quite compare to their Barcelona hotel but it is a lot cheaper!", "title": "heterofriendly is more than a slogan", "helpfulness": 1, "user": "GosuSolihull", "date": "September 19, 2011", "detail_rating": {"value": 3.0, "location": 4.0, "service": 4.0, "rooms": 2.0}, "id": 118305796}, {"rating": 1.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "We consider ourselves a young, easy-going gay couple, but what meant to be a romantic weekend for a special occasion in a 4-star gay hotel in the centre of Berlin turned out to be a bit of a troublesome experience. The location is nice, and that's about it!! For the price this hotel charges (650 euro for 4 nights for a regular double room!) you can find much better hotels in the area. The first day we returned back to the hotel, we realized the room had not been cleaned or made up. So we friendly notified reception staff about this matter and they assured us it would be cleaned the day after. However, one day later: same scene... room not cleaned! A bit more aroussed we demanded to speak to the manager (\"U really want to speak to someone- YES\") and a young girl apologized (\"new cleaning firm\" \"still have to learn how to clean ?\"...blabla), told us the room would be cleaned the day after (not more than normal ??).", "title": "Never ever again!", "helpfulness": 2, "user": "coupleberlin", "date": "September 7, 2011", "detail_rating": {"cleanliness": 1.0, "sleep": 2.0, "value": 1.0, "service": 1.0}, "id": 117797294}, {"rating": 2.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "By scrolling down former reviews on Tripadvisor, we saw that the hotel already had to deal with this kind of issue some years ago (un-cleaned rooms) and apparently after these years they still are not able to manage this problem, no matter what fancy words have been written about it. Completely UN-exceptable, not worth 4 stars and definitely not worth the price rates they charge. The lady in charge gave us a 90euro reduction (not even worth one night!) and a drinking voucher. We should also mention the Sky bar does not exist anymore (although the hotel still keeps mentioning it on its website and in the elevators), so we drank our free drink in the Urban bar downstairs - a tasteless bubbleless Prosecco, not even worth mentioning, but we do it anyways since it seems to be the major problem of this hotel: no quality, no service: just pay your money (no-refund policy, by the way) and get out. Never ever again for us!", "title": "Nice try, but would not return", "helpfulness": 2, "user": "Michael S", "date": "September 6, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 2.0, "service": 3.0}, "id": 117769663}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "We stayed for three nights at this hotel. We have stayed at Axel hotels in Barcelona and Buenos Aires. This hotel is not up to the same standard as the Barcelona and Buenos Aires properties. It is not interesting or exciting in any way. Unfortunately, it is dull and boring! The room we had was a junior suite, the \"Berlin Suite.\" It was large, but strangely configured, without being comfortable. It had more space for the dressing and closet areas than in the bathroom. There was a large tub, but a small stall shower. The shower leaked water through the shower door onto the bathroom floor, which was wet most of the time. The room attendants were late each day, which made it difficult to use the room until they arrived at 20:00 the first day to clean the room. The next day was somewhere around 16:00. There seemed to be an absence of people, both guests and hotel employees, at this hotel. The staff was mostly pleasant. Don't bother with the breakfast buffet unless you get it inexpensively. The computer for the business center has no printer. The wireless internet is insane! You need to re-enter a ticket number every time you enter the hotel to sign on each device. We had to sign onto the internet many times each day just on our iPhones. It was annoying. Each day, the ticket and password changes, so we had to call to the front desk or have them print a new one. The outside spa (hot tub) is in a small area, and is locked later at night. The access to the spa and fitness center is strange and cumbersome. The bed was comfortable. The bathroom area was very dark!! The vibe of the hotel is supposed to be hip and fun, but it is not hip or fun at all!! We saw a lot of unhappy faces, especially on check-in since rooms are cleared so slowly.", "title": "Excellent Hotel", "user": "Jamie C", "date": "September 5, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117698082}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled solo", "text": "We loved this hotel. Beautiful rooms. Sauna was amazing and comfortable. The staff is amazing. Great location for gay Berlin. Go on the walking tour of Berlin!", "title": "Awesome City, Awsome Hotel", "user": "alex101010", "date": "September 1, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 5.0, "value": 3.0, "service": 4.0}, "id": 117539035}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "It was my first time in Berlin and my first time in a Axel Hotel!", "title": "Perfect hotel, Great location and great Service", "user": "Steve L", "date": "August 31, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117513655}, {"rating": 2.0, "stay_parameters": "Stayed September 2011", "text": "Loved the Axel Hotel in Barcelona, but the Berlin one pales by comparison. Room (junior suite) wasn't ready when we checked in at 6pm. Room, especially toilet and shower, was less clean than desired. The shower, while nice, tended to flood into the main bathroom. Finally, don't try the room service. My lasagna was still partially frozen when it was delivered. I tried to bring it to the front desk's attention but the lady simply told me to bring it to the room service kitchen in the back.", "title": "Urgh", "helpfulness": 1, "user": "Kurosaki_Ichigo", "date": "September 16, 2011", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 4.0, "service": 1.0, "rooms": 3.0}, "id": 118212241}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled on business", "text": "On the plus side, room was creatively designed. Location was good; a few minutes to the Wittenbergplatz Bahnhof, KaDeWe and Ku'damm.", "title": "Very nice, clean and friendly Hotel", "user": "Sabrina G", "date": "September 13, 2011", "detail_rating": {"value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 118049128}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "But on the whole, left a lot to be desired.", "title": "Nice summer stay", "user": "buiumb", "date": "September 12, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 5.0, "value": 4.0, "service": 4.0}, "id": 117996455}, {"rating": 2.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "If you want to have a nice and friendly period of resident, stay the time in the Axel Hotel in Berlin, near the Kurfürsten Damm (Lietzenburger Straße 13-15). The Rooms are very clean and have a nice style. The cloros of the Hotel are anthracite and yellow (very stylish). The personal is very friendly and professional.", "title": "No service - Too expensive!", "helpfulness": 4, "user": "swisspigs", "date": "September 11, 2011", "detail_rating": {"cleanliness": 2.0, "sleep": 4.0, "value": 1.0, "service": 1.0}, "id": 117940835}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "I will advice this Hotel to my friends and workmates.", "title": "Great location, friendly staff, efficient manager. Will stay again.", "user": "cubacubaSydney", "date": "September 10, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117922140}], "location": {"country": "Germany", "continent": "Europe"}, "stars": 4, "variance": {"poor": 64, "average": 144, "very good": 340, "terrible": 39, "excellent": 285}, "slim_ranking": 0.31981981982, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.5}}