{"user_rating": 4.5, "review_count": 871, "name": "Ayres Hotel Anaheim", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "We booked this hotel for our 2-day trip to Disneyland and were very pleased, normally we stick to larger chain hotels for their predictability but booked this one based on TripAdvisor reviews. The rooms were clean and nicely furnished (they were clearly targeting an older clientele) and the beds comfortable. The breakfast was a step above, with freshly made eggs, bacon, potatoes and pancakes both days we were there (plus the usual assorted continental breakfast items).", "title": "Great hotel convenient to Disneyland", "helpfulness": 3, "user": "znn94x", "date": "August 20, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 137831551}, {"rating": 5.0, "stay_parameters": "Stayed August 2012", "text": "The hotel is probably too far to be walking distance from Disneyland, but we were planning on driving anyway (and free parking at the hotel).", "title": "Gem of a hotel!", "helpfulness": 2, "user": "myspacebobby", "date": "August 20, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 137692873}, {"rating": 4.0, "stay_parameters": "Stayed August 2012", "text": "Had stayed years prior and had an exceptional stay so I was completely comfortable booking here again. Was in town for a concert at the Honda Center. The hotel is across the street!!!! Disney is right up the street and Angel Stadium a skip away. Can't wait to be back!", "title": "Good value and good location", "helpfulness": 3, "user": "ladyraceruk", "date": "August 19, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 137686387}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "Ayres Hotel is a Victorian styled hotel. We stayed for 2 nights and we had a very pleasant stay. Room was large and clean, service was excellent, great free breakfast and free parking.", "title": "Just an excellent hotel.", "helpfulness": 5, "user": "j w", "date": "August 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 137656403}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "We drive to Disney and Knott's Berry Farm. Both were close by, making this an ideal base for south LA and Anaheim attractions. It is also next to the Anaheim Angels baseball stadium, so it would be perfect for watching a game.", "title": "Excellent service", "helpfulness": 1, "user": "D A", "date": "August 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 137284743}, {"rating": 5.0, "stay_parameters": "Stayed August 2012", "text": "Great hotel, great service, perfect location for attending games at Angels Stadium, heckling out Disneyland, and shipping at the outlets at Orange.", "title": "As advertised", "helpfulness": 4, "user": "LarryM7", "date": "September 2, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 139207969}, {"rating": 4.0, "title": "Great hotel, not much around it, excellent service", "text": "The complimentary hit breakfast is the best. Even better than most cash breakfast places. Highly recommended.", "helpfulness": 2, "user": "ZaniCarter", "date": "August 29, 2012", "id": 138835009}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "Firstly, after a very long flight and little sleep the welcome from the Ayers staff was fantastic, and they quickly put us into our room despite being well before check in. The rooms are very good and clean. They are not fancy but this isn't 5 star. Air con, fans, kitchen facilities, TV, pool...all great. It is about 15 mins on the local bus to Disneyland but this is from the hotel to the park and at $4 for an all day ticket it was very good. There is not much around the Ayers by way of restaurants, convenience stores or markets so you will need to cab or drive to most places. We were here for two nights so the bar and grill next door was dinner two nights running, but the food, value and service was good so not problems there. With free parking it is handy for those with a car. The front reception service is fantastic with the team happy to offer advice and information about outlet shops, bus transport and other to do recommendations. The breakfast was a great addition with plenty of variety but with a small dining hall, avoid the 730 to 8 peak. The only complaint was a missed morning wake up call but we managed to rush around and get organised quickly for Disneyland - a small fault in otherwise a very good and affordable hotel. Recommended for shorts stays!", "title": "5th visit, still outstanding", "helpfulness": 8, "user": "Mr V", "date": "August 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 138285319}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "First time writing a review, but after 5 visits in the last 6 years, a review is deserved. I have taken my growing family here for trips to Disneyland 5 separate times. Cleanliness is very important to us at hotels and this place is very clean. They have also gone to a lot of effort to upgrade the facilities over the years, before we would have thought it was even needed. Rugs were replaced and furniture was upgraded. The breakfasts are awesome. No cleaning ladies reheating food. This place has a chef who will take your order and make you a great breakfast, in addition to a lot of self-serve food as well. He has been there every year and is very friendly to the guests. Generally speaking they seem to put a lot of effort into maintaining their #1 rating in Anaheim. The key here is that this place is also affordable. Hopefully the recent rewards don't result in higher prices. Anyway, keep up the great work. I've recommended this place to many friends.", "title": "5 stars for Anaheim", "helpfulness": 5, "user": "RutabegaSaranwrap", "date": "August 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 138257862}, {"rating": 5.0, "stay_parameters": "Stayed August 2012", "text": "I gave this place 5 stars for a comparison of what's available in Anaheim, but it's not a 5 star hotel. We have also stayed a few times at the Double Tree which is a comparable property but we preferred the Ayres. The rooms were cleaner, the hotel is smaller with less people and the hot free breakfast was awesome. The pool area was alright, it was a bit dirty and right off the highway so a little noisy.", "title": "Love this hotel!", "helpfulness": 1, "user": "ladygadgetkaren", "date": "August 24, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 138252741}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "We went on previous reviews of this hotel and were not disappointed. The hotel is clean comfortable, quiet, well-equipped and very good value. Andrew, the manager (I asked for his name) was very friendly, welcoming and helpful and the afternoon complimentary happy hour was more than expected. We have no hesitation in recommending this hotel to fellow travellers.", "title": "Very good choice", "helpfulness": 4, "user": "CGT867", "date": "September 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 140047953}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "Following our excellent stay at the Ayre's Anaheim a couple of years ago, we did not even consider anywhere else when booking a seven night stay to round off a trip to Vancouver and Seattle.", "title": "Didn't consider anywhere else", "helpfulness": 2, "user": "davyp777", "date": "September 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 140017915}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "No 'resort fees' here - or ridiculous parking charges and internet is free in your room - so you are already onto a winner.", "title": "this was our top-rated hotel, in 3.5 week USA trip", "helpfulness": 1, "user": "Clairebear255100", "date": "September 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 139700565}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "Add to that the complimentry breakfast, wine and nibbles on weekday afternoons and very spacious clean rooms, you get great value for your money.", "title": "Great hospitality, clean accommodations, fantastic breakfast", "helpfulness": 2, "user": "Erica C", "date": "September 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 139533097}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "We were checked in very efficiently by Andrew on our arrival and after settling in to our room, I did not notice any scuffs or marks on walls or stains on carpets (which can be evident in any hotel) and indicated that the housekeeping and maintenance was of a high standard. I also noticed one of the staff checking the immaculately carpeted hallways (I hate it when people dump stuff from their rooms outside their door) which was reassuring.", "title": "weekend in California", "helpfulness": 2, "user": "Russ C", "date": "September 5, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 139444562}, {"rating": 3.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "My family and I stayed at this hotel for 7 days while attending a conference and visiting friends and family. This was the first time staying at a hotel in this area and I saw the great reviews online. We found this hotel to be just another average hotel.", "title": "Just About Average", "helpfulness": 4, "user": "dannykessel", "date": "September 22, 2012", "detail_rating": {"service": 4.0, "cleanliness": 2.0, "value": 3.0, "sleep": 4.0, "rooms": 2.0, "location": 3.0}, "id": 140962640}, {"rating": 5.0, "stay_parameters": "Stayed September 2012", "text": "When we arrived from the airport, we were put in a 2nd floor room. The AC in this room wasn't working and it was blowing out warm air. I called the front desk and they tried troubleshooting the thermostat over the phone. They requested I see if the changes we made would cool the room, but it didn't. After 10 minutes of waiting, and family arriving to welcome us and our new baby to town, I called the front desk again. They were certainly nice, but said they would check availability of rooms and get back to me. 15 minutes went by with no response so I walked to the front desk. The young lady said a supervisor would be coming to our room with me to try and fix it. She came, and just like we tried over the phone, no success. She admitted they didn't have any more rooms available, but she would do something. So, we all waited another 15 minutes in the warm room. They did finally call and a room did become available.", "title": "A definite RETURN", "helpfulness": 2, "user": "BeachBumGuy_9", "date": "September 20, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 140732960}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "In short, this all could have been resolved with immediate attention to the matter and a little bit of trust in the customer that I may know how to use a thermostat. This was honestly, the only MAJOR issue during our stay. The room was adequate, a little dirty, sticky carpet and dirty/moldy bathroom grout and shower curtain. The free breakfast was subpar. The cereal was stale, the juice not very good at all and a little small. I will give props to the omelette bar. And lastly, I will give the service/attitudes a thumbs up. They all seem glad to be doing their jobs and willing to help.", "title": "Best Hotel experience ever!", "helpfulness": 2, "user": "Ginny C", "date": "September 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 140709018}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "Again, my overall grade of this hotel is a C. No, I wouldn't stay here again and I am a little disappointed it didn't stand up to the rave reviews I found on this site!", "title": "Spotless.", "helpfulness": 1, "user": "angellovestotravel", "date": "September 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 140690328}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "This place gets a 5 out of 5. Excellent full breakfast, super friendly front desk and breakfast chef staff. Very comfortable room, nice amenities, excellent A/C and comfortable bed. Convenient to the 57 and 5 freeways. The pool is also a nice plus!", "title": "Nice hotel, short distance to Disney", "helpfulness": 6, "user": "asoaring_eagle", "date": "September 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 140168437}], "location": {"country": "United States"}, "stars": 3, "variance": {"poor": 10, "average": 45, "very good": 203, "terrible": 2, "excellent": 611}, "aka": "Anaheim Ayres Hotel", "slim_ranking": 0.00900900900901, "detail_rating": {"service": 4.5, "cleanliness": 5.0, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "Welcome to the Ayres Hotel Anaheim! You’ll find all of the 133 luxurious guest rooms at Ayres Hotel Anaheim are impeccably appointed with a full suite of complimentary amenities including our signature, triple sheeted Ayres Dream Sleeper beds, flat screen TVs, refrigerators, coffeemakers, microwaves, well lit work desks, Wifi, iHomes, hairdryers, and curved shower rods. Every morning you will start your day right with our complimentary full American breakfast buffet which includes freshly cooked eggs, potatoes, sausage or bacon, pancakes or french toast, oatmeal, fruit, yogurt, cereal, toast, muffins, juice and coffee. Ayres Hotel Anaheim welcomes travelers to all of the exciting business, recreational, and entertainment attractions Southern California has to offer. Across the street is the Honda Center that plays hosts to numerous sporting and entertainment events including Anaheim Duck ice hockey and popular music artist concerts. For baseball fans,catch an Anaheim Angles of Los Angeles game at the Angels Stadium, literally steps away. Guests can catch the Anaheim Resort Transit system to the Anaheim Convention Center, Disneyland Resort, Disney California Adventure, or for shops, restaurants, and bars the Downtown Disney District or Anaheim Garden Walk. The Ayres Hotel Anaheim is perfect for your family vacation, date night, or for the girls or guys night out on the town!"}