{"user_rating": 5.0, "review_count": 238, "name": "Azalea Lodge", "reviews": [{"rating": 4.0, "title": "Great B and B", "text": "What a great B and B! This was our last night of our 10 day trip. We were going to cancel at Azalea to stay where we stayed our first night (Comfort Inn, Smithfield), but when calling Bernadette informed us of the 48 cancelation policy. So we stayed at Azalea and are so glad we did! The rooms were large, clean and very comfortable. At first glance of the busy road the house was on, I would think it would have been very noisy at night, but our room overlooked the beautiful garden and had no problem sleeping. It is a bit on the outskirts of city centre, so a 15 euro taxi or the bus is your best way of getting in. The breakfast and bright breakfast room was a perfect way to end our trip. I would highly recommend Azalea!~", "helpfulness": 2, "user": "mag1007", "date": "May 11, 2007", "id": 7589088}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled with family", "text": "My brother and I arrived in Dublin on a Monday afternoon, Azalea Lodge had only 1 vacancy, however, the Sweeneys arranged for my brother to stay a night at another B & B, accommodating at it's finest! Tuesday, my brother joined me at Azalea. I can honestly say this was the most welcoming place to stay in Dublin. Bernadette and Padraig were most gracious hosts. The rooms were extremely clean and neat. I absolutely loved the bay window in my room! The access to downtown Dublin was so convenient,", "title": "Wonderful Hospitality !", "helpfulness": 4, "user": "shorty883", "date": "May 7, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 7555673, "likes": {"liked": "— Cleaniness and location"}}, {"rating": 5.0, "title": "Excellent in every way", "text": "I only wished I would have purchased a bus pass for the week!", "helpfulness": 3, "user": "margelmore", "date": "April 10, 2007", "id": 7327835}, {"rating": 5.0, "title": "I can't say enough good things about the Azalea Lodge! ", "text": "If you want a very personable place to stay while you are there, this is the place!", "helpfulness": 3, "user": "TarheelTraveler1979", "date": "January 28, 2007", "id": 6709735}, {"rating": 5.0, "title": "great B&B, perfect hosts, convenient location", "text": "Comfortable room; tasteful and elegant decor throughout. Terrific breakfast. Conveniently on bus line to airport and city center. Gracious and helpful hosts.", "helpfulness": 7, "user": "arnsch", "date": "January 22, 2007", "id": 6640391}, {"rating": 4.0, "stay_parameters": "Stayed December 2006, traveled with friends", "text": "Azalea lodge is a wonderful B&B near City Centre in Dublin - easily accessible by bus (which run all the time). Bernadette Sweeney and her husband Padraig are lovely hosts. Bernadette is a talented Irish cook who makes her own breads, serves up a yummy traditional Irish Breakfast and has excellent knowledge of the area. She recommended we visit Powerscourt (near Kildare, and accessible by rail or car) one day, which turned out to be one of the most beautiful places we were able to experience - even tho' it was windy and pretty cold.", "title": "Loved the B&B", "helpfulness": 5, "user": "dolphinluv729", "date": "December 28, 2006", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 3.0}, "id": 6508731, "likes": {"liked": "— Charming Hosts! Yummy breakfast. Central location", "disliked": "— Street noise can be very loud"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2006, traveled with friends", "text": "Our room was two twins and was immaculately clean, with white bedspreads and sheets. While the rooms are lacking in wall art, and there is a tiny tv that sits on a shelf which is viewed only by one of the beds, as well as a \"bring your own shampoo\" policy - please don't let that stop you from staying at this wonderful place, just be advised because it is different than other places we have stayed. The shower adjustments took some getting used to and the heat is on a timer, however, Bernadette will help with adjustments any way she can. I'll definitely be back!", "title": "Great Stay at The Azalea Lodge", "helpfulness": 6, "user": "ntz4golf", "date": "September 18, 2006", "detail_rating": {"cleanliness": 5.0, "front_desk": 5.0, "location": 5.0, "value": 5.0, "rooms": 5.0}, "id": 5813424, "likes": {"liked": "— The soft bed and excellent shower", "disliked": "— Parking"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled with family", "text": "I stayed at the Azalea Lodge in Dublin for two nights on Sept. 14th and 15th. We didn't get to Dublin until after the sun had set and I knew this would cause a problem finding the B&B and I was right. When we finally did locate the Azalea Lodge, Bernadette saw us in and to our rooms. Since we were traveling with two sets of golf clubs, Padraig had agreed to let us keep our car in their garage, which was great. Be warned! Parking is at a premium near the B&B. Best thing to do is find a spot and leave your car there and take the bus into downtown Dublin. Don't even consider driving downtown. It's a madhouse! It's very easy to catch a bus into and out of downtown from the B&B. My room was actually a twin which was quite nice. The bed was very comfortable, the towels were plush and the water pressure in the shower was excellent, which can be a problem at some places you stay. The breakfast was the standard Irish breakfast. No surprises here. Bernadette did some laundry for me, a shirt, a pair of trousers and underwear which she charged 10 euros for, which I thought was a bit expensive. My travel companion had a \"real\" single room. The room had a nice size bed in it and it took up most of the room. Plus, his room faced the street which brought with it all the traffic noise. He would probably say he wouldn't stay here again, but my experience was quite different because of my room size and its location. I will stay here again but I would make sure my room did not face the street.", "title": "Great Location, Friendly Owner", "helpfulness": 9, "user": "TRyan", "date": "September 4, 2006", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 5.0}, "id": 5767891}, {"rating": 4.0, "stay_parameters": "Stayed July 2006, traveled with family", "text": "We only had one night in Dublin (July 17, 2006) before flying to England, and we stayed at the Azalea Lodge upon the advice of our daughter who had stayed there previously. The B&B owner, Bernadette Sweeney, corresponded with us via e-mail prior to our visit and encouraged us to drop off our luggage after an early morning arrival. We arrived around 10 a.m., had tea and snacks in Bernadette's living room, and were pleasantly surprised to find that our room was ready for us!", "title": "Friendly Place to Stay", "helpfulness": 4, "user": "Pegs", "date": "August 25, 2006", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 5710007, "likes": {"liked": "— Breakfast was sophistocated and delicious...", "disliked": "— front street is busy"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled solo", "text": "The taxis were on strike the day we arrived in Dublin, but that was no problem as the Azalea Lodge can be reached directly by several buses from the airport. They stop within a block of the B&B...and continue toward the city center. We used the bus to ride to the Trinity College area and used it again to return to the airport. Because we had scheduled a Wicklow Mountian day tour, we had to leave the B&B early in the morning. Bernadette very graciously served us breakfast ahead of the normal schedule and allowed us to leave our luggage in the front hall until our return from the coach bus tour later that afternoon. We ended our tour at 5 p.m., took the bus to Azalea Lodge to pick up our lugge, hopped another bus to the airport, and arrived at 6::30 to check in for our flight to England. It was a short, but delightful, stay in Dublin.", "title": "Wonderful stay", "helpfulness": 7, "user": "Miguelajo", "date": "August 22, 2006", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 5699808}], "location": {"country": "Ireland", "continent": "Europe"}, "stars": 3, "variance": {"poor": 0, "average": 8, "very good": 32, "terrible": 1, "excellent": 197}, "aka": "Azalea Hotel Dublin", "slim_ranking": 0.0440251572327}