{"user_rating": 4.0, "review_count": 2672, "name": "Azul Sensatori Hotel, by Karisma", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed December 2008, traveled as a couple", "text": "My Partner and I booked to stay at Azul Sensatori from 2nd December until 16th December. After we booked we started scouring the net for whatever information we could find was pictures and videos of unfinished buildings which gave us a bit of worry as we were due to leave in 12 weeks time. We kept checking for the update photos on Thomson’s website and other American websites and could see that it should be finished (hopefully). We had a fantastic holiday and met some lovely people, both staff and guests. Here's the review from start to finish:-", "title": "No Complaints Here, Just a Fab Holiday!!!", "helpfulness": 30, "user": "Mrs_Chard_85", "date": "January 2, 2009", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 4.0, "rooms": 5.0}, "id": 23178797, "likes": {"liked": "— The food, pools, rooms and service!!", "disliked": "— The amount of complainers and the rocks in the sea!!"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2008", "text": "First Choice Airline:", "title": "Fantastic Resort - Loved the food and staff", "helpfulness": 12, "user": "J9away", "date": "December 31, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 23139518, "likes": {"liked": "— Rainshower", "disliked": "— Safe with key instead of electronic code"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2008, traveled with family", "text": "Earlier this year we flew to Maldives with First Choice and had a fantastic experience so we chose to fly with them again. Although we stayed in the star class premier seats on our flight to Maldives we chose not to upgrade for Mexico as we didn’t feel it was worth the money and it more than double the price than we paid previously. We were not disappointed with our seats on the plane and they were still comfortable and you still had TV’s which you could upgrade to premier for £5. We had a choice of two meals on our outbound and inbound flight which was nice as airplane food isn’t always that nice. The cabin crew were pleasant and the service was pretty good. I would definitely fly with First Choice again.", "title": "Can't beat the friendly faces", "helpfulness": 5, "user": "laviebo", "date": "December 31, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 23139338, "likes": {"liked": "— Service and Food", "disliked": "— Lack of entertainment at night"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2008, traveled with family", "text": "Cancun Airport:", "title": "Great Week", "helpfulness": 9, "user": "HopperEdmonton", "date": "December 30, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 23109418, "likes": {"liked": "— Location, design, food", "disliked": "— entertainmnet, music, lack of fun in bars"}}, {"rating": 3.0, "stay_parameters": "Stayed December 2008, traveled as a couple", "text": "Be prepared to wait around a bit when you get off the plane. You will be given an immigration entry/exit form and a customs form during your flight which you need to fill in. On the immigration form make sure you fill in the top and bottom sections otherwise you will be waiting longer. When you arrive at immigration there will be a long queue and they are not the quickest although once you get through there to collect your bags you will probably have another wait as they do not rush to get your bags on the conveyor. After you get your bags its over to customs where you may get your bags scanned but this didn’t seem to happen to everyone. You will hand your customs form to the airport staff who will check it and ask you to press a button, this will either go green or red. If it’s green you’re free to go, if it’s red your suitcase and bag will be checked. After getting nearer the exit there will be a lot of workers who will offer to take your bags for you, if you don’t mind being hassled for a tip let them take them otherwise take them yourself. You will find your coach/minibus and then be taken to your hotel.", "title": "Philip & Sally Hales Dec 2008", "helpfulness": 7, "user": "Whensthenextone", "date": "December 29, 2008", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 3.0, "rooms": 4.0}, "id": 23072879}, {"rating": 2.0, "stay_parameters": "Stayed December 2008, traveled as a couple", "text": "My husband and I stayed at Azul Sensatori from Dec 20 to Dec 27. Overall I would say that the week was a bit different than what we are used to.", "title": "Very Different Experience", "helpfulness": 7, "user": "Gemgirlbarbara", "date": "January 5, 2009", "detail_rating": {"front_desk": 2.0, "business": 2.0, "service": 3.0, "cleanliness": 3.0, "value": 2.0, "location": 4.0, "rooms": 5.0}, "id": 23300796, "likes": {"liked": "— Fabulous room and view", "disliked": "— Food and service"}}, {"rating": 3.0, "stay_parameters": "Stayed December 2008", "text": "The hotel is brand new which of course we knew before we booked. We have never stayed in a new resort before, but after reading a lot on TA and other websites, we had some idea what to expect.", "title": "Not Ready for Business", "helpfulness": 9, "user": "Katnor", "date": "January 4, 2009", "detail_rating": {"front_desk": 2.0, "business": 4.0, "service": 2.0, "cleanliness": 2.0, "value": 2.0, "location": 2.0, "rooms": 4.0}, "id": 23253922, "likes": {"liked": "— the rooms", "disliked": "— the beach"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2008, traveled with family", "text": "I don`t think that the newness of the resort brought us any surprises that we were not made aware of before we left. I would say that the issues that bothered us the most were the staff being inexperienced and the food often being cold. There were a LOT of children and families there. Too many. However, we have never been away for Christmas before and maybe that is normal. In future, we would likely only go to an adults only resort if we went during Christmas. The other thing that bothered us quite abit was the smelly water. It has a strong sulpher smell which was not too nice for washing or showering in.", "title": "Oooh Baby, it's warm outside!!", "helpfulness": 13, "user": "nickannetteandem", "date": "January 2, 2009", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 23200298, "likes": {"liked": "— Friendly Staff; cleanliness above par; great food", "disliked": "— Some finishing needs to be completed"}}, {"rating": 2.0, "stay_parameters": "Stayed December 2008, traveled with family", "text": "We arrived at about 430pm on a Saturday and there were quite a few people checking in. When it was our turn to speak with the front desk employees, we asked for a third or fourth floor room in the adults only building. The Senor told me ``Oh yes, it is the presedential suite` which I knew was not true. I said no, I know all of the rooms are the same in the Adults bldg, we just want to be sure we are on an upper floor please. He said yes, we were booked on the fourth floor. After we moved away from the counter we realized he hadn`t told us where the building is or how we could find it. So off we went and asked a couple of other people and found our way to our room. Gorgeous room, great view of the pools, grounds and ocean. Good balconey with glass so view was not obstructed. We slept with our patio door open every night. Nice and quiet around our area. There were a couple of little things broken in the room which we told the concierge about when she called us to check on the room. They fixed most everything within a couple of days. We had no problem with the shower leaking, just put the bath mat against the inside of the shower door to block the leakage and tilted the shower head a bit to face away from the door.", "title": "Built Until the Next Hurricane ...", "helpfulness": 6, "user": "HoustonBusiness", "date": "January 2, 2009", "detail_rating": {"front_desk": 1.0, "business": 2.0, "service": 4.0, "cleanliness": 1.0, "value": 1.0, "location": 2.0, "rooms": 2.0}, "id": 23207226, "likes": {"liked": "— Area for children, weather", "disliked": "— Quality of construction, water, lack of proper beach"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2008, traveled on business", "text": "The pools and grounds are very nice. The water in the pools is quite chilly as we expected it would be. There are only 15 beds by the adult pool and all fill up by 7am so we pulled over some lounging chairs as there were none around the adult pool. During the week, there were some parents allowing their children to swim in the adults only pool. I did mention to a couple of different staff members, but nothing was done. That bugged me a bit, but they are so new and a bit disorganized so I wasn`t surprised.", "title": "Excellent Holiday at Azul Sensatori", "helpfulness": 4, "user": "JLCToronto_ON", "date": "January 2, 2009", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 23204135, "likes": {"liked": "— Food, Landscaping, Relaxed Atmosphere", "disliked": "— Wish I could have stayed longer!"}}, {"rating": 2.0, "stay_parameters": "Stayed December 2008, traveled with family", "text": "Our trip: Dec. 20 - 28/08. The Azul Sensatori is exactly as described by Bruno&Brenda (read 'Growing Pains') so I won't reiterate, I'll just add my personal opinions.", "title": "Well, that was weird!", "helpfulness": 15, "user": "tlc_sandlover", "date": "December 28, 2008", "detail_rating": {"front_desk": 5.0, "business": 1.0, "service": 2.0, "cleanliness": 3.0, "value": 2.0, "location": 2.0, "rooms": 5.0}, "id": 23058218, "likes": {"liked": "— Room service, in-room jacuzzi, comfortable beds", "disliked": "— no activities after dinner, no beach swimming"}}, {"rating": 2.0, "stay_parameters": "Stayed December 2008, traveled as a couple", "text": "It's beautiful, comfy beds and fantastic jacuzzi, great poolside rooms, brilliant loung chairs in the water. It's elegant, it blew our kids' minds, we had an amazing family vacation here because it's what you make it. However, we'd never go back. Here's why:", "title": "Growing Pains...The Good, The Bad & The Ugly.", "helpfulness": 13, "user": "Bruno&Brenda", "date": "December 28, 2008", "detail_rating": {"front_desk": 3.0, "service": 2.0, "cleanliness": 3.0, "value": 2.0, "rooms": 4.0, "location": 4.0}, "id": 23044430}, {"rating": 3.0, "stay_parameters": "Stayed December 2008, traveled with family", "text": "Primary information #1: Is swimming in the ocean important to you? Then you should avoid this place. YOU CAN'T SWIM AT THE AZUL SENSATORI BEACH. No exaggeration. Between the intense coral and the seaweed, it's just impossible. A few people tried, everyone gave up. Best you can do is walk to the Azul Beach which is about 30 minute walk. But it will just make you sad, because Azul Beach is beautiful and the service blew our minds. We had more service, options offered to us (spritzing, tan lotion, ash tray, invitation to pilates in pool, listing of what's on the beach bbq today) all within 10 minutes - literally more service in 10 minutes than all the time we were at Azul Sensatori. Also tough to swallow: Azul Beach has soft thick sand, unique lounging options, super delicious drinks and a swimming area in the ocean. It also has ambience, which the Sensatori does not. Azul Sensatori is all white stone and everything is glassed in - there's no open-air anything. It's like being at a very nice Sheraton in a very nice location. You can't walk to Azul Beach to swim with your kids because you have to walk through the naked beach to get there and yes, there's a lot of things dangling and giggling in the sun. If you like taking nice long beach walks, you're stuck with short ones if you're kids are coming because you'll be fenced in by nakedness on one side and private ugly on the other. You've got about a 30 minute walk along unswimmable beach, maybe an hour for a round-trip beach walk.", "title": "A bit disappointing; not quite where it needs to be.", "helpfulness": 11, "user": "jeeprcb", "date": "December 27, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 23042751, "likes": {"liked": "— Food, Drinks, Pool, Friendly Staff", "disliked": "— Water Issues, Beach"}}, {"rating": 2.0, "stay_parameters": "Stayed December 2008", "text": "Primary information #2: Do you stay up past 10 p.m.? Then this place is going to bore you to pieces. Unless you like getting smashed listening to the same 8-song repertoire from the lounge singer in the Mojito bar, every single night, there is - no joke - NOTHING TO DO AT THE AZUL SENSATORI in the evening. What about the entertainment, you ask? Oh my gosh. Sure, we should expect cheesy. But we should also expect professionalism, a stage that doesn't partially blow away in the wind that stands in front of WOODEN BENCHES that seat maybe 75 people max. We should expect some ambience (a light show helps set the mood, a backstage area for the dancers to run in/out from helps stage the act, instead of everyone mulling about to the left of the stage until it's time to do their schtick, costumes that don't fall apart while in use would be less embarassing for them I'm sure, etc.)", "title": "Beautiful Setting; Below average service and amenities", "helpfulness": 9, "user": "bf1966", "date": "December 24, 2008", "detail_rating": {"front_desk": 2.0, "business": 1.0, "service": 2.0, "cleanliness": 2.0, "value": 2.0, "location": 2.0, "rooms": 3.0}, "id": 22980300, "likes": {"liked": "— Views and design of resort", "disliked": "— Inconsistent service and mediocre food"}}, {"rating": 2.0, "stay_parameters": "Stayed December 2008, traveled with family", "text": "The mojitos at the mojito bar are awful, very syruppy and as far as I can tell, have no club soda in them. We found it ironic-to-laughable that they had a lounge devoted to a drink they didn't know how to make... the sugar cane is fun to chew on though.", "title": "A little happy, Alot disappointed.", "helpfulness": 9, "user": "kufolla", "date": "December 22, 2008", "detail_rating": {"front_desk": 2.0, "business": 2.0, "service": 2.0, "cleanliness": 2.0, "value": 2.0, "location": 3.0, "rooms": 2.0}, "id": 22927033, "likes": {"liked": "— The beauty of the resort", "disliked": "— The lack of privacy in the bathrooms"}}], "location": {"country": "Mexico", "region": "Yucatan Peninsula"}, "stars": 4.5, "variance": {"poor": 135, "average": 327, "very good": 687, "terrible": 98, "excellent": 1425}, "aka": "Azul Sensatori Hotel, By Karisma Hotel Puerto Morelos", "slim_ranking": 0.217391304348, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.0}, "description": "This Gourmet Inclusive®, 438-suite hotel is just 20 minutes from the airport in Cancun. Special experiences foster togetherness for families, couples and groups of friends. Azul Sensatori caters to kids and teenagers, with the Azulitos Playhouse and Extreme Breeze Teens Club."}