{"user_rating": 4.5, "review_count": 191, "name": "B&B U Zeleneho Vence (Green Garland)", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "We found the Green Garland by reading the great reviews on Trip Advisor. We found this little hotel perfect in every way. The location was so convenient, the rooms were very clean and comfortable and the staff was beyond nice. Highly recommended!", "title": "Fantastic in every way", "helpfulness": 1, "user": "dkandscrappy", "date": "November 4, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "rooms": 5.0, "location": 5.0}, "id": 21546904, "likes": {"liked": "— Location and cleanliness", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "I highly recommend U Zelenho Vence. For what we were looking for (a nice, central, affordable room in Prague), it worked out well. The last two times I'd been to Prague I stayed with a friend and frequented local pubs, and I was keen to avoid overly touristy, overpriced places when I returned. U Zelenho Vence was great for that.", "title": "Very Happy with U Zelenho Vence", "helpfulness": 4, "user": "OffTheBeatenPath", "date": "November 2, 2008", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 21488821, "likes": {"liked": "— Location, decor", "disliked": "— nothing, really"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "First off: the location. It's on a quiet street that dead ends (for cars) right beyond the hotel, yet it is only a couple of blocks south of Karlova (the main drag between Old Town Square and the Charles Bridge). Almost all the tourist sites are within 15 minutes' walking distance (Strahov Monastery in 20 given the Charles Bridge bottleneck with the renovation). On the other hand, it is hidden away in a maze of small streets, and cabbies won't always know where it is (a cabbie from the airport had no problem as he had GPS; a cabbie from the train station had a long conference with his colleagues before starting). Once you're there, though, it's a great location.", "title": "Love everything about this place!!!", "helpfulness": 1, "user": "LilaSepang", "date": "November 2, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 21475593, "likes": {"liked": "— location and service", "disliked": "— no wifi.. but they soon will install it!!"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "Second: the service. We found the hotel to be efficiently (and unobtrusively) run. Breakfast each morning was quite sufficient. We had trouble with our shower (the hose came partially off and started leaking), and it was fixed the same morning, while we were out. We never had trouble finding someone in the office to help us between about 10 a.m. and 10 p.m.", "title": "Outstanding in Every Way!", "user": "CassMn", "date": "October 6, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 20676654, "likes": {"liked": "— Location, service, immaculate spacious room", "disliked": "— Hauling luggage up a flight of stairs"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "Third: the room. The website is representative, but I've included some pictures here. Nice exposed wooden beams give you the feel of staying in an historic building (which you are). The furniture is new IKEA, chosen by someone with taste (none of the more tacky IKEA stuff). The bathroom was reasonably spacious, with a shower that shut nicely and had good pressure, a toilet and sink.", "title": "Very accomadating staff, nice room", "user": "wxgirl13", "date": "September 9, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 19944394}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "We stayed at the Green Garland for two nights to tour Prague. Because it is in the heart of the old city, it is an excellent location and a very good value for the price. We were given a suite which was very spacious and although not luxorious it was comfortable. The staff was very helpful. We were catching the night train when we left and we had to check out of our room but they welcomed us to use their lounge and bathroom for the rest of the day until our train left. They stored our luggage and called a cab and could not have been more helpful.", "title": "Excellent value for center city", "user": "Robbed_John", "date": "September 25, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 3.0}, "id": 44557798}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "i booked this trip as a surprise for my fiances 30th and it was well worth it! We thought Prague was amazing and will definately be returning! The hotel was great - the location could not have been better! It was so close to the Old Town Square yet on a very quiet pedestrian street so we did not get any noise. We stayed in a twin room for the first night then a suite for the next 4, which was worth the small price in crease as it was pretty big. The staff were lovely and gave us some really good tips on places to go a bit away from the tourists. The hotel was very clean and the breakfast was fine - although my boyfriend did miss his fry up!! There is a great pub on the corner of the street and a fab ice cream parlour near to that. I would recommend this hotel and would go back to it. Very good value for money, especialy considering the location", "title": "great hotel in fantastic location", "user": "kazpod", "date": "September 25, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 44475601}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "Great location but assure that you go when it's cool as they have no air conditioning. We are from Florida and it was 84 in Prague in September. The 1st two nights we had a big room on the back side that had 4 windows so we got some cross breeze. Unfortunately we had to move to the top floor to a small room with only one window facing the street. There is a bar on the ground floor next door so it was midnight before we could go to sleep, as it was too hot to close the one window. With the window closed, you could not hear the noise, so a cooler time of year would be appropriate.", "title": "Great Location but don't go in the summer time", "helpfulness": 1, "user": "TobyDogOrlando", "date": "September 18, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 42670167}, {"rating": 5.0, "stay_parameters": "Stayed July 2009", "text": "Also, if you have any trouble with stairs, there are a bunch of them.", "title": "Great stay - definitely recommend", "user": "jim4119", "date": "September 12, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 41176402}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "It was my first time in Prague and we absolutely loved it - and this hotel contributed a lot. The booking was easy and they were more than happy to help with my questions. We stayed in a triple room and it was so big and clean, it was just perfect for us to rewind after our busy tourist days.", "title": "Very quiet in a fantastic location", "user": "nsl_mp", "date": "August 23, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 38568031}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "I do not normally write reviews for hotels, restaurants or the like; but in this case I'll make an exception. I found this little pension to be an oasis in the middle of a big city. The room was absolutely pristine and the staff were a pleasant change from so many of the other establishments in Prague. I would recommend the Green Garland to anyone wanting to visit the beautiful capital city of the Czech Republic.", "title": "Location couldn't be more perfect", "helpfulness": 2, "user": "mbfl", "date": "June 18, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 17017147, "likes": {"liked": "— The execllent staff", "disliked": "— I couldn't stay longer"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled with family", "text": "The double room my sister and I shared was spotlessly clean and quiet. The staff were very welcoming and helped up with all our questions and requests quickly and thoroughly. It's location in the heart of downtown was great; we walked everywhere and it was nice to have cafes and shops close by. I would happily recommend this small hotel to other travellers.", "title": "Excellent hotel", "helpfulness": 1, "user": "allerParis", "date": "June 17, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 16993901, "likes": {"liked": "— quiet rooms, very clean, very friendly staff", "disliked": "— some stairs, but staff is very willing to help with luggage."}}, {"rating": 4.0, "title": "Perfect Location, I needed more space!", "text": "We stayed in a double room at the Green Garland for two nights in April 2008. The location, breakfast, staff and service are hard to beat. In fact, you get a quiet street in what would otherwise be a very noisy part of the city. I thoroughly agree with other respondents on this board.", "helpfulness": 1, "user": "csh90069", "date": "May 14, 2008", "id": 16046028}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled with family", "text": "However, our double room and shower were very, very cramped. We aren't very big, and we noticed a number of larger people at breakfast. I don't know how they showered or navigated around each other in their rooms. But I understand that the hotel has larger double rooms. If you have any doubts, I recommend booking the larger double if possible.", "title": "A Great Find!", "helpfulness": 1, "user": "jebroome", "date": "May 1, 2008", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 15548037, "likes": {"liked": "— location"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "Of the three hotels we booked on our trip, this one was the most expensive and it had the smallest room. However, Prague has become very expensive, so it is to be expected.", "title": "Excellent Place to Stay", "user": "Paddy60", "date": "April 26, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 15386860, "likes": {"liked": "— location", "disliked": "— The stairs wouldn't be suitable for older people of people with disabilities"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "This is a perfect place to stay to explore Pargue. Situated a few minutes walk from Charles Bridge and the Old Town square there are lots of eating places round about. You can easily walk to the other sites like Wenseclas Square and Prague Castle so no need to catch trams or the Metor unless you want the experience. The hotel is small, intimate, secure and so very clean and the staff are so friendly and helpful. We enjoyed breakfast in the spacious and airy breakfast room and because it is at the bottom of a street which cars cannot drive through it was very quiet at nights.", "title": "Perfect in every way", "user": "sanuk_9", "date": "July 20, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 35231054}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled solo", "text": "I thought I had already written a review for this place but it is not among my contributions so I wanted to make sure that it would be represented here. I stayed here 2 times in the past few years and had amazing service both times. I am going to Europe again in July/August 09 and hope to stay here during my 5-week trip. I am all about location and this place cannot be beat. My second most important thing is cleanliness and this place was spotless both times. The owner's are pleasant and helpful and when I contacted them this spring, they remembered me because I stayed with them for 12 days on my first trip and most people don't stay there that long. Their prices have not gone up a lot even though their popularity seems to have risen with all of the good reviews on tripadvisor. It's the best place to stay in Old Town Prague...", "title": "The Best Place in Old Town...", "helpfulness": 1, "user": "kobekeith", "date": "July 14, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 34787678}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled with family", "text": "Green Garland was beyond wonderful. The location is superb--near everything right in the center, but on a beautiful small street, complete with a lovely cafe or two. The rooms and baths are just beautiful--simple, elegant, pretty, comfortable. We were 1 couple with a double room, plus one mother and teen-age son in a twin room: both rooms were lovely and there was also the sweet sitting room just outside our doors. The staff was very kind and helpful; check-in and check-out were easy. I hope to stay here every time I come to Prague.", "title": "The very best place to stay in Prague", "user": "MonkeybearNYC", "date": "July 8, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 34244706}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled solo", "text": "I just returned from 7 nights in Prague, staying at the Green Garland Pension. Great location, 413 steps from the Old Town Square. Building is on a narrow, one way, dead end street, thus, very quiet. Staff(Jana, Pavel, Martinea and Alice) were VERY helpful. I could not find a tour to Cesky Krumlov, but Pavel was able to find one for me. A must tour if you have a day to spare. Room was very secure as it took three keys to be able to get into my room. Breakfast was also excellent. I would rate this pension as a ***** plus.", "title": "Great Place to stay in Prague", "helpfulness": 2, "user": "ztiger", "date": "March 31, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 27176335}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "My husband and I read the great reviews of U Zeleneho Vence and had high expectations. We were not disappointed. It is on a very quiet, dead-end street right in the middle of Prague. The staff could not have been more helpful, and there was a nice tourist guide in our room. Our room was large and immaculate. In spite of misty, cold weather, we had a wonderful visit.", "title": "Quiet B&B Right in the Middle of Prague", "helpfulness": 1, "user": "JanV8", "date": "November 22, 2008", "detail_rating": {"cleanliness": 5.0, "front_desk": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 22090223, "likes": {"liked": "— Proximity to local attractions", "disliked": "— Not suitable for people who can't use stairs"}}], "location": {"country": "Czech Republic", "region": "Bohemia", "continent": "Europe", "city": "Prague"}, "stars": 2.5, "variance": {"poor": 2, "average": 8, "very good": 51, "terrible": 0, "excellent": 130}, "aka": "b&b u Zeleneho Vence (Green Garland) Hotel Prague", "slim_ranking": 0.0495867768595}