{"user_rating": 5.0, "review_count": 386, "name": "B&W Courtyards", "reviews": [{"rating": 5.0, "title": "Excellent, Romantic", "text": "The B&W was so enchanting and pretty. I loved the fountains and plantings outside of each room. It's the perfect romantic getaway. The room we stayed in, the back carriage house, was cozy and nicely appointed. The king-sized bed had such soft linens. Also loved the hot tub that is in the courtyard. Rob and Kevin were very friendly and helpful with suggestions on where to go in New Orleans.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "February 19, 2005", "id": 3210839}, {"rating": 5.0, "title": "B&W Courtyards-You Can't Miss It!", "text": "This little B&B located near the French Quarter in New Orleans is one of the most interesting Bed & Breakfast Inns that you will find. The hosts, Kevin and Rob are very gracious and intertaining. They make you feel like an honored guest in their home from the time they meet you at their front door step until you depart. Taxi and limo service was taken care of well in advance of our arrival, dinner destinations were planned down to the smallest detail and lots of information about the city was shared before we set out to learn about New Orleans. We will return!", "helpfulness": 1, "user": "A TripAdvisor user", "date": "February 18, 2005", "id": 3209408}, {"rating": 5.0, "title": "An experience worth repeating!", "text": "Jim and Jeanie Green", "helpfulness": 1, "user": "KrisyMinneapolis_MN", "date": "January 25, 2005", "id": 3086465}, {"rating": 5.0, "title": "Brilliant! Famous! Wonderful!", "text": "Rob and Kevin excel at being gracious, attentive and amusing. Sitting around the dining room table in the morning, we felt like we were hanging out with old friends. This is NOT your sterile Hilton experience!", "helpfulness": 1, "user": "A TripAdvisor user", "date": "January 24, 2005", "id": 3073048}, {"rating": 5.0, "title": "Awesome Place to Stay!", "text": "Spending time in NOLA has never been better at B & W Courtyards. The hosts - Rob and Kevin are entertaining, informative, opinionated and never wrong! We never felt alone or like a tourist with their superb guidance. The rooms are fabulous, the breakfast is not to be missed (not just because of the food, but because of the advice and laughter!) and the location is superb. Less than 9 minutes away from the heart of the Quarter - we walked everywhere. The neighborhood the b & b is located in has its fair share of attractions - including great jazz, wonderful blues, excellent local restaraunts and far-out people and architecture. PLUS, there is a small grocery near by where you can purchase all that coffee and beignet mix you want to take home for 1/2 the price! Don't miss this place.", "user": "A TripAdvisor user", "date": "January 18, 2005", "id": 3015022}, {"rating": 5.0, "stay_parameters": "Stayed March 2005", "text": "This was our first visit to New Orleans and B & W Courtyards. I can't imagine the one without the other. B & W will be the only place that we will stay while in NOLA. Rob and Kevin are outstanding hosts. They guided us to the best restaurants, music venues, and attractions. Their suggestions were always right on. I can't wait to go back.", "title": "Our New Favorite Place!", "helpfulness": 1, "user": "tlegray", "date": "March 8, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 3259311}, {"rating": 2.0, "title": "Disappointing", "text": "NOTE: If you plan on staying at B & W do make sure to linger at breakfast, it was one of the highlights of our trip.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "March 7, 2005", "id": 3257126}, {"rating": 5.0, "title": "Truly outstanding accommodations", "text": "We chose B&W Courtyards based on all the reviews here. This is the third B&B we had tried in different places while traveling. IMO, it's the least to our like.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "March 3, 2005", "id": 3250265}, {"rating": 5.0, "title": "Can't wait to go back!", "text": "One, we stayed in the Chery Bloosom room, the owner told us it's going to be noisy at breakfast time which didn't bother us since we are early risers. And the breakfast won't be until 8:30. But we started to hear the kitchen noice at 6:30 AM which was totally didn't explained to us.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "March 3, 2005", "id": 3244589}, {"rating": 5.0, "title": "It's a hidden gem!", "text": "Two, the room is VERY small to us.", "helpfulness": 1, "user": "DowneyTraveler", "date": "March 2, 2005", "id": 3240803}, {"rating": 5.0, "title": "Best New Orleans Trip Ever", "text": "WOW- we were traveling to New Orleans on both business and pleasure and we had a fabulous time thanks to our stay at the B and W. Staying there meant having a real New Orleans experience and finding out the places that the locals frequent was a true plus. We even had friends that were looking for a place to stay get a room at the B and W and they had a blast too. This is the place to stay in New Orleans.", "user": "A TripAdvisor user", "date": "January 14, 2005", "id": 3006567}, {"rating": 5.0, "title": "Absolutely Fabulous!!!", "text": "Loaded with character, and southern hospitality, it doesn't get any better than the B&W Courtyards. Enchanting courtyard gardens. Beautiful furnishings. Comfy,comfy beds. A thick fluffy robe to wrap up in after a soak in the Jacuzzi. Complementary sherry. Great location- walk everywhere, but peace and quiet when you need it. I could go on and on. Best of all, the proprietors, Rob & Kevin- full of information and advice on how to make the most of your time in their funky town, and their hilarious breakfast conversations are priceless. I highly recommend the B & W Courtyards- I can't wait to return!!", "helpfulness": 4, "user": "dbinsb", "date": "December 30, 2004", "id": 2965746}, {"rating": 5.0, "title": "just the best!", "text": "My husband and I are pretty well-travelled, and stay in B&Bs whenever possible. WELL. Let me tell you, this one blew us away! We had the privilege of staying for seven nights in the Barbados Suite, a smartly decorated, private and totally comfortable little cottage situated behind the main house and adjacent to the gorgeous patio, lush with greenery and fountains. Oh yes, heaven!! It was hard to leave. The location is perfect, adjacent to the very happening Frenchmen Street scene and a block beyond to the French Quarter. Rob and Kevin are perfect hosts, always at the ready with entertaining breakfast banter, and recommendations for a day well spent. Do not pass this one up on your visit to New Orleans. Trust me, you'll regret it if you do.", "user": "A TripAdvisor user", "date": "December 8, 2004", "id": 2873323}, {"rating": 5.0, "stay_parameters": "Stayed December 2004", "text": "Just returned from the B & W Courtyards and this place has it all over any 5 star hotels in New Orleans.", "title": "THE place to stay in New Orleans!!", "helpfulness": 2, "user": "coachdog", "date": "December 7, 2004", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 2867883}, {"rating": 5.0, "title": "Oasis in the Hectic Fun", "text": "The hosts Rob and Kevin are the best! Before we even arrived we received a welcome letter with a list of things to do and restaurants they recommend. This was a great start to our trip and they were right on with everything listed! There are so many fantastic restaurants and many wonderful things to do. It made our short time there much better by having this list to help us narrow things down. There are still many things we didn’t see or do, but that’s a great reason for a return visit!", "user": "portlanddon", "date": "December 6, 2004", "id": 2865823}, {"rating": 5.0, "title": "Can't Wait to Go Back!", "text": "It took me 50 years to get to New Orleans for the first time and, now that I have stayed with Rob and Kevin, I am itching for an excuse to get back to New Orleans ASAP! Their hospitality was spectacular and they made us feel just like we were family! My husband and I walked everywhere around the city and found the location of B & W Courtyards to be ideal; far enough away from the frat boy hubbub of the heart of the French Quarter, yet close enough to access all the sights on foot. Kevin and Rob dispensed excellent restaurant, shopping and travel advice and the morning breakfast table banter was hilarious! Rob and Kevin love their business and it shows.", "user": "Dabney M", "date": "March 1, 2005", "id": 3238763}, {"rating": 5.0, "title": "B&W - best stay in New Orleans", "text": "My wife and I just returned from our 3-night stay at B&W Courtyard-", "user": "A TripAdvisor user", "date": "March 1, 2005", "id": 3238500}, {"rating": 5.0, "title": "Exceptionally Unique", "text": "We can't say enough about how great this place is- it's a total escape-", "helpfulness": 3, "user": "A TripAdvisor user", "date": "February 23, 2005", "id": 3224559}, {"rating": 5.0, "stay_parameters": "Stayed February 2005", "text": "When we arrived at the N.O. airport I called Rob, as requested and Cate (my wife) asked me what I was doing- I replied that they had asked for a call when we landed-", "title": "Great time at B&W", "user": "mctavish", "date": "February 22, 2005", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "service": 5.0}, "id": 3216927}, {"rating": 5.0, "title": "Great B&B", "text": "We found out why when we rode up to the B&B, as Rob & Kevin came out to greet us like family- we've never received a greeting close to that anywhere and we stay at B&B's and inn's a lot-", "user": "A TripAdvisor user", "date": "February 22, 2005", "id": 3216804}], "location": {"country": "United States", "city": "New Orleans"}, "variance": {"poor": 2, "average": 2, "very good": 11, "terrible": 2, "excellent": 369}, "aka": "b&w Courtyards Hotel New Orleans", "slim_ranking": 0.0402684563758, "description": "1854 Creole compound. Architectural award winner. 4 blocks from French Market. Featured in Travel & Leisure. A/C, phones, cable, private baths. Lush courtyards and ponds."}