{"user_rating": 4.5, "review_count": 207, "name": "Baan Sukhumvit Inn Soi 18", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "We had a lovely nights stay & from the moment we arrived had nothing but the perfect service.Perfectly located from the chaos of Bangkok which is a short distance away & all the advice on where to go is on hand.", "title": "Tranquilty within the chaos", "user": "EnglishR1", "date": "May 9, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 107484707}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled with friends", "text": "Our room was just how it was describled & has all the items one needs & our laundry was perfectly done & in a short time to along with our breakfast no complaints at all.", "title": "Great hotel - definitely stay again", "user": "Simon_Whelan", "date": "May 2, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 106448438}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "As for the chaos we refer to,this is the amount of traffic which is everywhere but in no means slows you down with shopping malls a plenty & everywhere we ate the food was class.", "title": "Perfect", "user": "PCTH_PhD", "date": "April 20, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 104799100}, {"rating": 4.0, "stay_parameters": "Stayed March 2011", "text": "Even our departure (taxi) was aided by our hosts who we kept in contact with for the remainder of our trip as he was equally as hospitable", "title": "Great spot for 2 days in Bangkok", "user": "Chicago_1521", "date": "April 5, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 102958661}, {"rating": 5.0, "stay_parameters": "Stayed March 2011", "text": "This is a lovely hotel - clean with smartly decorated rooms, comfy bed and a large bathroom. It has a safe, TV & DVDs and powerful aircon - your new best friend in the hot season. It's in a convenient area of town - lots of shopping nearby and handy for the skytrain. The staff are friendly and the Manager is excellent at helping you plan what to do / booking tickets etc. He is full of helpful advice about how to get around Bangkok and how to avoid being scammed etc.", "title": "Excellent", "user": "hh15302", "date": "March 25, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 101480783}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "My stay here was excellent and I can't fault anything about this very charming little hotel. I stayed a total of 5 nights on 3 separate occasions on my recent trip. Each time I came back, I felt like I was coming to my home away from home.", "title": "Quiet oasis, super clean, great breakfast, very friendly staff, fast wi-fi", "user": "jwobkk", "date": "March 14, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 100084932}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "Location is superb - right in the middle of the action on Sukhumvit as well as just a short walk to the Skytrain and MRT. Rooms are comfortable with good sized baths, comfortable beds (firm is good for me), classic Thai decor and lightning fast wi-fi. Sleep quality is excellent with no outside noise at all. This is a quiet oasis in the middle of the urban jumble. Breakfast is delicious and is not to be missed. I went with the Western option and found the eggs, sausage and baked beans to be the highlights. Service was super friendly and helpful.", "title": "a piece of tranquility in the middle of the city", "user": "michele_6169", "date": "March 12, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 99874736}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "Great stay here and I highly recommend it.", "title": "Nice place in Bangkok", "user": "fwmaur", "date": "March 10, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 99605326}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "Can not fault this hotel. Easy to get to from MRT Asok station..in the middle of a busy area but when you close the door it fades away and you are in a little oasis, We spent 2 nights at the beginning of our trip and then another 3 later and had 2 different rooms, both beautifully decorated and clean. Great value for money and freshly cooked breakfast in the morning:-) We will return on our next visit to Bangkok.", "title": "Great hotel: charming, clean and very quiet. We recommend it!", "user": "artzoyd", "date": "February 28, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 98334552}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "Nice place and nice people. We could only stay one night on our stop over from Krabi to Shanghai but we will surely come back. It was a nice room and quiet location in the hectic area of Bangkok. Thanks!", "title": "A home in Bangkok", "user": "travellerRona", "date": "February 18, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 97051223}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled with family", "text": "I reserved our two rooms on-line. Very nice place, a bit hidden down an alley, but, by carefully watching for signs I spotted it for the taxi driver. Our rooms were about $30 per night each, breakfast included. The rooms were spacious, clean, well appointed, nice bathrooms and great air conditioning. It was the weekend, so we left the hotel around 11 on Saturday and took the skytrain to the Chatuchat weekend market - Amazing and fun! That evening we met up with friends who live in Bangkok at the Siam Paragon mall food court. It's large, gourmet and casual, something for everyone. This was only two stops from the Inn. Our taxi driver returned for a 3:30am pick-up so we could catch our early flight back to the States. Great stay and I would recommend this place.", "title": "Nice little Inn. Close to rail system. Helpful staff.", "helpfulness": 1, "user": "Knows", "date": "July 1, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 114934316}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled with family", "text": "A very cozy,comfortable & convenient place to stay at. Our manager Thongbai was very sweet and helpful. All basic comforts were made available.Breakfast served to us was also simple,yet delicious. Convenience wise it was at a great location. Being really close to the marketplace, the eateries,shops and even the skytrain was at a walking distance.", "title": "An inexpensive,comfortable & convenient homestay!!", "user": "SargamHans", "date": "June 30, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 4.0, "service": 4.0}, "id": 114898748}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "WE really like this small hotel for its hospitality. Location is great. Very quiet in the nights. Rooms are very well decorated, spacious bathrooms. 2 minutes walk to skytrain station Asoke.", "title": "We love it", "user": "fedupi", "date": "June 27, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 114778384}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "Last year we stayed at the Baan Sukhumvit Soi 20 (they are both owned by the same people - as if you hadn't guessed), Soi 18 is slightly more upmarket but the welcome and standard of service were of equal quality. Kevin and his Thai wife maintain very high standards and both hotels are spotlessly clean, comfortable (hard beds but not a problem to me) and peaceful. The location just off Sukhumvit and about 400 metres from Asoke Skytrain and underground stations mean that you can get almost anywhere in BKK cheaply & quickly. Breakfasts are individually prepared and comprehensive as well as being tasty.", "title": "Little treasure with an ace location", "user": "Crowbait", "date": "June 13, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 113224361}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "We will certainly stay again next time we're in BKK and have no hesitation in recommending this hotel very highly", "title": "Modern Bangkok...", "user": "Grumblestar", "date": "May 16, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 108499334}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled with family", "text": "Really liked soi 18! The room we stayed in was on the smallish side but was fine with us. The portable cot they provided was great as was everything else such as personal service, expecting our arrival and overall very cosy where you feel at home. The only major issue was that the hot water in shower was very weak. I would definetly stay here if i can make it back to Bangkok!", "title": "A Hidden Gem", "helpfulness": 1, "user": "120speedracer", "date": "January 30, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 94900292}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "We stayed a total of 7 nights over the course of a month in Thailand. Initially we had only booked a few nights at the beginning of our trip, but saw no reason to stay elsewhere in Bangkok on our returns. Helpful staff willing to give lots of pointers around the city/country, rooms are very clean and comfy. Free wifi, breakfast made to your liking, on a quiet side-street in the heart of Bangkok.", "title": "Quiet Haven", "helpfulness": 1, "user": "luckyman21", "date": "January 29, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 94861849}, {"rating": 4.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "This small hotel offers good value in the heart of Bangkok; spacious, clean rooms and bathrooms with TV programs in English. The staff are very friendly and helpful. Real Italian coffee is served at breakfast (choice of cooked or continental). There were, however, two downsides for me personally: a) the mattresses in our room were decidedly too firm for my taste b) the view was of a multi-storey parking lot and a big satellite dish, both about 4/5 meters away! We felt all the car owners could see into our room. OK, so they´re probably not really interested, but some net curtains would certainly help!!", "title": "Very good place to stay", "helpfulness": 1, "user": "IgelEye", "date": "January 25, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 94394678}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "This small hotel and staff are wonderful. If you want a big hotel with a hundred rooms, a pool, and room service meals, etc., this is not for you. If you want charm and quality at a fair price than this is the place. The rooms are good size with everything well placed. Bathroom is large. Location is great as the Skytrain and the Underground are close by. The advice Thongbai gave us was instrumental in our having such a good time. Bangkok can be daunting due to the size and congestion but this is an oasis in the midst of the chaos. We will return. There's a very good restaurant and spa down the road called the Lean on Tree. Another plus because there are plenty of tourist places and grand hotels in the area.", "title": "Will Return again", "user": "getgs", "date": "January 23, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 94122500}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "We enjoyed our stay at the Baan Sukhumvit Soi 18 and definitely recommend it as a great place to stay. This Boutique Inn is is a haven away from the busy streets of Bangkok. The advice from Kevin and the team was terrific, nothing was a problem, breakfast was great and the complimentary use of the computer/internet an added bonus.", "title": "GREAT LOCATION - EXCELLENT CUSTOMER SERVICE", "user": "OnnieMc", "date": "January 18, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 93515104}], "location": {"country": "Thailand", "continent": "Asia"}, "variance": {"poor": 0, "average": 3, "very good": 52, "terrible": 1, "excellent": 151}, "aka": "Baan Sukhumvit Inn Soi 18 Hotel", "slim_ranking": 0.0237529691211, "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "Following the success of Baan Sukhumvit Soi 20, and located on the same style quiet side street yet still only four minutes walk from Asok Skytrain, Baan Sukhumvit Soi 18 has all the trade mark features of Soi 20 but with larger rooms equipped to a higher standard with beautiful walk in style showers, free WiFi and Lan line for your laptop in every room together with a lovely relaxing roof top garden."}