{"user_rating": 4.0, "review_count": 1028, "name": "Bacara Resort & Spa", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "The week after the '08 Labor Day weekend at BACARA is mostly deserted. This makes for a very serene, quiet atmosphere. Very spa like. The property is beautiful and if you love white washed spanish / mediterranean architecture and decor , then this place is for you.", "title": "in my opinion....", "user": "ArkansasSmf", "date": "September 4, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 3.0, "location": 4.0}, "id": 19759048, "likes": {"liked": "— architecture, the grounds", "disliked": "— room furnishings"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "Service has been impeccable. Very personal. Of course, I can not attest to how this would be if the property was heavily populated.", "title": "Loved the Bacara", "user": "littletree", "date": "September 3, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 19710043}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "The accomodations tho, are not my favorite. We stayed in a Ocean View Suite at 1700.00 per night. Very spacious but underfurnished. And the furnishings that are here seem mismatched and a bit beat up. The suite to which I refer is two rooms, bedrrom with separate living area. The bedroom contained king bed, with two raher hard provincial chairs at the foot of it. Beyond that is a small sitting area with a firplace and t", "title": "One of the best five-star hotels I have stayed in", "helpfulness": 1, "user": "w0rkingm0m", "date": "September 2, 2008", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 19679745, "likes": {"liked": "— the room"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "TVarmoire. Stuck in front of the fireplace was a large coffee table. So.........in this big spacious room, there was no cozy place to curl up in front of the fireplace. The separate LR was even more strangely furnished. Sofa bed shoved up in a corner, not facing the TV armoire. Desk in another corner with a small uncomfortable wicker / rattan chair. The only internet connection is in this room. None in the bedroom which can be locked off from the living area and rented separately I suppose. And there is no Wi-Fi.", "title": "Great weekend getaway", "user": "IWC", "date": "September 1, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 19626902, "likes": {"liked": "— Variety of activities; things to do", "disliked": "— all the dogs and golf carts"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "All in all, things seem a bit old tho well maintained and very clean. The age of the room is evident in the large tube TV's and the condition of the furnishings. Also, the A/C thermostat on the wall seems to be more of a decor item than that of a functioning controller. While we were there, the temps were in the 70's and opening the windows cooled things off well enough.. But if temps were warmer I would say the room temps would not be pleasant. Even tho the weather was cool whle we were there, ti was damp and muggy and it would have been nice to have been able to pull the humidity out of the room.", "title": "Loved Bacara Resort", "user": "Coach_Class", "date": "September 1, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 19617493, "likes": {"liked": "— beautiful room, great ocean views, fantastic bed", "disliked": "— restaurant, expensive spa treatments and fitness classes"}}, {"rating": 4.0, "title": "Relaxing, excluding pool area", "text": "This resort is gorgeous and rooms are very peaceful- great landscaping and layout of buildings. Service was very good- the majority of the front desk staff are college students but all very professional and courteous. Request a third level floor- for views and also all the rooms have tile so I would imagine you can hear people walking around above you. Ate at Miro and also oredered room service- food is not outstanding but fine- insane surcharges for room service -but that is what you are here for.", "helpfulness": 4, "user": "larkoolaw", "date": "August 3, 2005", "id": 3733891}, {"rating": 4.0, "title": "Our new Favorite Place!", "text": "The only complaint I have are the pool areas. The main pool overlooking the ocean is really pretty but overrun by children ( avoid this by going during the week). The area where you can rent cabanas is nice also but again that area is not off limits to children. Obviously, kids will be noisy and loud in a pool area but for the price you pay for the cabanas you should not have to listen to noisy kids all day. There is an adults only pool near the spa but this pool is not as pretty or relaxing- it has a huge metal gate around it- like an apt complex pool. Plus, there is no greenery around this pool and no cabanas- the other one is much nicer to lounge near.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "July 26, 2005", "id": 3701138}, {"rating": 5.0, "title": "Amazing resort - 6 stars", "text": "The beach is really not very pretty- not a groomed beach- saw some tar but not much- I would not swim in the water. The grounds of the hotel are very nice- good sidetrips are the wineries in Los Olivos and Santa Ynez- also shopping on State Street in SBarbara is fun.", "helpfulness": 9, "user": "kaceevh", "date": "July 19, 2005", "id": 3680698}, {"rating": 5.0, "title": "Absolutely fabulous!!!!!!", "text": "The Bacara Resort has become our new favorite place. As an executive couple getting away for romance and R&R, the Bacara couldnt have been better. We had a first floor room the first night, and a third floor room when available the other three nights. The views from the balcony were wonderful, and the ambiance was quite and relaxing. The beds and linens are comfortable and luxurious. We live in a 3 M dollar home, so luxury and quality are important to our comfort. The pool areas, spa, and gym were great, as was the attentive staff. The food was great, yet a bit pricey. We would enjoy a small place to grab a bite of \"real food\" during the day instead of all the fancy stacked food.", "helpfulness": 8, "user": "A TripAdvisor user", "date": "July 7, 2005", "id": 3644937}, {"rating": 3.0, "title": "More hype and not enough substance", "text": "The place was empty while we were there, yet sold out the night we left. We would highly recommend it as an upscale retreat.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "July 5, 2005", "id": 3638702}, {"rating": 1.0, "title": "Too much for too little", "text": "We had been looking forward to our stay at Bacara Resort & Spa in Santa Barbara. We felt with the research my husband did on the property we had picked a winner, unfortunately it was a huge dissapointment. The service levels are equal to a 1-2 star category, the property is in needs of repair and looks very uncared for. We encountered things such as very stained floors, carpets and cracked walls which you don't expect to see in a high end property. Our check-in experience was disastrous with a very long line and employees that acted and looked as if they where doing you a favor by even saying Good Afternoon. Our Spa experience, which was supposed to be the highlight of our stay was very negative; starting with one of our appointments not found, even though we had print out confirmations in our hands. The locker areas where very unclean and full of dirty linen and you could not find an employee anywhere, the Fitness person was on the telephone on a personal call and completely ignored us as we are trying to figure out how to navigate the equipment and where to go for our class. In essence we would never go back nor would we recommend it to anyone...to save the trip my husband booked a last night at the fabulous Four Seasons Hotel in Santa Barbara, which we will write a separate five star review for. Bacara Resort could learn a thing or two from Four Seasons.", "helpfulness": 12, "user": "spaiing", "date": "May 3, 2005", "id": 3434324}, {"rating": 5.0, "title": "Heaven on Earth", "text": "We arrived at Bacara a few days before a work function commenced. The property is lovely, comfortable and casual. We found the staff to be very attentive and very helpful. In reading other reviews, I would agree the staff is very young but we only saw professionalism. Although much of the staff is students, they were polite, had very good manners and could carry on a very intelligent conversation. Great property for relaxing at the spa and pools, playing golf, tennis, reading and napping. The food was wonderful, including the dinner for 350-400 people. Lots to do in Santa Barbara which is only about 10 minutes south of the resort. We found the resort to be very child friendly as long as the parents were responsible for the behavior of the kids. Loved the showerand missed it at the next hotel. Although a litte spendy, we will definately be back.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "April 14, 2005", "id": 3357231}, {"rating": 2.0, "title": "Unexpected charges", "text": "We asked for a courtesy car to pick us up and return us to the airport. We specifically asked the driver how much the charge would be and he said \"nothing\".", "helpfulness": 13, "user": "A TripAdvisor user", "date": "March 20, 2005", "id": 3288680}, {"rating": 2.0, "title": "Not as great as we expected", "text": "We were shocked to see a $275 charge for the pick up and $85 charge for return on our credit card bill. Keep in mind the hotel is about 10-15 minutes from the airport.", "helpfulness": 10, "user": "A TripAdvisor user", "date": "March 7, 2005", "id": 3256798}, {"rating": 4.0, "stay_parameters": "Stayed January 2005", "text": "Hotel manager Donald Reardon refused to waive the fee, after we spent $500 for a room and several hundred more on food, drinks and gifts.", "title": "A very enjoyable stay", "helpfulness": 4, "user": "Michaela", "date": "February 1, 2005", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 5.0, "service": 4.0}, "id": 3106054}, {"rating": 5.0, "title": "Wow!", "text": "Well having spent several nights in mediocre motels whilst travelling around our arrival at Bacara blew our minds! We arrived 3 hours before check in and yet were shown straight to our room. This was spacious and beautifully decorated. We didn't have a sea view but as we were only there one night it didn't really matter. Service was great. The food was great. The spa and massage was fantastic. The pool was very busy but we were there peak season.", "helpfulness": 6, "user": "sjwoolnough", "date": "August 20, 2005", "id": 3791576}, {"rating": 5.0, "title": "Can't wait to return", "text": "The beach was a little disappointing. There were no loungers or any services provided by the hotel despite a big building down on the beach. All we could find were toilets but maybe we were just being a bit thick about how everything worked.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "August 15, 2005", "id": 3766553}, {"rating": 5.0, "stay_parameters": "Stayed August 2005", "text": "We even got a late checkout and I would definitely return if I am ever in that area again.", "title": "Love Bacara", "helpfulness": 4, "user": "paulasullivansilver", "date": "August 13, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3759786}, {"rating": 4.0, "stay_parameters": "Stayed August 2005", "text": "Perfect place to get away from hectic work lifestyles and find inner peace. The resort is also ideal for families who want to have a relaxing vacation together. The service is excellent; of the highest quality. The staff is always looking for ways to improve your visit. For instance, while dining at the Bistro on the patio overlooking the ocean the staff would look for ways to better position the heating lamps near your table for maximum comfort.", "title": "Great if you don't need quick access to town", "helpfulness": 9, "user": "3boysnme", "date": "August 12, 2005", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "service": 4.0}, "id": 3757626}, {"rating": 2.0, "title": "Agree with last person who posted as well as most posts on here", "text": "We can't wait to go back.", "helpfulness": 10, "user": "Grohe", "date": "August 11, 2005", "id": 3755718}, {"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "We stayed at the Bacara for the weekend, living in LA it is always an easy getaway. I was prompted to post a review after reading the negativity... The hotel is GREAT! Well maintained and the staff is used to dealing with guests that expect a \"catered experience\". We are BIG travelers and have stayed at many of the finest hotels in the world, and have always had a nice experience at the Bacara. The rooms are very clean, well appointed and unique, they don't feel like typical hotels rooms, as there are different room configurations and many buildings on sight. So there are no long indoor hallways, the individual buildings give a more intimate experience. The pool is pretty, and the view down the coast is relaxing. The only negative I would have is that the Bacara is a bit pricey, but not ridiculous if you are used to staying (and eating) at better hotels. And, if you are looking for a TRUE beach experience, the Bacara sits up on a bluff and the beach isn't that beautiful. But, none of the hotels in that area sit on the beach... I have stayed at the Four Seasons Biltmore, and their beach is across the street and not that beautiful either (a narrow strip of beach, nice for walking like the Bacara). The Bacara offers beach services and the Biltmore does not. Also, if memory serves me one cannot view the beach/ocean from the pool and very few of their rooms are ocean view. I also felt our food bill was probably 20% higher than your usual high end resort, although the food and service were very good. I felt the additional $150. for the weekend wasn't a big deal if one can afford the room rate. I don't know what the other posters are complaining about... maybe they are not used to high end resort prices? If you visit the area, I suggest eating outside at the San Yisdro Ranch, it was FANTASTIC. So charming and beautiful... we could have been anywhere... that was a real escape! Price shoppers beware... the ranch was expensive, but well worth it! The ranch has the Hotel Bel Air vibe, but more rustic.", "title": "weekend getaway", "user": "turbos", "date": "July 26, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 3.0}, "id": 18281232, "likes": {"liked": "— The hotel room, and on sight falcon trainer.", "disliked": "— nothing really?"}}, {"rating": 1.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "Unfortunately, this is not a luxury resort. It is a tourist trap! I stayed there for the 4th of July weekend and for the basic rate they charged for the room (over $800), it would not rate better than a two star hotel chain for $99. The service quality is barely adequate, with staff clumsily trained to upsell every kind of possible service. They were nice and courteous but more attuned to a Ramada Inn than a \"luxury hotel\".", "title": "the only luxury part of this hotel is its website", "helpfulness": 3, "user": "thorgal2060", "date": "July 7, 2008", "detail_rating": {"front_desk": 2.0, "service": 2.0, "cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "location": 2.0}, "id": 17630087}, {"rating": 1.0, "title": "I'll stay at the Bates Motel before i'd ever come back to Bacara", "text": "They will charge you for the air you breathe if they could during your stay. I don't mind paying for quality but when i feel that someone is trying to rip me off then it's a whole different matter and especially ruins my vacation. For example, the room service charges you 20% gratuity and a $5 delivery fee!!! the parking costs $24 a night and during our stay, the fires nearby sprinkled ash all over our car (no covered parking). The car was white with ash and they did not have the courtesy to discount the parking.", "helpfulness": 5, "user": "josephpwillis", "date": "June 21, 2008", "id": 17096551}, {"rating": 2.0, "stay_parameters": "Stayed May 2008", "text": "But the worst part of the experience was the rash i got from being in one of the jacuzzis in the hotel. I went to see my dermatologist after my stay and he recommended that I contact the hotel to notify them of the potential health hazard. I spoke to a manager who nonchalantly put me on hold to talk to his head of security because he couldn't be bothered to take notes. This is not only a lack of professionalism but also a lack of concern for their guests. A total disgrace for a hotel who dares to call itself \"luxury\".", "title": "Below Par and at times aggravating", "helpfulness": 3, "user": "sean49", "date": "June 10, 2008", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 2.0, "location": 4.0, "rooms": 2.0}, "id": 16837204, "likes": {"liked": "— Location and views", "disliked": "— Front desk manger RP, Bed , no or little AC , spiderwebs in room and malfuntioning toilet"}}, {"rating": 2.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "Me and my girlfriend decided to try out Bacara as we saw it featured on a program on the travel channel. We thought it would be a once in a lifetime experience. I have to say it was- for all the wrong reasons. First off, the property is located in a no man's land about 25 minutes from Santa Barbara. Secondly, after we arrived we had to wait for a hell of a long time to get checked in. Why, I don't know because there wasn't a whole lot of people in front of us. I did notice off to the side of us, a manager or somebody with some authority was giving an employee the third degree for something or the other. the poor kid looked ready to cry. I can't imagine dressing down someone right in front of your guests. Classless and tacky to say the least. our room was a huge dissapointment. For the price you pay, you expect something better than what you could find at any Ramada Inn. The walls are terrible. It's easy to hear everything going on in the next room. Also the food was mediocre at best and way way overpriced. The views are great if you like staring at rooftops. The beach was horrible. There was oil or some substance everywhere. I guess it's no coincidence that you never saw anyone swimming there. Also it's not very pleasant to try to take a walk on the property and be nearly run over by golf carts. I have to say that while some of the bell/valet staff seemed good, most of these guys look like they spend most of their time watching Beavis and Butthead. I presume they're college students. Probably not the best group to handle chores for a supposed five star resort. All in all this place was a huge dissapointment. You're paying a hell of a lot of money for not much. If you like lousy rooms with thin walls and walking on filthy beaches and seemingly not very nice management, then this is your place. If you're looking for a true five star resort in Santa Barbara, try some other place. Staying at Bacara is like flushing your money down a toilet.", "title": "Not worth the price! Looks like they need some help?", "helpfulness": 1, "user": "Nokidshavetwolabs", "date": "May 29, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 2.0, "cleanliness": 5.0, "value": 3.0, "location": 5.0, "rooms": 5.0}, "id": 16489447, "likes": {"liked": "— Location and clean", "disliked": "— Staff"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2006, traveled on business", "text": "Stayed here with my husband while on a business function being held at the hotel. The conference/meeting/ball rooms were nice and the audio/visual coordinators helpful.", "title": "Nice, but it didn't wow me", "user": "LuvSLO", "date": "April 8, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 4.0, "service": 5.0, "rooms": 3.0}, "id": 27676726}, {"rating": 4.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "Although the property is nice, I would never spend my own money to stay here. The grounds are nicely maintained but I found them to be boring. They feature rolling grassy lawns and sidewalks/golf cart paths (this is the primary mode of transportation around the property) but that's pretty much it. I found the landscaping reminiscent of that in housing tracts in Southern California and because this is where I am from and what I am accustomed to, I wasn't wowed by the grounds. That being said, I think the meeting attendees from back East really enjoyed their stay.", "title": "Superb service - but you know you're paying for it", "user": "JonnyHei", "date": "March 2, 2009", "detail_rating": {"cleanliness": 5.0, "value": 2.0, "location": 4.0, "service": 5.0, "rooms": 3.0}, "id": 25432376}, {"rating": 3.0, "stay_parameters": "Stayed February 2009, traveled with friends", "text": "The rooms were not as spectacular as I thought they were going to be. Although they are unique in that they have tile floors, I think most people would prefer carpeting. The bathroom was large and luxurious and offered nice bath products.", "title": "Not worth the money!!", "helpfulness": 1, "user": "Schlockette", "date": "February 19, 2009", "detail_rating": {"cleanliness": 5.0, "value": 2.0, "location": 3.0, "service": 2.0, "rooms": 2.0}, "id": 24769594}, {"rating": 5.0, "stay_parameters": "Stayed January 2009, traveled as a couple", "text": "The staff was wonderful and top notch, which is of course why this place costs so much.", "title": "Great Getaway-Wonderful Resort", "helpfulness": 1, "user": "Lisa M", "date": "January 25, 2009", "detail_rating": {"front_desk": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 23901584, "likes": {"liked": "— beautiful grounds, views, nice rooms", "disliked": "— can't think of anything"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2008, traveled with family", "text": "This was our second trip to Bacara, the first was about 5 years ago. This time, we booked via AmEx PTS and were hoping for a room upgrade upon check-in. Despite the hotel being a literal ghost town, we were simply offered a \"refurbished,\" room at our original partial ocean view level. The room had obviously been recently redone and was in excellent condition, however it wasn't as spacious as I'd expect for the price ($750/night in Feb!). Like the room, the bathroom was a little cramped with only one sink; they do offer a nice shower, enclosed WC and soaking tub though. The hotel itself feels very modern and clean and the free WiFi somewhat made up for the room value. :) Service was spectacular, if not slightly overbearing. The Bistro and bar food was as good as any hotel I've stayed at. Bacara does have tennis courts and an adjacent golf course, we didn't use either but there's a nice walking path which meanders down to the beach. There isn't much immediately around the hotel, you'll have to drive to Santa Barbara (~15 min) for good eats. In SB, we found Seagrass and Arigato Sushi to be delightful.", "title": "Wow - we LOVED this place!", "helpfulness": 1, "user": "SpaJunky", "date": "January 3, 2009", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 23234526, "likes": {"liked": "— Beauty of the property", "disliked": "— Cost of Spa services"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2005", "text": "We enjoyed a relaxing one-night stay in Bacara on our way home from Disneyland in June. The grounds, service, and food were excellent. The rooms were nicely appointed but small. The first room they offered us did not have a bathtub which was unacceptable since we were traveling with a 2 year-old and 6 year-old. They relocated us to a nicer room with a seperate tub but it was still cramped. (It's mid-week and the place is empty. Why don't you upgrade me to something larger?). My 6-year really enjoyed the Kid's camp and there were other children to play with at the pool. The 4pm check-out from AMEX platinum really made our stay much nicer.", "title": "Relaxing Stay at Bacara", "helpfulness": 5, "user": "gone40", "date": "June 30, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "service": 5.0}, "id": 3622876}, {"rating": 4.0, "title": "A good experience", "text": "I stayed with my family for 4 days. The service was quite excellent. It is a bit expensive. I have been in other resort around the world (especially caribean) and there is not much difference. I believe it is a bit cold for june. The best is to have one meal at the hotel and other meals in Santa Barbara. If you want to do that you must rent a car since it is quite far to downtown. Remember you must pay 16 dollars every day to park your car + the customary tips. I highly recommend this resort if you want to have fun with the family.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "June 27, 2005", "id": 3615841}, {"rating": 5.0, "title": "Bacara Hits a Home Run!", "text": "We just returned from a four day trip to Bacara. Wonderful! It's a great place. The property is fabulous and the staff are attentive and care about the property and your stay. Miro the Fine Dining Restaurant was excellent. the menu is creative and the service timely and polished. Yes this is an expensive place to visit. But there is a high price to pay for true luxury these days so it is what it is. We went to several restaurants in Santa Barbara and the trip is about 20 minutes and totally painless. For those who understand and appreciate fine resorts Bacara hits a home run! Yes, there are Oil Dereks and Fishing Boats to see. But niether have an impact on your stay and are nice conversation pieces. I look forward to returning.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "June 22, 2005", "id": 3604574}, {"rating": 3.0, "stay_parameters": "Stayed May 2005", "text": "We stayed at the Bacara Resort recently for three days. I have to say from all the hype I have read for the past few years about this resort, I was disappointed. I have stayed in many other resorts around the world, and the Bacara certainly does not stand out in any way as being extraordinary. When we first arrived the man at the desk told us we would have a room with two full-sized beds instead of the King that we reserved. We asked if there were any king sized rooms available and he said there were no rooms left at the hotel and we were stuck with the double beds. This resort is sprawling, with many out buildings and a very long hike to the lobby which is located on a rather steep hill. We were transported by golf cart to our room by a wonderful bellman named Paul. When we got to our room and expressed disappointment at the size of the room and the beds, Paul got on the phone to the desk and within five minutes (as if by magic) we had another room...this time a king, which was what we had reserved in the first place. We were very grateful to Paul, but disappointed in the unhelpful service we received at the front desk.", "title": "Overrated", "helpfulness": 6, "user": "catmac1957", "date": "May 25, 2005", "detail_rating": {"cleanliness": 4.0, "value": 1.0, "rooms": 4.0, "service": 2.0}, "id": 3499242}, {"rating": 5.0, "stay_parameters": "Stayed April 2005", "text": "Our new room was spacious, but was on the bottom floor, very dark, and looked straight into another building. Certainly not a five star room in any sense of the word. Addtionally it was especially annoying in the morning not to have a coffee maker in the room.", "title": "Amazing!", "helpfulness": 6, "user": "Golfer2006", "date": "May 9, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3452714}, {"rating": 4.0, "stay_parameters": "Stayed December 2008", "text": "Stayed for three nights at Bacara. You really don't have to ever leave the property: spa, ocean views, walking trails and paths, tennis, three pools, volleyball court, game house (doubles as the conference center), fitness and yoga classes, & three restaurants - five if you count the bar and room service. I didn't have a spa treatment but I did use the jacuzzi and steam room in the spa. The spa is just as nice as the spa at the former Ritz Carlton - Pasadena. The meals we had were very good, including the room service meal. The bed is so comfortable. My only complaint is that the resort was rather dark at night so we used our flashlights and there is a lack of signage at the resort and in Santa Barabara in general. This is a high-end resort so be prepared to spend lots of money, especially tipping and for food. The service is great. The room is done in California Mission meets the tropics style. It's not oppulent but the bathroom is great: a shower with a tile bench seat, a separate tub, toilet room, and a big counter for the sink area. As with all hotels, there is never enough lighting to read a book -- so bring a book light and your flashlight (for the paths at night) and you will be fine. In my estimation the room could have easily used three more light sources. But all in all we had a wonderful stay and will go there again.", "title": "Beautiful Time at Bacara in Beautiful Santa Barbara", "user": "simplify", "date": "January 2, 2009", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 23209821, "likes": {"liked": "— The staff provides exellent service. The resort location is heaven on earth", "disliked": "— The charge for overnight parking and lack of lighting on the resort paths"}}, {"rating": 2.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "My husband and I travel extensively and have stayed at luxury hotels all over the world...the Bacara was unimpressive. The room was beautiful, the bed comfortable, etc. For the price, however, the service was an absolute dissapointment as was the food. Very few of the servers in restaurants even spoke English, and when they did, it was as if they were doing you a favor by waiting on you.", "title": "Total Dissapointment", "user": "GinAndTonicPlease", "date": "November 27, 2008", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 1.0, "cleanliness": 4.0, "value": 1.0, "location": 2.0, "rooms": 4.0}, "id": 22254462, "likes": {"liked": "— the roo,m", "disliked": "— the service"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "The number of children in the resort was staggering...there is nothing like enjoying cocktails in the bar with kids running around.", "title": "Heaven on Earth", "helpfulness": 1, "user": "hnh4z", "date": "October 20, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 21029657, "likes": {"liked": "— The ultra comfortable bed"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "Overall experience was a total dissapointment - stay somewhere else.", "title": "Heaven on Earth", "helpfulness": 1, "user": "hnh4z", "date": "October 9, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 20765962, "likes": {"liked": "— The ultra comfortable bed"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "This place is simply amazing. The service is top notch without being overbearing. To echo another person's review, I wanted to take the bed home. It was probably the most comfortable bed I've ever slept in. The room was spacious and had a decent sized balcony. We noted during the reservation process that we would be celebrating our anniversary during the trip and the management sent us a plate of chocolate covered strawberries our first night that were delicious. All of the meals we had were quite tasty as well. The workout facilities were first rate as well. The only slight downfall is that during our stay there were no free hikes available of the resort's ranch. The free hike was only available on the weekends.", "title": "Truly, absolutely delightful", "helpfulness": 1, "user": "Ergodic", "date": "September 25, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 20380026}], "location": {"country": "United States", "city": "Goleta"}, "stars": 5, "variance": {"poor": 107, "average": 116, "very good": 179, "terrible": 103, "excellent": 523}, "aka": "Bacara Hotel", "slim_ranking": 0.375, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.5, "rooms": 4.0, "location": 4.5}, "description": "Bacara Resort & Spa offers a luxurious hotel and family experience right outside Santa Barbara, California. Experience laid-back luxury and contemporary comfort at Bacara. Nestled on 78 magnificent beachfront acres, Bacara provides a vacation experience like no other. Whether you’re here for business or pleasure, we’ll pamper you with dazzling facilities, suites and the incomparable Santa Barbara sun and surf."}