{"user_rating": 4.5, "review_count": 42, "name": "Backeralm", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "We stayed at the Backeralm Guest House for 2 nights. The location is great, in the middle of the Bavarian mountains, only a few km from the town of Mittenwald.", "title": "Great stay at the Backeralm", "user": "Tr4vel4ever", "date": "October 1, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 45622820}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "As previous travelers pointed out this is not a hotel, but really a bed & breakfast. Breakfast was served at the time we desired, good variety. Our room (#6) was on the bottom floor, with stunning views of the mountains. It was very clean and comfortable, and the bed was awesome, we slept like babies!", "title": "We'll be BACK to Baeckeralm!", "user": "DutchTravelJunky", "date": "September 21, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 43241027}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled with family", "text": "The owners are very nice, and they were very helpful by helping us plan our excursions/transportation. Unfortunately we were on a tight schedule and did not spend much time at the Backeralm other than for sleep, would have loved to sit outside and enjoy the beautiful surroundings!", "title": "Just a perfect place to stay.", "user": "Familycouples", "date": "September 1, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 39485823}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "My boyfriend, sister, and brother-in-law all recently traveled to Mittenwald for a 4 day weekend in Bavaria. After a long rainy drive, we finally reached our destination hotel and were pleasantly surprised. While the Baeckeralm is a little further from the center of Mittenwald than expected, it provided a quiet escape and breathtaking views of the surrounding German Alps. Our hosts were more than accomodating and kind. They even offered extra advice on some special events for that weekend to include the annual parade of the goats from the mountains into the town of Mittenwald -- adorable! -- and a free cable car ride one evening on one of the nearby peaks in Austria. Both events were things we may have otherwised missed altogether. The breakfast was good, healthy, and plentiful - a typical German B&B spread. Our only complaint was that we couldn't stay longer in Bavaria. If you're looking for a quiet place to enjoy and explore the region without the touristy-traps of Garmisch, etc., stay here. Also -- take the owner's recommendation of a restaurant in the nearby town of Klais (if memory serves). It was very good and very popular with the locals.", "title": "a most pleasant stay", "user": "viajeritos", "date": "August 29, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 39128964}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "It has been a year since we had the great pleasure of meeting Inglof and Heidi in their home. Yes,it did have the feeling of a home away from home. They {as acouple } went way beyond anything we had experienced before, and since. They made our trip into a chance of a life time.", "title": "One of the best experiences ever!!!!", "user": "travelguruok", "date": "May 30, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 31173672}, {"rating": 5.0, "title": "Come as a guest leave as friends!", "text": "This is what the hotel Garni owners told us and it is true.", "helpfulness": 1, "user": "TexasJudy", "date": "May 31, 2007", "id": 7723601}], "location": {"country": "Germany", "continent": "Europe"}, "variance": {"poor": 1, "average": 0, "very good": 6, "terrible": 1, "excellent": 34}, "slim_ranking": 0.0740740740741, "description": "Bäckeralm-Gästehaus (bed and breakfast) liegt cirka 2,5 km vom Ort Mittenwald entfernt an der alten Staatsstraße zwischen Klais-Mittenwald auf gut 1000 m Höhe mit Sicht über den Schmalensee und die wunderschönen Buckelwiesen auf die grandiose Bergwelt-Karwendel. Ruhe und Natur pur !! (Bitte beachten Sie freundlicherweise: Keine Kinder unter 15 Jahren und leider auch keine Unterstellmöglichkeiten für Fahrräder vorhanden.)Die Bäckeralm verfügt über 1 Einzel- und sechs Doppelzimmer, DZ alle mit Bergblick und Balkon oder Terrasse. Kostenlose Parkplätze sind ausreichend auf dem großen Gelände verfügbar."}