{"user_rating": 5.0, "review_count": 128, "name": "Bad Rock Bed and Breakfast", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "Accommodation ratings on TA tend to be inflated. Many people think that \"I had a good time\" is the same as saying that a hotel is 5 Star. I think that's the case with Bad Rock.", "title": "Grade Inflation", "helpfulness": 2, "user": "Twoprofs", "date": "August 4, 2010", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 2.0, "sleep": 4.0, "rooms": 2.0, "location": 3.0}, "id": 73734342}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "We did have a good time, and we did find the host helpful, and we would probably return. But to say that Bad Rock is a 5 Star b&b is greatly overstating its qualities. On the good side, it's quiet and spacious, the breakfasts are filling, the pillow choices are varied, and the host tries to foresee and accommodate all the guests' needs.", "title": "Great place to stay", "user": "travelbuggie47", "date": "July 17, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 71203040}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "But there were many less than stellar aspects. For example, our room stunk; the host said it had to do with the treated logs used to build the place, but we found the odor nasty. Every morning we were there, the host complained that he hadn't had a day off in months, like it's our fault that he chooses to run a b&b and not schedule a down week. At a 5 Star b&b, I expect unique and special breakfasts, not deli ham on mass produced croissants and muffins from Costco. And I expect to be able to use the advertised wi-fi without having to sit outside. Ventilation in the room and bathroom was poor, and the bed was not particularly comfortable.", "title": "Will be back...sooner rather than later!", "user": "mikvikBrentwood", "date": "July 15, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 71077050}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "As I said, Bad Rock is OK; I may well use it again, and I don't hesitate to recommend it to others. Still, it's a long, long way from being a 5 Star b&b.", "title": "Wonderful Bed and Breakfast!", "user": "PatSt_LouisMO", "date": "July 9, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 70330652}, {"rating": 4.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "We are so glad we were able to get a room at the Bad Rock Bed and Breakfast. The B & B is clean, inviting, and full of amenities including a few other B&B provide. It’s the only one I know that loans bear spray! They have a game room, complimentary laundry, lots of outdoor sports equipment they loan, complimentary wine/soda/water, and more. The setting is lovely—spacious with a view of the mountains. There is a delicious hot breakfast served each morning. The gracious owner, Mark, is very knowledgeable about the area and provided us with several suggestions which made our trip to Glacier so much better. I can only add my positive review to the many other glowing reviews. This is a great place to stay and I recommend it highly.", "title": "Great Location to access Glacier National Park.", "user": "Flohr", "date": "July 7, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 70068739}, {"rating": 5.0, "title": "My favorite Bed & Breakfast in Columbia Falls, Montana", "text": "We had reservations at the Bad Rock Bed & Breakfast for Aug. 27th and 28th. It was such a wonderful place to relax, the breakfast was so gooood that we stayed another night. (we were lucky that he had room for us to stay another night.) Mark & Serena Jackson, the owners were so gracious and Mark gave us many tips on where to go and what to see and good places to eat. Mark always found time to sit and chat with us after we had spent the day sight seeing. Snacks were always available and good. They are definately the Host With The Most. The bedrooms were so spacious and nicely furnished. We would go back there and stay in a heart beat. We are still talking about our time there.", "user": "NCHolyCow", "date": "September 12, 2009", "id": 41179133}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "We were very surprised because all of the raves about Bad Rock were true. Our room was very large and well appointed. Mark's breakfasts were outstanding and he has thought of everything to help his guests.", "title": "The previous reviews were accurate---outstanding accommodation", "user": "thevat", "date": "September 2, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 39627929}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "My boyfriend and I stayed here this last weekend. We decided last minute to drive to Columbia Falls to see the lake and go to the water park (which is also awesome) and early evening on Saturday night we realized that we needed a place to stay. After finding the information and giving them a call we felt very lucky that they had one more room available for the night.", "title": "Great place with wonderful service.", "user": "butterfly4kathy2", "date": "August 25, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 38753792}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "After a couple calls for directions we pulled up and was very pleased with how beautiful and clean everything was. We were quickly shown around and taken right to our room. It was BEAUTIFUL. We got a small cabin (what I assume was their nicest one, but we didn't ask) and we LOVED it. It was 2 stories.. very comfortable bed, wonderful shower and everything else that we could have asked for including a very big book that they put together with maps and directions on where to eat and what was offered to do in the area. As I said, we got there pretty late in there evening and we had to leave to get home pretty early the next day so we didnt get to stay very long, but it was well worth it.", "title": "It was like staying with your friends!", "user": "PTCDPD", "date": "August 20, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 38281741}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "Breakfast the next morning was wonderful. Waffles with strawberries and sausage, coffee and OJ. There were about 15 people or so there and it was great to sit around the big table and talk to everyone. It was our first stay at a B&B and we loved it.", "title": "The Best B&B We've stayed at!", "user": "Susan555", "date": "August 17, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 37952944}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled solo", "text": "Mark (and Serena) have done an incredible job with this property. They don't stop improving and adding amenities for their guests. I came through on a solo bike ride across country so I was not able to enjoy all that they offer their guests, but as Mark walked me around (I too am a Bed and Breakfast owner) showing the property I was amazed at all the guests have at their disposal to insure their stay is all they want it to be.", "title": "What a great property and what a great story!", "user": "The Inn At Manchester", "date": "June 12, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 67298752}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "I also have to say that Mark and Serena's story is quite interesting and one that is definately entertaining.", "title": "Absolutely fantastic B&B, wonderful experience", "user": "davis48", "date": "May 17, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 64393921}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled with family", "text": "I thoroughly enjoyed my stay and I can not say enough about the hospitality that was provided to me during my stay. I would definately return to The Bad Rock B&B, but next time I'll be in a car versus on a bike! thank you mark and Serena...it was a pleasure to meet you both and to share stories!", "title": "Makes us long to return!", "user": "svenska4", "date": "October 14, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 46881103}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "We stayed with Mark and Serena for two nights at the beginning of May and although we live a long way away (in the UK) we would love to visit again. Our guest \"cottage\" had all that we would require plus more - it was truly a home for home.", "title": "Montana A+ Vermont 30 years ago; Bad Rock the place to stay-now", "user": "chillisgone", "date": "September 29, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 45456612}, {"rating": 4.0, "title": "Bad Rock Country B&B", "text": "The breakfasts were exceptiona, cooked fresh by Mark.", "user": "grandbunnyx2", "date": "September 23, 2009", "id": 43847880}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled with family", "text": "My family of four stayed in the Swan Mountain Cabin. It was excellent. The downstairs sofa bed had already been pulled out and made for the kids!", "title": "Close to Glacier, felt like guests instead of customers", "user": "ncocacola", "date": "July 6, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 69969516}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "We were a little nervous bringing kids 7 and 9 to a B&B, especially with no TV in the cabin, but they didn't miss it ONE bit. The game room had pool and air hockey. They had plenty of microwave popcorn and soft drinks for the kids, and a box of basketballs, soccer balls and the like. Mark even let our kids each pick out an antler from the pile which MADE their trip!", "title": "Lives up to the TA reviews!", "user": "mt229", "date": "July 5, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 69828170}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "The breakfasts were fabulous and if the kids didn't like it there were several other options of cereal, fruit, yogurt, etc.", "title": "It doesn't get any better than this!", "user": "KingWilliamII", "date": "July 5, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 69815029}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "We will certainly return!", "title": "This B and B gets a '10'", "user": "dmelnikoff", "date": "June 23, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 68440408}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "I don't know what I can add that hasn't already been said by other reviewers--the Bad Rock B&B is truly exceptional. Mark, the owner, is clearly running his B&B because he wants to, not just to make a profit. There really was everything we could possibly need here--including things like snowshoes and crampons which really came in handy since there was still a lot of snow in the park while we were hiking. The breakfasts were superb, and they even prepared a sack breakfast for our last day, since we had to catch an early flight home.", "title": "Bad Rock is ALL GOOD...no Bad!!!", "user": "JGPRichmond", "date": "June 17, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 67841700}], "location": {"country": "United States", "city": "Columbia Falls"}, "stars": 2.5, "variance": {"poor": 1, "average": 3, "very good": 13, "terrible": 0, "excellent": 111}, "slim_ranking": 0.142857142857}