{"user_rating": 4.5, "review_count": 276, "name": "Baglioni Hotel London", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "My new husband and I stayed here the weekend we got married. The staff were lovely and extremely helpful, always welcoming and couldn't do enough. They knew we were getting married and upgraded us to a lovely suite and made us feel special. We came back after a long day of getting married to prosecco and strawberries and our room done up tastefully and romantically with rose petals and candles.", "title": "Fabulous place, fabulous service, absolutely lovely", "user": "LDNTraveller05", "date": "March 20, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 100804287}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled on business", "text": "The room was stunning, with a fab coffee machine and water for free. The breakfast offered is varied, and we were encouraged to have anything and everything, and the service is 6 star!. Anything requested was no trouble at all and appeared immediately. The bar is a bit pricey but to be expected in such a place. We loved it and would stay there again no questions asked. If we win the lottery, we might just move in!", "title": "Good property", "user": "DSA1965", "date": "March 18, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 100637890}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "Relatively convenient location. Staff service levels were very good. I wanted to eat at their restaurant but unfortunately did not get an opportunity to do so(next time for sure)", "title": "Superb Hotel", "user": "BHFamily", "date": "March 12, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 99889809}, {"rating": 4.0, "stay_parameters": "Stayed November 2010, traveled with friends", "text": "Very good and luxurious rooms.", "title": "Wonderful Spa & Lobby Bar", "user": "CamLovesSun", "date": "February 25, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 97916120}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled on business", "text": "We stayed one night at this superb hotel having made an evening reservation at Le Gavroche. Having stayed here, I wouldn't consider staying anywhere else in London. We were made to feel as though they valued our custom.", "title": "My new favorite London hotel !!", "helpfulness": 1, "user": "jal52sandiego", "date": "February 21, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 97495261}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled with family", "text": "I have stayed at lots of hotels in London, at last I have found the one, that I feel makes me want to go back to London, just to stay here. I used to stay most often at the Sofitel, but the Baglioni is better in terms of the quality of the establishment and the staff. You can not put a price on quality staff, that make you feel that you are valued as a guest. Go and you will enjoy.", "title": "This is how Hotels should be", "user": "FatBoySteve", "date": "September 28, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 81303670}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled with friends", "text": "I stayed for one night in August, and loved the Baglioni! The staff are wonderful and very courteous and welcoming. This hotel certainly has the 'Wow Factor' when you walk in. The interior design is achingly trendy and stunning. I love the use of colours in the restaurant and entry area. This is a wonderful boutique hotel.", "title": "Gorgeous, trendy hotel with fabulous staff.", "user": "LuxuryTraveller1974", "date": "September 7, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 78603782}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled on business", "text": "Unfortunately on a Sunday the complimentary limo service is not available, so I cant comment on that. We did find the concierge at the hotel to be charming and very helpful.", "title": "Relaxing Spa - hidden gem in Kensington", "user": "GillyMK", "date": "September 5, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0}, "id": 78354306}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled on business", "text": "We loved our room, a junior suite, which was furnished in dark plum colours with dark wood floor. The bathroom was black marble and very spacious, especially for a London hotel. Gorgeous toiletries which smelled heavenly!", "title": "Excellent", "user": "stephen_crewdson", "date": "September 2, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 78051675}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "All in all we had a good stay at the Baglioni and would recommend it to anyone. I would certainly return without hesitation.", "title": "Fabulous, glamorous, friendly", "user": "huntse", "date": "August 31, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 77605657}, {"rating": 5.0, "title": "a hyde park gem", "text": "stayed at an executive suite and it was pretty big for a european suite", "user": "marie6613", "date": "May 22, 2011", "id": 109388765}, {"rating": 3.0, "stay_parameters": "Stayed April 2011, traveled on business", "text": "there is a separate living room from the bedroom", "title": "Overally, Very Disappointed", "user": "Tennek", "date": "April 23, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 2.0, "sleep": 4.0, "rooms": 2.0, "location": 4.0}, "id": 105197783}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "service was on point the whole time", "title": "One of the few best hotels I have ever stayed at in my life!", "user": "Austinguytexas", "date": "March 30, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 102243897}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled on business", "text": "they have the best olives at the bar and an awesome bar as well", "title": "Great hotel, great staff, great service, great location. A top notch 5-star", "user": "fsoalheiro", "date": "March 30, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 102228125}, {"rating": 3.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "From the moment we arrived, there were problems. While we were checking in, the front desk attendant paused to take and handle 3 telephone calls. We had been travelling for several hours and were tired and wanted to get up to our room to wash up, but apparently handling others' issues even though we were standing right there was more important. Then, when we got to the rooms, it was one problem after another. First, the telephone didn't work. When the maintenance man arrived, he acted like the problem was mostly ours. He summarily tweaked the battery and left. 5 minutes later, we had to call him back. This time, he replaced the phone and left. 10 minutes later, we had to call him back AGAIN and he had to replace the phone a third time. Finally, it worked. In the meantime, I had to kneel next to the bed with my laptop on the bed and take a work call holding the corded phone next to the bed. With the phone situation finally resolved, I sat down at the desk to do my work and...NO POWER in the outlets at the desk. This took another two calls to maintenance to resolve and, in the meantime, they brought three of the wrong type of adapters for US devices. Finally that was resolved and I sat down hoping to actually get some work done when NO INTERNET access in the room--the signal to that room was so weak that the connection only stayed actived for a few minutes at a time at which point it would drop and take minutes to reconnect. Mind you, we were not staying in the cheapest rooms in the hotel--we were staying in Deluxe Suites. On the positive side, the waitstaff in the restaurant were extremely nice and the food was good. In addition, the lobby staff were also extremely nice and helpful. Finally, the manager of the hotel, Francesco, who was originally fairly dismissive and aloof, eventually seemed sincere in his apologies for all of the problems with the room and volunteered to reduce the room rate by 100 pounds. I am happy to pay 600 pounds a night for a hotel suite and I do not expect to be waited on hand-and-foot. But, I do expect things like telephones, power plugs and wireless internet to work. i do not think I would ever return to this hotel.", "title": "Good location", "user": "Breakingoutnow", "date": "March 30, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 102144344}, {"rating": 3.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "On the website and at the first glimpse a very attractive hotel - especially in combination with the great location at the the Hyde Park Gate. We had a Junior Suite which was very dark - interior too shiny instead of stylish. Quite some unpractical details. Lightening from the late 90's. shower wall for the tub not working properly. Bad experience with dinner on first evening - main course served could. After we complained the food was just put under the heater for a little while - still not hot, but already stale. Staff - mostly Italian - very friendly. Overall price performance ration not ok.", "title": "Beauty is only skin-deep!", "helpfulness": 2, "user": "clemensri", "date": "January 17, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 2.0, "sleep": 4.0, "rooms": 2.0, "location": 4.0}, "id": 93392949}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled with friends", "text": "I can't thank the Baglioni spa enough for our fantastic spa treatments. We were given a warm welcome by the staff and treated like we were the only guests there. I booked in for a body scrub, massage & facial. The rooms was beautifully lit and very relaxing. My therapist Charlotte was fantastic. I explained to her the problems I'd been having with my back and I can honestly say she gave me the best deep tissue massage I'd ever had. I came away feeling relaxed and regenerated. The down side is the hotel doesn't have a pool or extensive spa facilities. However it certainly makes up by offering excellent treatments.", "title": "The most amazing Spa treatments in London", "user": "lucysquance", "date": "November 30, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 88687942}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "My husband, adult son and I spent five nights at this elegant and welcoming hotel. The concierge staff, restaurant staff, and managers could not have been more helpful in all respects. Each time we returned to the Baglioni, we were greeted in a way that made us feel like we were returning to our refuge in the city. The suite was spacious and well appointed. Several requests we made to the front desk were immediately attended to, or we received communications from the management in a very timely fashion. The restaurant is a real treat with excellent Italian cuisine and the breakfasts for guests included excellent coffee, pastries, and almost anything one might request. The Spa, while small, provides superb sevices. The exercise room was basic and the treadmill was out of service, but we were able to make do just fine. When choosing our hotel, our major considerations were excellent service and an spacious suite where the three of us could spend time together when we were not otherwise busy. The online information provides the floorplan and dimensions of the suite, and it was by far the most spacious for comparable or better prices than the Mandarin Oriental or similar choices. Thank you to the staff at the Baglioni.", "title": "Graciousness Prevails at the Baglioni", "user": "SWard10", "date": "November 8, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 86410307}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "Our flight from the US was overnight, thus we arrived at the hotel at 8:15 AM. A bit early for check-in but they made us very comfortable 'till our room was ready. The restaurant is pricey but worth every penny!! Afternoon tea is a must!!", "title": "Fabulous hotel, super fabulous staff.", "user": "Nancy_H0340", "date": "October 26, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 84958418}, {"rating": 5.0, "title": "Love the language", "text": "Phillip Morris is the Concierge we dealt with most of the time....he will not steer you wrong!! (Maggie Jones Pub...not to miss.)", "user": "BillyG9", "date": "October 15, 2010", "id": 83620288}], "location": {"country": "United Kingdom (UK)", "continent": "Europe", "city": "London"}, "stars": 5, "variance": {"poor": 6, "average": 25, "very good": 56, "terrible": 8, "excellent": 181}, "aka": "London Baglioni Hotel", "slim_ranking": 0.104089219331, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "The Baglioni Hotel London is situated in the heart of London, the cosmopolitan city par excellence, opposite Hyde Park with an enchanting view of Kensington Gardens and Palace.The luxury 5 star hotel is situated a short distance from historic and cultural places of interest and the shops and watering holes that animate the city’s nightlife; the Royal Albert Hall, Harrods and Knightsbridge are all nearby. The entirely Italian hospitality and luxury services offered such as the spa, fitness centre, chauffeur-driven car and personal butler will make your stay in London truly unforgettable. For an Italian flavor stay, Baglioni Hotel London launches the new restaurant Moreno at Baglioni, led by the Italian two Michelin stars Chef Moreno Cedroni."}