{"user_rating": 3.5, "review_count": 641, "name": "BAH Barcelona Airport Hotel", "reviews": [{"rating": 5.0, "title": "NICE, VERY NICE...VERY CLASSY.....", "text": "I lost during a trip with my girlfriend the plane in El prat, it was late in the night and i got some tips in the airport about the Barcelona airport hotels (as you know from my previous reviews i know Barcelona like Milan, my city but i never slept in an airport hotel)and i chose Renaissance...There is an easy shuttle service (to be honest they don't stop in the arrivals but you have to walk until a designated area next to the parking)and iun 10 minutes you are there.. The building is new and stylish, the entrance hall is very big and luxury oriented..The staff is totally competent and efficient. the room was not that big honestly but for stopover...who cares? The price is balanced to the luxury...honestly a paid a nice sum but...i booked literally by phone 20 minutes before checkin in so... i recommend it if you find a good price......", "user": "MilanMarco", "date": "November 17, 2011", "id": 120690492}, {"rating": 5.0, "title": "Perfect for last night before International Flight", "text": "This hotel is located very close to the airport. It is beautiful, clean, and comfortable and a GREAT VALUE! We purposely booked here for the last evening of our vacation, since we had an early morning flight. It exceeded our expectations! The shuttle was very convenient to take to the airport in the morning; however, the driver left us at the wrong terminal. So, make sure you are certain of the terminal yourself! I would not stay here if I was planning a short trip to Barcelona, to see historical areas, and other areas of interest to tourists..it's almost as hour drive in traffic. But, if time is no matter, this is a great place to stay.", "user": "Raerone", "date": "November 16, 2011", "id": 120686213}, {"rating": 5.0, "title": "More than met my expectations!", "text": "Stayed there 4 nights after a 10 day cruise out of Barcelona. Free shuttle to airport so shuttled from cruise ship to airport and then to hotel. I was able to check into room by 11amand it was a 4 star room. The restaurant was great, comfortable as a single diner, reasonable and very good food and presentation, excellent service. Excellent price for 4 star. Free bus shuttle service to Las Ramblas walking street downtown 4 times a day, that was a huge plus. From there I could take metro, walk to the wharf. hop the On Off Bus. The concierge was extremely helpful, gave me clear directions on how to get to Montserrat which was one of the high points of my vacation.", "user": "Andi70_11", "date": "November 14, 2011", "id": 120599775}, {"rating": 2.0, "title": "Not very happy with my experience", "text": "Arrived at 11:30 am and was able to check in right away, good sign. . .until they gave me a room on the first floor. I'm a Marriott elite member and my profile states my preferred room to be high floor away from elevators. . .so let's try that again. Requested a room on a higher floor, got one. . .almost next to the elevator. oh well, i was only there for one night and I was in a hurry to catch the shuttle to Las Ramblas so I dumped my bags, gave a cursory glance at the room, which seemed fine, and off i went.", "user": "weedebs", "date": "November 10, 2011", "id": 120433050}, {"rating": 1.0, "title": "Do not come here for business", "text": "i returned at about 8 pm that night and, though i had asked for bottled water and fresh frut to be delivered on arrival, it was not there. At that point i didn't care, I wanted to get dinner and go to bed as I had an early flight the next morning. **It must be noted that the main reason i chose this hotel was the free shuttle to the Airport**", "user": "MedEventsTeam", "date": "November 7, 2011", "id": 120264934}, {"rating": 2.0, "title": "Renaissance upscale? Uhm, no!", "text": "We stayed here one night post cruise so we could shuttle to the airport early the next morning. The hotel was not busy and we had a quick check-in, room was ready around 1:00 pm. First problem, as another reviewer mentioned, the air conditioning. The room would not cool down. Went to the front desk and was told that it is intentionally set high for the Fall/Winter season. Really Marriott? After going in circles, the front desk person finally offered to send up maintenance to adjust. Maintenance man came up with ladder and screw driver and did a few things, no improvement.", "user": "SunDiego123", "date": "November 3, 2011", "id": 120116011}, {"rating": 4.0, "title": "good location...service is lacking", "text": "Meanwhile, we noticed that there was no bar soap in the room, just a soap tray that said \"Lather\" and a small bottle of body wash. So back downstairs I go and ask if there's no hand soap available. Front desk person said \"no\", they don't have it. Okay, so two people, hand washing, showering, sharing this little bottle of body wash. And this is an upscale hotel? Really Marriott?", "user": "ExpectingtheBest77", "date": "November 2, 2011", "id": 120095135}, {"rating": 4.0, "title": "Excellant Service", "text": "Went back downstairs to complain again about the A/C and was told it was probably the afternoon sun beating into the room, the A/C couldn't keep up. Mr. Front Desk offered us a different room across the hotel. Great!! We switched rooms and the A/C was working, room was at least 10 degrees cooler.", "user": "cdress13", "date": "October 31, 2011", "id": 119941707}, {"rating": 2.0, "title": "Best avoided", "text": "Back to the soap... we noticed room #2 had bar soap AND body wash, but no \"lather soap dish\". Fine, we used the bar soap and just left the wet soapy bar on the bathroom counter.", "user": "80eastwest", "date": "October 31, 2011", "id": 119929579}, {"rating": 4.0, "title": "Nice Hotel", "text": "I type all this out to illustrate that the front desk staff absolutely does not go an extra mile, let alone an extra inch. Their first response to any problem is to b.s. their way out of it rather than address it. Really Marriott?", "user": "wdc3293", "date": "October 24, 2011", "id": 119689175}, {"rating": 3.0, "title": "Ok for brief stay", "text": "We stayed one night after getting off a cruise and before flying to the U.S. Found the decor very stark and not particularly welcoming.", "user": "BermudaMom1956", "date": "October 23, 2011", "id": 119628834}, {"rating": 5.0, "title": "Typical good Renaissance Standard", "text": "Front desk staff were excellent. Restaurant staff and bar staff weren't particularly interested in getting you anything. Almost gave up at one point but there were no other options in the area so just had to wait. Part of order was delivered incorrectly and they offered to redo but we declined since it had taken so long in the first place. They did deduct from the bill without my asking which was much appreciated.", "user": "jojo_cgn", "date": "October 22, 2011", "id": 119581107}, {"rating": 3.0, "title": "Nice hotel but too far out for city break", "text": "Room was sufficient. Was clean. Felt the hallways looked like you were walking into a dorm building or something. Painted green walls, room doors the same color so blended in. Bottom part of walls had carpet on them which was strange but perhaps done for acoustic reasons.", "user": "Nick_Harris", "date": "October 19, 2011", "id": 119484826}, {"rating": 2.0, "title": "Grave disappointment for me....Ughhhh", "text": "Is an airport hotel and adequate for a brief stay. Does have the airport shuttle which is a good convenience.", "user": "touringtheworldyoung", "date": "October 16, 2011", "id": 119369235}, {"rating": 3.0, "title": "Busy hotel close to the airport", "text": "I've stayed now a couple of times in the Renaissance Barcelona Airport hotel which offers a complimentary shuttle service from/to the airport!", "user": "ReKoSLC", "date": "October 11, 2011", "id": 119201060}, {"rating": 4.0, "title": "convenient and efficient", "text": "Spent some late night hours in this airport Hotel in Barcelona.", "user": "edgarsz", "date": "November 25, 2011", "id": 121017648}, {"rating": 4.0, "title": "Cruising hotel", "text": "If what you need is an efficient and comfortable place to sleep or rest between flights", "user": "marymich55", "date": "November 22, 2011", "id": 120934588}, {"rating": 4.0, "title": "Nice hotel Convenient to airport", "text": "this is your place.", "user": "breedlove", "date": "November 20, 2011", "id": 120831393}, {"rating": 4.0, "title": "Hotel Experience", "text": "Five minutes from the terminals by free shuttle (from 5am to midnight, every 20-30 minutes).", "user": "Bob469NewYork", "date": "November 19, 2011", "id": 120779580}, {"rating": 2.0, "title": "Needs Help", "text": "Obviously if you have enough time to enjoy wonderful Barcelona you should find an", "user": "DSR47", "date": "November 18, 2011", "id": 120762472}], "location": {}, "stars": 4, "variance": {"poor": 83, "average": 135, "very good": 251, "terrible": 43, "excellent": 129}, "aka": "Renaissance El Prat De Llobregat", "slim_ranking": 0.666666666667, "detail_rating": {"service": 3.5, "cleanliness": 4.0, "value": 3.5, "sleep": 4.0, "rooms": 4.0, "location": 3.5}}