{"user_rating": 4.0, "review_count": 1402, "name": "Bahama Bay Resort Orlando", "reviews": [{"rating": 5.0, "title": "better than expected", "text": "we stayed there 6-20 jan 06", "helpfulness": 9, "user": "A TripAdvisor user", "date": "February 10, 2006", "id": 4450655}, {"rating": 5.0, "title": "can't wait to go back loved it.", "text": "we went to book another hotel when we made our our original booking, but the travel agent came across the bahama bay and we are so glad that we ended up there. we were supposed to have been given a two bed appartment but when we got ther we were given a three bed at no extra charge. the staff are really friendly and helpful even providing transport in their golf carts around the resort and my kids fell in love with joe the barman.the resort was clean.the gym was small but well worth a visit. the appartments were exceptional and better than we expected, better than being at home. the only down side was the construction work that is taking place to build a new road from the 192. however this hasn't stopped us booking for feb 07. we can't wait to go back.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "January 29, 2006", "id": 4395634}, {"rating": 5.0, "title": "Wonderful Resort /Very Relaxing", "text": "we stayed at bahama bay for two weeks from 13th october 2005. It was fabulous. The staff were great, the accomodation was great, clean and tidy and ready for our arrival. we were impressed that the staff were cleaning and maintaining the whole time. We met some really nice people there also on their vacation. Even hurricane wilma could not spoil the experience. we are going back this year in October for three weeks with four other families hope its still as good.", "helpfulness": 10, "user": "Jan1234", "date": "January 22, 2006", "id": 4370088}, {"rating": 4.0, "title": "I stayed at Bahama Bay and liked it so I bought one", "text": "I just wish they had a decent sign at the end of the highway to point you in the right direction, it was only from reading this web site that we got directions from another family who had written a review. Also be ware they surcharge you for using the phone even if you have a phone card, everytime you make a call you are charged read the little card by your phone.", "helpfulness": 10, "user": "A TripAdvisor user", "date": "January 11, 2006", "id": 4346336}, {"rating": 5.0, "title": "Thank You Bahama Bay", "text": "keep up the good work Bahama Bay!", "helpfulness": 12, "user": "A TripAdvisor user", "date": "January 8, 2006", "id": 4332734}, {"rating": 4.0, "title": "Lovely, but a little way out", "text": "We spent a lovely 9 nights at the Bahama Bay resort. It has everything you want - the apartments are lovely, clean, well furnished with everything in them you would ever need. The swimming pools are great, the little shop very convenient for emergencies and the pool side snack bar great if you didnt want to travel to eat out. My kids were a little disappointed with the games room and didnt make much use of it - not that we were there very much anyway! The only very slight down side is that it is quite a drive to get to the parks and 'I' drive - especially if you are doing it twice in one day as we often did. Ideally you need to allow a good 30 mins to get to the disney parks and longer for Universal and 'I' drive. But if the traffic is on your side then you can cut that journey time down by 10 mins. We just felt after a day at the parks we wanted to come back to relax and swim but if you wanted to go back again in the evening it just meant you could be doing nearly 2 hours driving a day - just a thought? We highly recommend Bahama Bay as a lovely place to stay.", "helpfulness": 5, "user": "Cathyholidaying", "date": "October 31, 2005", "id": 4074779}, {"rating": 5.0, "title": "Best stay of our lives", "text": "We stayed here for a week before going on a Carnival Cruise. My wife liked it so much she wanted to cancel the cruise and stay at Bahama Bay.The condo was excellent, with everything in it you could possibly need.We had no problems with the service staff and found them polite and helpful.We enjoyed the peace and quiet of the place and found it the ideal place to unwind.We are a married couple in our late fifties but there were plenty of families there who thoroughly enjoyed their stay as well.The only down side was the fact that there are no lifts to the upper floors which made it a bit of an ordeal getting our luggage up and down. It's only two floors but after a long journey, it felt like a lot more.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "October 30, 2005", "id": 4073500}, {"rating": 5.0, "title": "Par Excellence", "text": "Overall, a great place to stay and we will definitely return", "helpfulness": 10, "user": "A TripAdvisor user", "date": "October 7, 2005", "id": 4000128}, {"rating": 4.0, "stay_parameters": "Stayed March 2005", "text": "Just returned from what can only be described as a fantastic holiday at this resort. The accommodation was excellent and the staff more than helpful. As for the member who had difficulty finding it, I can only suggest that from Sanford or Orlando Airports you pick up the I4 West then head North on the 27 the resort comes up on your right just after the traffic lights at Publix. Would definately go back.", "title": "Get away from the crowds at the Bahama Bay", "helpfulness": 2, "user": "fraggles", "date": "September 21, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 3930101}, {"rating": 5.0, "title": "Excellent Resort", "text": "My family of two adults and two children had a fantastic holiday in Orlando. We stayed at the Bahama Bay Resort in a spacious and clean three bedroomed Condo during Easter. The resort is lovely, well maintained, quiet and relaxing.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "September 20, 2005", "id": 3926334}, {"rating": 5.0, "title": "Awesome Resort Spot!", "text": "This is an awesome resort location. I did not know what to expect before we arrived, but we were truly taken once we arrived. We arrived around 4 am in the morning and we were received very well, since it was early morning. The staff was ready and very happy to see us. Check-in was fast and we were on our way. I've got to tell you, the room was awesome! I love the high ceilings. It did not make you feel like you were on an airplane. Everything in the room was brand new...that's for the mom's!! We loved the Condo feel and the kids enjoyed their seperate bedroom and bathroom. My wife did not know what to expect, but she immediately replied, \"I would like to stay here again!\" Sounds good to me! Great Place! It's a few minutes from Disney, but very enjoyable and relaxing. We'll be back!", "helpfulness": 13, "user": "A TripAdvisor user", "date": "December 30, 2005", "id": 4311696}, {"rating": 5.0, "title": "Blooming Marvellous", "text": "We spent a marvellous fortnight at the Bahama Bay Resort in late August. My partner was dead set against a trip to the USA but all I get now is \"When can we go back to Bahama Bay?\". To have a swimming pool no more than 50 yards from the condominium was a treat, as the kids(aged 14, 11 and 5) were able to disappear as and when they wanted. The condo was exremely clean and excellently furnished, TV in every room!! The staff were very friendly and helpful, I would say beyond the call of duty, check out the bald guy at the gate he was a hoot.", "helpfulness": 10, "user": "A TripAdvisor user", "date": "November 30, 2005", "id": 4155397}, {"rating": 5.0, "title": "Little piece of heaven", "text": "Tradewinds Restaurant was a little disappointing but there are more than enough Restauants and Takeaways within 10 minutes drive that it is not a problem.", "helpfulness": 17, "user": "A TripAdvisor user", "date": "November 28, 2005", "id": 4148532}, {"rating": 4.0, "title": "Almost Perfect...", "text": "If you do stay here a car is essential.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "November 14, 2005", "id": 4110781}, {"rating": 4.0, "stay_parameters": "Stayed October 2005", "text": "Overall 10 out of 10.", "title": "Wonderful place, a bit far from anywhere, awful restaurant service.", "helpfulness": 7, "user": "Chriswith2kidsandawife", "date": "November 1, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 2.0}, "id": 4077361}, {"rating": 2.0, "title": "New Clean Condos", "text": "Brand new clean condos. Resort Quest management not friendly or helpful. I booked their Bahama bay resort and they put me in another location without my consent! No spa or snack bar as promised. Too far off the beaten path.", "helpfulness": 3, "user": "gojanicego", "date": "February 22, 2006", "id": 4478257}, {"rating": 4.0, "stay_parameters": "Stayed February 2006", "text": "p.s Still under construction, very annoying", "title": "Overall Good experience", "helpfulness": 7, "user": "Picky67", "date": "February 20, 2006", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 5.0, "service": 4.0}, "id": 4474842}, {"rating": 4.0, "stay_parameters": "Stayed February 2006", "text": "Stayed one week; we are seasoned travellers and the resort was nice. We wouldn't say overly extravagent, but a decent above average condo. Pool with beach sand was really nice for our 3 year old. The restaurant wasn't that great, and pricy. The condo was very clean, and fully equipped.", "title": "Loved Bahama Bay", "helpfulness": 8, "user": "arrette", "date": "February 20, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4473041}, {"rating": 5.0, "title": "BahamaBayRules!", "text": "We felt very remote. Would have preferred some more action. The games room and club house were always so quiet and nobody ever seemed to be around. (i.e. other guests) Club house check and staff and securtity guards were excellent. Good service. Nobody approached us about any time shares. I would recommend BB to others, but we found it a bit too far out of the way. The resort was ok, but would prefer some more amenities next time. (example, lazy river, more action of some sort).", "helpfulness": 6, "user": "A TripAdvisor user", "date": "February 17, 2006", "id": 4466850}, {"rating": 4.0, "title": "Quality \"home from Home\" accomodation but ... lots of driving", "text": "Not bad for the money.", "helpfulness": 14, "user": "A TripAdvisor user", "date": "February 15, 2006", "id": 4461772}], "location": {"country": "United States"}, "stars": 3.5, "variance": {"poor": 99, "average": 124, "very good": 368, "terrible": 68, "excellent": 743}, "aka": "Bahama Bay Resort Orlando Hotel Davenport", "slim_ranking": 0.210526315789, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.5, "location": 4.0}, "description": "Bahama Bay is lush, beautiful property just 10 minutes to the Disney Theme Park Area. Featuring spacious two and three-bedroom villa Suites, four heated pools, kiddie pool and play area, spa & salon, fitness centre, fishing dock, beach, nature trails, tennis, volleyball, basketball, gift & grocery shop, restaurant & bars, free wireless internet in the Clubhouse, restaurant, and bar areas, DVD rentals. Close to attractions, dining and shopping. Perfect for families, couples, groups, and weddings."}