{"user_rating": 4.5, "review_count": 2469, "name": "Bahia Principe Costa Adeje", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed June 2005", "text": "I loved this hotel! The pool's are fantastic, the food is fantastic and the booze is free flowing and a part is self-service, not that their shy about giving you a large amount of booze. I will definately be returning in the future to this hotel. There is a taxi rank outside if you wish to visit Playa de las Americas, or Los Cristianos, there is also a bus that stops outside the reception. The rooms are spacious and very clean. Anybody travelling to this hotel, have a fantastic holiday!!", "title": "Ab Fab", "helpfulness": 21, "user": "Sheleen", "date": "August 11, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3754185}, {"rating": 5.0, "title": "Terrific all round", "text": "Visited the hotel last year 2004 and we were absolutely amazed. Not a single complaint to be made. Great accommodation, outstanding food good facilities for the children. a superbly relaxing holiday had by all. Visiting again october this year and i,m sure that wont be the last time.", "helpfulness": 18, "user": "A TripAdvisor user", "date": "August 2, 2005", "id": 3731874}, {"rating": 4.0, "stay_parameters": "Stayed July 2005", "text": "I was a little apprehensive about staying at this hotel as I had read", "title": "Out of the Way", "helpfulness": 24, "user": "Lynden1958", "date": "July 23, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 3695064}, {"rating": 5.0, "stay_parameters": "Stayed May 2005", "text": "some of the reviews and the hotel was exactly what people had written about it.", "title": "Loved the Bahia Principe!", "helpfulness": 48, "user": "Gill", "date": "June 29, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 3621374}, {"rating": 5.0, "title": "Absolute Luxury!!!!", "text": "When you arrive the reception is very impressive and the gardens", "helpfulness": 22, "user": "A TripAdvisor user", "date": "June 22, 2005", "id": 3604231}, {"rating": 5.0, "stay_parameters": "Stayed June 2005", "text": "I would advise anyone to give this hotel a visit. I thoroughly enjoyed my stay here which was shared with my husband, 5 year old daughter and 7 month baby boy. I have been to numerious hotels on various types of holiday packages and have never came across cleanliness like it throughout a hotel. All the toilets were cleaned every hour in the complex and were of the same high standard as our hotel room (Tenerife hotel).", "title": "Very good hotel we are going back", "helpfulness": 40, "user": "lorraine999", "date": "June 22, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 3603801}, {"rating": 5.0, "title": "Can't wait to go back. Everything about this Hotel was wonderfull.", "text": "On our arrival we thought we were booked into the Costa adeje hotel as viewed in our direct holidays brochure. We spoke to reception who were willing to move us once we had looked around the hotel and grounds. After looking we soon realised that the Tenerife Hotel was far more suited for us as we have a baby in a pram. Costa adeje has numerious stairs to get to pools and facilities. It is accessable, but hard work with the lifting. Guests have use of both hotels which are directly beside each other.", "helpfulness": 28, "user": "kate69_12", "date": "May 10, 2005", "id": 3456307}, {"rating": 4.0, "stay_parameters": "Stayed April 2005", "text": "Eating was a pleasure, with an excellent variety for even the fussiest eaters in the main buffet resturant ( Champagne and Caviar at breakfast ). Also included in your all inclusive package was 3 meals per week in various themed resturants (Aisian, Mexican & italian). I would advise booking these 2 or more days in advance to ensure you get times and the day you wish.", "title": "A bit out of the way but worth it", "helpfulness": 20, "user": "SunandLaughter", "date": "April 23, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 3400007}, {"rating": 3.0, "stay_parameters": "Stayed January 2005", "text": "I would advise anyone going here with a baby that requires bottle feeds to bring your own travel kettle and washing up liquid with you. Shops in the complex did not sell washing up liquid and the rooms focused on the mini bar, so no kettle. I was only able to hire a kettle a day and a half into our stay as they had all been hired out ( 25 Euros for fortnight).", "title": "The worst beach", "helpfulness": 12, "user": "Cami", "date": "February 18, 2005", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "service": 3.0}, "id": 3209229}, {"rating": 1.0, "title": "Not the best.......", "text": "My daughter loved the kids club which was on twice daily and never missed the mini disco which is held next to the Costa adeje hotel at 8.30pm. Staff were very friendly to both adults and children alike.", "helpfulness": 14, "user": "A TripAdvisor user", "date": "February 11, 2005", "id": 3179821}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "The hotel is fantastic, choice of restaurants is great with each one giving good quality food. The choice of drinks on the all-inclusive package is superb, from beer through to cocktails. The place is amazingly clean, there seems to be a small army of cleaners and gardeners that are always doing something. The atmosphere is good, the staff are friendly and always willing to help and answer any questions that you may have. The only negative is that there simply isn't enough places to sit outside and that there is really only one bar in the main hotel that you can use in the evening. We found ourselves hanging around waiting for a table, most people seem to eat very early to ensure that they get a table.", "title": "Fantastic Hotel", "helpfulness": 1, "user": "robertkenyon", "date": "September 20, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 3.0, "service": 5.0, "rooms": 4.0}, "id": 43004463}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "Just back and in all had an enjoyable week. This is a really good quality hotel with lovely gardens and sitting areas.", "title": "Lovely quality hotel..........but", "helpfulness": 1, "user": "LanarkshireDaisy", "date": "September 19, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 1.0, "service": 5.0, "rooms": 5.0}, "id": 42845180}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled with friends", "text": "We had a junior suite which was really spacious. Food was plentifull and of good quality. The hotel and grounds are kept in pristine condition buy an army of cleaners and gardners who never stop!", "title": "Lovely Hotel!!!", "helpfulness": 1, "user": "LeanneGlasgow83", "date": "September 15, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 3.0, "service": 5.0, "rooms": 5.0}, "id": 41889064}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "I knew the hotel was isolated and thought that I could content myself for 7 days. However by day 4, I had severe cabin fever and had to escape. To go anywhere has iether to be planned by booking the hotel bus( which has to booked the day before) or by getting a taxi which can be expensive.We paid 16 euros into Las Americas and 21 euros to come back at 11pm. There is a bus service at the top of the road, but we met a couple who had waited for a bus for over an hour in the afternoon heat and it failed to arrive.", "title": "Best all inclusive holiday", "helpfulness": 2, "user": "gcruicks", "date": "September 15, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 41845007}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "Im not being negative, as I know there is a great deal of loyal guests out there but the major problem to get a sun brolly was a big problem. Plenty of sunbeds, but no good if you cant sit in the blazing sun all day. You could get one but you would need to be off your mark at 8am to secure one. One brolly to ten beds.", "title": "lovely hotel", "helpfulness": 1, "user": "Tazzie47", "date": "September 10, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 40677974}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled with family", "text": "we stay @ halloween 2008. my husband myself and our 11 year old son and we were blown away. it was awesome. words cant describe it.", "title": "brilliant hotel with best food ever", "user": "shopping66", "date": "September 24, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 1.0, "service": 5.0, "rooms": 5.0}, "id": 44244904}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "We stopped at this all-inclusive hotel and had a superb time.", "title": "Probably the best hotel we've stopped in", "helpfulness": 1, "user": "MikeHStaffs", "date": "September 24, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 3.0, "service": 5.0, "rooms": 4.0}, "id": 44136727}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "There are several different restaurants which you can use at no extra charge - with waiter service, as well as the excellent main buffet restaurant. All food was of very good quality.", "title": "Fantastic food,beautiful surroundings to sit back,relax and enjoy", "helpfulness": 1, "user": "Goldie41", "date": "September 22, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 3.0, "service": 5.0, "rooms": 2.0}, "id": 43697430}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "The rooms ara large, clean and well equipped.", "title": "Fantastic!", "user": "AbnJay", "date": "September 22, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 43569122}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled with family", "text": "The best part though are the drinks - you can help yourself to wine, beer, soft drinks and coffee etc from several different locations during the day - or be served if you prefer. In the main bar/foyer there are the same choices plus all spirits and mixers for self service - or again if you prefer you can order at the bar.", "title": "Great Hotel, Would Definitely Go Back", "helpfulness": 2, "user": "JMT99", "date": "September 21, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 43325360}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "we have been to all inclusive hotels all over the world especillay the caribeen and I was not keen to go to tenerife but it was my husbands choice and off we went on our hols but how wrong was I this has been the best holiday we have ever been on we could not fault one moment of it! cleanlieness,staff attitudes,entertainment,the spa espicially sara the nail technician! it was fantastic from beggining to end and we will come back these people who complain would also complain in heaven! take a chance go there and have a fab time!", "title": "wow", "helpfulness": 3, "user": "cassie252", "date": "September 10, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 40552326}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "If you want to relax this is the holiday for you. Staff pleasant, helpful and friendly. Room excellent, cleanand mini bar excellent. Food was great, Spanish Restaurant the best. Slight disappointment \"the adult swimming pool\" more children than adults buy hey if that's all you have to complain about then it's not that bad!!!", "title": "Fantastic - Best Holiday to Date", "helpfulness": 5, "user": "DodandBunty", "date": "September 7, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 40045235}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "Pool area great, pool snack bar had everything you need with really friendly staff who would do anything for you. Coffee fantastic.", "title": "Wonderful Hotel, But Very Isolated, Dont Go If You Have Poor Mobility", "helpfulness": 1, "user": "LondonAlanna", "date": "September 5, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 1.0, "service": 5.0, "rooms": 5.0}, "id": 39833385}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "The terrace in the evening was lovely, never been anywhere where you can mix your own drinks, they have everything so well organised, even the take away service (drinks) for your room.", "title": "Still As Good", "user": "FamilyP41", "date": "September 4, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 2.0, "service": 5.0, "rooms": 5.0}, "id": 39737532}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "First the downside: This hotel is about 7K from Las Americas and situated in what I would describe as an unattractive area. Outside the hotel on oneside is a large gully, on the other side is rough ground leading down to the sea. There appears to be no beaches in the immediate area. That said we have been lucky enough to have stayed in Riu, Iberostar, and Bahia Principe hotels in Europe and the Caribbean. This is the best we have been in. It is a large hotel built on terraces down to the sea. The gardens are very attractive, running down from the reception area to the sea. The pools are set out in the garden area and include an infinity pool looking over the sea. The food is very, very good. and include an Asian, Seafood, Spanish and Italian restruarants which can be visited three times during a weeks stay. Service is excellent and as much wine as you wish. The rooms are large and clean. I would suspect people with walking difficulties may find problems with the slopes, however there are ramps and all areas of the hotel can be reached by lifts. Las Americas can be reached via a bus from the hotel for 5 Euros return, the morning run is at 9.30am and returns at 1pm. The afternoon run is at 12 noon returning at 6pm. A local bus service also connects to LA and other parts of the Island. Entertainment is better then average you can chose between the usual show type in the main square or small bands on the terraces. The accomadation is painted in bright colours giving the impression of an Italian village. Overall a very good hotel with friendly staff.", "title": "First Class", "helpfulness": 4, "user": "EddieLondonEngland", "date": "October 5, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 1.0, "service": 5.0, "rooms": 4.0}, "id": 45886935}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "Just returned from Tenerife, fantastic Hotel and grounds. we have been AI before in europe and the carribean, this is on Par with Dom Rep and Mexico, great AI with no restrictions.", "title": "Great Hotel, how all inclusive should be", "helpfulness": 3, "user": "GrahamSussex", "date": "October 5, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 3.0, "service": 5.0, "rooms": 5.0}, "id": 45867339}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled with family", "text": "only down side is the bars stop serving at 1130pm.", "title": "second time here and still love it", "helpfulness": 4, "user": "yummymum06", "date": "October 2, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 3.0, "service": 5.0, "rooms": 4.0}, "id": 45696315}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "The hotel is remote as per the description so don't go if you like to wander out at night, the only thing this hotel lacks is a beach (shame), we will go back as this was a nice chilled week at a good quality Hotel.", "title": "Wonderful hotel - couldn't have asked for more", "helpfulness": 3, "user": "Ruth15Scotland", "date": "October 1, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 45602852}, {"rating": 5.0, "stay_parameters": "Stayed September 2005", "text": "Our third visit to BP and once again we were not disappointed. There had actually been quite a few changes since our last visit, some for the better and some not so good.", "title": "Still excellent", "helpfulness": 33, "user": "PollyB", "date": "October 5, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 4.0}, "id": 3993288}, {"rating": 5.0, "title": "First Class Hotel", "text": "It seems that a lot of the 'rules' about visiting different restaurants have been relaxed - you still have to book the a la carte restaurants, but there is none of this swapping 2 in the Adeje hotel for one in the Tenerife hotel going on any more. Only the buffet restaurants are 'out of bounds' to guests from the other hotel, and while we were there we spoke to a family for whom this had also been relaxed because their party was split across the two hotels.", "helpfulness": 16, "user": "A TripAdvisor user", "date": "September 29, 2005", "id": 3970175}, {"rating": 5.0, "stay_parameters": "Stayed September 2005", "text": "Some of the restaurants have also changed their offerings - we were particularly impressed with the Spanish restaurant in the evening. It is all now waiter service, and we had some of the best steaks we have had in ages. The cheese and fruit dessert was also fantastic! All the rest were also very good (esp Asian and Seafood), but we liked the Spanish the best.", "title": "superb hotel,excellent facilities ,recommended to All!!!", "helpfulness": 27, "user": "lusciouslady", "date": "September 7, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 3881147}, {"rating": 5.0, "stay_parameters": "Stayed August 2005", "text": "The beach has also been considerably developed, and was our new favourite place to spend our days. They have put in some thatched sunshades, showers and a beach bar with seating area which is manned for much of the day. They also play some nice chill-out music down there, which creates a lovely ambience. The man in the beach bar would go round a couple of times a day and pick up anything that washed in, so it was always fairly clean and tidy, and he would also set up sunbeds and the like for you. Few of the other guests bothered to go down there (it was down quite a steep hill, and there were no loos down there, so you had to plan ahead if you know you are going to go), so at times there were only 10-12 people on the beach which meant that it was lovely and quiet. We also two or three times were able to watch whales just off the beach (one time they were really jumping) which really added something special.", "title": "great food", "helpfulness": 23, "user": "donzi", "date": "August 13, 2005", "detail_rating": {"value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 3759547}, {"rating": 4.0, "title": "relaxing holiday in a lovelly hotel", "text": "The only things that had not improved centred around the entertainment. There were a few new members of the animation team, one in particular of which was particularly annoying. She was rather too loud and over-pushy in trying to get you to take part in things until I told her in no uncertain terms to leave us alone. That said, some of the daytime activities were excellent, including the water polo and aqua aerobics.", "helpfulness": 15, "user": "A TripAdvisor user", "date": "August 11, 2005", "id": 3754543}, {"rating": 5.0, "stay_parameters": "Stayed November 2005", "text": "first experience of all inclusive and would definately recommend this hotel complex. Food good and varied. Surroundings very clean and well kept.Staff friendly and efficient.Tenerife hotel is a bit quieter, but still plenty to do. Probably best for a one week holiday as there is not much available in the surrounding area unless you take a taxi to Las Americas etc. Overall an excellent holiday experience.", "title": "Excellent hotel.", "helpfulness": 14, "user": "franna", "date": "November 26, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 4.0}, "id": 4144805}, {"rating": 2.0, "title": "Not a Four Star Rating in my opinion!", "text": "I have just returned with my husband from our first all inclusive holiday at the Bahia Principe and I have to say I will not be booking again. I will bullet point the main reasons for my low recommendation of this hotel.", "helpfulness": 15, "user": "A TripAdvisor user", "date": "November 14, 2005", "id": 4110590}, {"rating": 5.0, "stay_parameters": "Stayed October 2005", "text": "1. Location - the hotel is located on an outcrop of land between costa adeje and playa paraiso. The road to the hotel is unlit and unmarked and the bus and taxi drivers use it as a rally course. You can only walk to playa paraiso from the hotel which is a bit up and down and a good 20-30mins walk and even out here you are pestered by touts - they stalk you in cars! The bus only runs 3 times a day to Las Americas with the latest outward journey 1pm and the latest return 5pm not great if you want to spend a day or night out of the hotel.", "title": "Excellent All Round Hotel", "helpfulness": 18, "user": "Jane131262", "date": "November 9, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4101911}, {"rating": 5.0, "title": "Loved It!!!", "text": "2. Service - The service in general is ok. The public relations girls were as efficient as possible however they were unable to cope with the large amount of people booking restuarants and excursions, thus resulting in us waiting 40 mins to be served and then being booked into restuarants at times that were not what we had wished for. Check in and Check out were extremely busy and nobody waits in line.", "helpfulness": 19, "user": "A TripAdvisor user", "date": "October 19, 2005", "id": 4034324}, {"rating": 5.0, "stay_parameters": "Stayed September 2005", "text": "3.Cleanliness - the cleanliness of the hotel in general was to a reasonably high standard however pigeons in the restuarants and dining areas and in particular the snack bar at the pool where they used the pool to wash, drink and poo was just disgusting!", "title": "bahia principe - hey hey", "helpfulness": 35, "user": "Madub", "date": "October 17, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 4027734}], "location": {"country": "Spain", "continent": "Europe"}, "variance": {"poor": 86, "average": 198, "very good": 744, "terrible": 33, "excellent": 1408}, "aka": "Bahia Principe Costa Adeje Hotel Adeje", "slim_ranking": 0.0833333333333, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.0, "rooms": 4.0, "location": 3.5}}