{"user_rating": 4.0, "review_count": 1621, "name": "Bahia Mar Fort Lauderdale Beach - a Doubletree by Hilton Hotel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "My fiance and I stayed at the Bahia Mar Hotel from April 11-16. We had a wonderful experience and highly recommend this hotel. Frankly, I was quite surprised after reading all the negative reviews - I have to say that my expectations were met and exceeded at the Bahia Mar. We booked online for around $120 a night.", "title": "Loved the Bahia Mar!", "helpfulness": 8, "user": "beachlover325", "date": "April 20, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7403388, "likes": {"liked": "— Excellent location - close to beach, shops, restaurants and bars.", "disliked": "— Very small balcony - standing room only."}}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled solo", "text": "Check in: Quick and we were upgraded to an ocean view for no charge. The gentleman at the desk was very friendly and briefly pointed out the features of the hotel - pool, walkway to beach, bars, gift shop, restaurants and the deli.", "title": "Much better than expected", "helpfulness": 3, "user": "smdnyc", "date": "April 17, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 3.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 7380347, "likes": {"liked": "— Pool area", "disliked": "— Paint chipping a little in the room - not a big deal to me"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "Room: Our first room was room 332 which I DO NOT recommend. It was directly attached to the conference room next door - it was literally sharing a door like you see in shared rooms. We could hear the speaker begining his presentation quite clearly, which means we would have had no privacy. So we took our belonging back downstairs and requested another room. They didn't hesitate and apologized for the inconvenience. We were given room 1514, which had a beautiful view of the ocean, marina and pool since it was on the end of the building.", "title": "Pleasantly surprised !", "helpfulness": 2, "user": "Sandy823", "date": "April 14, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 5.0, "rooms": 4.0}, "id": 7352035, "likes": {"liked": "— location"}}, {"rating": 3.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "There was an entertainment center with tv, which had three drawers for clothes, a comfy king bed with fluffy pillows and down comforter, an arm chair, seperate table for working with two chairs, and two night stands. Our closet area was huge and across from the sink. The bathroom was very simple with a tub/shower combination and toliet. Everything was very clean and in good condition. Internet is $9.95 a day in the rooms (pricey) but there are four computers in the lobby that have 24/7 internet access.", "title": "Better than Expected", "helpfulness": 2, "user": "Anonymous555", "date": "April 5, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 2.0, "value": 4.0, "location": 5.0, "rooms": 2.0}, "id": 7285106, "likes": {"liked": "— Location. Comfortable beds & linens.", "disliked": "— Rooms need some TLC."}}, {"rating": 5.0, "title": "Relaxing Experience", "text": "Location: We were just a short walk from Oasis Cafe (a must try if only for their cool glider seats), a 7-11, the beach and further down an array of restaraunts, bars and shops. Las Olas is only about a 5-10 minute cab ride (usually around $10) and sometimes we'd walk, which can take awhile (30-40 minutes to reach the area of Las Olas that has the restaurants and shops) but is a really nice walk, with views of the beautiful houses and boats along the waterway.", "helpfulness": 2, "user": "JeanerBeaner", "date": "April 4, 2007", "id": 7282245}, {"rating": 2.0, "stay_parameters": "Stayed March 2007, traveled on business", "text": "Bahia Mar, what's in a name a hotel by another name would still be just as pricey but worth the cash. How to say this nice, the name Bahia Mar brings to mind million dollar yachts, beach, sun and of course Fort Lauderdale without the Springbreaker.", "title": "Not for the money - not for the name either", "user": "Divecop3", "date": "March 25, 2007", "detail_rating": {"front_desk": 1.0, "business": 3.0, "service": 1.0, "cleanliness": 3.0, "value": 2.0, "location": 2.0, "rooms": 3.0}, "id": 7219540, "likes": {"liked": "— The king bed - very comfortable", "disliked": "— The price and location"}}, {"rating": 1.0, "stay_parameters": "Stayed March 2007, traveled on business", "text": "Well, our recent business stay at this once proud hotel was far from the yester-year expectations. My wife and I are not the only ones to think so either. At our function were representatives of various Fort Lauderdale related businesses, such as the airport, taxicab companies and others. They all said what I just typed, \"but you should have seen this hotel when.....\"", "title": "Filthy and Rude", "user": "Beechjetdd", "date": "March 22, 2007", "detail_rating": {"front_desk": 1.0, "business": 2.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "location": 5.0, "rooms": 1.0}, "id": 7203374, "likes": {"liked": "— Marina Location", "disliked": "— Dirty Filthy"}}, {"rating": 2.0, "stay_parameters": "Stayed March 2007", "text": "Tips to remember, when asking for an \"ocean view\" make sure in your mind what you are expecting. When wanting to eat for under $500,000 per person go south of the hotel a restaurant called \"(something) Cabana\". You cannot miss it, with 3 minute walk of the hotel just pass the fishing boats and glass bottom boat tour along the south marina. Great BBQ and views of the marina action. Anything else you want to do, well get use to driving but be careful because the cab drivers will stop on a dime to get a waiting/walking customer on the curb.", "title": "Great Location.....BUT", "user": "AuntyMo", "date": "March 21, 2007", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 4.0, "cleanliness": 4.0, "value": 2.0, "location": 5.0, "rooms": 4.0}, "id": 7196149, "likes": {"liked": "— view from room window", "disliked": "— fire-alarm system"}}, {"rating": 3.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "I will also recommend a place called \"Trini\" just about 1 mile north of the hotel on the same side and street. It is very expensive, nothing under 20 bucks unless you like little red potatos ($7.00 for four of them). But if you've never pampered yourself like that before, good place to do it. The staff is really friendly, waiters are very funny and the food is well worth the wait time.", "title": "Good Time", "user": "Grandmoe4", "date": "March 19, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 3.0, "value": 3.0, "rooms": 2.0, "location": 4.0}, "id": 7190874, "likes": {"liked": "— Pool beach", "disliked": "— Room"}}, {"rating": 2.0, "stay_parameters": "Stayed March 2007, traveled solo", "text": "Another AWESOME place to go, \"Laffing Matterz\". I will stop short of calling it dinner-theater because its more of a dinner and a comedy review. Only opened about 18 months ago and in my opinion revivals the old Saturday Night Live (when it was funny).", "title": "Great location, bad hotel", "helpfulness": 3, "user": "bagman88", "date": "March 6, 2007", "detail_rating": {"front_desk": 2.0, "service": 1.0, "cleanliness": 2.0, "value": 2.0, "rooms": 2.0, "location": 4.0}, "id": 6921171, "likes": {"liked": "— Location", "disliked": "— The cluelessness of the staff and shabbiness of the building"}}, {"rating": 2.0, "stay_parameters": "Stayed May 2007, traveled solo", "text": "Bed was very nice, with nice linens, but the hotel was tired and needs some serious renovations. No water available in the room, vending machines, or room service. They had sold out all round.", "title": "In need of an update, place smells", "user": "NZChef", "date": "May 14, 2007", "detail_rating": {"front_desk": 3.0, "service": 4.0, "business": 3.0, "value": 1.0, "rooms": 3.0, "location": 3.0}, "id": 7605691, "likes": {"liked": "— Beds", "disliked": "— Dirty, no water available"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "The mini bar chillers were out of order, dirty carpets and bathrooms. The place feels unclean and run down. My room was$150 a night, marina view. It's shame you have to spend so much now for a night away, just to get the basics. And the place smells. $10 per day wireless access", "title": "great hotel", "user": "Radders1", "date": "May 12, 2007", "detail_rating": {"cleanliness": 5.0, "front_desk": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 7591369}, {"rating": 2.0, "stay_parameters": "Stayed April 2007", "text": "Great hotel, lovely large rooms. Great view. Super kingsize bed was fantastic. Large walk in wardrobe. highly recommend. suggest you request a high floor in main hotel to take advantage of great views.", "title": "Avoid the Bahia Mar if possible", "helpfulness": 2, "user": "pennstater4ever", "date": "April 28, 2007", "detail_rating": {"front_desk": 2.0, "business": 1.0, "service": 2.0, "cleanliness": 1.0, "value": 2.0, "location": 4.0, "rooms": 2.0}, "id": 7479460, "likes": {"liked": "— Location near Hall of Fame pool and across from beach", "disliked": "— general condition and cleanliness of hotel"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled with friends", "text": "This hotel has definitely seen better days! We have stayed there 4 Aprils in a row, due to the fact that our son's swim team stays there for YMCA Nationals. It has gotten worse every year and could stand a major renovation.(Only the bedspread has changed, but not the bed skirt.) Carpets are dirty, things don't work, rooms aren't real clean, elevators are slow or non-functioning. Also observed bugs in one room. No beach towels provided by hotel. Location is ok -- for us it is within walking distance of the Hall of Fame pool, which is the only reason we've continued to stay. It is right across from the beach, albeit not the nicest beach in town. Ft. Lauderdale's beachfront is undergoing a major facelift; hopefully this property will soon follow.", "title": "Pleasantly surprised!!", "helpfulness": 4, "user": "PalmBeachGirl25", "date": "April 26, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 7444917, "likes": {"liked": "— It was close to everything, clean and the staff was great!", "disliked": "— Breakfast was a little prices at $20 a person for eggs, homefries, bacon and juice!"}}, {"rating": 4.0, "title": "Great Stay", "text": "I was traveling with a group of friends, all young professionals in our mid 20's. Collectively, we've stayed at some pretty crappy hotels in our years, but our preference is nice, 3+ star hotels. Even though we were technically just looking for a bed to crash in after we checked out Ft. Lauderdale’s nightlife, it had to be a CLEAN bed!!", "helpfulness": 3, "user": "closeanuf", "date": "April 23, 2007", "id": 7420493}, {"rating": 3.0, "stay_parameters": "Stayed February 2007", "text": "My daughter had her wedding reception here. There were many problems with that but that's another review. The rooms were clean and spacious with breathtaking views. The room service was good. The staff is very helpful and nice. Great pool and bar, nice walkway to beach but long. On the down side, there was no fridge in room and the balcony is way too small. The restaurant is overpriced. The parking fee is $18.00 a day for self park. The cleaning staff didn't show up to clean room until 4 pm.", "title": "Just so so", "helpfulness": 2, "user": "mssha44", "date": "February 28, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 6893105, "likes": {"liked": "— the view", "disliked": "— The balcony"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "Would I stay there again, probably not.", "title": "Exactly what I was looking for.", "helpfulness": 2, "user": "Spinyli", "date": "February 26, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 3.0}, "id": 6842644, "likes": {"liked": "— Great price for the location.", "disliked": "— There really is nothing i can think of that I didn't like about Bahia Mar."}}, {"rating": 3.0, "stay_parameters": "Stayed February 2007, traveled with family", "text": "I wanted to stay in a nice place that wasn't going to break the bank. The hotel was clean, the people were pleasant, the location was great. Pool side bar was nice. Overall, if you're looking for something that's clean, centrally located to the beachfront bars, watersports, and the beach, stay here. Don't waste your money on more expensive hotels.", "title": "Just ok", "helpfulness": 1, "user": "Hdsmemphis", "date": "February 22, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 2.0, "value": 3.0, "rooms": 2.0, "location": 4.0}, "id": 6829194, "likes": {"liked": "— location", "disliked": "— very old"}}, {"rating": 3.0, "stay_parameters": "Stayed February 2007, traveled with family", "text": "Hotwire rates it at a three star but I disagree. We stayed in the building that does not contain the lobby so I can only speak for that part of it. It was more like a motel not a hotel. The hallways are very old and beat up and they smelled very musty. The room was ok. The carpet was old and dirty but the beds were clean. We also had to pay $18/day for parking. This was not mentioned on hotwire. Check in was easy and the staff was friendly. We payed $150/night. I guess what you pay for is location. It is across the street from the beach and they have their own walkway that connects the hotel to the beach. I don't think I would stay there again for that price. You can pay a little extra in the same location for a much better hotel.", "title": "Good hotel..!", "helpfulness": 2, "user": "ecu_traveler", "date": "February 20, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 3.0}, "id": 6814702, "likes": {"liked": "— Location", "disliked": "— Price of parking"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "The hotel in overall is Good. I was scared for some reviews i read, but for my surprice my stay was pleasant.", "title": "nice hotel", "helpfulness": 2, "user": "jbizzle2", "date": "February 18, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 3.0, "value": 3.0, "rooms": 4.0, "location": 4.0}, "id": 6808831, "likes": {"liked": "— pool/bar area", "disliked": "— slow elevators"}}], "location": {"country": "United States", "city": "Fort Lauderdale"}, "stars": 3, "variance": {"poor": 146, "average": 251, "very good": 585, "terrible": 110, "excellent": 529}, "aka": "Bahia Mar Beach Hotel", "slim_ranking": 0.345864661654, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.5, "location": 4.5}, "description": "Enjoy stunning surroundings and 44 breathtaking acres along the Intracoastal Waterway at the Bahia Mar Fort Lauderdale Beach hotel- a DoubleTree by Hilton Hotel. Located near the International Swimming Hall of Fame, the Bahia Mar Fort Lauderdale Beach hotel is a water taxi ride away from the shops, restaurants and nightlife of Las Olas Boulevard. Stay active with water sports, indulge the option to sail away on a cruise or simply relax on the white sandy beach. Bahia Mar is only a short drive from the Fort Lauderdale International Airport and Port Everglades Cruise Terminal."}