{"user_rating": 4.0, "review_count": 1529, "name": "Bahia Resort Hotel", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "This hotel is incredibly located by Mission Beach, but needs a significant refurbishment.", "title": "Great location, in need of serious refresh (and hot water)", "helpfulness": 2, "user": "rsp1", "date": "January 4, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 2.0, "location": 5.0}, "id": 148846832}, {"rating": 3.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "The rooms are clean, have balconies/terraces and are reasonably-well equipped. The amenities end there.", "title": "new years mess", "helpfulness": 1, "user": "1baggo", "date": "January 3, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 148674688}, {"rating": 3.0, "title": "Christmas break", "text": "Largest complaints:", "helpfulness": 1, "user": "VixxG", "date": "January 2, 2013", "id": 148658949}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with friends", "text": "-No hot water (cold at night, luke warm at best in mornings / \"off peak\")", "title": "Great New Year.", "user": "Lily5454", "date": "January 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 148627646}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "-Plumbing noises when sink used next door only slightly quieter than a missile launch", "title": "Good location, services, and others ...", "helpfulness": 1, "user": "Ed02", "date": "December 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 148399533}, {"rating": 2.0, "title": "mixed", "text": "Mixed felling about the Bahia. The room was large(studio suite bayside). The kitchen was ok. Stove/oven half normal size, no microwave, full size fridge. The closet really did smell awful. The whole room is outdated. The bay is a great place for early risers to collect seashells. The so called private beach is only 1/4 of the resort. The rest is public beach. That is where our room was. I was shocked by how many R.V.'s were parked and camping tents and all an the bahia parking lot. They even blocked the view for some of the guests. You do have the ocean 2-3 blocks away. and the Bahia Belle boat was fun. Not worth the cost not even close. You are paying for location.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "August 9, 2004", "id": 2432662}, {"rating": 2.0, "title": "Great location, but needs major renovation!", "text": "We were able to see the seaworld fireworks everynight from our suite. Stay there for great location. Don't have ANY expectations of a nice hotel. It just needs a lot of work. NOT worth the cost.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "August 8, 2004", "id": 2429603}, {"rating": 3.0, "title": "Just returned from our 4th visit", "text": "I stayed at the Bahia many years ago as a child... This summer we took our two kids for a few days. The kids loved it - great pool, playground on the beach, lots of boats and birds to look at, etc. Easy walk to Belmont amusement park.", "helpfulness": 4, "user": "6Quinns", "date": "August 6, 2004", "id": 2426962}, {"rating": 4.0, "title": "Room location is important", "text": "Cafe and room service were fine. Good drinks poolside. The hotel operates a New Orleans-style paddle boat from the Bahia to their other property on the other side of the Bay, which is free to guests. We all enjoyed that.", "helpfulness": 7, "user": "hillmel", "date": "August 4, 2004", "id": 2381650}, {"rating": 1.0, "title": "Makes Motel 6 Look Good at twice the price", "text": "Hubby and I were majorly disappointed with our suite. It was in need of a major renovation - bathroom was \"icky\", permanent wet spot on the carpet from a toilet leak, smelled of mildew throughout, no screen on patio door so I couldn't keep it open at night (hello - heard of West Nile virus?), furnishings and beds needed to be replaced, poor lighting, overall dorm room decor. I would not go back unless they do the renovations. Perhaps the Tower rooms are more up to date but the suites are showing their age.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "July 29, 2004", "id": 2332797}, {"rating": 3.0, "stay_parameters": "Stayed December 2012", "text": "Needs renovating. Great location. Super duper service from front desk, and great maid service. If we come here again, I would get the rooms facing the bay. Bought the hotel/sea world package...came in december with great weather...GREAT DEAL!", "title": "Clean, but outdated...needs renovating. Great maid service. Great location. Would come again.", "user": "imhbillingservices", "date": "December 21, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 3.0}, "id": 147868460}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "I found a really great deal for Bahia through AAA. Stayed here for 2 nights.", "title": "Beautiful location with friendly staff", "user": "Zwander", "date": "December 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 147708799}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "The resort is 5 min drive to SeaWorld and a 5 min walk to the Mission Beach. There is a private beach on the Mission Bay available for resort guests. The water look okay but scenery beautiful. There are also a lot of water activities available for the resort guests.", "title": "Nice bayview studio - great grounds", "helpfulness": 1, "user": "PhilPorterRanch", "date": "December 18, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 147703728}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled with friends", "text": "The front desk and cafe staff is super cheerful and friendly and genuinely cares about guests. The rooms are good sized but it has somewhat of an aging feel.", "title": "Vietnam Veteran's Reunion at the Bahia Resort", "user": "DarleneMG", "date": "December 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 147693567}, {"rating": 5.0, "stay_parameters": "Stayed September 2012", "text": "Overall, a great value resort.", "title": "Can't wait to go back", "user": "Cookie1214", "date": "December 17, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 147631192}, {"rating": 2.0, "title": "Stay here only for Location, but pay a lot for it!", "text": "Like the other reviewers, I was apprehensive in staying at this hotel. And after staying in this hotel, it's not what you call a hotel worthy of the amount you pay for the kind of room you get, but maybe worthy of paying for LOCATION.", "helpfulness": 8, "user": "A TripAdvisor user", "date": "August 19, 2004", "id": 2462379}, {"rating": 3.0, "title": "Lovely Hotel - Great Pool", "text": "We stayed in the Cabrillo Suites next to the public parking lot, and every single night we got the chance to see the fireworks from Seaworld. And on most nights we also got the chance to listen to the noise from the parking lot from a sundry of people playing music to driving up and down the parking lot lane with their suped up engines.", "helpfulness": 2, "user": "Amandamanx", "date": "August 18, 2004", "id": 2459489}, {"rating": 4.0, "title": "Better than the reviews", "text": "As for inside the room, the carpets were really dirty! The bathroom also needed a good scrubbing and the tiles in the bathtub were broken with mold growing in the cracks. The bed in our room was a king sized bed with a huge sump in the middle where two people would fall naturally into it. No smell except for lingering cigarette smoke in our room. The sliding glass door latch was broken so it was mandatory to use the bolt on the floor to keep the door close as we were on the ground floor level. If you have little kids, forget about them taking a bath, there's no way to stop up the drain.", "helpfulness": 10, "user": "A TripAdvisor user", "date": "August 17, 2004", "id": 2457290}, {"rating": 4.0, "title": "Fun Place for Watersports", "text": "Housekeeping is spotty, sometimes you get clean glasses, sometimes your garbage sits for an extra day, and sometimes the kitchen is cleaned.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "August 11, 2004", "id": 2442206}, {"rating": 4.0, "title": "it was lovely", "text": "This is not a place we'll be staying again in the future. We'll go stay at a Courtyard by Marriott or a Residence Inn.", "helpfulness": 1, "user": "GLMDesigns", "date": "August 9, 2004", "id": 2432846}, {"rating": 4.0, "stay_parameters": "Stayed December 2012", "text": "Have been staying here for more than 30 + years. Always accommodating my needs. Even when @ last minute, the front desk finds a way to find a room for me. The sailing is great, room service is prompt. Will continue for another 30!", "title": "Awesome!", "user": "Dzervit", "date": "December 15, 2012", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 147501311}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "The sun was shinning on a perfect San Diego day at Mission Bay. The view from the room was as good as it gets. The beach side rooms have a glorious views both day and night. On check in day we enjoyed the Tangier Bar. The next morning before golf, I enjoyed the cinnamon french toast for breakfast. A lot of activities are available. Sailing, Paddle Boarding, Riverboat Ride on the bay (free), Kayaking, Soaking up the Sun on The Beach and more. Best location on Mission Bay. This was my fourth visit to the Bahai, and we'll be back.", "title": "The Bahia Hotel - Mission Bay San Diego", "user": "Bernard S", "date": "December 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 147403068}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled solo", "text": "The resort was perfectly located right on the bay with an easy walk to a few local bars and restaurants. The grounds were immaculately kept w/ a great view from my room of the bay. The front desk staff and especially one of the managers of the resort, Steve, took amazing care of anything I needed while I was there for the week!", "title": "Amazing Resort w/ the best staff!!!", "user": "Julia S", "date": "December 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 147334764}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "During my stay I made sure to try out the Bahia Belle that runs on the weekend between Mission Beach and Pacific Beach. I had heard great things about it from a few locals and they were certainly right! There was a bar, dance floor, and a band for the night - couldn't ask for better while enjoying the beautiful views of Mission Bay.", "title": "Pleasant hotel", "user": "123163", "date": "December 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 147266650}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled on business", "text": "I also stopped in a few nights to the Tangier Bar for happy hour. They had great specials and the bartenders were all very friendly and a pleasure to talk to.", "title": "KUDOS on Customer Service!", "helpfulness": 1, "user": "tehnrgirl", "date": "December 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 147256821}, {"rating": 4.0, "stay_parameters": "Stayed January 2005", "text": "Been here twice. First time we stayed in a Garden View Room overlooking Mission Bay. This is one of the cheapest rooms if not the cheapest. It was small and a bit damp and fairly dated but not unpleasant. The plus was that the patio door opens to nice walkway with palms and view across the perimeter road out to Mission Bay.", "title": "Nice resort", "helpfulness": 11, "user": "LVSaint", "date": "March 24, 2005", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "service": 4.0}, "id": 3298140}, {"rating": 4.0, "title": "Bahia Hotel- Great place to stay", "text": "The second stay was a much nicer. Booked 2 nights in a Bay Front room overlooking Santa Barbara Cove and marina. Slightly bigger, airier room with sliding door to patio, lawn and beach - very pleasant view and surroundings. Great for kids since there is a playground on the beach near these rooms.", "helpfulness": 8, "user": "kelly898", "date": "February 15, 2005", "id": 3193146}, {"rating": 2.0, "stay_parameters": "Stayed January 2005", "text": "I managed to get a free upgrade for the second night to a Bay Front Deluxe room a few rooms down. Lovely room with seperate lounge and kitchen opening out to patio and beach. Very relaxing and nice to have that much more space.", "title": "We do not recommend the Bahia", "helpfulness": 13, "user": "TRAVEL_9999", "date": "January 10, 2005", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "service": 2.0}, "id": 2993802}, {"rating": 4.0, "stay_parameters": "Stayed December 2004", "text": "All in all - nice location and grounds, good for families, basic rooms not exactly luxurious.", "title": "nice winter vacation hotel", "helpfulness": 5, "user": "KathleenLisson", "date": "December 27, 2004", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 2947166}, {"rating": 3.0, "title": "Nice Place to stay", "text": "We stayed a the Bahia for Valentines Day weekend. We got a studio room which was very clean and roomy. I loved the big porch and window. We had a nice view. The staff was very helpful and courteous. Loved being so close to the beach and the bahia belle is a great way to get to the pacific beach nightlife for free! It was a great trip!", "helpfulness": 4, "user": "Minnich D", "date": "November 21, 2004", "id": 2838671}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "My husband and I stayed at the Bahia to celebrate our wedding anniversary. We had an amazing time. Our room had a great view of Mission Bay and we went on the William D. Evans for a cruise along Mission Bay. There's some really good inexpensive restaurants all within walking distance from the Bahia. We had an unforgettable time and I can't wait to come back!", "title": "Fantastic Wedding Anniversary", "user": "Melissa S", "date": "December 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 148356555}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "My boyfriend and I stayed at the Bahia and had a great time. We had a beautiful view of Mission Bay. The staff was friendly and provided us with many dining options within walking distance. We also took a stroll down the boardwalk on Mission Beach. We had so much fun and the weather was perfect!", "title": "Fantastic View of Mission Bay", "helpfulness": 1, "user": "Karen F", "date": "December 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 148283320}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled on business", "text": "We were there for a union convention and were pleasantly surprised! Very quiet and a great location! Restaurant on site was good and the banquet food was above average. Loved the gift shop! Check out was a breeze! The best part was that you're in walking distance of the beach and can walk for miles from the San Diego River north!", "title": "pleasant surprise", "user": "MKHNAFL", "date": "December 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 148228611}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "Everything about this resort and hotel is family friendly! The staff is cheerful, courteous and helpful. It offers so many different things to do from feeding rescued seals, to renting paddle boats, bikes and sail boats to enjoying their \"Bahia Belle\", a “Turn of the Century” Mississippi-style sternwheeler that offers boat cruises in Mission Bay to a large pool and jacuzzi. Plus the rooms are right on the bay so you really can wake up and walk from your large patio to a beautiful grassy area and then step right onto the sand and bay -- great for the kids to play. Food is fresh and offers a variety of meals and in room service. Wonderful kids menu at great prices. They offer so much to do that there's really no reason to go anywhere else -- it's all right there, and convenient. Relaxing atmosphere! It's what all vacations spots should be like.", "title": "Great Family Resort & Hotel", "user": "joan w", "date": "December 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 148101239}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "Had a very nice one night stay. This would be a very good hotel if you are coming for a few days or a long term stay. Our Bayside Studio slept four with king bed and roll out sofa and included a full kitchen, great for saving money on meals. The resort has many rentals including kayaks and bikes. The bay is a great place to kayak. The beach and Belmont Park are within walking distance, although the resort has its own bayside beach with covered lounge chairs. There is a cafe on site. We only dined there for breakfast, had the buffet which was included in our room fee. That was just okay, nothing special, but the service was great. All in all the staff was friendly and accommodating. Many restaurants are nearby and the resort is convenient for exploring San Diego with a car. There was no resort or parking fee. I would recommend this hotel for a nice stay in San Diego.", "title": "Nice and Relaxing", "helpfulness": 1, "user": "neecee23", "date": "December 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 147915233}, {"rating": 2.0, "title": "Don't get the top floor...", "text": "If you get a room at the hotel tower, change or refuse it immediately for above you is a conference hall they rent out for weddings/conventions. Three nights of sleep were a write off because of the noise that came through the floor during different events. The next problem is the next morning at 5am they decided to clean up and hence there were tables and chairs banging everywhere... Management did nothing after we complained at morning..", "helpfulness": 10, "user": "A TripAdvisor user", "date": "November 10, 2004", "id": 2817968}, {"rating": 1.0, "stay_parameters": "Stayed July 2003", "text": "Our family stayed over the 4th of July in 2004. I am still having nightmares. The place was dirty, loud and disgusting. Cars could be heard all night in and out of the parking lot. I could hear people next door partying until all hours. The beach was dirty and yes, there is a huge drop off from the sand to the water. I couldn't believe what I was paying for what we got. I will say the restaurant food was good. However, that is the only kind word I can give. We ended up leaving early.", "title": "Don't waste your money", "helpfulness": 4, "user": "TraceBonaise", "date": "November 1, 2004", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "rooms": 2.0, "service": 3.0}, "id": 2798953}, {"rating": 5.0, "title": "Perfect Family Hotel", "text": "We loved this hotel! Full kitchen and a verynice pool and beach. Great for families and 3 minutes from seaworld and community lots.Stay Here!", "helpfulness": 2, "user": "A TripAdvisor user", "date": "October 14, 2004", "id": 2703873}, {"rating": 1.0, "title": "don't do it", "text": "This was the last stop on my summer holiday this year and I was very nervous after reading the reviews here. It was worse than I could ever have thought possible.", "helpfulness": 11, "user": "A TripAdvisor user", "date": "October 3, 2004", "id": 2616544}, {"rating": 4.0, "stay_parameters": "Stayed July 2003", "text": "The staff at check in were incredibly rude and totally unhelpful.", "title": "Great View", "helpfulness": 6, "user": "Robochop", "date": "August 31, 2004", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "service": 3.0}, "id": 2504318}], "location": {"country": "United States"}, "stars": 3.5, "variance": {"poor": 122, "average": 182, "very good": 435, "terrible": 107, "excellent": 683}, "aka": "Bahia Hotel", "slim_ranking": 0.185185185185, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.5}}