{"user_rating": 4.5, "review_count": 160, "name": "Baldassini B&B", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "The location could not be any better. Its almost exactly in the middle of every spot a tourist will visit in Rome. The area around the b and b is really amazing. Every street is very quaint and picturesque. There are tons of restaurants, wine bars, and gelatarias nearby which were a real highlight for us. Piazza Navona and the Pantheon are about two minutes on either side of the front door. We stayed at the main B&B on Via Copelle. Francesco also runs an apartment down the street which also has a fabulous location. The Red Room can be pretty noisy, as its right on a small yet busy road. If you're a light sleeper you'll prob need ear plugs. This was a minor inconvenience that was totally overshaddowed by everything else. A very nice breakfast Francesco serves every morning at the B&B.", "title": "Excellent stay with a great location and host", "user": "gatorman4321", "date": "April 17, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 28219512}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled with friends", "text": "3 couples have just enjoyed a fantastic mini break to Rome, staying at the excellent Baldassini.", "title": "Best B&B in Rome", "helpfulness": 3, "user": "1380OAP", "date": "March 30, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 27088636}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled with friends", "text": "I always check reviews before I decide where to stay, and the reviews of the Baldassini were spot on. Ideally located for all the main sites, 500 yards from Pantheon, and a stones throw from Piazza Navona. We were met by the owner Francesco, who welcomed us with a glass of limoncello, a local liquer. He gave us a map to the city, and recommended Restaurants and shops to get good food at the right price. In the morning we had full breakfast brought to our rooms, which was delicious. Francesco even left us breakfast for the following morning as we had an early flight.", "title": "A peaceful oasis that felt like home", "helpfulness": 3, "user": "walklikeapenguin", "date": "March 25, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 26795355}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled with family", "text": "The beds were really comfortable and the rooms spotless.", "title": "We loved staying here!", "user": "vicphillipson", "date": "March 20, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 26483663}, {"rating": 5.0, "stay_parameters": "Stayed January 2009, traveled as a couple", "text": "Booking direct ( not through Laterooms,Venere etc) with Francesco saves you money.", "title": "Great personal touch", "helpfulness": 4, "user": "imgiseverything", "date": "February 2, 2009", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 3.0}, "id": 24099256, "likes": {"liked": "— Francesco", "disliked": "— Leaving"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "On this trip to Europe, my husband and I traveled to five different cities and this B&B in Rome was our favorite place that we stayed. The B&B was exactly as we expected from the reviews we read and pictures on the website. The room was the largest of any we have stayed in, in Europe. The room was incredibly clean and the owner, Francesco was extremely friendly and helpful whenever we asked for recommendations or directions. Each morning, he prepared breakfast for us and delivered it at a time of our choosing. It was definitely the largest and best breakfast provided by any of the places we stayed. The location of this B&B could not be beat - it was within walking distance to everything that you would want to visit! If you are looking for a place to stay with all the amenities of a large hotel and a front desk that is available 24 hours a day, then you obviously would not choose a B&B but none of that is necessary b/c this place has everything to offer and Francesco is always available by cell phone for any assistance you may need. Lastly, there is a computer with internet access for you to use for free, right outside of your room which is a great bonus! I highly recommend this B&B to anyone who visits Rome and we will certainly stay there again when we return!", "title": "Wonderful B&B in an Excellent Location!!!", "helpfulness": 1, "user": "littlenic", "date": "October 14, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 46853350}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "Words do fail me....I have travelled to Paris, London, New York, Sydney.....many big cities and I have never found a haven like Baldassini B & B......", "title": "Do not look any further....you have found your accommodation in Roma!", "helpfulness": 1, "user": "lswatson", "date": "October 12, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 46620441}, {"rating": 5.0, "title": "Very happy with the Baldassini", "text": "It is absolutely, hands down the best value for money. I have paid three times the price for a dingy, dirty hotel in Paris.", "helpfulness": 1, "user": "calimonkey", "date": "October 9, 2009", "id": 46370007}, {"rating": 3.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "We (an Australian Family, me,my husband and 2 children, aged 6 and 9), to Rome as a part of a 6 week overseas trip. We stayed in many hotels and bed and breakfasts in the 6 weeks and we were gob smacked at the value for money this place had to offer.", "title": "Perfect Location; Plain Accomodation", "helpfulness": 2, "user": "Amber_Sayle", "date": "October 8, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 3.0, "rooms": 2.0}, "id": 46271674}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "As all reviews tell you it is simply the BEST location in Rome....safe, clean and walking distance to EVERYTHING! Our children could walk everywhere, we did not take one cab/taxi (except to the airport).", "title": "Perfect location in the heart of Rome", "user": "NicVancouver", "date": "October 2, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 45684732}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "My wife and I enjoyed our 7 night stay at the Baldassini B+B in October, 2009. We were in the Blue Room, which is one of only three rooms there. The room was not very big, but it was big enough for a comfortable base in Rome. The room and the B+B were very clean and well-appointed. A couple of big pluses for me were the shower, with great water pressure and plenty of hot water, and the free internet connection available for guests. We enjoyed the feeling of staying in a private residence in the heart of Rome, as well as the perfect location that the Baldassini offered for walking to most of the historic sights. If you look at it's location on a map, it is as centrally located as you can get. We also liked the very good breakfast that was brought to our room every morning at our requested time. Above all, Francesco (the owner) is extremely helpful and friendly, and offers many good dining and sightseeing suggestions that one might not find in a tour book. Even if he isn't in the B+B, he can be reached on his mobile phone, so that is not an issue at all. We were very happy with our stay at the Baldassini B+B and would absolutely stay there again if we return to Rome.", "title": "When in Rome, Stay at the Baldassini", "user": "CosmoC", "date": "November 5, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 48561365}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "My husband and I stayed here four nights in October. We stayed in the small yellow room with the bath in the hallway. This room is small but we had plenty of room to store all of our things so the size was not a problem for us (we only travel with one carry-on each)....people who like pack their entire wardrobe when they travel would probably complain. The bath in the hall was right next to our room so this was also no problem and was completely ours during our stay so it is not shared with any other quests. We left all of our toiletries in the bath (left it unlocked the entire stay) and honestly didn't even lock our room door half the time. The B&B is very safe and cozy and we rarely heard or saw any of the other quests. I felt perfecly comfortable walking about in my pajamas for night-time bathroom visits. The bath had a some sewer smells so there may have been some problem with the plumbing pipes...but it is spotlessly clean and all fixtures work very well, including the bidet. They have a larger suite with ensuite so if you want extra room, you can book that.", "title": "You can't beat the location and accomodation for this price", "helpfulness": 1, "user": "ssgk", "date": "November 1, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 48255093}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "There is some noise from the restaurant across the courtyard but we always pack earplugs when we travel so this was also no problem. It is in an historic building which was part of the Baldassini Palace (see Eyewitness Travel Guidebook).", "title": "Superb service, terrific location, would definatley stay again", "helpfulness": 1, "user": "Larie", "date": "November 1, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 48215574}, {"rating": 3.0, "stay_parameters": "Stayed October 2009", "text": "Everything you need is provided...hairdryer, refrigerator in the hall for guests to use, great water pressure in the shower. Honestly we don't spend a lot of time in our room so we don't dwell on this too much....it was perfect for us!! Breakfast is served in your room at your requested time...if you're leaving super early, they'll leave food out for you to self serve as you request. They are very accomodating.", "title": "Great Location", "user": "midwestgalOmaha", "date": "October 16, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 2.0}, "id": 47038242}, {"rating": 5.0, "stay_parameters": "Stayed September 2009", "text": "You absolutely can't beat the location and it was so easy to find. From Termini is it a direct ride on the #70 bus. Drops you off within a block of the B&B. Walking distance to everything and easy transport connections for buses. It's in the middle of the Historic Center between the Pantheon and Piazza Navona....perfect.", "title": "Simply perfect!!!", "user": "Lara-Paiva", "date": "October 15, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 46935786}, {"rating": 4.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "The Baldassini B and B could not have been located better. It is totally central - the Pantheon is one street away. The room we stayed in was fairly basic, but absolutely fine for what we wanted it for.", "title": "Perfect Location", "user": "lilacstripe", "date": "August 19, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 38127084}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled with family", "text": "The breakfast is a very generous continental and served in your room at a time you would like. The owner is very friendly. We would go again.", "title": "great place, professional host, fantastic location", "helpfulness": 1, "user": "jenmol", "date": "July 14, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 34758099}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "The B&B is in a wonderful location, very easy access to everything. It very much feels like you're staying in a home (albeit an immaculantly clean one). We were in the red room, which was large and well-equipped (probably the best shower of our trip). Francesco was also the most professional of all the innkeepers we met, quick to answer emails, and helpful with providing assistance, he's clearly trying hard to build his business. He provides an absolutely huge breakfast, including eggs (if so desired). There is a computer that guests can use, and Francesco will help you with laundry, if needed. The only caveat that I would have is that the trade off for such a fantastic location is that there are people walking on the street late at night and it can be noisy. The only night it bothered us was the first, when I didn't see the air conditioning control (duh), so we slept with the windows open, but if you are very sensistive to noise or a very light sleeper you might be better off further from the action.", "title": "Small B&B, helpful owner, great location.", "helpfulness": 1, "user": "loopywi", "date": "July 1, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 33663939}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "The Baldassini is located about 2 blocks from the Piazza Navona on a small, side street in the heart of Historic Rome. Francesco was very helpful. He provided information regarding hiring a driver to pick us up at the airport and drive us to the B&B, which is definitely the way to get there and cost only 35 Euro. We arrived early in the morning and were able to leave our luggage there while we started to explore the city. Francesco gave us a map, an orientation to the city and suggestions of what to see.", "title": "This is the place to stay.", "helpfulness": 1, "user": "gladrod", "date": "June 26, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 33224266}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "We stayed in the small yellow room, which has a private bath that you enter from the hallway outside of the room. The room and bath were very clean. An ample, extensive breakfast was served in the room. The breakfast included cheeses, eggs, bacon, toast, cereal, fruit, yougurt, juice and coffee. Francesco even allowed us to access his wireless internet without charge. We would definitely stay here again.", "title": "Very Pleased with Baldassini", "helpfulness": 2, "user": "trnobile", "date": "May 19, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 30287990}], "location": {"country": "Italy", "region": "Lazio", "continent": "Europe", "city": "Rome"}, "variance": {"poor": 1, "average": 7, "very good": 30, "terrible": 1, "excellent": 121}, "aka": "Baldassini Hotel", "slim_ranking": 0.100833333333, "description": "Baldassini B&B is set in a exclusive historic and artistic frame: the Pantheon and Navona Square, the Trevi???s Fountain, the Spanish Steps, Saint Angel Castle, the Vatican, Campo de??? Fiori, Trastevere, the Roman Forum and the Colosseum. That is the ideal location to seeing Rome on foot. Our rooms are provided of all facilities to make you feel like at home: ensuite bathroom, air conditioning, internet access, tv, mini bar, microwave, kettle, toaster, newspapers. Continental breakfast is served in your room (coffee or cappuccino or tea or hot chocolate, orange juice, croissant, biscuits, toast or bread, jam, butter, yoghurt, muesli, milk, fresh fruits)."}