{"user_rating": 4.0, "review_count": 912, "name": "Baldwin Hotel", "reviews": [{"rating": 1.0, "stay_parameters": "Stayed July 2011", "text": "TV was broken, ice machine only in first floor, no A/C.", "title": "I don't recommend", "user": "Hpena", "date": "August 1, 2011", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "location": 4.0, "service": 1.0, "rooms": 1.0}, "id": 116109661}, {"rating": 3.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "The Baldwin Hotel was clean and tidy and conveniently placed at the entrance to Chinatown. The room was a good size as was the ensuite (and the ensuite had natural light). The bed was comfortable and this would have all been lovely if it had not been so noisy.", "title": "Noisy", "user": "Trip-Monkey-Girl", "date": "August 1, 2011", "detail_rating": {"sleep": 2.0, "value": 4.0, "service": 4.0}, "id": 116092000}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "I had read other reviews on Trip Advisor and they had mentioned the noise but because of the location I decided to take a risk – it didn’t pay off. Probably if we had stayed in one of the rooms at the back of the hotel we may not have had the same issues but unfortunately if seemed as if there were trucks up and down the street outside our window all night.", "title": "Clean & Cozy", "user": "DBG3", "date": "July 31, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 4.0, "service": 3.0}, "id": 116088497}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled with friends", "text": "An investment in some double glazing would not go amiss.", "title": "Good stay", "user": "DM85", "date": "July 30, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 3.0, "value": 4.0, "service": 3.0}, "id": 116020214}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "Hotel was perfect for what my wife and I were wanting. It was in the center of the City and gave us a great place to rest. I would recommend to others as long as you are not looking for a place that will make you feel pampered and want to spend a good portion of your vacation there.", "title": "Excellent location, good service, rooms were fine", "user": "taostraveler2010", "date": "July 26, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115810631}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "great location - easy walking distance to union square cable car, chinatown, and many other locations. Room was not huge, but perfectly adequate, clean, and functional. The hand towels folded into animal shapes was a nice little touch. Other have commented on noise, but if you're on a main street in a major city, just what do you expect? We'd recommend the Baldwin to any friends going to San Francisco", "title": "great spot", "user": "ballaboo", "date": "July 17, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 5.0, "service": 5.0}, "id": 115434441}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "We loved our room. It was clean, quaint and as quiet as you can get in San Fran. Our room backed to the alley so we did have a bit of a barrier between us and the street noise. The location was absolutely perfect. We were half a block from the bargains in China Town. One block away from the buses and cable cars. We stayed 4 nights and hated to leave our little \"home away from home.\"", "title": "Perfect Location, great room", "user": "KariC_11", "date": "July 16, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115433648}, {"rating": 2.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "Very good location and pleasant staff but that's where the positives end. We had one day in San Francisco and the staff were not able to help us with any recommendations of restaurants or tours. The corridor outside our room smelled like a toilet. The room looked clean but there were many hairs in the bed. There was noise throughout the night from the elevator.", "title": "Not great...wouldn't go back", "user": "Richard D", "date": "July 16, 2011", "detail_rating": {"cleanliness": 1.0, "sleep": 1.0, "value": 2.0, "service": 3.0}, "id": 115431956}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "With all the other hotels in this area, I would try somewhere else.", "title": "Good value & great location", "user": "sallylass", "date": "July 13, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 4.0}, "id": 115319095}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "We spent 4 nights at the Baldwin at the begining of our fly drive holiday. Although the facilities are fairly basic the staff were friendly, the room nice and clean and the bed very comfy. We spent most of our time out and about seeing the sights and wanted somewhere affordable, central and clean - so for us the hotel was ideal.", "title": "Very clean hotel in great location.", "helpfulness": 1, "user": "kaalaearoad", "date": "July 9, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 3.0, "value": 5.0, "service": 3.0}, "id": 115196345}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "OK, let's be fair...this is not the Ritz. If you are expecting any WOW factor put it aside. This is a basic hotel in a historic building in a very central location but it doesnt come with bells and whistles.", "title": "Perfect Location, Adequate Amenity", "helpfulness": 2, "user": "zacstar", "date": "August 12, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 116593929}, {"rating": 4.0, "stay_parameters": "Stayed August 2011", "text": "It was a perfect base, and the only real critism would be that the tv made a humming noise and therefore difficult to watch as we wound down at night.", "title": "Great hotel in safe central area", "helpfulness": 1, "user": "Damian1974", "date": "August 7, 2011", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 3.0}, "id": 116384515}, {"rating": 3.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "Front desk staff are EXCELLENT!! Knew everything about the city and transport and were only too willing to help.....great work guys!!", "title": "great location...", "user": "2Byoric", "date": "August 6, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 3.0, "value": 3.0, "service": 4.0}, "id": 116346887}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "Our initial reaction to the room was that it was small and rudimentary, but only after being spoilt in other pricier rooms in other cities on our trip. Friends were staying around the corner at a much more expensive hotel and had a smaller room than us! So for a San Francisco hotel it was value for money for an almost European hotel experience.", "title": "Convenient and reasonably priced", "user": "wuppertaler", "date": "August 3, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 5.0, "service": 3.0}, "id": 116194105}, {"rating": 3.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "This hotel is located at the foot of Chinatown gateway on a main street within walking distance to the many shops & restaurants at Union Square. Front desk staff are very knowledgeable of San Fran & incredibly polite & helpful. Whilst the hotel is old & and the rooms very small (reminiscent of a western European hotel), they are clean & the bed very comfy. Ultimately, for the price we paid this hotel provided excellent value for money. Area couldn't be safer. Just don't expect anything flash & you won't be disappointed. Weren't disrupted by any noise as we stayed on 11th floor towards the back. Excellent, fast free wifi in room. Many thanks Baldwin. Ps- Alcatraz tour is a must do which you need to book in advance!", "title": "Great Location, bad service", "user": "Pashtida", "date": "August 1, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 5.0, "service": 3.0}, "id": 116116024}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled with friends", "text": "Clean Room, great location. Secure and safe for women traveling alone.", "title": "Great Location, Access to everywhere!", "user": "Patspeedy88", "date": "July 26, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 3.0, "value": 4.0, "service": 5.0}, "id": 115796030}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "Hotel itself was clean and comfortable and convenient for the city. We wished we had checked out the parking arrangements in advance. The beggars around the streets detracted from the experience.", "title": "Wonderful towel animals", "user": "Trevorzzz999", "date": "July 24, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115707543}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "The towel animals are works of art!", "title": "Good Hotel", "user": "Ofield", "date": "July 20, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 3.0, "value": 4.0, "service": 4.0}, "id": 115579351}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "Although virtually no taxi driver knew the hotel don't let this put you off! The Baldwin is a small hotel in a central location. Right beside China Town's main gate. 5 minute walk to Union Square. 25 minute walk to Pier 39 / Fishermans Wharf (10 dollar taxi ride). 20 minute walk to the baseball ground. Reasonably priced (in comparison to what else is available) although we found San Francisco quite an expensive City to visit. Room for a family of 4 (two double beds) was adequate though a little cramped. Would benefit from the provision of a complimentary breakfast but Lori's diner around the corner is a class act. Staff very friendly and housekeeping good. Being a city centre location there was traffic noise through the night even on the 6th floor but only a problem for light sleepers! Room had a fan light to keep the room cool. Good hotel in a handy location.", "title": "Great, inexpensive hotel", "helpfulness": 1, "user": "jamais17", "date": "July 19, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 5.0}, "id": 115556352}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "We stayed for four nights at the Baldwin Hotel in March of 2011. This is a no-frills hotel in the heart of downtown San Francisco. It is literally a one-minute walk from the gate to Chinatown. The staff was very friendly. We were able to leave our luggage with them for hours before check-in time. The rooms are nothing special, but very clean and comfortable. Some of the bathrooms have old clawfoot tubs which add a nice touch. Prior to our stay at this hotel we stayed for four nights at the Nikko Hotel. This four star property will not see us again. The Baldwin, on the other hand, remains on our list for San Francisco. I can recommend it to anyone who seeks inexpensive and clean accomodation in San Francisco.", "title": "good value", "user": "jenchamb", "date": "July 18, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 3.0}, "id": 115476428}], "location": {"country": "United States", "city": "San Francisco"}, "stars": 2, "variance": {"poor": 34, "average": 125, "very good": 503, "terrible": 16, "excellent": 234}, "aka": "Baldwin Hotel San Francisco", "slim_ranking": 0.302127659574, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.0, "rooms": 3.5, "location": 5.0}, "description": "The Baldwin Hotel is a newly-renovated, charming European style hotel located beside one of San Francisco's landmarks, the Chinatown Dragon Gate. Situated in vibrant Union Square, we are an arm's length from fabulous shopping, exciting theater shows, and the world-famous cable cars."}