{"user_rating": 4.5, "review_count": 428, "name": "Ballastone Inn", "reviews": [{"rating": 5.0, "title": "WORTH EVERY PENNY!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!", "text": "Negative reviews about this hotel cannot be trusted. THIS PLACE IS FANTASTIC. Do NOT let one persons bad experience sway you away from this hotel! My husband and I just returned from a trip to the Ballastone for our anniversary and were treated like royalty. My husband and I are Ritz Carlton regulars and this inn had alot to live up to. It is wonderful! All of the staff members were extra friendly and would do anything for you. I personally saw the owner greet just about everyone and he arranged for us to have our fireplace turned on in our room. (Too early for the gas to be turned on but he made arrangements for us). The room was immaculate with all towels being replaced, fresh sheets and wonderful turndown service every night. Free port and brandy are offered at night as mentioned on the website. You would expect to pay for liquor or wine. The evening appetizers were FABULOUS!!!!!!!!!!!!!!!!! I must say the breakfast was awesome too. The inn is right in the heart of the historic district and you can walk to just about everything. Do not hesitate to pay a little extra to stay here. If you want to feel pampered during your vacation, this IS the place to stay!", "helpfulness": 1, "user": "CeCeTampa", "date": "October 6, 2004", "id": 2622809}, {"rating": 3.0, "title": "Not worth the money-think twice", "text": "We were very excited to visit the Ballastone, with everything we read on tripadvisor and on their website. It was nice, but yet we were disappointed.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "October 3, 2004", "id": 2617026}, {"rating": 5.0, "title": "Ballastone is tops!", "text": "First, the positives: the rooms were beautiful and clean. The entire inn was very nice. The food was good. There were two very nice staff members (Nicole and Melissa) that helped us a lot with suggestions for dinner, etc.", "user": "A TripAdvisor user", "date": "August 24, 2004", "id": 2490108}, {"rating": 5.0, "title": "Special Treat", "text": "Now the negatives: 1) the website indicates that there are appetizers and drinks from 6-7. It does not mention that you have to pay for the drinks. I thought that was sort of tacky, especially considering how much you are already paying.", "user": "A TripAdvisor user", "date": "July 13, 2004", "id": 2294441}, {"rating": 5.0, "title": "Had A Wonderful Time", "text": "2) The owner (man) was there, and never once introduced himself or asked us if we were having a nice time. Basically, he ignored us. 3) We opted for the in-room breakfast once and we were basically called to see if we were done with our tray and then someone knocked at our door, asking for the tray back (within 30 minutes). And then another 30 minutes later, we got another call, asking for the tray back. It made me wonder if there was some sort of tray shortage! It was extremely disruptive. 4) Housekeeping was substandard. One of our bathrobes became dirty, and we put it with the dirty towels and it was never replaced in the 4 days were were there. Housekeeping did the basics: made the bed and gave us fresh towels. They did not empty trash or take away coffee cups, etc.", "user": "A TripAdvisor user", "date": "July 13, 2004", "id": 2293700}, {"rating": 5.0, "stay_parameters": "Stayed July 2004", "text": "The service was extraordinary at the Ballastone Inn. They anticipated your every need. The breakfasts were superb! Indeed the best I have ever had anywhere. The staff was incredibly helpful. I stayed at the Sorgum Cane. I must say, the bed was so comfortable, I haven't slept like that in years. I coming back.", "title": "Quality all the way", "helpfulness": 1, "user": "Enid B", "date": "July 3, 2004", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "service": 5.0}, "id": 2265089}, {"rating": 5.0, "title": "Oustanding TLC!", "text": "My wife and I just spent two wonderful days at the Inn. There simply aren't words to describe the facility. If one expects five star treatment you will be in the right place. I have not had all that TLC since I married and left my Mama. All the staff members offered first class treatment, all one has to do is ask! I definitely will be back, and soon.", "user": "A TripAdvisor user", "date": "May 19, 2004", "id": 2079474}, {"rating": 5.0, "title": "Honeymooner's Dream!!!!!", "text": "If you ever want to truly experience the most beautiful, intimate, and romantic inn with the \"most outstanding staff\" ever, please choose the Ballastone! From the moment we entered the front door and were greeted by Dewayne, we knew we had chosen the most perfect setting for our wedding and honeymoon. We stayed in the beautifully decorated Gazebo Suite, which was our favorite and surprisingly awoke each morning to the ringing of church bells. What more could you ask for? Well, delicious breakfasts, tea at 4 o'clock, cocktails and h'ordeves in the evening, relaxing by the fire, visiting in the courtyard, and a family of wonderful people who truly know the meaning of spoling their guests!! Can't wait to return to Ballastone for our anniversary! Many, many thanks Jim and Jennifer and staff!", "helpfulness": 2, "user": "A TripAdvisor user", "date": "April 12, 2004", "id": 1776974}, {"rating": 5.0, "title": "It's the little things that make a difference.", "text": "An open courtyard with tropical plantings and a fountain where you can relax and enjoy a drink and a smoke if you are so inclined, your choice of teas and freshly baked pastries at 4:00, hot and cold h'ordourves in the bar shortly afterwards, complimentary brandy and port in the evening, an absolutely delicious breakfast served at your choice of locations, including the courtyard and your room, a faint hint of lavender on the table linens, ice in your room when you arrive and every evening afterwards, the best chocolate mint you've ever tasted on your pillow at turndown... these are a few of my favorite things at the Ballastone, and they are the difference between the ordinary and the outstanding. You can expect a friendly and helpful staff of the best caliber to see that your stay is pleasant and relaxing. The owners, Jennifer and Jim Salandi, always seem to be available and willing to suggest interesting places to visit as well as where to eat. I really can't imagine staying anywhere else when I am in Savannah.", "user": "lmandrews", "date": "March 13, 2004", "id": 1723111}, {"rating": 5.0, "title": "Loved the Ballastone Inn", "text": "We enjoyed our recent stay at the Ballastone Inn. The staff was friendly and eager to please without being intrusive. The breakfast, tea, and appetizers were delicious. Someone must have a green thumb because the entrance and side garden were wonderfully full of plants and inside the house were orchids and live plants throughout. I agree with the reviewer who said the bed was the best ever in an accommodation. Problems were dealt with promptly and courteously; in fact, we were upgraded to a suite because of a mix up in a reservation. Beautiful rooms and immaculate throughout.", "user": "Nelle2", "date": "October 6, 2004", "id": 2623399}, {"rating": 5.0, "title": "Loved the Ballastone", "text": "This was our first stay at a bed and breakfast type inn and we think we picked the right place for a first. Ballastone was beautiful. We had the China Trade Suite and it was beautiful. (Wish the fireplace had been operational). I must say it was the most comfortable bed I have ever experienced away from home. It was so inviting at night. The entire staff was the best. They all seemed to enjoy their jobs and were most helpful. We loved the happy hour in the evenings with drinks and appetizers. The breakfast each morning was also good. We tried the special each morning, and was never disappointed. Weather was too cold to enjoy the courtyard, but the inside was cozy with fires each evening and morning. The location was perfect for sightseeing in Savannah. Everyone in Savannah was so friendly and helpful. Thanks for a great bed and breakfast experience.", "helpfulness": 2, "user": "cmoye", "date": "January 4, 2005", "id": 2975841}], "location": {"country": "United States"}, "stars": 3.5, "variance": {"poor": 12, "average": 17, "very good": 32, "terrible": 10, "excellent": 357}, "aka": "Ballastone Hotel Savannah", "slim_ranking": 0.00892857142857, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 5.0}, "description": "Escape to a romantic bed and breakfast in Savannah GA steps to everything in the center of the Historic District. Our Savannah GA B&B features delectable breakfasts every morning, high tea on sterling silver every afternoon, and evening hors d'oeuvres with drinks at the elegant antique bar. Our 4 Diamond Savannah bed and breakfast is dedicated to gracious southern service with top rate 24-hour concierge. Romantic suites, free off-street parking and a private elevator rival the offerings of other Savannah luxury hotels!"}