{"user_rating": 4.0, "review_count": 535, "name": "Balmes Hotel", "reviews": [{"rating": 4.0, "title": "Very pleasant stay", "text": "We stayed here for a week this Easter and found the hotel staff to be pleasant and helpful.", "helpfulness": 1, "user": "GrannyFloe", "date": "April 11, 2007", "id": 7329437}, {"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "We would not recommend the inside rooms as they are overheated and small. After our first night we transferred to a room at the back which was more spacious and had a lovely view", "title": "Recommended - what is there to criticise?", "helpfulness": 7, "user": "SuzyandMicky", "date": "November 16, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 6137045, "likes": {"liked": "— Breakfast"}}], "location": {"country": "Spain", "region": "Catalonia", "continent": "Europe"}, "stars": 3, "variance": {"poor": 37, "average": 116, "very good": 226, "terrible": 17, "excellent": 139}, "aka": "Barcelona Balmes Hotel", "slim_ranking": 0.396551724138, "description": "A centrally located three-star superior hotel in Barcelona, located just a few metres away from Avinguda Diagonal and Passeig de Gràcia.Hotel Balmes has a swimming pool and an interior garden, a sauna and Jacuzzi, a conference room, bar and restaurant. It is a modern hotel in Barcelona, suited both for business and pleasure, that offers all the services you may need at the best prices. And it's right in the heart of Barcelona's commercial centre!Services102 guest rooms: 21 single rooms, 39 double rooms and 46 Superior roomsBalmes RestaurantBal BarBreakfast buffet24-hour room service and mini-barBusiness centreWi-Fi in all areasFunction rooms and spaces for events: Garden room, Balmes room, restaurant, bar and garden terraceOutdoor swimming pool and solariumSauna and JacuzziAfrican art collectionParkingLaundry and ironing serviceSmall dogs allowed"}