{"user_rating": 4.5, "review_count": 174, "name": "Bamboo Jungle House", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "The Bamboo Jungle House was an outstanding B&B, exceeding all of our expectations. As soon as we arrived we were impressed by the friendliness of our hosts, Lucy and Terry, and all of the things they did to make us feel welcome. They were a great source of information about places to go on the island. They did so many little things to make our stay more pleasant and convenient, it's obvious they have a real passion for running the B&B.", "title": "Great Hospitality!", "helpfulness": 2, "user": "sloach", "date": "August 18, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5621969}, {"rating": 5.0, "title": "Most Memorable Bed & Breakfast!!- Bamboo Jungle House, Kaua'i", "text": "The facilities were excellent - the pool and hot tub area is nice and clean and the whole place is surrounded by palm trees and other plants so it has a private and relaxed atmosphere. The rooms were very clean and comfortable, and the private lanai was great! Breakfast was delicious and there was always good conversation with Lucy and the other couples staying here.", "helpfulness": 2, "user": "Sunfly", "date": "August 13, 2006", "id": 5606940}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "Overall, the Bamboo Jungle House is the perfect place for a couple to get away on Kauai. We would certainly come back, and would recommend this B&B to anyone travelling to Hawaii.", "title": "True Paradise", "helpfulness": 1, "user": "volleyval", "date": "August 4, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5558621}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "The moment we entered the jungle house, we knew we were going to love it and we have nothing but great things to say about it. Lucy and Terry are the most down to earth and welcoming people...I really felt like I was 'coming home' and being taken care of. The B&B is absolutely clean and fresh, the breakfasts are delicious & nutritious and it's conveniently situated. One of my favorite escapes was the Hawaiin style Lomi Lomi massage...The massage therapist was kind, welcoming and caring. I've received many massages and I have to say that the Lomi Lomi was an awesome experience. It incorporates the therapists forearms and elbows and the natural sounds of the waterfalls and birds singing right in the backyard gazebo! My husband and I really felt that Lucy and Terry cared for their guests...Lastly, I'd like to mention that we travelled to the other islands and stayed at many more B&B's, but we remember the Bamboo Jungle House as our favorite experience...Thanks Lucy and Terry!!!!", "title": "A Warm and Hospitable Place to Stay!", "helpfulness": 1, "user": "mbsb", "date": "August 2, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 4.0}, "id": 5543087}, {"rating": 5.0, "title": "Stay Here! Gracious hosts, Scrumptious Breakfasts, & Peaceful Sleep!", "text": "Nancy and Frank", "helpfulness": 2, "user": "CamargoBell", "date": "July 24, 2006", "id": 5504750}, {"rating": 5.0, "title": "Wonderful Tradewinds", "text": "Our experience at the Bamboo Jungle House was beyond our expectations. We felt so comfortable. We had a private entrance and there was great care taken in the selection of amenities. Our room was very clean and well put together, with lots of attention to details. A true island dream.", "helpfulness": 2, "user": "kai-dreams", "date": "July 21, 2006", "id": 5492126}, {"rating": 5.0, "title": "Ho`okipa Hawaiian Style", "text": "We went to Kauai for our honeymoon a few month back. If you want a silver lining to your vacation in Kauai Stay at the Bamboo Jungle House run by Lucy and Terry", "helpfulness": 2, "user": "A TripAdvisor user", "date": "July 18, 2006", "id": 5479754}, {"rating": 5.0, "stay_parameters": "Stayed May 2006", "text": "It was such a heavenly experience and a perfect vacation.", "title": "Truly Aloha", "helpfulness": 4, "user": "Ewertboo", "date": "July 12, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 5460566}, {"rating": 5.0, "stay_parameters": "Stayed June 2006", "text": "I t almost felt like living with family. They were so hospitable and informative that we never even felt like a visitor to the island.", "title": "The perfect Kauai retreat – a true gem!", "helpfulness": 6, "user": "eyeforstyle", "date": "July 9, 2006", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 5443526}, {"rating": 4.0, "stay_parameters": "Stayed April 2006", "text": "The Bamboo Jungle House is set in Kalaheo away from the busy Kauai downtown. Its so serene and peaceful out there and the house is a great plantation style home with the view of the oceans and close to great restaurants.", "title": "bring earplugs", "helpfulness": 5, "user": "traveler from MA", "date": "May 3, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "service": 4.0}, "id": 5031789}, {"rating": 5.0, "stay_parameters": "Stayed February 2006", "text": "We visited Kauai for the first time in Jan. Feb. 2006. The Bamboo Jungle House is a beautiful place and very unique with its lava hot tub next to the pool. The place is even nicer than the web pictures show beleive it or not - beautiful gardens, rooms, dining room, pool, waterful leading into the lava hot tub and pool. And the waterfall is so soothing to listen to at night. The breakfasts were delicious and it was really neat how Lucy came out with a sampling of island fruits each day.", "title": "An absolutely beatiful place - best place to stay on the island", "helpfulness": 5, "user": "eastosceola", "date": "April 4, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4895264}, {"rating": 5.0, "title": "Fantastic B & B", "text": "This is one of the nicest B&Bs we have stayed out (and we have frequented a lot of great B&Bs in New England - the B&B haven of the US). Lucy and Terry are very nice and extremely helpful. They take extra time and care to point out places to see and great restaurants. They also have great hiking suggestions. One of the best places we ate at was the Hanapepe Cafe. They serve dinner on art night in the growing artist community of Hanapepe. It is a really neat night - stroll the galleries and then have a fabulous and innovative dinner at Hanapepe Cafe.", "helpfulness": 1, "user": "Barry-001", "date": "March 14, 2006", "id": 4615737}, {"rating": 5.0, "stay_parameters": "Stayed February 2006", "text": "We would most certainly stay at Bamboo Jungle house again. Stay at this quaint and charming B&B.", "title": "Beautiful B&B", "helpfulness": 1, "user": "Jeanea", "date": "March 13, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 4603146}, {"rating": 5.0, "stay_parameters": "Stayed February 2006", "text": "Kauai is an absolutely beautiful place - one of the best places we have visited in the world. So many plaes to see, things to do, outdoor activities and fantastic beaches both public and secluded. So many beaches to explore you probably will not have time to see them all. Each beach has a very different character. Read the Ultimate Kauai blue book (i.e., the Bible as very Kauai visitor calls it) And the terrain is so varied - West, Southwest, South, East, and North sides of the island. All are very different and unqiue. Use the Bamboo Jungle as your home base and visit all of the sections. You will have an absolutely fabulous time.", "title": "Island hospitality at its finest", "helpfulness": 2, "user": "kevinhikerboy", "date": "March 11, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "service": 5.0}, "id": 4600050}, {"rating": 4.0, "title": "A beautiful oasis!", "text": "I will post some pictures once I can figure out how to attach them - I am new to digital cameras. check back later.", "user": "A TripAdvisor user", "date": "March 1, 2006", "id": 4567197}, {"rating": 5.0, "title": "Lucy and Terry love hikers!", "text": "We had the foresight to spend our whole honeymoon at the Bamboo Jungle-- and it bodes well for our future joint-decision making! Do not pass up the chance to stay here.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "January 30, 2006", "id": 4398797}, {"rating": 5.0, "title": "Loved the Bamboo Jungle House", "text": "Lucy and Terry were wonderfully helpful- they gave us the best ideas for hikes (don't miss the swamp hike!) based on our moods and energy levels. They have done most of the hikes they recommend, and know what kind of conditions to look for and avoid (but it's Kauai! You get to hike more often than not). They also know where to look for sea turtles, which is another don't miss.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "December 22, 2005", "id": 4280369}], "location": {"country": "United States"}, "variance": {"poor": 11, "average": 3, "very good": 21, "terrible": 2, "excellent": 137}, "aka": "Bamboo Jungle House Hotel Kalaheo", "slim_ranking": 0.3, "description": "One of Kauai's most romantic bed & breakfasts.  Enter the front gate of this comfortable plantation era home and be embraced by tropical gardens & waterfalls.  Three sparkling clean tropical guest rooms with queen beds draped with romantic netting.  All have private baths & lanais, some with ocean views. The suite has kitchen & sitting area.  Swim in our pool.  Soak in our hot tub with jacuzzi.  Full breakfast daily.  Visa, MasterCard.  No smoking.  New owners."}