{"user_rating": 4.0, "review_count": 218, "name": "Banana Beach Resort", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "Palm trees on the beach, waves gently washing on to the sand and the reflection of the full moon rising up over the sea are what you may hope for at a seaside hotel. This is exactly what you get at the Banana Lodge Resort. It is a reasonable distance from the airport and town centre to be away from the noise and bustle, but close enough to get an inexpensive taxi ride to restaurants that would do nicely for dinner. Room 217 set above the passage from the swimming pool to the beach is perfectly set for the wonderful view to be framed between palm trees. The large bedroom with two good sized double beds and the adjoining large well equipped kitchen/ dining room make for a very satisfactory living area that is enhanced with the good sized balcony. Beyond the beach lies a small jetty from which small motor boats collect clients for snorkelling on the reef. The reef itself seems greatly over-rated and not on a par with sites that we have visited in the Red Sea, East Africa or the Caribbean. However there may be many other sites along the system that could justify its reputation. A great deal of building work continues along the coastal strip and wildlife areas are disappearing fast. Small tracts of coastal woodland, mangrove and marsh remain but are badly trashed, and strewn with rubble and litter. Still, birds continue to come and can provide some worthwhile bird watching that is different from the mainland.", "title": "Beachside retreat", "user": "lizziesbirds", "date": "March 2, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 153518759}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "We enjoyed our stay at the 'Banana' and would return there again.", "title": "Enjoyed our stay", "helpfulness": 4, "user": "1sdman", "date": "February 28, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 153341365}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "Things you should know prior to booking include:", "title": "Great place in need of a little attention", "helpfulness": 1, "user": "Seafood_Eatsame", "date": "February 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 153223884}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "*There are two buildings, they are A & B, we stayed in A331 which was a nice suite. It had the closest third floor view of the ocean, but was a little blocked by palm trees, not bad but not a completely clear view. My undestanding is the 'A' suites are larger and have better views than the 'B' rooms, however the B room we visited was nice but only had one a/c that as in the bedroom only.", "title": "Very nice for the price.", "helpfulness": 2, "user": "frozentundraguy", "date": "February 21, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 152701875}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled with friends", "text": "*The A331 suite had dual air conditioners, one in the bedroom the other in the spacious kitchen/living room. The a/c controls were wireless digital remotes, you needed to understand Celsius as they did not understand Fahrenheit, but they worked extremely well.", "title": "Loved it for the value!", "user": "sammclean99", "date": "February 15, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 152227380}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "This hotel was neat and clean and the service was good. There were a few minor areas of disrepair like decking by the pool, but overall it was a great value. The food at the restaurant was very good but I have to agree with a previous review someone else wrote and say that the prices were a bit high. The hotel was pretty quiet as its located towards the end of the island and away from the busy central area. Although there were chairs located on the beach, you could not access the water easily because of the concrete barrier. Other adjacent beaches were covered in seaweed and trash.", "title": "Lacking beach", "helpfulness": 1, "user": "mangos15fitz", "date": "April 23, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 158592902}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "Had a great time on vacation in San Pedro. We stated at Banana Beach and found the place great. Staff is first class all the way. The resort is clean and with 2 pools you can always find a cool shaded area for sun sensitive people. The Ploace offers the best bang fot your buck. It is nice to have a relaxing time and if you want excitement you are only a 15 minute stroll on the beach from town. A golf cart rental is available or $5 usd taxi trip will get you back if you are too tired of just lazy. The resort restaurant has great food all day and night as well a great drinks in the bar without busting the bank. Monkey business is on site for all your tour requests. Snorkeling with Alphonse is a must!!!!!!", "title": "Wonderful time in San Pedro", "user": "fromWaldo", "date": "April 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 157969436}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled with friends", "text": "Where's Waldo ( hiding in Belize)", "title": "Nice but not wonderful", "helpfulness": 1, "user": "MaestraSol", "date": "April 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 3.0}, "id": 156928683}, {"rating": 5.0, "title": "Large, Clean Rooms and Excellent Service", "text": "I stayed here with my husband and 9 of my students. It is very clean and nice, and we had no problems. I would say that the restaurant is extremely over priced for what you get. and.. unless you rent a bike or a golf cart, you really have no choice but to eat there. They did include the breakfast with the rooms for us and that was wonderful and the food was very good, just over priced.", "user": "mr__bull", "date": "April 6, 2013", "id": 156827808}, {"rating": 2.0, "stay_parameters": "Stayed April 2013, traveled on business", "text": "We stayed here for four days over Easter. It's a couple of miles South of San Pedro proper which for us was a bonus as the centre feels somewhat busy and fast-paced for a Caribbean getaway.", "title": "Average hotel with a lackluster staff", "user": "DianaR134", "date": "April 4, 2013", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 156648940}, {"rating": 1.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "I had the MOST HORRIFYING hotel experience of my life at Banana Beach. On the fourth day of a five night stay my boyfriend and I went out on a full day sail/scuba tour with another couple. We were out in the sun all day and I made the rookie mistake of not drinking enough water. Upon arriving back in our room I started feeling nauseous/woozy and ended up fainting on the tile floor on my way to the bathroom (symptomatic of severe sun poisoning.) My boyfriend heard the fall, saw me laying on the floor, and rushed to the front desk so he could get medical help.", "title": "Do not stay here! Hotel management refuses medical treatment for guest!", "user": "sarah p", "date": "April 3, 2013", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 1.0}, "id": 156535793}, {"rating": 3.0, "stay_parameters": "Stayed March 2013, traveled solo", "text": "The hotel manager plus several front desk staff came into the room as I was just regaining consciousness, still lying on the floor. Immediately after entering the doorway, the staff started yelling at me and my boyfriend that we were too drunk, had gotten in a fight, and if we got any more complaints they were going to call the police. Mind you, it was my boyfriend who had come to them to get help in the first place, but they immediately jumped to conclusions based on the sight of my bloodied face and refused to be reasoned with.", "title": "A Good Spot to Sleep", "helpfulness": 1, "user": "KatiePToronto", "date": "March 29, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 156008420}, {"rating": 3.0, "title": "Not impressed", "text": "The most horrifying part of the whole ordeal was that NOT ONCE did any of the staff ask if I was okay or offer to help me in any way. Our friends (who were not staying at the hotel) approached the front desk to try to get information about nearby medical clinics or doctors, and the manager replied that he wasn't going to bother a doctor, we had just gotten too drunk and I'd be fine. When our friends responded that they had been with us all day, we were sober and had not been fighting, the manager just shook his head and still refused to provide any assistance.", "user": "summit3000", "date": "March 28, 2013", "id": 155896664}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled with friends", "text": "I am still in disbelief that the manager would refuse to help a guest that clearly needed medical attention. Even if I could get over the fact that he assumed that I had been injured as the result of being either too drunk or the victim of domestic violence (both of which couldn't be further from the truth,) he was in no position to judge that I would \"be ok.\" I had obviously suffered a contusion to the head and the staff chose to do nothing (except for threatening to call the cops if we disturbed any guests!)", "title": "First trip to Belize", "helpfulness": 1, "user": "Dan J", "date": "March 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 154775918}, {"rating": 4.0, "title": "Girl's Weekend", "text": "Now that I am fully recovered, the ordeal seems so absurd that it borders on comical, but it's horrifying to know that someone else might be placed in the same situation, needing emergent care while the staff turns a blind eye. Everyone else we met in Belize was over-the-top nice and accommodating, and this was the one and only blemish on the trip. DO NOT STAY AT BANANA BEACH!!!!", "helpfulness": 2, "user": "Larissa30", "date": "March 5, 2013", "id": 153818664}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "Banana Beach is a lovely place to stay, the rooms are cleaned daily the grounds are kept well groomed and the staff is very attentive, especially for Shawna she went way out of her way to help us out with several issues we had encountered (not with the resort) while we were there, a big thumbs up for you Shawna and the rest of the front desk staff. It may be an older resort but as I said it is well kept. If your looking for luxury there are plenty of other places to stay for 4 times the money, but for a reasonable rate you can't beat Banana Beach. We would go back.", "title": "Not the Ritz Carlton but who cares!", "user": "Bruce P", "date": "February 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 151976451}, {"rating": 2.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "I knew this wasn't a new property and that it isn't a big resort with loads of amenities. I believe is was a nice property at one time, but it is far from that now.", "title": "Below Expectation", "user": "TNWilliam", "date": "February 11, 2013", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 2.0, "sleep": 2.0, "rooms": 2.0, "location": 3.0}, "id": 151886056}, {"rating": 4.0, "stay_parameters": "Stayed February 2013", "text": "We started out the first day, after hours of travel, with only a trickle of water and it wasn’t hot. The front desk sent someone who turned on all the faucets and told us to let them run until it warmed up. This was strange because fresh water is a commodity on most islands and they ask you to reduce use. After 10 minutes it was a lukewarm trickle and we pseudo bathed. It was this way for a week. The last night there was no water at all from the hot. We reported it, again the same response. An hour later we had a flow from the hot tap that was nasty red from rust.", "title": "Friendly Resort for first trip to Belize", "helpfulness": 3, "user": "Cookiemonsterfan", "date": "February 5, 2013", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 151436873}, {"rating": 3.0, "stay_parameters": "Stayed January 2013, traveled with friends", "text": "The tub and tile were in bad repair. Tiles repaired with caulk, black mold on tub fixtures and in tile grouting. The same tile \"repairs\" were made around the sink in the kitchen.", "title": "Disappointed", "helpfulness": 1, "user": "idahogirl", "date": "January 28, 2013", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 150880794}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "The ocean front 1 bedroom suites are not truly \"ocean front\"; they are what most would describe as \"ocean view\". They are along the side of a building and other 45-degree views of the water. We were lucky to be closer to the ocean than many others, but still not true ocean front like the 2-4 bedroom suites.", "title": "Fun in the Sun!", "helpfulness": 2, "user": "Chris4444", "date": "January 28, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 150866412}], "location": {"country": "Belize", "region": "Belize Cayes", "continent": "Central America"}, "stars": 3, "variance": {"poor": 13, "average": 45, "very good": 76, "terrible": 9, "excellent": 75}, "aka": "Banana Beach Hotel San Pedro", "slim_ranking": 0.759259259259, "detail_rating": {"service": 4.5, "cleanliness": 4.0, "value": 4.5, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "description": "The friendliest resort sitting on the powdery sand of Mar de Tumbo Beach just south of San Pedro Town on the Ambergris Caye of Belize, Banana Beach Resort has been a haven of fun, adventure, and relaxation for more than 10 years."}