{"user_rating": 4.0, "review_count": 643, "name": "Banff Aspen Lodge", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "Better late then never, I wanted to write about our stay March 8 - 18. This was our second stay at this hotel.", "title": "Great stay once again!", "helpfulness": 3, "user": "AudreynBruceF", "date": "June 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 164662381}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "Hotel is located one block from the beginning of town. Our room was on the third floor overlooking the entrance, with a very nice view of the mountains. We had two very comfortable queen beds with crisp white linens and lots of pillows. The large bathroom had the sink outside. Room had a table and 2 chairs, small refrigerator, coffee maker plus a pot to heat water, phone, TV, and free wifi which worked great. Plenty of space for hanging clothes, plus hooks to hang your coats. Our room was kept spotless! Thank you housekeeping.", "title": "Extremely comfortable, accessible and cosy", "helpfulness": 2, "user": "marymccaberogan", "date": "June 21, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 164661008}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "The front office staff could not have been more pleasant or helpful. Always greeted you as you passed their desk and willing to be of help no matter what you needed.", "title": "Comfortable and quiet", "helpfulness": 2, "user": "Russell F", "date": "June 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 164632596}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled with friends", "text": "The room to store your skiis (with the use of their padlocks) worked out perfectly.", "title": "Loved the hot tub and fireplace!", "helpfulness": 1, "user": "LovingSunandSand", "date": "June 16, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 164164188}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "There are two outdoor hot tubs, a large one and a smaller one with a fireplace -- doesn't get much better than that after a day of skiing. There is a sauna and steam room as well.", "title": "Good for the price", "helpfulness": 2, "user": "RSW", "date": "June 14, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 163978319}, {"rating": 3.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "How you feel about this hotel, depends on what you feel you need in Banff .... one of the world's great destinations. If you are realistic, and know that in all likelyhood, you will spend very little time in your hotel ,... then it will meet your basic needs. True, we did not get the room config we requested, but the price was reasonable, the staff was excellent, and it was a few steps from the heart of town. But ... if you plan to spend much time in your room, you will find it lacking for space , with NO decent chairs, and old CRT non HD Televisions. The breakfast was OK as well. Set realistic expectations", "title": "It Depends", "helpfulness": 1, "user": "flynnie031", "date": "June 12, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 163790902}, {"rating": 4.0, "title": "Good location reasonable price", "text": "Stayed for a couple of nights and found this hotel suited our needs very well. Check in staff very helpful and friendly. The rooms were large and comfy and well appointed.Internet was free and worked well.Breakfast was very good.There is parking out the back and some undercover secure parking as well. Location was excellent.There is construction work going on at the moment, it didnt bother us but if you need a nap in the middle of the day stay somewhere else.Overall we found it to be a very pleasant stay.", "helpfulness": 1, "user": "maxico", "date": "June 11, 2013", "id": 163640882}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with friends", "text": "We were a group of 6 Aussies travelling together and made our decision to stay at this hotel after reading previous reviews and we certainly made an excellent choice. We were looking for something mid price but of a good standard and we were not disappointed. The gentleman on the front desk was very welcoming and helpful. When your first point of contact at a hotel is by a member of staff who is friendly and greets you with a smile, you are usually onto a good thing. Our room was located on the 2nd floor towards the back of the hotel overlooking the carpark (this was not an issue).", "title": "Excellent Choice!", "helpfulness": 1, "user": "StillTravelling", "date": "June 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 163529390}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "Room: It was spacious, clean and appeared to have been recently redecorated. The bed and pillows were soooooo comfy.", "title": "Good location and service", "helpfulness": 1, "user": "DrZeeCanada", "date": "June 10, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 163525039}, {"rating": 5.0, "stay_parameters": "Stayed June 2013", "text": "Breakfast: Staff were very accommodating and friendly. There was a good selection for a \"continental\" breakfast and yes, the Granola lived up to previous reports!", "title": "Great value, great service", "helpfulness": 3, "user": "jglicks", "date": "June 6, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 163157442}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled with friends", "text": "Although we only stayed one night it was great. We were there for a girls weekend and the room was perfect, the beds were divided but 2 sinks and the bathroom which left us with some privacy and each room had its own tv so if one was up before the other they could watch tv. The location was fantastic, close enough to walk to downtown and and all restaurants but far enough away from all the late night partying noise. Will be my preferred hotel for every Banff trip now.", "title": "Was a great night!", "helpfulness": 3, "user": "Funjenn", "date": "June 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 162843024}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "We stayed here for 2 nights in April as part of our Honeymoon trip. Our room was a fair size with a nice balcony. Good sized bathroom too and a very comfy bed. Breakfast was awesome - continental and lots of choice. We were disappointed as we only had this on one morning as the second morning we had to leave really early before breakfast. The staff were really friendly too. For the price we paid (£66 ish per night) - it was very good value for money.", "title": "Lovely Hotel - Good Value!", "helpfulness": 3, "user": "MKPWales", "date": "June 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 162820282}, {"rating": 3.0, "stay_parameters": "Stayed May 2013, traveled with friends", "text": "I always check tripadvisor and since this was #4 and available at $149/ night, I thought we'd try it. There were three of us in a double queen room and they charged an extra $20/ night since there were more than 2. Not sure why as the breakfast, while good, certainly isn't worth $20, even in Banff. We have stayed at several Banff hotels and this one is the second from the bottom. It was under construction and less than impressive on entering. The doors to the room were dirty with paint peeling. The rooms were small with a view of nothing. The bathrooms were tiny with the toilet roll holder falling off the wall. The beds and pillows were good. The first night was reasonably quiet but the second night someone's kids ran for 2 hours up and own the hall then until midnight the adults carried on their conversation at volume 10. Guess the sound proofing isn't the best. Breakfast has only eggs. no other protein. The breads/ muffins/ loafs and granola were very good. Good location. Wouldn't stay here again.", "title": "Not sure how this got #4 in Banff", "helpfulness": 2, "user": "ivanhoe", "date": "May 30, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 2.0, "location": 5.0}, "id": 162481922}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "this hotel is situated in good location with Friendly staff, cool courtyard hot tubs w/ fireplace. Complimentary parking, wifi and breakfast. Awesome place. Walkable to down town. Good Value. Some underground parking, as well as street level / behind hotel.", "title": "Convenient, Clean & Friendly", "helpfulness": 1, "user": "VinceInCalgary", "date": "May 21, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 161429180}, {"rating": 4.0, "title": "Reasonable price and pleasant stay", "text": "The room was lovely and had obviously been redecorated recently. Bathroom was very large and modern. The hotel is undergoing construction, so the elevator was not working, but the staff eagerly carried our bags to our room. This also made parking difficult, but we easily located a spot on a nearby street. Breakfast was quite tasty, especially the homemade granola. The room was very clean, and the staff went out of their way to make our stay pleasant; they even called us before our trip to advise us about the parking situation. This property is priced more reasonably than many in Banff, and it will be a real find once the construction is complete. We would definitely stay at the Banff Aspen Lodge again.", "helpfulness": 1, "user": "Bandlady", "date": "July 10, 2013", "id": 167045111}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "Arrived off the Rocky Mountaineer for a few days in Banff and weren't disappointed in this hotel even though it was undergoing construction work during our stay.We weren't disturbed or inconvenienced at all and all the staff made us feel so welcome especially a young German receptionist who went out of her way to recommend places to visit/see during our stay.The breakfast was adequate though the servers were very helpful and friendly.The hotel is well located and the views are spectacular.There is a small steam room and Jacuzzi whilst there is also an outdoor hot-tub and small pool for guests which does add to the appeal of the hotel as does the free access to the internet.We had a very relaxing stay there and would happily return in the future", "title": "ASPEN LODGE BANFF", "helpfulness": 1, "user": "HarryMurray", "date": "July 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 166642531}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "We like the hotel location and hot tubs. The front desk was helpful and our room was clean and nice, with a balcony. But without AC we had to open the balcony door and asked for a fan.", "title": "Nice Stay", "helpfulness": 3, "user": "Xiaodan Q", "date": "July 1, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 165906760}, {"rating": 3.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "The queen bad and the bathroom were small. Parking was a problem during the weekend.", "title": "Shame about the breakfast", "helpfulness": 1, "user": "Pollyallen", "date": "June 29, 2013", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 2.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 165649275}, {"rating": 3.0, "stay_parameters": "Stayed May 2013", "text": "This hotel was booked as part of our Rockies and Alaska tour. The location was good - very close to town centre and the rooms were spacious with comfortable beds. But the breakfast..............sugary granola, fruit salad, pizza muffins, chocolate zuccini walnut muffins and toast!!! The bread was soft and doughy thus did not make good toast - our group of travellers thought this did not suit ourn European palate. A group of German tourists were given plates of cold meat and cheeses. We asked for similar and were told they had this as they had paid extra. I assumed a 'continental' breakfast included cold meats - it does in other establishments but not in this one despite offering to pay for it! The coffee or tea was served at the table but we were told we had to go to the main table for the milk if we needed it - pretty dire service.", "title": "Overpriced", "helpfulness": 2, "user": "Rahanash", "date": "June 28, 2013", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 3.0, "service": 3.0, "rooms": 3.0}, "id": 165502755}], "location": {"country": "Canada"}, "stars": 2.5, "variance": {"poor": 24, "average": 73, "very good": 269, "terrible": 14, "excellent": 263}, "aka": "Banff Aspen Hotel Banff", "slim_ranking": 0.212121212121, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.0, "rooms": 4.0, "location": 4.5}, "description": "Enjoy a Canadian Rockies Continental Breakfast with every stay! A friendly hotel of 89 spacious rooms and just a short stroll to downtown Banff. All rooms are carefully furnished and decorated with panoramic mountain views. Amenities include 2 outdoor hot tubs with an outdoor fireplace, sauna & steam room, in-room refrigerators, gift shop, ski bus stop close-by, ski work bench, wireless internet ($), internet access terminal ($) and laundry facilities ($)."}