{"user_rating": 3.5, "review_count": 209, "name": "Banff Inn", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "We booked this hotel after reading some good reviews. Other hotels in Banff were quite pricey and we didn't want to spend too much on this one, so booked a suite with 2 rooms. The hotel looks great on the outside and has underground parking. It is a 10 minute stroll to the centre of Banff. Our suite consisted of a main room with 2 double beds and kitchenette, a seperate room with double bed and a bathroom with the strangest light ever. It was on a timer and went out if you were in the shower too long. The room was clean, but very small and the window looked out onto a brick wall. The wall was so close you couldn't even see the sky to guage the weather for the day. The hotel has a hot tub which looks quite new and was very nice. I wanted to use the showers there rather than in my room. If you like a good breakfast don't bother with this one. Breakfast is cereal in plastic bowls, coffee in plastic cups and toast or a muffin on a plastic plate! This was fine for us as we only had a light breakfast. The hotel had no atmosphere. It was peak season and lots of people were staying there, but we never heard or saw anyone. No-one used the bar. It might be different in winter. If I come back to Banff I won't stay here again, but wouldn't tell other people not to. I would definitely pay the money for a few nights in the Banff Fairmont!", "title": "You get what you pay for!", "user": "MapleScotland", "date": "August 17, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "rooms": 2.0, "location": 4.0}, "id": 19044371, "likes": {"liked": "— Location", "disliked": "— Size of room"}}, {"rating": 3.0, "stay_parameters": "Stayed May 2008, traveled solo", "text": "Was forced to stay here as was bumped from another hotel where I had made a reservation. Banff Inn is in a good location for Banff / town area. Rooms are average in decor but decent size and clean. There is nothing special or memorable about this place - it's just a decent place to sleep for a few hours if you're in the area. Front dek staff were very nice and quite helpful with directions etc.", "title": "fine", "user": "dsbali", "date": "June 5, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 5.0}, "id": 16704302, "likes": {"liked": "— location / cleanliness"}}, {"rating": 4.0, "title": "Good ski-ing hotel", "text": "Went ski-ing with Family, room clean but air condition very noisy if you are a light sleeper.Staff helpfull and located 10 min walk to centre, ski bus picks up at door ex.The bar was expensive and did not allow children in at any time except breakfast no happy hour and was always empty best go downtown for supper and beer (Tommies) overall great hot tub poor bar good location", "user": "stola", "date": "March 31, 2008", "id": 14682971}, {"rating": 4.0, "stay_parameters": "Stayed February 2007, traveled with family", "text": "Second visit to the Banff Inn. First time was skiing with friends in December 2007, great deal for the loft, 3 double beds, perfect for a family. The hot tub is excellent for relaxing after a long day of skiing/snowboarding and the free breakfast is just right to fill up before a day at one of the hills. We skiied Lake Louise and the drive wasn't bad. The second visit was a girls weekend in February, had dinner at the Keg a block down and shopped the next day. Both times enjoyed the hot tub and breakfast.", "title": "Great Location for Banff", "helpfulness": 2, "user": "rockychocolate", "date": "March 13, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 3.0}, "id": 14261643, "likes": {"liked": "— Great cost & location", "disliked": "— No fancy extras"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "My wife and I stayed at the Banff Inn for a week whilst skiing in the area. First thoughts of the hotel were good with a nice entrance with fire and welcoming front desk. The hotel was decorated nicely and not at all dark and dingy as some other reviews mentioned. The rooms were very nice and spacious withn all the facilities you need. There was a nice bar area which also served breakfast in the morning. The breakfast was a pretty basic affair, but as the hotel doesn't have a restaurant then you can't expect a full cooked breakfast. But there was a good restaurant two doors down that served a full breakfast if thats what you wanted. The hotel had locked storage for any ski's and also a big hot tub and steam room and sauna. The hotel is located about a 10min walk to downtown Banff where you can find some great bars and restaurants and plenty of shopping. Overall we really enjoyed our stay in Banff which has some of the best scenery we've ever witnessed, a truely beautiful part of the world. The Banff Inn was perfect for our needs and will definitely stay here again in the future.", "title": "We enjoyed our stay at the Banff Inn", "helpfulness": 1, "user": "RogerMorris", "date": "March 4, 2008", "detail_rating": {"cleanliness": 3.0, "front_desk": 4.0, "location": 4.0, "value": 4.0, "rooms": 4.0}, "id": 14030356, "likes": {"liked": "— Location", "disliked": "— Lack of restaurant"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "My husband and I honeymooned at the Banff Inn and loved it. The location was good - 10-15 min walk into town and next to the Fox hotel which had a great bar attached (Chillies) where the food and drink were great.", "title": "Fab hotel!", "user": "lorla55", "date": "January 30, 2009", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 24039075, "likes": {"liked": "— Friendly", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2008, traveled with family", "text": "The town centre is expensive but then it is a tourist hotspot.", "title": "Nice place", "user": "MARK087", "date": "January 5, 2009", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 23297014}, {"rating": 2.0, "stay_parameters": "Stayed December 2008, traveled as a couple", "text": "The ladies on reception were always friendly and helpful, the cleaning staff were very efficient and the coffee they left each time was fab! The hotel was clean in general.", "title": "totally sucks", "user": "istakoza", "date": "December 26, 2008", "detail_rating": {"cleanliness": 3.0, "front_desk": 5.0, "location": 3.0, "value": 1.0, "rooms": 2.0}, "id": 23006138}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "The bar was nice but often quiet and a bit pricey. The sauna and hot tub were just what we needed after lots of walking.", "title": "Fantastic Hotel", "user": "vix85", "date": "August 24, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 3.0, "rooms": 5.0}, "id": 19308907}, {"rating": 4.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "The breakfasts were good - same everyday but good none the less.", "title": "Good quality hotel and good value for money.", "helpfulness": 1, "user": "stevef862", "date": "August 18, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 19079287, "likes": {"liked": "— Suitable accomodation for a family of five and location were the main things.", "disliked": "— A higher quality breakfast would have been nice but it was included in the price so I guess it was OK"}}, {"rating": 3.0, "title": "Good Enough", "text": "Hotels in banff can get very pricey, this one was low-moderate priced, which gets you a low-moderate hotel. The hotel is clean, staff is freindly, the resturaunt in the hotel has good food (although I never seen anyone in it). In the morning you get breakfast. Dont be expecting bacon and eggsor french toast. You get muffins, bannans, cereal etc. Food is food and I guess its better than nothing but its gets boring.", "user": "Confusedalways", "date": "July 22, 2009", "id": 35429608}, {"rating": 4.0, "title": "The essence of comfort.", "text": "The rooms are ok. You get enough space for your stuff, the bathroom is fine, the tv is good with all the channels. The problems that I had with the room is that the beds are small. They have limited queen beds so make sure you request one. It also sucks that there is no mini fridge in the room. Oh and the heat/ac unit is kinda loud, but we only needed to use it once.", "user": "willy24", "date": "April 11, 2009", "id": 27812345}, {"rating": 4.0, "title": "Good hotel, friendly staff", "text": "The location was a bit far for me. It is about 15 min walk from downtown and when your tired and want to get back it seems to take forever. Most of the time we took the car into town. And parking is easy to find. I wouldnt want to go to banff without a car anyways. It has a hot tub and a steam room I think but I didnt ever go into it.", "user": "Loopyloo02", "date": "April 8, 2009", "id": 27632032}, {"rating": 3.0, "title": "Basic but clean and convenient", "text": "A couple of side notes. Check what the weather is gonna be like while your there.Make sure u pack all kinds of clothes. It went from 20 degrees and sunny one day to 14 degrees and raining the next day. if it does rain. Go to the hot springs, see a movie etc. Try not to go sight seeing cause u wont see anything with the clouds. There is horseback riding and I reccomend u not bother. It was the most expensive thing we did there and it wasnt worth it. If you do want to go, dont go if it has rained or is raining. The trails are terrible and the some of the horses are way to stubborn. Ok well thats about it.", "user": "jonelvr", "date": "February 27, 2009", "id": 25248714}, {"rating": 5.0, "title": "Wonderful stay.", "text": "We stayed for two weeks in a very pleasent room adjacent to our friends, having emailed the hotel earlier as we were on a package holiday, asking if we could have two rooms together, all of the staff were exceedingly helpful and friendly nothing was too much trouble for them. The pizzas were good value, the fish and chips excellent, breakfast wasn't included in our package so we found it expensive for what it was. Our room was cleaned every day, new sheets on the bed every three days, the room sparkled with polish and we were more than happy to flop down on the comfy bed after a hard day on the ski slopes. The ski bus stopped right outside the door yet another plus.", "user": "SillyBoots", "date": "February 5, 2009", "id": 24236709}, {"rating": 5.0, "title": "Great Inn", "text": "Spent the long weekend at this Inn and I was great!", "user": "Bales8", "date": "February 19, 2008", "id": 13675258}, {"rating": 4.0, "title": "Nice hotel, not too far out of town", "text": "nice renovated room ,with flat screens and modern decor", "user": "noj", "date": "January 2, 2008", "id": 12247161}, {"rating": 2.0, "title": "OK for an overnight stay", "text": "front desk staff was helpful and the complimentary breakfast", "user": "chrissie_uk", "date": "December 13, 2007", "id": 11526626}, {"rating": 4.0, "title": "Scenery to die for", "text": "had everything you need to get the day started.", "user": "WeWantAnotherHoliday", "date": "November 30, 2007", "id": 11167413}, {"rating": 4.0, "title": "Very good hotel", "text": "I would stay there again that 's for sure.", "user": "Juaniluis", "date": "September 26, 2007", "id": 10007204}], "location": {"country": "Canada"}, "stars": 2.5, "variance": {"poor": 13, "average": 40, "very good": 97, "terrible": 14, "excellent": 45}, "aka": "Banff Hotel Banff", "slim_ranking": 0.69696969697}