{"user_rating": 5.0, "review_count": 139, "name": "Banff Avenue B&B", "reviews": [{"rating": 5.0, "title": "B & B Banff", "text": "Fantastic B & B at 430 Banff Ave. Great location but even better hostess. Connie (and Jamie) were both just great. Their knowledge of the area was very helpful and the breakfast was super!!", "helpfulness": 13, "user": "saalfeldk", "date": "September 1, 2005", "id": 3837590}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "We stayed at the Banff Avenue B&B for two nights and had a marvellous time. Connie is a fabulous host, very helpful and warm, and the location of the B&B is great- within walking distance of the Banff shops, restaurants etc. We had a room downstairs and it was very clean. The guest lounge was a nice place to sit and relax before heading out on another adventure. breakfast was substantial and yummy! No complaints here!", "title": "Excellent B&B!", "helpfulness": 3, "user": "Angelco", "date": "June 2, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 7741786, "likes": {"liked": "— Wonderful host and breakfast", "disliked": "— n/a"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "We stayed 2 nights at this fantastic B&B. Connie & Jamie were extremely welcoming and friendly-we really felt like we were staying with old friends. Connie allowed us to check in early as it was pouring with rain and all four of us had a nice chat together over a cup of tea. They virtually give you free roam of the house apart from a small private section. The rooms were comfortable and clean as was the whole house. They gave us excellent advice on everything Banff and beyond. They lent us their bear spray one day which worked -we didn't see any! (We ended up seeing 10 in all and 2 of them brown on our trip through Canada). The breakfast was excellent also. All in all a very nice place to stay with the best hosts-highly recommended.", "title": "Welcoming hosts", "helpfulness": 2, "user": "thesprouts", "date": "May 29, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 7710480, "likes": {"liked": "— Friendly hosts", "disliked": "— Nothing!"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "We have just returned from a three week tour of Canada, and were very fortunate to spend a night at Banff Avenue B & B. We were warmly welcomed by the mother of our host, Connie, to her lovely home. .. very convenient for the town centre. It was home from home! .. comfortable bed .. super breakfast .. great advice to enable us to make the most of our time in Banff! Even after we had checked out, she let us leave our luggage for the rest of the day and gave us a key to use on our return.", "title": "A warm welcome", "helpfulness": 4, "user": "Isabel3645", "date": "May 25, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 3.0}, "id": 7697234, "likes": {"liked": "— Warm and friendly atmosphere", "disliked": "— Did not have any complaints"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2006", "text": "We would love to spend more time there in the future!", "title": "Fantastic B&B", "helpfulness": 11, "user": "CatherineRice", "date": "May 22, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 5188020}, {"rating": 5.0, "stay_parameters": "Stayed May 2006", "text": "This B&B was a real find. The hosts were wonderfully friendly without being too \"in your face\", the breakfasts were delicious & varied (we stayed 5 nights & got a different breakfast every morning, each breakfast was marvellous, BUT the piece de resistance was the bacon, butter pancakes and maple syrup - Oh Mi God!!!) The bed was dead comfy and the advice on where to hike & where to go was top-knotch. They even lent us their bear-spray, which was jolly nice of them.", "title": "Excellent", "helpfulness": 7, "user": "Wood71", "date": "May 22, 2006", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 5187906}], "location": {"country": "Canada"}, "variance": {"poor": 1, "average": 3, "very good": 16, "terrible": 0, "excellent": 119}, "slim_ranking": 0.0294117647059, "description": "GREAT LOCATION !Banff Avenue B&B is a 5 minute walk to the downtown shops and directly across the street from the ski shuttles. Easy access to summer and winter activities. Clean affordable rooms in homey atmosphere. Hearty breakfast included. We work hard to ensure your time spent in Banff is enjoyable."}