{"user_rating": 4.0, "review_count": 1027, "name": "Banff Caribou Lodge & Spa", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed March 2013", "text": "on arrival staff were very friendly and helpful.", "title": "3 nights in Baoff", "helpfulness": 1, "user": "Susanna61", "date": "March 12, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 3.0, "service": 5.0, "rooms": 5.0}, "id": 154338673}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "Our room was really nice two big double beds.", "title": "All in all, pretty good", "helpfulness": 1, "user": "John I", "date": "March 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 154159542}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "They have a hot pool which is great after a cold day in the snow.", "title": "Nice place for a family", "user": "CF1964", "date": "March 7, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 3.0}, "id": 153983486}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "We both had treatments in the day spa which was so relaxing.The restaurant was really good.", "title": "Lovely Stay in Banff", "helpfulness": 1, "user": "travelbuggy299", "date": "March 7, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 153948051}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "I would definitely return to this lodge", "title": "great sleep", "helpfulness": 1, "user": "itscurtisbaby", "date": "March 7, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 153938502}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled with friends", "text": "So upon arrival our vehicle with 4 snowboards located in the locked roof rack did not fit in the underground parking. We were advised there were lockers located in the basement to store our boards but further advised by the front counter staff that if they were left locked on the rack overnight there would be NO ISSUES as they have never had issues. We parked the vehicle and snowboards in the parking stall closest to the lobby entrance. Upon returning to the vehicle in the morning all 4 snow boards were stolen and the locks damaged. So I realize that this was ultimately our fault for leaving them there but thought after losing the 4 boards with a value of approximately 800 hundred dollars EACH the lodge would perhaps provide some sort of discount or complimentary...something which was not provided and when asked upon check-out the staff member (not the original one we dealt with) stated there was NO WAY that any of the staff would provide direction to leave them on the roof rack, she was adamant that there was NO WAY that any of the staff would tell us to do that...they did.", "title": "4 Snowboards Stolen", "helpfulness": 1, "user": "travelgirl181818", "date": "February 26, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 153247067}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled with family", "text": "The hotel was nice, clean and fresh. Hot tub is located in the basement and is nice - no alcohol permitted. Lesson learned regarding the snowboard theft and that it was ultimately our decision to leave them locked outside...however we were disappointed that the hotel would not give any sort of discount or complimentary ....anything and or admit that anyone may have given us poor advice. Not likely to return merely because of the negative interaction with the staff member upon check-out.", "title": "A welcoming stay", "helpfulness": 1, "user": "Lwatson1970", "date": "February 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 153234297}, {"rating": 1.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "All previous staff dealings were good.", "title": "Red Earth Spa has shady business practices", "helpfulness": 2, "user": "crooney99", "date": "February 25, 2013", "detail_rating": {"sleep": 3.0, "value": 1.0, "service": 1.0}, "id": 153106615}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "Just returned from 1 week's stay in Banff for skiing. This was our third trip to Banff (first time with our kids) having stayed previously at Irwin's and the Rundle Manor with groups of friends. The hotel met expectations from the brochure info/website and from the moment we arrived there was always a smiling face in reception to help with enquiries etc.", "title": "Good Choice For Ski Weekend", "helpfulness": 2, "user": "newbtraveller", "date": "February 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 153090606}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled with family", "text": "The on site Keg restaurant could not be faulted on food quality or level of service. The servers all had time to chat which made you feel at home and that they were genuinely interested in ensuring a good dining experience. After a long day travelling from the UK our first meal was very enjoyable and I couldn't fault the cooking of steaks (which I enjoyed on 2 occasions!) It is worth asking for the bar menu too as the main menu offered for dinner doesn't include the Nachos starter which are well worth ordering - make sure you add the spicy chicken!", "title": "Nice hotel at downtown Banff", "helpfulness": 2, "user": "cent1nu11", "date": "February 25, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 3.0}, "id": 153084796}, {"rating": 4.0, "stay_parameters": "Stayed March 2013", "text": "Wonderful hotel, highly recommended. Hot tub is to die for. Rooms are lovely, service pretty good. A little farther from town, but not bad. Keg co-located is definitely a bonus. Love the soap. Would definitely stay here again.", "title": "Great!!", "helpfulness": 1, "user": "Deanna M", "date": "March 5, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 5.0}, "id": 153748238}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "Stayed here one night before driving to Lake Louise for skiing. Located a good 20 minute walk to downtown. Our room was 110 which is directly across from the pool. Inquired about moving due to the noise and were told all sold out. The first floor is actually BELOW the lobby, so almost a basement type of window, though we faced a residential lot so no window noise, but the hall noise from the elevators to the pool was significant. Tolerable for just the one night stay however. Room itself nicely done, great shower and natural soap. Pillows too firm for our liking. Coffee maker in the room, fridge, fan, safe. Since we were so close to the lobby we simply grabbed coffee there in the morning very easy. Ordered breakfast and delivered under 25 minutes, which they were apologetic for the \"delay\" but we thought was very efficient. Indoor \"hot pool\" looked very cool, but didn't utilize. Overall, if we stayed here again, would certainly request a higher floor, not first floor.", "title": "Nice for a night", "helpfulness": 1, "user": "DebD88", "date": "March 3, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 153652153}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled solo", "text": "I picked this hotel for a one night trip. I lived up to all expectations. It is located on the main street into Banff with a walk of about 10 Mins to the Town centre. Local transit stops nearby as do ski buses. On site Keg restaurant good and breakfast worth adding to stay.", "title": "Night Away", "helpfulness": 1, "user": "Philip C", "date": "March 1, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 153456046}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "Rooms clean and although the room I had was not airconditioned was able to adjust temperature well.", "title": "Great Location - Slow Shower", "helpfulness": 1, "user": "AnnGr", "date": "February 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 153319609}, {"rating": 5.0, "title": "Excellent Hotel, Fantastic rooms, amenities, service and great value", "text": "All in all good value for money and parking is free.", "helpfulness": 1, "user": "david_baumken", "date": "February 27, 2013", "id": 153312882}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled with friends", "text": "This was a great hotel to stay @ , we arrived at the caribou lodge around 6;30 pm the front desk staff were very friendly and cheque in and out was fast and great . it's a about 10 minute walk to downtown banff the room was very clean and nice the bed were comfortable and parking is free", "title": "great hotel to stay @ in banff", "helpfulness": 1, "user": "happylady1981", "date": "February 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 152466721}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled solo", "text": "I arrived at the Caribou Lodge on the Banff Airporter Shuttle ( another real good service) and before the driver could even get my luggage to the curbside there was a hotel staff member right there to take my bags inside. The book-in process was quickly done, but not so rushed to leave one in a state of \"nodding agreement\" and not really understanding all the details. The hotel provided me with a free 3day pass for unlimited travel on the regular bus service ( another efficient operation) after 3 days they simple issued me another complimentary bus pass. I know that not every establishment in Banff provides a bus pass.", "title": "Very Comfortable Hotel", "helpfulness": 1, "user": "Windy_Feet", "date": "February 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 152206097}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "The lobby is fab with a large fireplace that is always warmingly welcoming guests from the outdoors. Just off the lobby is a restaurant called The Keg. It is very nice, however I did find the friendly staff to be a little to hurried so some errors were made, but not enough to be a serious problem. Also, off the lobby is a nice cozy lounge, that had managed to give me a friendly welcome with out being overly so. The clientelle was friendly and talkative without being bothersome - I don't know how an establishment achieves that outside of being so good they attract good people. Bar drinks had some of the fairest prices in town, so that was also good.", "title": "Great hotel for a stay in Banff", "helpfulness": 1, "user": "Pip182", "date": "February 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 152007728}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "The rooms are very well appointed, the bathroom is quite large. The beds gave me some of the best sleeps, 5 of them, that I've had in a long, long time. The \"blackout\" drapes really work. Some mornings I arose thinking that it was still quite early only to be shocked once I opened the drapes to a brightly shining sun. I've seen these types of drapes before but never to this effect- and I was on the bright side of the hotel in the mornings.", "title": "Everything you need!", "helpfulness": 1, "user": "Heather S", "date": "February 12, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 151991933}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "I truly enjoyed this establishment and will be returning to stay there during the upcoming summer. Also, I was told that you can reserve you room and if a cheaper offer appears on their website, due to promos and such, just contact them by phone and you'll be given the lesser rate.", "title": "Great Hotel and service", "helpfulness": 1, "user": "Gaynor M", "date": "February 11, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 151906922}], "location": {"country": "Canada"}, "stars": 3, "variance": {"poor": 52, "average": 105, "very good": 414, "terrible": 15, "excellent": 441}, "aka": "Banff Caribou Hotel Banff", "slim_ranking": 0.181818181818, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "description": "The Banff Caribou Lodge is centrally located on Banff Avenue, Banff's main street. It offers the Keg Restaurant, Red Earth Spa (a full service spa), free underground parking, free wifi, fitness room, hot pool and steam room. This lodge type accommodation has a large and inviting lobby to greet you to Banff. Enjoy your stay."}