{"user_rating": 4.5, "review_count": 69, "name": "Banjaar Tola", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "This lodge is probably the best that you can get in Kanha NP. The park itself is very far from Jabalpur (4 to 5 hours) on a very difficult road. Once there the lodge is only 5 minutes from the main entrance which is indeed very practical (no one can blame Kanha from being far from any city, this what wilderness is about).", "title": "Great wildlife lodge!", "user": "jboule", "date": "November 2, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 85684046}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled with friends", "text": "We have spent 3 beautiful days and nights here and our stay was almost perfect. The staff and boss were extremely kind and helpful, the guides were very competent and able to drive us to to the so expected Tiger (we saw 3 of them) but also a lot of other animals (dholes, gaurs, chitals, sambars, barasinghas, indian jackal, even a leopard and all the birds). The only issue we had was a very strong air cooling system that was hard to regulate and a little water flow in the shower but we did not pay too much attention to this after all.", "title": "The Most Wonderful Stay", "user": "TEEVEE", "date": "May 13, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 64032771}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "Just returned from a (too short) stay at Banjaar Tola. Every aspect was wonderful. (Even the 5 hour drive from Nagpur airport was interesting). The staff was amazing...every single one of them couldn't have worked harder to make sure we were comfortable with everything. From greeting us with a cold towel/drink after every return to hotel to waving goodbye. Service at all the Taj hotels/lodges was excellent. Didi, our butler, took great care of us. The chef - worried we weren't eating enough (it was 110 degrees, we weren't very hungry in heat) - offered to make pasta or non-Indian food if we wanted. The managers & staff were delightful. Service was the best! The \"tents\" are extremely roomy and comfortable. The huge bed was great and the lights, etc. easily accessable from the bed - with a great view of the river. The bathroom was huge - with 2 sinks, shower, tub, lots of closet space, safe....all amenities. The pool was a nice reprieve from the afternoon heat and the lounges were already waiting with towels, suntan lotion and staff brought cold drinks immediately.", "title": "Mission: See Tigers in the wild.", "helpfulness": 11, "user": "roadwarriorafrica", "date": "April 28, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 62672790}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled with family", "text": "But...other than pure comfort - we were there for the tigers! And they didn't disappoint. Our Naturalist Guide Payal was the absolute best....she's the only woman naturalist there and is so enthusiastic about her job - her love for the animals comes through every minute of every drive. We loved her! Our first sighting was a tiger in a tree (a rare occurence), we saw 3-4 others on elephant back. It is not an easy thing to find a tiger. Much harder than seeing animals in Africa...but what a thrill when you do! Well worth the trip. Our trip was arranged by Deepa Krishnan of Mumbai Magic and her service & coordination was excellent every step of the way. We've traveled with some of the best travel companies in the world and Deepa's service was unparalleled. She did a custom trip with several stops for 3 of us (women) from USA. You are in good hands with Deepa.", "title": "Amazing", "user": "jalan101", "date": "February 28, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 57327082}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "Banjaar Tola – Kana National Park – MP India", "title": "amazing place, amazing service", "helpfulness": 1, "user": "llewellynroger", "date": "February 20, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 56570699}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled with family", "text": "From the moment we reached the Kanha, Banjaar Tola lodge, we felt like we've been transformed into a whole new world......a world of luxury, premium service, ultimate comfort & royalty! The world was @ our fingertips....the service was personalised to the extent that what, when & where we wanted, was available @ an instant. There was a personal butler 24 hours, just to take care of us. We were so pampared by their royal treatment, that we didnt want the holiday to get over. The housekeeping was the best by far to any hotel(including in the US), we've stayed so far....the minute we stepped out of our suite, everything was refreshed, clean & in order. The best part of our entire trip(including the jungle safaris) was that there was never a \"no\" for an answer! The food( needless to say excellently palatable, varied & prethought of), was served @ a different location everytime with the head chef coming over to us each time to greet & affetionately explain the menu, which was one of its kind! The entire staff was very pleasing, smilingly greeting & always present when we needed them. We wished our royal stay never came to an end........the best place to be, a heaven on earth!!!", "title": "Taj, the name says it all. Felt like a queen!", "helpfulness": 2, "user": "realmonu", "date": "June 26, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 33217255, "likes": {"liked": "— Personalised treatment & warmth", "disliked": "— everthing was @ its best!"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "I stayed at the Taj Banjaar Tola at Kanha National Park in April, taking advantage of their summer off season offer.", "title": "Excellent Wildlife Lodge", "helpfulness": 2, "user": "vikramghanekar", "date": "June 18, 2009", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 32599778, "likes": {"liked": "— Superb service, excellent food", "disliked": "— Nothing"}}, {"rating": 3.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "We had stayed at Taj Safari's other property at Pench national park last year which was absolutely fantastic. So we went to Banjar Tola with great expectations. And all of them were fulfilled and more.", "title": "It's a long, long way...", "helpfulness": 4, "user": "Londona", "date": "April 16, 2009", "detail_rating": {"cleanliness": 5.0, "value": 2.0, "location": 1.0, "service": 5.0, "rooms": 2.0}, "id": 28165155}, {"rating": 5.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "This is a large property of about 100 acres adjoining the Kanha national park which is separated from the property by the Banjar river. There are no fences and animals including tigers are known to enter the property at night.", "title": "wonderfull, excellent and so friendly", "helpfulness": 3, "user": "kweeki", "date": "March 31, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 27166626}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "My husband and I just came back from a four night stay at Banjaar Tola during the last week of November. Since there's much already said about how luxurious the lodge is -I won't be reiterate. During the period of our stay, it was pretty chilly. You would be wise to wear a fleece, or a ski jacket (for windproof and warmth). Gloves and a hat are necessary. Hot water bottles, blankets and shawls are provided by the lodge. During turn down service, a heating blanket is turned on so your bed is nice and warm.", "title": "Impeccable service and great safari experience", "helpfulness": 2, "user": "wlslb", "date": "December 4, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121381658}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled with friends", "text": "Tips on things to pack:", "title": "In the luxurious lap of nature...", "helpfulness": 3, "user": "Meena_tai", "date": "October 2, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 118838923}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "- ski mask or something to cover the nose like a light scarf, it gets really dusty at times during the drive.", "title": "Fantastic lodge.", "helpfulness": 1, "user": "heb999", "date": "October 1, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 118815555}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled with family", "text": "- soothing throat drops.", "title": "super luxury safari lodge, lived up to its reputation a the best safari lodge in Asia", "user": "safaridoc", "date": "July 28, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 115911196}, {"rating": 4.0, "stay_parameters": "Stayed November 2010, traveled with family", "text": "- bring a packet of tissue (which is available in your room) for the bush loo which is a basically a designated \"shack\" located in the parking / picnic / ranger station as well. It's not for the meek of heart. If you can try to drink less liquid before you head out for the drive, you can minimize your use of the bush loo. Their is a proper restroom facility at the other side of the park (which is a different zone - so be sure to ask your guide) so you can bring some money to tip the lady at the restroom if your heart so desires and there is also a souvenir shop.", "title": "More than Resort, its an amazing experience of Jungle Lodge", "user": "bharatbafna", "date": "May 19, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 108938994}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled with friends", "text": "highly recommend this place to anyone who is visiting Kanha National Park. Tents done in great taste, offer an extremely serene view of the river and the jungle. The food and the service is exceptional. The set-menu offers amongst the best food combinations you would have and the chef does a brilliant job of preparing indian food to suit your palate. The tiger safaris in Kanha are a great experience.The naturalists are well trained and breakfast in the forest during the safari is an added surprise. there is a mini swimming pool too!, although I thought the water was too cold to take a dip despite the staff suggesting otherwise.", "title": "the best of indian hospitality coupled with a complete tiger safari experience!", "helpfulness": 1, "user": "traveler_sy", "date": "April 24, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 105289718}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled with friends", "text": "Would rate Banjaar Tola amongst the best Taj Safari(s) properties. And Beyond's experience and professionalism is an added advantage.", "title": "Banjar Tola - Kanha Safari Lodge", "helpfulness": 3, "user": "wjcNewJersey", "date": "April 13, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 103945075}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled with family", "text": "I really enjoyed my stay an Banjaar Tola Safari Lodge. The rooms are beautiful with a large bedroom area and large balcony with nice views of the river and Kanha National Park. The bathrooms have a tub and shower and dressing room in one large \"bathroom\". Really beautifully decorated. The chef excellent as were the guides. The drive to the park is about 5 minutes from the lodge and there is no wait. You have to stop and pick up a park guide to come along and he works with the lodge's guide to listen for warning calls from the other animals. We had our best tiger sighting in Kanha but it is not easy. Still being on safari in India was a pleasant surprise. There are many mammals and birds to see while you're waiting for the chance to see the big game and WOW when you do it is awesome!", "title": "One of the best resorts I have ever stayed at", "helpfulness": 3, "user": "nsahgal", "date": "March 7, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 99195224}, {"rating": 5.0, "title": "Searching for the \"TIGER\" in the wilderness", "text": "My parents and I decided to stay at Taj Banjar Tola while visiting Kanha national park. I have to say, this place is amazing. From the staff to the decor of our room, everything was great.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "February 9, 2011", "id": 95991050}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled with family", "text": "First the staff - I have never been given such personal service. The cook introduced each meal to us personally. Each staff member knew our name and took the time to get to know us. The staff here seem to really enjoy doing what they do and that I think is not very common in resorts.", "title": "Best Wildlife Lodge I've ever stayed at", "user": "CSingh", "date": "November 23, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 88053394}], "location": {"country": "India", "continent": "Asia"}, "stars": 5, "variance": {"poor": 2, "average": 5, "very good": 5, "terrible": 1, "excellent": 56}, "aka": "Banjar Tola Hotel Kanha National Park", "slim_ranking": 0.2}