{"user_rating": 4.0, "review_count": 176, "name": "Bannatyne Hotel Durham", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "Had a one night stay at this hotel (Durham) and couldn't fault it. The staff on reception were exceptional, very helpful with restaurants, taxi, local pubs etc. Nothing was too much trouble. Very happy with room, very clean, the size was ok , I wasn't having a weeks holiday so ample for our needs. The bathroom was very good large shower and powerful. We loved the plasma screen on the wall, it was a very clear picture and worked perfectly. Plenty of coffee tea etc. Had a breakfast following morning, which was ample and pretty good. Had no problems walking across to the Leisure Centre for breakfast, always like a walk on a morning so the short distance was no problem. Ample car parking. Probably only down side is the close proximity to a very busy road. We got a room next to it but unbelievably never bothered me one minute during the night and believe me I had visions of being awake. Would probably ask for a room away from the road if I was to go again just in case.", "title": "No complaints with this hotel", "helpfulness": 1, "user": "sue1958", "date": "October 27, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 3.0, "rooms": 4.0}, "id": 21310665, "likes": {"liked": "— Helpful staff, great tv, clean room", "disliked": "— Close proximity to main road"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "great clean rooms, with very nice showers, just the walk for breakfast in the morning was awful, not a far trek at all, but i dont want to get up in the morning and step out side to raind and wind to go and get a bite to eat, and even when we got to the leisure club where breakfast is held, not one seat available and the cue at the bar was literally still for what seemed like half an hour, so we checked out hopped into a taxi and had breakfast in this amazing cafe just over the bridge and up some stairs in york, wish i remembered the name of it!! still a very good hotel, with great priced rooms and good facility inside the room,", "title": "the breakfast trek!", "user": "andyaries", "date": "September 11, 2008", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 2.0, "cleanliness": 4.0, "value": 5.0, "location": 2.0, "rooms": 5.0}, "id": 19980714, "likes": {"liked": "— the comfortable bed and furniture, and the brill poewr shower", "disliked": "— walking to another building in the blistering cold to get brekkie"}}, {"rating": 1.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "best for youngsters like myself id say", "title": "Very disappointing - Disabled beware!", "helpfulness": 2, "user": "GrannyOrbie", "date": "August 4, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 2.0, "value": 3.0, "rooms": 1.0, "location": 2.0}, "id": 18597032, "likes": {"liked": "— Actually the Receptionist on the Saturday night and Sunday morning - tried to help and was obviously embarrassed. No other redeeming features other than it was inexpensive, but I would have happily paid more for better.", "disliked": "— Cramped room, not very clean, noise from Al as had to have window open because of stuffiness. Tiny bathroom."}}, {"rating": 2.0, "stay_parameters": "Stayed June 2008, traveled on business", "text": "My husband and I with our disabled daughter stayed here in July. On arrival we discovered that although I had booked a disabled room by telephone in February, there was not one available - already allocated to families. The room we were given was on the 2nd floor and was very cramped and stuffy. Although there was a lift - wouldn't have been much good in a fire! The carpet had not been vacuumed and wasn't the second day either - bed very shoddily made and my daughter's sofa/bed wasn't touched, neither were the tumblers changed. The bathroom was minute - yes there was a double shower, but in order to help my daughter wash and clean her teeth, I had to kneel on the loo.", "title": "Nothing special but gymn is good & food served there also", "user": "keithEngland", "date": "July 12, 2008", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 2.0, "rooms": 3.0}, "id": 17809305, "likes": {"liked": "— Value and free use of Health club", "disliked": "— No phones in room and off the beaten track"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "Disabled guests in particular should be aware that although the adjacent health club is included, the changing rooms are on the 1st floor. There is a lift to the changing rooms, but - wait for it - access to the pool is down a steep flight of about 15 steps! Quite why there is a lift up, but not down to poolside remains a mystery. This was our main reason for booking Bannatyne's as our daughter loves to swim, but it was an impossibility.", "title": "Great find on the edge of town!", "user": "QueenV1978", "date": "May 21, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 3.0}, "id": 16281295, "likes": {"liked": "— The Price", "disliked": "— Wasn't city center, but easy and quick to get to"}}, {"rating": 4.0, "title": "better than Premier inn", "text": "we were looking for a weekend away and took the opportunity to visit Durham as we received a deal on E-mail from Bannatynes.", "user": "Wanzebra2", "date": "March 15, 2010", "id": 58638906}, {"rating": 3.0, "title": "Good but need a new cleaner", "text": "the room was very good, better standard than Premier Inn, and Holiday Inn express although not as good as Holiday Inn, Hilton, etc - as you would expect. The room was warm and comfy, with a very 'fresh' feel. on-suite sufficient and staff very friendly and helpful.", "user": "himandherCornwall", "date": "February 20, 2010", "id": 56556233}, {"rating": 4.0, "title": "Broadband Beware!", "text": "Food available in Bannatynes Gym on the other side of the car park which provides a great selection of food and drink and also...as a hotel resident you have complimentary use of the gym, pool and squash courts which we used.", "user": "davie248", "date": "December 6, 2009", "id": 50749283}, {"rating": 3.0, "title": "Good and the Bad", "text": "hotel has ample free parking and is situated on a main bus route to town or take a 30 min walk into town.", "user": "pashleys", "date": "October 31, 2009", "id": 48198241}, {"rating": 4.0, "title": "Fantastic value and very comfy stay", "text": "great value at £35 per night room only", "user": "lisalush70", "date": "October 31, 2009", "id": 48188199}, {"rating": 4.0, "title": "Excellent Value", "text": "If you are simply looking for somewhere comfortable and clean to stay this hotel offers excellent value for money. Don't expect frills or luxury, but it does provide everything you need for a short stay.", "user": "1028", "date": "October 6, 2009", "id": 46006847}, {"rating": 4.0, "title": "Did the job!", "text": "Stayed here for 3 nights on a trip to the UK for a wedding in nearby Ramside Hall Hotel. We were pleased with almost everything except for the room servicing - something was missing each day. Toilet roll the 1st day, shampoo the 2nd & towels the 3rd. Our room was at the end of the hall so the maid was probably skimping by the time she got to our room. Overall though the hotel is clean & the staff friendly. The bar/restaurant is in a seperate building at the Leisure centre & food is ok. The room was only £50 per night which didn't break the bank & we slept well even though you could hear the A1 motorway even with the windows closed. The Ramside up the road was totally over priced at special offer for the wedding party of £62.50 p.p.s B&B. Most of the other guests were only staying for the one night there so it was ok. We were over from Ireland and due to flight restrictions had to stay the 3 nights. So I was glad I shopped around. I'd reccommend this hotel to anyone as it had all the amenities you could ask for and was comfortable and well priced for what you get. Only a 10min walk to the local pubs and Durham City is easy to get around & the shopping area is great with parking on the way into the city. We visited the Angel of the North while there & it's really impressive aswell as being a quiet beautiful sculpture. Well worth checking out, parking available just off the motorway. Only downfall was the torrental Rain - man we thought it rains here in Ireland but not a patch on the rain that fell there most of the wknd. Bring your rain gear!! Doubt we'll be returning to Durham for a long time but would stay again here if we did. Worth the money so you'll not be disappointed.", "user": "EHMkm", "date": "August 17, 2009", "id": 37942754}, {"rating": 5.0, "title": "great accomodation,lovely city", "text": "spent a lovely comfortable night here after a night out in Durham..room was spotless,staff were lovely.found no problem at all with security or checking in like some have mentioned.use of health club was a lovely bonus and we enjoyed a swim and a sauna before a simple but tasty breakfast.so pleased with it we've already made plans to stay again in a few weeks,we only live about 15 miles away but it works out cheaper to take the car and stay over than book taxis!! we paid £40 when we booked direct with the hotel...great price for a great little hotel.", "user": "2robertsons", "date": "August 16, 2009", "id": 37849390}, {"rating": 4.0, "title": "Great place - a little out of the city...", "text": "This is a great little place with nice rooms and a comfortable bed. It is attached to a health club so you get free use of the pool and spa facilities. The only drawback is that it is not in the centre of Durham and is about 30-40 minutes walk away or otherwise a 5-10 minute cab ride. The rates are very competitive too.", "user": "jamesforde84", "date": "April 13, 2009", "id": 27924729}, {"rating": 5.0, "title": "Fabulous value for money", "text": "We were made to feel very welcome by the staff. Our room was large, the bed was huge. The kids both had comfortable beds, and loved the large plasma telly. We used the swimming pool at the leisure centre, which was fabulous, and at no extra cost. We ate at the restaurant at the leisure centre, and the food was good. Although I wouldn't recomend the scrambled egg, as it was a bit strange.", "user": "lupolady", "date": "April 5, 2009", "id": 27460847}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "We booked this hotel 2 months in advance so secured the £35.00 a night APEX tariff - what great value. On arrival and throughout our stay all of the reception staff were extremely helpful. Our room was very clean and spacious, had a huge bed, a large flat screen TV and a good size shower in a modern bathroom. The price also included access to the superb Bannatyne health club, so in my opinion you’ll enjoy just about everything you’ll need for a great value short stay.", "title": "The Scottish dragon delivers superb value but he can't boil an egg!", "user": "bucsal", "date": "March 24, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 3.0, "rooms": 5.0}, "id": 26768441}, {"rating": 4.0, "stay_parameters": "Stayed March 2009, traveled with family", "text": "The only negative was the budget driven breakfast menu in the health club restaurant. We opted for the full English breakfast @ £5.25 but despite printed options on the menu we were advised that only scrambled egg was now available as the poached egg option had been withdrawn due to customer complaints. Apparently liquid egg is now supplied to help with portion control which seems a shame given that fresh eggs come conveniently wrapped in basic units.", "title": "Stay but skip breakfast", "user": "himnher2", "date": "March 23, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 3.0, "rooms": 4.0}, "id": 26657366}, {"rating": 4.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "In summary our TV dragon Mr Duncan Bannatyne has developed a superb product let down by just the smallest detail.", "title": "Fantastic value, comfortable, clean and handy for the city", "user": "timclay", "date": "March 3, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 25493639}, {"rating": 4.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "The rooms were good and good value for money with the deal we got (via Active hotels).", "title": "Very good value", "user": "pgwswth", "date": "February 8, 2009", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 5.0, "location": 2.0, "rooms": 3.0}, "id": 24371659, "likes": {"liked": "— value", "disliked": "— noisy bathroom fan"}}, {"rating": 1.0, "stay_parameters": "Stayed October 2008, traveled with family", "text": "Leisure facilities were good.", "title": "What's the point of booking?", "helpfulness": 5, "user": "jdandevdev", "date": "October 29, 2008", "detail_rating": {"front_desk": 1.0, "location": 3.0, "value": 1.0}, "id": 21369614}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "stars": 2, "variance": {"poor": 9, "average": 27, "very good": 74, "terrible": 9, "excellent": 57}, "aka": "Durham Bannatyne Hotel", "slim_ranking": 0.473684210526, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "description": "The Bannatyne Hotel Durham provides quality accommodation at great value prices. If you need to stay in the North East of England on business or for pleasure the Bannatyne Hotel Durham will provide you with the facilities you need. FREE parking, FREE wireless broadband internet and FREE access to the Health Club"}