{"user_rating": 4.5, "review_count": 873, "name": "Bar Harbor Inn", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "I was amazed when I just looked up the ratings and found that the Bar Harbor Inn was rated number 6 of hotels in Bar Harbor. I can't imagine how any place there could be any better. On our second trip to Bar Harbor we stayed there and everything was perfect. Our room was in the building with little decks looking out over the water -- wonderfully relaxing to sit out in the afternoon with a glass of wine. Our rate included a regular breakfast plus two dinners - we were there for three nights. The room was very nice - not hugely special but clean and had everything you could want, and in excellent condition. The main building, where the restaurant is, was lovely but we liked our building for the decks.", "title": "Not rated # 1?", "user": "2tired2drive", "date": "April 30, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 62811809}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "Our meals were all excellent. We also used the spa which was lovely and the pool where you could have a drink brought to you if you so wished. The grounds were lovely and it's right on the walk along the ocean and a block from shopping. What's not to love? The first place we stayed is also a highly regarded place but the room was sub-standard. I cannot imagine that on return visits to Bar Harbor we would every stay anywhere else.", "title": "Beautiful even in the off-season", "user": "MassachusettsTripS", "date": "April 21, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 62107759}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "As we drove in, we noticed numerous cute inns and cottages, motels and hotels along the way, but when we arrived at Bar Harbor Inn, I realized we had chosen the most beautiful hotel on the island.", "title": "Just Perfect again!", "user": "BPRL", "date": "April 21, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 62096793}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled with family", "text": "The hotel staff was friendly and helpful. We were able to take advantage of the spa on site. It was clean and serene and the staff anticipated our every need. It was relaxing and completely destressed us. We each got a massage and the staff was very professional.", "title": "Comfortable, elegant, friendly and welcoming", "user": "DeborahFZ", "date": "April 20, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 61973924}, {"rating": 4.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "Our room had an oceanview and the balcony was pretty much on the water. Despite the cold temperatures, we left the door open to hear the ocean at night. We went in April but we are going to go back in May or June some time so we can partake in other tourist attractions like the bar harbor night cruises and summer sports in Acadia park. April, although lovely, did not have a lot of attractions open. It was great to see all the famous sites in the park without the lines though.", "title": "Great location while experiencing the island", "user": "evafoi", "date": "April 7, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 60680107}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "The room blew our minds away with its 5-pillow queen size beds! We had never stayed in a room with 5 pillows for each of us, they were soft and the bed was huge and comfortable. I still miss the bed until now!", "title": "loved the room and view!", "user": "Uniquely-Baldy", "date": "December 13, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 4.0, "service": 4.0, "rooms": 5.0}, "id": 51161307}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "The view from the balcony was great too, we were a stone's throw away from the ocean. It was quiet and private and very romantic to show the sunrise from the balcony.", "title": "Fantastic", "user": "bouncymay", "date": "November 8, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 48787015}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled with family", "text": "The inn is also conveniently located next to the pier and the main shopping street. Although most of the shops had closed for the year, and the cruise ship no longer went out because of rough water that time of the year when we visit, I still love the location. At least, I am not stuck in the middle of the woods!", "title": "THE PLACE to stay for recharging your body and soul.", "user": "sweetwinter", "date": "November 3, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 48398763}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "I wished the breakfast had more variety though. We stayed there for 3 days and had the same breakfast combination everyday, it got a little boring.", "title": "Exceeded our expectations", "user": "NCroadtripping", "date": "October 26, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 47771678}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "We booked at the Bar Harbor Inn on recommendation of a friend and we hit a home run. We booked a package deal including room (absolutely fantastic), dinner (anything we wanted - GOURMET - and the wait staff incredibly attentive and helpful ) and breakfast ( the lobster omelet was the best!!!). The setting is very romantic, the staff superb, the grounds absolutely beautiful, and the location perfect (walk to almost everything). On a scale of 1 to 10 - a definite 11.", "title": "Great service--actually returned a forgotten item", "user": "JOuye", "date": "October 23, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 47580887}, {"rating": 4.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "We've stayed here a few times, most recently in room 401. A small room with queen bed, second floor with balcony overlooking bay. The location is unbeatable - on the ocean, beautiful grounds, walking distance to shops and restaurants. The check-in was very easy and the front desk guy was helpful and welcoming. The room is rather small, but just fine for a couple. Flat screen TV. Fairly comfy bed and the place was pretty quiet - tho doors starting slamming around 7am. The balcony is super nice - but it's not really private as the shore path below is well traveled by walkers - and if the people next to you are on their balcony there's really no privacy at all. But for what we paid, the room and view are worth it. This is a special-occasion kind of place; we were there to celebrate our anniversary. The rooms could use a little decorating updating - chintz and flowers should really be retired across the land.", "title": "Beautiful spot and gracious staff", "user": "MaineIzzy", "date": "May 29, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 65722478}, {"rating": 5.0, "stay_parameters": "Stayed May 2010", "text": "There is no more beautiful location in Bar Harbor in our opinion. This lovely property right on the ocean front bars none for serenity and beauty. You would never believe that you are within easy walking distance of all the wonderful shops and sights in downtown Bar Harbor. because it feels so private and secluded. We loved everything about this lovely resort. We have stayed here several times and have never been disapointed. In addition to a first class restaurant looking out at the ocean, there is a wonderful lounge area with a fireplace to rest and relax while you have your tea and homemade cookies in the afternoon. If you like to sleep late your partner can mozy on over for a complimentary cup of coffee and lounge on the lawn looking out at the most beautiful ocean view while waiting for you to awaken for a delicious breakfast. After a gourmet dinner you can walk along a wonderful path at the ocean's edge for some fresh air before you go to sleep. There is a heated pool and a spa as well. Don't forget to bring a sweater for a delightuf two hour sailing cruise where you board at a dock in front of the hotel. How is that for convenience. The service is terrific from making the reservations with Kaitlin to being served the most delicious lobster bake by Elizabeth, a charming and helpful server. Terry was an exceptional hostess. . Katherine was so cordial and helpful at check in. How do I know all these people by name? Because this is the most helpful and delightful group of Maine people who actually care that you are being served well.", "title": "A paradise by the sea", "user": "Mainerportland", "date": "May 27, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 65489908}, {"rating": 4.0, "stay_parameters": "Stayed May 2010", "text": "We had a great night's sleep with comfortable beds and the ocean air coming through the open window. We can't wait to go back to this little paradise on the ocean . Great value for such an experience in a facility such as this which is only able to stay open for part of the year.", "title": "Gorgeous view!", "user": "msdrannie", "date": "May 18, 2010", "detail_rating": {"cleanliness": 3.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 64539573}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "This was my second trip to bar harbor. I remembered this hotel from my first trip... And loved the location. I went with my elderly mother and we stayed in the Newport building.... And walked a short distance to the complimentary breakfast spread of Danishes, fresh fruit, cereal and yogurt. We ate on back terrace with a lovely view of Frenchman bay. We were there just before the season and got room for 109/ ni which we found most reasonable. The fitness center is small with 2 treadmills, one nautilus machine, a recumbent bike, and an elliptical, so this might not be ideal if that's a priority. Shore path behind hotel was great for a 1 mile jog- I did numerous \"laps\"", "title": "Resort-class accommodations with the charm and warmth of an inn", "helpfulness": 1, "user": "lhimml", "date": "May 8, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 63605041}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "Our one-night stay was perfect, and I can't recommend this hotel highly enough. Our bayfront room with balcony was very reasonable (April), especially considering how nice, large and well-appointed it was. TV fans will appreciate the large flat-screen TV. The continental breakfast (served oceanside) was a real treat, and like everything else at this property, it exceeded expectations.", "title": "Bar Harbor Inn...Excellent...We'll be back!!!", "helpfulness": 3, "user": "mwp_10", "date": "May 2, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 63003213}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "My husband and I took a \"leaf peeping\" trip up the coast of Maine, and we so happy we chose the Bar Harbor Inn!", "title": "FABULOUS! Will DEFINITELY be back!", "helpfulness": 1, "user": "Steffiesunshine", "date": "October 19, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 47287414}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "The Inn itself was absolutely beautiful. The location is so convenient to the shore, and the piers for Whale Watching or boating excursions. Right next to Main St. with all it's quaint little shops, it was definitely the place to stay.", "title": "Still a favorite", "user": "FrancesNewYork", "date": "October 18, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 47163190}, {"rating": 5.0, "title": "Simply......Maine Magnificent!", "text": "Was it pricey? Yes, but well worth the money. We stayed in a harbor view room in the Main Inn. The view from our balcony was breathtaking. The sunrises in the morning were just magical. The rooms were incredibly clean and in very good condition. ( And believe me...I have issues with cleanliness!) We had a jetted tub, and I even took a bath which was so relaxing. The staff was very helpful with directions, and any other requests we had or assistance we needed.", "helpfulness": 1, "user": "SMRF", "date": "October 16, 2009", "id": 47001454}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "The continental breakfast was what you can expect - fruit, bagels, cereals, tea, coffee...just fine for a free breakfast. We did not eat at the Inn, as we were adventurous and tried several of the lobster pounds on the island. However, our room had a view into the Reading Room and it was quite lovely, and the view was spectacular.", "title": "A Trip Worth Repeating- Great Views and Food", "user": "PairofKings", "date": "October 15, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 46931449}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "Acadia Park is just a short drive from the BHI, and it is NOT TO BE MISSED!!!", "title": "The best of everything", "helpfulness": 1, "user": "lunamoon667", "date": "October 14, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 46831636}], "location": {"country": "United States"}, "variance": {"poor": 34, "average": 49, "very good": 220, "terrible": 10, "excellent": 560}, "aka": "Bar Harbor Hotel Bar Harbor", "slim_ranking": 0.184210526316, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.0, "location": 5.0}, "description": "Bar Harbor's best oceanfront location, with great in-town convenience. Rated \"Superior First Class\" by Official Hotel Guide. Eight acres of lush lawns/gardens, three beautiful and distinct buildings, embraced by serene half-mile shorepath. Elegant rooms/suites; king/queen beds; premium bedding; waterfront balconies. Superior hotel amenities -- complimentary deluxe continental breakfast, luxury robes, wireless internet, homemade cookies. Both fine and casual dining - with delicious cuisine, attentive service, breathtaking ocean views."}