{"user_rating": 3.5, "review_count": 854, "name": "Barcelo Ponent Playa", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "After reading some of the reviews on here i was a little worried about our stay however i didnt need to be. The hotel is situated on the most amazing beach and i cant see the point in even needing to bother with the pool when the beach is two steps away! Yes the pool is small for the size of the hotel but with the beach right there it really doesnt matter. Why people would queue at 7 in the morning is beyond me!", "title": "Great Hotel, Great Location", "user": "Vix25", "date": "July 10, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 34374831}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "We had a sea view room which i would recommend as it is much quieter in the evenings and has the most amazing views.", "title": "Excellent bargain!", "user": "rakky28", "date": "July 8, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 3.0}, "id": 34237616}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "The food at the hotel is great if you arent the type of person who only eat chips and burgers and likes to experience traditional foods. Every lunch time there was a different dish being prepared by the chefs for you to see, from Calamari, to baby squid to frsh prawns and local meat. Yes there are chips, burgers, pizzas etc but with such a choice on offer why eat the food you can get at home! The salad bar is great too with every type of veg and dressings you can think of!", "title": "Great value for money", "helpfulness": 3, "user": "Bcfcboz", "date": "July 8, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 34219717}, {"rating": 3.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "Service is good although they do get quite busy in the evenings which is understandable for the size of the restaurant.", "title": "disappointed!!", "user": "dolNorthWales", "date": "July 5, 2009", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 4.0, "service": 3.0, "rooms": 2.0}, "id": 33961368}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled with family", "text": "Yes the hotel may need a bit of updating, but how much time do you really spend in your room with an amazing beach on your door step!!", "title": "excellent time had all", "helpfulness": 2, "user": "fasted123", "date": "July 3, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 33830091}, {"rating": 2.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "Old and tired hotel that needs pulling down and rebuilding, the food was terrible, the pool was horrendous, no fridge in room and the service you got from the restaurant was so so bad. The rooms were just old fashioned as was the air conditioning, but just ok to sleep in.", "title": "Perfect Location Shame about Everything Else", "user": "Safc_ok", "date": "July 25, 2009", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 5.0, "service": 1.0, "rooms": 1.0}, "id": 35739463}, {"rating": 3.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "Would i go back...YES but only for its perfect location, i would eat out every day as the there so many places to eat merely yards from the hotel.", "title": "Lovely location poor hotel", "user": "harvey1974Stoke", "date": "July 21, 2009", "detail_rating": {"cleanliness": 4.0, "value": 1.0, "location": 5.0, "service": 3.0, "rooms": 2.0}, "id": 35418355}, {"rating": 1.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "If you do got to this hotel...do not use the pool, go to the beach which is about 30 meteres away, eat out and i guarantee you can put up with the dissapointment of the hotel.", "title": "Shabby all inclusive free for all.", "user": "ifuwant4starpayforit", "date": "July 20, 2009", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "location": 5.0, "service": 1.0, "rooms": 1.0}, "id": 35317902}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled with friends", "text": "Booked for a week fully inclusive .Before we departed to this holiday we sent e mail to hotel asking if we had sea view room, they replied and told us we did not and had to pay extra 126 euro on arrival, we agreed and paid on day of arrival. Got a room with an amazing view over the sea but poor size room and very dated... AIR con worked in this room however!! Arrived in afternoon and went down for dinner to hotel restaurant. was very busy and food not great.. Next morning breakfast was mad too with people searching for tables. again food very cheap and poor..We never tried again just dined out rest of time. All inclusive only allowed for certain CHEAP drinks or half price all other drinks and stopped after 11pm when you have to pay full price. Entertainment at hotel was very poor spanish acts... never tried hotel pool but very small and no chance of a sun bed after 8.01 am... But on a good note we went to the beach every day and paid 11 euro for two beds all day. Amazing beach and the sea cove is the best i have seen with sea water very clean and calm. Would recommend cala d'or as an holiday but not this hotel until they update and get a better chef... hope these comments help.", "title": "Awesome holiday!!!", "user": "rachey123", "date": "July 19, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 35165774}, {"rating": 3.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "Avoid this hotel at all costs. The rooms are tired with no fridge and sponge mattresses. The air conditioning is the worst i've ever come across .Do not under any curcumstances pay for a sea view as most are only beach view. The food is a complete joke it's total chaos. Typical all inclusive hotel. the swimming pool is horrendous as there are enough sunbeds for about a third of the hotel, these are gone as soon as the pool opens, there are other sunbeds available on the terrace overlooking the sea but you'll have to be there before half 6 in the morning to get one. The resort is great only a short walk to Cala d'or centre loads of restaurants and bars. Lots of other better hotels and apartments . You have been warned and will only like this dump if thats what your used to.", "title": "Nice location,shame about the air con!", "user": "Rubyju", "date": "July 13, 2009", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 4.0, "service": 3.0, "rooms": 2.0}, "id": 34648780}, {"rating": 2.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "Everything about this 3* Hotel is basic from the small pool view rooms to the food,where choices and varieties are very few.This Hotel is in need of a complete make-over and has been,and is being badley neglected.", "title": "If you want good food,good standard of cleanliness,large clean swimming pool and surrounding area then DONT go here!", "user": "kenny69", "date": "July 2, 2009", "detail_rating": {"cleanliness": 1.0, "value": 2.0, "location": 2.0, "service": 1.0, "rooms": 1.0}, "id": 33753742}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled with family", "text": "Stayed at the barcelo ponent playa for 1wk from the 21st june. Normally we would go to 4 and 5 star hotels but this time myself and my husband decided we'd try cheap and cheerful and thats exactly what we got. The hotel is built a long time but kept very well and is spotless. We travelled with our 1 and half year old girl and have to say she had a ball, for all ye mums wondering about the milk for babies. I gave my daughter the semi skimmed milk from the restaurant everyday and she had no sick stomack at all which was a relief.", "title": "Lovely bargain holiday", "user": "holiday_gangMeath", "date": "June 30, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 33603781}, {"rating": 3.0, "stay_parameters": "Stayed June 2009, traveled with family", "text": "We all really enjoyed the holiday and ok you do have to queue for the pool sunbeds but thats only because the pool is separate to the hotel with a locked gate.", "title": "Not the best hotel we have stayed in", "user": "SwanseaDai", "date": "June 24, 2009", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 5.0, "service": 3.0, "rooms": 3.0}, "id": 33053104}, {"rating": 2.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "The only thing that could of been a bit better was our air conditioning in the room, it was'nt cool enough even though it has a temperature gage. We had to open the balcony door every night to let some cool air in. I'd say in July and August the heat would be a nightmare.", "title": "Ruined Honeymoon!!!!!", "user": "Content_Team_Player", "date": "June 24, 2009", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 5.0, "service": 2.0, "rooms": 5.0}, "id": 33048353}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled with friends", "text": "Also its worth upgrading to All inclusive 16 euros per day pp. Would definately go back to the barcelo for a nice relaxing cheap holiday.", "title": "Wonderful location - great holiday", "helpfulness": 1, "user": "Dreamholidays", "date": "June 24, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 33040728}, {"rating": 3.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "My wife and I have just returned from the Ponent Playa last friday.", "title": "The Good and the Bad", "helpfulness": 2, "user": "G04it", "date": "August 4, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 2.0, "rooms": 3.0}, "id": 36709875}, {"rating": 3.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "We are both in our sixties and have travelled extensively over the last forty years. We have stayed in world famous hotels as well as simple b & bs.", "title": "Great Location, Stressed Staff", "user": "EssexMooley", "date": "August 2, 2009", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 3.0, "service": 2.0, "rooms": 2.0}, "id": 36502072}, {"rating": 4.0, "stay_parameters": "Stayed April 2009, traveled with family", "text": "We always try to make the best of wherever we end up, after all its a waste of time and money if you dont.", "title": "Had a fantastic time...!!", "user": "cliffTwickenham", "date": "July 29, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 36149832}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "So, after reading other comments we went with an open mind. Our first impression was that the hotel has seen better days. We were quickly checked in and were given room 385 on the 3rd floor (The hotel is built on a hillside and the 3rd floor is the reception floor at the front of the hotel). We had paid extra for a sea view, and what a fantastic view of the beach and Cala Ferrera we had. The room was basic and a bit on the small side, but that wasnt going to worry us.", "title": "EXCELLENT, BUT !", "helpfulness": 1, "user": "aries1967", "date": "July 28, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 36026631}, {"rating": 1.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "We arrived at 2.30 pm and went straight down to the restaurant for lunch. The restaurant was virtually empty, so no hassle there. During our stay we only encountered a full restaurant once, this was on the sunday evening when there seemed to be an abundance of locals. However we were soon seated. We did find that the food was pretty basic and not presented very well. The trays were left empty for long periods on a regular basis, so you either waited or chose something else. The guy cooking the eggs / bacon / meats / fish never stopped working but could not keep up with demand during the busy periods. Again, the same with the restaurant waiters, they were rushed off their feet and struggled to cope. This is really bad management, as we feel that two or three extra staff would have made a big difference. We found all the staff at the hotel to be pleasant and very hard working, all except the restaurant manager (I think), the big guy with the clip board, who couldn't be bothered to speak to anyone.", "title": "advise not to stay here", "helpfulness": 1, "user": "WATO1129", "date": "July 28, 2009", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "location": 5.0, "service": 1.0, "rooms": 2.0}, "id": 36015225}], "location": {"country": "Spain", "continent": "Europe"}, "stars": 3, "variance": {"poor": 80, "average": 189, "very good": 345, "terrible": 39, "excellent": 201}, "aka": "Barcelo Ponent Playa Hotel Cala Ferrera", "slim_ranking": 0.571428571429, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.5, "rooms": 3.5, "location": 4.5}}