{"user_rating": 4.0, "review_count": 887, "name": "Barcelo Eresin Topkapi", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "I spent four days in April 2013 in this hotel, having the opportunity to try its good level.", "title": "Good hotel with high service level", "user": "ingsap", "date": "April 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 157755924}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "I just could critizise the location, which is a litte far from the city.", "title": "2 generations trip to Istanbul (father and son)", "user": "M_weber_123", "date": "April 14, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 157723594}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "But the tramway line T1, which is in front of the hotel, reduces considerably the problem.", "title": "Good value, comfortable hotel within easy reach of the main sights", "helpfulness": 2, "user": "Bitten_by_the_bug_10", "date": "April 12, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 157487329}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "During my stay I enjoied very much the internal spa, included in the room price.", "title": "H F R Y April 2013", "user": "HuqM", "date": "April 12, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 157483791}, {"rating": 3.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "I would recommend this hotel to my friend, suggesting them to buy an all-inclusive package, breakfast included, because the price of the buffet-breakfast seemed to me quite high.", "title": "Definitely not 5 star", "user": "PlanetOz", "date": "April 12, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 157476512}, {"rating": 5.0, "stay_parameters": "Stayed April 2013", "text": "Clean, spacious and friendly hotel. Large and modern rooms. We had delux premium room with breakfast and complimentary massage.", "title": "Great for families looking for larger hotel.", "helpfulness": 1, "user": "bhaiyaman", "date": "April 12, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 157471702}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "Great breakfast with hot and cold buffet. Choice of eggs brought to table. Helpful staff although not everyone spoke English.", "title": "Luxurious yet affordable", "helpfulness": 1, "user": "M K S", "date": "April 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 157434247}, {"rating": 5.0, "stay_parameters": "Stayed April 2013", "text": "Tram stop just outside was just perfect. Located on T1 line with 15 mins to major sights 20 mins to bosphorous criuses.", "title": "2nd stay just perfect", "user": "denniscath", "date": "April 11, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 157433728}, {"rating": 3.0, "title": "Doesn't feel like a 5 star hotel", "text": "Happy to recommend. We got a great deal for our 5 night stay.", "user": "TKtraveller486", "date": "April 11, 2013", "id": 157400329}, {"rating": 5.0, "stay_parameters": "Stayed April 2013", "text": "Location: Opposite Pazartekke Tram, 5-10 mins to Beyazit (for Grand Bazaar) and SultanAhmet (for Blue Mosque) and 15-20 mins from Eminonu (Spice Market/Ferry Pier to Eyup Bosphorus and Princess Islands) and Kabatas (for Dolmabache Palace).", "title": "Excellent", "user": "BRH_72", "date": "April 10, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 157341984}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "My husband, daughter and myself had a wonderful 3 night stay at this hotel over the Easter holiday. We made use of the swimming pool and spa - which was really lovely after busy days visiting sites in Istanbul. The tram stop was right opposite the hotel - and easy and cheap to get anywhere you wanted to - the only down side being very busy but the locals were extremely polite and helpful by often offering up their seat for mature lady tourist! The hotel staff were excellent and extremely helpful. Super breakfast spread - so many things to choose from - really set you up for the day. I would thoroughly recommend this hotel - and would certainly return here if I came back to Istanbul. In response to other comments - we had only booked a standard room - but were provided with all toiletries if we so needed - and had tea and coffee making tray provided - which was topped up daily - and also provided with robes and slippers which were appreciated - especially for use in the spa. I cannot say whether we had inadvertently been upgraded - i can only report on our experience, which was excellent.", "title": "Excellent hotel", "user": "crispy10", "date": "April 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 157293976}, {"rating": 3.0, "stay_parameters": "Stayed April 2013, traveled on business", "text": "Stated at Barcelo Eresin for business for 2 nights.", "title": "Convenient place", "user": "SammyDMN", "date": "April 10, 2013", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 5.0}, "id": 157276992}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "Rooms are a bit dated, bathrooms could be a bit nicer,", "title": "Excellent", "user": "whiteOxford", "date": "April 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 156892593}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "Breakfast menue is acceptable.", "title": "Greaaaaaat hotel", "user": "natoura", "date": "April 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 156763618}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "Service at restaurant is average", "title": "Reasonable hotel", "user": "Abraham_puthoor", "date": "April 5, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 156674308}, {"rating": 4.0, "title": "In a \"real\" Turkish neighborhood; good value for price", "text": "Recently spent three nights at the Barcelo Eresin Topkapi. I paid a little over $500 with breakfast included which I thought was an excellent bargain with this hotel. Before I get to the positives, there are two \"negatives\", if they can be called that, to address. First, the hotel bills itself as a five star hotel on many hotel websites. While the service was very good and deserving of 5 star service, the facilities themselves were more 4 star caliber. Second, \"Topkapi\" in the hotel's name is a bit misleading. The hotel is nowhere near Tokpaki Palace but rather, it is near the \"Topkapi\" neighborhood of Istanbul which is not where the Palace is located. I actually found that to be a big plus as other than the Holiday Inn across the street, the hotel is in a middle class Turkish neighborhood with very few tourists around which I found very interesting and refreshing.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "May 12, 2013", "id": 160492246}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "I was assigned a room on the top floor, the \"balcony\" rooms. These aren't really balconies but are the actual rooftop of the hotel. You can step outside, and for those of us who smoke, it's a great plus. The room, as the rest of the hotel, was very clean if a little outdated. The elevators were very cramped and seemed somewhat old (although they did come quickly) and the phones seemed from another era. However, the bed was extremely comfortable, a good array of tv channels (about 3 in English - all news) and the bathroom was spacious and very clean with good amenities. My room was individually climate controlled so I had no problems with too much heat or too much cold.", "title": "Great Location due to tram outside the door.", "user": "Rich_n_Chris2", "date": "May 7, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 159952870}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with friends", "text": "I arrived in Istanbul somewhat late and was hungry so I ordered the room service. The salad was average but good and the chicken with rice and vegetables was delicious. The breakfast buffet was very, very good with a large array of Turkish specialties, cold cuts, cheeses, breads, cereals and the infamous Spanish table with pork. The service at the breakfast buffet was exceptional and this theme seemed to run throughout the hotel staff itself. Very knoweldgeable and very pleasant, but that's seems to be the Turkish standard.", "title": "Great Hotel", "user": "B_HToronto", "date": "May 1, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 159388310}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "As to location, as mentioned previously, the hotel is in a non-touristy area. However, the T1 tramline's Pazartekke station is right across the street from the hotel. This line will take you straight to stations for the Grand Bazaar, the Blue Mosque, Aya Sofia, Topkapi Palace and the Eminonu pier for ferries up the Bosphorus and to \"Asia\". The line also crosses the Golden Horn into the other side of European Istanbul but follows a route that is a bit off from any sights in that area. It ends in Kabatas from where you can take the funicular to Taksim. While the previously mentioned sights are no more than 15 minutes away by tram, it took me nearly 45 minutes to get to Taksim and about another 15 minutes to get to Sisli. Istanbul is a big and crowded city but I was really tired when it was time to leave Sisli and given that the ride involves two transfers on crowded metros and trams, it wasn't much fun. Still, I have little complaints about location and having the mini Carrefour right around the corner was good. Yes, there is a mosque nearby with a call to prayer at 5 a.m., but I was so tired most nights I only heard it once.", "title": "Nice (but value for price could be better)", "helpfulness": 1, "user": "Anton K", "date": "April 20, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 158291072}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "In sum, I would recommend this hotel highly for anyone who wants a comfortable, more \"upscale\" place to stay but doesn't want to pay the high prices that were going when I tried to book a room near Taksim. It offers good value for the money and being in a Turkish neighborhood and using public transportation as the Turks do, was great for me.", "title": "Good 4 Star Hotel", "helpfulness": 1, "user": "AS-UK2", "date": "April 16, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 3.0}, "id": 157960895}], "location": {"country": "Turkey", "continent": "Europe"}, "stars": 5, "variance": {"poor": 30, "average": 113, "very good": 330, "terrible": 13, "excellent": 401}, "aka": "Barcelo Eresin Topkapi Hotel", "slim_ranking": 0.184454756381, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.0, "rooms": 4.0, "location": 3.5}, "description": "The Barcelo Eresin Topkapi is an elegant Barcelo Premium category hotel in the featuring special guest care and offering spacious, light-filled and recently-renovated rooms (January 2007), as well as a magnificent 1000-square-metre Wellness Centre - the Aqua Life Club -, the Picasso restaurant with its gourmet days and delicious Turkish and international cuisine, and a Conventions Centre with 12 conference rooms. Its privileged location offers the perfect combination for all wishing to explore the historical areas of this magnificent capital city, home to three empires, as well as for all coming to Istanbul on business."}