{"user_rating": 4.0, "review_count": 1476, "name": "Barcelo Maya Tropical", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled with family", "text": "My husband and I were travelling with our 8 year old son. We had a wonderful time at the Barcelo Maya Tropical.", "title": "Wonderful vacation at barcelo maya tropical", "helpfulness": 2, "user": "Ancienne-Lorette", "date": "March 13, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 100037583}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled with family", "text": "We were there from 5 Mar to 12 Mar 11. We were told that the hotel was at full capacity. Although it was lively, we did not feel cramped. As many reviewers reported, this complex is huge, so if you wish to have more tranquillity, you can always find a spot. This is our 7th trip in this type of resort but the first time at the Barcelo.", "title": "Great place to stay with kids", "helpfulness": 1, "user": "willscalgary", "date": "March 10, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 99657464}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "We normally prefer to swim in the ocean but the pools were so beautiful, we also used the pools. Some reviewers say that the water is cold. While we were there, the water was less warm then the ocean but it was still warm and comfortable.", "title": "Great Resort, alittle far from the airport....", "user": "Golfgoumba25", "date": "March 6, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 99148183}, {"rating": 5.0, "stay_parameters": "Stayed February 2011", "text": "The grounds are kept immaculate. Some people complain about having to walk long distances. For us, we did not think this was a problem and our room could not have been more far from the beach. We enjoyed the fountains and the beautiful flowers, it was a nice walk.", "title": "Great Time", "user": "shudann", "date": "March 6, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 99100199}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "My husband is a meat and potatoes kind of person and I like to try new dishes. We were both happy with the buffet although we have been to resorts where the selection was more to our taste (Club Med Cancun).", "title": "Everthing we'd hoped it would be", "helpfulness": 2, "user": "mountainman202", "date": "March 5, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 99005548}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "This hotel is a very good resort for young children. I have a 2 and a 4 year old and they loved it. There's a childrens pool area with waterslides, activities during the day, entertainment at night. The staff were very nice to the children and very accomodating. We upgraded when we got there and it was worth the money we spent. The room was very clean and spacious and most of all comfortable. The view was the pool , then the beach....beautiful!!!! it was a shame that there was a leak in our bathroom ceiling on the third day but they were very accomodating and switched us to another room. My children were not comfortable in the room we moved to so we moved into a suite which was absolutely amazing. Separate bedroom with a living and dining room area. The bathroom was half the size of our first room. Again the staff were very courteous and accomodating in moving us from one room to another. My two year old got sick on the second day but the resort had a doctor on site that treated her with antibiotics and she got better within a day.", "title": "Great vacation", "helpfulness": 3, "user": "Jazna", "date": "September 11, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 79170838}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled solo", "text": "The food was very good, i found that there was variety in the buffet and preferred it over the al la cartes. Kids had a hard time eating because of the heat but enjoyed the french fries and pasta each night. I would definitely reccomend this hotel to families with young children. I hope you have a great experience as I did with my little ones, the hotel overall was awesome!!!", "title": "Desination wedding for family member-very pleased", "helpfulness": 1, "user": "pandabear9772", "date": "September 6, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 78531691}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "BOOKING TRIP:", "title": "Great calm warm beach with lots of fish and turtles", "helpfulness": 2, "user": "7980766", "date": "September 6, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 78460168}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with friends", "text": "I traveled to Riviera Maya to photographs for my cousin's wedding in Aug 2010. I arrived on a Wednesday and departed on that Sunday. I was traveling from CT to Mexico. I booked to package through Jamie Levine at Liberty Travel but decided to try to find a better deal airfare wise on my own...I found a few cheaper flights that Jamie offered me but it either required huge layovers or would get me in very late my first day or make me leave at the crack of dawn that Sunday...I decided that the flights Jamie could get me were the best for my money. I flew on US Airways and had no issues with late flights (one layover in Charlotte on the way down and Phili on the way back).", "title": "3rd time's a charm!!!", "helpfulness": 2, "user": "BeachQueen51", "date": "September 1, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 77862877}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "ARRIVAL IN MEXICO:", "title": "Great Vacation", "helpfulness": 3, "user": "nishasb", "date": "September 1, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 2.0, "rooms": 4.0, "location": 5.0}, "id": 77762090}, {"rating": 3.0, "title": "Very poooor rooms, very dirty rooms and very hard beds and pillows.", "text": "The room was the problem. The beds were like sleeping on a board. The pillows were very thin. The room was very dirty and needed maintenance and upkeep. The halls were very noisy and the accompaning room you could hear the toilletes flush and the showers run. The beach, pool and grounds were fantastic, and also the food in the buffet only was very good.", "user": "twoheartz", "date": "January 22, 2011", "id": 94084037}, {"rating": 5.0, "title": "2nd time here just as good as the first time", "text": "The Barcelo is a large resort and we picked it for that reason.. Our two young adults travelled with us and we all had a great time. We wanted to make sure ther was enough going on for the young adults. Volleyball on the beach was terrific and the beach is awesome. I was looking forward to Captain Morgans at night, but it was not open. Others said the same thing. The food was very good and there was lots to chose from. The service was excellent and the people are very friendly. We love the sea, so the resort provides never-ending seaside for swimming. The entertainment at night was not as good as previous but they try to accomodate everyone. I would recomment to travel with any tour compay except Sunquest. Thomas Cook did not accomodate a plane full of vacationeers except to give them a $15.00 airport food voucher for a 14 hour delay. (This was due to their inventory turnover apparently, nothing to do with weather or mechanical) We have travelled dozens of times and this is the first time I was disappointed. I love vacationing and I do not like to think of any negative, but this was a bit disappointing.", "user": "Mayan50", "date": "January 22, 2011", "id": 94050842}, {"rating": 5.0, "title": "Barcelo Maya Tropical - a wonderful holiday", "text": "Barcelo Maya Tropical Beach Resort", "user": "FamilyLloyd", "date": "January 15, 2011", "id": 93067701}, {"rating": 4.0, "title": "disappointing a la carte", "text": "December 17th-24th, 2010", "user": "Randingoo", "date": "January 13, 2011", "id": 92825704}, {"rating": 5.0, "title": "Second time here and LOVE this place", "text": "This was our second trip to the Barcelo: we stayed at the Colonial last year.", "user": "lilcracker", "date": "January 13, 2011", "id": 92784843}, {"rating": 4.0, "stay_parameters": "Stayed December 2010, traveled with family", "text": "Had a wonderful Christmas holiday at the Barcelo Maya Tropical. Our sons are older, 21 and 17 respectively. As far as walking to the beach- if you can't manage to walk 300 yards without complaining, you need to get in shape. Yes, you will walk throughout the resort. And that's not a bad thing. The pools and beach were wonderful- clean and well maintained. Service- not an issue. Pools side bar, not super fast, but I am willing to wait 2-3 minutes when things are busy and not flip out. Ala-carte rests were very nice-better than a Riu or an Iberostar. People very friendly.", "title": "Cruise ship on Land", "user": "Boynebound", "date": "February 15, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 96776907}, {"rating": 4.0, "stay_parameters": "Stayed February 2011, traveled with friends", "text": "things of note: when you get your ala carte tickets, proceed directly to the concierge and book your meals immediately for the week. Beach towels: first days towels are in your closet. At the end of the day, turn in your wet towel for a ticket for a new towel the next day. Repeat.", "title": "A beautiful and relaxing resort, but a few things to note...", "helpfulness": 1, "user": "lbom", "date": "February 14, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 2.0, "rooms": 3.0, "location": 4.0}, "id": 96639310}, {"rating": 5.0, "stay_parameters": "Stayed February 2011", "text": "Snorkeling: right off the beach- sea urchins, sting rays, surgeon fish, clown fish, octopus, etc. Not as bright as snorkeling off Barbados, but wonderful just the same.", "title": "Most Impressive", "helpfulness": 3, "user": "granddamme", "date": "February 13, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 96410181}, {"rating": 4.0, "stay_parameters": "Stayed January 2011, traveled with family", "text": "Trips: We rented a car on-site and went to the ruins at Tulum. Then headed to a beach club on Playa Tulum. Zamas- great location, great food, pricey. (found out that Sports Illustrated did a swimsuit photo shoot there). Also, can't say enough positive about Akumal- Lol Ha Beach Club, Lamiani Gallery, small marketplace where bartered well,", "title": "Great Family Hotel", "user": "KJ64", "date": "February 6, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 95703505}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled with friends", "text": "Turtle Bay bakery and Cafe- outstanding. And if you go during the spring and summer, head out into the bay and snorkely with sea turtles. Amazing.", "title": "Beautiful beach and grounds, good volleyball, good food", "user": "reinger", "date": "February 6, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 95693775}, {"rating": 5.0, "title": "Beautiful resort; great service; lots to do", "text": "There were two volleyball nets on the beach at about the mid-point between the pier and the Palace. Nets were put up at 10 a.m. and taken down at dusk. Another net is also set up near the pier. We played for hours each day with a changing mix of nationalities and skill levels", "user": "Docan", "date": "February 6, 2011", "id": 95681795}, {"rating": 5.0, "title": "Simply the Best in Mexico Riviera Maya", "text": "The food was good overall with the Japanese and Mexican specialty restaurants my favorites. If you couldn't find something to satisfy you at the buffets then you are being too picky. I found the skirt steaks and burgers to be especially good in the buffets.", "user": "navigatorgypsy", "date": "February 4, 2011", "id": 95488881}, {"rating": 3.0, "title": "were not negitive but here the low down", "text": "The fruit was top notch and smoothies made to order at breakfast along with mimosas for the asking.", "user": "LeahTodd", "date": "January 30, 2011", "id": 94936460}, {"rating": 4.0, "title": "Great vacation until our last day", "text": "Alcoholic drinks were good also. For those who complained that the drinks are \"watered down\" all you had to do is ask for a little extra and they would add it. At the beach restaurants you can pour your own beer or mix your own rum and coke (or what ever) along with having the staff blend something for you. It did take a while to get drinks once in a while but the bartenders and waitresses were always busy so it wasn't like they were ignoring you.", "user": "Alottavagina", "date": "January 26, 2011", "id": 94499505}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "We went to this resort for our 5 yr anniversary and loved every minute of it. Our first time to the Riveria Maya, been to Cancun twice", "title": "Beautiful Resort! Would come back in a Heart Beat!", "user": "dutchie95", "date": "March 16, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 100410830}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "Here is our review-", "title": "Third return trip - looking forward to the fourth!", "user": "MItraveler56", "date": "March 16, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 100399009}, {"rating": 3.0, "stay_parameters": "Stayed February 2011, traveled with family", "text": "FRONT DESK-very friendly and helpful but bring small bills, as they don't always have change for large bills.", "title": "For our group, some amazing hits, some really terrible misses...", "helpfulness": 1, "user": "Schternli", "date": "March 16, 2011", "detail_rating": {"service": 2.0, "cleanliness": 5.0, "value": 2.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 100377716}, {"rating": 5.0, "title": "An Excellent Adventure!!!", "text": "RESTAURANTS- make sure to book your reservations as soon as possible as if fills up quickly. We booked the first night and got into all the restaurants we wanted to. But book soon as we heard of people who waited a day or two and couldn't get in. Best reservation restaurants are ( in order of best) the Japanese, The Grill, Italian then Mexican.", "helpfulness": 3, "user": "greeneyez1", "date": "March 14, 2011", "id": 100169184}, {"rating": 5.0, "stay_parameters": "Stayed October 2010", "text": "POOLS-Pools were great, and have an amazing kids pool. Water was a bit cooler but after the hot sun, was amazing. Always lots of things to do in pool.", "title": "Best Place ever!", "user": "halldog33", "date": "March 13, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 100079080}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "I read alot of reviews on the barcelo complex and they where very helpful in making our final choice for our vacation.Let me just start by saying that your not going to please everybody no matter what you do. We booked on contiental airlines for the vaca package and had private transfers everything went smooth got to the hotel the barcelo beach but where told they where having problems with the air conditioning so they up graded us to the tropical. That was fine with us since we already spent the extra money to upgrade at the beach and going to the tropical was a bonus.We traved another family and they where of the same opinion about the resort as we where .Let me say the resort was beautiful ,clean,and the staff friendly the food was great and they had plenty of choices.Our room was ready for us when we got there and with alittle walking we found it without any help .We where on the first floor yucatan building it had all we needed stocked fridge great shower and plenty of room and just outside our sliding glass door was the very large pool area with its swim up bar by the way is where we spent alot of our time.The beach was great views where wonderful and the buffets next to the pool area had all the food you could want .They had very good shows at nite with talented peoplein them.All in all we had a great time the only minor complaint we had was the complex is so big you had to walk alot and the wait staff was alittle slow in the aircondition buffet i would go back to this resort in a heartbeat.", "title": "great time at the barcelo", "helpfulness": 2, "user": "mailman41", "date": "July 25, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 72330136}, {"rating": 4.0, "stay_parameters": "Stayed June 2010, traveled with family", "text": "Yep - we have been here four times and have stayed at each section of the resort. We brought our adult daughters this time and due to their schedules stayed in June vs September our usual travel time. As expected, there were more people at the resort at this time of year. But even with more people you could still get a lounger by the pool or on the beach and no long lines for drinks or food. You could spot the Trip Advisors with their bubba mugs for drinks!", "title": "4th time to Barcelo", "user": "JacarandaSpirit", "date": "July 25, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 72277699}, {"rating": 3.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "The ocean is always spectacular here,clean and clear, the white sand soft and bug free. We snorkled off shore and saw fish and a sting ray, but my daughter was stung by a jelly fish - havent seen those later in the year. I always enjoy the large pools and the fact that they provide allot of shade around the pools.", "title": "It was OK", "helpfulness": 2, "user": "joru22", "date": "July 23, 2010", "detail_rating": {"service": 1.0, "cleanliness": 5.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 3.0}, "id": 72020237}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "The food was just average, especially after staying at the Palace portion of the resort last year - which had a much better selection and lots more seafood. We did frequent the specialty restaurants and came away pleased with the experiences there - especially the Japanese Teppanyaki - very fun and good! Overall a nice getaway, but if we come again it will be later in the year when all the kids are back in school.", "title": "Very Nice - Everything You Could Want - Other Things To Know", "helpfulness": 11, "user": "Bearman1", "date": "July 23, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 72014526}, {"rating": 3.0, "stay_parameters": "Stayed July 2010, traveled with friends", "text": "This resort is beautiful. The size didn't really bother me as I have been to the Melia in Punta Cana which is way larger. From the reviews, I was ready to walk as we did at the Melia. Everything seemed really close and walking was not a problem.", "title": "Underwhelming", "user": "nErmAc", "date": "July 22, 2010", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 2.0, "sleep": 1.0, "rooms": 1.0, "location": 3.0}, "id": 71908391}, {"rating": 5.0, "title": "Perfect R & R", "text": "Overall, I would have to agree with every good comment about this resort and conclude that the negative experiences were just unfortunate coincidences. I'll try not to repeat what others have said, but add some of the highlights for us:", "user": "Dana", "date": "January 11, 2011", "id": 92570050}, {"rating": 4.0, "title": "Underwhelmed", "text": "Room: We stayed in the Tropical section and had two adjacent rooms on the main floor. I would say this is where you'd want to be to be central to most hotel amenities. As for the mattress, we LOVE a hard bed so it was wonderful ... the firm pillows, not so much! We did get used to them and slept very well with the screen open all night -- wonderful breeze but noisy birds in the morning!", "user": "The_Man", "date": "January 9, 2011", "id": 92298165}, {"rating": 4.0, "title": "Very nice resort", "text": "Food: Lots of choice on the buffet, many health-conscious choices and Mexican dishes. One of our favourites turned out to be the \"oatmeal milk\" in the morning, which is a milky porridge cooked with cinnamon, cloves and other spices :) We ate at the Mexican and Italian a la cartes and they were very good, but for truly fine dining I would think the Palace restaurants would be the best choices.", "user": "bradscanlon", "date": "January 7, 2011", "id": 92114438}, {"rating": 2.0, "title": "Nightmare vaca", "text": "Pool / beach: best volleyball is in front of the Tropical -- there are 2 courts. Yes, the pools are unheated but if you're swimming you quickly get accustomed to the temperature. In this section there is also a lap pool, which was well used in the early morning. Our holiday was over what had to be one of the busiest times for the hotel yet it never seemed crowded on the beach or at the pools. You could even find spots in the later morning (9 - 10 am) if you hadn't staked out your beach chairs earlier. A slight criticism I would have would be that there are no palapas on the beach only palm trees, and while there are lots of them and they make for a lovely, natural look, you don't get the kind of shade you would with a palapa, and you don't get the little ledge to store your stuff off the sand (there are no tables).", "user": "Annie711", "date": "January 7, 2011", "id": 92106566}, {"rating": 5.0, "title": "Great", "text": "Entertainment: We didn't take in the shows except for New Year's Eve. They generally start at 9:30 and go for about an hour +. For New Year's we found the band wonderful but the dancing a bit dated and hokey. We have stayed at the Gran Bahia Principe over New Year's and there they had more of a party, whereas this was quite a long show. Dress for New Year's Eve was everything from gowns to jeans/shorts/capris.", "user": "mlprice", "date": "January 6, 2011", "id": 91990247}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "My husband and I had been to Barcelo Colonial last year and loved it so much we decided to return with our grown children and a few other friends and relatives to a week of relaxation and to informally renew our wedding vows (30 years.) We were 15 in all. Because we were a large group, they upgraded us from Caribe to Tropical and we had beautiful rooms. A/C was great and we had an oceanview with champagne and fruit. The other 5 rooms were comfortable and well kept. Any problems were resolved with the staff. The staff was very helpful, especially guest relations. Food was great. There was enough variety to find lots to eat and change each day. A few had an upset stomach but immodium had them back to normal in half a day. There were plenty of activities on the grounds and we had freedom to meet at the pool or beach as well as to spread out to exercise, play chess or tennis or swim, snorkel or whatever! There were 2 days when the undercurrent was a little strong, so water equipment or the beach was too strong for younger ones. But the pool was fine. We rented a van to go to the hotel and to Chichan Itza and had an enjoyable trip there and back. It rained when we arrived for 15 minutes, but it actually cooled the weather so we could explore in nice weather until 4:30. We also went to Cozumel for my niece's wedding and had a nice ferry ride both ways. Missed the 7 pm return, so had to wait until 9 pm, but we had a great time. We also paid day passes so my niece and her family could visit our resort on Friday and the staff was great in setting it up. We went to eat at the Mare Nostrum restaurant for lobster and enjoyed the meal. The shows were pretty good, especially the Michael Jackson review. Sit near the front if smoke bothers you! The priest was out of the area for a meeting, so we were unable to have a mass to celebrate our vows, but the family prepared a nice little celebration and the hotel was great at putting on the lights and fountains for our little ceremony Saturday night! We also went golfing and the mosquitoes come out in full force, but it was a fun activity for all age groups like ours. The hotel arranged a van for our trip to the airport, and we were very pleased with the friendliness and assistance in all areas - room, dining room, guest relations, lobby... Will we return? I hope they'll be ready because our kids are already getting friends who want to come along, and my niece's family want to join us on our next trip! Thanks, Barcelo Tropical!", "title": "Look for the specials and book in advance for a greaqt price and vacation!", "helpfulness": 1, "user": "abuelaj", "date": "August 31, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 77750863}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "Pedro + Joan Martinez", "title": "Wedding was perfect!", "helpfulness": 1, "user": "Orange26", "date": "August 23, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 3.0}, "id": 76503103}, {"rating": 3.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "I stayed at the Barcelo Maya Tropical. The resort is absolutely gorgeous and HUGE! We had a group of 35 people stay with us including 5 kids.", "title": "Go once there - yes, again - no", "user": "zabaCanada", "date": "August 19, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 4.0}, "id": 75944706}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "The wedding day went off without a hitch. It appears they have their wedding packages SOO AUTOMATED that you don't have to worry about anything. I paid 15 per person to get married at the Gazebo at the Barcelo Palace located about 5 minutes away and it was worth every penny. They have a professional photographer at the Barcelo Palace- KODAK (gift shops) and she did a great job. The price was about 1100 USD. I paid an extra 400USD for the Mariachi's for 45 minutes to come to the reception and all my guess enjoyed it. The chairs placed at the gazebo had white linen and blue bows just like I requested. The SPA was absolutely OVER THE TOP. The couple message that came with the package was wonderful. The manicure and pedicure was perfect and they did a great job on my hair and makeup. I got fake eyelashes and they look soo good in the pictures. I purchased them my self in Canada. Our ceremony was very personalized. I brought my owns poems and prayers and wrote down the sequence of the ceremony. The minister did a great job making it flow. They have a wedding planner Victoria and she does a great job and works very hard 9am-10pm! The violinist was playing as people were sitting and as the bridal party walked down the Isle. the played a different song for me when I walked down the Isle. They also play another song once the ceremony ends. Right after the ceremony they had champagne ready for toasting and the microphone ready for someone to congratulate the couple on the marriage. I was sweating in my beautiful gown but I didn't care I love my wedding dress. I had originally wanted to reception to be on the beach but it looked like it was going to rain so I switched it indoor to the Snack Bar -Palmeras. they cleared all the tables and placed 5 tables with the white table cloth and blue bows. The centre pieces they provide are made out of fruit. They make very interesting fruit designs. The meal served was incredible. I got scallops for appetizer and it came in a coconut! It was a beautiful and interesting presentation. After that was the Surf and Turf (steak and lobster tail) amazing plating and delicious! The desert was not what I ordered (Taramisu), but it was chocolate and everyone loved it! The cake had the same real flowers that my bridal bouquet had and was delicious. The first dance was perfect as the mariachi's played us a slow song. Carlos the reception organizer got the bottle of tequila out and started the dance party!. It was an open bar and they were making us so many different flavored shots! It was great! The reception was from 6:30-9:30AM. After that I called it a night but everyone else continued that party a Jaguars' the night club in the resort. Apparently, everyone had a great night! My bridesmaids had parasols and they looked so great in the photos. After having my reception indoors I realized it was actually BETTER than having it outdoors. The weather is soo unpredictable and if you have it outdoors and it starts to rain you will have to pay DOUBLE to get it set in doors or just come to terms and have no dinner reception. They will not reimburse you. Also, at night there are mosquito right by the beach and you will be eaten alive and one more thing, how can you really dance on the beach! I didn't realize it is hard to dance on the beach until I took wedding photos on the beach. I saw beach ceremony wedding on the beach and they don't look as nice as the comfortable and private gazebo. Everyone on the beach watches your ceremony and takes photos and listens in. Hence, I would choose the Gazebo any day. Also, the train picked all our guess up at the front lobby and shuttled them to the Gazebo at the palace. I waiting in my room for Victoria the wedding planner to pick me and my bridesmaids up in a cute golf cart and drove us to the palace too meet up with price charming. The ceremony was also set up with the microphone as was the reception. You can bring your own CD, Ipod or laptop and play your own music.", "title": "Family Vacation", "helpfulness": 1, "user": "ajps1020", "date": "August 18, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 75834876}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "Overall, if I had to do it again the Barcelo is the place to get married! They know what they are doing!", "title": "Great vacation to Barcelo...again!", "helpfulness": 2, "user": "Masaville", "date": "August 16, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 75456684}, {"rating": 3.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "My wife and I just got home from 7 nights at the Barcelo Maya Tropical, south of Playa del Carmen (Feb 25th - Mar 4th 2011). The first thing that we noticed, upon arrival, is that the grounds at this resort are absolutely beautiful. Incredibly well kept, very clean, and just plain awesome. We continued to be impressed with the grounds, for our whole stay. Also...most of the staff were extremely friendly. When we first went down to the beach, we were a little disappointed, at the rocks, and such. You had to be a bit careful, wading into the water, so that you didn't step on a sharp rock, and hurt your feet. The sand was nice, but not as fine/soft, as some places. But those complaints quickly disappeared, when we went snorkeling for the first time, from shore. Those rocks that we didn't like, mean corals, and fish. Tons of fish. In our 7 days, we saw all of the following, withing a couple hundred yards of shore...angle fish, butterfly fish, puffers, powder blue tangs, blue tangs, blennies, gobies, a lion fish, stingrays, a manta ray, sea turtles, sea urchins, and literally hundreds of other fish species, that I couldn't name, not to mention corals. It was incredible. We actually paid for a snorkeling \"adventure\", but we saw more, right in front of our own resort.", "title": "Beautiful grounds, friendly staff. Mediocre food, and rooms.", "user": "ddodge68", "date": "March 5, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 2.0, "rooms": 2.0, "location": 5.0}, "id": 99000204}, {"rating": 4.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "Now for the down side. As many have said, the food was mediocre at best. We tried several of the buffets, \"snack bars\", as well as the ala cartes, and with the exception of the Japanese steakhouse, none of them impressed us much at all. Although there was lots of variety, on the buffets, I struggled finding things that I really liked (and I don't typically think that I'm a very picky eater). As for the rooms, they were ok. Not as nice, in my opinion, as an average Holiday Inn. Room service was slow, but complete, and friendly. Usually didn't get to our room until around 3PM or so (I assume that they had to clean all of the rooms of the departing guests first). This was not a big deal to us, since we spent little time in the room. As for the bars....as many have said...bring your own cups, as the ones that they use are very small. We did find a couple of really great bartenders, but there was a HUGE range. Just because you like a certain drink from one bar, don't assume that it will be good from all of them. And unfortunately most of the bartenders were just slow. Manuel and Antonio (both newly moved to the theater bar) were incredible bartenders. Great character, quick with a drink, extremely friendly, and they made the best drinks of any of the bartenders, that we found.", "title": "Sad to leave the Tropical Maya", "helpfulness": 2, "user": "ClaudiaMN", "date": "March 3, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 98778114}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "All in all, we had a fantastic vacation, and are definitely planning on going back to this area. We will do a little more searching, for a resort that has better food, and nicer rooms, but if we don't find anything that we think will be better, we will definitely go back to the Barcelo Tropical.", "title": "Pictures dont do justice for this place! WOW!", "user": "Lou M", "date": "February 21, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 2.0}, "id": 97513186}, {"rating": 3.0, "stay_parameters": "Stayed February 2011, traveled with friends", "text": "Hola!", "title": "Beautiful Resort - Extras Lacking", "user": "opiel", "date": "February 20, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 4.0}, "id": 97353652}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "My husband & I along with another couple from Minnesota vacationed at the Tropical for one week. 1st time to the Riviera Maya, for our 9th annual winter vacation. We booked with Delta Vacations and we didn't know if we were going to stay at the Tropical or Colonial until we arrived. I couldn't tell you how long it took to get there from the airport because the very nice people we shared the ride with also wanted to stop for cervesas and we had fun chatting with them...who were we to argue?", "title": "Great resort - everything you could ask for and more!", "user": "ollie47", "date": "February 17, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 97018293}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "We were booked at the Tropical the sister resort to the Colonial and planned our trip through Delta Vacations who offers Exclusive All Inclusive which turned out to be alacart dining every night during the stay. The food was very good, the beach gorgeous, snorkling right on property was excellent. Two downsides - pool bar service was slow and evening entertainment prior to the show was virtually non-existent. There was a piano bar, but they played at 7:00 p.m. for a half hour and then again at 11:00 p.m. We always missed it. We have been to Iberostar Lindo, Bahia Principe and this and we had a very enjoyable time. You won't go wrong at the Barcelo Colonial/Tropical.", "title": "Barcelo Colonia Tropical - Top Notch", "user": "extrasec", "date": "August 15, 2010", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 75334822}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "The Barcelo Tropical Beach resort was amazing. The best for me was the service we received by the staff. Truly take lot's of dollar bills to tip them, a couple of bucks at buffet, sit-down dinners, bar, etc., they staff will really appreciate it.", "title": "Paradise", "helpfulness": 1, "user": "txgirlinco", "date": "August 4, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 73809677}, {"rating": 1.0, "stay_parameters": "Stayed June 2010, traveled with family", "text": "The resort is also super cleaning, someone is always cleaning. The beds are a bit hard but you will be tired from too much sun/pool/beach to care.", "title": "Disappointed with a capital D", "helpfulness": 1, "user": "poofam", "date": "August 3, 2010", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 1.0}, "id": 73585970}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "The variety shows are pretty cheesy but fun to watch, same with the Jaguar's (the on-site disco).", "title": "Fantasic Vacation at the Tropical", "helpfulness": 10, "user": "beachdreaminCalgary", "date": "July 29, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 72890840}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "We had the best time!", "title": "Perfect place for families with young children", "helpfulness": 4, "user": "vacashun4me", "date": "July 26, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 72338871}], "location": {"country": "Mexico", "region": "Yucatan Peninsula"}, "stars": 3.5, "variance": {"poor": 86, "average": 160, "very good": 474, "terrible": 48, "excellent": 708}, "aka": "Barcelo Maya Tropical Hotel", "slim_ranking": 0.4, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 3.5, "rooms": 4.0, "location": 4.5}}