{"user_rating": 4.0, "review_count": 1076, "name": "Barcelo Grand Faro Los Cabos", "reviews": [{"rating": 4.0, "title": "Second Time Around and still the Best!", "text": "My husband and I stayed at the Hola Grand Faro from March 27th to April 4th, 2011. This is our second time staying at the Hola and we can't wait to go back next year already.", "user": "TheresaWinnipeg", "date": "April 6, 2011", "id": 103065663}, {"rating": 5.0, "title": "Amazing! Would go back In a heart beat!", "text": "What can I say ..... from the minute we got there we were greeted with a big smile from Viridiana at the front desk whom we met last year as the Hostess of the Las Olas. She is an amazing person. We were upgraded to Beachfront and what a wonderful view of \"our back yard\".", "user": "Ckbargen", "date": "April 2, 2011", "id": 102586763}, {"rating": 3.0, "title": "A few Issues", "text": "A BIG THANK YOU to the general manager Mr. Suarez who sent us a beautiful arrangement of \"goodies\" .", "user": "reddeerrandy", "date": "March 31, 2011", "id": 102257915}, {"rating": 5.0, "title": "Very relaxing and enjoyable stay", "text": "There is nothing that I can say negative about this All Inclusive Resort. From the Housekeepers to the Waiters they are ALL wonderful. hard working people who always have a smile on their face and always willing to please.", "user": "ChitownSunseeker", "date": "March 29, 2011", "id": 102040324}, {"rating": 5.0, "title": "Certainly was GRAND", "text": "We have only been back home for a few days and we already miss it ..... we will be returning to \"Our Casa\" and looking forward to spending another relaxing week at the Hola.", "user": "expatsincanada", "date": "March 28, 2011", "id": 101921111}, {"rating": 4.0, "title": "Great value, great service.", "text": "Not like your typical all inclusive resort - many food choices, quality, impeccable service. Staff were amazing. Always friendly and helpful. Beautiful grounds and views of the ocean and beach from the rooms.", "user": "SL81_11", "date": "March 25, 2011", "id": 101531434}, {"rating": 4.0, "title": "Lovely stay, great location", "text": "This was my first experience at an all-inclusive, and I was quite impressed. The hotel was clean, and the staff were friendly and professional. The breakfast buffet was located on a terrace overlooking the ocean, where we could see humpback whales playing offshore. We also enjoyed the a la carte restaurants, but would definitely recommend trying some of the restaurants in San Jose del Cabo, as the town centre is only a 20 minute walk from the hotel (or a 50 peso taxi ride). Also, March 19 is the day of the patron saint of San Jose del Cabo and there was a week of festivities in the town, including street vendors, a midway, live music, and fireworks.", "user": "MsRipley", "date": "March 24, 2011", "id": 101327973}, {"rating": 3.0, "title": "Beware of the up-grade scam", "text": "As other reviewers have noted, this is not a party resort, which was a plus for us traveling as we were during spring break. The hotel has a number of activities throughout the week, including a Mexican fiesta evening and a beach fire, as well as live music several evenings a week.", "user": "GandRhighriver", "date": "March 22, 2011", "id": 101133983}, {"rating": 4.0, "title": "Beautiful, relaxing, trouble free vacation", "text": "Some things to note- there is no free wifi available, but you can walk 10 minutes to the Starbucks, buy a drink there and get your internet fix. Alternatively, you can pay the hotel and use one of the computers they have set up off the lobby. Also, after you check out on your last day, you can book a hospitality room to use to change and shower before you catch your plane if you're leaving later in the day.", "user": "jmkim", "date": "March 20, 2011", "id": 100898650}, {"rating": 5.0, "title": "Perfect Resort for Resting, Relaxing, & Recreation", "text": "My wife and I just returned from 1 week at the Hola Grand Faro and enjoyed the stay thoroughly, the staff, food, and rooms met our expectations with no real disapointments that you would expect from a Mexico all incusive stay. However be aware that the hotel or the tour providers are misrepresenting the rooms and the amenities they come with. We booked a room that was advertised as a \"full bath\" apon arrivel we were informed a \"full bath\" is shower only, this a non starter as my wife only bathes. They offered a up grade to a suite at a cost of 50.00 a night which we reluctanlly accepted. The problem we faced with our reservation seemed to be occuring to a number of other travlers as we found out while speeking to other people during our stay. We had contacted Westjet on two occasions and inquiered if the full bath meant a bath tub and we were insured that there was a tub. The people we spoke to at the hotel said only the suites have a tub and it was not their fault for the error the tour provider was at fault so the up grade cost was out of our pocket. Based on our conversations with other travlers who were misled by the advertising of the rooms all were from western Canada and used West jet Holidays, Trasat Holidays and Air Canada holidays. The holiday and stay at the resort was great but do your homework and be sure you are getting what you have paid for. G andR High River AB.", "user": "MinnesotaJoElle", "date": "March 20, 2011", "id": 100872160}, {"rating": 3.0, "title": "Grand Baja resort and spa", "text": "Grand Baja Resort and Spa", "helpfulness": 2, "user": "JTPalmiero", "date": "July 10, 2007", "id": 8092447}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled with family", "text": "Beautiful rooms, and pool. Beach is not swimmable. So-- you have to go to another beach for swimming. Also, don't try to cash american express travelers checks-- unless your signature is always perfectly the same. I had trouble with mine and I was staying there. Laundry room is a joke-- one machine working and 10$ US. to wash and dry and the laundry room is like a sauna and they don't sell laundry detergent. The resort was basically empty end of June and early July. Only 1 of 3 restaurants were open. Brunch is about 20$ dinner about $20-30. They try to get you to sign up for time share tour. We have learned our lesson not to waste our time. You need to pay for daily maid service which is a good idea since there is no dishwasher. One good thing is that the Grand Baja is very close to the Mega for shopping. We bought all our water and breakfast foods and snacks there. It is close to the airport and town of San Jose. you can take a 5 pesos bus or 5$ US taxi into town. It only takes about 5-10 minutes into town. It is charming with a 16th century church, town square many old buildings with courtyards that house shops and restaurants. Our favorite-- Tropicana-- old traditional, with live entertainment. I would not recommend Local Eight-- pricey, small menu and so so atmosphere. We also had a great meal at Habaneros. It has a huge menu and it was very good and great service with great prices. I only saw outdoor seating, though. From our hotel You can walk up the beach to the San Jose Estuary. There are birds nesting there-- not too exciting the day we went.", "title": "Had a great time", "helpfulness": 5, "user": "glopari", "date": "July 10, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 8088163, "likes": {"liked": "— Staff/ service, cleanliness, good food", "disliked": "— bathroom"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled with friends", "text": "We took a 50 pesos bus ride into Cabo to the Paraiso Shopping Mall and marina. At the marina we rented jetskis. We ate at La", "title": "Great Hotel and Value!", "helpfulness": 1, "user": "beach112", "date": "July 9, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 8084245, "likes": {"liked": "— The Beach and Pools", "disliked": "— The Beds"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "Casa-- a little walk from the mall but very good-It was recommended to us by the jet ski people.", "title": "Crowne Plaza San Jose Del Cabo Outstanding Vacation ", "helpfulness": 8, "user": "scaredsammie", "date": "July 7, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 8074060, "likes": {"liked": "— Quiet it was so quiet and peaceful and clean and comfortable food was outstanding", "disliked": "— Everything shuts down at 11 (entertainment wise) no more drinking or any music?"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "Watch out as you arrive in San Jose at the airport, after you have your luggage and are ready to exit the airport, you will be directed to desks that seem like they are there to help you with transfers when all they do is take up your time and try to set you up with a time share tour. Just have your transportation booked and know who or what to look for and ignore everyone else. We learned our lesson.", "title": "Beautiful place, great staff, food okay", "helpfulness": 3, "user": "Ocngodess99", "date": "July 2, 2007", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 3.0}, "id": 8042500, "likes": {"liked": "— Pool and view", "disliked": "— food"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "Originally booked our vacation at different resort and became concerned after reading negative reviews on this site. Switched reservation to the Crown Plaza and it was well worth it, we loved every minute! Every single staff member we had the pleasure of dealing with was courteous, helpful, and friendly. Every buffet and meal provided lots of options and was delicious. Our room, the pools, and the grounds were comfortable, clean, and well maintained. There were no stalking time share sales people, no bugs, no excess of kids. There were plenty of chairs by the pool, seats in the restaurants, and a variety of evening entertainment. Watching the sun set from the Sky Bar met every expectation. Cabo San Jose was authentic with plenty of unique shops at reasonable prices, Cabo San Lucas we found to be more commercial and expensive. Don't miss this resort, you'll never want to leave... we didn't!", "title": "The Crown Plaza treats you like Royalty", "user": "dmhhj", "date": "June 28, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8023373, "likes": {"liked": "— Everything", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "We just got back from a 4 night stay at the Crowne Plaza Los Cabos (6/9-6/13) and really hated to leave. The hotel was so well kept and clean, we were amazed.", "title": "Well Kept Secret", "helpfulness": 7, "user": "Crazynoodle", "date": "June 17, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7868259}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "We have stayed at quite a few all-inclusives but this was above all the rest. We have put this on our return list and hope to do that very soon.", "title": "Great All-Inclusive Option", "helpfulness": 3, "user": "Terri S", "date": "May 13, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7594757, "likes": {"liked": "— Spacious accommodations", "disliked": "— Dress code at the restaurants - who needs pants in 80 degree weather?"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "Everyone was very helpful. Rather than pay for a taxi to go down to Cabo San Lucas, it was suggested that we take the city bus ($2.50 ea. US rather than $35-40 US for a taxi). While it took a little longer, it was a great way to see the sights and meet the locals.", "title": "Total Wow!", "helpfulness": 2, "user": "diannerod", "date": "May 10, 2007", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7584344, "likes": {"liked": "— Location"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007", "text": "It was very safe here. We walked to the local Mega (Target supermarket) to get some sodas and snacks. We went in the evening and walked back after dark.", "title": "Wonderful Vacation", "helpfulness": 12, "user": "Marlin1978", "date": "May 9, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7573051, "likes": {"liked": "— Cleanliness and Service", "disliked": "— Pool music starts too early"}}, {"rating": 5.0, "title": "Beautiful resort, great staff, great service, they treated us like gold.", "text": "Myself and my spouse travelled Feb. 21-28 2011. The weather was great the whole time but it started getting cold around 4:30pm The nights were cool and an extra blanket was needed in the room. Bring a sweater or light coat for wondering about at night. The staff were all very helpful, friendly, and the service for everything was great. Violetta thank you for all the emails and info I requested before we flew out. Hugo you were one of our main waiters and your service was impeccable. Thank you. Our tour guide, sorry I can't remember your name. You were on the bus with us on the way to the hotel and going back to the hotel. You also were presenting the meeting the day after we arrived. You were also great. Lucas the activity coordinator you were the best. You work far to hard and way to many hours. You were always around organizing everything, always there when someone needed you. And you fit me in last for Kareokee. When we went the hotel was only about 40% full. We requested a room on the 5th floor as this is the top floor and you have nobody above you. We also upgraded to a deluxe ocean view. If you want to be directly facing the beach you need to request a beachfront rooms. All the floors are tile. Monday night is musical trivia, Tuesday night is all inclusive in the sky bar from 9-11pm. Any other time you have to pay. Wed. nights was kareokee. Thursday night was live dancers. Friday was live music, saturday night was casino night and bingo night and Sunday was a bonfire on the beach with live music. This was by far the best. Guitars, bass drums and more. There are 5 pools at this resort. The swim up bar is not heated and barely any one uses it. Also the adult only pool is not heated. The main pool with the volleyball nets is big and warm and the infinity pool is warm and right on the ocean. The food was great. The home made omelettes in the morning and the fresh fruit and salad variety was to die for. There are two Al A carte restaraunts. We only went to the Mexican one. Las Jicamas. You have to make reservations for these. The mexican restaraunt was quiet and the service was slow. The portions were also very small so order lots of appetizers. It took an hour after our appetizers to get our dinner and it was also small.. Drinks flow freely at this resort. Drinks start at 11 am and end at 11 pm sharp. Unless you go up to the sky bar and pay. Everyone agrees that the drinks are watered down. But they will make you anything. The popular drink everyone was drinking was called a dirty monkey. The service was always great and the staff were all very professional.. After 11pm when the bar shuts down you have the option of ordering room service until 1 am and it is free. We tipped them I think 2 or 3 us dollars or 20 or 30 pesos. When we ordered drinks we gave the waitress 20 pesos or 2 bucks us 2 or 3 times per day. The maids we left them a dollor or two per day. They all work very hard and on average they only make 5 to 7 dollars a day. The grounds were also impeccable. And the men were out there every day clipping and maintaining them. I believe most of the rooms only have showers and their is an electronic safe in the room and a mini fridge stocked with water, pop, juice, etc. The bell boy did come to our room once and knocked on the door asking if we needed anything and he gave us 4 cervaca's for 2 bucks us. They also have a kids area and free babysitting or they will come to your room and babysit. We didn't have our kids with us but others say it was great and they left a tip.", "user": "MadisonJessie", "date": "March 19, 2011", "id": 100774479}, {"rating": 5.0, "title": "One of our best vacations ever", "text": "The Mega Mart is a quick 10 min. walk. It's like a Walmart. But beward of the timeshare people. They where Mega Store shirts and ask you if they can help you with finding anything and then they start hitting you up on coming to see there properties offering you 200 bucks a couple and a deal on an excursion. We booked all of our excursions through the hotel. The prices were reasonable. They had a deal by three excursions and get one or two free. But they had to be the ones with an asterik by them. We didn't take advantage of this deal. Our funnest adventure by far and I highly recommend this is the Cabo Adventure tour, ziptrecking, rock climbing, rappelling, crazy bridge, crazy ladder. From the time we left to the time we got back we were gone for 5 hours..This is done in the mountains and over water. So if you want a rush try it.They take pictures of you and then try and sell them to you and they are a rip off. They wanted $120 us for about 15 pictures on a disc for the two of us. And they give you crap if they catch you pulling out your camera. My husband always went first and then snuck pictures and video of me when the guides were all on the other side. We also went ATV ing in the dessert. It was very dusty but they provide you with goggles, a helmut, and a bandana.This was fun. They took us into this old village where only about 200 people live. They took us down to this catholic rock and into the church. We rode along side the baha raceway. And afterwards they gave us all a meal and some coke. This tour was fun and we were gone for about 4 hours from the time we left. Both of these tours are in Cabo. We also took a tour through Rancho tours to Cabo and went on the glass bottom boat. We got to see lover's beach, divorce beach, and now I know why they call it that and people have died there. The current is incredible. They dropped us off at pelican beach where we had lunch walked around, and tried to snorkel. Apparently the snorkelling was incredible and you could touch the fish and the water was clear but it was a windy day and the water was to cold for me to go past my waist. We took the boat back early so we could wonder around cabo and do some shopping. The time share people are everywhere as are the vendors and watch out for the drug dealers, we must of got asked in about an hours time 25 times if we wanted to buy drugs and any kind of drugs and there were police everywhere. So beware. This tour was also great but everything is kind of expensive but cabo is beautiful. We brought our own snorkelling equipment so you have the option of taking the local bus into cabo for about 2 bucks us and paying 10 bucks to go out on the boat and get dropped off. Bring your own beverages for the beach in Cabo as the vendors charge 6 bucks us for beer.", "user": "Rhonda035", "date": "March 12, 2011", "id": 99899560}, {"rating": 5.0, "title": "Fantastic stay!", "text": "We did not go into San Jose. It is a 30 minute walk. If you take a cab into Cabo it is 300 pesos or 30 bucks if you pay in us dollars it works out to 36 bucks. All in all we had a great time. We saw whales jumping every day from our hotel patio and they have a bell down below that you ring when you spot a whale jumping. Apparently the whale watching tours were amazing but we did not do that.. They rate this hotel a 4 star but we give it a 4 1/2 or 5. Really we had no complaints. And we will be going back again next year around the same time. So thankyou to everyone at the hola grand faro for making our stay a memorable one. I would also like to say their were lots of guests from bc and close to home (Vancouver) so we made lots of fun. Will be adding some pictures shortly.", "user": "avijax", "date": "March 11, 2011", "id": 99797965}, {"rating": 5.0, "title": "Awesome time", "text": "Lori and Donato Surrey BC", "user": "DL39", "date": "March 10, 2011", "id": 99706019}, {"rating": 4.0, "title": "Great Value + Beautiful Beach = Overall Awesome Vacation", "text": "This was one of our best vacations ever. Everything about the resort and the hotel was first class. The service was impecable. The staff was fabulous. The view magnificient. My husband and I travel a great deal and would highly recommend this resort to anyone looking for a peaceful holiday where your every need was meet. I am a celiac and am always concerned about what I can eat. If I was unable to eat something from the menu or the buffet, the staff was more than happy to make me a fabulous meal at any of restaurants including the pool snack bar. I was not ill at any time. As we contacted the resort before we travelled the food staff was acquainted with my issues. Upon arrival I was provided with a paper advising what issues I had. After two days the paper wasn't needed any longer. My health concerns were never an issue. As we wanted a quiet this location was perfect. Mind you Cabo is only a bus ride away and walking into San Jose del Cabo was not far. Anyone looking for a relaxing, pampered place would not go wrong picking this resort. I would highly recommend the spa as well. We will be returning for sure and I cannot remember a place that I actually wanted to return to in recent memory. Thank you to everyone for making this the best holiday.", "user": "Carrie R", "date": "March 6, 2011", "id": 99156222}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "We had a great time at the Crowne Plaza, and were very pleased with the room. We spent a little extra on an ocean-view room, and it was exactly what we expected. The staff members at the hotel are primarily young people, all of whom were very pleasant, and most were quite fluent in English.", "title": "A Great Anniversary Trip", "helpfulness": 6, "user": "joeb1249", "date": "September 7, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 8672509, "likes": {"liked": "— The staff at the Crowne Plaza was quite pleasant and very helpful.", "disliked": "— Buffet food was just average."}}, {"rating": 3.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "The buffet meals were about average for an all-inclusive, but we were able to make reservations at the Italian and Mexican restaurants at the hotel. The restaurant food was good, but be aware that reservations are required, and that the dress code precludes any beach wear.", "title": "Good but...", "helpfulness": 2, "user": "FD86", "date": "September 3, 2007", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 1.0, "rooms": 3.0}, "id": 8611940, "likes": {"liked": "— It was free for us!", "disliked": "— Location"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "Since we were there during an off-season period, the pools and beaches weren't crowded at all, and the pool side service was very good. Although the surf was rough, we were able to splash around and ride the waves at least two of the four days we were there. The water seemed clean and the beach was well maintained.", "title": "Nice relaxing vacation", "helpfulness": 1, "user": "nonameTexas", "date": "September 2, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 8609104, "likes": {"liked": "— Good value"}}, {"rating": 3.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "We took a taxi into the little town of San Jose del Cabo and paid a taxi fare of only $5 each way. There's not much to see, but it provided a short diversion from the hotel. We really enjoyed the peaceful atmosphere of the San Jose area, and had no desire to make the expensive trek to Cabo San Lucas.", "title": "It was just OK", "user": "shweets", "date": "August 25, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 2.0, "location": 1.0, "rooms": 2.0}, "id": 8500252, "likes": {"liked": "— room at the pools", "disliked": "— no nightlife"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2007, traveled with friends", "text": "I would offer some advice on navigating the airport after arrival. The authorized taxi and shuttle counters are all the way at the back of the arrival area, closest to the exit. To get there, you have to run the gauntlet of people offering incentives to attend their timeshare presentations. While most were very courteous, it might be best to keep moving toward the door, with your eyes open for the transportation counter. We were offered a taxi to our hotel for $50 or a shuttle van for $11 per person ($22 for both of us). On the way back, we paid only $20 for a taxi from the Crowne Plaza to the airport.", "title": "Great time... Ricardo is the best!", "helpfulness": 4, "user": "kmmBoston", "date": "August 15, 2007", "detail_rating": {"front_desk": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 2.0}, "id": 8428396, "likes": {"liked": "— The staff", "disliked": "— The location"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2007, traveled with friends", "text": "First off I would like everyone to know that this was a spring break trip with 5 of my close girl friends. We booked the trip through a travel agent who I'm not sure if he knew exactly what was going on. Luckily for all of us it ended up being a great trip!", "title": "2nd time to Cabo... RICARDO IS THE BEST!", "helpfulness": 1, "user": "kmmBoston", "date": "August 15, 2007", "detail_rating": {"front_desk": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "rooms": 5.0, "location": 3.0}, "id": 8427090, "likes": {"liked": "— The staff", "disliked": "— Location"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "We arrived to the hotel via shuttle transportation that we booked ahead of time. The transportation was prompt which was very nice. The ride to the hotel is really interesting. It is all desert and a few hotels spaced out here and there. At first you want to say to yourself, \"what did i get myself into.\" Once we entered the hotel we saw the beautiful lobby which had a huge window at the far end where you could see the pool and the ocean. It was a beautiful site.", "title": "Good for families with kids", "helpfulness": 2, "user": "giovanp", "date": "August 11, 2007", "detail_rating": {"front_desk": 2.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 3.0}, "id": 8392775, "likes": {"liked": "— Kid friendly atmosphere", "disliked": "— Missleading pricing strategies"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled with friends", "text": "We had booked 2 rooms for our trip and one of our room was not ready upon arrival (of course it was the one that i was staying in)and the staff ensured us that our bags would be safe with them, however we brought them up to our friends room which was ready and changed into our swim suit to head right down to the pool. When you arrive you are given your all inclusive bracelet. Don't lose this!!!! If you do it is about 100 dollar fee which they don't tell you. I had to ask.", "title": "Sooners had a great time in Los Cabos/Cabo San Lucas", "helpfulness": 1, "user": "DutchOK", "date": "August 5, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 4.0}, "id": 8356473, "likes": {"liked": "— Clean, not crowded, good food and service", "disliked": "— no entertainment"}}, {"rating": 2.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "The first thing we did was order a drink! The drinks weren't very strong but if you ask they will make them stronger. The food was just ok but we did not expect anything amazing considering it was all inclusive. We made sure to get to breakfast every morning beacuse it was our favorite meal. The omlet station was our favorite. Breakfast is only until 11. For those of you who plan on partying the night before, make sure you make it to breakfast. It is worth it and also, who wants to sleep in on vacation?", "title": "not sure what the hype is.Do not stay here.", "helpfulness": 8, "user": "Venturagal", "date": "July 29, 2007", "detail_rating": {"front_desk": 3.0, "business": 5.0, "service": 3.0, "cleanliness": 3.0, "value": 2.0, "location": 4.0, "rooms": 1.0}, "id": 8254734, "likes": {"liked": "— pool", "disliked": "— food and rooms"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "The staff is unbelievable. Our favorite was Ricardo. We actually became pretty good friends with him. I have never met anyone who is so happy all the time. I have to say that about all the staff. They really are there to make you happy.", "title": "Had a good time", "helpfulness": 1, "user": "b3b3cuti3", "date": "July 19, 2007", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 5.0, "cleanliness": 4.0, "value": 3.0, "location": 3.0, "rooms": 3.0}, "id": 8192891, "likes": {"liked": "— near the beach", "disliked": "— such a quite locaiton"}}, {"rating": 5.0, "title": "All-Time Favorite Mexican Vacation Destination!", "text": "We typically travel to Mexico every year, but this was our first trip to Cabo San Lucas. We spent 10 amazing days at the Hola Grand Faro from March 25-April 3rd and have already decided that we will definitely be returning. Every aspect of our trip was perfect from beginning to end and I will use my review to provide you with specific details that I hope you find helpful in making your decision to not only choose this destination, but the resort as well. If I happen to miss anything, please feel free to email me & I will respond with an answer.", "user": "Lia S", "date": "April 12, 2011", "id": 103823693}, {"rating": 5.0, "title": "Worth Coming Back For...", "text": "The Cabo airport is small & easy to get through once you arrive. If you haven't arranged for transportation, simply walk outside and look for a man who can arrange for a shuttle van or private taxi. We paid $11/US pp for a shuttle vs. $55/US for a private taxi. The Hola Grand Faro resort is about 20 minutes from the airport in San Jose del Cabo", "user": "RW19", "date": "April 12, 2011", "id": 103792693}, {"rating": 4.0, "title": "Wonderful time at the Hola!", "text": "and approximately 25 minutes outside of Cabo San Lucas. After being dropped off, check-in was quick and easy and the front desk staff was courteous & efficient.", "user": "dscoochie", "date": "April 12, 2011", "id": 103789108}, {"rating": 5.0, "title": "Hola was better than expected!", "text": "We stayed in room #2214 which overlooked the pool & had a partial oceanview. Since it was on the 2nd floor, we always had to make sure the drapes were closed but aside from that, the room was comfortable and had a balcony with 2 chairs & a table. The bathroom was spacious and the shower had excellent water pressure & hot water at all times of the day/night. We weren't real crazy about the beds as they were small & uncomfortable but honestly, for as much time as we spent in them who cares, right?:-)", "user": "lovindashred", "date": "April 10, 2011", "id": 103442962}, {"rating": 5.0, "title": "Halo Grand Beautiful!!!!", "text": "The resort is horseshoe-shaped and in the center are the 3 main swimming pools. One in the rear is cold, the 2nd center is the main pool which is warmer and where they play volleyball, etc, and the 3rd is overlooking the beach and almost hot-tub temperature. So, those of you with 'Goldilocks Syndrome' are sure to find 1 of the 3 that suit you. If the ocean is more to your liking, simply walk down 10 or so steps and you are on the beach and can walk for miles in both directions. Red flags were up every day cautioning swimmers of a strong undertow and we heard many tragic stories of recent victims to the current, so I urge common sense avoidance.. especially with children.", "user": "kimhilbrecht", "date": "April 6, 2011", "id": 103097474}], "location": {}, "stars": 3.5, "variance": {"poor": 88, "average": 156, "very good": 410, "terrible": 51, "excellent": 371}, "aka": "Hola Grand Faro Los Cabos Hotel San Jose Del Cabo", "slim_ranking": 0.675675675676, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "description": "The hotel Barceló Grand Faro Los Cabos***** is a resort situated on the shores of the spectacular beach on the Sea of Cortés. It is a hotel for enjoying the peace and quiet of Los Cabos, the relaxing atmosphere of San José and the gentle whisper of the sea. The hotel boasts 350 luxurious rooms and suites distributed over 3 buildings: Luna, Estrella and Torre Sol. All the rooms have a private balcony with views over the Sea of Cortés and are equipped with a number of first class details to ensure your stay is a memorable occasion. The most discerning guests can enjoy the Barceló All Inclusive programme on offer at the resort. The Barceló Grand Faro Los Cabos hotel is well-known as one of the best All Inclusive hotels in the area thanks to the quality and added value it offers its guests. There are 5 restaurants and 3 bars in the hotel offering a wide-range of gastronomy, including an extraordinary selection of international, Mexican and Italian cuisine. Its on site convention and meeting centre boasts 2,620 m2 of space to accommodate all types of events. Plan your corporate meetings, conventions or weddings in the best facilities on offer in Los Cabos. And not forgetting the youngest members of the family, who can have fun in the hotel's water park or in La Tortuga, the children's club. The Barceló Grand Faro Los Cabos hotel is the perfect choice for enjoying your trip. If you are travelling for business, or spending a holiday with your partner or family, don't hesitate in visiting us!"}