{"user_rating": 4.5, "review_count": 239, "name": "Barnsley House", "reviews": [{"rating": 4.0, "title": "Almost perfect", "text": "We started our mini-moon at Barnsley House, and what a beautiful place to start! Perfect setting, and the most amazing room with a huge jacuzzi bath. The service & food was superb. The only reasons for not getting 5 stars were small - firstly, they hadn't made our spa reservation even though we'd had an email confirmation and they were fully booked. This was obviously really annoying, but they did manage to sort something out in the end. Secondly - the bill - it was really confusing, and they charged us for things that were included in our package - it just seemed a bit sloppy. But, other than that perfect! Already looking forward to next visit!", "user": "TheThirlwells", "date": "November 19, 2012", "id": 145715588}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "Stayed here for out wedding anniversary and it couldn't have been better. We booked a garden suite which turned out to be like a small apartment with a separate living room, bedroom and bathroom overlooking the garden. The evening dinner was delicious and the service helpful and friendly without being over the top. Excellent cooked breakfast with local ingredients topped off the stay. We would definitely return.", "title": "Wonderful stay", "helpfulness": 1, "user": "Mrs-Stringer", "date": "October 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 143307659}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "My mother was visiting from the states and we went to Barnsley House for her birthday, it was fantastic. The room was wonderful and comfy. We loved the rooms being in their own building with and outside sitting area. The room had a lovely sitting area with amazing biscuit for your tea.", "title": "Fantastic", "user": "livinginlondon1344", "date": "October 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 143108010}, {"rating": 2.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "We had dinner and breakfast at the main house and loved both. We went for a drink at the village pub and wish we had time to eat their as well.", "title": "Pretty Disappointing - don't stay in room 9", "helpfulness": 7, "user": "NinaGrant", "date": "October 1, 2012", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 1.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 141754768}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "The gardens were gorgeous and everyone was very friendly", "title": "Intimate luxury and great spa", "user": "DanRB", "date": "September 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 141676784}, {"rating": 4.0, "stay_parameters": "Stayed September 2012", "text": "The rooms here are absolutely gorgeous with loads of little touches to make your stay as relaxing as possible. There is a DVD library, a steam button in the shower, a bath in the room, a 'mini pantry' and the products are heavenly (£18 each if you want to buy!). The lounges, restaurant, gardens and spa are all so lovely. We hired the private cinema, which was an unbelievable luxury.", "title": "Beautiful hotel, but overpriced.", "helpfulness": 1, "user": "sdsteinhardt", "date": "September 28, 2012", "detail_rating": {"cleanliness": 5.0, "value": 2.0, "location": 5.0, "service": 3.0, "rooms": 5.0}, "id": 141471490}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "Some criticisms though: it is very expensive and the cost of the food is not warranted- £25+ for a main without vegetables. The spa is nice but it is very small- it is not a spa destination. The outdoor mini-pool could be warmer. Finally, I don't like being constantly referred to as 'ladies'. Bit patronising.", "title": "It doesn't get much better than this", "user": "M A", "date": "September 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 140574911}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "Safe parking. Great grounds. Excellent intimate spa and outdoor heated splash pool with jets. Excellent food. Attentive and friendly service. Perfect for couples (not children – see their sister hotel). Oh yes, and a private cinema! This is a weekend event not just a hotel.", "title": "England at its best", "user": "David M", "date": "September 15, 2012", "detail_rating": {"value": 5.0, "location": 5.0, "service": 5.0}, "id": 140339143}, {"rating": 5.0, "stay_parameters": "Stayed August 2012", "text": "Just moved into the area and popped in on our first visit to the Hotel to book a table for dinner in a couple of weeks time however we took the opportunity as it was a beautiful day to have coffee in the garden. Every member of staff we met including one of the Chefs Graham and Barnabas who managed the restaurant treated us like regulars and nothing was too much trouble including letting us choose the table we preferred . The Hotel is stunning the Gardens are a dream the whole place has a magical atmosphere we cannot wait for the Dinner and will report the outcome. We have a feeling its going to be special to match the venue and the attitude of the staff !! Incidentally the coffee and home made biscuits were exceptional", "title": "What a wonderful place", "user": "mandydogsy", "date": "September 10, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 139935014}, {"rating": 4.0, "stay_parameters": "Stayed September 2012", "text": "Stayed here two nights in one of the rooms in the stableyard. Room 18. All i can stay is what a wonderful, amazing place! The staff are friendly and room service great. I was travelling with a baby and we got put in the stableyard as it is their policy not to have babies staying in the main part of the house. Not that my little girl was a problem at all. The stableyard is a lovely seperate courtyard with a few rooms. We had a lounge upstairs and a steam room in the bathroom. I was not sure about the bath tub in the bedroom area as it was by the entrance, just seemed out of place and nkt like the romantic bath tub you would find at the end of the bed, but overall a nice room. I was disappointed as when i had requested a twin room, i expected the room to be ready as a twin room. I was with my sister, as we were having a spa break. But this was no big drama, as my sister decided to sleep on the sofa and we just requested another duvet. We were not allowed to eat in the resturant, as again we were with a baby, so we ordered room service, which was fantastic and tasted delicious. The first night we ate at the village pub. Nice place, but service was a bit slow and the food not as good at the house food. We ordered breakfast to our room and again this was fantastic. We were lucky that we had nice weather as walking around the garden was lovely the first day, although it rained so much in the morning, and our breakfast was never late! There is a farm at the back of the house and it was nice to show the cows to my little girl. I would definately return again and try one of the other rooms out in the stableyard. But this is not a baby friendly house as such, although when i requested a highchair for the room, this was provided.", "title": "Pretty fantastic!", "user": "PoppyTT", "date": "September 9, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 139819641}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "We have just come back from staying over Christmas. From the time we arrived on c'mas eve to the moment we left on the 27th I have nothing but praise for the team at Barnsley House. The building is stunning, our room was No 5 and the bathroom was the best I have ever seen (and I have stayed in some of the best hotels). We were greeted with such a warm welcome and all the staff were attentive, friendly and had permanent smiles on their faces and not just cause it was their job but because I truly believe they love working there (who wouldn't in the gorgeous building and grounds!). The food was fresh, locally sourced and excellent. We had a night at their pub over the road and the meal in their was one of the best pub meals I have ever tasted. Even when we went to leave we were offered 2 loaves of home cooked bread to take with us, with this and the hamper in the room that was there for us when we arrived with home cooked goodies and jams, I have no hesitation in recommending this stay to anyone, a bit pricey but definitely worth it! So much so that we have already booked a weekend to return in June and will be booking very shortly to return for c'mas next year. If you can afford a treat, then this is the place to stay!!!!", "title": "Stunning!", "helpfulness": 1, "user": "Binfield55", "date": "December 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 148237296}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "Our son recently got married at this hotel. I cannot commend highly enough the hotel for its ability to ensure that their day was special. The hotel managed to create a 'house party' feel to the whole day and although this looked effortless, I am sure that this involved a large degree of organisational skill from the lovely wedding arranger, charming hotel manager and efficient and inconspicuous staff.", "title": "Side by side bathing", "user": "queensquitter", "date": "December 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 148137704}, {"rating": 5.0, "stay_parameters": "Stayed December 2012", "text": "Our room ( number 1) was lovely, with a plump bed straight out of a fairy story and the biggest bathroom I have ever seen. So big in fact that the side by side baths sat in the centre seemed to take up no room at all! Did I mention that at the end of the baths, there was also a flat screen TV? I could go on and on about the hotel room, the wedding venue but I am sure that even then I wouldn't be able to fully reflect how much we enjoyed our stay.", "title": "Stunning hotel, pure luxury, can't wait to return!", "user": "Lindsayp1983", "date": "December 16, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 147564796}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "Well done Barnsley House !!!", "title": "Fantastic, relaxing weekend break", "user": "Katrina J", "date": "December 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 147122990}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "I booked Barnsley house for my boyfriends 30th, the stay was so special from beginning to end we were sad to leave. We stayed in stableyard suite 19, it was huge! The highlight for us was the hottub in the living area :) we both had a massage in the spa which was heavenly and then spent the next few hours in the outside hydrotherapy pool, such an experience when it's freezing cold and dark outside and your all warm sipping champagne... As a final surprise i had booked the cinema for my boyfriend and bought his favourite film for them to play, so cool, he loved it! The food in the restaurant was simple fresh flavours cooked to perfection. Everything about our stay was perfect, the hotel has the perfect mix of traditional with modern features like flat screen TVs and nespresso coffee machines in the room. Can't wait to return, thank you for making my boyfriends 30th perfect :)", "title": "Exceeded all expectations!", "helpfulness": 1, "user": "JedandPaul", "date": "November 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 146120704}, {"rating": 5.0, "title": "Makes you feel special", "text": "This was our first stop after a drive from Heathrow, and when you arrive at Barnsley House, you definitely feel that you have arrived at a very special piece of England. The gardens in July were absolutely stunning and quiet and serene. A very special experience. And our rooms were similarly fantastic. Our sons' room, in particular, had such a stunning bathroom under the eaves, that I took photographs of it to save in my remodel file. It was so well done. We all enjoyed dinner, and then walked down the road to the Barnsley House's pub, where the reception was very friendly, and the decor was quaint and elegant all at the same time. We didn't have time to dine at the pub, but I would definitely do so next time. The location of Barnsley House is great for exploring the Cotswolds, and is not too bad a drive from Heathrow, even after a long flight. I have been to a number of British country house hotels which disappoint, but I am pleased to report, that Barnsley House is not one of those. Can't wait to return.", "user": "kingsroadgal", "date": "January 23, 2013", "id": 150367130}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "My husband and I recently stayed at Barnsley house ( upon the recommendation of our friends at Celebrated experiences) for a couple of nights before Christmas. We could not have had a better experience. The place is stunning from the building and grounds to our top floor room ( full of exposed wood beams, subtle neutral decor, gorgeous claw foot tub, bright and lovely views of the gardens). The service was impeccable - friendly and attentive without hovering. They made us feel at ease and at home from the moment they greeted us. The restaurant also was great ( loved the scallops) and the breakfast ( included) provided me the opportunity to experience the best eggs Benedict I have had in my life. The village pub a short walk away was charming and a fun place to wind down after a day of sightseeing. Which brings me to the location. .. The town basically consists of the hotel and village pub, but there is a nice- sized charming town a couple of miles away if you wanted to venture further for dinner or drinks. It's also an easy drive to a series of lovely Cotswold villages, Bath, etc. Also, for those coming from out of the country and wanting to \"check the box\" on Stonehenge, it's an easy day trip. Great base camp for exploring the countryside.", "title": "Perfection in the English countryside", "helpfulness": 1, "user": "Elizabeth1918", "date": "January 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 149527411}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "My husband and I stayed at Barnsley House for our 'mini-moon' in December. We couldn't have asked for a more perfect start to married life. An absolutely beautiful country house, with delicious food and a gorgeous and relaxing spa. We had one issue during our stay, but the team here were so helpful in getting it resolved, and nothing was too much trouble for them. We felt extremely well looked after and welcome. Must tries: village pub, local walks, spa, cinema (which you can book for your own viewings).", "title": "Perfect mini-moon", "helpfulness": 1, "user": "Lara O", "date": "January 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 149008164}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "I stayed at the beautiful Barnsley House from 20th-22nd December 2012 and it was one of the most relaxed, enjoyable and pleasant stays I have ever experienced.", "title": "Everything was perfect - Could not have asked for more!", "helpfulness": 1, "user": "Nick J", "date": "January 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 148570433}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "I had pre-warned the staff that I planned to get engaged during my stay and they could not have done anything to make our trip more special.", "title": "Piping in the New Year at Barnsley House.", "helpfulness": 2, "user": "John G", "date": "January 1, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 148500605}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "stars": 4, "variance": {"poor": 9, "average": 14, "very good": 50, "terrible": 1, "excellent": 165}, "aka": "Barnsley House Hotel", "slim_ranking": 1.0}