{"user_rating": 4.5, "review_count": 208, "name": "Barnsley Resort", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed September 2005", "text": "Everything about our visit to Barnsley was perfect. Staff could not have been more charming or helpful. Cottages were very charming, food was superb, spa", "title": "Defines Southern Charm", "helpfulness": 2, "user": "gsdc", "date": "January 25, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 4387989}, {"rating": 5.0, "stay_parameters": "Stayed January 2006", "text": "services were first-rate and staff went out of their way to make you feel relaxed. Want to go back soon.", "title": "This is what we mean by customer service", "helpfulness": 1, "user": "Sambeaux", "date": "January 17, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "service": 5.0}, "id": 4359223}, {"rating": 4.0, "stay_parameters": "Stayed December 2005", "text": "Being from California, I wish Barnsley Gardens was closer. Nothing is overlooked here (unlike the Overlook Inn in Chatsworth, GA), from guest services (great golf, health club, horseback riding, skeet, etc.) to customer service. The grounds are spectacular and immaculate, the design refreshing, private duplexes, great food and again, great customer service.", "title": "Very nice place but go in spring or summer", "helpfulness": 1, "user": "hjguinn", "date": "December 28, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 3.0}, "id": 4309028}, {"rating": 4.0, "stay_parameters": "Stayed October 2005", "text": "Rooms could use some refreshing, but still nice with great amenities.", "title": "Great weekend escape- but go in Spring!", "helpfulness": 4, "user": "Leisurepax", "date": "November 27, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 4145601}, {"rating": 5.0, "stay_parameters": "Stayed October 2005", "text": "If I'm back this way, I'll stay here!", "title": "wonderful property", "helpfulness": 1, "user": "luvshawaii", "date": "October 12, 2005", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "service": 5.0}, "id": 4017514}, {"rating": 5.0, "title": "Great Resort", "text": "After finding Barnsley Gardens Resort on a luxury travel site, I checked it out on trip advisor before going any futher. Everything sounded really nice about the resort, so I decided to book a 4 night package for our anniversary for the last week of May. My husband was a little sceptical, but it turned out to be one of the best vacations we'd ever taken!", "helpfulness": 13, "user": "A TripAdvisor user", "date": "June 14, 2005", "id": 3554543}, {"rating": 5.0, "stay_parameters": "Stayed March 2005", "text": "Check-in", "title": "Bragging on Barnsley", "helpfulness": 5, "user": "mchurch", "date": "May 22, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 3492968}, {"rating": 5.0, "title": "Can't say enough!!", "text": "Check-in at the resort was great. We had no problems and it was quick. A guide took us to our cottage and explained a little of the history of the estate to us. He gave us a map of the resort and explained where everything was located. Basically everything is within walking distance of your cottage.", "helpfulness": 11, "user": "CaryandDayna", "date": "June 8, 2004", "id": 2171304}, {"rating": 5.0, "title": "An Amazing Place !", "text": "Cottage", "helpfulness": 15, "user": "A TripAdvisor user", "date": "August 20, 2003", "id": 1237643}], "location": {"country": "United States", "city": "Adairsville"}, "variance": {"poor": 5, "average": 14, "very good": 42, "terrible": 3, "excellent": 144}, "aka": "Barnsley Gardens Hotel Adairsville", "slim_ranking": 0.4, "description": "Just 60 miles north of Atlanta, Barnsley Resort welcomes guests into a storybook setting of incomparable service. Encompassing 3,300 acres, the historic Barnsley Gardens offers a unique experience. Accommodations at Barnsley Resort are located within 36 unique guest cottages inspired by the architecture of Andrew Jackson Downing. There are 90 guest rooms and suites to choose from, or you may also reserve an entire cottage. Whether looking for a relaxing getaway weekend, strategic meeting or an elegant wedding, guests will discover a retreat of privacy and perfection. Amenities include gourmet dining, an award winning spa, and exciting recreational choices such as world-class golf, a 15 station sporting clays course and hunting at SpringBank Plantation - Georgia's most unique hunting preserve, and horseback riding along scenic trails. Other amenities include hiking, biking, paintball, Frisbee golf, tennis, swimming, fishing, garden tours, historical museum and more. Opportunities to explore the immaculate gardens and historic ruins should not be missed during your visit to this one-of-a-kind resort."}