{"user_rating": 5.0, "review_count": 384, "name": "Bass Cottage Inn", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "This use to be Bass Cottage in the Field and has been beautifully renovated by the present owners. The rooms still retain some of the original charm but have been updated with new baths and gas fireplaces. The great secret of this inn is the location. It is located in the heart of downtown sandwiched between main street and the ocean. The location is historically known as \"the field\" where three large victorian homes were built set way back from the ocean. All three homes exist today and are inns. You can not hear or see downtown from the inn you can catch a glimpse of the ocean from some of the rooms in the inn. The beauty is that you can park at the inn and walk to anything downtown or walk thru \"the field\" and take the mile long ocean walk that winds down the ocean front. I go to Bar Harbor to hike in Acadia National Park and at the end of the day I am tired. It is great to come back to the inn and go to the pantry where there are always hot coffee or tea and a cookie and then sit by the fire. The present owners have been there seven years and did extensive renovations to bring the inn back to it's beautiful self. Breakfast is always delicious and filling. I have been going to Bar Harbor every year for twenty years (I also live in Maine) and I would highly recommend this inn. Every morning at breakfast I listened to the innkeepers help vacationers decide what to do and where to go to have a great time in Bar Harbor and they gave great advice. Go to see one of the great national parks and stay at a great historic house, Bass Cottage Inn.", "title": "Beautiful historic inn, quiet and still in the heart of Bar Harbor.", "user": "kerrytietjen", "date": "October 21, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 84324126}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "We recently spent one night at the Bass Cottage Inn and I would have loved to stay longer. The most beautiful inn ever, every detail perfect and perfect hospitality. Our room was incredible with fireplace and enormous jacuzzi tub. Perfectly located within walking distance of all restaurants and activities in Bar Harbor. The breakfast was amazing as was the service. The owners personally greated and served us with everything not only beautiful to look at but was also delicious. I hope to have the opportunity to go back.", "title": "Absolutely perfect....my favorite inn ever.", "user": "jgvarney", "date": "October 19, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 84019375}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "Bass Cottage Inn was the perfect place for a comfortable vacation with my wife and another couple we were traveling with. I must admit I had reservations about our stay before we arrived as we had no first hand knowledge of the inn. However,any reservation I had were gone immediately upon arrival when we were warmly greeted and made to feel like family at the inn. The common areas are spacious, well appointed and comfortable. Breakfast was OUTSTANDING!!!! Our room was comfortable and clean. Jeff And Terri was terific hosts; they made us feel welcome and comfortable throughout our stay. They provided valuable advice on seeing the sights and geting around Bar Harbor.", "title": "We loved Bass Cottage Inn", "user": "PugglePower", "date": "October 12, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 83222195}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "I can't wait to visit Bass Cottage Inn again!!!!", "title": "Welcoming Inkeepers; Delicious Food; Beautiful Atmosphere.", "user": "cipi2000", "date": "October 9, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 82752105}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "Just a minute walk to Main St; Large, spacious ground floor with many sitting areas including fireplaces and Library; Kitchen was open 24/7 with delicious treats - Ask Teri for her ROCKY ROAD BARS!! Gorgeous Breakfast room surrounded by windows; tasteful bedroom in soft blues and gray - I would ask if there is a King size bed (we had a queen). We truly felt welcome this elegant home!", "title": "The Bass Cottage Inn was our favorite B&B in New England!", "user": "Jackie29209", "date": "October 8, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 82657600}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "Tom's a tough critic and this is one of the few places he felt warranted \"perfection\". This is a completely restored \"summer cottage\" (meaning huge summer home) of a wealthy original owner. The architectural details and quality of the original construction are wonderful and the restoration very competently done. Our room was extremely large, had a gas fireplace, comfortable king bed, lights wherever you needed them, multiple seating areas with lights and tables, large bathroom with plenty of space to spread your personal items out, flat screen TV. The breakfasts were inventive with interesting choices between a sweet or savory main course (which is good since Tom and I have diametrically opposite tastes in breakfast food - I don't like sweet breads and pastries and he doesn't like heavy meat/egg ladened breakfasts). There is a guest pantry with complementary drinks including wine, ice, dishes, utensils, glasses and refrigerator so you don't have to bother any one to get these items. There is always a nice snack available (brownies or cookies). The public areas are large, including several fireplaces), with comfortable seating, ample reading material, places to play cards, etc. There are loaner umbrellas for inclement weather. This was one of the most expensive B&Bs we stayed at on this three week trip but it was worth it! It is located in the middle of Acadia National park so a great place to base yourself. Too bad the weather was rainy and cloudy while we were there. The only other place meriting a Tom \"perfection\" rating was the Goldener Hirsch in Salzburg Austria so pretty high bar. The innkeepers were professional yet warm. We loved our stay.", "title": "Met Tom's criteria for \"perfection\"", "helpfulness": 1, "user": "cyssf", "date": "November 6, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 86193534}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "We picked the Bass Cottage Inn based on Trip Advisor reviews. As described by Jeff, the owner, \"boutique hotel\" would be a better description of the Bass Cottage Inn than \"bed and breakfast\". Our expectations were exceeded in every way. The common areas were beautifully appointed, warm and inviting. Other reviews have described them accurately and in detail. The common pantry was generously stocked with coffee, soft drinks, homemade cookies/pastries and fruit throughout the day. Our room, #3, was roomy and bright with a generous sitting area that included an upholstered chair and love seat facing the fireplace - a wonderful setting to read or relax after a hard day of sightseeing. Jeff and Terri, the owners, were very attentive as were the other staff. Though we are not breakfast people, the morning breakfast fare was exceptional and served in a lovely seated dining area. The location is terrific within walking distance of the water, shops and local restaurants. In short, we found the Bass Cottage Inn to be \"simply perfect\" and hope to be able to return in the future.", "title": "Simply Perfect", "helpfulness": 2, "user": "docwgk", "date": "October 29, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 85270721}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "If the words “bed and breakfast” conjure up for you images of lots of chintz, yellowed doilies, and other fussy Victoriana, think again: the Bass Cottage Inn has none of the above, which, at least to me, is a good thing. What it does have is the elegant, easy-going décor of a well-cared for country house that manages to combine historic detail with up-to-date amenities. In other words, it has everything you could wish for: charm, warmth, comfort, and many perfect little touches that make your stay so enjoyable. In fact, it is the unerring eye for those little touches and details that makes this place so special.", "title": "The Ultimate B & B Experience", "helpfulness": 4, "user": "travelerNewYork", "date": "October 25, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 84812139}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "Teri and Jeff did a wonderful job in restoring and decorating this house and their obvious enjoyment of running a B & B shows. The common rooms are simply beautiful, welcoming you with fireplaces, comfortable chairs and couches on which to relax with a book, a glass of wine, or conversation. Should the mood strike you, or if it’s a rainy day, there are also games such as jigsaw puzzles, Scrabble, dominos, and Trivial Pursuit. In addition to a collection of books on a wide variety of subjects, there are also travel books for New England in general and the Bar Harbor area in particular. These are very thoughtful additions, as are the menus available from local restaurants that can help you decide on where to have dinner. Speaking of dinner, Greg, who is there in the evenings, is very helpful and knowledgeable and his recommendation for dinner was spot on.", "title": "Romantic escape in the heart of Bar Harbor", "helpfulness": 1, "user": "CoastalLife19", "date": "October 24, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 84697776}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled with family", "text": "I can only repeat everyone’s comments about breakfast. Whether it is a frittata, lobster omelet, or one of the delicious baked goods, it is uniformly wonderful, carefully prepared, and again, has those small details that really make a difference. Like using home-made bread crumbs on the tomato gratin, caramelizing the onions before they go into the omelet, and cutting the fruit small and serving it at room temperature. Breakfast is served at individual tables, which, at the risk of sounding antisocial, is a big plus for me. I enjoy socializing but not necessarily first thing in the morning, so I appreciate being able to enjoy my coffee (outstanding, by the way) and breakfast at my own table.", "title": "This is one of the better places...", "user": "robertmlewis", "date": "October 22, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 84423249}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "Wonderfully situated, this B+B exceeded all of our expectations. Terri and Jeff were incredible hosts and they as well as their staff made us feel very personally welcome at their inn. They clearly take great pride in the property which is reflected in lots of welcoming touches like a 24-hour help yourself pantry stocked with freshly-baked goodies, a wine and cheese aperitivo in the early evening, and comfortable common areas with glowing fireplaces. Best of all, they took a personal interest in making sure we had a fantastic stay and gave us well thought-out recommendations to make the most of our trip to Bar Harbor. The breakfasts were delicious and definitely a cut above; my wife and I hope that a Bass Cottage Inn cookbook is in the works! If you don't enjoy your stay here, you are probably looking for a reason to have a bad time. We would go back in a heartbeat.", "title": "Still thinking about our stay at Bass Cottage Inn", "helpfulness": 2, "user": "badwaiter", "date": "December 2, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 88883138}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "We stayed in this wonderful place for three days in October 2010. We thoroughly enjoyed our stay. The room was very nicely decorated and room service was excellent. Their tips for daily tours and restaurant recommendations were outstanding. However, the one thing we were looking forward to the most each day was the delicious breakfast. We will surely be back!", "title": "Excellent!", "helpfulness": 1, "user": "Lydia356", "date": "November 29, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 88519625}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "My wife and I could not have picked a better place to celebrate an anniversary. Breakfast here is stellar. I'm not a morning person and can't remember the last time I had an actual breakfast at a truly \"breakfast\" hour. I'm perfectly happy to sleep later, skip breakfast, and catch something more interesting at a more hospitable hour. But not at the Bass Cottage Inn! You will be doing yourself a hideous disservice if you miss THESE breakfasts. They are neither trendy nonsense, nor are they coronary occlusions on plates. These are delicate without being precious, flavorful but not cloying, and they satisfy without stuffing you. We looked forward each night to the next morning's adventure and loved to wake to the smells that filled the Inn.", "title": "Spectacular breakfasts, charming owners, perfect location, refined & comfortable room!", "helpfulness": 2, "user": "oolongblue", "date": "November 27, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 88390575}, {"rating": 2.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "The Inn is perfectly located--not right on top of the touristy bustle, but just a couple of minutes' walk from the water and from downtown shopping and restaurants. Acadia National Park is less than a 15 minute drive away. In fact, one evening our GPS took us through some backroads within the park and we made it from the peak of Cadillac Mountain back to the Inn in 7 minutes! And you'll be happy that there isn't much time wasted on driving to and fro, since there is so much to enjoy in the area (and because everything pretty much closes down by 10pm, so after a late dinner, you'll be happy that you are so near to your comfortable room).", "title": "Underwhelming, overpriced experience", "helpfulness": 1, "user": "Jeff T", "date": "November 25, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 1.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 88197589}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "We chose one of the largest rooms (#4) and were completely satisfied. It was handsomely furnished and the bed was spacious and comfortable. My wife loved the particular shampoo provided by the Inn and I was happy to have a whirlpool in the tub to rest after a long day of exploration. We utilized the television to keep abreast of the baseball playoffs and I used the wireless connection to find out the time for sunrise (at this time of the year, Cadillac Mountain is the first place in America to catch the rays of sunlight at dawn), check weather conditions, areas for peak foliage, and reviews of local restaurants. Of course, Teri and Jeff are an excellent source for food recommendations in the area as well.", "title": "We will never forget The Bass Cottage Inn.", "user": "donotwait", "date": "November 14, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 87045073}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "My wife and arrived for a one night stay in mid-September, on our way to other locales on Mount Desert Island. Bar Harbor is not without its share of tourists, but the Bass Cottage's location, only a block from the harbor but situated in sucjha way to be sheltered from the crowds and the bustle, made it an ideal location to explore the environs. The innkeepers are very warm, friendly and engaging, and have restored an old \"summer cottage\" immaculately, featuring a large and comfortable sunroom, a spacious living room a, cheery and bright library, and a parlor with a large fireplace and very plush seating - and so you never feel that other guests are underfoot, Our room 3 with a king size bed, large sitting area. elegantly appointed bathroom and numerous windows, was both warm and bright. The innkeepers offered wine and hors d'oeuvres in the early evening, and suggested an excellent restaurant, The Burning Tree, to us that featured a menu that featured literally on-location home grown ingredients in an cosy and warm setting. All-in-all, a very nice experience.", "title": "A truly warm, elegant and tastefully appointed inn, close to main street but just sheltered enough to be serene.", "helpfulness": 2, "user": "Jebby3", "date": "October 4, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 82096463}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "As my wife and I finished up our honeymoon we couldn't have picked a better place. Close to the downtown area and close to the water its a wonderful location. Our room was very clean and wonderfully decorated and made you feel immediately at home. Every morning the breakfast was delicious with choices to pick from. The owners took their time to learn our names and speak with us each morning about our activities and offered up any help that we might need for the day. When we go back to Bar Harbor we will stay here again and again and again.", "title": "Can't wait to go back", "helpfulness": 1, "user": "nkrech", "date": "September 24, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 80881764}, {"rating": 4.0, "title": "Lovely breakfast and great location", "text": "This Inn is doing all of the \"inn\" things right- they take care of you from the minute you walk in the door, have a lovely area with nibbles and drinks, and have a phenomenal served breakfast in the morning. My husband and I were in the most expensive room in the Inn, which we found overpriced compared with other inns that we have visited. If you want to be close to Bar Harbor without feeling like you are in the hustle and bustle, this is a great location.", "helpfulness": 1, "user": "traveler0406", "date": "September 17, 2010", "id": 79964025}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "This was the third trip to Bar Harbor/Acadia National Park for my wife and I. We have gone for a long weekend over the Labor Day Holiday for the last three years in a row. This is the second time that we have stayed at the Bass Cottage Inn and we will be staying there again for sure. This Inn has a fantastic location being located just off the beaten path (very close) to the main streets of Bar Harbor. It is very neat, clean, and quiet. It is also elegant, but not \"stuffy.\" My wife and I find it very comfortable here and the rooms are nicely decorated, cozy, and of good size. The breakfast served here every morning is ABSOLUTELY DELICIOUS! The selections are eclectic and the portions very generous. MAKE SURE YOU DO NOT MISS BREAKFAST HERE! The Inkeepers (and owners) are very nice and accomodating and make sure that you are happy with all aspects of your stay. We also found them to be very knowledgeable in regards to area restaurants and various activities, including the many different hiking options available in Acadia National Park. After staying at the Bass Cottage Inn three years ago (and loving it), we tried a different Inn two years ago (to contrast and compare) and found the Bass Cottage to be significantly better! That is why staying there again this year (and other years to follow) was a no-brainer for us. For all of the reasons already mentioned (and it is reasonably priced too!), my wife and I would HIGHLY RECOMMEND this Inn to anyone.", "title": "If traveling to Bar Harbor/Acadia, make sure to stay at the Bass Cottage Inn!", "helpfulness": 2, "user": "roadlesstraveled29", "date": "September 14, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 79550374}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "This was our second trip to Bass Cottage. (Our first was in 2009.) And we were not disappointed. Jeff, Terry, and Greg were all very cordial and very, very helpful in suggesting hiking trails and wonderful (sometimes off the beaten path) restaurants. The accommodations and breakfasts were first-rate, once again. We had a great experience.", "title": "Fabulous AGAIN", "user": "petrock2002", "date": "September 8, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 78850140}], "location": {"country": "United States"}, "variance": {"poor": 3, "average": 3, "very good": 19, "terrible": 2, "excellent": 357}, "aka": "Bass Cottage Hotel Bar Harbor", "slim_ranking": 0.117647058824, "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "description": "Modern. Maine. Classic. Bar Harbor's finest boutique inn. Yankee Magazine \"Best of New England / Editors' Choice\" award winner. Member of the Diamond Collection. Bar Harbor's premier luxury inn featuring sophisticated, elegant accommodations and gourmet breakfasts. Located steps from the waterfront, shopping, restaurants and just minutes from Acadia National Park. Fireplaces, whirlpool tubs and free WiFi. Open mid-May through end of October each year."}