{"user_rating": 4.0, "review_count": 3847, "name": "Bavaro Princess All Suites Resort, Spa & Casino", "reviews": [{"rating": 5.0, "title": "Loved the Bavaro Princess", "text": "We just got back from spending a week at the Bavaro Princess and we had a wonderful time. If I had listened to all these negative reviews, I would have missed a week that we will always remember with great pleasure. The grounds are immaculate and beautiful - the people who work there, the maids, the groundskeepers, the wait staff, the bartenders, the chefs, everyone was pleasant and accomodating. I do not speak spanish but I managed to communicate with no trouble at all. My husband is fluent but I was treated no differently than he was. The rooms are very nice - the extra beds are a little less comfy than the ones that are in the actual bedroom area but my daughters were fine with it. The people that run the activites are energetic and made sure everyone had a great time. The only complaint that I could even come up with has nothing to do with the resort itself rather the unfriendliness and rudeness of some of the guests that are there - it is sad to see people behave so badly to the employees - that is all I will say.", "helpfulness": 28, "user": "A TripAdvisor user", "date": "August 6, 2005", "id": 3741783}, {"rating": 2.0, "title": "ripped off at the princess", "text": "It is a tropical island so it is hot in the summer - that is to be expected - you are in the Dominican Republic - they do NOT speak english as a first language - people should understand and try to understand rather than to criticize - the food was good - not great but good - but this is an all inclusive - what do you expect??? And it is a huge resort - they do a very good job all things considered.", "helpfulness": 15, "user": "A TripAdvisor user", "date": "August 1, 2005", "id": 3728711}, {"rating": 3.0, "stay_parameters": "Stayed July 2005", "text": "Leaving tips was extremely appreciated - I dont understand how some people could get up and leave nothing - you would NEVER do that at a restaurant at home - it would be unheard of - we left our maid a little trinket along with a daily tip for which she thanked us profusely - these people do not make a lot of money and any little gesture is greatly appreciated.", "title": "5 Star? Location Yes.... Food No!", "helpfulness": 26, "user": "Therandmeister", "date": "August 1, 2005", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "service": 2.0}, "id": 3728358}, {"rating": 5.0, "title": "Bavaro Princess", "text": "The restaurants are not stifling even though there is no air conditioning in most of the restaurants - we were very comfortable - again, this is a tropical island in the middle of the summer - heat is to be expected.", "helpfulness": 53, "user": "Kendall B", "date": "July 20, 2005", "id": 3687556}, {"rating": 4.0, "stay_parameters": "Stayed July 2005", "text": "Hot water was plentiful - the rooms did not smell - there were not a million bugs - as a matter of fact, I saw no mosquitos - and we went outside the resort to the shopping area called Bavaro Plaza and had a great time - the people love to haggle and MUST get you into their stores - here is a tip for you if you decide to go - be the first customer of the day in their store and you will get bargains galore - they consider the first sale of the day to be a blessing and will not want to lose it - it sets the tone of the day as far as they are concerned.", "title": "Bravo Bavaro", "helpfulness": 49, "user": "esoesyo", "date": "July 17, 2005", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 3674216}, {"rating": 2.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "This was a wonderful holiday for the children, but Mom and Dad suffered externally and internaly. Obviously the cotts brought in for the kids did not have an infestation, but our bed, room 778 left welts on our shoulders and my husbands neck. This was a platinum room but was not anything special. The realization of the bed bugs upon our return and a review of the welts, left us sick to our stomachs.", "title": "Bed Bugs Bite", "helpfulness": 3, "user": "Cintar", "date": "August 20, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 2.0, "value": 3.0, "rooms": 1.0, "location": 4.0}, "id": 8461025, "likes": {"liked": "— Becasue of our experience I am not comfortable answering the above", "disliked": "— Bed Bugs"}}, {"rating": 2.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "The food was great for the kids, but as adult travellers we were disapointed by the a la carte resturants. It basically was cafetria food, served on a plate, no different, no better than what you got at the buffet. The only exception was at the Licey where you had to pay $30 US per person extra.", "title": "Service a BIG problem", "helpfulness": 9, "user": "covertanjou", "date": "August 20, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 1.0, "cleanliness": 3.0, "value": 3.0, "location": 2.0, "rooms": 2.0}, "id": 8459132, "likes": {"liked": "— the beach", "disliked": "— the service"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "The most infuriating issue was the lack of enforcement of towel policy. People would put their towels to secure cabana's/beech spots the night before. It was impossible to ever get a sun protection if you were honest or followed the rules.", "title": "Great place. Remember, your in a foreign country", "helpfulness": 5, "user": "raikowski", "date": "August 20, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 3.0}, "id": 8458046, "likes": {"liked": "— overall apperance of the resort", "disliked": "— musty smell in room"}}, {"rating": 5.0, "title": "Best vacation ever at Bavaro Princess, Punta Cana, Dom. Rep.", "text": "My family and I have travelled throughout the Caribbean, but this was our first trip to DR. We chose this resort because it was a \"Special Deal\" from Air Canada Vacations. I had read the reviews of this hotel, but we decided that it was worth going (despite the reviews) because it was so inexpensive.", "helpfulness": 1, "user": "ConnecticutMorena", "date": "August 20, 2007", "id": 8457923}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled with friends", "text": "Luckily we had the Platinum Package. This was absolutely worth it because we had a private lounge, free dinner to the Licey Restaurant, and we were very close to the beach. Also, the AC rep (Catherine) was often in this lounge, and she was extremely helpful if you needed anything.", "title": "Just what we were looking for!", "helpfulness": 7, "user": "tropicalbarbi", "date": "August 19, 2007", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 3.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 8454532}, {"rating": 5.0, "title": "More Relaxing Than A Cruise", "text": "My husband and I went on the 4th of july week and got a piece of hurricane Dennis , but that was ok it amounted to abt 1/2 hour of rain.We couldn't have had a better time! They bumped us up to VIP and the check in was fast and smooth. They brought us right to our room and the luggage got there abt 1/2 hour latter. The grounds are imaculate they even hand rake the beach every morning . The sand is like sugar with no shells or rocks ,it's wide and clean and better than the reasorts to the right and left.We had a buffet breakfast and lunch at EL GOUCHO resurant right on the beach every day and they even had a sandwich that tasted amazingly like a hogie and if u have ever been to Philly u know what I mean. The service was every bit as good as a cruise ship ,I've been on 7 and they are just as helpful and nice as the best lines right down to scraping off the bread crumbs! I have also worked in a resturant for 20 years and the food is perfect ! Don't listen to those bad reviews ever yone has a bad expieiance now and then but i think they blow it out if proportion.If u are beach people like my husband and I are then this is the place for u!No worring abt what the next days stop is or waiting the get on or off the ship just wake up every day and do what ever u feel like, it was great!And the pool was beautiful with the islands and the swim up bar was great!we liked it so much that we are canceling the cruise that we had planed for next years and are coming back here twice!", "helpfulness": 24, "user": "seacatluv", "date": "August 17, 2005", "id": 3780824}, {"rating": 3.0, "title": "Resort wonderful but food and service not the best", "text": "i would give ths place", "helpfulness": 13, "user": "A TripAdvisor user", "date": "August 15, 2005", "id": 3763525}, {"rating": 1.0, "title": "Worst Vacation Ever", "text": "My husband, daughter and I spent July 25th to August 1st at this resort- The grounds were very nice but the area in the resort known as the Mangrove does have a smell - it can be strong some days - you would not want to have a room close to this area - we were very fortunate to have been booked into building 74 which is right by the beach - we had rooms 741 and 742 - our rooms were kept very clean and were quite large - the food was not the best but there was variety to be able to find something to eat and not go hungry - watch out for the hamburgers at that Mac Princess - the first time we tired them they were raw inside and did not try them again - I would like to say that there was one lady, Marlon, who worked in La Gaucho by the beach in the morning and La Copin in the evening that was very friendly - she helped make our vacation very enjoyable as she went out of her way to make us feel welcome - the beach - what can I say - most of the reviews say it is the most beautiful one they have seen and they are not exagerating - tipping does help but not always", "helpfulness": 7, "user": "A TripAdvisor user", "date": "August 14, 2005", "id": 3761801}, {"rating": 1.0, "title": "Bigger Isn't Better , bad bad bad", "text": "My room safe was robbed by an employee. All of my cash was stolen, I had nothing left for gifts for my family. When I called hotel security they sent me a security guard that did not speak english! When someone finally showed up that understood english, I was told right off the bat the hotel was not responsible. I was treated like I did something wrong. I never usually put things in the safe but for some reason this trip I did. As for the staff they said they would do an \"investigation\" of the people who were in my room, the maid and the 2 maintenance men that came in to fix the leak in my ceiling. I was not offered anything for my loss, not even an apology from hotel management. The next day I went to the front desk to see if the investigation turned up anything, no one there knew what I was talking about. It was like it didn't even happen. Needless to say my trip was ruined! I urge you, if you are thinking about staying at this resort find somewhere else. Another thing was the food, the only restaurant with exceptional food was the one that was not included in the \"all inclusive\" package. I will never return to the Dominican Republic!!!", "helpfulness": 11, "user": "A TripAdvisor user", "date": "August 14, 2005", "id": 3761552}, {"rating": 5.0, "stay_parameters": "Stayed July 2005", "text": "the worse vacation ever, and I mean THE WORSE.", "title": "A message to all of the complainers", "helpfulness": 69, "user": "politeeuropean", "date": "August 9, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 3749320}, {"rating": 3.0, "stay_parameters": "Stayed March 2006", "text": "I have to say that we read all the reviews before we went on our vacation, and were kind of nervous... but if you're there for the beach and relaxation, then its hard not to enjoy your self.", "title": "A few snafus...", "helpfulness": 7, "user": "SvetaGMU", "date": "March 29, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 2.0, "service": 3.0}, "id": 4771992}, {"rating": 4.0, "stay_parameters": "Stayed March 2006", "text": "I don't want to repeat what everyone else has already said, so I'll try to point out a few big things.", "title": "Great all around!!", "helpfulness": 12, "user": "vaderbarb", "date": "March 28, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 3.0, "service": 4.0}, "id": 4741936}, {"rating": 4.0, "title": "Loved it!!", "text": "- We emailed ahead of time to request a certain room, and although they never replied, they must have taken it into consideration. Our room had a fantastic location right by the beach and the pool.", "helpfulness": 11, "user": "Jme B 89", "date": "March 28, 2006", "id": 4740126}, {"rating": 4.0, "stay_parameters": "Stayed March 2006", "text": "- The resort is big, but its definetly walkable. We rarely took the little trolley because it only takes 7-10 min to walk from one end of the resort to the other.", "title": "Great, relaxing vacation", "helpfulness": 11, "user": "Unanimous", "date": "March 27, 2006", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 4738918}, {"rating": 4.0, "stay_parameters": "Stayed March 2006", "text": "- I would recommend going Platinum. We didn't, but the other couple we were with did. They got much better service from the bartenders and better alcohol, a better room (quality wise), free massages, free room service, free other stuff, and ability to book dinner reservations - I think overall it would be worth it.", "title": "Beautiful Resort, Friendly Staff", "helpfulness": 22, "user": "lyn53", "date": "March 26, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 4735871}, {"rating": 5.0, "title": "This hotel is amazing!", "text": "My boyfriend and I stayed at the Bavaro Princess from March 9-16, 2007. I was a little apprehensive after reading all the bad reviews, and I am posting this review to tell anyone thinking of staying here not to worry-this place is beautiful! We loved the winding, scenic trails throughout the property, and our room was a minute's walk from the beach and pool, an ideal location. If you don't like to walk a lot, there are trams that run every 5 minutes to take you around. The beach is breathtaking, and the weather was great. The food was really good, especially at Sakura and El Gaucho. We did not get sick, and we ate everything...just remember, alcohol and fruit drinks mess with your stomach too, so it's not always the food that makes people sick. Also, if you travel with Apple Vacations, I would definitely recommend going to their evening beach party-it was delicious! Everything was clean, and unlike some negative reviews, we did not see a single bug anywhere in our room. Tip the maids and the bartenders and they will take great care of you. The people who said the service was bad probably didn't tip and would complain about every little thing anyway. The employees work really hard to serve you, and if you have to wait a little while for service, well, you're on vacation! One thing-plan on being ready to check out at least 15 minutes earlier than what the hotel tells you, because the check-out line was huge and we almost missed our transfer to the airport. Other than that, our stay was wonderful, so please ignore all the bad reviews and plan on having a great trip!", "helpfulness": 8, "user": "mklies1", "date": "March 17, 2007", "id": 7179983}, {"rating": 5.0, "title": "Best vacation ever!!", "text": "Stayed at the Bavaro Princess from Feb 25th to March 11th and had the best time!! I would like to thank Francelia for making our wedding more than what we dreamed, Pineao the beach bar tender for being the funniest and personable person we have ever met and all the other staff at this hotel that work so hard to make our stay so wonderful!! The resort is beautiful and huge, if your worried about the size there are trolley's that come by every few minutes or if you can walk its really quite nice and from one end to the other only about 10 mins. The rooms are large and very clean, did not have any trouble with water pressure or temp. We only saw one cockroach in the entire two weeks we were there.", "helpfulness": 8, "user": "FEB07BRD", "date": "March 17, 2007", "id": 7179182}, {"rating": 1.0, "stay_parameters": "Stayed March 2007", "text": "Restraunts: El Pascador (Seafood), good food but small portions, also one of the most popular so if you plan on eating there you have to make the reservation about 2-3 days ahead.", "title": "The only vacation i ever starved on!", "helpfulness": 3, "user": "dadasdream", "date": "March 16, 2007", "detail_rating": {"front_desk": 3.0, "service": 1.0, "cleanliness": 2.0, "value": 1.0, "rooms": 2.0, "location": 4.0}, "id": 7173435, "likes": {"liked": "— the beach", "disliked": "— the food"}}, {"rating": 2.0, "title": "Okay Resort", "text": "Bella Pasta (Italian): Service here for whatever reason is really slow, but food is very good, I highly recommend the Spinach crepe and Carbonera pasta, my favorite the entire stay.", "helpfulness": 2, "user": "cbelfoi", "date": "March 16, 2007", "id": 7172337}, {"rating": 4.0, "stay_parameters": "Stayed March 2007, traveled with family", "text": "El Gaucho (Steakhouse): Food and Service were excellent here, the Ceaser salad was fantastic and the beef steak was to die for!", "title": "Great holiday", "helpfulness": 4, "user": "leadryan", "date": "March 15, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 7166519, "likes": {"liked": "— beaches"}}, {"rating": 1.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "If you don’t care about cockroaches, mosquitoes, and floods in your suite, then the Bavaro Princes is your destination. If you don’t care about customer service and fighting your way to get something to eat or find a spot around the swimming pool, then the Bavaro Princes is your destination.", "title": "Do your homework before you book at the Bavaro Princess", "helpfulness": 2, "user": "Olord", "date": "February 22, 2008", "detail_rating": {"front_desk": 1.0, "business": 3.0, "service": 2.0, "cleanliness": 2.0, "value": 1.0, "location": 5.0, "rooms": 2.0}, "id": 13764734, "likes": {"liked": "— The beach", "disliked": "— everthing else"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "I belive long time ago this resort used to be 5 stars, but through time, they lost at least 1.5 to 2 starts. I strongly believe this resort should be rated at 3.5 stars.", "title": "It's ok, not a 5 star.", "helpfulness": 1, "user": "Doggies2", "date": "February 19, 2008", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 2.0, "location": 3.0, "rooms": 4.0}, "id": 13689589, "likes": {"liked": "— The Beach", "disliked": "— The food and location on Jr. suite."}}, {"rating": 4.0, "title": "beautiful resort; beautiful beach, lovely staff", "text": "On a positive note, the beach was fantastic and the food was okay…", "helpfulness": 5, "user": "JudiCorbin", "date": "February 19, 2008", "id": 13684203}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "Stayed in a Junior suite of which was booked with Sunwing. The rooms was big, but the locations of Jr. Suite are next to the front lobby in a hotel of 2 floors., it's not the same has a suite. For what we payed it was not one of the best I have ever stayed at. The food was ok, not a 5 star. The entertainment was terrible need a big improvement.", "title": "WOW!!!! Absolutely fabulous resort!!!!!!", "helpfulness": 10, "user": "WIAnnabanana", "date": "February 16, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 13594971, "likes": {"liked": "— the beautiful grounds and the fabulous beach", "disliked": "— no complaints or dislikes"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2007", "text": "The Beach was the best I have been to in D.R. We travel 2 trips in the winter, been to Cuba 4 times, D.R. Puerto Plata twice and Punta Cana was are second time. For $3600.00 Cdn per couple was too much money.", "title": "Married in Paradise!!!!", "helpfulness": 10, "user": "LoveLakeLiving4Life", "date": "February 11, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 5.0, "rooms": 5.0}, "id": 13467458, "likes": {"liked": "— Staff was friendly, wedding was absolutely a dream come true!", "disliked": "— weather on week one, rainy"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "Love the beach third time to Punta Cana first time at the Bavaro Princess room was very nice the maid staff tried to please. The grounds are well kept our 11 year old grandson loved the kids club and made new friends staff there was great too. The best of all was Carlos the Apple Vacations Concierge he made everything come together he let you know that you were there to have a good time and he was there to assist. We have never had a concierge that found you to see what he could do to make your stay better. Carlos was there to see everyone off and make sure everything was they way it was supposed to be.", "title": "Bavaro Princess", "helpfulness": 3, "user": "stevenp63", "date": "April 8, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 157132676}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "This was relaxing vacation. Bring a big coffee mug with you so you don't have to go to the bar for the drink to often :-). To my surprise, the waiter would even walk on the beach to take your order. We book our trip with Apple Vacations. Everything was as promised. We flew to La Romana airport because it was much cheaper then going to Punta Cana airport. The transfer bus was waiting at the airport. The ride took about one hour. Check in at the hotel was very quick and we went straight to the buffet. The Apple concierge, Carlos, was very helpful.The resort is very big and beautiful. It was like staying in botanical garden. My 5 year old son enjoyed the walk trough the Ecological Passage were we saw iguanas, rabbits, lots and lots of turtles, and all kinds of birds. There were days when we were tired so took this train (car) that was shuttling people from main lobby to the beach. If you have small children, ask for the rook as close as possible to the beach. They had lots of supervised activities for children that we didn't use because our son only wanted to jump in to the waves or swim in the pool. Bring lots of sunscreen lotion and apply every hour, you can get sunburn very quickly.", "title": "Family vacation", "helpfulness": 1, "user": "Martina S", "date": "April 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 157127222}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "Want to thank Carlos for checkingon us daily (if not twice a day) during our week long vacation. Our questions and concerns wer addressed favorably (nto that there were many, if any). Carols is an asset to the Bavaro Princess Company. His talents far exceed his position. The restaurants/food was exceptional. The beach was beautiful.Would highly recommend.", "title": "2013 VACATION", "user": "gaylynk_13", "date": "April 8, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 157022485}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "For the second year in a row we vacationed at the Bavaro Princess during winter break. I was with my wife and feel very good and PROFITABLE. Nearly resort I visit local Casino and win 6000 $. When you play don`t drink a lot of beer )). Perfect beach and blue sea. The service goes above and beyone your expectations.The staff at all the restaurants and even the ground and room maintenance staffs were great. This was the best resort and it actually had the best staff and grounds.", "title": "Perfect place", "helpfulness": 1, "user": "Alex B", "date": "April 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 156982554}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "Father and two sons ages 9 and 11 had a great one week vacation over the Easter break via Apple Vacations. The beach here is fantastic, with a nice pool and lovely grounds. The renovated room was clean and easily accommodated three. This is a large resort that requires lots of walking to get to the beach or lobby bar/restaurant. Jordan and the animation team were great and always invited children and adults to participate in organized activities such as beach soccer, darts. etc. Activities were not focused on drinking games as at some other resorts. One day there was a class on beach landscape painting that was particularly unique and interesting. They also worked hard to create things to do in the lobby area on rainy days. A talented band played live music on certain nights, but some of the evening \"shows\" were cheesy. Food was fair and often over cook. The buffet by the beach was best for breakfast and lunch, but service to get a needed drink, fork or napkin was absent. Poke around and you can find something decent to eat--made to order grilled steaks, pork chops or dorado at most meals. Most of the ingredients used at the resort were frozen or canned products. There were special lunches prepared outside some days by the beach--paella or barbequed chicken and ribs. For dinner, Chopin was a lesser version of the main buffet. The \"specialty\" restaurants were nice to look at or to enjoy sit down service, but universally bad with only a handful of decent dishes at each if you order things with basic proteins such as fish, steaks and chops. I cannot understand why any one would go to the Caribbean to eat truly bad and inauthentic Asian, Mexican or Italian food at a buffet or restaurant that is far worse than what you can find in any local place in Philly, NY, Chicago, Boston, etc. Tip graciously and form a relationship with a waiter/waitress or two at the main buffet for breakfast and dinner and they will take good care of you throughout your stay. All bars serve inexpensive local spirits such as rum or vodka for typical fruity summer drinks with the exception of the lobby bar which offers several well known popular international brands. Finally, the worst part about the place is that they only offered one working catamaran for sailing at the beach in a resort with 800+ rooms--what a joke. Enjoy", "title": "NICE BEACH, GOOD PEOPLE, BAD FOOD & NEEDS SAILBOATS", "user": "RNRBARRY", "date": "April 7, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 156920966}, {"rating": 4.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "Everything was wonderful about the Bavaro Princess except the food. The hotel was nice and clean, the beach was beautiful. The staff was very friendly although they speak very little english. We stayed for 3 nights and 4 days and that was a perfect amount of time. There isn't a lot of night life so you might get bored after a little bit of time. I would recommend going on some of the excursions the hotel has to offer. The dolphin swim is fun and so is the marinarium party boat! My one word of advice is if you have a weak stomach DON'T EAT!!!!. After two days, I got horribly sick. With throwing up, diarheaa and the chills..I had to go to the medical clinic to get antibiotics and a shot. I was able to make it on the plane home but it took at least 5 days to feel better. I advise drinking only bottled water. Don't put any ice in the drinks. and stay away from fruit, salad and meat. Although my boyfriend didn't get sick at all. Other than the food..my experience was great..", "title": "Great Place, Bad Food", "helpfulness": 7, "user": "hurleyj19", "date": "February 1, 2007", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 6725835, "likes": {"liked": "— the beach", "disliked": "— the food"}}, {"rating": 2.0, "title": "trust the reviews...don't take a chance", "text": "I just got home last night from the Bavaro Princess, a group of us went for a wedding. Most of our group have travelled to the Caribean many times, so please consider this when reading this review. This is a beautiful, very large property, immaculately kept. The trolley system was very efficient. The beach is also out of this world, you can go for long long walks. The ocean was somedays very rough, great if you were careful, not safe for little kids.", "helpfulness": 11, "user": "Hofster", "date": "January 31, 2007", "id": 6720509}, {"rating": 5.0, "title": "Great Place......", "text": "Our rooms were in a less desirable part of the resort, right along the roadway. While they were conveniently located close to the lobby the rooms were not nearly as nice as others. The maid service was horrible. We had our room cleaned for only the first four days and then no one came in! By our last day we had one towel left!!! The one good thing about our room location was that there was a nice pool right behind our rooms with it's own bar....was very peaceful and great for kids. Pool could have been cleaner, was very slippery at waters edge. Potentially very dangerous. The market right outside the property was less than average. The resort had cheaper trinkets to buy.", "helpfulness": 12, "user": "fofomaid", "date": "January 31, 2007", "id": 6720474}, {"rating": 1.0, "stay_parameters": "Stayed January 2007, traveled with family", "text": "The worst part of this resort was indeed the food. THis is no joke, if you have not yet booked your trip my humble advice is to go to another island. About a quarter of our group were very ill. This seemed to be true for any group of people we met. On the trolley everyone was talking about who in their group was ill. I agree with other reviews when they say they don't know why this is because even those who were exceptionally careful got sick. No one needed to see the doctor but they lost 2-3 days of their trip. I noticed that food, mostly from the grill/McPrincess was not cooked properly. Burgers were raw as was the chicken. I don't think the food is kept hot enough. THe buffet at the beach (the indoor one) seemed better as some of the food was clearly cooked better. The drinks were good but we stayed away from the ice. I always asked for my grilled food to be well done.....no one seemed to understand this...or never paid attention.", "title": "Bavaro Princess Hotel - No No", "helpfulness": 6, "user": "Chaudron", "date": "January 30, 2007", "detail_rating": {"front_desk": 2.0, "service": 2.0, "cleanliness": 3.0, "value": 1.0, "rooms": 1.0, "location": 3.0}, "id": 6716566, "likes": {"liked": "— Beach", "disliked": "— Food"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "The staff were friendly enough. The shows were less than average. Same old resort fare. Very amateur in comparison to other shows we have seen in the Caribean.", "title": "Go Platininum!!", "helpfulness": 22, "user": "chica_bonitawpg", "date": "January 29, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 6713216, "likes": {"liked": "— Platinum services", "disliked": "— energy efficient lights"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007", "text": "Traveled with a group of 28, 10 high school seniors and parents April 6 - 13, through Apple/Cleveland. The only complaint would be cooler water and little water pressure at prime shower times, but the cool water felt good on sunburned skin.", "title": "A week in Paradise!", "helpfulness": 7, "user": "PeggyOhio", "date": "April 16, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7368709, "likes": {"liked": "— The beach and the service, food, bartenders, etc.", "disliked": "— Can only go once in a few years."}}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "We heard of the fire before arriving and the staff did a wonderful job of compensating. Beach buffets on both sides of the beach with grilled hot dogs, burgers, steaks, chicken, pork chops, peppers, tomatoes, daily. We could also hop on the shuttle to Chopin or main buffet for wonderful lunches wtih all the fixings. Chopin was opened daily for breakfast, lunch and dinner as well as main buffet.", "title": "8 out of 10", "helpfulness": 5, "user": "Cohee2", "date": "April 14, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 7352152, "likes": {"liked": "— The staff", "disliked": "— The food selection"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled with family", "text": "The fire scene was boarded up, restrooms were still available on both sides of the beach as was a beach bar. Most people had to ask \"where was the fire?\" There was no ash, no smell, and little hammering, from where we found to sit near the beach or pool.", "title": "Loved it - we'll be back!", "helpfulness": 7, "user": "buzzard123", "date": "April 14, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 7351375, "likes": {"liked": "— the beach - you go to Punta Cana for the BEACH!"}}, {"rating": 2.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "We tipped for our first drink each day and received wonderful, and quick service always. No one out of 28, got sick. We ate fruits, veggies, cheeses, etc. Our seniors wanted to disco so we went to Areito, beside the other Princess hotels, and had a good, safe time. Some enjoyed the Casino. Dinner privileges at the other hotel - Le Petite Fondue, was enjoyed by all. We also enjoyed walking to the other Princess Hotels for lunch at the Crepery and drinks and dips in their pools. We were welcomed by their staff.", "title": "Beautiful, BUT.....", "helpfulness": 3, "user": "Jordonallie", "date": "April 14, 2007", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 2.0, "rooms": 4.0, "location": 4.0}, "id": 7351181, "likes": {"liked": "— The landscaping", "disliked": "— The food"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "We also took a snorkeling tour and the Safari Jeep tour, both were amazing!", "title": "The good ...the bad", "helpfulness": 16, "user": "steveyyc", "date": "April 10, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 3.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 7308151, "likes": {"liked": "— beach, rooms, grounds", "disliked": "— food"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled with friends", "text": "After reading the reviews....we were a bit worried about going to the Bavaro Princess.......but do not believe the negative reviews this Excellent hotel is getting......It's fabulous.... This was our 5th trip to the Dominican and believe me the BEST one of all. This is a true 5 star resort.... It's a bit older yes.....but they really know how to treat people right at this resort. They really impressed me and I am very fussy. The service they give is amazing... from the food to the amazing staff ....everything was perfect. This is a huge resort and we NEVER had to wait in line for anything.... No lines what so ever for drinks or making reservations at the Fabulous a la carte restaurant.... The Japanese one was the BEST. Great food and excellent service. We even had a guy walk on the beach every day handing out bottled water..... what service!!!! The best bartender ever is at the swim up bar. Julio is the best, he's very entertaining and a blast. He made sure that everyone had fun and plenty to drink all the time. We could not wait to go at his bar everyday around 4 pm. We had enough of the beach and wanted great fun and excellent drinks so we went to the swim up bar everyday.... and had lots of fun. What more could I say... this was our best vacation ever.", "title": "Best Vacation Ever!!!!", "helpfulness": 17, "user": "BeachloverMoncton_NB", "date": "February 7, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 13365027, "likes": {"liked": "— The service.... absolutely a true 5 star", "disliked": "— Nothing......would not change a thing"}}, {"rating": 2.0, "stay_parameters": "Stayed December 2007, traveled with family", "text": "Think twice before you buy the tour to Bavaró Princess All Suites Resort, Spa & Casino in Punta Cana, Dominican Republic.", "title": "Think more then once before you make yore choice", "helpfulness": 10, "user": "RussToronto", "date": "February 5, 2008", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 2.0, "cleanliness": 3.0, "value": 1.0, "location": 3.0, "rooms": 1.0}, "id": 13285991}, {"rating": 4.0, "stay_parameters": "Stayed January 2008, traveled with friends", "text": "First of all it is not 5 star resorts. Somewhere below 4 star. It doesn’t worth the money they ask.", "title": "Beatiful beach and the most friendly people", "helpfulness": 9, "user": "sostressed", "date": "February 4, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 13258252, "likes": {"liked": "— beach, food, people"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "The resort is very old, requires a lot of investment into the repair and maintenance. The first phase of resort was built in 1992; the second phase was built in 1994. You can see that everywhere, whether you are in the room or outside.", "title": "Good times at the Bavaro Princess", "helpfulness": 7, "user": "trinity10_29", "date": "February 3, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 13238127, "likes": {"liked": "— The beach", "disliked": "— The tired lunch menu everyday- and the fact that they didn't tell us we need reservations on Christmas eve."}}, {"rating": 4.0, "stay_parameters": "Stayed March 2006, traveled as a couple", "text": "When you walk to the front or use shuttle service to get to the front you passing water treatment plant: very strong smell of rotted eggs.", "title": "Beautiful Resort", "helpfulness": 6, "user": "tcbernier", "date": "February 1, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 13184033, "likes": {"liked": "— The beach", "disliked": "— Rooms were a little old looking"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "My girlfriend and I recently got back from the Princess bavaro Hotel, Overall we had a good time the hotel is beautiful. Althought there were a few things would were not that impressed with. The first thing we had problems with was walking to our room at nigh time. As we went to the hotel during the slower season a lot of the lights on the path were turned off. We complained for the first 4 nights until i finally realized I could turn the lights on by screwing the light bulb in. At that point I went around the paths turning them all on.", "title": "Helpful Hints to make your stay more enjoyable!", "helpfulness": 24, "user": "steve18", "date": "November 2, 2006", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 6048634, "likes": {"liked": "— the beach was really nice and the pools as well as the rooms", "disliked": "— the food"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "As well the a la carte restaurants were on a rotation because the hotel was not that busy. You have to wake up early to make reservations as the restaurants fill up before you get the chance to book. You would think they would open more restaurants once the hotel got busier but they didn't.", "title": "Bavaro Princess - Nice hotel", "helpfulness": 10, "user": "weatherhead", "date": "October 28, 2006", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 3.0}, "id": 6020859, "likes": {"liked": "— The Bungalows were independant to the hotel - not crowded ontop of each other", "disliked": "— The entertainment"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "The hotel was so big you have to take shuttles to go everywhere. We were in the newer section which happened to be a honeymoon sweet, the room was really nice and a fairly descent size. and when we asked to move closer to the beach, they said we could but they didn't have any honeymoon sweets closer. In the end we stayed in our room as it have a Jacuzzi in our room and we were close to the main lobby.", "title": "Go for the Beach!", "helpfulness": 11, "user": "vancouver1972", "date": "October 22, 2006", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 5984604, "likes": {"liked": "— suite was right behind the beach", "disliked": "— entertainment"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2006, traveled as a couple", "text": "The beach was amazing and the water was so warm. Also there are two pools. The one near the beach has the swim up bar and is more busy, while the pool closer to the main lobby is smaller although when we went it was a lot less noise so it was nice to sit by the pool there and relax with all the noise.", "title": "Bavaro Princess is Wonderful-Go Platinum!", "helpfulness": 34, "user": "arayl", "date": "October 17, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 5964066, "likes": {"liked": "— Everything", "disliked": "— We had such a wonderful time, nothing seemed to be negative"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2006, traveled as a couple", "text": "The food was alright, Nothing really impressed us and the desserts where not good. The hotel stops serving breakfast at 10:00 which is unfortunate if you like sleeping in.", "title": "Honeymoon Heaven", "helpfulness": 17, "user": "Mrs.VanLimbeek", "date": "October 11, 2006", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5939019, "likes": {"liked": "— Huge room", "disliked": "— when we first arrived there was a moldy smell but they fixed it"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2007", "text": "I'm wondering if these people who rated this resort at a 1 stayed at the same place I did. No, most of the employees did not speak fluent English. No, the rooms were not pristine (they're 20 years old!!). No, the food was not what you'd see at an American restaurant. But if I wanted Outback steak served by a perky blond at a Hilton hotel, I'd have booked a hotel IN THE STATES. If you're an adventurous eater, there's plenty to experiment with at the buffet. If you're not, there's plenty of safe food at the buffet as well. Try the custom-assembled pasta....", "title": "Very nice vacation", "helpfulness": 8, "user": "shel3364", "date": "October 16, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 3.0, "location": 5.0}, "id": 10086136, "likes": {"liked": "— It was so easy to completely relax", "disliked": "— Got a little sick, but survived & didn't let it ruin the vacation"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "The staff was extremely friendly - I don't remember passing one employee who did not say \"Hola!\" The grounds were beautiful and safe -- we often made the long walk from the room to the buffet in the evening without once feeling threatened.", "title": "It has its Ups and Downs", "helpfulness": 24, "user": "lbrown1981", "date": "October 5, 2007", "detail_rating": {"front_desk": 1.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 10042827, "likes": {"liked": "— Beach, Landscaping, Gardeners & Housekeeping", "disliked": "— The front desk staff"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled on business", "text": "Lizards??? Be thankful for the geckos. Not only do they save you a ton of money on car insurance, they keep insects under control and are completely harmless.", "title": "Loved the Princess", "helpfulness": 6, "user": "qtcutter", "date": "October 3, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 10035666, "likes": {"liked": "— beaches, staff", "disliked": "— nothing"}}, {"rating": 3.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "I'd highly recommend taking the trip to Catalina Island. The snorkeling was fabulous, the beach was like something out of a Corona commercial, the food was great, and the boat crew on the trip home were hysterical.", "title": "would not return", "helpfulness": 9, "user": "HILNY", "date": "September 27, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 2.0, "value": 2.0, "rooms": 2.0, "location": 3.0}, "id": 10012899, "likes": {"liked": "— the beach", "disliked": "— not luxurious"}}, {"rating": 1.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "This is a place for anyone looking to unclench and just relax. Get up early to see the sunrise -- it's breathtaking.", "title": "Lizards/Bugs in the room", "helpfulness": 6, "user": "raynkj2go", "date": "September 19, 2007", "detail_rating": {"front_desk": 5.0, "service": 2.0, "cleanliness": 1.0, "value": 5.0, "rooms": 1.0, "location": 5.0}, "id": 8823577, "likes": {"liked": "— beach , grounds of resort", "disliked": "— our disgusting room"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "We only ate the buffet restaurants. We had reservations for the Italian restaurant for our last night, but by then I was so sick with some sort of food poisoning/fever that we could not make it.", "title": "Had a great vacation with the Bavaro Princess", "helpfulness": 14, "user": "Doc-L", "date": "September 16, 2007", "detail_rating": {"front_desk": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 3.0, "location": 5.0}, "id": 8724674, "likes": {"liked": "— beach, hotel grounds, food, staff, all inclusive", "disliked": "— check in, room"}}, {"rating": 3.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "The lobby buffet was ok - in general the lunch was better than the dinner. They had theme nights for dinner and they were pretty bad. They always had a pasta bar and an \"American\" theme bar, but the American bar was pretty gross looking. The nachos and french fries were ok, but that was about it. We had the beach buffet one afternoon and that was my favorite meal while at the resort. The view couldn't be beat and the food was good (the pistachio ice cream was my favorite). However, there's no air conditioning in either buffet restaurant and you spend most of the meal sweating.", "title": "Not Top Shelf, But Not the Bottom of the Barrel- Go and Enjoy", "helpfulness": 4, "user": "funNewJersey", "date": "September 8, 2007", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 3.0, "rooms": 4.0, "location": 4.0}, "id": 8675887, "likes": {"liked": "— beach and pool area", "disliked": "— food"}}, {"rating": 3.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "DRINKS", "title": "Beautiful Grounds", "helpfulness": 6, "user": "AlbertaPrivateEye", "date": "September 6, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 5.0, "rooms": 5.0}, "id": 8665939, "likes": {"liked": "— lack of real service"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2006", "text": "Vacations are, first, a state of mind. It’s a time off you’re taking in order to relax and leave your problems home. You chose DR, not Hawaii, Arizona or California.", "title": "Vacations in Paradise", "helpfulness": 50, "user": "Laval076", "date": "April 2, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 4.0}, "id": 4827698}, {"rating": 4.0, "stay_parameters": "Stayed March 2006", "text": "We spent two wonderful weeks (March 9 to 23) in Bavaro Princess and still looking for the majors problems described by many unsatisfied customers.", "title": "Pretty Good Vacation", "helpfulness": 31, "user": "Jerseygrl52", "date": "March 31, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 2.0, "service": 5.0}, "id": 4824614}, {"rating": 4.0, "title": "Not disappointed.", "text": "The grounds:", "helpfulness": 25, "user": "A TripAdvisor user", "date": "March 30, 2006", "id": 4823188}, {"rating": 4.0, "stay_parameters": "Stayed March 2006", "text": "Gorgeous and clean. From sunrise to sunset, there are gardeners working to make sure that everything is absolutely perfect! Gardeners are offering you coco nuts (excellent with rum…) with a smile in extra. Give them a dollar and a smile and you will make their day.", "title": "Great Time in Punta Cana", "helpfulness": 14, "user": "Celeste F", "date": "March 30, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 4823075}, {"rating": 5.0, "title": "Paradise", "text": "In the main building area, there are plenty of birds: peacock, geese, ducks, herons, flamingos and other that I'm unable toidentify. All the birds are friendly and begging you for bread. In the pound, there’s a fight between fishes and ducks for the bread you throw at them; pretty amusing!", "helpfulness": 21, "user": "A TripAdvisor user", "date": "March 30, 2006", "id": 4823042}, {"rating": 4.0, "title": "Wonderful Vacation!", "text": "I cannot wait to go back to Punta Cana!! My boyfriend and I were there July 18-21st celebrating his 30th birthday and had an amazing time. We went through Apple Vacations and were very pleased with our package. Although, I do wish we would have booked a whole week instead of only 4 nights! We decided not to upgrade to platinum and ended up happy with that decision. I LOVE the Dominican people, they were extremely friendly to us. In Chicago, no one says hello to you on the street unless they want something, I felt like these people were genuinely nice. I speak very little Spanish and could still communicate pretty well. One man climbed a tree and cut a coconut down for me to drink out of! It was really neat! Our room was clean and spacious. We weren't really concerned with the room, since we were outside almost all day. One morning I left a note asking for more towels and an extra pillow and by the time we came back that afternoon, it was all there. One good tip that I got from this site was to arrive with a few phrases already written out in Spanish (very helpful when I asked for the towels and pillow!) Our fridge was refilled everyday with more Coke, Sprite, and beer so there was no problem there. I didn't think the walking was that bad at all? I actually enjoyed it! The scenery was beautiful! We spent a lot of time on the beach and at the pool bar. The beach is absolutely gorgeous. We didn't have any problems getting drinks, we had more than enough!! We ate at the buffets quite a bit and always left full. I consider myself a picky eater and I always found plenty to eat. We only made reservations on two nights. We ate at El Guacho one night and had a great steak dinner. We also ate at Chopin one night and it was a lovely atmosphere. Neither one of us were sick while we were there, even though we came with lots of pepto and immodium just in case! We were very careful not to use any of the tap water. They give you plenty of bottled water so you can brush your teeth with that and not worry. We went on two excursions, the speed boat tour and the Saona Island trip. At first I wasn't all that excited with the speed boat idea, but my boyfriend really wanted to do that. It turned out to be such a fun day! You get to drive the 2 person speed boat for a while and then a bigger boat picks you up and takes you to a snorkeling site. It was awesome snorkeling! I have never seen such a beautiful coral reef and all the tropical fish were unbelievable! The Saono Island was a lot of fun too. First, you are taken out on a speed boat to a natural swimming pool in the middle of the ocean where you can see huge starfish. Then they take you to the island and you have a couple of hours to shop and eat lunch. They prepare an island bbq for you and it was really good. They also had some dancers and a couple of bars (this is all still included in your package, I couldn't believe it.) Then it's basically a booze cruise back. They play music and there is drinking and dancing. I felt like the excursion were a really good way to meet other people from the different resorts. The speed boat tour was about $60/person and the Saona was about $80/person. I felt like both were worth the money. I tipped the housekeeping staff with cash and souviners from Chicago and they seemed very gracious. I also brought little things for kids like school supplies and hair bows. If you go on the excursions you really see how poor the country is. We tipped the bartenders every few drinks and thought that it was fine. Be careful with the mamajuana! Although, try a shot of it with coffee, it was pretty tasty, I would have never guessed! Overall, we just had a great time! Feel free to email me with any questions!", "user": "Stina76", "date": "August 15, 2007", "id": 8431728}, {"rating": 1.0, "title": "Honeymoon gone Bad", "text": "We went to the Bavaro Princess Resort for our Honeymoon. We got there on July 30 through August 4th I hated every day and couldn't wait to come home. Our trip started out bad and kept getting worse. We got into the Dominican Republic airport 2 1/2 hours late after sitting at the PHL airport for way too long. We meet our transportation which was this mini van who took us to the hotel with only us in the vehicle and a spanish speaking driver. The worse thing about this hotel is that ever one speaks spanish and very little English. The entertainment is all in spanish the music is in spanish. The service is terrible and trying to communicate with anybody is impossible. We purchased a honeymoon suite w/jaccuzzi. Arriving to the hotel they stated that they have no suites with jaccuzzi and gave us a room near the beach. I could care less that I was near the beach. I absolutly hated this resort I am so disappointed in my travel agencies and the VIP services who did absolutely nothing for us while we were there.", "user": "Kgreen28", "date": "August 15, 2007", "id": 8431075}, {"rating": 1.0, "title": "never again", "text": "My husband and I just came back from Bavaro Princess last Saturday. It was all we could do to get out of that hotel. We even paid extra just to get home early. This vacation was one of the biggest disappointments ever. I wish I had read the postings on this website before we booked our vacation. Although from the appearance of our room it looked liked it was very nice. Just wait until the middle of the night when the cockroaches come out. It got to the point where I made my husband go on bug duty before I could even use the bathroom. We saw several roaches scurrying for cover when we turned on the lights in the bathroom in the evenings. Some mornings we would even find dead roaches lying on the floor in the main room....YUCK! Both of us would wake in the morning with bites on our legs, backs, and sides we're sure there must have been bed bugs. Service at this hotel is almost non-existent. Although we were only the 4th couple in line we waited over an hour to check in. While dining in the restaurants we were lucky if we could even get our water glasses filled. The food in the restaurants was mediocre at best. Not sure if I got a touch of a bug from the food or just an upset stomach. The Japanese restaurant however, was VERY good. The beach was beautiful. Be warned though...if you are sitting under a palm tree or a tiki hut you will most likely encounter spiders crawling on you while you rest. This would probably happen at any beach though. The non-motorized water activity stand that was supposed to be included required a deposit for any equipment you wanted to use. Sure it was only a deposit but the whole point of the all-inclusive is that you don't need to carry any money with you. Also fellow guests were VERY rude at the beach. The days we went to the beach we arrived between 8:30 Am and 9:00 Am the beach itself was practically empty however people had come by and placed their belongings on the prime real estate lounge chairs then don't come back until 11 or 12. This is not fair to the people like us who are there at the beach to actually use the chairs. Although hotel policy states that unattended belongings left on chairs for more than 30 minutes will be removed this does not happen and we had even gotten into an argument with a couple after we had been accused of stealing their chairs although we had been sitting in them for 90 minutes already. The pool seems to have the same situation regarding chairs although we did not spend much time at the pool. One evening as we left the seafood restaurant we looked at the empty pool floating in one end was vomit, noodles actually floating in the water. The pool was already closed for the evening at this point and maintenance crews were adding the chemicals. Why they weren't removing the vomit I don't know. Also, on Tuesday a baby snake had fallen from the grass roof above the swim up bar into the pool. I hate snakes. These two incidents were enough to keep us out of the pool. Finally, the worst part of our vacation. My husband developed a large red spot on his forehead during our second full day. We initially thought this was some sort of spider bite as we had fallen asleep on the beach. As the days passed it grew larger and larger finally on Thursday night we decided we needed to get home so he could have it looked at by a doctor back in the US. We messed around with the apple reps for so long on Friday morning that we weren't able to make any of the flights out that day. We finally said fine put us on the first flight back to the US on Saturday morning, we don't care what city it flies into we'll figure out how to get home from there on our own. We were told that flight had 3 seats available. We said great we'll take that flight only to be told we could not be guaranteed this flight we would have to go stand-by! In the end it worked out and we did get on the first flight out Saturday morning. After a long day of traveling on Saturday my husband decided to take some Benedryl for the \"bite\" on his head Saturday night and get to the ER first thing Sunday morning. Sunday morning the swelling on his forehead had spread and he could barely open his right eye. When he got to the ER the doctor told him that it was not a bite after all, instead he had contracted some sort of infection. We still don't know what it is whether it is viral or bacterial he is on antibiotics for both for the next 7 days. We are uncertain for sure on how this infection was contracted but we do have a guess. When we were at the beach on Monday, our first full day we were approached by the hotel photographers to have our picture taken with their monkey. We thought it would be a cute picture. It was a cute picture we actually bought a copy from the hotel that evening. However, it seems very likely that as the monkey moved from sitting on my husbands shoulder up to sit on the top of his head the monkey may have inadvertently scratched him on the forehead thus contracting the infection. Be warned to stay away from any animals while in a foreign country you never know how well they are taken care of in terms of illnesses.", "user": "j_williams77", "date": "August 14, 2007", "id": 8423398}, {"rating": 2.0, "title": "Good to Bad to HORRIBLE.. NEVER AGAIN", "text": "OK soo my boyfriend, 22, and I, 20, just got back from a weeks stay at Bavaro Princess. Prior to going I have been reading all the good and bad reviews and I felt like I kinda new what to expect. So getting to PUJ airport was kind of a breeze. We didnt have to wait very long, we just stood in line paid the 10$ went to find our luggage and found our tour Bus which was VIP tours the guys in the yellow shirts. When we were dropped off at our hotel a man told us to go check in and he would meet us later at our room but we couldnt take our luggage. SO i was a little uspet that I was leaving all my belongings in the hands of this guy. So we took a tram to our room, 277, and went in and liked what we saw. The room felt pretty cool and seemed to be decently cleaned. Our luggage took about 20 min to get to us, we unpacked, and went to the lobby to get some food from the buffet. The food was not so bad to me the first day. Then we got some drinks at the lobby bar and sat outside where the fountain was, sipping our Mai Tais and feeling the cool breeze. First day was great. Second and Third day werent bad either we went to the beach where they play music and got everyone up and dancing, then the pool where we enjoyed the pool bar (it does take a while to get a drink) ,we drank alot of drinks ( my favorite was the icee and blue coraco called a Blue Jay), and ate at the buffet and Mc Princess where the have burgers, hotdogs, and french fries. The fries were good but the burgers were blah. The buffet started to get worst for us though. It became harder to find foods that I thought were good to eat and safe to eat. The pizza is not good, burgers no, the fruit is gross, meat is sketchy. Some good food was the Fried Chix and the potatoes and rice. The second night they had dancing in the lobby with their house band and third night they had the beach party.It was fun but after that there wasnt much to do. We went to the casino 4 times during our stay and spent alot of money there playing the slots and tables but we also won some which was fun and the drinks are better at the casino and only cost a dollar or two.", "user": "Sammiegrl", "date": "August 13, 2007", "id": 8405932}, {"rating": 1.0, "title": "4th and last time!", "text": "The food- Every morning they have the same buffet, Omlet station which was good, potatoes, beans, bacon (good), crossoints and rolls, and more eggs. It was hard for me because I dont like eggs so I ate potatoes and bacon every morning. The a la carte restaraunt were good.", "user": "MattMOttawa", "date": "August 13, 2007", "id": 8405035}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "We were a group of 16 that went the end of March for a week, kids ages 8-16. All of us had a wonderful time. The kids were never bored, from being on the beach to the pool the animation team tries to get everyone involved. There was soccer and volleyball on the beach everyday, in the lobby they had pool tables.", "title": "Amazing and Beauiful", "helpfulness": 2, "user": "debkins", "date": "April 10, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 157313499}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "We tried most restaurants, and our least favorite was Bella Pasta, but the others we loved. The buffet at the lobby had different themes each night, and the buffet at the beach for breakfast and lunch was good. It was wonderful to eat breakfast or lunch right on the beach. Beach bbq for lunch everyday also...I loved the Paella!!", "title": "Our \"Second Home\"", "helpfulness": 3, "user": "Wayne P", "date": "April 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 157295983}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "Rooms were amazing! We loved the bungalow style of this resort instead of the typical hotel looking resorts. The bungalows made you feel like you had your own private rooms. The landscape was wonderful, and the ocean was beautiful! We would definately go to this resort again, and recommend it to others.", "title": "Beautiful and relaxing vacation!!!", "user": "bafer2", "date": "April 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 157247665}, {"rating": 3.0, "title": "Bavaro princess", "text": "We've been going to Bavaro Princess since Nov., 2001. We've been back many times since. We have tried several other places in the Dominican Republic, but always come back here. We have been using Apple Vacations lately. Everything you have read about the Apple Concierge (Carlos Felix) is true! He is absolutely wonderful. We've known him for several years now. Excellent service; meets you with at least once a day. Makes sure everything is just right. We went through check-in quickly. We know the resort so we did not need a detailed layout. Yes it is a big resort. The walk from the lobby to the beach is not too bad. I make it, and I'm 65 with bad knees. Great way to walk off breakfast. At least one walk back go through the gardens. Great photo opp with lots of birds and wildlife.", "helpfulness": 1, "user": "Maritimer2013", "date": "April 9, 2013", "id": 157218766}, {"rating": 3.0, "stay_parameters": "Stayed February 2013, traveled with friends", "text": "The pool area is quite large, with a walk-up pool bar that can get rather interesting by late afternoon. It's quite a melting pot, and we met people from Great Britain, Germany, France, Russia, and lots of Canadians - hence \"Punta Canada\" We also met a great group from Buffalo, NY. Don't worry about the language issues-a good party is the universal language! This vacation was a little different for us. We usually go with friends; this trip we took our kids (their second time) and one grandchild, so I spent a lot of time at the kiddie pool area off to the side a bit. The animation staff is just great with kids. My grandson got to meet some great people (Hi - Lee) from Liverpool, and some kids from France and another group from Britain. He now has some pen pals to share his experiences. The kids were kept busy all day, and I'm sure they all slept well at night. Definitely a great place for kids, with lots of activities for them. If they can hang, don't be afraid to take them up to the lobby at night. There is dancing and activities for them there also, before the band starts.", "title": "Women Beware", "helpfulness": 4, "user": "Envigorate", "date": "April 9, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 1.0, "rooms": 3.0, "location": 3.0}, "id": 157216377}, {"rating": 3.0, "stay_parameters": "Stayed March 2007, traveled with family", "text": "We traveled to this resort from 03/17-03/24 and the first night we got there the resort had a fire that took down 4 restaurants and a bar.Needless to say this had a dramatic affect on our stay. Their solution was to cut the 3 remaining restuarants in half as a replacement for the ones that burned down. This worked out horribly...Never enough room for reservations due to over crowding. The times were all screwed up. It was awful so I mainly stuck with the buffet which did have some good stuff. The rice was always good and the beef stew. Had lots of pasta.", "title": "Nice Resort!", "helpfulness": 3, "user": "sexyqj23", "date": "March 27, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7229568, "likes": {"liked": "— The room", "disliked": "— The food accomodations"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "the grounds are beautiful and well kept. The rooms were very nice and above average and always clean. The beach was stunning. BEWARE if you have children because this is a topless resort. I did not know that until I got there and I traveled with my 4 yr old. Made it rather uncomfortable for me to explain.", "title": "Tropical Paradise!", "helpfulness": 10, "user": "siderean", "date": "March 25, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 7218652, "likes": {"liked": "— lush grounds, huge rooms, great beach, good food", "disliked": "— nothing!"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "Entertainment was ok at best. Be sure to tip Edwin. Very good with children. Not much night life but about 5 mins away there is a good club called Mongu. It is wild. The resort is so big that walking is not an option. You must use the tram but for the most part were pretty frequent but hold on or you might be thrown off because they drive crazy. Overall, this was a nice resort but will try something else next time because I like trying new resorts every time I visit the islands.", "title": "Loved this resort!", "helpfulness": 8, "user": "Lyncal", "date": "March 24, 2007", "detail_rating": {"front_desk": 3.0, "business": 5.0, "service": 3.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7215147, "likes": {"liked": "— That is was not a typical hotel room", "disliked": "— Nothing"}}, {"rating": 1.0, "title": "BP Fire! Pix's included", "text": "My husband and I recently returned from a 1 week stay at the Bavaro Princess from Feb 27-March 6 and we can’t wait to go back! Like some others, we were so worried about this hotel from reading so many bad reviews. Having been there, all I can say about that now is…leave your whine at home, relax, you’re on vacation already!! Enjoy the sun, the beach, the food, and the beautiful grounds. Isn’t that what you came here for?", "helpfulness": 20, "user": "seaonk2", "date": "March 22, 2007", "id": 7201674}, {"rating": 1.0, "stay_parameters": "Stayed March 2007, traveled with family", "text": "We went with Air Canada Vacations which is all Platinum. Check-in was a breeze - we arrived at the Platinum Lounge at 12:30 pm and even though check-in is officially at 3pm, our room was ready for us. Our luggage arrived at the room from the lobby the same time we did! They gave us two icy-cold Presidente beers to take our rooms to enjoy while we unpacked.", "title": "Bavaro Princess Fire", "helpfulness": 5, "user": "locolocal101", "date": "March 21, 2007", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 1.0, "cleanliness": 1.0, "value": 3.0, "location": 3.0, "rooms": 1.0}, "id": 7197623, "likes": {"liked": "— The beach...", "disliked": "— everything else!"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2005", "text": "We just returned from the Bavaro Princess and feel we should tell our findings since this hotel seems to be getting every \"nit pick\" comment that may worry people who have booked this hotel.We have travelled to the Caribbean many times and have never been sick once.I overall cannot see how this resort can provide what it does without alot of hardworking employees going 24 hours a day in the intense heat with a present atmoshere.We are fussy spoiled Canadians who eat in restaurants probably 5 days a week.The steak at elGauchos was better than any we have eaten in 5 star restaurants in Toronto.The breakfasts in the main dining was amazing the whole week.If you go to elGauchos,say hi to \"Freddy\" from Canada.We gave him a key chain from Canada and he cried,he was so happy.The beaches in Punta Cuna are the best in the world,the grounds were so well looked after,you will wonder how they do it.It does not have the \"brand new\" room look but they are beautiful still and we were very comfortable with it.The security in the hotel is an issue for us,they had 24 hour guards at all points of entry which put my mind at ease.I highly recomend the Bavaro princess to anyone!", "title": "what's the fuss about!", "helpfulness": 25, "user": "three_of_us_10", "date": "July 3, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 3632188}, {"rating": 4.0, "stay_parameters": "Stayed June 2005", "text": "I have sat here for an hour reading all the bad reviews posted about this hotel and am absolutely appalled. I have just come back from my honeymoon and we stayed here from June 20 to June 28 2005 and had an absolutely fantastic time! The grounds are simply breathtaking, so well kept and maintained on a daily basis.", "title": "I'm shocked and appalled at all the bad reviews. Its a great hotel!", "helpfulness": 25, "user": "KathP24", "date": "July 1, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 3625132}, {"rating": 5.0, "stay_parameters": "Stayed May 2005", "text": "I have read comments about 'lazy' and 'unhelpful' staff - this couldn't be further from what my husband and I experienced. Our waiters and waitressess varied depending where we dined, but we found all to cheerful, cooperative and outrageously hard working. We saw the same staff at breakfast, lunch and dinnner and then even saw them working the bar in the evening. These people are some of the most hardworking people I've ever had the pleasure of meeting. They would always bring us drinks on entering and would cater for any request.", "title": "Mucho Bravo for the Bavaro Princess", "helpfulness": 29, "user": "PTS21", "date": "June 30, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 3623028}, {"rating": 4.0, "title": "Sunny and pleasant", "text": "The food in the main buffett restaurant I found a little disappointing on a couple of occassions and prefered to dine in the a la carte restaurants for dinner. Breakfast in the Hispaniola offered a wide range of food from omellettes, pancakes, cereals, breads, fruits, smoothies and of course, a cooked breakfast. The only complaint is that they tend to add too many herbs and spices which I find too much for breakfast. Lunch I found to be better at the beach buffett. Fresh rolls, fries, rice, salad, pizza etc. For dinner I would definitely recommend booking one of the a la carte restaurants as hispaniola was average in the evenings. Sakura and Bella Pasta both served excellent fresh food to your table. One word of warning though, avoid the seafood place El Pescador! The smell alone will make you ill!", "helpfulness": 15, "user": "A TripAdvisor user", "date": "June 25, 2005", "id": 3611277}, {"rating": 5.0, "title": "Great resort, great beach, decent food, great staff", "text": "Our room was superbly clean with fresh towels provided every day. The maid always appeared around 3pm and was always talkative (although neither myself or my husband speaks Spanish, she would always try to communicate!) and very hardworking. There was no sign of rust or leaky taps or yellowed baths as I have read in other reviews. Two bulbs blew in our room and the electrician appeared on his little moped within 30 minutes!", "helpfulness": 17, "user": "panzarut", "date": "June 23, 2005", "id": 3607140}, {"rating": 4.0, "title": "Best Beach Ever", "text": "Stayed at the Bavaro Princess Suites March 4 to 11, 2006 through Apple Vacations. Found the Hotel to be beautiful, grounds especially, clean, service good, food about what we are used to in the Dominican Republic. No complaints. We go for the beach and of all I have been on it has the following advantages:", "helpfulness": 14, "user": "gracetesssam", "date": "March 21, 2006", "id": 4722437}, {"rating": 4.0, "title": "First time on a resort type trip", "text": "soft sand, doesn't get hot under your feet, miles of beach to walk on, no shells, no rocks, gentle sloap into the water, water colors are simply amazing and the temperature of the water in early March was cool to walk into but once in comfortable. Constant breeze makes the air temperature comfortable.", "helpfulness": 12, "user": "A TripAdvisor user", "date": "March 20, 2006", "id": 4715587}, {"rating": 5.0, "stay_parameters": "Stayed March 2006", "text": "Beautiful palm trees right on the beach, plenty of lounge chairs, food and drink steps away. Went with local beer (fine) she with wine (fine). Remember to take a larger container,(bring a large cup or cooler type cup from home. They will fill it up. Keeps you from waiting in line.", "title": "Loved the Bavaro Princess", "helpfulness": 10, "user": "siscam", "date": "March 20, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4705303}, {"rating": 3.0, "stay_parameters": "Stayed February 2006", "text": "Slight tummy upset on last 2 days. Nothing to ruin the trip. Don't know if it was the water (we drank the processed water in the room) or food (sometimes undercooked)", "title": "Food Poisoning", "helpfulness": 5, "user": "joyce F", "date": "March 18, 2006", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "service": 3.0}, "id": 4691253}, {"rating": 5.0, "stay_parameters": "Stayed March 2006", "text": "All an all an excellent, relaxing trip at a resort to which we would return.", "title": "Treated like royalty!", "helpfulness": 20, "user": "Dawn P", "date": "March 17, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 4629340}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled with family", "text": "My husband and I took our two children (12 and 9) for their first \"Big\" vacation here Oct 13th - 20th, 2007. My husband and I usually go to Jamaica and have never been to the Dominican so we were travelling with the hopes of not comparing the two. We were very pleasantly suprised (and admittedly a little relieved) when we arrived at the Bavaro Princess.", "title": "Beautiful Grounds And A Wonderful Atmosphere", "helpfulness": 11, "user": "Stallica", "date": "November 7, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 10678283, "likes": {"liked": "— The Beach, the Friendliness of Staff, Lobby Buffet"}}, {"rating": 2.0, "stay_parameters": "Stayed October 2007", "text": "Room: Clean, spacious and well layed out. The kids had a pull out sofa and a cot which were not in the way and offered everyone their own space. The bathroom is very large and despite some complaints we read on here we never ran out of hot water and the pressure in the shower was perfect. Our fridge was replenished daily with water, pop and beer. Our room included a liquor cabinet filled with a bottle of Vodka and Rum. We stayed in the Platinum suite with a great seperate lounge offering a fully stocked bar shelf, snacks, coffee etc., two computers with internet and a place to lounge while waiting for the trolley or planning the day. Our room was a very short walk to the beach and main pool and the trolley (if we didn't feel like walking) was right at the door to take us to the lobby if we wanted.", "title": "Not a 5 star like the brochure states", "helpfulness": 3, "user": "C0wb0y22", "date": "November 7, 2007", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 2.0, "cleanliness": 1.0, "value": 2.0, "location": 3.0, "rooms": 1.0}, "id": 10667858, "likes": {"liked": "— Close to the beach", "disliked": "— Dirty"}}, {"rating": 1.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "Grounds: Immaculate and there is always people busy working on them to keep it that way. This is a HUGE property, but it is extremely easy to get around. Take it all in, it's an amazing place.", "title": "RD not any more a travelling choice", "user": "loumas", "date": "November 6, 2007", "detail_rating": {"front_desk": 1.0, "business": 2.0, "service": 3.0, "cleanliness": 2.0, "value": 1.0, "location": 1.0, "rooms": 1.0}, "id": 10637036}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "Staff: Everyone was so friendly, always smiling. We do not speak very much Spanish, but they really appreciate you giving it at least a little effort. A simple \"Hola\" or \"Gracias\" goes a very long way!", "title": "Loved the resort", "helpfulness": 7, "user": "tch1717", "date": "November 5, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 10627753, "likes": {"liked": "— food and the grounds", "disliked": "— didn't really dislike anything"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "Food: Two Buffets, the buffet at the lobby was fabulous! The 2nd Buffet was conveniently located by the beach and main pool and was also very good. Yes, there were several of the same dishes every day but along with that there were many different ones daily as well! We did not go to any a la carte restaurants although we heard that Licey and El Gaucho are absolutely fantastic. We had NO complaints about the food and the service was pretty good. Especially in the lobby buffet.", "title": "Loved the Bavaro Princess", "helpfulness": 4, "user": "chbafo", "date": "November 4, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 10594214, "likes": {"liked": "— Beach and pool", "disliked": "— Time share rep. at front Lobby"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "All restaurants require reservations except for the main buffet just outside the lobby area. This restaurant is open for breakfast, lunch and dinner, serving many (mostly) american style foods. Latin style rice and beans were always present as well. Many items to choose from on every meal. THIS IS THE ONLY RESTAURANT THAT DOES NOT REQUIRE MEN TO WEAR LONG PANTS. The other restrauants all had many of the same items, with some variations. There was a Benihanna style Japanese restaurant which was very good. El Pescatore was the fish/seafood restaurant, serving fresh fish and lobster. Food also was very good. El Gaucho primarily was steak only. Chopin restraurant offered a very tasty and extensive buffet of meats and fish/seafood and desserts. This restaurant was on a lagoon and offered a piano player traveling on the lagoon. Unfortunately there was a problem with the boat when we were there and therefore missed the show. I thought the Italian restaurant was just ok. My wife like it. This restaurant served the least amount of food. Please note that most of the waiters speak little english, so communication is somewhat difficult, especially if you need to change your order.", "title": "Great Place", "helpfulness": 7, "user": "kroswell", "date": "September 5, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 8660125, "likes": {"liked": "— Beach and Large Rooms", "disliked": "— The size of resort overall"}}, {"rating": 1.0, "stay_parameters": "Stayed August 2007", "text": "If you like the beach, you must get there early. I got to the beach at 8AM to find a palapos. I found that many people will leave there towels at the beach early and never return, taking space that someone else could use. Inconsiderate people are all over. The beach and sand were soft and easy to walk on. The ocean was warm and most of the time, very calm. Kelp was prolific in the water and on the beach, but no shells. The beach is also top optional. There were many honeymooners present. Very few singles or children when we were there in early September '07.", "title": "Hated the whole trip", "helpfulness": 1, "user": "vacationqueen75", "date": "September 3, 2007", "detail_rating": {"front_desk": 2.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "location": 2.0}, "id": 8615210, "likes": {"liked": "— nothing", "disliked": "— everything"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2008, traveled with family", "text": "Our family of 4- kids aged 10 and 6 were at the Bavaro Princess from Feb. 14-21. The resort was 100% full and you could tell at the buffets and pool area. We did not get the platinum upgrade because it was $30 per day per person, which I did not see worth it.", "title": "Pretty good, not a 5 star though", "helpfulness": 1, "user": "mhuska1", "date": "February 24, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "location": 5.0, "rooms": 4.0}, "id": 13819854, "likes": {"liked": "— Beach, vegetation", "disliked": "— drinks, food variety"}}, {"rating": 2.0, "title": "My entire family was sick at the Bavaro!", "text": "The bavaro princess was a nice resort, beautiful grounds, birds, ponds, and the most beautiful big beach we have been to. The ocean here was great for the kids to play in, not too rough but still some waves for fun.", "helpfulness": 1, "user": "amandaL1969", "date": "February 23, 2008", "id": 13797801}, {"rating": 4.0, "stay_parameters": "Stayed March 2007, traveled with friends", "text": "A friend and I spend a wonderful week in at the Punta Cana - Bavaro Princess All Suites Resort March 1st - March 8th.", "title": "Wonderful Vacation", "helpfulness": 4, "user": "CaribbeanHappy", "date": "March 20, 2007", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 7193415, "likes": {"liked": "— size of the room", "disliked": "— steps"}}, {"rating": 2.0, "stay_parameters": "Stayed March 2007, traveled with family", "text": "After reading some of the reviews I was hesitant that we had not picked the best location for our winter vacation, however, we were very pleased with this complex. I believe some of the reviews that I read were mislabeled and as they did not describe Bavaro Princess All Suites Resort where we stayed.", "title": "disappointed....", "helpfulness": 4, "user": "brinj", "date": "March 20, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 2.0, "value": 1.0, "location": 5.0}, "id": 7193349}, {"rating": 4.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "Beach: The beach was great and there was plenty of shade when you needed it, however, most guest go down early and throw a towel or personal item on chairs and don’t return until hours later. We found that afternoon it was easy to find a shaded chair.", "title": "Great Relaxing Vacation!!", "helpfulness": 12, "user": "casin021", "date": "March 20, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 7192752, "likes": {"liked": "— the hotel rooms", "disliked": "— the restaurants"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2007, traveled with family", "text": "Rooms: the rooms were very large, this was our 5th all-inclusive trip with Apple and by far this was the largest room that we ever had. My only note is there are two sets of steps, so it you have trouble with steps this could be a problem. Yes, the rooms are old but the management does try to keep things in working condition. We had a few problems that were fixed with 2 hours of our arrival.", "title": "You MUST read if you are going any time soon!!!!", "helpfulness": 10, "user": "travelin'bings", "date": "March 19, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7189782, "likes": {"liked": "— Beach and resort lay out...oh and swim up bar!", "disliked": "— Food"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2007, traveled with family", "text": "Food: Please remember that when in another country most food with the exception of breakfast will not taste like our American food. This is the first place that I have had lobster so many times. The hotel had a party on the beach one night for all Apple Vacation guests that was great. We had linen tablecloths, linen napkins, waiters for drinks and a keyboard player and singer. Dance floor too, dancing within several feet of the waves, what more could you ask. The food was ok but the atmosphere was wonderful, full moon and all. You can go to ale cart restaurants every night if you wanted. The only restaurant I didn’t really like was Chopin. Sea Food Restaurant - the service was slow, they didn’t seem to understand was we were requesting, however food was very good. Sakura – great food, great service, my favorite. Buffet was a buffet, what can I say. Steak place – service & food good, don’t expect American beef.", "title": "Confused by mixed reviews? Here's the real deal!", "helpfulness": 35, "user": "I-Dawg", "date": "March 18, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 7186054, "likes": {"liked": "— open air terrace with chairs", "disliked": "— no music source"}}, {"rating": 2.0, "stay_parameters": "Stayed January 2007, traveled with family", "text": "The place is nicely located, the sand the beach WOW!", "title": "Stay away", "helpfulness": 3, "user": "travellers12", "date": "February 7, 2007", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 2.0, "rooms": 1.0, "location": 3.0}, "id": 6753056, "likes": {"liked": "— The beach", "disliked": "— The smell, the noise, dirty room"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "Why I'm saying to stay away. There is another resort being built next door. The jack hammer and construction noise is constant all day. Car alarm going on all day. On the first day, when I asked the hotel manager when the construction noises started in the morning and stopped at night, he played innocent and said we have no construction on our site at the moment. We found out that the noise starts early in the morning and goes on until late at night (after 10pm).", "title": "No Problem for us Excellent Resort", "helpfulness": 23, "user": "mimihere9", "date": "February 5, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 6748853, "likes": {"liked": "— The friendly people and service", "disliked": "— Didn't find a thing we didn't like"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "When we got there, after our flight was delayed for more than an hour, since we had to be at the airport for 2am when we finally got to Punta Cana, needless to say we were exhausted all we wanted to do was snooze for a few hours. Our room was not ready, the main desk promised that our room would be ready within the hour, they kept saying in 30 minutes (don't believe what they say). We finally got the keys to our room at 4:30pm.", "title": "A Perfect Vacation in Paradise!", "helpfulness": 34, "user": "sheriPA", "date": "February 5, 2007", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 3.0}, "id": 6745999, "likes": {"liked": "— Beautiful Beach, Friendly Service, Relaxing location.", "disliked": "— Food"}}, {"rating": 2.0, "stay_parameters": "Stayed January 2007, traveled with family", "text": "The rooms (ours and my sons) smelled like mold and you can't get that smell to go away. For some reason, unknown to me or my husband, we were told that they have given us upgraded rooms and not what was requested. We had a jacuzzi, which didn't work, no decor on the walls the nails were there but the picutres missing, a queen size bed as hard as the floor and we found some bugs in our sheets. We were at the main entrance area far from the beach. The maid doesn't always show up (even if you leave a tip every day), clean your own room and bring your own towels. I spoke with hotel manager and but that didn't help and the Sunwing rep couldn't care less. We had requested two joining room with 4 beds, with sitting area and kitchenette, near the beach, not at all what we got.", "title": "Mixed review", "helpfulness": 12, "user": "Karen", "date": "February 4, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 4.0, "rooms": 3.0, "location": 3.0}, "id": 6745164, "likes": {"liked": "— The beautiful grounds and pool area", "disliked": "— fact we got sick there...not sure why, but lots of people were sick."}}, {"rating": 5.0, "title": "Had a perfect week", "text": "The food is only good if you go where they make it for you, stick to the pasta and omelets and you should be fine. I didn't and got really sick. We saw cockroaches near the main buffet area. As others have said, the service is not great. Certainly not a 5 stars. You do have to reserve early for a seat in one of the restaurants. It maybe worth it if you want a nice quiet dinner but the food, not great.", "helpfulness": 26, "user": "garlicguy", "date": "February 3, 2007", "id": 6737422}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled with friends", "text": "I'm a little late writing this review. I had an excellent experience at this resort. The staff was extremely friendly and went out of their way to make us feel at home.", "title": "Great First Experience", "user": "lasierra20", "date": "April 21, 2008", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 15187286}, {"rating": 1.0, "stay_parameters": "Stayed April 2008, traveled with family", "text": "I highly recommend attending the orientation if you booked through Apple Vacations. At the orientation you learn about the different excursions and activities and you can also make reservations. I definitely recommend the Outback Safari excursion and do the whole day safari not half day.", "title": "Do Not Stay Here!!!! Warning!!! Save Your Money!!!", "helpfulness": 3, "user": "AJRKMR", "date": "April 19, 2008", "detail_rating": {"front_desk": 2.0, "service": 2.0, "cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "location": 3.0}, "id": 15149473, "likes": {"liked": "— bEACH", "disliked": "— Rooms stunk!!!"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled with family", "text": "I thought the rooms were nice and the bathrooms were big enough (was sharing with 2 other people, a girls getaway).", "title": "We Hated To Leave This Beautiful Resort", "helpfulness": 5, "user": "telecomnc", "date": "April 19, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 15142659, "likes": {"liked": "— All inclusive.", "disliked": "— Can't think of anything."}}, {"rating": 1.0, "title": "I do NOT recomend", "text": "The only thing I found frustrating was trying to get a palapa. People normally just set the towels on the chairs underneath and would never be there. We found better seating at the pool. However, the beach was beautiful!!!", "helpfulness": 2, "user": "BarbCoimbra", "date": "April 15, 2008", "id": 15046649, "likes": {"liked": "— the beach", "disliked": "— almost everytihing"}}, {"rating": 2.0, "stay_parameters": "Stayed April 2008, traveled with family", "text": "The food was better than I thought it would be based off previous reviews. I think people forget they are in a different country from their country and need to just relax and enjoy what is being offered to you.", "title": "Avoid this poorly run complex", "user": "daviddcx", "date": "April 13, 2008", "detail_rating": {"front_desk": 1.0, "business": 3.0, "service": 2.0, "cleanliness": 3.0, "value": 2.0, "location": 2.0, "rooms": 2.0}, "id": 15006521, "likes": {"liked": "— the beach", "disliked": "— the service"}}, {"rating": 2.0, "title": "Great resort...If you don't need to eat!", "text": "My boyfriend and I booked the platinum package at the Bavaro Princess during the week of Nov 19th/06 thru Nov 26th/06. We did a lot of research and read many reviews (the majority of which were on this website) prior to our departure. The beach was amazing, nice white sand!! The ocean water was warm and we spent a lot of time tanning on the beach. Every morning we went and had breakfast at the beachside buffet. The buffet in the main lobby was available as well, but we loved being by the water.", "helpfulness": 2, "user": "Sunshine2424", "date": "January 19, 2007", "id": 6621717}, {"rating": 2.0, "stay_parameters": "Stayed January 2007, traveled with family", "text": "The grounds are amazing! There are lots of palm trees and the maintenance staff did an amazing job tending to the grounds of this resort daily. The mini zoo at this huge resort is a nice added feature too.", "title": "never go back", "user": "biggorilla", "date": "January 17, 2007", "detail_rating": {"front_desk": 2.0, "business": 2.0, "service": 2.0, "cleanliness": 2.0, "value": 2.0, "location": 1.0, "rooms": 2.0}, "id": 6612911, "likes": {"liked": "— beach", "disliked": "— food"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "We were happy to find the rooms for platinum guests were very close to the beach. The maids cleaned them daily, however sometimes they were later than expected. In those situations we would just go to the platinum lounge and ask to have somebody clean our room. The maid did a fantastic job. We left them money, gum and suckers as a daily tip.", "title": "Platinum Upgrade worth it!", "helpfulness": 17, "user": "emcsube", "date": "January 16, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 6606045, "likes": {"liked": "— beach", "disliked": "— food"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "The rooms had free liquor dispensers stocked with vodka, rye and rum. Since the platinum lounge was literally right out our door, we took a lot of our booze from them. They carry Budweiser beer and premium liquor which is an added bonus for platinum package guests. We tipped them at the lounge regularly and any time they served us drinks. Platinum guests have access to 3 other resorts as well. You can book a variety of a la carte dinners at the Bavaro Princess and other various resorts through the platinum lounge. They arrange your transportation at night for the dinners between resorts. You can also take advantage of the beaches and bars at the 3 affiliated resorts as well! We frequently walked down to the Punta Cana Princess to lay on the loungers they have. Only platinum club guests were able to use this area which included HUGE white double mattresses with a white drape to provide some shade from the sun. We also had a massage that was included in our platinum package…DEFINITELY a nice added bonus!", "title": "Good resort!!", "helpfulness": 12, "user": "superchic", "date": "January 16, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 6604612, "likes": {"liked": "— Nice big rooms and friendly staff", "disliked": "— Food could be better"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2007", "text": "It was unfortunate that my boyfriend was extremely ill on Wednesday night (half way through our vacation). He was violently ill running a high temperature and throwing up constantly. I was scared, but the thing that helped him the most was drinking bottled water so he would not dehydrate. I went over to the platinum lounge to see if anyone had gravol or any other drugs to give him. I met a great couple from Sault Ste Marie. They went back to their room and returned with some gravol for my boyfriend. Even though he could not keep that down, it was worth a shot! The next day he was feeling better but did not want to eat anything besides bread. Later in the day he got his appetite back and celebrated that fact with a few drinks as well. Thursday we took it easy by the pool. Later the same evening we went to a great restaurant called \"EL GOUCHO\" at the Punta Cana Princess. This was the only meal we really enjoyed. Friday we did some parasailing, which was amazing!! Alas, Friday night my boyfriend was ill again, throwing up all hours of the night. My stomach throughout our trip was on and off. The smell of the buffet located by the water wasn’t very appealing either.", "title": "I thought this place was great!!!!", "helpfulness": 14, "user": "strawrae", "date": "January 15, 2007", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 6598720, "likes": {"liked": "— The platnum package benefits"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2006, traveled with family", "text": "Wanted to advise you of some good and bad points, along with a few problems with the Bavaro Princess resort, Punta Cana, D.R. during our stay, November 18-25, 2006.", "title": "A great holiday, but with some problems", "helpfulness": 8, "user": "Amigo_Paul", "date": "November 27, 2006", "detail_rating": {"front_desk": 2.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 4.0}, "id": 6182120, "likes": {"liked": "— The grounds", "disliked": "— Cockroaches in the room"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled with family", "text": "I also wanted to advise you of the great service my family & I received from the Signature tour representative, Wegge.", "title": "Great Resort", "helpfulness": 11, "user": "saveourpens", "date": "November 21, 2006", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6162688, "likes": {"liked": "— The beauty, the beach.", "disliked": "— The resteraunts."}}, {"rating": 3.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "Our party consisted of 7 guests, my parents, who are both seniors and my mother requires the use of a cane to walk and is unable to climb stairs, my daughter, my girlfriend and her sister and brother-in-law.", "title": "A little bit disappointed", "helpfulness": 16, "user": "Chicagokris", "date": "November 16, 2006", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 2.0, "value": 4.0, "rooms": 2.0, "location": 4.0}, "id": 6138957, "likes": {"liked": "— Size of room", "disliked": "— Dated and in need of updating"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2005, traveled as a couple", "text": "This was my second visit to the Bavaro Princess resort. I emailed (in Spanish, allowing for the difficulties in translation) the resort approximately 1 week prior to our departure to again request a ground floor room for my parents & daughter and that we all be housed in the same building.", "title": "You are definitely treated like royalty at the Bavaro Princess(Merritt B.C.)", "helpfulness": 19, "user": "Gurrrrr", "date": "November 10, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6093923, "likes": {"liked": "— The rooms are very spacious with a raised area leading to the bed", "disliked": "— Water Pressure"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "CHECK-IN:", "title": "Great, relaxing vacation in paradise", "helpfulness": 33, "user": "Sunseeker11", "date": "November 6, 2006", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 6077725, "likes": {"liked": "— Large suites, lush grounds, gorgeous beach", "disliked": "— Your vacation is what you make of it, don't let the little things ruin it for you. Be polite to the staff and they will be polite in return"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "I went with my now fiance (I proposed there) and found the Bavaro to be", "title": "Great time in the Dominican", "helpfulness": 2, "user": "LiminJoe", "date": "November 18, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 10892555, "likes": {"liked": "— The beach", "disliked": "— The plumbing"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "beautiful. The grounds were well cared for and the lobby gorgeous. My", "title": "one of the best", "helpfulness": 6, "user": "caribkid", "date": "November 14, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 10815806, "likes": {"liked": "— Pool bar", "disliked": "— the town outside the hotel"}}, {"rating": 2.0, "stay_parameters": "Stayed November 2007, traveled with family", "text": "travel agent booked through Apple and there was an Apple rep in the", "title": "Not What We Expected", "helpfulness": 4, "user": "FINANCEMAN", "date": "November 13, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 2.0, "value": 3.0, "location": 4.0, "rooms": 2.0}, "id": 10796061, "likes": {"liked": "— Room setup", "disliked": "— cleanliness"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled with friends", "text": "larger lobby area. This was both convient and comforting. The beach was", "title": "Beautiful resort, great food, outstanding!!", "helpfulness": 12, "user": "mommy2-3", "date": "November 13, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 10795073, "likes": {"liked": "— Spacious rooms, king bed, clean...", "disliked": "— The first day we had a little puddle in our room - the fridge door needed to be closed, that was it!!"}}, {"rating": 4.0, "title": "Quite an exprrience", "text": "the most beautiful I've seen. Plenty of room and seats to sunbathe. Our", "helpfulness": 2, "user": "Mariluvssun", "date": "November 10, 2007", "id": 10734312}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "Traveling with Apple Vacations made this trip very relaxing. Carlos, the Apple Vacations concierge at this hotel, checked in with us throughout our stay to ensure that our expectations were met. When determining whether to stay at this expansive resort, please take in to consideration that it was built in 1992. The resort is very large but very accessible. Most importantly, there was never a moment when we felt uneasy or unsafe.", "title": "Spring Break 2013", "helpfulness": 1, "user": "MegC117", "date": "April 7, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 156885945}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "The beach and pool were great. We saw staff cleaning the pool at the end of each day as well as in the morning. The shade umbrellas scattered around the beach and pool were perfect for lounging and napping. The only caveat with these umbrellas is the fact that they were occupied quickly and we needed to get to the pool early to find a seat under them. There was ample shade under the mature trees around the pool and beach as well, so there was always an alternative. Sales representatives for day excursions and jewelry vendors were easily diverted.", "title": "Spring Break 2013", "user": "MegC117", "date": "April 5, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 156688074}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled on business", "text": "The resort rooms and main buildings have been updated and are kept clean by the housekeeping staff. In our experience, the housekeeping staff visited our room each day. We were also able to easily request a convenient time for housekeeping to clean and replenish our fridge with water, beer, and soda.", "title": "great Hotel", "user": "natashulc", "date": "April 5, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 156677905}, {"rating": 5.0, "stay_parameters": "Stayed March 2013", "text": "As a traveler to an impoverished country, aside from the tourist industry, it is important to realize that great service and hard work should be acknowledged with gratuity. Employees at this resort work hard each day to make sure that they are providing the highest level of service to guests.", "title": "Punta Cana truly is the place to go!", "helpfulness": 3, "user": "dominicanlove4", "date": "April 4, 2013", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 156618683}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "My husband and I speak a moderate amount of Spanish, but slang in the DR is not European Spanish. Try to speak the language and staff will embrace your efforts. If this is still an issue for you, then download an app on your phone and use a translator. After all, many people in the United States ignorantly assert that everyone in our country should speak English. It is amusing to see reviews that state that staff at this resort in the DR as well as guests from Russia, France, and Spain should also speak English.", "title": "Unforgettable trip!", "helpfulness": 3, "user": "548RobynM", "date": "April 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 156548787}, {"rating": 3.0, "title": "Hot! Hot!! Hot!!!", "text": "Bavaro Princes - Punta Cana", "helpfulness": 19, "user": "annamontanaro", "date": "July 26, 2006", "id": 5513796}, {"rating": 4.0, "title": "Bavaro Princess is a jewel", "text": "July 17-24 2006 , travel with husband and 12 year old daughter.", "helpfulness": 31, "user": "cathytan", "date": "July 26, 2006", "id": 5513013}, {"rating": 1.0, "stay_parameters": "Stayed July 2006", "text": "Loved the hotel, staff was friendly, the beach breath taking the best in the Dominican.", "title": "Awful!!! & Experiences", "helpfulness": 17, "user": "SVNfigures", "date": "July 26, 2006", "detail_rating": {"front_desk": 1.0, "business": 2.0, "service": 2.0, "cleanliness": 2.0, "value": 2.0, "location": 2.0, "rooms": 3.0}, "id": 5512013, "likes": {"liked": "— the rooms, they were pretty big", "disliked": "— the layout of the property, you had to take a trolly everywhere"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2006, traveled with family", "text": "Felt like an outcast, big language barrier, 99% of the entrainment and staff are Spanish speaking. The Lion King Show was great.", "title": "A nice trip overall ....", "helpfulness": 30, "user": "angjohjoh", "date": "July 22, 2006", "detail_rating": {"front_desk": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 5496234, "likes": {"liked": "— Proximity to the airport, beach, the people at the resort", "disliked": "— The food was just ok, nothing to do for kids below teenage"}}, {"rating": 2.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "We did go in the middle of the summer, which was very hot, the only escape is your room with air conditioning, The showers in your room…or shall I say the drizzle as an excuse for a shower. The resort is open in the hot summer months, please have air conditioning in the restaurants, the food is hot, being kept warm under warm lights, the plates you put your food on is also hot, eating with sweet coming down your face is not very glamours, air conditioning would be great also in the public washrooms for that matter too.", "title": "Don't eat the food--Only Benefit...Lose wieght!", "helpfulness": 12, "user": "IUnFSU", "date": "July 20, 2006", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 1.0, "cleanliness": 1.0, "value": 2.0, "location": 3.0, "rooms": 1.0}, "id": 5489524, "likes": {"liked": "— The beach front", "disliked": "— the food"}}, {"rating": 3.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "But business is Business", "title": "Not all that great---READ IF GOING HERE SOON!!!!", "helpfulness": 10, "user": "tarsmith", "date": "March 21, 2007", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "location": 3.0, "rooms": 3.0}, "id": 7197162, "likes": {"liked": "— The Beach", "disliked": "— That we were not able to get frozen drinks on the beach since the fire, the hot water problem, and the fact that we had to pay $46 for a platinum bracelet cause it came off in the water on our banana boat ride."}}, {"rating": 3.0, "stay_parameters": "Stayed March 2007, traveled with friends", "text": "NO way can the capacity of the Beach Bar be replaced.", "title": "Fire at Bavaro Princess", "helpfulness": 5, "user": "BD61", "date": "March 20, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "location": 4.0}, "id": 7195081, "likes": {"liked": "— beach", "disliked": "— food"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "Also why there are no pix’s on this site?", "title": "Loved it! Great value!!", "helpfulness": 1, "user": "kariandsteve", "date": "March 20, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 7194628, "likes": {"liked": "— beach", "disliked": "— Noisy music played by the pool area, not relaxing."}}, {"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "OK Folks - I sincerely do not understand all the negative reviews on this property. My girlfriend and I went down to Bavaro Princess from Jan 12 - 19th. Before we went, I started reading the reviews posted here and began to worry. If that is the case for you, read this review. The following will be about as honest a review as possible. JUST REMEMBER, you are on vacation and you are in a different country....everything might not be like it is at home - which is WHY you are going on vacation.", "title": "The Good (actually great), the bad.....NO UGLY", "helpfulness": 62, "user": "Psleary", "date": "January 22, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6636640}, {"rating": 5.0, "title": "A true princess", "text": "Granted, there must be a couple of concessions that must be mentioned....we are relatively easy going, low maintenance people, open for new experiences and cultures, yet expect to be treated well while on vacation. So, here we go.", "helpfulness": 19, "user": "airit", "date": "January 21, 2007", "id": 6636266}, {"rating": 5.0, "title": "Did I stay at the same resort as these bad reviews?", "text": "Rooms/accommodations:", "helpfulness": 24, "user": "WITraveler69", "date": "January 19, 2007", "id": 6623436}, {"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "We found our room (Building 31) to be perfectly located - near the beach, main pool and most of the restaurants. We also found the room itself very comfortable with ample room for all belongings, and places to stretch out when necessary. The maid service was also very thorough.", "title": "This resort has improved in recent years.", "helpfulness": 19, "user": "Grandypink", "date": "January 19, 2007", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 6622574, "likes": {"liked": "— Location, beautifully kept grounds and gardens, Platinum Club, beach.", "disliked": "— Food at beach buffet got boring in second week, some staff less than enthusiastic."}}, {"rating": 2.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "Food and food service:", "title": "Never go back!", "helpfulness": 4, "user": "rac311", "date": "January 19, 2007", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 2.0, "value": 2.0, "rooms": 2.0, "location": 3.0}, "id": 6622399}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled with family", "text": "we went through apple vacations and thats always a friendly flight. resort in general was absolutely beautiful and everything was always clean and ready to go. the food was alright, nothing fancy and the restaurants were okay as well. the pool was clean and very big. there was a bar in the pool and the drinks were great. the beach was amazing, the sand clean without any rocks and the water very seethrough. the people there all spoke english and were a big help. id definetly encourage people to go there. no one will regret a trip like this. however, it's a trip for people over 18, theres just more to do that way.", "title": "bavaro", "helpfulness": 5, "user": "Dashacleveland", "date": "April 9, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7300735, "likes": {"liked": "— friendliness", "disliked": "— food"}}, {"rating": 1.0, "stay_parameters": "Stayed March 2007, traveled with family", "text": "We read the reviews but did not believe. This hotel is aweful.", "title": "Terrible Overall", "helpfulness": 11, "user": "Sabrina72", "date": "April 7, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "location": 2.0, "rooms": 1.0}, "id": 7290143, "likes": {"liked": "— the weather", "disliked": "— everything else"}}, {"rating": 2.0, "stay_parameters": "Stayed March 2007, traveled with friends", "text": "We are not picky, but this resort is horrible.", "title": "Re-book Now", "helpfulness": 10, "user": "AmyLynn230", "date": "April 4, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 2.0, "location": 3.0, "rooms": 3.0}, "id": 7280987, "likes": {"liked": "— gardens and scenery", "disliked": "— food"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled with friends", "text": "Our rooms smelled of mildew. We asked around and most people agreed that the rooms were smelly. The room also had little bugs and the matress smelled also. We have traveled all over and this was the worst hotel we have ever stayed at. The food was okay, but the service was terrible. The wait staff was miserable and rude. It took forever to get a cup of coffee. We requested a new matress due to a back problem, at first they told us no problem but they never gave us a new one and told us to sleep on the floor. The pool had 2 restaurants that burnt down a few weeks back and debris is all over the pool area. They were also jackhammering the entire time we were at the pool. The pools are also dirty and slippery around the edges because of the debris. The food on the beach is horrible with flies constantly swarmimg around. There was no nightlife, the shows were absolutley terrible, I could have put on a better show. This hotel is definitley not worth going to, it's worth spending the extra money on a better resort.", "title": "Fantastic", "helpfulness": 12, "user": "epfqc", "date": "April 3, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7278024}, {"rating": 4.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "Four restaurants burned down the week of 3/19 - and we were not informed until we got there. As a result, we were given the option to eat at two other facilities (Punta Cana Princess and Caribe Club Princess) via a golf cart \"shuttle.\" It was inconvenient, to say the least. However, you did have extra options of restaurants that otherwise would not have been available.", "title": "Love this resort", "helpfulness": 9, "user": "BFIBunny11", "date": "April 1, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 7266967, "likes": {"liked": "— Beach, rooms, people", "disliked": "— Complaining tourists, not a ton of nightlife"}}, {"rating": 2.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "1. Mylene was best Air Canada vacation representative we have ever had - very knowledgeable and helpful.", "title": "Anniversary vacation ruined!", "helpfulness": 2, "user": "Travel_proMontreal", "date": "January 14, 2007", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 2.0, "cleanliness": 2.0, "value": 2.0, "location": 4.0, "rooms": 2.0}, "id": 6594461, "likes": {"liked": "— the beach and the grounds", "disliked": "— food and entertainment"}}, {"rating": 2.0, "stay_parameters": "Stayed January 2007, traveled with family", "text": "2. Grounds and beach beautiful, Doctor on call nice, cleaning staff good and nice.", "title": "Be careful!", "helpfulness": 6, "user": "Papi17", "date": "January 12, 2007", "detail_rating": {"front_desk": 1.0, "service": 2.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 4.0}, "id": 6582449, "likes": {"liked": "— The room set up, all suites!", "disliked": "— The help at the resort"}}, {"rating": 3.0, "stay_parameters": "Stayed January 2007, traveled with family", "text": "3. Food generally dangerous - not being maintained at proper temperatures - this from my wife Ilene who is a professional dietitian. We both had food poisoning, despite being super careful! This ruined the last 3 days of our stay.", "title": "Very large resort", "helpfulness": 5, "user": "louiemiss", "date": "January 10, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 6573466, "likes": {"liked": "— beach", "disliked": "— pool cleanliness"}}, {"rating": 1.0, "stay_parameters": "Stayed January 2007, traveled with family", "text": "(We hardly drank alcohol and would have enjoyed an occasional glass of wine had the wine been decent - but wine offered was terrible.)", "title": "Do Not Stay Here!!!", "helpfulness": 3, "user": "Iowa_tourist", "date": "January 10, 2007", "detail_rating": {"front_desk": 3.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "location": 5.0}, "id": 6573367, "likes": {"liked": "— Beach", "disliked": "— Rooms, service and food where terrible"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2006, traveled with family", "text": "4. Room ok, but not deluxe - bathroom horrible - no water pressure for shower, old crusty shower spout, tub didn't drain properly - chipped, stained, would not take a bath - had to call 3 times to get draining issue fixed - first 2 fixes didn't work - disappointing.", "title": "Beautiful beach", "helpfulness": 11, "user": "Travel_lassy", "date": "January 9, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 6569444, "likes": {"liked": "— beach", "disliked": "— the food"}}, {"rating": 4.0, "title": "I Cried When We Left!!!", "text": "Hola!", "helpfulness": 33, "user": "OneWithTheOcean", "date": "July 17, 2006", "id": 5478037}, {"rating": 1.0, "title": "disgusting", "text": "My boyfriend and I just returned from a one week stay at the Bavaro Princess in Punta Cana. July 10-17 We traveled through Apple Vacations out of Pittsburgh,PA. Our weather was not the best, but that has nothing to do with the resort so lets get on with it!", "helpfulness": 6, "user": "A TripAdvisor user", "date": "July 16, 2006", "id": 5473264}, {"rating": 4.0, "stay_parameters": "Stayed July 2006", "text": "BEACH::::: The beach was absolutely breathtaking! There were plenty of charis, and although we were early risers there were always open palapas until about noon! We were usually the first to arrive on the beach around 7:00am, we pulled our chairs right up to the water, and relaxed. The beach was definately the cleanest of any surrounding resorts, this was probably due to the crew of 10-15 men who collected any garbage and actually raked away the seaweed in the early morning! They deserved the extra tip!!!", "title": "Nice place", "helpfulness": 21, "user": "freods", "date": "July 16, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 5469792}, {"rating": 2.0, "title": "a very mixed review", "text": "POOL::::: Although we spent most of our time at the beach, the pools were very clean and never very crowded, that seemed to be where the children liked to hang out.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "July 15, 2006", "id": 5468820}, {"rating": 4.0, "stay_parameters": "Stayed July 2006", "text": "FOOD::::: The food for me only gets one thumbs up. There were a variety of restaurants that were \"different\" styles of cooking and food, however they all tasted very similar to one another. One exception was 'Licey' the gourmet restaurant. It was FABULOUS! But it is at an extra charge unless you are Platinum ( Which I HIGHLY recommend!!!) There is also a restaurant called Sekura which we were very skeptical of, it is an Asian Bistro, but it was also very very good! Our fourth day in we started being very careful of what we ate... \"stomach\" issues...", "title": "Dont delay BOOK TODAY", "helpfulness": 29, "user": "paul38karen38", "date": "July 12, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 5458679}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "My best advice would be just go and enjoy and don't pay much attention to the negative reviews. I was stressing out before we left after reading all of the negative reviews. I honestly don't have one complaint. No, English is not the staff's first language! Hello, you are in the Domincan Republic. I thought everyone at the resort did a fantastic job with their English. Everyone that works there is super friendly. The food was excellent! Yes, there were some things I wasn't crazy about but I could always find something I liked. Only tried one of the restaurants but preffered the buffets. I have a pretty sensitive stomach and never had any GI probs. I ate the cheeseburgers on the beach and they were terrific. I think people go on vac here and eat, drink and spend all day in the sun and it doesn't sit well with them. Its quite easy to go overboard!!", "title": "Wonderful Resort!!!", "helpfulness": 3, "user": "terrikki", "date": "March 10, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7008740}, {"rating": 4.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "I had to make a trip to the MD at the resort..absolutely nothing to do with the food and it was a pleasant experience. The Doctor was very professional and very, very helpful. I work in a hospital and was very satisfied with the experience. I paid $200 for the visit and the meds and my insurance is paying for it in the states. Even if they didn't pay for it the $200 was very resonable and is what I would pay in the states w no insurance.", "title": "Great Place-Horrible Food", "helpfulness": 8, "user": "Yana K", "date": "March 9, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7007682, "likes": {"liked": "— Beach", "disliked": "— Food"}}, {"rating": 3.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "There are bars everywhere and I never, ever had a hard time getting a drink. I can't imagine someone waited 10 mins for a cocktail?? I was very impressed with everything at the resort!! It was very, very clean and would go back again. Enjoy your trip and don't freak out about the negative reviews like I did!!!", "title": "Great Place", "helpfulness": 11, "user": "LauraPennsylvania", "date": "March 9, 2007", "detail_rating": {"front_desk": 2.0, "service": 5.0, "cleanliness": 3.0, "value": 4.0, "rooms": 3.0, "location": 4.0}, "id": 6941520, "likes": {"liked": "— the grounds", "disliked": "— some of the food"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled with family", "text": "I have read all the reviews and I agree with majority of the people. The place is awesome. Try if you can to get a Platinum Package, you will get little privileges like a free 20 min massage or cigars in your room, slightly better rooms, though they are all great and you can get any alcohol beverages at the bars, whereas some other packages have limits. We have booked our vacation through Apple Vacations and I must say, they were very organized and I would highly recommend them. All the paperwork arrived on time, the transfer from and to the airports were without delays, extremely friendly staff and they ever have a desk at the hotel in case you have questions during your stay. The resort itself is really nice with a beautiful beach. You will enjoy every minute. The one downfall of our entire stay and I can see from other reviews wasn't only ours -the worst food ever. Everything looked tasty but it was just simply horrible. First, they cook everything in a coconut oil; they add no species, so even the best seafood was tasteless. Any dish you get, and there was 5 or 6 restaurants buffet style so eat all you want-it was just bad. Other than that, if you stay for a week, book some great tours they offer-it is a lot of fun, enjoy the sun and your stay in Dominican Republic.", "title": "Great Hotel, Beautiful Beach and Relaxing Atmosphere", "helpfulness": 14, "user": "arobin", "date": "March 9, 2007", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 6941196, "likes": {"liked": "— Beach", "disliked": "— nothing..."}}, {"rating": 3.0, "stay_parameters": "Stayed March 2007, traveled with family", "text": "After reading many, many reviews on this place, I was very hesitant to stay here. However, my fears were quickly laid to rest. The grounds were impeccable - the maintenance workers daily took care of everything. The landscaping was beautiful. The hotel is a huge complex; we were lucky enough to have our room centered in this place - we were half way to the lobby and half way to the beach. Because my husband and I like to walk; we did so, however, the trams ran very often, and if you wanted to ride, you could. We had no trouble with any of the employees whatsoever. In fact, we often commented how nice everyone was. The food was not the best - but we're in a foreign country, so I can handle watching what I eat and did not go away hungry from any place where we ate. Best meal: El Gaucho - the Argentian steak was to die for!! We ate at El Gaucho 2x just for the steak. Make your reservations early in the day or for the whole week, if you want. The Italians restaurant was good also! We also ate the nightly buffets if we did not have reservations anywhere else - it was fine! I felt the pool could have been cleaner, but then you have people coming in from the beach and going right into the pool - they did not bother to wash their feet off at the many places you could - so go figure!! Lunch at the \"party pool\" - hamburgers were great. Went to the spa - WONDERFUL - and the prices were very reasonable. After 4 days in the salt water and sea, the massage with oils was very much appreciated. The \"quiet pool\" near the main lobby was very nice - we spent 3 days there - it was nice to get away from the partying mode. The room was okay - no problems with hot water like I had read from other people. I do not go on vacation to spend my time in the hotel room. And the beach in Punta Cana is the best I've ever been to. The entertainment crew at the pool was great - these guys definitely go out of their way to make sure everyone is having fun. We definitely had a great time here and I would definitely stay here again.", "title": "excellent amenities, average service", "helpfulness": 5, "user": "lion187fly", "date": "March 8, 2007", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 3.0, "value": 4.0, "rooms": 3.0, "location": 4.0}, "id": 6935603, "likes": {"liked": "— The beach and the pool", "disliked": "— the service"}}, {"rating": 5.0, "title": "Wonderful Vacation!", "text": "I have been reading reviews on \"Bavaro Princess\" for about 6 months. I was very nervous to book our vacation as a lot of reviews were not very good. I took advice from a friend who had went one year ago, she said the resort was excellent and said we would love it.", "helpfulness": 4, "user": "JoeyCanada", "date": "April 27, 2008", "id": 15408983}, {"rating": 4.0, "stay_parameters": "Stayed April 2008, traveled with family", "text": "My husband and I stayed at Bavaro from April 16-23rd, we flew Sunwing. Our flight was the only problem we had all week as it was delayed about 8 hours leaving due to mechanical problems. We had a 2 hour bus ride from La Romano airport to our resort so it did make for a long day.", "title": "Amazing No Need to Say More", "helpfulness": 5, "user": "sunnydayzToronto", "date": "April 25, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 15344574}, {"rating": 3.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "We did go w/ the Platinum upgrade. I would def reccommend getting the upgrade as it does give you unlimited internet/premium drinks and more restaurants. We went to 5 differenet restaurants and only ate at the buffet once at night. The food was very good. Some resatuarants are better then others but the staff go above and beyond to make you feel pampered. Our favorite restaurant was at Bella Pasta, or El Gaucho.", "title": "Just Got Back", "helpfulness": 4, "user": "bobbostonmass", "date": "April 24, 2008", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 5.0, "cleanliness": 4.0, "value": 2.0, "location": 5.0, "rooms": 3.0}, "id": 15334228, "likes": {"liked": "— beach", "disliked": "— food,dishonest and scam people thu out the whole island"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "The beach was UNBELIEVABLE...beautiful white sand and water that was very clear. The beach bar was great and had wonderful fries that we would munch on through out the day.", "title": "Would return in a heartbeat", "helpfulness": 1, "user": "fcec411", "date": "April 22, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 15209258, "likes": {"liked": "— The friendliness of the staff", "disliked": "— It took us a little longer than we would have liked to book our restaurant reservations due to not having our honeymoon kit in our room upon arrival"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "The rooms at first glance are a little dated but when it came time to leave at the end of the week it felt like home! The rooms were very clean and the cleaning staff always had them done everyday when we arrived back from the beach.", "title": "Absolutely the best!!", "helpfulness": 2, "user": "lilgerbil", "date": "April 21, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 15207079, "likes": {"liked": "— absolutely everything", "disliked": "— can't think of a thing"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "Don't pay attention to all the bad reviews. Just go and see for yourself. My girlfriend and I just recently came back from the Dominican Republic last wednesday from a 7 night stay, and we had a great time. The resort itself was very beautiful. We got the platinum upgrade, which by the way is well worth the extra money, made our trip even better. It felt good to go up any bar in the resort and ask for any drink on the shelf and walk away, while everyone else has to pay, and room serves was 24 hours every day. The room that we stayed in was about one minute walking distance from the beach. So we got to see three different weddings while we were there. The resort does have a bit of an insect problem, but not that bad. You have to remember that there are lakes and ponds all over the grounds with over 700 rooms, bugs have to vacation too. We had to change rooms due to little flying bugs, and ants. But once the manager way informed of the problem, we were moved within minutes. The venders on the beach and in the main lobby were a little bit of a problem too, but you have remember that you are on vacation. It doesn't matter where u go, as far as thr islands, there will be someone trying to sell you or get you to sign up for something. Just do the samething you would do at home, tell them you are not interested before they even get started and you will be left alone. We went on three tours, the outback safari (highly recommend), the marinarium, and dolphin island. All of the tour guides were very nice, but the trip to dolphlin island was a little short due to a late bus driver. The beach and the pool had to be the best part of the trip. Oh and by the way, the beach is top less for people with children. We met and had fun with some may people. All different races and shades which is always good. The white sand and very blue water looked like a postcard. Very very clean! And the pool was the same way. Dont forget to participate in the activites at the pool, very fun to do. Everyone that my girlfriend and I walked pass greeted us with a smile and a hola. All of the food was very good, except the eggs. Stay away from the eggs, not very tasty. As far as the train car. They can every 5 to 10 minutes. The only time the train car was full was around dinner time, because most people who made reservation (between 9 and 10 oclock at night). Any other time if one train car was full, the next one was empty. We had to walk back to the room once on the last day of the trip, due to us missing the last train car, which is 12 o clock. It turned out to be very nice , because we got to take a walk alone with each other. The entertainment at the main lobby was well planned and also funny. Nice dancing and funny comedy. The only cons we had besides the bugs in the room, were the groups of drunkin teens. They were loud and ignorant at times. Other then that a very very beautiful place to stay. I would recommend this hotel to anyone. Oh and by he way i have friends who are from the Dominican Republic, and said they're self that Bavaro Princess was a very nice place to stay also, so thats saying alot.", "title": "Don't pay attention to the bad reviews", "user": "lmoney325", "date": "June 22, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 17119354, "likes": {"liked": "— beach", "disliked": "— bugs"}}, {"rating": 1.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "My wife and I booked our honeymoon through a travel agent in our area with Apple Vacations. The price seemed more than fair and by the personal recommendation of the travel agent we booked our honeymoon to the Bavaro Princess Resort in Punta Cana. We paid for the \"platinum upgrade, which as explained to us, would entitle us to premium alcohol, nicer room, extra nice meals and other amenities.", "title": "Don't do it...Head the warnings and bad reviews...Book somewhere else!", "helpfulness": 2, "user": "rtin7070", "date": "June 20, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 2.0, "cleanliness": 2.0, "value": 1.0, "location": 3.0, "rooms": 2.0}, "id": 17091561, "likes": {"liked": "— the spa services were amazing", "disliked": "— the food was absolutley terrible"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "Upon arriving at our resort, we were taken to the \"platinum\" lounge were we proceeded to wait for two hours before we could check in to our room. Now, we do understand that people may have checked out of that room late, but after observing how slow the housekeeping was during the week, we are guessing that was the cause. After waiting over two hours for our room to be ready, we went to the room to find it in \"what had appeared to be immaculate condition\" right down to the label on the toilet suggesting it was \"sanitized.\" Considering my wife is a clean freak, she inspected the toilet before going to the bathroom to find that there was HUMAN FICIES still smeared on and around the \"sanitized\" toilet. Outraged, we called the platinum lounge to express our concern and they assured us that someone would be over right away to re-clean it. Several phone calls later and several hours having passed, a maid did finally show up to clean said toilet. A few hours later we spent some time killing huge cock roaches that seemed to come out of the wood work near the TV and couches. We expressed our concern about these issues to the apple rep at our resort and he assured us he would take care of it. He did offer to have our room exterminated but we would not be able to be in it for several hours after. Several hours later and several times of reminding him that we were waiting to hear back from him, he informed us that the manager was going to send Champaign to our room for the inconvenience. The FOLLOWING DAY, our 10 dollar bottle of Champaign arrived with a small cheese plate.", "title": "Loved it....beautiful place", "helpfulness": 3, "user": "flossie903", "date": "June 17, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 16995092}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "This behind us, we proceeded to enjoy the rest of our honeymoon. The food at the resort restaurants was absolutely terrible. My wife and I both got sick from something we either ate or drink; as did several other couples we met throughout our time there. The restaurants that were included as part of our \"platinum upgrade\" were worse then the buffet food in the main dining room. We paid for the platinum upgrade especially to receive the premium alcohol, and every time we asked for anything to be considered premium, they were out of it. We didn't get anything premium until we went to the bar at one of the sister resorts we were allowed to go to.", "title": "Family Vacation", "helpfulness": 4, "user": "frivette", "date": "June 14, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 16926999, "likes": {"liked": "— How large the facilities and the room were", "disliked": "— The show time was difficult for us"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "We booked two excursions with apple by recommendation of the reps at the resort, which were the outback safari and the dolphin island. The outback safari was well worth our time and money and we enjoyed that day immensely. The dolphin island excursion was a different story. This excursion costs $110 a person, which is steep to begin with. What a racket this excursion is. The entire trip is supposed to be 5 hours and it was five and a half hours. The bad thing is that only an hour of it was spent actually near the dolphins. The trip to and from the island took over 30 minutes each way. We spent an hour waiting to go out to the water after arriving. The hour with the dolphins was amazing to say the least. We were taken back to the beach where they proceeded to sell us DVDs with photos from our experience. This \"privilege\" cost us another 30 bucks. After waiting another half hour we received our DVD and then proceeded to wait over two hours for them to organize everyone to get back on the buses to return to the resort. Several people were complaining to the staff but it seemed the staff was only concerned with making sure everyone bought a DVD before getting back on the buses.", "title": "Great Time at Bavaro Princess", "helpfulness": 5, "user": "butterflie12345", "date": "June 8, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 16767547, "likes": {"liked": "— friendliness of staff, cleanliness", "disliked": "— n/a"}}, {"rating": 2.0, "stay_parameters": "Stayed January 2007", "text": "This place is extremely beautiful. The water, the pools, the beach is terrific. However the rooms look clean but they aren't. There are cockroaches in the rooms that come out of the drains. The rooms smell so bad. The poor cleaning people do not have mops but they use a towel wrapped on a stick and I did not smell disinfect or cleaning supplies at all. The cleaning people and waiters were very nice. The food has alot to be desired. It was mostly warm not hot food. For some reason 17 out of 18 out of our group became violently sick with vomiting and nauseau. It last approx two days where you felt like you were dying. It was bad. People around us also were saying they were sick also. Two even went in the ambulance, which before the hospital would help them wanted up front eight hundred American Dollars. We still do not know if it was food poisoning or a bacterial infection because of the improper cleaning or what. What I do know is we wll will never go back there. The Outback Safari was terrific and fun however the deep sea fishing was horrific. A rotten wooden boat with broken seats and no fishing. BEWARE. I just hope other people fare out better than we did.", "title": "BEWARE, not sure of the problem.", "helpfulness": 10, "user": "diffy77777", "date": "January 25, 2007", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 2.0, "value": 2.0, "rooms": 1.0, "location": 5.0}, "id": 6694574, "likes": {"liked": "— beaches", "disliked": "— food and rooms"}}, {"rating": 1.0, "title": "stay away !!!!", "text": "I'm not going to slander the resort on here, but we have have been to Punta Cana 2 other times, and this time we thought we were moving up to a 5 star....well not this time. we noticed a large number of people were having problems with severe cramps and diarrhea, getting worse withen a few days my wife was vomiting and got real sick, we meet this guy from the states he told us his wife was taken out of the resort by ambulance because she was so sick.... there is some real problems going on at this resort and someone is going to die before anything gets done..we tried to tell the resort and our travel agent...but no one cares...they just want your money.....you can email me if you would like any other info on this resort...thanks mark , medicmark@hotmail.com", "helpfulness": 13, "user": "medicmark", "date": "January 25, 2007", "id": 6692645}, {"rating": 1.0, "stay_parameters": "Stayed December 2006", "text": "I booked my trip to Dominican Republic through applevacations.com. For starters, I got my papers 3 days late, even though they sent it through FedEx.", "title": "Not even close to 5* rating !!!", "helpfulness": 5, "user": "GEMINI_DRAGON", "date": "January 25, 2007", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 3.0, "cleanliness": 1.0, "value": 1.0, "location": 3.0, "rooms": 1.0}, "id": 6692181, "likes": {"liked": "— Ocean, night shows", "disliked": "— old rooms, cheap liquer, floor manager Armando"}}, {"rating": 2.0, "stay_parameters": "Stayed January 2007, traveled with family", "text": "The flight from SFO to Atlanta was ok, then i connected there to Punta Cana. That was also ok.", "title": "great weather, not so great resort", "helpfulness": 14, "user": "mac02", "date": "January 24, 2007", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 2.0, "cleanliness": 1.0, "value": 2.0, "location": 1.0, "rooms": 2.0}, "id": 6654694, "likes": {"liked": "— The area", "disliked": "— the food and service and room"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "Let me start with the rating applevacations.com gave this hotel. It's not accurate at all. At the most, i'd give it 3.5 stars. The property is old, the mattreses in my suite were covered in G-d knows what. The mini fridge had a broken freezer. Barely wam water in the shower. And those monstrous cockroaches !!! i have never seen that big of a cockroach. It flew too.", "title": "Nice place at discount rate", "helpfulness": 17, "user": "Straight_Forward", "date": "January 23, 2007", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 6648020, "likes": {"liked": "— Wonderful patio and great lush landscaping.", "disliked": "— Lighting levels in accommodations were very dark."}}, {"rating": 3.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "The hotel is located in a nice withe sand beach. And this is the best they have to ofer. The suites are a litle bit old (20 years) an they need to refresh them. The major pool was not so clean as it should be.", "title": "Another year in Dominican Republic", "helpfulness": 2, "user": "palopes", "date": "September 3, 2007", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 2.0}, "id": 8612741, "likes": {"liked": "— The suit space"}}, {"rating": 3.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "My boyfriend and I travelled to Bavaro Princess Aug 11 to 17 2007. After reading all the negative reviews, we started to worry a little but not too much since we've travelled many times before and knew not to expect things to be like home. And of course they weren't like home, but that's why we travel!", "title": "Nice beach, average hotel", "helpfulness": 5, "user": "WendyMontreal_QC", "date": "August 27, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 2.0, "rooms": 2.0}, "id": 8515367, "likes": {"liked": "— The Platinum Lounge services and the beach", "disliked": "— The grounds were too large and rooms don't offer ocean views"}}, {"rating": 3.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "The hotel is nice, it says 5-star, perhaps 5-star for the DR but definitely not a North American 5 star, perhaps 3 star (this is however to be expected). The grounds are beautiful and very lush but beware, the hotel is set on 96 acres (I believe) and walking from the lobby to the beach will take you at least 15 minutes. They have little train-like golf carts that pass frequently throughout the resort to get you around. Very useful and a fun way to visit the grounds and get your bearrings when you first arrive.", "title": "Interesting Vacation-A REAL Review", "helpfulness": 13, "user": "joanny222", "date": "August 24, 2007", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 3.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 8499426}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "We booked through Air Canada Vacations on got the Platinum package. This was a great bonus since it included a private check-in area near our block of rooms, the platinum lounge where we could go for light snacks and drinks, premium alcohol, free cigars, free 20-min massage, free internet, big plasma screen tv, book restaurants, book trips with the Air Canada rep, plus many extras, all without having to go all the way to the main lobby. Definitely a must if it's available.", "title": "Amazing time at the Bavaro", "helpfulness": 10, "user": "Milica3737", "date": "August 22, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 8474495, "likes": {"liked": "— The beautiful beach", "disliked": "— Too crowded around pool area"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "Our room was large, the aircon worked well but is noisy. The entire room was in need of paint job and new sink and tub fixtures. We paid extra to have ocean view. Do NOT pay this extra as there is no such thing as ocean view. We were able to glimpse bits and pieces of \"ocean view\" from our balcony (room 737, see attached photos) but it's not what one would consider to be ocean view. Maid service was pretty ordinary but they really do have a very exhausting job so please try and tip them anyway.", "title": "Awesome", "helpfulness": 3, "user": "nimni11", "date": "August 22, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 3.0, "value": 4.0, "rooms": 2.0, "location": 4.0}, "id": 8473949, "likes": {"liked": "— the beach", "disliked": "— the room"}}, {"rating": 4.0, "title": "Had a Great time, this place is beautiful!", "text": "My wife and I just got back from Bavaro Princess last night. We stayed from Feb 25th - March 4th. I will go into as much detail as possible because my memory is still pretty fresh as we just got home 12 hrs ago.", "helpfulness": 16, "user": "klemmy", "date": "March 5, 2007", "id": 6917830}, {"rating": 5.0, "title": "Excellent place", "text": "We tried to upgrade to a platinum room, but they were all sold out for the week. However, they did allow us to upgrade to platinum service, but stay in our room. This cost around $23 per person per day. This gives you access to the plainum lounge which meant free web access, free premium drinks including miller and budweiser beer. You can make all your dinner reservations here as well. You get a lot of other ammenities as well, robes, slippers, booze in your room, etc. We felt it was a nice upgrade but our trip wouldnt have been any worse if we didnt upgrade. If you want to be treated like a vip, then do the upgrade.", "helpfulness": 9, "user": "csdion", "date": "March 4, 2007", "id": 6910519}, {"rating": 2.0, "title": "Great resort, Food terrible", "text": "First of all, this place is huge, 95 acres. If you don't like walking or riding on the trams, dont go here. We didnt mind either and had no problems getting around. Luckily we stayed in bldg 36 which was a 3 minute walk to the beach. All the bldgs in the 70's and 30's are very close to the beach. If we forgot something, we could just walk back to the room. Other rooms that were farther away would have to take the tram, which only takes a couple minutes.", "helpfulness": 6, "user": "mjbabs", "date": "March 4, 2007", "id": 6910493}, {"rating": 5.0, "title": "bavaro princess", "text": "The grounds are unbelievable. Greenery everywhere, palm trees everywhere. Everything is beautiful and well kept. Groundskeepers were everywhere making things look good.", "helpfulness": 7, "user": "herbalifekim", "date": "March 4, 2007", "id": 6910466}, {"rating": 1.0, "title": "Wil never go back", "text": "The beach is awesome. Best beach we have ever been to & we have been to cancun, puerta vallarta, cozumel, grand caymans & playa del carmen. White powdery sand with no sea shells or seaweed. The white sand goes as far as your eye can see in both directions. The security keeps all the peddlars off the beach so we did not get haggled at all while on the beach.", "helpfulness": 1, "user": "Baron123", "date": "March 3, 2007", "id": 6906956}, {"rating": 4.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "We stayed 5 days and 4 nights at the Bavaro Princess in Aug of 2006. I found the staff to be friendly, attentive and courteous. The room was immaculate, the bed comfy, tv worked, mini bar was stocked with sodas and beer, bottle opener was on the wall, (took me a while to see it).", "title": "Beautiful Bavaro Pincess", "helpfulness": 4, "user": "dulce8corazon", "date": "June 5, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 16691909, "likes": {"liked": "— Clean and spacious", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "The bathroom was clean and functional, we had plenty of water pressure and warm water. The sink area was roomy with plenty of mirrors to check yourself out. We some small ants but they were not a problem and nothing to complain about.", "title": "Great Hotel A+++++++++++++++", "helpfulness": 3, "user": "World_H0pper123", "date": "June 4, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 16671731, "likes": {"liked": "— Everything", "disliked": "— Nothing"}}, {"rating": 2.0, "stay_parameters": "Stayed May 2008, traveled with family", "text": "The food was so so, but we are in another part of the world and didn't expect perfection. The lobby was beautiful and they even had their own gift shop (I suggest bartering with the seller to get the best price.) I booked through Apple Vacations and they had their own desk at the resort.", "title": "bavaro princess; not all that great", "helpfulness": 4, "user": "arowsbe", "date": "May 30, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 2.0}, "id": 16513829}, {"rating": 3.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "We booked a half day cruise, snorkeling, lunch, drinking, drop off at a waist deep part of the ocean with bob marley playing in the background. I highly recommend it!", "title": "Nice place,lots of inconsistencies", "helpfulness": 5, "user": "Trbl39", "date": "May 26, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 2.0, "cleanliness": 3.0, "value": 2.0, "location": 4.0, "rooms": 4.0}, "id": 16421549, "likes": {"liked": "— Platinum service", "disliked": "— food,service inconsistencies"}}, {"rating": 4.0, "title": "Bavaro Princess \"The Lady Revealed\"", "text": "We also did the horseback riding excursion, we even took a stroll along the beach it was great. I suggest wearing capris but not shorts, your thighs will get irritated from the riding. For the men, I would say long shorts, if they exist. This was not one of those swim in the water with the horse tours.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "May 24, 2008", "id": 16362723}, {"rating": 5.0, "title": "Loved the Resort, Its people and the climate!!", "text": "While I have read many reviews, I have never written one before today!! We have been to many places, but never an All-Inclusive. I have to say I was alittle nervous after reading some reviews! But thank goodness we still went and didn't change our minds! The resort was absolutely beautiful! The grounds were perfect! The people that work there couldn't have been any more sincere and genuine!! Honestly....people need to understand that they \"Aren't in Kansas anymore\". If you want American food, American everything, then vacation only in USA!! The resort was clean, the food was very good. Yes, we did have 1 bad meal in the Italian restaurant. We just hopped on the little tram to the buffet and had some wonderful Mexican food!! It all worked out. The drinks were great and always a smile with quick service!! They even remembered what we were drinking!! My hat goes off to all of them!! My husband wants to book there again next January....When you had a perfect week of weather, service and beauty, its hard not to want to go back. If you have booked a week there, just remember to go there with an open mind that you are in a different country!! They do things differently than we do, but isn't that why we leave our country to explore and enjoy the beauty of other cultures???????", "helpfulness": 2, "user": "Islandgirlstmaarten", "date": "January 27, 2007", "id": 6705336}, {"rating": 2.0, "stay_parameters": "Stayed January 2007, traveled with friends", "text": "My husband and I travelled to Punta cana the week of Jan 13-20. We always travel with 2 of our friends.", "title": "Beware-Not What it Seems", "helpfulness": 2, "user": "hildy64", "date": "January 27, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 2.0, "cleanliness": 2.0, "value": 2.0, "location": 3.0, "rooms": 3.0}, "id": 6704297, "likes": {"liked": "— Beach was nice but was not aware how far it was from the lobby?", "disliked": "— food- sick most of the vacation with cramps and diarrea"}}, {"rating": 5.0, "title": "Beautiful Resort!!!!!", "text": "Not what we expected. We were in Punta Cana about 4 years ago and we thought we were upgrading.. I would not give this hotel more than 2.5 stars.", "helpfulness": 5, "user": "keride73", "date": "January 27, 2007", "id": 6704289}, {"rating": 3.0, "stay_parameters": "Stayed January 2007, traveled with family", "text": "About 2-3 days into our vacation we all ended up with severe cramps and diarrea? Not sure if it was the food or possibly the ice?? Lots of people sick not just us.. A couple of people were taken by ambulance to the hopital.", "title": "Beauty and the Beast", "user": "bajabex", "date": "January 26, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 6698838, "likes": {"liked": "— Beach & Platinum Rooms", "disliked": "— Size"}}, {"rating": 3.0, "title": "Beautiful, relaxing but stomach problems!!!", "text": "JUST BEWARE", "user": "BDES", "date": "January 26, 2007", "id": 6698800}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "My husband and I just got back last night so while this is fresh in our minds we wanted to share our short stay with you. He surprised me for our anniversary but kept it short because of some of the bad reports we had read. In summary don't believe the bad reports. Tony upgraded to the platinum level and from what he tells me the money he spent on the upgrade far paid out for us. The free massage ( which we lengthened and did together), the goumet restaurant and top shelf liquor whenever and wherever we wanted. free room service...Just too much to not upgrade for. WORTH EVERY PENNY folks!!!", "title": "This was more than we had hoped for. Don't miss out on it!", "helpfulness": 29, "user": "onamauihi", "date": "March 31, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7260509, "likes": {"liked": "— Platinum club service...all the way", "disliked": "— no negatives at all"}}, {"rating": 4.0, "title": "March 23-30 great vacation", "text": "So let's see.....", "helpfulness": 14, "user": "madmarg", "date": "March 31, 2007", "id": 7259395}, {"rating": 5.0, "title": "Just got back", "text": "Weather was nice every day but it does do it's fair share of raining and it's mostly at night so it does not detract from most acitvities. Watch out for beach weddings in the evening cause you are just asking for a wash out. Weather in the Caribbean is wet..that's why everything is so green..right?? You have to think it's gonna rain. Be prepared, use t he umbrella they keep in the room for you.(Platinum members) Most of the rain was overnight and not really a problem.", "helpfulness": 7, "user": "travelchickie80", "date": "March 30, 2007", "id": 7252023}, {"rating": 2.0, "stay_parameters": "Stayed March 2007, traveled with family", "text": "Beach....Bar and BBQ on the beach.The sun is very strong so bring your sunblock. Really! Especially if you are sunbathing topless ladies. Saw lots of you out there with red girls. It IS top optional bathing and it was refreshing to see non perfect bodies out there being happy with the way they were. I actually went topless for the first time and wow it was very nice!!!! Especially in the water. The trade winds are appreciated for sure. There are palapas to lay under but you have to get to them early if you want one for the day. Plenty of lounge chairs other than that though. Comfortable enough.", "title": "Wasn't what I had expected", "helpfulness": 3, "user": "joneill6465", "date": "March 29, 2007", "detail_rating": {"front_desk": 5.0, "service": 3.0, "cleanliness": 2.0, "value": 2.0, "rooms": 2.0, "location": 3.0}, "id": 7245919, "likes": {"liked": "— The beach and grounds were beautiful", "disliked": "— The service on our rooms, the fact that my son got salmonella from the food"}}, {"rating": 4.0, "title": "PEOPLE NEED TO RELAX - GREAT RESORT", "text": "Restaurants....Gourmet rest. LICEY (Lee-say) was nothing much to look at but it was extraordinary when it came to the food. Very well presented, very gourmet, and very delicious!!! Don't miss out. Platinum members do not have to pay the extra for this and it is included. Amazing desserts too. Really original stuff such as dishes made out of spun sugar like on those food challenge shows where the candy looks like colored glass. WOW! Tony's was like that but mine was more like a fortune cookie cup holding icecream and raspberry sauce. His was a coconut souffle which her loved. Our meals were white veal medallion, Tony had bacon-wrapped filet mignon... all excellent! El Pescador had just been moved after the fire so it was smaller but the food was still quite good. Our waiter by comparison to all theothers was less than perfect but it could have been a bad night for him. The other wait staff seemed really pleasant and willing to make their guests happy.", "helpfulness": 19, "user": "NWY", "date": "March 27, 2007", "id": 7232059}, {"rating": 3.0, "title": "Great Beach Mediocre Food", "text": "My wife and I have just returned from the Bavaro Princess - a few hours ago in fact - so I am writing this while the vacation is still very fresh in my mind. My overall impression is positive - good airport transfers, check in, staff relations, excellent rooms, beautiful grounds and one of the best beaches in the Caribbean. However the food was very definitely a minus. Before our trip, I read many Tripadvisor reviews and noted several negative comments about the food. There were also reviews from guests who found the food to be excellent. I can't agree with the latter group. With rare exception, any food intended to be delivered and eaten hot arrived at the table lukewarm or worse. Several people noted you were only guaranteed hot food if it was specially ordered - omelettes, pastas and so on.This is accurate. I would give the food a 4/10 and the other features an 9/10. They need to allocate more of their operating budget to the food service and perhaps have fewer gardeners cutting the same hedges each day . Pleasant stay but I wouldn't repeat it - the food is too integral a part of a vacation and this aspect needs the serious attention of the management of a hotel billed as 5 star.", "helpfulness": 9, "user": "A TripAdvisor user", "date": "March 26, 2006", "id": 4735695}, {"rating": 4.0, "title": "Frequent Visitor", "text": "My family owns a time share with the Royal Princess company. We go to this hotel every spring and have for the past 5 years. I have had a range of experiences both good and bad here but have found the the people of the Dominician Republic are gracious and lovely. We travel with a five year old and they have always been so wonderful to all children. I will say that I was disappointed with their \"mini-club\" staff. The one woman who ran the day camp facilities and nighly \"mini-disco\"this year was not up to the usual standards. Frankly I don't think that she likes kids all that much. I was not the only parent to observe this and decided not to leave my son in her care.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "March 26, 2006", "id": 4735466}, {"rating": 3.0, "title": "still sick", "text": "Overall the hotel food is standard but not fantastic, the beach is lovely, the pool is welcoming. The maid service in the rooms only rates about a 2 1/2 to 3 star rating. They tend to reuse the towels instead of giving fresh ones and only give the rooms a quick cleaning. The staff at the bars and rersturants are great and sweet to everytime they see you. The managment is slow to answer the needs and requests to the guests and have been each time I have been to the hotel.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "March 23, 2006", "id": 4728783}, {"rating": 3.0, "title": "Disappointed with a few things", "text": "It's been over 2 weeks and we are still sick! Beware!!", "helpfulness": 5, "user": "A TripAdvisor user", "date": "March 23, 2006", "id": 4728063}, {"rating": 2.0, "title": "Wonderful vacation - a few complaints though...", "text": "Seems there are facts that say they wash their knifes, the ones they slice food with, with their regular water.", "helpfulness": 18, "user": "A TripAdvisor user", "date": "March 22, 2006", "id": 4724924}, {"rating": 2.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "Just returned from our honeymoon. 14 days in a honeymoon suite. The hotel, the beach, and the grounds are wonderful. Staff working in restaurants and bars are very nice, but as far as management and staff working in gift shops -- how rude can they be. As soon as you mention you're having a problem, suddenly they don't speak nor understand a word of English. Don't try to get $1 bills, they'll send you to hell just for asking, not thinking you need them for tips. The first 4 days we always had to go back to the Guest Service desk and ask for bath towels (they would only leave 2 towels), or facecloths (manager said they were for Platinum suites only ???) or coffee, or water bottles, and even toilet paper. On the fifth day we took an one day excursion. We returned to a our room to find out that the maid had put the cap in the sink and left the water running. We had water up to our ankles. To me that was harrassment for complaining about the maid service. That night we found out that half of my husband prescribed drugs had been stolen. Jaccuzi didn't work, and was left covered in soap for 45 minutes because shower water just stopped. LOCK EVERYTHING IN THE SAFE. Never again will we return to Dominican Republic. We'll spend our money where people are nice and friendly.", "title": "Keep all valuables in your safe", "helpfulness": 1, "user": "MVDQuebec", "date": "February 27, 2008", "detail_rating": {"front_desk": 2.0, "service": 1.0, "cleanliness": 3.0, "value": 2.0, "rooms": 2.0, "location": 4.0}, "id": 13881489, "likes": {"liked": "— Beach", "disliked": "— Staff very rude"}}, {"rating": 3.0, "stay_parameters": "Stayed February 2008, traveled with family", "text": "I just returned home from a stay at the Bavaro Princess. We had a wonderful trip - - we choose to make the best of it and not be too demanding or tense about the trip. I must say that after reading some of the reviews I was a bit nervous. I think I prepared myself for the worst.", "title": "Not Quite a 5 Star", "helpfulness": 4, "user": "mmlaw", "date": "February 26, 2008", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 4.0}, "id": 13868623, "likes": {"liked": "— The beach, the grounds were very pretty", "disliked": "— Probably the food"}}, {"rating": 2.0, "stay_parameters": "Stayed February 2008, traveled with family", "text": "Check in was super easy and our room was ready (arrived at 2 pm). We stayed in building 09 which was close to the main pool and beach. Our room was clean and did not have a musty smell. We've been to many destinations in Mexico, Jamaica, Virgin Islands, Thailand, Costa Rica, etc and any time you are right on the ocean it's humid and there is usually a musty smell. It amazes me when people freak out about mold / mildew. I don't know how it can be avoided in areas like that. We had a 2nd level room and really enjoyed being able to sit out on the balcony area in the morning and evening. There were a few things I must mention. Yes, we did see one large cockroach in the bathtub which we quickly removed. We tried to use our coffee pot but discovered it was full of ants! The bottle opener fell off the wall constantly. The hair dryer didn't work. None of this ruined our trip!", "title": "Not all what I expected", "user": "SanjiToronto", "date": "February 26, 2008", "detail_rating": {"front_desk": 1.0, "business": 2.0, "service": 1.0, "cleanliness": 1.0, "value": 2.0, "location": 2.0, "rooms": 1.0}, "id": 13857674, "likes": {"liked": "— Nothing", "disliked": "— Everything"}}, {"rating": 5.0, "title": "Accurate Review of Bavaro Princess", "text": "Prior to arriving at the Bavaro Princess, I visited tripadvisor.com and read many of the review. I have never written a review on tripadvisor.com, but after visiting Bavaro Princess Resort I wanted to write a review that more accurately reflects the experience at the resort. My fiance and I had a great time at this resort and we wanted to share this with everyone! We both travel for business and quite a bit for pleasure, so this review is coming from the perspective of two people who travel quite frequently both domestically (U.S.) and internationally.", "helpfulness": 11, "user": "Eagles2008", "date": "March 4, 2008", "id": 14045522}, {"rating": 4.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "Check in at the resort was quick and efficient. The man who checked us in at the front desk spoke English well and was very friendly. After check-in, were were taken to our room on a trolly. We were very happy with the quality and cleanliness of the room. Yes, there was a bit of a musty smell, but you are in the Caribbean where the weather is humid year around!", "title": "Enjoyed It", "helpfulness": 6, "user": "Murphy", "date": "March 4, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 14043368, "likes": {"liked": "— Beautiful grounds, large rooms"}}, {"rating": 3.0, "stay_parameters": "Stayed February 2008, traveled with friends", "text": "Everyday, we either sat by the pool or on the beach. Both the beach and the pool are beautiful! The grounds of the entire resort are impeccible. The service at the bars was attentive and the bartenders were very friendly. The bartender at one of the bars even saved two coconuts for our drinks one day. The service at all of the restaurants was wonderful. When you are in a foreign country where English is not the main language, then saying hello and thank you in the local language will go a long way! We never had any problems with the waitstaff being unfriendly in any of the restaurants or at the buffets, but saying hello and thank you in Spanish will make the waitstaff smile and more attentive.", "title": "It was not bad", "helpfulness": 1, "user": "LittleEyeBear", "date": "February 29, 2008", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 2.0, "cleanliness": 2.0, "value": 2.0, "location": 4.0, "rooms": 1.0}, "id": 13949571, "likes": {"liked": "— The beach was amazinhg!", "disliked": "— The room was not clean and smelled bad!"}}, {"rating": 4.0, "title": "Awesome Honeymoon, remember it is a foreign country!", "text": "The food is not gourmet by any means, but if I wanted gourmet food then I would not go to a less developed country! I can eat gourmet food in the U.S. anytime I want. I came to this resort to relax and enjoy the weather and beach/pool, which we enjoyed completely. People should arrive with more realistic expectations when traveling to any foreign country: The food will not be the same as it is in the U.S. The fruits and vegetables are delicious, so definitely take advantage of this while you are there! Also, the fruit smoothie stand at the breakfast buffet is wonderful!", "helpfulness": 5, "user": "emm0909", "date": "February 27, 2008", "id": 13900357}, {"rating": 1.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "The only complaint I would have about the resort is the people that hassel you for water sports when you are sitting by the pool or on the beach. These people will come up to you everyday to try to sell you things, but by saying no once they do leave you alone the rest of the day. Also, there were no alarm clocks in the room.", "title": "Go Go vacations-terrible experience", "helpfulness": 1, "user": "R0undTheGl0be", "date": "February 27, 2008", "detail_rating": {"front_desk": 1.0, "business": 3.0, "service": 1.0, "cleanliness": 2.0, "value": 1.0, "location": 3.0, "rooms": 1.0}, "id": 13899119, "likes": {"liked": "— Weather was excellent", "disliked": "— Food, service, room, hospitality"}}, {"rating": 5.0, "title": "Wonderful 2 weeks", "text": "Well here it goes... my review. The short version is that this was an incredible experience. The rooms were great, the grounds were spectacular, the beach was white and clean, the food was always fresh and plentiful. Very relaxing. The bad part about the trip would have to be hearing people complain about the dumbest stuff. I am embarrassed that people even think this way. How can someone complain about waiting 20 minutes for a tram to take them 800 meters? This walk only takes maybe 5 minutes. These people truly missed the idea of a resort, this isn't disneyland! It is a place to enjoy the sun, to enjoy nature, to be served and to relax. The best part about our trip was the nice walks through the rainforest, past the ponds filled with ducks, fish, flamingos, turtles, and other various beautiful birds on the way to dinner. The tram riders probably didn't even know the rainforest trails exist. We go on vacations to get away from the trams, to slow down a bit and enjoy life.", "helpfulness": 63, "user": "source4homes", "date": "July 10, 2006", "id": 5448877}, {"rating": 5.0, "stay_parameters": "Stayed June 2005", "text": "This resort was a 10 for me. I would go back anytime. The 14 days of sun really helped too.", "title": "wonderful vacation", "helpfulness": 13, "user": "axita", "date": "July 10, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 5447331}, {"rating": 2.0, "title": "An honest review", "text": "My husband, my 2.5 year old son and I travelled from Toronto to Bavaro Princess from June 25 to July 2. It was our 5 time to Punta Cana. The resort was so beautiful that we fell in love with it right away. We were lucky to stay in villa 40 on the upper floor which was very close to the beach. In comparison with Grand Palladium Palace hotel and Punta Cana Princes, the room at Bavaro Princess was very cold and very spacious. You don't need to use the room key to have the a.c. running. We spent most of our mornings at the swimming pool. We noticed that even at 12 pm there were beach chairs available in the shade. My son loved the beach but especially the swimming pool. The resort was not crowded at all during our stay. The food at this hotel was the best we've experienced so far at Punta Cana. The waiters are very nice and they do their best to keep you happy. If you go to La Hyspanola, look for Jose. He speaks English and he is very friendly. My son liked him very much, and so did we. My husband tipped all the staff who was catering to us. We even gave money to the gardeners. We felt sorry for these poor hard working people who are earning only a few hundred dollars a month. The animation team was very nice. My son was selected to play in their Lion King show as Baby Simba. After that night he became very popular and everyone was calling him Baby Simba. Every night at 8pm the resort has mini disco for children. My son had a lot of fun there. He learned new dance moves. Germania, the animation girl who looks after the children at the kids club and at mini disco is very nice. Overall, the whole family had fun and we were able to relax and enjoy this vacation. We will definitely come back to this hotel in December.", "helpfulness": 10, "user": "A TripAdvisor user", "date": "July 8, 2006", "id": 5439646}, {"rating": 4.0, "title": "Pool Surfing Rocks...........", "text": "We stayed at the BP from June 15-June 22. Just to say this at the beginning - I picked the BP after much research and really wanted to come back giving it a glowing review. I had been reading reviews on the hotel every day for weeks before we left and they have been very useful, so I hope the following is to you as well - even though it may not be as politically correct as others. We will give you an honest opinion of our trip (which is not a cheap option by the way as some people have suggested).", "helpfulness": 20, "user": "A TripAdvisor user", "date": "July 7, 2006", "id": 5438745}, {"rating": 4.0, "title": "Loved the bavaro princess", "text": "I have traveled to the Caribbean and resorts in the Indian Ocean before, my partner has traveled extensively within Europe, USA and the Aegean, so we are not newbies, but our opinions differ on occasion. Neither of us are spoilt travelers. We are also probably giving you more of a British view of things.", "helpfulness": 10, "user": "A TripAdvisor user", "date": "July 5, 2006", "id": 5431416}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "We just got back on May 1st and we're still in awe. This resort exceeded our expectations! One week was not long enough! My boyfriend and I are both in our early 40's and we booked our trip back in January. I've read countless reviews for months, both positive & negative for nearly three months prior to our leaving. I can NOT understand for the life of me where the negatives are coming from.", "title": "The real truth about Bavaro Princess...", "helpfulness": 8, "user": "jewlsinri", "date": "May 4, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 15638737, "likes": {"liked": "— The beach!!", "disliked": "— Nothing at all!"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2008, traveled solo", "text": "Check in was a breeze. As soon as we stepped off the bus there was a bell hop readily there to take our luggage and walk us to the front desk. The lobby of this resort was massive- definitely a grand impressive entrance. Pictures do it no justice. The floors were so clean they shined like glass! We arrived at 4:00 pm and much to our surprise there was no waiting at all- we were the only ones checking in at that time. A waitress immediately came over with cold towels to pat our foreheads and serve us a delicious cold cocktail. Another pleasant surprise was that even though we did not upgrade to the platinum package we were given a room close to the beach. The only downfall was that this room did not have a king bed, as we requested, but we were told that we could easily get another room near the beach the next day- no problem. He said they would push the beds together for the night and did their best to accommodate us.", "title": "Thought this was fantastic", "user": "redliberty032003", "date": "May 3, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 15613957, "likes": {"liked": "— Pool and Beach", "disliked": "— Not enough singles"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "Our room was #316 (ground level) and since it was close to the beach it was quite a long ride by trolley from the lobby to get there. The grounds of this resort was absolutely gorgeous- and spotless! Everywhere you looked you could see someone sweeping, washing windows, or tending to the gardens. Lots of peacocks, chickens, and flamingos just wandering about. It took about 5-10 minutes to get to our room by trolley, but it was such a beautiful ride. Transportation around the resort is great-always a trolley coming by (wherever you are) every 5 minutes or so. During the ride to our room we did encounter an odor while driving through the mangrove. We were told by staffers that this was not sewage (as we thought) but the odor was caused by rotted mangos that had fallen from the trees. The smell isn't that bad and it passes quickly as you pass through- also there are no rooms in that area. The rooms are much nicer in person than in pictures. I would assume most rooms are the same- just be sure not to book in the junior suites, as they are in a complex near the lobby. They didn't look as nice as the bungalows. The patio in the suites was spacious and relaxing. The room did have a little musty odor, but that is to be expected in this type of climate. We brought glade plug-ins and spray which did come in handy. AC worked great- we had to keep it on low as it got too chilly otherwise. Plenty of scorching hot water and the shower pressure was GREAT too. Massaging shower heads- it was better than home! At night you couldn't hear a pin drop it was so peaceful sitting out on our patio. We saw absolutely NOT ONE BUG in our entire stay! The people who posted pictures of roaches really perturbs me. I can't even begin to describe how spotless this entire resort was!! As for mosquitoes, there were a few. It is to be expected. So be sure to bring some bug spray, it does help. The suite had marble floors throughout and sometimes they did get a little griddy when coming in & out from the beach. But when we returned later in the day, the maid did a wonderful job mopping and tidying up. We left her a $3 tip (and a gift) everyday before heading to the beach. However, next time I will forgo the gift idea. I saw many maids leaving the rooms with huge bags filled with stuff. We were stunned to see how much stuff they get in one day. So next time I will just leave her cash. That should save on luggage space too!", "title": "loved the place, can't wait to go back", "helpfulness": 1, "user": "eatdrinkandbemurrry", "date": "May 2, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 15583195, "likes": {"liked": "— spacious", "disliked": "— could be updated"}}, {"rating": 2.0, "stay_parameters": "Stayed April 2008, traveled with family", "text": "The beach was absolute paradise! Lush beach grass and an abundance of enormous palm trees. Plenty of shade under the grass umbrellas or under a palm. We never had a problem finding a chair- no matter what time of day. However, if you wanted one of the grass umbrellas you did have to get up the crack of dawn to reserve one- but that did have it's perks. Every morning I would walk down the beach before the sun came up and got to watch to most breathtaking sunrise. The sky glowed all colors and I took lots of pictures. The beach was clean and the sand was literally like flour. Soft & white. Not even the smallest rock or shell to be found. The water was a sparkling aqua blue- it was even bluer than the pool water!! The waves were awesome- but sometimes they were big enough to knock you off your feet. The beach shack offered free boggy boards which were great to ride the waves into shore. They also offered free non-motorized sports equipment but we just wanted to relax. There was para sailing right in the front of the resort. The BP had so much going on all day. Thumping music, dancing, aerobics, tug or war, volleyball, all kind of funny games going on. Even if you didn't want to participate it was fun to watch. There were two cozy beach bars right on the beach in the sand with plenty of available table & chairs to enjoy your lunch. The one in the front of the resort offered hamburgers, hot dogs & fries- but with a huge buffet inside at ElGoucho with plenty of variety, we didn't eat at the grill at all. My boyfriend and I took many walks up the beach and discovered that of all the dozens of resorts the Bavaro Princess had the most beautiful beach front of all. It was extremely wide and spacious. We noticed that as you ventured up the beach, it narrowed quite drastically. It's no wonder the other resorts have such a shortage of beach chairs. Also we found that there was not much going on for activities on the beach at other resorts. No music or anything and most people at other resorts looked mildly bored. At the BP beach there were lots of venders walking around trying to sell excursions or jewelry. They were only allowed on the beach. The security guards maintained a strict boundary into the resort itself. I have to say that it was sometimes frustrating trying to read a book when they approached us every 5 minutes. It was annoying, but eventually I figured if you pretended you were sleeping (or were topless) they would leave you alone. ;-) Yes there are topless women here. But far & few in between. After your first day you don't even notice them (and sometimes lose your inhibitions!) One day we walked to the left up the beach and found no venders. The next day we walked to the right (about 15-20 minutes) and there were venders galore! Unprepared, we brought no money. As we approached the market they began cat-calling us, some even running up to us and grabbing our arms trying to get us into their shops. 'Cheapy cheapy' they'd say. When we tried to tell them we had no money they say 'Looky looky' and still try to pull us into their shops. At first it was kind of funny, but then it became annoying, sometimes even scary. They really mean no harm though. The venders actually compete with each other for your business. If they weren't so pushy we would've gone back, but decided not to. Also, we left our valuable belongings and money unattended in our beach bag by our loungers almost every day while swimming or walking around- and nothing was ever stolen!", "title": "The stay was OK, but would not recommend to anyone to go there", "helpfulness": 4, "user": "brglen10", "date": "April 30, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 2.0, "cleanliness": 3.0, "value": 2.0, "location": 4.0, "rooms": 3.0}, "id": 15500024, "likes": {"liked": "— The beach and the pool", "disliked": "— The service and the food."}}, {"rating": 4.0, "title": "Bavaro Princess All Suites Resort", "text": "The pools were also very nice. Humongous & clean. They were picturesque and curved around the resort like a lagoon. Although we really didn't spend much time by the pool as we'd rather be at the beach, but there were plenty of unshaded chairs to be found there- although grass umbrellas had to be reserved early in the morning. I have to say that I had one experience with theft there. Early in the morning I had reserved two chairs by the beach and another two chairs by the pool. Since I used both our towels to reserve the beach chairs, on my way back to our room I reserved the chairs by the pool with my sweatshirt. Later in the afternoon when we went to the chairs we reserved by the pool, my sweatshirt was gone and there was a family sitting in the spot I reserved. When I asked them about it, they conveniently they did not speak English. My sweatshirt was never recovered. Oh well, no big loss. The swim up bar was almost always busy all day. We were lucky to find two seats there for an hour during our entire stay- but like I said, no biggie as the beach beckoned us most of the day. On the other side of the swim up bar there is also the pool bar- where we enjoyed many drinks there in the afternoon. They offered fresh fruit kabobs there- scrumptious!", "helpfulness": 3, "user": "Bobbijo2u", "date": "April 29, 2008", "id": 15453960}, {"rating": 3.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "Stayed at the Bavaro Princess from November 26th-December 3rd 2006 with my SO. Here are some objective thoughts about the hotel:", "title": "Go Platinum Or Go Somewhere Else", "helpfulness": 21, "user": "pcontrol777", "date": "December 9, 2006", "detail_rating": {"front_desk": 3.0, "business": 5.0, "service": 3.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 3.0}, "id": 6353010}, {"rating": 4.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "* Go Platinum! The hotel is gigantic, and you must take small diesel carts to get anywhere or else enjoy your leisurely, long walks. Platinum suites are within walking distance of the beach, and near the Platinum Lounge - a room in the middle of the suites with free Internet access (two computers that people were always very good about sharing), your own concierge, and - most importantly - your own bartender. The next closest bar is at the beach where service can be slow.", "title": "Good pick depending on...", "helpfulness": 6, "user": "emem007", "date": "December 8, 2006", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 3.0, "rooms": 5.0}, "id": 6349183, "likes": {"liked": "— beach", "disliked": "— distance from the beach"}}, {"rating": 4.0, "title": "Fabulous trip!", "text": "Booking restaurants was easy being a Platinum member. When I finally did make the looong trek to the lobby, I saw huge lineups for restaurant reservations. The personal concierge was also very helpful, as our room keys deactivated themselves just about every day on the trip (blamed on proximity to electronic devices in my bag, e.g. digital camera). Getting them reset was a two-minute excursion from the door of our suite to the Platinum concierge.", "helpfulness": 9, "user": "sandynina", "date": "December 6, 2006", "id": 6340316}, {"rating": 4.0, "stay_parameters": "Stayed November 2006, traveled with family", "text": "* Restaurants: Neither my SO or I got sick during the week. The food was totally acceptable for an all-inclusive, including the buffets. We aren't picky eaters, but how can you go wrong with rice, beans, and BBQ?", "title": "Great Resort but VERY Large!", "helpfulness": 4, "user": "CreatedJust4You", "date": "December 5, 2006", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 6334338, "likes": {"liked": "— beach", "disliked": "— Tramming all over, entertainment, service"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "A note on eating off the Resort: Platinum members could book restaurants on other resorts, and one of the diesel carts would pick you up a half hour before your reservation. My SO and I ate three times off the resort as we didn't dig the available options at the Bavaro Princess. This worked for us, except service can be painfully slow at the restaurants sometimes. I wouldn't mind - hey, we are on vacation after all - but the cart comes back in an hour and a half to pick you up and sometimes you can't get through dessert by then. They would wait until you finish, but you'd inevitably feel bad seeing others waiting back at the cart for you so you'd pack it in early.", "title": "Beautiful Vacation", "helpfulness": 10, "user": "Barbara L", "date": "December 4, 2006", "detail_rating": {"front_desk": 2.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 6333704, "likes": {"liked": "— beach", "disliked": "— food"}}, {"rating": 1.0, "title": "Wedding Problems", "text": "I have been looking for a great site for a Punta Cana wedding for months. I finally picked the Bavaro Princess....but when it came down to it I couldn't book the wedding. I called numerous times and they said I can only book if I sent them an e-mail so I did and got no response!!! I had the date and a million invitations that needed to be sent out and warnings to guests that they need to get their passports. It all fell through. The hotel offered no help in booking the whole purpose for us to go down there. I have totally wasted months in trying to have the dream wedding me and my family and friends would want.", "user": "CaribbeanTrips11", "date": "August 17, 2007", "id": 8443438}, {"rating": 3.0, "title": "Size does matter", "text": "The hotel itself had it all and all close by. It by far offered the perfect price, activities (more vast than most resorts), and spacey rooms. The wedding was a huge disappointment. Please be cautious. I still have yet to get married.", "user": "Shufti_Traveller", "date": "August 17, 2007", "id": 8442498}, {"rating": 3.0, "title": "Liked the Bavaro Princess (Montreal)", "text": "The Negatives:", "user": "DanBoy11", "date": "August 16, 2007", "id": 8439817}, {"rating": 5.0, "title": "LOVE!!!!", "text": "Bigger isn't always better as this resort clearly demonstrates. Bavaro Princess is huge and when we were there (28 Jul - 11 Aug) it was fully booked. As a result service was hit and miss (in spite of generous tipping), the pool was constantly busy, palapas on the beach were difficult to obtain and during peak times hot water shower pressure was almost non-existent. The air-conditioning was barely adequate. The “swimming” pools aren’t really swimming pools but more like wading pools and totally inadequate to cope with a full house. Trying to get a drink at the swim up bar was difficult and very time consuming, a result of too many people, inadequate facilities and inadequate staff. As we arrived late on our first day, we ate our first evening meal at the main buffet (which we never repeated over the following 13 nights) not because the food was bad but because of the feeding frenzy and lack of courtesy exhibited by the diners. This leads me to my next point, one that you couldn’t blame the resort for – and that is the lack of decorum of some of the guests. There were guests who had no idea of what standing in a queue meant – they would barge a line as though others didn’t exist, they would pile food on their plates as if it was their last supper (and would leave half of it); there were people who would whistle and yell at the top of their voices across the room to get the attention of an acquaintance…in the restaurant by the beach, guests (old overweight men and women) would show up for their breakfast and lunch buffet in skimpy Speedos and bikinis with no cover – enough to put anyone off their food – and yet nothing was said or done about any of it. I have seen better mannered people with a sense of decorum in far more inexpensive resorts than this… folks, this is most certainly not a five star.", "user": "travelbug7187", "date": "August 16, 2007", "id": 8435325}, {"rating": 1.0, "title": "After 2 days we had enough.", "text": "The Positives: Platinum Service: We travelled Air Canada, which gave us “Platinum” Service, which given the overall “busyness” of the place, was well worth it. Platinum service allowed for a quick check in/out, quick reservations to all the restaurants not only at Bavaro Princess but also at the two adjoining sister properties (where the service was superb). The private lounch with drinks, TV, snacks and internet service was a plus.", "user": "Janokal", "date": "August 16, 2007", "id": 8435320}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "Punta Cana : BAVARO PRINCESS ALL SUITES", "title": "Excellent stay at Bavaro Princess", "user": "Culture-Shocked", "date": "April 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 157731727}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "Stay 05 Apr 2013 - 12 Apr 2013", "title": "Amazing Vacation!", "helpfulness": 2, "user": "Samantha B", "date": "April 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 157652176}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "This is an awesome resort for the money, not too big, not too small. It was easy to get around and very convenient. There was always a train there to pick you up and only took a minute or two to get to where you needed to be. The room was large and spacious as well as spotlessly clean, with great air-conditioning. The whole resort itself was spotless as well. The staff were always cleaning something. The food on this resort was wonderful as was the wait staff. We enjoyed the main buffet, the beach buffet, and the a-la-cartes. The entertainment and animation team were fabulous. Loved the live shows and singing. The beach itself was the best in the area. I walked for an hour each way along the beach and was very happy I picked the resort I did. During the day there was always something going on at the beach or the main pool area to keep you entertained. I would highly recommend this resort to each and everyone. There is not one negative other than I wish I had 2 weeks stay instead of 1. This was our 6th time to the Punta Cana area, with a big thank you to Bavaro Princess for a great holiday experience.", "title": "AWESOME RESORT!!", "user": "skydive2327", "date": "April 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 157651066}, {"rating": 2.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "The strong points: location, beach, staff, room, clean, food, friendliness, entertainment.", "title": "Lovely beach, great staff, poor management, 5* - no - some annoying points", "helpfulness": 8, "user": "Chris W", "date": "April 12, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 157558893}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "The weak points: there are no weak points.", "title": "Best time of my life", "helpfulness": 1, "user": "Jennifer F", "date": "April 10, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 157320961}, {"rating": 1.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "The rooms are disgusting, dirty, and infested with mosquitos. I stayed at Dreams for a week (had a FANTASTIC experience there), and on the day we were to leave, our flight was delayed 9 hours, so Sunwing put us up at the Bavaro Princess for one night. The Bavaro Princess is nothing compared to Dreams. The rooms may be a little bigger, but the tub was rusting, the shower curtain had stains on it, there was a leak in the closet. We had no moquitos at Dreams whatsoever, and the Princess had them everywhere, they don't take care of their grounds very well. I didn't get a chance to explore the grounds as we arrived at night. The buffet had no choices and the food was all cold.", "title": "Disgusting", "user": "CanadaShopaholic", "date": "March 5, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 3.0, "cleanliness": 1.0, "value": 1.0, "location": 3.0, "rooms": 1.0}, "id": 14069661, "likes": {"liked": "— It's close the airport, nothing else was good about it", "disliked": "— Rooms are filthy"}}, {"rating": 5.0, "title": "Unbeleiveable!", "text": "Stay away from this hotel, book DREAMS instead!!!! Dreams is AMAZING.", "helpfulness": 14, "user": "mittsmom", "date": "March 4, 2008", "id": 14052358}, {"rating": 4.0, "stay_parameters": "Stayed April 2008, traveled with family", "text": "I travelled to the Bavaro Princess with a group of 25 people for my brothers wedding, I am the travel agent who actually booked everybody. This resort is located right in the town of Higuey. We were met at the airport by our Sunwing Rep who then showed us which bus to board to get us to the resort! Upon arrival we were very impressed with the beautiful lobby. Check in staff was very helpful and efficient, everybody spoke pretty good english which isn't a big deal to me, mostly because I'm in a foreign country and not everyone speak english. We had booked ourselves into the lead in hotel rooms. It is well worth upgrading yourselves to the suites, the hotel rooms are a little outdated and quite far from the beach and pool areas, but close to the main restaurant and lobby. We upgraded to suite 095 which was nice and close to the pool,beach and restaurants located at the beach. Either way if your near the beach your far from the main building and vice versa. The food was excellent, there is always lots to choose from, if you like a la carte dining this resort has lots of dining options from a steak house,japanese,pasta,seafood. Everyday you are able to make reservations so get up early to get your prefered time for dining. Each night the main restaurant was themed so one night is italian next could be chinese. Service can be a bit slow at times, while we were there the hotel was at full capacity so thats expected when you have that many people eating at once.", "title": "Wonderful Holiday - Will Return", "helpfulness": 3, "user": "llj26", "date": "April 11, 2008", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 14959555, "likes": {"liked": "— clean,spacious,beach", "disliked": "— hotel rooms are outdated"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2008", "text": "The Beach is beautiful just as you picture it to be blue as the sky water and white powdery sand, the palapa's are usually snatched up in the wee hours of the morning, but there are lots of beach loungers otherwise. The beach is breezy and sometimes the water was a bit rough, least to say young kids could easily be taken out. Everyday people are trying to sell you parasailing and jet skiing, beware because we booked to go parasailing for 1:30pm and didnt actually go until 4:00 so we wasted a whole afternoon waiting around for them! but thats not the hotels fault by any means. I also wouldn't recommend the ATV trip but the buggy's instead, it was 160.00 for me and my boyfriend to go and we didn't see anything of interest and we stopped every five minutes!", "title": "Would go back in a heart beat!!!!!", "helpfulness": 3, "user": "val43", "date": "April 9, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 14896245, "likes": {"liked": "— The Beach", "disliked": "— The Night shows!"}}, {"rating": 3.0, "stay_parameters": "Stayed April 2008, traveled with friends", "text": "The grounds are kept imaculate and everybody working there makes an extra effort to say Ola when you walk by, very friendly and helpful! There are two pools the main one is right off the beach where you can find a swim up bar and activities, if you like it a little quieter then the pool up by the main lobby is better, there is bar there as well but not swim up! mostly young families were there when I was there.", "title": "Mixed review", "helpfulness": 3, "user": "centorr", "date": "April 7, 2008", "detail_rating": {"front_desk": 1.0, "service": 2.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 4.0}, "id": 14860386, "likes": {"liked": "— beautiful, comfortable suite", "disliked": "— food was mediocre."}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "All and All every vacation is what you make it, I travelled with good company and understand that not all standards are going to be what they are in Canada. take mosquito repellent for at night just as you would use at home, and upgrade to a suite, bigger rooms, nicer bathroom and better location. Goodluck and Happy Travels", "title": "Ignore bad reviews!", "helpfulness": 9, "user": "andreanjohnny", "date": "March 28, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 14604755, "likes": {"liked": "— The beach, pools, and hardworking staff!", "disliked": "— We liked everything!"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2008", "text": "We stayed at the Bavaro Princess the week of March 27- April 3.", "title": "Had a great time at Bavaro Princess", "helpfulness": 8, "user": "DaPappa", "date": "March 27, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 2.0}, "id": 14584434, "likes": {"liked": "— Beach--pool--food--fun", "disliked": "— limiting our choices from menus"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "Just came back from Punta Cana, DR. (dates Aug 20th to 26th)", "title": "very nice vacation", "helpfulness": 11, "user": "wallycla", "date": "August 30, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 5728227, "likes": {"liked": "— a big room plenty of space", "disliked": "— not enough drawers or hangers in the closet"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "Myself my husband and my 5yr old daughter had a great time. It was our first time there and I have to say that we loved it the beach, pool, food ect.... the staff were great to us very friendly and kind. I have to say these people work very hard day and night especially the entertainment staff. anyway just wanted people to know the experience that we had over there. the only thing I didn't like was that some people would reserve the beach chairs and were never around to use them which is not fair to other people especially traveling with small childrens. I tried not to let that bother me since my husband didn't like to sit out on the sun anyway and the little one was always in the water. I also have to say that we did not have to use any insect repelent because there were no mosquitos at all thank God. The shopping experience was a different story we went outside the resort across the street to shop and it was to funny people would pressure you into there store for you to look around and talk you into buying something, anything but I guess that's how these people make there living. so if your thinking about staying here it is a very nice and clean resort and a beautiful and relaxing place to be (check it out and enjoy) NJ, USA", "title": "A wonderful vacation at the Bavaro Princess", "helpfulness": 42, "user": "dominicbasulto", "date": "August 19, 2006", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5626369}, {"rating": 4.0, "title": "Beautiful resort, but don't go for the food", "text": "We spent eight days and seven nights at the Bavaro Princess and loved it! The resort was nothing less than a tropical paradise and we already are making plans to return next year. The all-inclusive nature of the resort allows you to sample just about everything at the resort without worrying about carrying around dollars -- although we found that leaving a dollar or two here and there really was appreciated by the resort staff. (Apparently, there's a higher \"platinum\" level at the resort that enables you to receive top-shelf liquor and other benefits - like free dinners at the upscale Licey restaurant - and these are not free) The beach was spectacular, and there were just so many highlights at the resort: the swim-up bar at the main pool; the constant supply of unlimited tropical drinks; the onsite spa/jacuzzi; the \"zoo\" in the middle of the property (it's not really marked on the outside and consists mostly of birds, but there's a guy inside who cuts down coconuts for visitors); the romantic atmosphere at restaurants like Chopin (in the evenings, there's live music by a guy on a gondola), and the geniality of the staff (almost everyone you pass will say \"Hola!\" to you). Plus, there's a total of 7 restaurants on the property (6 of them completely free), so you have a nightly choice of Asian cuisine (a hybrid of Japanese and Chinese), Argentinian steak, \"international\" food, seafood and Italian cooking to complement the main buffet restaurant.", "helpfulness": 16, "user": "ladv123", "date": "August 8, 2006", "id": 5579934}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled with family", "text": "Before we went, we read through the comments posted here, and quite honestly, we had a number of concerns before arriving at the resort. Some complained about the quality of the food, others lamented the lack of English-speaking staff at the resort, and yet others warned about the problems with the water. In general, if you plan to eat burgers and pizza rather than sample the very nice seafood paella or engage in American pastimes like golf and poker rather than experiment with salsa and meringue, then you may be a bit frustrated. The overall experience is much more suited for someone with a familiarity or appreciation for the best parts of Dominican culture.", "title": "Living like a King & Queen at the Bavaro Princess", "helpfulness": 41, "user": "11714", "date": "August 1, 2006", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5538409, "likes": {"liked": "— clean and acessible to all activities", "disliked": "— clean and comfortable"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "Having spent 8 days there, I really don't see how anyone could complain about the food - generally, we ate at the main buffet restaurant in the mornings and afternoons, and one of the reservation-only restaurants at night. At the all-you-can-eat buffets, you can pick and choose whatever looks interesting for the day (there's usually someone preparing cook-to-order fish or chicken) and drink as much wine or beer as you want. Plus, the food at restaurants like Chopin and El Gaucho was truly exceptional. Just be sure to order the meat \"well done\" - if you order it \"medium rare\" like back in the States, I don't think the meat will be cooked thoroughly enough.", "title": "Amazing Experience!!", "helpfulness": 39, "user": "mpeddle", "date": "July 31, 2006", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5533666, "likes": {"liked": "— The beautiful beach", "disliked": "— I can't think of anything"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "While many people have many complaints, it seems to get down to what they expect. I knew in advance that I was going to a country where I did not speak the language. I knew it was a poor country. With these in mind I went with an Apple four apple deal. For the price I found no way to choose a resort and know any more than they told me. I feel we made a great deal going through Apple and letting them choose the resort at a discount. Unless you have been to many of the resorts several times there is no real way to judge value better than the Apple reps who have been there. There is also a definite advantage to having someone from a major volume group to front for you should there be a problem. We found almost everything to be great with a few minor problems. Check-in was botched but that was because we did not understand. We all shared the blame and the employees were terribly concerned about getting it straight. Electronic key did not work so we could not get in resulting in us not being there when our bags were delivered to our room. We all laughed once we figured out why. The baggage guy stayed with our luggage the whole time to make sure it was not lost! Makes any US resort look way overpriced. Not perfect as there were a great number of people who deserved to be horse whipped but then they were all customers. If you send out bad vibes, you will most likely get the same in return. Smile and bend a little and these people will bend over backwards for you.", "title": "Best vacation ever", "helpfulness": 5, "user": "Mo.Ricky", "date": "March 15, 2007", "detail_rating": {"front_desk": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 7165682, "likes": {"liked": "— Employees", "disliked": "— Steak in the steakhouse"}}, {"rating": 4.0, "title": "loved this facility", "text": "This is a beautiful resort and is maintained to a very high standard. Wife and I stayed march 5-12 and had a wonderful time. Our room was immaculately clean and the our sheets were changed every day. Our water pressure was a little low when we arrived but improved as the week progressed. Now, to the food. For the most part the buffets at the beach and at reception building were excelllent. Also the Chopin restaurant was quite good with an outstanding pasta bar. Astep lower is the Gaucho steak restaurant. The cuts of meat are not quite up to what Americans are used to.The Licey was not available to us but was supposedly very good. The rest of the restaurants are simply awful. The food in the italian and japanese restaurants was unsatisfactory.No bread in an Italian restaurant? And every where the coffee service was slow to nonexistent . I have traveled extensively and would recommend this hotel to anyone. Just be aware that some of the restaurants are a bit dicey and have a great time.", "helpfulness": 2, "user": "higuey", "date": "March 14, 2007", "id": 7163177}, {"rating": 4.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "We have already talked about going again.", "title": "I didnt want to leave", "helpfulness": 2, "user": "MannyClevelandOhio", "date": "March 14, 2007", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 7162964}, {"rating": 5.0, "title": "Fabulous location for a wedding!", "text": "Getting up early on vacation is really worth it when you see a sunrise", "helpfulness": 9, "user": "Brooklynbk", "date": "March 12, 2007", "id": 7148724}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled with family", "text": "on this beach.", "title": "I would definitely recommend this place!!!!", "helpfulness": 9, "user": "Cerveza_Por_Favor", "date": "March 12, 2007", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 7080802}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled with family", "text": "Well, here it is !! We stayed at the Bavaro Princess from Nov. 10 thru the 17th 2006. We booked our Punta Cana Vacation through Apple Vacations almost a year in advance. We had a wonderful flight with USA300 Airlines, especailly since it was my first flight ever. After reading reviews regarding this Hotel on Trip Advisor for almost a year, I can say that the positive reviews I read were right on the mark and the Negative reviews just didn't make sense to me. My Family (3) and a good friends Family (3) have vacationed at Mrytle Beach SC for numerous years, this year we decided to make a change. Neither Family had ever seen the blue waters of the Caribbean nor have we ever left the USA. Needless to say we are already making plans to return to the Bavaro Princess Punta Cana in 2007. What a treat, I can not say enough good things about this Hotel and Punta Cana. As much as we have always enjoyed Mrytle Beach SC, in our opinion, Punta Cana's Bavaro Beach blue water and white powder sand makes it the Mercedes of all beaches. In an effort to assist a Trip Advisor member in making their decision about this resort, the rest of my review is going to be made up of comments pertaining to the reviews that I read on the Bavaro Princess and Punta Cana prior to our trip.", "title": "Paradise at it's Finest !!", "helpfulness": 17, "user": "ejyanik", "date": "December 3, 2006", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 6322281, "likes": {"liked": "— The Dominican People", "disliked": "— Water Pressure"}}, {"rating": 1.0, "stay_parameters": "Stayed November 2006, traveled with family", "text": "First Things First :", "title": "Terrible Grauenhaft", "helpfulness": 2, "user": "speidel", "date": "December 2, 2006", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 1.0, "value": 1.0, "rooms": 2.0, "location": 3.0}, "id": 6317227, "likes": {"liked": "— Beach", "disliked": "— that it wasn't a 5-star-hotel!!"}}, {"rating": 1.0, "stay_parameters": "Stayed November 2006, traveled with family", "text": "None of the members of either Family got SICK at any time while at this resort and we eat and drank everything except the tap water !!", "title": "Sick in Paradise", "helpfulness": 4, "user": "FrequentFlyer1855", "date": "November 30, 2006", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 4.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 6307948, "likes": {"liked": "— Beach", "disliked": "— Food"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled with friends", "text": "Food at the Bavaro Princess:", "title": "Rolls Royce of Punta Cana Resorts", "helpfulness": 15, "user": "mookiedoobie", "date": "November 30, 2006", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 6306356, "likes": {"liked": "— The cleanliness of the rooms.", "disliked": "— The size of the resort."}}, {"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "Fantastic - If you go home hungry at the resort, it is your own fault. We ate like kings for breakfast, lunch and Dinner. The Apple reps. allowed us to make reservations for almost the entire week the first day that we arrived.", "title": "Wonderful vacation", "helpfulness": 6, "user": "damien", "date": "November 28, 2006", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 4.0}, "id": 6185719, "likes": {"liked": "— Very large spacious suite with very good size balcony", "disliked": "— Lack of water pressure in shower"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2005", "text": "Just returned last night July 13 from Bavaro Princess, we had a total of 18 people, ages 7-67, I feel the place was wonderful. the landscaping is unbelievable. just setting on our balcony I seen hummingbirds, wood peckers, anoli's. sit back and enjoy", "title": "Nice vacation", "helpfulness": 29, "user": "jetlady", "date": "July 14, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 3666117}, {"rating": 4.0, "title": "Great Fun at the Bavaro Princess", "text": "Let me start by saying, I read the reviews and the forum on here for about 5 months before we left. Feelings were mixed, they were mixed with our group as well.", "helpfulness": 17, "user": "A TripAdvisor user", "date": "July 6, 2005", "id": 3640318}, {"rating": 5.0, "title": "Paradise", "text": "But here goes...", "helpfulness": 35, "user": "A TripAdvisor user", "date": "July 5, 2005", "id": 3636461}, {"rating": 5.0, "stay_parameters": "Stayed June 2005", "text": "we left BWI on Wednesday July6th, USA3000, no problems with check in except one person in our group was waiting for the rest of us at US Air instead of USA3000, but needless to say we all got checked in and our assigned seats on the plane( that was nice after flying other airlines where it was a free for all getting a seat). No problems at all, but we had everything out and ready when we got to the check in counter- remember the luggage weight limit is 44 pounds per person, I seen one women moving stuff from her luggage to her carry on. The flight itself was nice- free headsets for the trip south, food was not what I expected, but it gets you ready for Punta Cana LOL.", "title": "Bavaro Princess was Great", "helpfulness": 57, "user": "Winterpeg1", "date": "July 4, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 4.0}, "id": 3635375}, {"rating": 5.0, "title": "Almost cancelled due to the bad reviews !", "text": "Check in- we booked through Apple, our rooms were already assigned, and we had told the travel agent ( TA) that we wanted to be close but not all together. that is exactly what we got, one family in 04, one in 07, one in 08, 3 in 09, one in 10. Luggage was in the room before we were. The families who came on Friday had to wait for their rooms ( I think the last one was 4 o'clock) But I checked in on Wednesday- got to the hotel about 2:00 and the rooms were ready, no waiting.", "helpfulness": 50, "user": "IAMSPIN", "date": "July 4, 2005", "id": 3635147}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled with family", "text": "We went for long walks every morning and the Princess beach was by far the largest and cleanest.", "title": "Best Week of my life", "user": "kc_beauchamp", "date": "March 10, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 7010274, "likes": {"liked": "— The staff and the nightly shows.", "disliked": "— Leaving."}}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "We just got back from a week in Punta Cana, where we stayed at the Bavaro Princess. We read a lot of the reviews on this site before going so we were a little apprehensive from the negative reviews. I believe that you'll find anything you want at the Bavaro Princess if you keep an open mind. The Domincan Republic is a developing country, so, top notch luxuary accomodations with all of the corresponding amenities are probably too much to ask unless you're ready to pay for it. We've had the chance to travel a lot, and what we found at the Bavaro Princess was excellent for what we paid.", "title": "Great time with an open mind!", "helpfulness": 11, "user": "leremster", "date": "October 28, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 10407966}, {"rating": 1.0, "stay_parameters": "Stayed October 2007", "text": "-The staff was very friendly. You wouldn't believe what a smile can do when communication is a problem. I was told that the people working there make no more than $300/month, so a little tip can go a long way, even in an all-inclusive resort. We always tipped our waiters, sat at the same places and never had any issues with service. We never used the room service so we can't comment on it. The maid did a great job cleaning the room, she put flowers on the bed and in the bathroom everyday. We tipped her $20 at the end of our stay. She didn't have to do it afterall.", "title": "Prepare yourself for a nightmare", "helpfulness": 3, "user": "srobin9178", "date": "October 27, 2007", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 1.0, "cleanliness": 2.0, "value": 1.0, "location": 4.0, "rooms": 2.0}, "id": 10377391, "likes": {"liked": "— Going Home", "disliked": "— Customer Services (with the exception of one person)"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "Let me start out by saying this resort is paradise, but I went to the resort with my 2 sons (16 & 14) and we were looking for other kids that they could hang out with and the resort was mainly honeymooners,couples and older travelers. I was looking for nightlife and there is no nightlife and everyone goes to bed early. This resort was just not what were were looking for but if you are a couple and want total relaxation then this is the place. Checkout was awesome and I got a great room next to the pool bar and couldn't ask for a better room. The first day I played water polo and I have to warn you to wear water shoes because the bottom of the pool ripped up my feet and I was in pain for about 2 days. The rooms are very nice and plenty of room. Every employee that I spoke with seemed happy at the resort and they work very hard. The gym is very nice for a resort and had modern equipment and plenty of equipment. If anyone has questions please e-mail me.", "title": "Great Resort, but not for singles.", "helpfulness": 1, "user": "topknob27", "date": "June 26, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 5.0, "rooms": 5.0}, "id": 17241483, "likes": {"liked": "— Great beach/ nice resort", "disliked": "— No nite life"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled with friends", "text": "We just returned from the Bavaro Princess June 17 - 24 2008 and i must say what a great week. I wont drag out this review too much, you can contact me for anything specific you want to know. my advice is to go enjoy your time get to know the staff and animation team their sole job is to help you relax and have fun. participate when they ask you will have fun.", "title": "Thank you to everyone here for a great stay", "helpfulness": 3, "user": "Grump1", "date": "June 25, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 17227355, "likes": {"liked": "— The people, animation team", "disliked": "— rude impatient tourist"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2005, traveled as a couple", "text": "Check in was quick and easy.", "title": "Beautiful hotel great service", "helpfulness": 1, "user": "csf2024", "date": "June 23, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 17166224, "likes": {"liked": "— the beach , pol ,friendly staff"}}, {"rating": 2.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "The room was awesome no problems", "title": "Little boring, marginal food!", "helpfulness": 1, "user": "juanvaldez001", "date": "June 23, 2008", "detail_rating": {"front_desk": 3.0, "service": 2.0, "cleanliness": 3.0, "value": 2.0, "rooms": 4.0, "location": 3.0}, "id": 17157150, "likes": {"liked": "— room", "disliked": "— food"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "The beach was amazing largest of all surrounding resorts .", "title": "Will return in a heartbeat", "helpfulness": 4, "user": "HFREE", "date": "June 22, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 3.0, "location": 5.0}, "id": 17137282, "likes": {"liked": "— A great location, great staff and an all aroung great resort"}}, {"rating": 1.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "If anyone is trying to make the decision whether to stay at Bavaro Princess---DON'T!!!! I got on travel advisors and there was enough pictures and negative things that I wish I had listened to them but I was stupid and listened to those that would say the oppisite and convince me that the people writting were just negative people...They weren't, believe me I've went to Punta Cana 6 times and always stayed in a 5 or 6 Apple Resort and I know the difference..Bavaro Princess should be rated no more than a 3.. My friend and I arrived there May the 12th and the Bell Boys took our luggage and showed us where to catch the tram and we waited and waited just like people had said we would..We finally walked to our room which hadn't been cleaned, I turned the tv on to see if we got any Latin music because I love it and the tv wasn't working.. the maid reported it,,then after she left we was looking the room over,,sure enough like we had been advised,,there was bugs, mildew on the walls, and the light in the bathroom wouldn't work..I called to report that and then we got ready to go eat..We went out to the tram stop and waited again for 10 minutes and finally the tram came,,,FULL,,we finally walked and it was a long walk, believe me,,I was told about the sewage smell but again didn't believe it,,I do now,,it was terrible..dinner was good until later when I was running to the bathroom often, it was too dark in the main lobby and we went to the show which was a magic show, very boring. Well we decided to go in, get some sleep and start over tomorrow..no tv and no light in the bathroom,,luckily I took a flashlight. The next morning I was so sick I couldn't eat breakfast and soon after breakfast my friend was sick..We went to Apple and ask to be moved..After checking around, they found us a great resort and we moved..Please if you're thinking about going look some more..I'm really upset that Apple would rate this place a 5 as bad as it was...I'm sure if these people that give great reviews had been to any other resorts they'd realize that Bavaro Princess has a lot of problems..Our vacation was ruined from getting an enzyme or poisoned the first day..I go to enjoy everything,,always look foward to the food, drinks, entertainment,,I missed all of that and was moved to a fabulous resort but was too sick. Don't be pulled in by the good price like I did,,I regretted it. I hope you'll listen to me..Thanks Susan", "title": "Big Mistake", "helpfulness": 3, "user": "KenoBaker1", "date": "May 22, 2008", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 2.0, "cleanliness": 1.0, "value": 1.0, "location": 3.0, "rooms": 2.0}, "id": 16324351, "likes": {"liked": "— nothing", "disliked": "— resort"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled with family", "text": "Five of us (from PA, USA) stayed at the Bavaro Princess Resort from May 11th thru 16th, 2008. Our ages ranged from 22 years old to 53 years old. Although this was our first experience with an all-inclusive vacation, we are not novices when it comes to travel. We recently were in Vegas and have been on several cruises (NCL, RCI & Costa) in the Caribbean. We booked thru Susan Judd at Berwick Travel. She was very helpful (responsive) and took care of all our travel needs. Berwick Travel, Cinnaminson, NJ, offered the best package price for this vacation. I researched this vacation on the internet for 4 months. We stayed in 3 Platinum suites (793, 795 & 796). We were approximately 50 feet from the Platinum Lounge and 200 yards from beach. I would highly recommend the upgrade to Platinum Club. It was an additional $165 per person for our stay. Just the use of the Platinum Lounge and its’ wonderful staff was worth the extra money. Margarita, Anna and Juan were great to deal with. When we arrived at the Resort, via included transfer from airport, we were immediately put on a jitney to the Platinum Lounge for a no-wait private check-in. We availed ourselves to the service of having the Platinum Lounge staff book all our dinner reservations. They could not have been more accommodating. On Sunday night we booked the entire week for the time we wanted each night. We ate at Licey (no charge, included with Platinum upgrade), Tanuki, Chopin and Bella Pasta. The food and service was great. We were pleasantly surprised at the quality of the food. We also ate at the buffet(s) in the main lobby area and the beach area. Food selection was very good with both buffets had chefs preparing fresh food (to your order) in addition to all the staged buffet food. We even tried McPrincess (on beach) once for hot dogs, hamburgers and fries. It was good. Drinks, hors d’oeuvres and specialty coffees at the Platinum Lounge were consumed daily. Free use of internet access was valuable to us. Two of us took advantage of the included 20 minute pool-side massage. It was very relaxing. The free cigars were good, too. The no-charge stocked mini-bar & liquor in the room was a nice convenience. Lehandro, our VIP representative, included thru Berwick Travel, was onsite and very knowledgeable. I believe he was responsible for making a few phone calls to Delta to get my lost luggage that went from BWI to SFO to JFK to PUJ, instead of BWI to PUJ. It was delivered to my suite within 24 hours of my arrival. He also took care of scheduling our transfers back to the airport. We booked a 4-wheeler excursion with him. We all had a great time 4-wheeling in the country-side. The weather was great. We had about 15 seconds of rain (light shower) the whole week. It was overcast about 4 hours spread out over 2 days. The ocean and beach were awesome (no words could describe, you must see). The pool and swim-up bar was very nice. Lot’s of activities, only if you wanted to join in. Overall, I would highly recommend Bavaro Princess All Suites Resort, Spa & Casino for your choice of a Dominican all-inclusive vacation. We didn’t experience anything negative as mentioned in some of the listed reviews. Enjoy!", "title": "We wanted to stay longer..............", "helpfulness": 2, "user": "pagel1rc", "date": "May 21, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 16275951, "likes": {"liked": "— Location of Suite in Resort.", "disliked": "— We didn't stay long enough, it was awesome."}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled with family", "text": "This was our fourth trip to Bavaro Princess, and my husband and I decided to celebrate our tenth anniversary with a renewal of our vows. We stayed from May 3rd to 18th with \"the usual gang\" - our friends who always go with us each year, a group of nine in total. And the group included a 3 yr old, 7 yr old and 8 yr old.", "title": "Wonderful stay & vow renewal at BP", "helpfulness": 3, "user": "Saultgirl", "date": "May 20, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 16261717, "likes": {"liked": "— The beach & staff", "disliked": "— Leaving!"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2008", "text": "To begin with, since we've been returning for four years, you know we have definitely not had any negative experiences at BP. We have been to Sandals/Beaches in Cuba, and Casa Del Mar in La Romana previously.", "title": "Our Dominican wedding at the bavaro princess", "helpfulness": 1, "user": "MrsJ_0408", "date": "May 15, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 16062967, "likes": {"liked": "— Cleanliness.", "disliked": "— probably the food beause it was different, unless you go to a resturant other than the buffet, but they have an american station with fries and chicken that i lived off haha"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled with friends", "text": "Food: I eat everything here. The food is terrific. Specifically, we love the fresh donuts and baking (the banana bread in am is amazing), the fresh fruits and fruit juices, and the variety at the restaurants. I won't eat buffet food at home - cold, dry, nasty - but BP has it mastered. Plus, the fresh food stations-crepes, eggs, pasta, stir frys, are a bonus. The only time anyone gets sick is when my friend gets sick as she does every year we go away (she also gets sick at home when she eats rich foods...) The a la carte restaurants are good, generally speaking. The food was fine, although we had issues with service at a couple: Bella Pasta staff were, I think, trying to be formal, but came across as standoffish. As soon as we started trying to make the champagne pouring napkin- and the staff started laughing and coming to help us- then they were warm and pleasant. On our second visit, they remembered us and were relaxed and friendly. ElGaucho was similar. Sakura had a new manager and the service was very slow. I mean, below BP's standard for sure. In fact. my husband actually spoke to the manager about the need to get the kitchen on line (waiters were great, very attentive, but main course took 1 hr 25 min to appear). What we loved was: Tanuki, the new tappanyaki restaurant - so much fun! great staff - and Chopin, again, great staff, Jose, the head chef was visible and very personable. El pescador and Licey were both very good, with good service and food. The buffet was consistently good. The variety is good and themes were fun: American, Spanish, Italian, Asian, Dominican, International and Mexican.", "title": "Fantastic Vacation for a great price!", "helpfulness": 3, "user": "Bitatay", "date": "May 13, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 15991384}, {"rating": 3.0, "title": "bavaro princess middle of the road", "text": "We have also stayed at IFA (Low end) and Secrets (High End) and I would definitely say this was middle of the road. My husband liked the food but I was very cautious of it from previous reviews. I saw what others in food industry saw -food being kept to temp with lights, not fire. Stay away from anything cooked that wasn't dry to begin with. Pasta is fine but stay away from the burgers. We were lucky and got room 038 without even asking. The room's balclony looks directly on the beach. If you speak spanish at the front desk it certainly helps. If you don't, don't expect any favors. Same as would be in the US.", "helpfulness": 1, "user": "lumsser16", "date": "March 7, 2007", "id": 6928772}, {"rating": 5.0, "title": "Amazing Vacation!!", "text": "Best bar by far is the larger pool bar on the upper side. MAXIMO will be your best friend there. Worth getting to know him. The beach side bar takes 10 minutes longer. Only saw the lobby bars at night. Entertainment was geared more for kids from what we saw, of course we go to bed early these days.", "helpfulness": 8, "user": "moveebuff", "date": "March 6, 2007", "id": 6921269}, {"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "If you are booking thru Apple tours, skip the transport back on the bus and take a taxi. Only $30 for 2 people and you get 2 extra hours on the beach before you leave. Same thing with every resort. As far as food - be smart! the 2 other resorts we stayed at had NO complaints about food. We took plenty of chips and cookies with us from home so we were never lacking for safe food.", "title": "Great Experience!!!", "helpfulness": 9, "user": "dsm09", "date": "March 6, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6921044, "likes": {"liked": "— Beach/ All-Inclusive/ Cleanliness/ People", "disliked": "— No Complaints!!"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "My husband and I took our 2 daughters age 19 along with my mom to celebrate my mom's 80th birthday. We had an amazing time. We booked this trip through American Expresss on the Kingsway in Toronto. They were fantastic! Thanks Ryan and Judy!! They booked us on Air Canada vacations and it was great. Judy recommended the platinum package which was definately worth it. We had two rooms 765/766 which were great because they were so close to the beach. The rooms were huge and well laid out. They have a sitting area when you first walk in and a bar area which we converted to my mom's bedroom area.", "title": "Go Platinum, Well worth it", "helpfulness": 6, "user": "Einmit", "date": "March 6, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6919959, "likes": {"liked": "— The Beach and the drinks", "disliked": "— Not enough washrooms"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2006, traveled with family", "text": "It is perfect for 3 adults. My mom had a bed instead of a cot which was great. Mini bar was stocked daily. Maid service was great. We left $3.00U.S. every day for the maid.", "title": "Gorgeous Resort, GI problems", "helpfulness": 2, "user": "Donnie&Theresa", "date": "March 5, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 6919138}], "location": {"country": "Caribbean"}, "stars": 4, "variance": {"poor": 302, "average": 466, "very good": 1178, "terrible": 252, "excellent": 1649}, "aka": "Bavaro Princess", "slim_ranking": 0.356435643564, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.5}, "description": "Hotel Bavaro Princess, situated in the Dominican Republic in an area renowned for its incomparable beauty, the quality of the sand and the clarity of the water on the famous Bavaro Beach. Accommodation at this prestigious resort more than meets the expectations of the most demanding of customers.136 splendid Platinum Suites, 16 Honeymoon Spa Suites, 82 functional Junior Suites, or the 572 spacious and fully equipped Bungalow Suites, provide the ideal added value to enjoy an unforgettable holiday."}