{"user_rating": 4.5, "review_count": 843, "name": "Bay Club Hotel & Marina", "reviews": [{"rating": 5.0, "title": "Must stay on marina side", "text": "we would stay there again. The breakfast was great and the view on the marina side was beautiful. We have two kids and it was pretty kid friendly, but It was more couples that were older. The hotel is a bit dated, but again totally worth staying there.", "user": "Californiatraveler30", "date": "October 24, 2007", "id": 10291051}, {"rating": 4.0, "title": "Great Value", "text": "After reading innumerable reviews of San Diego Hotels in preparation for a trip there for our daughter's wedding, my husband and I decided on the Bay Club Resort. We were pleasantly surprised by much lower rates and better value than the other hotels we researched. I made our reservations directly with the hotel management some months ahead and they were quite a bit less expensive than the hotel room consolidator companies. Their confirmation of our reservation came promptly by e-mail with a lot of helpful information included. Their shuttle driver picked us up promptly at the airport (it is very near the airport) and was most pleasant. We used the shuttle a number of times during our stay going to various wedding actvities and they were always timely and very polite. I was a bit worried by some reviews I had read about staying in a room on the first floor but was very pleasantly surprised by our room (118)which was very nice. Our room looked out on the marina and had a nice sized balcony which hung out over the water. There were two chairs out there with room for more. Our room was very clean, the bed was comfortable, the bathroom was large with a separate vanity. There were tons of soft, fluffy towels which is most unusual these days. The tile was dated in the bathroom but was spotless so that was no problem. The only time we heard anything going on outside our room was when we cracked the balcony sliding door one night and could hear \"Air Supply\" performing next door at Humphrey's Half Moon. In our room this was just barely audible but we would have been treated to a nice concert had we sat on the balcony or out by the pool. The best thing about this hotel was how nice and accommodating the staff was to our needs. They are friendly and straight-forward about helping their guests with their particular questions or problems. The breakfasts, included in the price of the room, was first-rate, served buffet style with seating in the restaurant dining room or on the patio. Each day they served different items which always included two different egg dishes, meats, lovely fresh fruit, french toast, pancakes etc. along with the regular pastries and breads. A waiter brings coffee and juice with refills to the table. We walked along a lovely beach area up and down Shelter Island Drive and went out on the fishing pier to watch the fisherman. There is a very nice playground next to the pier where our grandchildren played. All in all, we really enjoyed the atmosphere at Bay Club and could not have asked for a better experience, certainly not for the price as many others in the wedding party stayed at nearby hotels and paid nearly double what we did and had to buy their breakfasts. We would happily go back!", "user": "2aviators", "date": "October 20, 2007", "id": 10175041}, {"rating": 5.0, "title": "Great stay!", "text": "Absolutely wonderful location, view, staff, room etc...Great value and quiet location. Staff was friendly and very helpful.", "user": "Mouser714", "date": "October 19, 2007", "id": 10151176}, {"rating": 4.0, "title": "Wonderful Cozy Hotel on Shelter Island Dr.", "text": "My husband and I stayed at the Bay Club Hotel and Marina during a business convention. This was a really cozy comfortable hotel. The staff was wonderful. One of the managers, Tim, was really helpful in making reservations for us at a nice restaurant at the last minute. Breakfast was delicious, we stayed there for five days, and it was consistently good. My husband and I have been all over the country, and we were very impressed by this place. As some reviewers said, furnishings were a little outdated. We've stayed at some of the swankiest hotels in New York, and I would definitely choose this place over the more well-known hotels. We were on the first floor with a king-size bed, and the room was a very nice size for the two of us. The housekeeping staff did a great job cleaning and preparing the room. Waiters in the restaurant were very friendly. Overall, a really great choice for San Diego.", "user": "mariejolie", "date": "October 18, 2007", "id": 10128851}, {"rating": 5.0, "title": "Pleasantly Pleased", "text": "We just got back from a three night stay at Bay Club. Loved the location, nice quiet area, you could walk right across the street and be on the bay and beach and watch the harbor. Room was plenty big enough for us and two boys. We had a marina view on the first floor. My kids loved it. They would go out on the balcony and look at hundreds of boats! Very pretty view. sometimes when the tide was in, they could see fish swimming in the water below us. I saw what others referred to as carpet stains etc, but that was just in the hallways and did not effect the room. Our room was clean. the breakfast in the AM is a big plus. The pool was well maintained. not super big but there never was very many people out there anyways so not a big deal. The staff was quite friends. I would definetly stay here again. It was easy to navigate from this hotel to Sea World, zoo, downtown, etc. Nice area.", "user": "Hollimg", "date": "October 15, 2007", "id": 10084088}, {"rating": 4.0, "title": "more than happy", "text": "we stayed here for 6 nights and were more than happy. We thought the location was spot on shelter island is a really nice place to stay. The hotel staff were pleasant, the breakfast buffet was amazing to say it was in with the price of the room, which by the way was very clean and spacious. Only $5 per day to park your car, and we got to hear foreigner at humphreys next door! The only thing we thought that could be improved was the carpet in the public areas, it really could do with renewing, but apart from that everything was fine, and would recommend bay club.", "user": "honeybee001", "date": "September 26, 2007", "id": 10008912}, {"rating": 4.0, "title": "Enjoyed our stay!", "text": "My boyfriend and I stayed here last year for Thanksgiving and had a great time. The rooms were spacious with standard amenities. The hotel staff was very polite and friendly. We LOVED the continental breakfast. I especially loved that it was held at times I was actually awake rather than those breakfast that are held between 6-8am when I'm happily snoozing away. There was a good varitety of home-cooking type breakfast foods. We sat outside right by the dock during breakfast every morning and enjoyed the weather and the atmosphere.", "user": "KeishaInSF", "date": "September 23, 2007", "id": 8865139}, {"rating": 3.0, "title": "Cute & Charming, But...", "text": "The location was great. We didn't have a hard time getting to the local attractions and I liked that we weren't in the thick of the tourist madness. The staff was helpful in giving us advice on what to do and directions for getting around. Being on the \"island\" we felt like we were part of a smaller community. We would definitely stay again.", "user": "mizzmac", "date": "September 5, 2007", "id": 8661897}, {"rating": 5.0, "title": "Convenient, quiet, relaxed and just plain easy", "text": "Upon arrival, you cannot help but notice the amazing views of the San Diego Harbor and downtown skyline. So the Bay Club Hotel & Marina definitely has location going for it.", "user": "chinchinchin", "date": "August 25, 2007", "id": 8505399}, {"rating": 4.0, "title": "We loved it!", "text": "The hotel's decor can best described as Trader Vic's meets Tommy Bahama. That said, the island motif was appropriate to the location and laid back attitude the hotel wished to announce.", "user": "raidergirl", "date": "August 19, 2007", "id": 8454507}, {"rating": 3.0, "title": "Good value, good service, but NOISY near Humphrey's", "text": "This is a nice hotel in a good location on Shelter Island. The staff is friendly, courteous, informative and eager-to-please. The marina and harbor views are very nice. But if you want quiet nights DO NOT take a room on the Humphrey's side of the hotel. Humphrey's has live bands every night and they play LOUD until 1 or 2 AM, even on weekdays. You'll need earplugs or a sleeping pill do get a night's rest. After we complained, to the hotel's credit, they upgraded us to the captain's room on the other side of the hotel. They are in the middle of some remodeling, but we were not disturbed by workers or noise from this. It's nice to have a hot breakfast buffet included as well.", "user": "Nugie", "date": "February 27, 2008", "id": 13876730}, {"rating": 5.0, "title": "Super Service at the Bay Club", "text": "We stayed for two nights at the Bay Club in late January of 2008. Their shuttle picked us up at the airport, drove us to the cruise dock and one evening we walked down to the train station after a fabulous dinner at the best Italian restaurant in CA, Felipe's, and they came down & picked us up - saved a pile on taxi fares. The front desk arranged our tour on the Old Town Trolley (a great way to see the city). Even though they had water damage in the dining room from a fire in Jan, the meals we had were very nice. Breakfast was a huge hot brekkie with eggs/bacon/sausage/toast/fruit/cereal,etc - a great change from the standard stale muffin and juice at many places. The rooms were a bit on the old side, but were clean. This was more than made up for by the balconies. We looked right over the marina with 100's of big & small sail boats coming, going & docked. The tide came in right under our balcony. There were sand-pipers right under us one morning as well as ducks & other shore birds. The pool & hot-tub were warm & clean & never very busy (all the locals were wearing their winter gear :-) It was also very quiet - all in all a lovely, affordable place to spend a couple days.", "user": "Flute_Teacher", "date": "February 26, 2008", "id": 13859096}, {"rating": 4.0, "title": "Enjoyed stay at Bay Club", "text": "My wife and I stayed at Bay Club Hotel from Dec 28th thru Jan 4th. We had a bay view room and enjoyed the experience. I read about debate between marina and bay view. Marina view is quiet but monotonous. Preferred bay view room, second floor. I rate this hotel as a 3 star hotel with 5 star service. Inspect your room before accepting it. Check the view, room accomondations, noise level. Not every room the same. We had to change our room 3 times because of minor issues. I learned the rooms are different. Some have balconies that are 2 feet wide while others have full side balconies. Rooms lack outlets for electronic equipment. We had problem charging cell phones and computer. Only one outlet for room. One room had noise from a kitchen fan. Otherwise, service was great, breakfast was nice with a variety of choices. They have underground parking for $5.00 per night. I noticed the pool is small. Bay view was nice. I would definitely stay here again.", "user": "Joe124", "date": "January 20, 2008", "id": 12824600}, {"rating": 4.0, "title": "Great Place to Stay", "text": "What a beautiful location for a hotel in San Diego. We stayed in a two queen room with a bay view. The view was not awesome as you first see the parking lot, but it was nice. I would probably not worry about paying extra for the view here. I think the marina view is probably a little nicer, as the boats are right outside the hotel. This hotel seemed to attract a crowd of regulars, which we took as a good sign. The hotel is a bit older, but they keep it nice. The bathtub/shower is what tipped me off to that. The bathroom is on the smaller side with the toilet and tiled tub in a room and the sink outside it. The breakfast was included and was very good. I'd call it a buffet. They had waitservers, and did present a $0 bill, basically to get a tip. I thought this was okay since it was a nicely laid out full breakfast in a restaurant setting with white tablecloths.", "user": "beegerb", "date": "January 4, 2008", "id": 12325651}, {"rating": 5.0, "title": "Convenient hotel with personal service", "text": "We loved the view across to downtown San Diego and also of all the sailboats in the marina. There is a nice sidewalk, running path along the bay. It is located at the bay level of the Point Loma area. It was easy to get to, and there were plenty of stores, gas, Denny's on the roads leading out. I would recommend this hotel for anyone who wants a great view, a good breakfast, and a clean room.", "user": "Kevben", "date": "December 12, 2007", "id": 11504540}, {"rating": 5.0, "title": "Great stay at the Bay Club", "text": "Just got back from a wonderful 3-night stay at the Bay Club. We had a corner room facing the harbor which was very clean and bright. The complimentary buffet breakfast each morning was very good with a great variety, always hot and plentiful. The staff was wonderful, always very helpful and friendly. We ate in the restaurant our last night for dinner and enjoyed our meals. It was fun stopping in at the lounge in the afternoons after a long day of exploring San Diego to take advantage of the happy hour each day and have Brandi make us yummy drinks or pour refreshing, cold drafts. As previously mentioned, the Bay Club is San Diego's best kept secret, and I would recommend it to everyone.", "user": "SuzanneE", "date": "March 23, 2008", "id": 14476175}, {"rating": 3.0, "title": "Hotel was adequate. Clean and safe.", "text": "If you are accustomed to properties such as Hilton Garden Inn or Marriott properties, you will want to lower your expectations. The curb appeal of this property can be a bit off-putting, and the check in process was a bit antiquated. This is an older property, with similar amenities and decor. The property was clean and I felt safe. These are very important characteristics for a property. Nice walking path along the bay and the people are friendly. Fine if you want an average stay. The locations was great, as I had meetings downtown, but didn't really want to stay in the $250-300 properties downtown. Nice comfortable drive downtown, to the airport and most of the city.", "user": "BizTraveller48180", "date": "March 18, 2008", "id": 14368408}, {"rating": 4.0, "title": "West Side of Bay Club--QUIET !!", "text": "Two adult travelers and one senior mom arrived over the Valentine's Day weekend from Denver. This hotel was/is a fave of my mothers..she has been coming here for years with my dad. We treated each other to a 'memory-making' trip. Even tho dad wasn't with us, she was able to relive her special times here.", "user": "SkipperTrippers", "date": "March 8, 2008", "id": 14147838}, {"rating": 3.0, "title": "Staying at the Bay Club has its pros and cons", "text": "We were pleasantly surprised as to its proximity to the Airport..only 2-3 miles away. We stayed on the second floor..(worth the upgrade) facing the harbour on the westside. We avoided the smoke from the beach fires that seemed to pop up on the beach across the street when the locals showed up...and the jet aircraft noice..and the street noise of traffic and the after hours crowd at Humphreys.", "user": "SmilesCanDo", "date": "March 8, 2008", "id": 14139597}, {"rating": 5.0, "title": "Marina view was awesome!!!", "text": "We were close to all the points of interest..driving to Point Loma was very easy..going the other way..we drove to the Maritime Museum downtown...very easy to get to. Tickets $12 for adults and $9 for seniors. Our favourite excursion was the Whale Watching Tour with the Hornblower Boat Co. This was well worth the money! We took the 1:30 cruise and saw 4-5 whales breaching the surface and water 'geysering' out of their blowholes. Many dolphins and even saw large white jellyfish! Great for landlubbers like ourselves!", "user": "ColumbiaTrekkers", "date": "March 5, 2008", "id": 14082494}], "location": {}, "stars": 3, "variance": {"poor": 29, "average": 78, "very good": 278, "terrible": 15, "excellent": 443}, "aka": "Bay Club Hotel And Marina", "slim_ranking": 0.177121771218, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.0, "location": 4.5}, "description": "Discover San Diego's best-kept secret - The Bay Club Hotel & Marina. Located on scenic Shelter Island...San Diego's Hawaiian Isle, we are in the center of all there is to see and do in America's Finest City. Minutes away you'll find SeaWorld, the world-famous San Diego Zoo, Safari Park, historic Old Town, Legoland, downtown's Gaslamp Quarter, PETCO Park, the convention center and nearby Baja California, Mexico. In-room amenities include free wireless internet access, coffee makers, hairdryers, safes, refrigerators, irons and ironing boards, voice mail, and 42\" HDTV's with free HBO and Disney channels. Visit our Front Desk for discounts to local attractions, rental car reservations and entertainment or dining recommendations. As our guest, you will enjoy our complimentary full breakfast buffet and complimentary airport, cruise ship and Amtrak shuttle service. Added conveniences include gift shop, exercise room, massage therapy, outdoor heated swimming pool and hot tub. Each of our 105 charming guest rooms and suites offer South Pacific decor and lovely views of San Diego Bay, picturesque Point Loma and sailboat-filled marinas. The Bay Club Bar & Grill offers one of San Diego's best marina views along with an intimate friendly setting. Relax and indulge yourself with one of our delicious menu selections. Choose from fresh seafood specials, steaks, pastas, specialty salads and seafood combinations. Happy Hour is a must Monday through Friday from 4PM to 7PM."}