{"user_rating": 3.0, "review_count": 159, "name": "Bay Plaza Hotel", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "This hotel is reasonable value because of its location which is close to restaurants, museum and the harbour. The room was clean, large and had excellent views of the city but was very dated especially the bathroom. The staff were very helpful and friendly but there was no wifi, just basic internet access in the foyer.", "title": "Great location an views of Wellington harbour", "user": "Russelljack", "date": "June 27, 2009", "detail_rating": {"front_desk": 5.0, "business": 1.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 2.0}, "id": 33286306, "likes": {"liked": "— Close to harbour", "disliked": "— Bathroom"}}, {"rating": 3.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "Stayed as a $120 including breakfast for two special..... the room was extremely small and dated. The staff were friendly and efficient. The only thing that got to me was having to pay $15 for parking on top of the $120 - .. why is this not free... the carpark is on the hotel land.....", "title": "Ok for a one night stay....", "user": "rmw_9", "date": "April 21, 2009", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 5.0, "service": 3.0, "rooms": 2.0}, "id": 28507278}, {"rating": 2.0, "stay_parameters": "Stayed March 2009", "text": "It's ok to lay your head down for a night but wouldn't stay any longer", "title": "tired and disappointing", "user": "WellingtonJoanna", "date": "March 10, 2009", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "location": 4.0, "service": 2.0, "rooms": 2.0}, "id": 25962457}, {"rating": 3.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "My sister and I were after a centrally located quiet hotel in Wellingtonwith a twin room at a reasonable price. Our room was dowdy, the chain lock into our room had been forced, presumably prior to out visit but the fact it had not been fixed did not instill much confidence, the bathroom was very dated and dirty in the corner including a couple of blood splotches on the tiles!! There was no sky magazine, no complimentary newspaper, and while the included breakfast was adequate, we had to keep asking for several of the buffet items to be topped up and freshened, and the staff seemed annoyed at being asked. A pretty disappointing experience all in all!!", "title": "Very satisfactory stay in central location", "user": "Capelle", "date": "March 3, 2009", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 3.0}, "id": 25491720}, {"rating": 3.0, "stay_parameters": "Stayed February 2009, traveled solo", "text": "We reserved from the UK by internet and that worked fine - we were expected when we arrived. The hotel is very well situated for exploring Wellington on foot - the central business district is adjacent and the magnificent Te Papa Museum is more or less across the street. From there, you can walk around the City foreshore, where there are lots of harbour-side cafes. There is quite a lot of off-street parking for cars, at a cost of NZ$15/d.", "title": "Could be better but not bad.", "user": "starrf1re", "date": "February 24, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 4.0, "rooms": 3.0}, "id": 25104308}, {"rating": 1.0, "stay_parameters": "Stayed April 2005", "text": "What a lousy hotel this was. The rooms are in desperate need of refurbishing, with really old fashioned bathrooms and tired furnishings and poor views, despite the name! We were so disappointed we didn't eat in the hotel at all. Glad this was only a one night stay. The hotel brochure looks fine, but is very deceptive - avoid this hotel. The West Plaza looks much better.", "title": "This hotel is a dump", "helpfulness": 6, "user": "kiwiuk", "date": "May 5, 2005", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "rooms": 1.0, "service": 3.0}, "id": 3440673}, {"rating": 1.0, "stay_parameters": "Stayed February 2005", "text": "Quite poor hotel no one seemed to care, very shabby and tired at best 1 star hotel would not reccomend.", "title": "Poor Quality", "helpfulness": 4, "user": "WirralLiverpool_UK", "date": "April 27, 2005", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "rooms": 1.0, "service": 3.0}, "id": 3420322}, {"rating": 2.0, "stay_parameters": "Stayed March 2005", "text": "Stayed in the Bay Plaza in March 2005, it is near the centre of Wellington and is OK for an overnight stop. However the hotel is in need of a refurb, rooms all very old and dated and not too clean either. The windows and net curtains in my room were dirty and mouldy. The bar and restaurant were much better appointed, breakfast good. The hotel overlooks the harbour and when the redevelopment opposite is completed, the area will presumably be more attractive than at present. Wellington is extremely windy and not as appealing as Auckland and Christchurch in my view.", "title": "A hotel in need of a refurb", "helpfulness": 3, "user": "White-family", "date": "March 25, 2005", "detail_rating": {"cleanliness": 2.0, "value": 3.0, "rooms": 2.0, "service": 3.0}, "id": 3301046}, {"rating": 2.0, "title": "Very budget and not worth a stay", "text": "I asked to be shown a room and found it to be quite depressing and cheap. Not a hotel to stay in if you like your comforts. However, if you get a good deal and not too fussy then it may be okay . I would call it a one star property , maybe 2 but its far from luxury, very basic indeed.", "helpfulness": 5, "user": "PassionateTraveller", "date": "April 24, 2004", "id": 1834560}, {"rating": 1.0, "title": "shabby treatment", "text": "Stayed at this hotel fo one night. It was enough. The staff was pleasant but they put us up in an awful small room overlooking the parking lot. The room was pokey and the washroom looked as old as the hotel - we never used it (consider a flush on a pipe!). Complaints have not been responded to. We stayed there at the beginning of Oct 03.We chose the hotel becuse it advertised beautiful views!!", "helpfulness": 8, "user": "A TripAdvisor user", "date": "March 23, 2004", "id": 1740104}, {"rating": 3.0, "stay_parameters": "Stayed February 2009, traveled with family", "text": "We had already booked 2 nights at this hotel when I read the previous reviews. I felt like changing our booking. Lucky I didn't bother as this hotel suited us just fine. Our spacious room was on the 8th floor with fab views overlooking the harbour. It was clean and tidy and serviced each day. We were in Wellington for a wedding and the location was nice and close (walking distance) from the venue which was convenient. Another thing I liked was that you could open the windows for fresh air - great instead of the usual stuffy hotel air!! We asked for a late checkout and after checking, it was happily granted. A full breakfast was included in our room rate and that was fine - freshly made fresh fruit salad was lovely, cereals, toast, coffee/tea and cooked stuff like bacon, sausage, hash browns etc. I think they do a great job at the Bay Plaza. The quality of the place generally is reflected in the room rate. If you want something heaps better than this then check the rates - you will be paying close to $200NZ+ per night. We paid $135 which equates to only about 45 pounds sterling which you would be lucky of you got a crappy share backpacker room in the UK for that. Don't be put off by the reviews - if you want 5 star then you will have to pay for it somewhere else.", "title": "Good value for money, great location", "user": "spydernz", "date": "February 24, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 3.0, "rooms": 3.0}, "id": 25062917}, {"rating": 2.0, "stay_parameters": "Stayed October 2008", "text": "I stayed here for two nights on two separate occasions, as part of a New Zealand group tour in October 2008.", "title": "Yes, definitely past its best", "helpfulness": 1, "user": "Arandale", "date": "February 19, 2009", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "location": 5.0, "service": 3.0, "rooms": 2.0}, "id": 24790761}, {"rating": 1.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "Definitely past its best – old-fashioned fittings, small bathroom, etc. The food wasn’t that bad considering (we had two breakfasts and two dinners there). The main advantage is that it’s within easy walking distance of the National Museum.", "title": "Glad it was only one night!", "user": "ColoradoTraveler5", "date": "February 17, 2009", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "location": 4.0, "service": 3.0, "rooms": 1.0}, "id": 24698527}, {"rating": 2.0, "stay_parameters": "Stayed December 2008, traveled as a couple", "text": "My husband and I stayed at this hotel for one night as it was pre-booked and pre-paid as part of a self-drive tour. The front desk gentlemen was efficient and helpful, and he allowed us to check in early. A sign informed us that the parking fee had increased to $15 the previous day. (Our itinerary had it as $10.) The hallways had an unpleasant odor. The room was furnished with old, broken-down furniture. There was a hair/dustball on the bathroom floor. Fortunately, we spent the entire day walking around Wellington, and had to be at the ferry terminal at 7:40 the next morning, so we didn't have to spend much time in the room. The continental breakfast was fine. My husband had the cooked breakfast, which was a huge plate of food, but not very good. We stayed in 13 different accommodations while in N.Z. and this was the worst.", "title": "Grim", "user": "LondonPontac", "date": "February 6, 2009", "detail_rating": {"cleanliness": 2.0, "front_desk": 3.0, "location": 3.0, "value": 2.0, "rooms": 2.0}, "id": 24312803, "likes": {"liked": "— nothing", "disliked": "— rooms"}}, {"rating": 1.0, "stay_parameters": "Stayed January 2009", "text": "Worst place we stayed in NZ, thank goodness it was for one brief night.", "title": "A dreary, shabby place. Avoid.", "helpfulness": 2, "user": "GavBelfast", "date": "February 1, 2009", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 3.0, "cleanliness": 1.0, "value": 1.0, "location": 3.0, "rooms": 1.0}, "id": 24070649, "likes": {"liked": "— That the stay was mercifully brief", "disliked": "— Everything else pretty much"}}, {"rating": 3.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "Good points: great location, good parking facilities, very helpful reception staff", "title": "Not the best - but some good points", "user": "Anon0", "date": "May 24, 2008", "detail_rating": {"cleanliness": 3.0, "front_desk": 4.0, "location": 4.0, "value": 3.0, "rooms": 3.0}, "id": 16364688, "likes": {"liked": "— Great location and knowledgeable staff", "disliked": "— Quality of the fixtures and fittings"}}, {"rating": 3.0, "stay_parameters": "Stayed March 2006", "text": "Negatives: rooms have been recently painted, but the furniture and some of the fittings have seen better days; pretty thin walls between rooms so if you've got noisy neighbours is could be a sleepless night!", "title": "Could do better", "helpfulness": 5, "user": "Crispin H", "date": "April 1, 2006", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "rooms": 3.0, "service": 2.0}, "id": 4826476}, {"rating": 3.0, "stay_parameters": "Stayed February 2006", "text": "Stayed two nights in the Bay Plaza and left with the impression that the owners were scrimping on the dollars. The rooms were nice (good views of Wellington Bay) but had seen too many visitors. The fittings were worn and the carpets needed replacing. The staff were friendly but overwhelmed by coach parties. Breakfast was nice but the only staff around looked as though they had just left school. Convenient of the Museum of New Zealand (free entrance ) but a fair walk into the centre. It sounds from other reviewers that part of the hotel had been refurbished - this did not apply to our rooms.", "title": "Has been renovated", "helpfulness": 5, "user": "Snowdonian", "date": "March 8, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "service": 3.0}, "id": 4595318}, {"rating": 4.0, "title": "It's a good'un!", "text": "Very well refurbished quite recently. Somewhat noisy with a main road outside but good value . Staff very friendly and attentive .Don't be put off by the comments prior to early 2006 . It's changed for the better!!!", "helpfulness": 3, "user": "A TripAdvisor user", "date": "December 12, 2005", "id": 4233269}, {"rating": 1.0, "stay_parameters": "Stayed September 2005", "text": "What a different experience to other reviewers I had! Found the place perfectly acceptable, the staff friendly and helpful, the facilities good (smashing pool with a view!), and the restaurant was fine with views across Wellington Bay. Oriental Parade is a good location. Or room overlooked the bay. The room was large and, yes a little tired but perfectly clean.", "title": "Only one star!", "helpfulness": 5, "user": "Barbara G", "date": "October 14, 2005", "detail_rating": {"cleanliness": 1.0, "value": 2.0, "rooms": 1.0, "service": 2.0}, "id": 4021787}, {"rating": 1.0, "title": "Really Aweful", "text": "Paid $250 fot two nights stay. I have stayed in loads of hotels this is the worst so far for the cash.", "helpfulness": 1, "user": "jbmoocs", "date": "November 24, 2008", "id": 22153907}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled with family", "text": "1. dirty, mouldy white walls right by my sons bed! thats no excuse.", "title": "Great Value", "user": "tanedani", "date": "August 7, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 18705945, "likes": {"liked": "— Everything", "disliked": "— Nothing"}}, {"rating": 2.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "We travelled around New Zealand during November and stayed at 13 different hotels. This was the only poor one. On arrival our room wasn't ready and when we returned two hours later we were told we had been \"upgraded to a suite\". Our excitement didn't last long as although the room was huge with sofas, dining table etc which we didn't need, the small double bed was a pull down one from a wall unit. The \"linen\" was foul - I think it had been on the bed and stored in the unit for weeks - and the pillowcases dirty. When I complained all they could offer me was the room next door (it was the conference floor) where the linen wasn't much better but at least it was a reasonably sized bed. Clearly they had overbooked and had given us the dregs. I only used the lift three times and on each occasion other guests were muttering about poor service or disappointing rooms.", "title": "Don't bother", "user": "UKBells", "date": "January 22, 2010", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "location": 4.0, "service": 2.0, "rooms": 1.0}, "id": 54101099}, {"rating": 4.0, "stay_parameters": "Stayed December 2009, traveled with family", "text": "Originally only booked for our first night in Wellington. When we moved to our second booking the next day we were horrified at the location and shabby, dark room. Couldn't get back to the Bay Plaza quick enough. The friendly, helpful staff rebooked us for a further 4 nights. What a relief our holiday was saved. Our room had a fantastic view of the harbour and city sights which were so close by. The room was clean and serviced daily. Will certainly stay again.", "title": "So glad we could extend our stay at The Bay Plaza", "user": "Kamil0", "date": "January 21, 2010", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 53997744}, {"rating": 2.0, "stay_parameters": "Stayed October 2009, traveled on business", "text": "The room was dull and tired, the walls were thin and I could easily hear the TV in the next room.", "title": "Tired & dull - needs updating...", "user": "kiwichiq", "date": "November 3, 2009", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "location": 4.0, "service": 3.0, "rooms": 2.0}, "id": 48378516}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "By far, the worst part of the room was the bathroom. Dark with no windows, and only 1 light that worked. The tiles are dated and moldy, and the shower smelt like urine!! Disgusting.", "title": "Excellent place to stay", "helpfulness": 1, "user": "Lentara", "date": "September 28, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 45128999}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled on business", "text": "The price is expensive for the quality.", "title": "Great View, Pleasant Room", "user": "GeriNZ", "date": "July 2, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 3.0, "rooms": 3.0}, "id": 33768953}], "location": {"country": "New Zealand", "region": "North Island", "continent": "South Pacific", "city": "Wellington"}, "stars": 3.5, "variance": {"poor": 19, "average": 64, "very good": 45, "terrible": 19, "excellent": 12}, "aka": "Bay Plaza Wellington", "slim_ranking": 0.725490196078, "description": "Located on Wellington's exclusive Oriental Parade, the Bay Plaza Hotel is affordable quality accommodation offering harbour and city views in perfect proximity to the Capital's vibrant city centre and superb leisure activities to experience and explore. Te Papa Museum and Courtenay Place 2/5 minutes walk from the hotel."}