{"user_rating": 5.0, "review_count": 589, "name": "Bay Tree House Bed & Breakfast", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled with family", "text": "Ok, it sounds ridiculous that you can have home comforts, excellent non-intrusive hosts, delicious breakfasts and a lovely comfy \"home\" that is unsurpassable for a very reasonable fee.....IN LONDON!!! My mum and neice and I stayed for 3 days at the Bay Tree annex across the road with Breda and PJ, Janice and Peter's close friends who have extended their home to staying guests also on the back of the success of the Bay Tree. You are living with Breda and PJ in their beautiful home and very pretty garden. It was like staying with friends! Tube passes were organised (and paid for in advance by Peter...thanks!), and we were set up for a fierce day of tourism each day on sublime breakfasts! Breda very sweetly asked for my opinion on some ways to improve what she did (I own a small place too ....that's why she asked).....Breda.....Change nothing; you are excellent. See you again soon.", "title": "Absolutely Perfect; Do Not Look Anywhere Else For A City Break For London!", "helpfulness": 16, "user": "mrjohnsondog", "date": "March 31, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 27178556}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled on business", "text": "We had a amazing time staying at Bay Tree House. James and Janice were the most graciouse people who truly love what they do. They were more then helpful in planning our days and even pre-bought our Tube passes for the week. The breakfast was deliciouse and the selction of items could not have been better. James and Janice always put a nice pot off tea on for us every evening after a exhasting day in the city. There is a beutiful park practically right behing the house and the tube station Arnos Grove is a 5 minnute safe walk. I HIGHLY recomend staying here it was such a superb experience. We will definnatly stay here again when we come back to England. Thank you James and Janice for everything your hospitality was what made our trip so much more memmorable.", "title": "Amazing B&B with great Experiences", "helpfulness": 17, "user": "Rocky01Phoenix_AZ", "date": "March 30, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 27097005}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled with family", "text": "Having traveled the world for over three decades, we finally found the ultimate in hospitality, generosity, and friendliness when we stayed at Bay Tree House Bed and Breakfast. From the initial email contact to the final departure, James and Janice consistently offered sage advice and accommodating service that went well beyond that which is normally encountered even in the best of hostelries. From the moment of arrival, James and Janice made us feel like friends and family. My wife, adult daughter and I stayed in the triple ensuite on the second floor to the front. It was a spacious, well acquainted room, large enough to also include a comfortable sofa. The bathroom was very large, especially by European standards, immaculately clean, and well equipped. For relaxing, we had full use of the sun room overlooking the garden that was stocked with many books, especially travel books of London and Britain. Our hosts even extended to us the use of the laptop with wireless service and Skype telephone services. The breakfast was worthy of a Michelin rating. A choice of fruits, cereals, scones, muffins, bagels, yogurts and several juices awaited you at the table. Janice expertly cooked a full English breakfast to order (eggs, sausage, bacon, beans, mushrooms, and tomatoes) or French toast or oatmeal. All with a constant supply of tea or coffee. Before setting off for the day, they packed us up with water and snacks and ensured that we were all set on directions. Whether chatting with Janice in the kitchen in the morning or having a good English Ale with James in the evening, the conversation was always lively and informative. All of this at a very affordable price (a veritable bargain by London standards). In a number of trips to London, we had never lodged outside of Central London, but our experience with James and Janice made the 4-5 walk to the tube stop and 20-25 minute tube ride downtown a very small price to pay for such outstanding accommodations.", "title": "The ultimate in hospitality, generosity, and friendliness.", "helpfulness": 17, "user": "chas_di_hat", "date": "March 26, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 26865533}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "My husband and I celebrated a milestone in our lives with a trip to London and Paris. Our first stop was London and nearly a week at Bay Tree House which was totally charming! Janice and James are 100% real and clearly love what they're doing. Bay Tree House is so clean - you know that saying that it's so clean you could eat off the floors - well, you could. It is also so charming and inviting. Janice and James made us feel at home immediately. They seemed to know how to respond to each guest in the way that was appropriate for that person. Doing this is an art. When we got home I thought of all of the effort that had gone into making our stay at Bay Tree House seem effortless. I know that Janice and James had to work very, very hard to make everyone's stay so perfect, but they never let on that they were working. They were cheerful and focused on service and on ensuring the best vacation possible for their guests. If you wanted to chat, they were great; if you wanted to be on your own, they sensed that and let you be.", "title": "A Dream Come True!", "helpfulness": 17, "user": "Catguy411", "date": "March 25, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 26809155}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled solo", "text": "Our room was big and the decor was absolutely lovely. The beds were very, very comfortable and the bedding was plush. The private bathroom was perfect - large, bright, enormous stall shower, towel warmer (heavenly). Lots of extra toiletries in case we'd forgotten to bring some. Great hair dryer. Plush, fresh towels - felt wonderful.", "title": "Comfort, Quiet, Congeniality...and a dentist nearby!", "helpfulness": 17, "user": "luluestelle", "date": "March 23, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 26707413}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "We had the pleasure of staying at the Bay Tree House for five days in October. We could not have asked for better hosts than James and Janice. From the moment we walked through the door we felt like we were visiting family. Both were extremely helpful in planning our days (ie must see, what to avoid, tube passes, etc). Enjoyed wonderful breakfasts (especially the french toast - yum!) and meeting other guests. Short walk to the tube stop, very convenient, on the Piccadilly Line, in central London in 20 minutes. We would definitely stay at Bay Tree House on our next visit. WONDERFUL!!!", "title": "Best B&B in London! Wonderful Stay!", "helpfulness": 18, "user": "CDoyle79", "date": "March 1, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 25380904}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "Our stay at the Bay Tree was quite excellent!", "title": "A great place to stay with such amazing hospitality; its everything youd hope for in a B&B! !", "helpfulness": 19, "user": "echoboom", "date": "February 19, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 24802410}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled on business", "text": "We had booked our trip, but because of health issues we had to postpone our trip a full year. They held onto our reservation and finally, one year later, we were thankful to finally make it to London. The ease in which we were able to rebook our stay was a great comfort and one less thing that we needed to worry about in planning our vacation.", "title": "Amazing B&B with wonderful hosts", "helpfulness": 17, "user": "Chinamoon", "date": "February 2, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 24119838}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "the quick, easy notes:", "title": "Bay Tree House - Absolutely the Best!", "helpfulness": 18, "user": "SamsonAdelaide", "date": "February 1, 2009", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 24067591, "likes": {"liked": "— Friendly atmosphere, quaint homely accommodation", "disliked": "— Departing for home"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled with family", "text": "--In preparing for our stay, I had sent various emails to the Bay Tree asking random questions and they were all responded to quickly and concisely.", "title": "This was an oasis", "helpfulness": 17, "user": "madodia", "date": "January 10, 2009", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 23440784, "likes": {"liked": "— family atmosphere", "disliked": "— walking from the tube with baggage"}}, {"rating": 5.0, "title": "Wonderful B & B", "text": "My husband and I stayed at the Bay Tree Annex in May & June of this year. We couldn't have been happier with our choice if we tried. We were absolutely exhausted when we arrived after our mammoth 26 hour flight from Australia but were immediately made feel welcome by Breda and PJ who provided us with refreshments and made us feel completely at home. Our room was delightful, bright and spotless, overlooking the back garden, and with our own private bathroom. We had the use of the sitting room to read or relax and the wonderful breakfasts that Breda provided were also enjoyed with the garden in view. We spent an evening or two enjoying a drink on the back patio with Breda and PJ and we couldn't have asked for better hosts who were so helpful in all regards and whose company was equally enjoyable.", "helpfulness": 17, "user": "DesmoNewcastle", "date": "November 16, 2008", "id": 21914841}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "As far as accessability is concerned, we found it an easy walk to and from the tube station of Arnos Grove which is on the Piccadilly line. Travelling to and from London was quick and easy with trains arriving regularly until late. There is a laundromat at the top of the street and an internet store directly opposite, both of which we found extremely useful.", "title": "A very satisfying stay - with wonderful hosts", "helpfulness": 20, "user": "DipuandApuinToronto", "date": "November 16, 2008", "detail_rating": {"cleanliness": 5.0, "service": 5.0, "location": 4.0, "business": 3.0, "rooms": 5.0}, "id": 21904574, "likes": {"liked": "— The hosts, accomodation and the breakfast"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled with family", "text": "Apart from the excellent value for money and comfortable surrounds, the outstanding element of our stay at the Bay Tree House & Annex B & B was the hospitality displayed by both Breda and PJ and we would certainly stay with them again on our next trip to London.", "title": "Home from Home", "helpfulness": 19, "user": "reviner", "date": "November 15, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 3.0}, "id": 21881092, "likes": {"liked": "— frienldly hospitality", "disliked": "— storage space a bit limited"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "A simple and no frill accomodation with a lot of homely comforts. Very *****cleanly maintained. James and Janice are a very helpful and likeable couple. I of course liked Janice more for her wonderful, eat as much as you can and hot breakfast and nicely brewed tea. James is very resourceful in planning your itinerary and travel route and assistance if you are not very familiar with London. We were a first time visitor to London but never had any problem in going around the city. The accomodation is just five minutes walk away from the Tube. The room and the toilet we were allotted is definetely bigger than any of the modern hotel arrangements and were daily cleaned and towels changed.", "title": "This was exactly what we needed!", "helpfulness": 20, "user": "ValP", "date": "November 13, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 21824027, "likes": {"liked": "— They homey feel", "disliked": "— Nothing!"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "The guests who shared the accomodation were also very decent people - to give an idea of the folks you will come across in Bay Tree House.", "title": "Fantastic Value", "helpfulness": 21, "user": "Taminar", "date": "November 11, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 21734607, "likes": {"liked": "— Spacious and comfortable", "disliked": "— No complaints at all"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled on business", "text": "The Bay Tree In is nothing short of magical! The moment you walk up the front drive you get swept into the calm serenity of the neighbourhood and the beautifully kept house. From the moment they open the door, James & Janice are the absolute perfect hosts! While James brings your bags upstairs, Janice invites you into the parlor for a drink and snack...both of which are available throughout the day in the common areas! She'll also help you plan your entire trip and has TONS of fantastic touring advice!", "title": "Beyond Bedazzled at the Bay Tree Inn!!!", "helpfulness": 17, "user": "kozoobie", "date": "January 6, 2009", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 23331271, "likes": {"liked": "— Friendly Service"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "Guests are invited into many parts of the house; the library, the dinning room, the garden outside, all of which are kept clean and inviting at all times!", "title": "Like staying at an old friend's house", "helpfulness": 18, "user": "JenCappella", "date": "January 5, 2009", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 23299702, "likes": {"liked": "— The hospitality", "disliked": "— A bit removed from the city, which wasn't necessarily a bad thing"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2008", "text": "The rooms are to die for and the breakfasts are delicious and leave you satisfied for hours! Don't wait another second...go to the Bay Tree Inn and prepare for a treat!", "title": "excellent hospitality", "helpfulness": 20, "user": "NURSEWATTS", "date": "November 21, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 22056489, "likes": {"liked": "— HOSPITALITY", "disliked": "— NOTHING"}}, {"rating": 2.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "My boyfriend and I (both in our 20s) spent 5 days with James and Janice at the Bay Tree House as one of our last stops on a European getaway. We were welcomed with beer, tea and great conversation the minute we walked through the door, which was very kind and extremely appreciated after our journey.", "title": "It all depends what you want....", "helpfulness": 28, "user": "ChumOz", "date": "November 20, 2008", "detail_rating": {"front_desk": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 2.0, "rooms": 3.0, "location": 1.0}, "id": 22044718, "likes": {"liked": "— The spacious bathroom", "disliked": "— The location"}}, {"rating": 5.0, "title": "Fabulous Bed and Breakfast", "text": "The days that lay ahead included fantastic breakfasts prepared by Janice and more hospitality by both Janice and James then could be expected or imagined. Both were on hand to offer any suggestions or guidance for our daily plans, which included sights to see and pubs to try. There was a great pub in the next hamlet over which offered decent food and cold beer for an extremely reasonable price that Janice informed us of.", "helpfulness": 18, "user": "RodgersCalifornia", "date": "November 18, 2008", "id": 21976215}], "location": {"country": "United Kingdom (UK)", "continent": "Europe", "city": "London"}, "variance": {"poor": 2, "average": 2, "very good": 15, "terrible": 2, "excellent": 568}, "aka": "Bay Tree House Bed And Breakfast", "slim_ranking": 0.00200400801603, "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.5}, "description": "James and Janice Monaghan welcome you to Bay Tree House Bed and Breakfast. Pamper yourself at our luxury B&B here in London at very affordable prices. We have three large rooms beautifully decorated in Old English style with comfortable beds, T.V, and private bathrooms with heated towel rails and outsized showers. We are located in New Southgate, the London Borough of Enfield, and North London."}