{"user_rating": 3.5, "review_count": 41, "name": "Baymont Inn & Suites Alexander City", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with friends", "text": "This is my second stay at this Hotel and the first visit was good so I came back. I felt welcomed by staff and I was very happy with my room for what I paid. The second time around I got a great greeting, and immediately remembered why I already fell in love with this place. Got to my room, was pleased with the layout and everything was just as good as the last. Next morning arrangements to leave was on the agenda but my new plans gave me a reason to stay another day since the event at the park I was going to attend was going to be really late, so I went to ask for an extra night. The lady at the desk, Jennifer I think, was very nice and seemed as she had done this for a while. This is always something that makes me feel at ease, knowing they know what they are doing. I did not leave a review last time because I never thought about it. This time I was reminded by the nice lady and thought I would share this great stay with trip advisor. Double Bridges Park and Wind Creek State Park are on one of the best lakes in the Alabama and a very short drive from Alexander City and this Hotel. Five stars all the way.", "title": "Park Hopper", "user": "Kenneth N", "date": "March 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 154164412}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "Pleasant stay at Baymont last week. Welcoming and helpful staff, clean room, and comfy bed. Traveling to visit a sick family member, so was already stressed a bit and in need of rest. Thankfully, i was able to catch up on much needed rest here and slept very well. Room was nice and clean. Bathroom/ shower were clean. I liked their bed. Once i layed on it, I was out like a light. I had explained a little bit to staff at check in, why I was visiting. I dont remember their name, but staff was extremely nice and told me they hoped evrything works out okay with my realative. That was nice of them. I would definately recommend Baymont to my friends and family. When traveling in this area again, I will probably be staying here.", "title": "pleasant stay", "user": "jen k", "date": "March 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 154041744}, {"rating": 3.0, "stay_parameters": "Stayed February 2013, traveled with friends", "text": "I would suggest that anytime a property is is close proximity to a large lake that the following should be considered:", "title": "Suggestions/remarks", "user": "Allen H", "date": "February 25, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 153141484}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled with friends", "text": "Very early Breakfast and Coffee- Suggest 4 AM", "title": "great value", "user": "Ralph I", "date": "February 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 151806774}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "A clean and comfortable room with firm bed, clean bath and a filling breakfast. We enjoyed ourselves and appreciated the comfortable setting just under a wooded hillside in Alexander City.", "title": "Southern Hospitality", "user": "JohnSchofield", "date": "January 12, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 149485973}, {"rating": 3.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "Stayed here for a night in April of 2013.", "title": "Hotel is showing it's age, but great staff", "user": "codelemur", "date": "April 23, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 158602523}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled on business", "text": "The staff were great. I needed to get something printed and they were able to accommodate me. Check in and check out were also uneventful. The area is fairly decent - the hotel is back from the road a little bit and it was, for the most part, quiet in the building after dark.", "title": "Hotel was great, EasyToBook.com was terrible", "user": "Christopher M", "date": "March 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 155867807}], "location": {"country": "United States", "city": "Alexander City"}, "stars": 2.5, "variance": {"poor": 4, "average": 10, "very good": 14, "terrible": 4, "excellent": 9}, "aka": "Jameson Inn Alexander City", "slim_ranking": 0.666666666667}