{"user_rating": 2.5, "review_count": 930, "name": "Bayswater Inn", "reviews": [{"rating": 2.0, "title": "Good location, But NOT good hotel!", "text": "The location of the hotel was superb, as soon as we arrived we walked to Notting Hill and happened upon the Portobello Market. But the room itself was the smallest thing ever. The bed was against the wall and if you have more than one small bag you will find it difficult to find a place for it. But the worst thing of all was that the bed comforter, it was covered in hair. It was disgusting!!!!! We removed it and put it in the closet. The sheets and pillows were clean but the comforter was not. I would not stay here again but would find a hotel in the area.", "user": "MJAMSA1", "date": "July 17, 2007", "id": 8136007}, {"rating": 3.0, "title": "Much better than expected", "text": "This is a perfect hotel to stay in if you want to explore the city all the days. It's clean and it is located in a good neighbourhood. The breakfast had no high continental standard, but it was OK. When we arrived at the hotel, we were all worried because of all the bad reviews we had read, but the hotel turned out to be much better. It has a great location with several pubs in the area, two great tube lines and Kensington Gardens which you can reach by only a 5 minutes walk.", "user": "adesignforlife", "date": "July 9, 2007", "id": 8081901}, {"rating": 1.0, "title": "previous reveiws do no justice", "text": "If you just want to stay in the hotel all the day long, choose another hotel much more expensive. But if you want to hang around in this beautiful city and just need a place to sleep and rest your feet, this hotel is great.", "user": "AussieTourer54", "date": "June 5, 2007", "id": 7779649}, {"rating": 4.0, "title": "It's fine", "text": "Do you speak English is a commonly used phrase in this Hotel .The staff are mostly european and langauge was a real problem on our stay . having read previous reviews on this hotel we thought we would give it a go as the price and location seemed good , In future I will take more notice of trip reviews ,the hotel lived up to the worst of the reviews . We stayed in room 64 , the mattress had collapsed ,there was no ventilation ,there was a constant smell of mould , the floor had sunk in ( causing problems during the night ) beds were poorly made up and food was left on the floor for up to 4 days . The public areas were old and and unclean as were the public toilets. Surprisingly the bread rolls ,tea and orange juice for breakfast were quite good as was the location .Next time in London I will stay at the sister hotel Faulty Towers .", "user": "scissorsister", "date": "May 15, 2007", "id": 7627610}, {"rating": 1.0, "title": "Maybe the rooms above ground were better....", "text": "This is a good, clean budget hotel - beds slightly hard as were pillows - but bathroom was more than adequate and cleaner than some higher class hotels I have stayed in. You get what you pay for but this was good value for money £49 for double room on laterooms.com. As a place to crash after a party or gig this was great. Close to tube stations and you felt quite safe walking round the area at night.", "user": "xenophilic", "date": "May 15, 2007", "id": 7617127}, {"rating": 1.0, "title": "horrible hotel", "text": "This was probably the worst hotel I have ever stayed at. The room was tiny, dirty, in the basement with one window onto an airshaft. The beds were what we describe in the US as cots and the mattresses were lumpy. The carpet was stained, the curtains dirty. The breakfast was rolls and instant coffee with watered orange juice. We only ate there once. On the plus side, the desk staff was friendly and helpful and the location was good. The room was not noisy, but I think we may have been the only guests in that dank basement. Next time I would definitely spring for the extra money for a decent room.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "May 17, 2005", "id": 3478468}, {"rating": 3.0, "stay_parameters": "Stayed April 2005, traveled on business", "text": "I stayed for two nights in April and received an excellent and reasonable rate through a website. In view of some earlier comments about this hotel, I wanted to record my observations. Although I booked a single room, I was given a triple room on the 2nd floor overlooking Princes Square. I checked with reception to make sure they hadn't made a mistake and they assured me that this was the correct room at no extra charge. So maybe I was just lucky. I found the reception staff pleasant, polite and speedy.", "title": "Good value for money", "helpfulness": 4, "user": "UKnative", "date": "April 28, 2005", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "rooms": 3.0, "service": 3.0}, "id": 3422182}, {"rating": 2.0, "stay_parameters": "Stayed January 2005", "text": "The room was very clean, spacious - compared with what I was expecting - and it proved to be quiet. There were no sounds from neighbouring rooms, and with my windows open at night, all I heard were occasional vehicles driving by, but this was not a problem. The bathroom was newly refurbished with a powerful shower over the bath. Three towels (for the three beds) draped the heated towel rail. The room was adequately equipped for all my needs but storage space may have proved a premium for three persons.", "title": "Disappointing and overpriced hotel", "helpfulness": 2, "user": "jwmpet", "date": "April 15, 2005", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "rooms": 2.0, "service": 2.0}, "id": 3365899}, {"rating": 1.0, "title": "Cold water in a cold winter", "text": "I didn't take the continental breakfast included in the rate, simply as I didn't have time in the mornings.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "February 2, 2005", "id": 3112710}, {"rating": 4.0, "title": "No complaints", "text": "The location is excellent. A couple of hundred metres from Queensway, with its cosmopolitan atmosphere, ethnic restaurants, ranging from Vietnamese to Moroccan - you name it and they are there. Plus Whiteleys shopping centre with more restaurants, a Marks and Spencer food store and cinemas. All the leading fast food chains are also located in Queensway plus a couple of Tescos for any quick provisions. The hotel is served by two Underground stations - Queensway (Central Line) and Bayswater (Circle Line). Also buses that take you to Marble Arch, Oxford Street, Victoria, Westminster and Notting Hill. Lovely Kensington Gardens is just across Bayswater Road. There are even a choice of churches in the vicinity, including Russian Orthodox. Altogether a very suitable hotel at extremely reasonable rates, given it's location.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "January 24, 2005", "id": 3027848}, {"rating": 3.0, "title": "Things you should know", "text": "Nice clear hotel. That descrides it well enough. Not very expensive tho in the center of the city. Only 5 mins walk from the nearest subway station.", "user": "Melinda86", "date": "March 31, 2007", "id": 7259790}, {"rating": 3.0, "title": "Great for Budget Shoppers", "text": "It's situated at a quiet neighboorhood that has everything close. From pharmacy to Burger King (for fast cheap food).", "user": "renni", "date": "March 19, 2007", "id": 7189731}, {"rating": 4.0, "title": "Caught by surprise", "text": "If you have an option, do not choose the breakfast to be included in the fee. It's nothing special. More than a waste of money. Just bread, butter, jams. You can get a sadwich or croissant in great prices very near.", "user": "pettar", "date": "February 20, 2007", "id": 6817074}, {"rating": 2.0, "title": "rude receptionist", "text": "Carry your own shampoo and shower gel. The hotel doesn't provide any. And get a smaller towel cause they only provide a body towel.", "user": "sd604", "date": "February 13, 2007", "id": 6786640}, {"rating": 3.0, "title": "You get what you pay for", "text": "If you come from a 220 (or other voltage) country get your adapter or they charge 3 pounds each.", "user": "LiverpoolDes", "date": "February 5, 2007", "id": 6746440}, {"rating": 1.0, "stay_parameters": "Stayed December 2006, traveled on business", "text": "Location of the hotel was quite good, very easy to get to central London however had some some very dodgy experiences in the week I stayed. Stayed as part of a group of 16 of us - even though we told them who was staying in each room they didn't keep a record. One room was broken into (and locked again) and camera, ipod, and cash were stolen - when the key was left at the front desk. Rooms smelled of cigarette smoke even though smoking is meant to be banned inside. While away on my trip my bank reported that someone had tried to access my credit card account - the only place I had used it was a this hotel - in order to make a local call from my hotel room! Beware!! Don't stay here!!", "title": "Don't stay at the Bayswater Inn", "helpfulness": 2, "user": "kat272", "date": "February 1, 2007", "detail_rating": {"front_desk": 2.0, "business": 2.0, "service": 2.0, "cleanliness": 2.0, "value": 1.0, "location": 3.0, "rooms": 2.0}, "id": 6724521, "likes": {"liked": "— Location", "disliked": "— room break ins and breach of security on credit card"}}, {"rating": 2.0, "stay_parameters": "Stayed January 2007, traveled with family", "text": "Hi Everyone", "title": "Beware!", "helpfulness": 1, "user": "Travel-gal/8323", "date": "January 22, 2007", "detail_rating": {"front_desk": 3.0, "service": 1.0, "cleanliness": 2.0, "value": 1.0, "rooms": 1.0, "location": 4.0}, "id": 6641617, "likes": {"liked": "— location", "disliked": "— room & service,"}}, {"rating": 1.0, "stay_parameters": "Stayed October 2006, traveled with family", "text": "We stayed at this hotel as part of our vacation package booked by Gate 1 Travel. We were there for 4 nights & just got back. I am the type of traveler who has no problem staying in a 1 or 2 star hotel or even a hostel when I vacation in Europe. All I need is a safe neighborhood, a clean bed & I'm happy. This hotel was in a safe neighborhood that offered plenty of food choices & was close to public transportation. However the negatives for the hotel outweighed the positives. Our initial response to the room was \"OK\" but upon closer observation we found multiple things that needed repair or cleaning. This hotel could be a nice place to stay if the owners put out the money to update the facilities – we decided it’s just cheaper to pack the tourist in every few days since a remodel or update would cut into profits.", "title": "Bayswater Inn ruined my trip to London", "helpfulness": 4, "user": "daniel.hopp", "date": "January 4, 2007", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 1.0, "cleanliness": 2.0, "value": 1.0, "location": 1.0, "rooms": 1.0}, "id": 6553369, "likes": {"liked": "— our departure", "disliked": "— the arrogance of those scammers"}}, {"rating": 1.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "Positives - The reception staff were pleasant to deal with. The room had the basic necessaries - heat, hot water in the shower, hair dryer, hot water maker for soup & tea, & a TV for those who need that item. They did offer a free breakfast but choices were very limited (3 types of rolls, butter & jam, coffee, tea, hot chocolate, & watered down orange juice/drink).", "title": "Never Again", "helpfulness": 2, "user": "MacJady", "date": "November 27, 2006", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 2.0, "value": 2.0, "location": 3.0, "rooms": 1.0}, "id": 6180882, "likes": {"liked": "— Location", "disliked": "— The room"}}, {"rating": 3.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "Negatives - This establishment is old & in need of some basic TLC. It has definitely seen better days - The halls & rooms had an odor. Our beds were extremely uncomfortable - we could feel the individual springs poking through. The bathroom was very small - that was OK but I would like to have had a toilet that actually worked. It wouldn't flush unless you took the top off the tank and manually held down the bulb while flushing. I told the front desk but they never responded to my request to have it fixed. (I guess it's just easier & cheaper to pretend you will have a repairman fix it but then not follow through.) The shower stall was so small that when you went to turn around to rinse off your back you couldn't do so without bumping the on-off handle & turning off the water (we're not large people either). There was mold in the shower stall. I couldn't tell if the towels laid out for our last day were stained or possibly dirty. They needed to be replaced. The soap left out for our use had been unwrapped & I couldn't tell if it had been used or not - luckily we had brought our own to use. No shampoo was available – luckily we had brought that too. Bath mat was a piece of paper. No hand towels, just one big bath towel for each adult in the room. Only natural light was a window that looked onto a brick wall several feet away. The luggage room was like others on the site have described it - locked in a room with buzzer access - gave the appearance of security without really being secure - anyone could gain access by simply pressing the buzzer - didn't have to show anything that proved you were guests of the hotel to gain access.", "title": "Neutral Review", "helpfulness": 5, "user": "LAFRAGIA", "date": "November 15, 2006", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 3.0, "location": 5.0}, "id": 6135196, "likes": {"liked": "— Location", "disliked": "— The BREAKFAST !!! Yuck!"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2006", "text": "The hotel really provides quality services, no matter staff, room and restaurant. Location is also definitely an advantage. I heartfelt recommend to anyone who will travel for any purpose.", "title": "Quality Services", "helpfulness": 3, "user": "winningteam", "date": "November 12, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6109541}, {"rating": 1.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "This place was terrible.", "title": "Horrible Hotel", "helpfulness": 2, "user": "NZtraveller2", "date": "October 26, 2006", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "location": 4.0, "rooms": 1.0}, "id": 6014180}, {"rating": 1.0, "stay_parameters": "Stayed August 2006, traveled on business", "text": "The beds were awful (the springs would dig into me and wake me up all night). The staff were unfriendly. There was no handtowel and the bathmat was a piece of paper. The rooms were dirty. The breakfast was much worse than a hostel I stayed at for half the price. Do I need to say anymore? For the price I thought this was a terrible place to stay!", "title": "vile", "helpfulness": 2, "user": "robEK2", "date": "September 16, 2006", "detail_rating": {"value": 1.0}, "id": 5806390, "likes": {"liked": "— nothing", "disliked": "— everything"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2006, traveled solo", "text": "tiny rooms. mouldy bathrooms. very uncomfortable camp beds. smells terrible. basement rooms mean you can't leave a window open for fresh air incase someone comes in. unfriendly staff. terrible breakfast -bread rolls, cheap orange juice, and a mild excuse for coffee.", "title": "Hyed Park so close.", "helpfulness": 2, "user": "JesterDonnelly", "date": "August 14, 2006", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 5609543, "likes": {"liked": "— The choice of services", "disliked": "— The breakfasts erved by you guys"}}, {"rating": 1.0, "stay_parameters": "Stayed December 2005, traveled solo", "text": "Need i say more? Spend a few more pounds and have a much better experience.", "title": "Moldy bathrooms, horrible staff", "helpfulness": 2, "user": "Buffy T", "date": "August 13, 2006", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "location": 4.0, "rooms": 1.0}, "id": 5605296, "likes": {"liked": "— Nothing", "disliked": "— Rooms were very unclean and staff disorganized"}}, {"rating": 3.0, "title": "You get what you pay for", "text": "Stayed from Dec 27 till Jan 3. The rooms are the size of a room on a Cruise. Ample closet space,2 beds,small desk with 2 chairs,nice size bathroom with plenty of hot water and great water pressure. we were on the 2nd floor and there was no noise. The room was CLEAN and the beds were made every day and the 2 towells were replaced. The breakfast was very basic but it was FREE. The staff was polite. Long walk to the TUBE. Plenty of resturants nearby. Was not the RITZ but well worth the price", "helpfulness": 12, "user": "DavyGGG", "date": "January 4, 2006", "id": 4325390}, {"rating": 1.0, "title": "Never again!", "text": "Got a small, noisy basement room with hardly any ventilation. Never will I stay in this hotel again. Stay away!", "helpfulness": 5, "user": "A TripAdvisor user", "date": "January 2, 2006", "id": 4316355}, {"rating": 1.0, "title": "And they sd it was handicapped friendly--ha, ha, ha", "text": "What a joke!!!! I will never stay there again....I could hardly even get through the door.", "helpfulness": 9, "user": "A TripAdvisor user", "date": "December 30, 2005", "id": 4311877}, {"rating": 2.0, "stay_parameters": "Stayed May 2005", "text": "I use a wheelchair and before I scheduled my trip I called and spoke with the hotel staff who assured me that there were no stairs and the elevator doors were large enough for a wheelchair. Obviously they were wrong and extremely rude when I talked to them about the problem!!!!!!!!!!", "title": "Never again", "helpfulness": 10, "user": "Cres", "date": "September 16, 2005", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "rooms": 2.0, "service": 1.0}, "id": 3908909}, {"rating": 1.0, "title": "Never no more !!! Parasites !!! No breakfast and dirty !", "text": "I stayed at the Bayswater Inn with my wife and will not return. The room was too small.", "helpfulness": 21, "user": "A TripAdvisor user", "date": "July 21, 2005", "id": 3690109}, {"rating": 3.0, "title": "you get what you pay for", "text": "After having already booked and paid for our room, I then read the reviews and was really worried.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "January 12, 2005", "id": 3003380}, {"rating": 2.0, "title": "sorry, but only for deaf persons", "text": "As I approached the hotel I was really apprehensive. I was told to come back at 3pm because the room was not ready, and left our bags in the chicken coup as described in earlier reviews. We returned at 3pm and were given the keys to our basement room (oh my god earlier reviews going through my mind again). As I opened the door the cleaner nearly had a heart attack as we came in. Back to reception to wait for another half hour; things were not looking good!. Finally got into our room and was relieved to find it very clean and tidy. No bugs running around or mould on the wall", "helpfulness": 4, "user": "A TripAdvisor user", "date": "December 18, 2004", "id": 2898485}, {"rating": 2.0, "title": "The good, the bad, and the ugly", "text": "The only problem was that the bed badly needed a new mattress, as it was impossible to sleep on, so we slept on top of the sheets etc, and as it was so warm in the room this was not a problem.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "November 11, 2004", "id": 2818977}, {"rating": 1.0, "title": "Absolutly disgraceful.", "text": "Woke in the morning, had a tepid shower and discovered I was covered in bites of some description!!.", "helpfulness": 2, "user": "Grace K", "date": "November 4, 2004", "id": 2805274}, {"rating": 3.0, "stay_parameters": "Stayed February 2005", "text": "We went to breakfast really out of curiosity, to see if the previous reviews were right, and regrettably they were.", "title": "Good cheap accomodation", "user": "betotal", "date": "October 18, 2004", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "service": 3.0}, "id": 2754756}, {"rating": 4.0, "stay_parameters": "Stayed February 2005", "text": "We had a triple room (me, husband and daughter) and we have no complaints except for a broken bedside lamp, we paid £ 177 for three nights all in all and we were pleasantly surprised by the comfort, service etc.", "title": "Wow.. we must have been lucky...", "helpfulness": 3, "user": "cecla414", "date": "July 1, 2005", "detail_rating": {"cleanliness": 3.0, "value": 5.0, "rooms": 3.0, "service": 3.0}, "id": 3624508}, {"rating": 1.0, "title": "Dirty Bayswater Inn", "text": "Breakfast wasn't fantastic but not bad either.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "June 26, 2005", "id": 3611835}, {"rating": 1.0, "title": "Steer Clear!!!!!!", "text": "My family and I booked three room at this hotel. It was the worst we have ever encountered. Bathrooms very dirty with broken tiles and dirt coming through the tiles, rooms dusty and filthy. From the moment you walked in this hotel you wonder which HELL I am in.", "helpfulness": 8, "user": "A TripAdvisor user", "date": "June 21, 2005", "id": 3589625}, {"rating": 1.0, "stay_parameters": "Stayed June 2004", "text": "I stayed at the Bayswater Inn as a single guest on May 29-30, 2005 and will definitely not ever return. I was booked into a single room in which I could barely turn around. There was not even enough space to lay my suitecase out - I had to close my suitecase in order to get to the bed.", "title": "Bad Hotel", "helpfulness": 7, "user": "koalaip", "date": "June 17, 2005", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "service": 1.0}, "id": 3571369}, {"rating": 1.0, "title": "Never Again", "text": "The worse part however was the noise. My room was in the basement and located next to the housekeeping closet. At 06:30 AM, I was awakened by bags of bed linens being thrown against my window which just happend to be next to the door which supplied the housekeeping closet. I reported this to the front desk, asked for another room, and was refused. Not even a courteous apology or explanation was provided.", "helpfulness": 5, "user": "lynzee", "date": "June 14, 2005", "id": 3550181}], "location": {}, "stars": 3, "variance": {"poor": 185, "average": 291, "very good": 145, "terrible": 269, "excellent": 40}, "aka": "Bayswater Hotel London", "slim_ranking": 0.768802228412, "detail_rating": {"service": 2.5, "cleanliness": 2.5, "value": 2.5, "sleep": 2.5, "rooms": 2.0, "location": 4.0}}