{"user_rating": 3.5, "review_count": 408, "name": "Bayview Hotel Singapore", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "On the plus side, the pool area is a nice place to hang out and there is a 24hr 7/11 and a food court right beside the hotel, also the housekeeping lady was really lovely.", "title": "Wouldn't stay here again", "helpfulness": 1, "user": "MissBrisbane", "date": "September 19, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 1.0, "rooms": 2.0, "location": 3.0}, "id": 80105163}, {"rating": 3.0, "stay_parameters": "Stayed August 2010, traveled with friends", "text": "Downside, We had a room right at the lift and the noise was horrendous! Some nights I couldn't get to sleep till 2 or 3am. The pillows were lumpy and we've gave breakfast a miss most days as it was fairly poor, but ook if you're just looking for some coffee and toast. The rooms were very basic and the walls needed to be scrubbed down.", "title": "Great location but could do with renovation.", "user": "mm_travel8", "date": "September 1, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 77885274}, {"rating": 3.0, "stay_parameters": "Stayed October 2009, traveled on business", "text": "Overall I wouldn't stay here again.", "title": "Decent accommodation", "user": "shantichop", "date": "August 26, 2010", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 77018180}, {"rating": 3.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "Had a fairly good stay at Bayview. The location is fantastic, walking distance to Albert Sq, Sim Lim and Dhoby Ghaut with buses out the front too. For those who want to walk, Orchard Rd is only abt 15mins walk away. However, the hotel does look a bit tired and old now. The fitness centre is not great and the hotel in general can do with some renovation. However, if you're not in the hotel much and want a convenient location, Bayview is a great spot for it.", "title": "Basic hotel, but great location", "user": "edace", "date": "August 22, 2010", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 2.0, "sleep": 2.0, "rooms": 2.0, "location": 4.0}, "id": 76268946}, {"rating": 4.0, "stay_parameters": "Stayed July 2007", "text": "Decent and affordable accommodation, reasonable walking distance to orchard road or marina square.", "title": "Good location, nice rooms bad breakfast", "user": "karol85", "date": "June 17, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 67814804}, {"rating": 4.0, "title": "OK but \"Bayview\" is a bit ironic!", "text": "Stayed here two nights on a business trip. It was Ok but basic. Our room window looked straight onto a concrete wall. \"Bayview\" is a bit ironic! The room was rather small, as was the bathroom, but clean and adequate for a short stopover. Service was good. Breakfast was also good but nothing special. Location is very good - very close to Singapore Art Museum and the National Museum, which really needs a half-day to visit and follow the excellent audio-guided tour of the exhibits laying out the history of Singapore (especially WWII).", "user": "A TripAdvisor user", "date": "December 6, 2010", "id": 89141760}, {"rating": 3.0, "stay_parameters": "Stayed November 2010, traveled on business", "text": "I travelled with my school to Singapore for a conference, and we stayed in this hotel. When we first arrived, I saw the hotel lobby had 80s renovation and was quite small. However, the room was renovated and the toilet was very clean. It looked like I would enjoy my room, but however it was really a mixed bag. First off, the air conditioning was too cold and I often woke up in the middle of the night because I was freezing. I turned off the air conditioning for one night and it was better, but just by sitting in the room without air conditioning proved to be too hot. Another problem with the room is the room is not sound-proof. What I mean is I can hear any noise from neighboring rooms as well as rooms on the next floor. This woke me up twice during my stay at the hotel. It was hard for me to fall asleep again given the beds are not that comfortable. The hotel breakfast was really not that superb. There is little choice in terms of food served and the food was the same every day. However one good thing is the location of the hotel, as there is a local Singaporean canteen a minute's walk from the hotel. The food there, unlike the hotel, has many choices and the food is cheap compared to other restaurants in Singapore. The hotel is also a minute's walk away from the nearest MRT station, which proved very convenient for me as I liked to travel on the MRT to other parts of Singapore. Overall this hotel is great for budget travellers; but for travellers looking for slightly more, stay away!!!", "title": "Great location, bad nights sleep", "user": "tibetanrangertwo", "date": "December 1, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 2.0, "rooms": 4.0, "location": 5.0}, "id": 88720582}, {"rating": 4.0, "stay_parameters": "Stayed December 2010, traveled solo", "text": "I can't speak more highly of this hotel, its good location, facilities and most helpful staff.", "title": "Good value, service and location", "helpfulness": 1, "user": "BlackCat2119", "date": "December 1, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 88715214}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "Its location was the main reason for my choice. Situated in the CBD, it is only a few minutes walk in the shade to the nearest train station (Bras Basah MRT) and a short stroll to Orchard Road shops and Raffles City.", "title": "A great choice", "user": "Kimi F", "date": "November 28, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 88470632}, {"rating": 4.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "The facilites are very good. The reasonably large room came with Internet, effective room temperature control, and facilities for coffee making and ironing. Room was dry enough for washings to dry overnight even in the bathroom.", "title": "Wonderful Hotel - right in the City Center", "helpfulness": 1, "user": "jsbi", "date": "November 12, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 86843689}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled on business", "text": "The Bayview is a good (but not high) quality hotel which I’ve used a couple of times this year. For Singapore, this hotel represents excellent and affordable value.", "title": "Good location, good value and I'd go back readily", "helpfulness": 1, "user": "GB01", "date": "November 1, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 85628219}, {"rating": 3.0, "stay_parameters": "Stayed October 2010, traveled on business", "text": "Hotel highlights are; clean but basic rooms, fast in-room internet (you will need to ask at the front desk for an Ethernet cable), a good shower, a smallish roof-top pool, an adequate breakfast (with both Western and Asian food), an in-room safe and very pleasant and helpful staff.", "title": "You pay for what you get - not bad - but they should call a plumber", "user": "BusinessTravelsAsia", "date": "October 29, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 3.0}, "id": 85230061}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "The only downside was that the gym located by the pool is too small, the equipment too limited (just one small bike and one treadmill) and the room is far too hot to use. BTW the poster photo of the swimming pool is very misleading - the pool has a cityscape in the background, not an airbrushed blue sky!", "title": "Very comfortable hotel", "helpfulness": 1, "user": "kathmd", "date": "October 18, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 83901362}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "The Bayview is well situated - on Bencoolen Street, near Fort Canning park - for the city. It’s very close to the MRT metro (Bras Basur station) and the airport takes around 30 minutes in a taxi (S$20 – S$25). An Irish Pub has just opened around the corner and there’s a good ‘Coffee Bean and Tea Leaf’ concession in the same block. A ‘7 to eleven’ is also close by and my tip would be to buy an international phone calling card (S$10) there to use back in the room.", "title": "Clean & Attentive Service", "user": "Yap88", "date": "September 27, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 81195861}, {"rating": 3.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "I’d certainly go back to the Bayview - it's a perfectly adequate hotel for short stays.", "title": "Classic Hotel, nothing fancy", "user": "duschted", "date": "September 19, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 80149214}, {"rating": 3.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "Stayed for 2 nights and got the room right by the lift which never stopped and was very loud. If we were staying any longer would have asked to be shifted. Rooms ok nothing fancy, Breakfast the same ok nothing brilliant. Location ok and can walk to Bugis and Orchard Road but my preference is around Chinatown and the Quays. Would not stay there again as I dont think it was value for the money we paid", "title": "Very Expensive for what it was", "user": "kiwi024", "date": "June 15, 2010", "detail_rating": {"cleanliness": 3.0, "sleep": 1.0, "location": 3.0, "value": 2.0, "rooms": 1.0}, "id": 67646847}, {"rating": 3.0, "stay_parameters": "Stayed June 2010, traveled on business", "text": "I am actually typing this from my room at the Bayview so the poster who said there was no internet access is mistaken. I agree with the postings here - location is fantastic. Staff are friendly but my safe hassn't worked since I've been here - maintenace seems to be an issue. Room very clean - TV basic channels and a bad picture. I'm at the back on the 11th Floor. Noise from, I think air con on the roof of neighbouring hotel but not excessive. Breakfast varied but nothing to write home about. Roof top pool isn't as great as it sounds. On the whole hotel not luxurious but a great central base.", "title": "Great location - nice enough hotel", "helpfulness": 1, "user": "mags56", "date": "June 12, 2010", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 67264376}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "We spent 7 nights in a large comfortable, well equiped room. Room was fully serviced every day. Location cannot be beaten. Breakfast was great - lots to choose from. Pool was lovely, clean and inviting. Also gym and sauna near the pool. Staff very friendly and allowed us to spend the day (after the midday checkout) at the hotel and use the pool etc and have a shower before we left for the airport that night. Staff also gave lots of advice about transport etc. and spoke good english. Concierge and porter were excellent also. Only 1 very minor problem was that the wardrobe door hinge was bent and the door did not shut easily. Housekeeping staff should report it. Would definitely stay here again.", "title": "Very comfortable hotel", "user": "SunshineCoastJag", "date": "June 11, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 67172769}, {"rating": 3.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "Stayed for one overnight. Standard room large enough, has the necessities, wall paper peeling off walls, bar fridge poorly stocked. Needs some renovation. I found it expensive compared to European hotels. No internet facility. Breakfast buffet quite good. Staff friendly and helpful. I did not compare price with other Singapore hotels and if comparable, I would stay there again for a short overnight stay.", "title": "Fairly close to Orchard Rd, older type hotel, clean but needs update", "user": "vippygeo", "date": "June 8, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 66911908}, {"rating": 3.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "We booked a last minute trip to Singapore after receiving an extension to the labour day holiday in China. We were shocked by how expensive hotels were in Singapore, especially of some which were certainly of a lesser quality!", "title": "Excellent location, average hotel", "user": "ZoeGreg", "date": "May 23, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 65040207}], "location": {"country": "Singapore", "continent": "Asia"}, "stars": 3, "variance": {"poor": 39, "average": 127, "very good": 181, "terrible": 17, "excellent": 44}, "aka": "City Bayview Hotel Singapore", "slim_ranking": 0.517361111111, "description": "Contemporary Fifteen-story Hotel located 4 km from train station & 22 km from airport."}