{"user_rating": 4.0, "review_count": 32, "name": "Bayview Resort", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "We stayed here one night after staying at another nearby hotel for two previous nights. It was significantly less expensive (though we negotiated a lower rate) and every bit as nice. The service was exceedingly friendly and the Lagoon that it abuts is beautiful. The beach is small and rocky, so it's not perfect for swimming, but it seemed great for snorkeling (the weather was bad while we were there so we didn't do it ourselves). It had significantly fewer guests than some apparently better-known hotels nearby (as our previous one was), but we couldn't tell why. We had a lovely time.", "title": "Good value for money.", "helpfulness": 1, "user": "AnotherTraveler1980", "date": "October 14, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 83495740}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "We stayed four nights at Bay View, we arrived in on the day of Leo's (the owner) birthday. We were treated as part of the family, joined with the wonderful family for the birthday feast. It was fantastic, food, dancing, singing, we got the lot. The fresh water pool that goes in an out with the time was a great place to relax. The lagoon was great with something going on all the time.", "title": "Heaven in paradise", "helpfulness": 1, "user": "Juliemary", "date": "August 29, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 77422518}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "My only fault with Bay View is they did not have \"good wine\" on hand, but they did make good cocktails. I will be back.", "title": "Paradise Perfect", "helpfulness": 1, "user": "njbrd1", "date": "July 29, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 72901447}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "We had a wonderful time and really enjoyed the relaxed ambience at Bayview. Loved the accomodation (combined traditional fale with cabin and ensuite) and the meals were far too tasty!", "title": "fabulous fales, lagoon and hospitality", "helpfulness": 1, "user": "DPS140752", "date": "July 28, 2010", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 72782934}, {"rating": 4.0, "stay_parameters": "Stayed February 2010, traveled solo", "text": "The staff were just lovely and as helpful as can be. After a week we felt we had made friends and it was wrench to leave. We will absolutely be back!!", "title": "Most unique environment...", "helpfulness": 1, "user": "ewigeblumenkraft", "date": "February 19, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 56524161}, {"rating": 4.0, "title": "Great food, nice people", "text": "We, my Mum and I, spent two nights at Bayview resort when we went to Savaii, Samoa for a wedding. The fale, we had one without an open outside part, was basic but functional and comfortable. We had aircon and a small ensuite. I booked online six months before our trip and we were charged only $200 tala per night (I see someone else paid $300 a night... maybe for a bigger room or more guests?) which I thought was reasonable as it included an extensive breakfast.", "user": "Angelco", "date": "July 5, 2012", "id": 133556874}, {"rating": 5.0, "title": "Get away from it all", "text": "Bayview doesn't have a nice beach area, but you can swim and kayaks are free to use. The food was really good and we found the staff were very friendly. I would also recommend that you hire a car as it is a few minutes drive to any other resort or a good swimming beach.", "user": "Ontheblack", "date": "June 30, 2012", "id": 133137720}, {"rating": 5.0, "title": "Lava and more lava!", "text": "We isolated ourselves from the outside world so we didnt access the internet etc.", "user": "snorm57", "date": "June 30, 2012", "id": 133092924}, {"rating": 5.0, "title": "Savaii's undiscovered diamond", "text": "The staff were extremely friendly. Breakfast was wonderful.", "user": "Roimata31", "date": "June 22, 2012", "id": 132516197}, {"rating": 2.0, "title": "nice people, lousy value", "text": "Just a tip, hire a car to drive here. The resort picked us up from the ferry but then we were isloated without transport. Because we were not on a tight schedule we caught the local bus back to town and hired a car there.", "user": "kikiruns", "date": "June 9, 2012", "id": 131631803}, {"rating": 5.0, "title": "A great start to our holiday", "text": "Stayed 4 days and we were pleased we had chosen Bayview. As soon as we arrived we were made to feel 'special' by Sesilia and Leo and their wonderful staff. A special evening was put on for my birthday that included a surprise cake and some lovely Samoan dancing. It will be a treasured memory for us both. The different Samoan food on the menu was very well presented with breakfast being a real treat. Our beach front villa with an ensuite and attached fale was roomy with all we needed and had a lovely view over the lagoon.Every day the sand area around the villas and beach was groomed and the flower gardens tended by the lovely lady helpers ( who also make wonderful lei's). The beach area may not be large but the snorkelling around the rocks can be very enjoyable. If you want somewhere that is super friendly, clean, comfortable and reasonably priced ,this would be it.", "user": "Lifestyle2011", "date": "August 14, 2011", "id": 116685082}, {"rating": 4.0, "title": "really enjoyed our stay", "text": "We spent 3 nights at Bayview Resort with our three teenage kids. We booked 2 airconditioned fales, one of which was 'waterfront'. The resort is located in the lavafields and does not really have a beach (some sand goes all the way to the water, but you have to walk over rocks getting in the water), which was the only thing we missed, really. Reef shoes are recommened.", "user": "Marthune", "date": "July 28, 2011", "id": 115935277}, {"rating": 4.0, "title": "Not the typical 'resort' but well worth considering for a couple of days", "text": "The lagoon in front of the chalets is very safe and the free kayaks have been well used by our kids.", "user": "Islander_8_58", "date": "July 5, 2011", "id": 115046697}, {"rating": 5.0, "title": "Most helpful staff on Savaii.", "text": "Complementary Breakfast was absolutely wonderful, the other meals very good. Staff is very friendly and helpfull, but maybe a little uncomfortable in their dealings with tourists.", "user": "Pacificroamers", "date": "May 28, 2011", "id": 110183748}, {"rating": 4.0, "title": "One of the best resorts on Savai'i", "text": "Fales were very comfortable and clean.", "user": "katies08", "date": "May 11, 2011", "id": 107880985}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "We have just returned from a few lovely days at Bayview Resort. It is a beautiful spot right on the lava fields and the gardens now growing on the lava are beautiful. I noticed they have also planted frangipani and other trees so it is only going to get more beautiful.At high tide it is a warm spot to swim. The other really nice part of this place is that it is away from other accommodation providers so on a walk up the road you see real Samoan village life.", "title": "Beautiful landscaped lava fields", "helpfulness": 1, "user": "Sally J", "date": "June 26, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 3.0}, "id": 33267614}], "location": {"country": "Samoa", "continent": "South Pacific"}, "variance": {"poor": 2, "average": 2, "very good": 17, "terrible": 0, "excellent": 11}, "aka": "Bayview Resort Samoa", "slim_ranking": 0.666666666667, "description": "Situated on the Saleaula Lava Fields fronting on to the ocean is this safe and peaceful haven. Built for your comfort and privacy, Bayview Resort offers beauty that is natural and untouched. The dramatic Lava surrounding and the islet opposite the resort is pure nature, with fresh water springs bubbling up in the midst of the lava rocks, and creates a fresh water pool to soothe you when you feel hot. A place to unwind and recuperate before you explore its historic surroundings. Comfortable, panoramic scenery, affordable and worth it."}