{"user_rating": 4.5, "review_count": 459, "name": "Beach View Motel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed July 2013", "text": "What we have here is a clean, friendly, and centrally located hotel in Rehoboth Beach that is practically on the boardwalk at a price that won't break the bank.", "title": "Can't be beat in Rehoboth Beach!", "helpfulness": 1, "user": "tapdancer77", "date": "July 9, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 166991793}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "First: Location--this hotel is on Wilmington Avenue, one block south of Rehoboth Ave, and literally next to the boardwalk.", "title": "Great location, great service!", "user": "Juliet4701", "date": "July 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 166973982}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "Second: the hotel has some very nice extras including a free breakfast, cookies (which our son loved), and a wine hour for us adults.", "title": "Best place to stay in Rehoboth when on a budget.", "helpfulness": 1, "user": "Daryl L", "date": "July 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 166938685}, {"rating": 5.0, "stay_parameters": "Stayed July 2013", "text": "The rooms are clean (if basic) and feature flat screen TVs. I was really impressed, and so was my family! This hotel really earns your business! We'll definitely be back next summer!", "title": "Great place - loved it!", "helpfulness": 2, "user": "magilagudy", "date": "July 8, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 166814337}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "My daughter and I had a wonderful stay at the Beach View over the Fourth of July weekend. The location cannot be beat for a 7-year old, because it is right next to Funland, the amusement park, and in the ocean block. We could see the ocean from our balcony. We greatly appreciated being able to park our car, change, and shower after being at the beach when we arrived very early on the day of our check-in. The continental breakfast is ample, and we also drank the complimentary wine at 5, and the chocolate chip cookies at 8! The pool is tiny, but my daughter still liked it, and we were there for the beach anyway. Very close to a bunch of good restaurants for kids (Grotto's Pizza, Green Turtle, the Royal Treat ice cream parlour). Very nice staff at the hotel. The rates were high - but one has to understand that it is for the Fourth of July in Rehoboth, probably the most popular weekend of the year.", "title": "Great location!", "helpfulness": 4, "user": "MMB101", "date": "July 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 166807587}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "This has to be one of the best hotels in Rehoboth Beach. We stayed here during our vacation at the beach. The staff is \"over the top\" friendly and they go out of their way to make sure your accommodations are top notch. The rooms are extremely clean and are taken care of every day. Parking is for the customers only so you always know you have a parking space off the main street. We will make this our number one hotel whenever we stay in that area.", "title": "Rehoboth Beach Trip", "user": "Gregory M", "date": "June 30, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 165737762}, {"rating": 5.0, "title": "These people \"get it\" when it comes to customer service.", "text": "I am a corporate customer service manager for a $5 billion dollar company and have been doing it for more than two decades. Therefore i tend to be overly picky and unforgiving when it comes to customer service. However, I just spent 5 nights at Beach View with my husband, adult daughter and teenage son and I cannot say enough about the excellent service and the extra \"perks\" of the wine, cookies and unbelievable continental breakfast which was way more than a typical \"continental\" breakfast. These people get it... service, service, service. That is why they have repeat customers. Definitely worth the $$$$", "user": "A TripAdvisor user", "date": "June 29, 2013", "id": 165692069}, {"rating": 5.0, "stay_parameters": "Stayed June 2013", "text": "We really enjoyed our stay at the Beach View Motel and will definitely be staying here again! The location was convenient (beach chairs were available for use) staff was friendly, rooms were clean, and a great breakfast was served every morning!", "title": "Convenient, great staff!", "user": "Shellsbells2boys", "date": "June 29, 2013", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 165647102}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "My husband and I have found our home away from home at the Beach View. The location, cleanliness and friendliness of the staff just cant be beat. We were pleasantly surprised that the rooms we have stayed in this year (two stays so far) were renovated. I am checking the website now to see when we can go back this year!! The only downside is the noise from Funland in the evening and the trash trucks in the morning but there is nothing that can be done about that. The staff is just wonderful and very welcoming.", "title": "Love the Beach View!!", "user": "mmm1964", "date": "June 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 165634963}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "I am very fussy and demand cleanliness and kindness. Just got home today and", "title": "Our 3rd year in a row visit", "user": "Mary S", "date": "June 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 165577055}, {"rating": 3.0, "title": "customer service", "text": "The one and only reason the Beachview Motel is a true pleasure is because of Gemma!!!!! The woman is all about the guest and their needs. Above and beyond informing you of your stay from start to finish, including the wonderful breakfast.", "helpfulness": 1, "user": "Gorgous d", "date": "July 3, 2013", "id": 166214970}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "We really enjoy our annual stay at the Beach View. They treat every guest like kings! Waking up in the morning and going downstairs for a great breakfast, not having to endure the long line of \"Royal Treat\" next door, then rolling into the pool or sauntering over to the Beach or Funland, all while the rooms are tidy'd up quite nicely, is a huge selling point of why we stay there. The wine and snacks in the afternoon are perfect after a day out and about, and the 8 pm cookies are a nice after dinner treat! Coffee and Tea always available, and the front desk staff are hugely knowledgeable in the area and what to do in the area. Thank you Adele and staff for all you do for us!", "title": "Love The Beach View Motel!", "user": "btcny", "date": "July 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 166182717}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "My husband and I stayed with our grandson and we all enjoyed all of the great sevice and accommodations. The staff are very friendly and truly make you feel at home. The continental breakfast was wonderful more than just a continental breakfast. Along with the location so close to the boardwalk and all of the other attractions we wanted to take advantage of shopping, kid rides and games, and good food. There is a shower and pool at the hotel which is so nice, you do not have to stay on the beach the whole time to enjoy the water. Everything was clean and welcoming we have already booked for next year!", "title": "Great Place in Rehobeth Beach", "user": "Ang3343", "date": "July 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 166050157}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "Great location in Rehoboth Beach! Walking to beach, boardwalk, and restaurants. Me and my family will be returning here again next year. The room was very clean and the maid staff were great. We enjoyed the pool at the end of each day for after beach. I would recommend the street side of the hotel for relaxing on the balcony and people watching.", "title": "Perfect Family Stay", "user": "Steve B", "date": "July 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 166030287}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "All of the extras they provide create such a welcoming experience. They have something at breakfast for everyone. We missed the wine reception both evenings, but the kids didn't let us miss the at 8. Pool is kept very nice. If I had to find 1 way to improve the Beachview it would be to invest more than the minimum in their planters around the property and at the pool. I know that's being picky, but that's really the only thing I think they should improve on. For the $ and location, YOU CAN'T BEAT IT! We've stayed several times, and will return.", "title": "best bet for the $ in Rehoboth", "user": "Oompa1411", "date": "June 30, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 165744380}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "We have been going here for years and every year is wonderful because of the staff. They are very helpful when needed. Quick at getting what is needed. Great Breakfast and cookie hour. The pool is great. The location is in the middle of everything. You can see the ocean no matter if you stay poolside or in the balcony side.", "title": "Awesome BeachView Hotel!!!!!!", "helpfulness": 1, "user": "Darlene R", "date": "July 8, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 166791727}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled with friends", "text": "Our stay at the Beachview was great. The location was great could walk everywhere. Getting a balcony room is perfect as you can see the beach and the sun rise. Everyone was extremely friendly and accommodating. We loved the wine at 5pm and the cookies at 8pm were a great touch. Felt like being at home. Yes, the feel of the hotel is old but well worth it. I would definitely return.Was a bit noisy in the am but we did have the door open to the road.", "title": "fantastic location and people", "user": "judy k", "date": "July 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 166726909}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "Loved this Motel. If we were ever back in the area we would deffinately return. Staff are very helpful, and gave us top tips on some great places to eat (many thanks too for the treat to help celebrate my hushands \"Big \" birthday.) Breakfast was good, and the complimentry glass of wine and cookies an added bonus. Room was very clean and comfy, and was a very good size. The balcony was a joy! (not sure all the rooms have one, so do be specific when you book, if you want a balcony) Rehoboth Beach is a great place to stay and being so close the beach is a real treat. There a lots of places to eat in many budget ranges. Thanks for a lovely stay to all the staff.", "title": "Very Nice Personal Touch", "user": "MrsJTraveller", "date": "July 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 166711360}, {"rating": 5.0, "title": "Belove 1 \"Love The Beach View Hotel\"", "text": "My stay at the Beach View Hotel was just wonderful. Great staff and I thought my light bulb was out and so I called the front desk and someone was there in a second. Only to find that I did not turn on the light switch. The breakfast was great more than a continental breakfast. I recommend the room with a balcony nice and peaceful experience. I will be returning in September 2013 and I can wait.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "July 4, 2013", "id": 166345421}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "2nd time we have stayed there. Will go back. If you are a Marriot/Sheraton-large chain/luxury \"hoteler\" then this is NOT the place for you. But if you are looking for local feel, close proximity to the beach and a basic place then this is a nice place to stay. It has a budget motel feel based on room size and decor, but it really is a nice place to stay. You are one block from the beach/boardwalk. Walking distance to EVERYWHERE, we parked our car and never moved it. The rooms are very clean, functional (small refrig. and microwave), and all the soaps/shampoos are from Bath and Bodyworks, so nice. Small pool, but why would you go there if you are at the beach! Breakfast in the am, and wine in the afternoon add to the local feel. The people who work there are wonderful, they make every attempt to accommodate any question, need, ect and that is what makes this place special. If you want an easy place to stay, that is super close to the beach, you will appreciate this hotel.", "title": "A nice local beach hotel", "helpfulness": 1, "user": "mdpters", "date": "July 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 166333354}], "location": {"country": "United States", "city": "Rehoboth Beach"}, "variance": {"poor": 3, "average": 11, "very good": 102, "terrible": 4, "excellent": 339}, "aka": "Beach View Hotel Rehoboth Beach", "slim_ranking": 0.0344827586207, "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.5, "rooms": 4.5, "location": 5.0}, "description": "Convenience and value are why guests return again and again to the BeachView. Our fantastic location offers great ocean views and easy access to all of Rehoboth’s attractions. Coupled with exceptionally clean rooms and the friendliest staff anywhere, the BeachView is your best choice when searching for beach accommodations."}