{"user_rating": 4.5, "review_count": 380, "name": "Beach Republic The Residences", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with friends", "text": "1) We were upgraded to from the Club Suite to the Superior Club Suite free of charge upon arrival and this included air conditioning, a kitchen, extremely comfortable queen size bed (with a pillow menu), lounge area, gorgeous bathroom, outdoor jacuzzi on the balcony, outdoor dining set, and 2 sunbeds on the balcony too. The TV in the lounge looks relatively small in comparison to the space behind it but that is my only detail I could possibly point out.", "title": "Fantastic Stay! Loved it!", "helpfulness": 1, "user": "Bonnie-Jean688", "date": "December 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 147286194}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled with friends", "text": "2) The customer service from the resort staff was superb. We received complimentary pick up from our previous accommodation in Chaweng and return transfer to the airport upon departure. The rooms were spotless and serviced daily and we received a little dessert each night which was lovely. There were a few blackouts on the island but the resort has a back up generator that kicks in immediately. The generator did need a rest after operating for some period and the staff were very apologetic and offered us some candles during the off period. However the were unnecessary as the main power came back online. Wi-fi worked consistently while in our room although there wasn't wi-fi throughout the resort. The restaurant staff were very nice and efficient at their job and the buffet breakfast was really good. An iPad is offered free of charge (just need to ask at reception). Part of our package included a complimentary 30min neck and shoulder massage and to be fair it was the best I had received during my 3 week stay on Koh Samui. The prices of the spa services are on par with western prices but fantastic to experience.", "title": "Cant wait for next Stay!", "helpfulness": 3, "user": "gazbc", "date": "December 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 146597220}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled with family", "text": "3) The location of Beach Republic is on the northern end of Lamai Beach which wasn't far from the town of Lamai to walk and the resort offers a complimentary shuttle to Lamai at 11am (return 2pm) and at 6pm (return 9pm) and also a one way shuttle to Chaweng at 4pm. Songtaews are easy to catch from the main road and fairly cheap.", "title": "Bittersweet. LONG and detailed review.", "user": "greencrystalline", "date": "December 1, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 146533320}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled with friends", "text": "4) The restaurant and beach club was really nice and relaxing with a dj playing some very chilled tunes. Perfect for happy hour from 5-7 with 2 for 1 cocktails. Cocktails in my opinion were a little too strong for my liking. It would be nice if the staff were trained in making cocktails that were more balanced and therefore more enjoyable. The sunsets from the daybeds at the front were incredible and beautifully scenic.", "title": "Excellent stay again, great rooms!!", "user": "Jamescot65", "date": "November 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 146319517}, {"rating": 3.0, "stay_parameters": "Stayed November 2012", "text": "Overall, I can't wait to stay here again!", "title": "Overall very nice but needs to work on fixing issues and not hiding them.", "helpfulness": 4, "user": "VisualA", "date": "November 19, 2012", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 2.0, "service": 5.0, "rooms": 4.0}, "id": 145779767}, {"rating": 5.0, "stay_parameters": "Stayed January 2013", "text": "The staff are very friendly, awesome management team very organised. Beautiful pool area, had a dj also in the pool area, felt like we were in another world. Must visit this place if not staying at this hotel! Great food alao, Very impressed!", "title": "Visited this hotel for the day and it was so worth it!", "helpfulness": 1, "user": "Mscoch81", "date": "January 4, 2013", "detail_rating": {"cleanliness": 5.0, "location": 4.0}, "id": 148771053}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "Stayed here for 3 nights at Tropical pool villa.Rooms are spacious & the facilities are good.Consistent WiFi access & the complimentary iPad for room guest is very handy especially with teenagers around. Friendly staff and very helpfull. We were served sweet dessert every evening during our stay .The children love the private pool.", "title": "Excellent stay", "helpfulness": 1, "user": "KL_Faiz", "date": "December 30, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 148397741}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "Definitely, we will come here again !", "title": "Thoroughly enjoyable stay for couples or the 25-35 set.", "helpfulness": 1, "user": "suziqoz", "date": "December 28, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 148181773}, {"rating": 4.0, "stay_parameters": "Stayed December 2012", "text": "My husband and I stayed here for 5 nights at the start of December 2012. We arrived on a Sunday afternoon flight from Phuket and our driver was there to meet us. We had no sooner left the airport when we were offered a cold drink from a cool box: bottled water, fizzy drinks or beer! A very good start to our stay.", "title": "Confused Hotel", "helpfulness": 1, "user": "Danikenyon", "date": "December 26, 2012", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 4.0, "service": 3.0, "rooms": 4.0}, "id": 148076312}, {"rating": 3.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "After checking in we strolled down to the Beach Club which was a-buzz - laid-back music from the DJ, guests swimming in the pools (two side by side) or just chilling on a sala or day-bed after having enjoyed the famous Sunday brunch and drinks. The spread at the buffet had everything from fresh oysters to Spanish jamon. Unfortunately we were too late to eat but we sipped cocktails and enjoyed the vibey atmosphere.", "title": "What a major disappointment", "user": "Lisa_bun", "date": "December 12, 2012", "detail_rating": {"cleanliness": 2.0, "value": 4.0, "sleep": 5.0, "location": 3.0, "service": 4.0}, "id": 147309672}, {"rating": 2.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "We stayed here for New Year 2012, the hotel is located on Lamai Beach which is the quieter side of Koh Samui, about 20 mins from the airport, we checked in ok and was shown to our room which was well laid out with a large living area / kitchen and large bedroom with bathroom, the bathroom had its own spa bath which was a nice addition. We did not receive an explanaton about any of the facilities of the hotel, we were just left to it, and had to go and find out about the spa, gym, resaurant times etc, we found out most things by talking to other guests around the pool.", "title": "adequate hotel", "helpfulness": 1, "user": "Faye B", "date": "January 19, 2013", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 2.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 150023321}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled with friends", "text": "The food on the menu was nice and well priced and the beach / pool area was nice with sun loungers and couples beds on the beach front, there is not a lot of beach maybe a 2 minute walk each way and thats it. As paying guests you are able to reserve one of the cabanas, unfortunatley we tried to reserve one each day and every day came out to find that one had not been reserved for us, which was disappointing as others had booked the same cabana for their entire stay! So we had to complain about this on the last day.", "title": "Sun beds and beach here is such a fantastic", "user": "bubbles_gig", "date": "January 17, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 149852013}, {"rating": 3.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "As guests over NY we had to attend the Gala Dinner without question which unfortuntaley was a wash out with rain but the Management laid on free champagne all night to make up for it which was nice. The food was ok but no where near the quality and choice you would expect for $500.", "title": "Adequate stay with a trendy atmosphere", "helpfulness": 1, "user": "TravellingVH", "date": "January 9, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 149281657}, {"rating": 5.0, "stay_parameters": "Stayed December 2012", "text": "Its easy to get a taxi from the hotel or you can hail one from the road, I recommend going to Nikki Beach Resort, which is what I think Beach Republic is trying to be, Nikki Beach is far better and there is a real holiday atmosphere there, the food and entertainment was amazing and definatley worth a visit.", "title": "Amazing!", "user": "Kristin P", "date": "January 5, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 148884729}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "The hotel organised a private car for us to travel around the island and see the attractions at our own pace which was great and well priced, we payed the driver direct for this, not the hotel.", "title": "Whether You Visit or Stay It's Worth It!", "user": "bhmac", "date": "January 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 148866204}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "Spent ten days in a two bedroom pool villa with my wife and her sister. First impressions are disappointing as the reception resembles a travel agents office, but that was quickly dispelled when we were brought to the accommodation.", "title": "delightful place to stay", "user": "StPatrick17", "date": "February 1, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 151145323}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "The Villa was beautiful, and perfect for three or four people, the pictures on the website depict it exactly as it is, which is not always the case.", "title": "Stylish and relaxing", "user": "A-B-C-849", "date": "January 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 150721751}, {"rating": 3.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "I was particular impressed by the attention to detail, and the changing room contained every gadget you might need including an electric fly zapper. The safe was located at eye level which saves you having to get on your hands a knees to enter the code, at my age these things are important.", "title": "Beachfront Property", "helpfulness": 1, "user": "Rockingrahul", "date": "January 24, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 150475041}, {"rating": 2.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "The minibar was most impressive, a full size fridge with enough drinks to host a party of twenty.", "title": "Not worth the Hype", "user": "dodge5", "date": "January 20, 2013", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 1.0, "sleep": 4.0, "rooms": 5.0, "location": 2.0}, "id": 150093057}, {"rating": 3.0, "stay_parameters": "Stayed January 2013, traveled with friends", "text": "and a great assortment of coffee for the espresso machine.", "title": "Good Option for Young Travelers", "user": "Frankie2010", "date": "January 19, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 150072088}], "location": {"country": "Thailand", "continent": "Asia"}, "stars": 4, "variance": {"poor": 9, "average": 31, "very good": 79, "terrible": 5, "excellent": 256}, "aka": "Beach Republic The Residences Hotel", "slim_ranking": 0.0731707317073, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.0}, "description": "Relax in your choice of deluxe one, two or four bedroom villas, stunning penthouses, and spacious suites. The villas and the penthouses have private chemical and salt water-free pools and all units are afforded the comforts of home with kitchens, coffee and tea making facilities, iPod docks, and free WiFi in every room. Guests enjoy privileged access to Samui's premier beach destination - the Beach Republic Ocean Club featuring fine dining, superb wines, fitness room, and the Asian Fusion Spa."}