{"user_rating": 5.0, "review_count": 161, "name": "Beaches And Dreams", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled with friends", "text": "My husband and I spent a fabulous week at Beaches and Dreams. We stayed in Room 2 right on the beach and we could not have been happier. The night waves lulled you right to sleep - we did not need AC since the sea breeze was so wonderful. Waking up in the morning and being able to roll out of bed and into the ocean was phenomenal. We got the meal plan and it worked out great since the food was so delicious. My husband is a chef and even as picky as he is, he was thrilled with both the choices and the preparation. The fish was the freshest and the lobster succulent. Tony arranged for two and a half days of fishing and we had a blast. Watch out for the Belizian sun if you are not used to it - my face was sunburned after the first day on the water and it took all trip and a big tube of lotion for it to feel normal. Fishing was fun and we brought back barracuda for Tony's famous \"Barracuda Bites\" - yummmm. Angela's coconut flan was incredibly scrumptious and my desert of choice for the week. We rented a car in Belize City from Budget and the drive to Hopkins was easy and beautiful. The Hummingbird Highway was gorgeous with lots of photo ops. We drove all over Belize and had a great time. Tony helped with all our plans and was great on answering all my emails in planning the trip. The meal our last night in Belize was incredible - a six course Chef's choice with wine - unbelizable - definetely go for that - each course was better than the one before and Angela's desert tray for two was the ultimate ending to a fabulous vacation. Thanks again, Tony and Angela, for everything and we hope to be back soon.....", "title": "Paradise in Belize", "helpfulness": 2, "user": "yomaryjo", "date": "December 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 147025668}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "I concur with all the prior comments giving kudos to Beaches and Dreams and its owners, Tony and Angela. Tony arranged our transportation in from Belize International. He was available all week to suggest and to help with all from taxis to complex adventures.", "title": "Great Week with Tony and Angela", "helpfulness": 4, "user": "John W", "date": "November 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 145453817}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled with friends", "text": "Our room was clean and attractive. The amount of effort the housekeeper put into cleaning the room each day was impressive. I didn't think I was that messy. For that matter, all the staff was friendly and dedicated. No telephone or TV's in the rooms, a good thing. WiFi worked great. And there is a TV in the restaurant if you might need to watch an important event like an NFL game or even a presidential election. Which, by the way, was watched closely by both locals and tourists from all over.", "title": "\"My home away from home\"", "helpfulness": 4, "user": "Stasha156", "date": "November 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 144235144}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "I also agree with prior reviews on the food. While Tony and Angela encourage their room guests to try other restaurants, their food is the best. It is so varied, with the regular menu, a tasting menu and specials that you could eat there every night and not have tried all of the menu items that you would like. For us especially, Tony fixed a Peruvian Ceviche and for my birthday, Angela fixed a special chocolate mousse torte. Awesome.", "title": "Home away from home with a huge smile", "user": "tjklein", "date": "October 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 143453707}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled with friends", "text": "My eating strategy would be go to local restaurants such as Inne's (local food/fish & chips) and Iris'(also local and fish) for lunch. Walk across the street from Iris's to Alex's jewelry \"store\" where he and his son make great shell jewelry and other items, very reasonable on price. He will negotiate. On Tuesday night, go to Driftwood Beach Bar and Pizza (pizza, who would have guessed) and local drumming. Owners, Ollie and Denise are friendly and funny. Do not go to Chef Rob's, food okay, service spotty and tried to charge 5% extra to use credit card. Then dine the rest of the time with Angela and Tony.", "title": "couldn't have been better!", "user": "Patty W", "date": "October 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 143292025}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled solo", "text": "A great little resort with five rooms and a restaurant, unfortunately, I was there in September and the restaurant was closed for the month, as were all the other restaurants in southern Hopkins.", "title": "Never in September", "helpfulness": 1, "user": "Paul M", "date": "September 24, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 141134975}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled on business", "text": "My room was right on the beach, just feet from the water. The dock with lounge chairs was a great place to hang out. The temp was in the high eighties, but there was a constant cooling breeze. I would recommend this place for a vacation, but not in September if you expect to eat.", "title": "Clean, Comfortable and Friendly!", "user": "WealthShips", "date": "September 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 141000998}, {"rating": 5.0, "title": "Great place to stay", "text": "Beaches & Dreams (B&D) is an extremely well-run establishment located at the Southern end of Hopkins. If you're looking for clean & comfortable, not too pricey, rooms right on the beach, then B&D is a great choice.", "user": "Craig M", "date": "August 29, 2012", "id": 138833897}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with friends", "text": "They have five decent size cabanas. For my stay, I was in the Scarlet Macaw room. Next time I go (because I would stay here again in an instant minute), I'd like to try either the Sea Breeze or Toucan Stay, since they are closer to the beach and have better views.", "title": "Great Choice for Accomdations", "helpfulness": 4, "user": "Kla030", "date": "July 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 133522993}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "Some of the nice amenities you get in the room are ceiling fans in the main room and bath, a standing fan, beach towels, water dispenser, ice chest upon request, flash light, and a bug zapper (which I didn't need since bugs didn't get in my room). Also, I live in Belize and have travelled around quite a bit and stayed at many hotels and inns, and I must say B&D has probably the best towels I have ever seen at any hotel - EVER!", "title": "A Dream Vacation", "helpfulness": 4, "user": "Peoria_IllinoisAaron", "date": "June 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 132914562}, {"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled with family", "text": "My husband and I (and my parents) stayed at Beaches and Dreams for one week during our first trip to Belize and it really was a dream come true. We prefer tropical areas that are not too crowded and the Stann Creek area of Belize was perfect!", "title": "Dreams Do Come True!", "helpfulness": 2, "user": "H2Opia", "date": "April 21, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 7407557, "likes": {"liked": "— The location and the very helpful owners"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "Unlike my girl friend, a world traveler, this was my first trip abroad. We were both impressed with Beaches and Dreams. The Beaches and Dreams staff made our viist one of best experiences we could wish for. A beatiful, well maintained property, a well trained, and courtious staff, and two talented owners that love their place, and welcome you to it as if you were family. Both Tony and Angela are genuinely good people, that love Hopkins, and more importantly they love helping you experience this wonderful part of the world. No matter if is exciting adventures, really good food, good company, or just a cold beer,and good fishing off the end of the pier, you can't go wrong at Beaches and Dreams.", "title": "Brad and Yollande", "user": "brad b", "date": "June 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 131143413}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with friends", "text": "Beaches and Dreams is a lovely little Belizean resort with a good steady breeze off the Caribbean. Tony and Angela, the owners, were very welcoming and provided comfortable rooms and conveniences. Their evening meals were excellent. Tony arranged for off resort acitivities easily and provided a birding guide, Charleton, who was great too.", "title": "Beaches, Birds and Belize", "user": "Mindy B", "date": "May 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 130354989}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "We are on our 4th day here at Beaches and Dreams Resort. The owners of the resort live and work on the property. The rooms are more than spacious enough for a couple, they are clean and quiet. The grounds around the property are beautiful and well cared for. There are 5 rooms I believe so the hosts give guests lots of one on one attention and consideration, it makes the stay very personal. The hosts are very knowledgeable about the area; the history, economy, culture, and of course they know lots of wonderful things to do and see. Whatever we want to do...all we have to do is ask and Tony (the owner) makes it happen.", "title": "Couldn't Ask for More", "user": "Miranda R", "date": "May 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 129961384}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with friends", "text": "The food is AMAZING. The tour guides and other staff that work with/for Tony and Angela are all friendly and accommodating, wherever we went people at our destinations seemed to know Tony and everyone has something good to say about him (and his cooking).", "title": "We love this place", "helpfulness": 1, "user": "ClarkandKim", "date": "May 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 129309528}, {"rating": 5.0, "title": "Amazing destination!", "text": "We have a few more days left on our vacation and I know we're going to have a fantastic time.", "user": "SarahWdA", "date": "May 2, 2012", "id": 129269486}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "We stayed at Beaches and Dreams for a week. It is a quiet, beautiful place. If you like quiet, adventure and don't mind the feeling of staying in a cabin, then you will love this Inn. Rooms have everything you need to be comfortable. Very clean, basic. No Air Conditioning (only celing fans) or TV. 5 different rooms are available. Go on great adventures or just relax, its all available here. The resturant is one of the best places you will eat. We did the all day fishing trip. That evening Tony (the chef) cooked the fish for us and it was outstanding. If you are into Ancient Ruins you must visit the Xunantunich Ruins / Clarissa Falls. When at the Ruins you are able to see into Guetemaula. Cockscomb Basin Jaguar Preserve is a great tour of the jungle. You will go with a guide. Watch out for the Howler monkeys, they will try to pee on you as you walk underneath. You will be lead to the Falls and you can cool off by taking a dip in the water. The road through the center of Hopkins is a dirt road. The village is very interesting with many local artist displaying their crafts. The Belize brewed beer is Belikin. Very good. Tony and Angela are easygoing hosts who know a ton about Hopkins and the surrounding community. And their restaurant is delicious! What ever adventure you would like to do, Tony will help you get it scheduled. We bought the all-inclusive package which was a great value.", "title": "Beaches & Dreams Seafront Inn & Resturant", "user": "b0n09", "date": "June 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 132828001}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "As divers who like land adventures too, we've traveled the Caribbean for years with never a bad experience, but Beaches and Dreams is truly exceptional. We'd already been in Belize for a week before we arrived at B & D and as soon as we laid eyes on B & D and met Tony and Angela we knew this would be the best part of a great trip. The spacious cabanas and famed Barracuda Bar and Grill restaurant sit off a sleepy dirt road right on the beautiful jungle-backed beach. I can't say enough good things about Tony and Angela. They were warm, welcoming, accommodating, and extremely knowledgeable about the area. We left feeling like we'd made two new friends. Oh and let's not forget the food! As SF Bay area foodies we are already spoiled, but Tony is one of the most talented and creative cooks we've ever experienced. Their restaurant is one of the most popular and best known places in Belize for good reason.", "title": "Paula and Alan", "helpfulness": 2, "user": "P R", "date": "June 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 132607214}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "My advice? Book a stay and enjoy!", "title": "Paradise", "helpfulness": 3, "user": "Suchocki", "date": "June 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 132602608}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "Unbeleievable experience... again! B&D has a lot to offer and is ideal for outdoorsy people. Every morning I used their kayaks (single and double), biked around the city (bumpy roads though), and went swimming in the bath water named the Carribean Sea. Multiple times I fished off the dock (with success) and snorkeled off their dock. All of this was at no additional cost. I met the owners and staff every day. By the end of it, I felt like we were friends. The convenience factor was a major bonus. Tony set everything up from being picked up from my prop plane into Dangriga, to my guided fishing/snorkeling day, exploring the ancient Mayan ruins, ziplining, rappeling a waterfall, and exploring the jungle on short and multi hour hikes. The country is beautiful and having an owner who has lived here for the better part of a decade sincerely ensuring that I make the most of my time was a huge time and money saver. I fully endorse Beaches and Dreams!", "title": "Had a great time!", "user": "Joy H", "date": "June 11, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 131780798}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "My experience with Beaches & Dreams was great! Tony was very responsive via email and helped assure me prior to my trip (regarding excursion planning, weather, etc). The entire staff was incredibly welcoming, easy going and fun, making sure we had fun even when it rained and our excursion was cancelled. The property was gorgeous - exactly what we had wanted for our first stop in Belize. The tree house was spacious and comfortable and the food & drinks were excellent. Would definitely stay again!", "title": "\"Wynne & Charlotte\"", "helpfulness": 2, "user": "b0n09", "date": "June 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 131372978}], "location": {"country": "Belize", "region": "Stann Creek", "continent": "Central America", "city": "Hopkins"}, "variance": {"poor": 2, "average": 2, "very good": 18, "terrible": 0, "excellent": 139}, "aka": "Beaches And Dreams Hotel", "slim_ranking": 0.0909090909091, "description": "Located on a stretch of beautiful beach in Hopkins , Belize, We are a small owner operated full service resort.Tony Marsico has been a 5 star Chef for his entire career and Angela a pastry chef for over 25 years. Besides 5 star dining, they offer a central location to all the adventures of the reef and rain forest of Belize and share their extensive knowledge of Belize and its rich culture."}