{"user_rating": 3.0, "review_count": 165, "name": "Beach Plaza Hotel", "reviews": [{"rating": 2.0, "title": "Not so clean", "text": "The best part of the Phillips is the front Porch, which everyone seems to find even if they don't stay there , so don't count on using it to much. Our room was not very clean at all, bed was made every day and clean towels was about all cleanning people do. Some staff was very friendly and others were not so. We enjoyed eating breakfast on the front porch, and looking at the ocean.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "July 3, 2005", "id": 3631691}, {"rating": 1.0, "title": "Don't bring $50 along", "text": "There are no Coffee Pots in rooms they do offer it down stairs in the morning but you have to wait till they put it out. Bring your own Hair Dryers & irons these rooms have nothing. We could open the window but our room had no screens and the showers were another story they went from hot to cold water so you had to be careful.", "helpfulness": 8, "user": "A TripAdvisor user", "date": "June 9, 2005", "id": 3540971}, {"rating": 5.0, "title": "The best place to stay!!!", "text": "This is not a family place, I would not recommend it to anyone.", "helpfulness": 10, "user": "A TripAdvisor user", "date": "April 14, 2005", "id": 3365031}, {"rating": 3.0, "title": "Not that bad", "text": "The first day of our trip was okay. It was pouring down rain, so we waited until 12 to try and check-in, and to our surprise the allowed us to check-in before 4 without any extra charges. We were staying in the Apartments which were situated right next to the road. Upon immediate inspection of our room we were disappointed. The 2 area rugs in the room were both stained beyond belief. The sheets on the beds didn't look the cleanest. The tile in the kitchen was cracked. A decent amount of silverware and dishes were supplied. On Saturday, our second day, after the maids \"cleaned\" our room (which meant they supplied fresh tiles and changed the trash....nothing else), we realized we were missing a fifty dollar bill out of one of our drawers. At first, we just thought we counted wrong or lost it, but then on Monday we again had a fifty dollar bill missing out of another drawer. It's a shame that you can't leave money in the hotel drawers for fear of it being stolen by the maids. The cops were called and nothing was done. I do not recommend this hotel unless you have money just lying around and do not worry about theives.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "March 1, 2005", "id": 3237527}, {"rating": 1.0, "title": "Absolutely Terrible", "text": "Dining-I do recommend everyone eat at Happy Jack's Pancake House. They have the most delicious chocolate chip pancakes in the world. Reasonably priced too! 2 can eat for $25. We had the most awesome waitress in the world. Ask for Nikki...she is very nice.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "February 4, 2005", "id": 3161746}, {"rating": 1.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "My family stayed at the Phillip's Beach Plaza hotel in August 2006, and it was just terrible. Usually, we stay at condominiums, but with the location and generally good reveiws, we chose to stay at this hotel. We love Phillip's Seafood Restaurant, the crabs are good and the atmosphere is fun, and this review does not express our opinion of the restaurant. This hotel is a complete pigs-stye. Upon check-in, we went to our parking-lot view room. The hallways stunk of cat urine, and were dark and moist. The room was even worse. The carpet looked so dirty, one had to really think before taking off their own shoes. The rooms were also small and a complete fire-trap. There were no windows or vents in the bathrooms (which I know is required in all hotels), which were far from clean. On our second day at the hotel, the power went out when a circuit blew, causing us to be left in the dark for at least an hour if not longer. During this, the elevator of course stopped, and as employees literally yelled down the shaft to see if people were stuck or not, guests were forced to climb the stairs to their rooms.", "title": "Terrible! A Complete Dump", "helpfulness": 8, "user": "MeetmeinSanJuan", "date": "January 22, 2007", "detail_rating": {"front_desk": 3.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "location": 4.0}, "id": 6642775, "likes": {"liked": "— the location", "disliked": "— everything else; lack of cleanliness, etc."}}, {"rating": 1.0, "stay_parameters": "Stayed July 2006, traveled with friends", "text": "The price for our room was close to $200 a night, and this was parking-lot room and all. I understand that prices are obscene in all of Ocean City, but for our room, I thought this was way too much. We probably would have and gone to another hotel except for it's location, which was right on the boardwalk and near my brother's condo. Despite this, we will not be returning to the Phillip's Beach Plaza Hotel.", "title": "The dirtiest room I ever stayed at..", "helpfulness": 3, "user": "bossyT", "date": "July 23, 2006", "detail_rating": {"front_desk": 3.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "location": 4.0}, "id": 5501401}, {"rating": 4.0, "stay_parameters": "Stayed June 2006", "text": "The apartment had a full kitchen and slept 6 but, was the dirtiest thing I have ever saw, aside from the decor that had not been updated since 1973..the room itself was digusting. The walls in the living area were covered with dirty hand prints and scum. The extra pillows we found in the linen closet were covered with old food and stains. While our stay was for only one night..it was the most uncomfortable night I have ever spent in a hotel ever. I would never let my infant child play or crawl on the disgusting floor. They were not very accomondating when we put in a call to the main office to have an iron brought to our room..we were told that housekeeping had left for the night and no one would be able to get it to us. Prior to checking out we brought our concerns to the managers attention, who apologized and stated he would talk with the housekeeping staff. He also gave us a credit back for our inconvience however that would never be enough to erase the very bad taste this place left in my mouth...while Philips seafood maybe awesome, their hotels leave alot to be desired!!!!", "title": "First visit to Ocean City, MD", "helpfulness": 4, "user": "R P", "date": "June 19, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "service": 3.0}, "id": 5363220}, {"rating": 4.0, "title": "Wonderful Weekend", "text": "This was our first trip to Ocean City, MD. and we loved it! My husband and I alone with our 2 1/2 year old son celebrated our six wedding Anniversary on the beach. The Hotel was easy to find, located directly on the beach. Our room was small but clean and comfortable, and the bathroom was cleaned and restocked with fresh towels everyday. The hotel rates were very reasonable, Everybody was very helpful from the parking attendant to the front desk people, the staff was very friendly and always willing to answer questions. The breakfast buffet was hot and fresh, the waiterss was so funny our 2 1/2 year old loved her! I would recommend you tried the buffet. We also ate breakfast outside on the deck and enjoyed the ocean view. But, like any other piece of prime real estate you must get there early to get a great seat! IF you have to wait for seating to become available you can sit on the porch in the rocking chairs. Just be careful you don't fall asleep. One of the better buffets to try is Ember's located @ 24thst & Coastal Hwy. A great way to work off your meal is to try the one of the two miniature golf courses located directly across the street. For those who have to satify a sweet tooth just take a strool or the tram on the boardwalk for some ice cream go to Dumser's and don't worry about the calories. For the popcorn lover there's Fisher's popcorn also make a quick stop at the Candy Factory. Finally, a great place to wear down the kid and the kid in you try on the south end of the boardwalk to see Ripley's belive it or not and all the surrounding amusement park Named Jolly Roger's. With all this in mind we will definately be returning to Phillip's and Ocean City in the very near future.", "helpfulness": 7, "user": "nanaof3", "date": "May 24, 2006", "id": 5211756}, {"rating": 3.0, "title": "Perfect for a low budget trip", "text": "My husband and I just spent a long weekend at Phillip's Beach Plaza Hotel in OC, MD.", "helpfulness": 8, "user": "A TripAdvisor user", "date": "April 23, 2006", "id": 4997394}, {"rating": 5.0, "title": "A delightful getaway on a budget!!!!!!!", "text": "We just returned from a lovely weekend a Phillips. We read the reviews before going and were a wee bit leary of some of the information. We were more than pleasantly surprised and delighted with the experience and the pricing. From the moment you arrive in the large FREE parking area and walk into the lobby any fears will be immediately gone. The staff was friendly and courteous. The motel is older but the room was clean, the bed comfortable, the bathroom sparkled!! The Famous Phillips Seafood was wonderful and UNDERPRICED in my opinion!! The Piano bar and its warm friendly atmosphere offered a wonderful respite after a lovely walk on the cold Atlantic Ocean. We awoke the next morning with the sun rising over the ocean, coffee awaiting us in the lobby, friendly staff exchanging greetings with the guest and a delicious buffet breakfast. Check in and check out was a breeze. Yes, Phillips is an older motel but you are not paying $300.00 a nite for a room either. We go to Ocean City for the beach, the ocean, the boardwalk, the wonderful seafood, and a place to rest our heads. Phillips has all the amenities I need without paying a fortune!!!!!!", "helpfulness": 12, "user": "A TripAdvisor user", "date": "January 11, 2006", "id": 4345388}, {"rating": 4.0, "title": "charming, friendly atmosphere at phillips beach plaza hotel", "text": "Would I go there again??? Am I packed yet!!!!", "helpfulness": 7, "user": "A TripAdvisor user", "date": "December 6, 2005", "id": 4164589}, {"rating": 1.0, "stay_parameters": "Stayed October 2005", "text": "Our recent stay at Phillips Beach Plaza Hotel in Ocean City, MD was memorable. From the moment we stepped into the lobby decorated for Christmas, everyone could not be more helpful. The food was delicious in the restaurant and the piano lounge with a wonderful singer and pianist was warm and inviting on a very cold night. No matter who we came in contact with, they were more than accommodating making the visit one to remember. Yes, the hotel is old, and yes, the rooms are small, but for a quick getaway it was wonderful. Don't know if I would spend a week in the summer there, but then as regular ocean city visitors we rent a condo and are accustomed to lots of room. But if you eat in the restaurant, ask for Sonny, he made our meals interesting, efficient and truly enjoyable. Sorry others have run into problems, we certainly didn't. Winterfest of lights was something you should see at least once. A fun weekend. This rating was given for the service and friendliness. The rooms were average.", "title": "Like Grandma's house but worse", "helpfulness": 5, "user": "Leoned", "date": "November 4, 2005", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "service": 2.0}, "id": 4086209}, {"rating": 3.0, "stay_parameters": "Stayed October 2005", "text": "Are you kidding me? The place hasn't been updated in about 200 years. It smelled so bad in my room I thought they a) had the closet filled with moth balls or b) my grandma was hiding under the bed. Sure it cost $50 a day off-season, but it's not even worth that. Not to mention the ice cold shower one morning - ugggh.", "title": "Would Go Back", "helpfulness": 8, "user": "Debi1", "date": "October 30, 2005", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "rooms": 2.0, "service": 3.0}, "id": 4073716}, {"rating": 4.0, "title": "It wasn't the newest hotel, but It was pleasant", "text": "The breakfast and service in the restaurant were the only redeeming qualities.", "helpfulness": 8, "user": "A TripAdvisor user", "date": "October 25, 2005", "id": 4051002}, {"rating": 1.0, "title": "Dirty yet quaint", "text": "We stayed at The Phillips because we needed at \"moderate\" efficency unit since we were in OC for a dance competition. On the boardwalk was a plus.We wanted to sit on the porch but never got there. I swear people camped out there. We stayed in an interior unit by the stairs. The lobby was quaint but that was it. The room was old and dirty. The kitchen cramped. I sprayed everything with Lysol. We could tell that the facility was old, there was a mounted beer bottle opener in the kitchenette. The beds were uncomfortable. We payed $195/night. - About $95 too much. They charged us for an extra night. We actually stayed accross the street at the Safari for one night. They wouldn't give us our money. The front desk person called my and told me I was mistaken (-I had the other hotel's bill as proof I stayed there. I complained to American Express. I got my credit but the hotel wouldn't answer their correspondance. A positive-the breakfasts in the restaurant were great...and reasonable. We sat outside to eat All in all I wouldn't recommend it.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "September 28, 2005", "id": 3944206}, {"rating": 1.0, "title": "I won't stay here ever again", "text": "We won't be staying here again we just got back. I call & made a reservation for an apartment on the boardwalk & was promised one. When we arrived we were put in an apartment in an alley way. The kitchen sink & dishwash leaked. Lamp in living room didn't work. In the bedrooms there was an extention cord running behind bed with 2 lamp plugged into it. I would say this would be a fire hazard.Kitchen was suppose to be supplied with standard kitchen utensils which it wasn't.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "August 23, 2005", "id": 3802104}, {"rating": 1.0, "title": "Missing $70.00", "text": "We stayed in the apartment/efficiency section of this hotel for only one night at a cost of $210.00 plus tax. The room was outdated but looked clean. Around 2:00 am was awakened by our front door either being opened or closed. Called the Lobby who sent Security. Security responded quickly and suggested that another renter (possibly drunk) made a mistake by trying to enter our unit. In the morning, after eating at the breakfast buffet which was pretty good and reasonably priced, we discovered $70.00 cash missing from a wallet. Immediately complained to the front desk and the police was called. Hotel Manager did refund us 100% for our stay but was out the $70.00 plus our peace of mind. Based on that fact alone, we could not recommend Phillips.", "helpfulness": 8, "user": "A TripAdvisor user", "date": "August 23, 2005", "id": 3801383}, {"rating": 1.0, "title": "They should pay me to stay here", "text": "This was my first time in Ocean City and while I don't have any type of comparison to make with other hotels in the area, this hotel was one of the worst that I have ever stayed in. We stayed in the Philips building that is apartments and efficiencies so I am not sure what the \"hotel\" is like. However, the bed had no springs which made it cave in plus there were bed bugs. The furniture was very dated and the floor was dirty. After showering, my feet turned black with dirt just walking to the bed. I expected more for the money.", "helpfulness": 8, "user": "A TripAdvisor user", "date": "August 15, 2005", "id": 3763475}, {"rating": 2.0, "title": "Tear it down!", "text": "The upside is that it is on the boardwalk and the restaurant was really good. However, if you value a good night sleep and a clean room, I would not suggest staying here.", "helpfulness": 8, "user": "LoveLife82", "date": "August 12, 2005", "id": 3756595}], "location": {"country": "United States", "city": "Ocean City"}, "stars": 2.5, "variance": {"poor": 25, "average": 25, "very good": 44, "terrible": 32, "excellent": 39}, "aka": "Hotel Phillips Beach Plaza", "slim_ranking": 0.575471698113, "description": "The Beach Plaza oceanfront hotel is located at 13th Street on the famous Ocean City, MD Boardwalk. The hotel’s beachfront location is ideal for family beach vacations, weekend getaways or your next golf vacation. Beach Plaza guests are just a short stroll down the boardwalk to numerous restaurants, nightclubs, amusement rides and shopping.The Beach Plaza Hotel offers a variety of accommodations to meet your needs, from oceanfront guest rooms, efficiencies and 1-bedroom apartments to spacious 3-bedroom apartments that can accommodate up to eight guests. Hotel amenities include free parking, on-site bike rental, comfortable rocking chairs on the spacious porch overlooking the boardwalk and convenient beach rentals for your chair, umbrella and boogie board desires.Enjoy our warm Eastern Shore hospitality, spectacular ocean views and spacious accommodations - all just steps from spectacular Atlantic beaches and the famous Ocean City Boardwalk."}