{"user_rating": 4.0, "review_count": 128, "name": "Beach House", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "We booked this hotel as a very last minute deal in mid October and enjoyed an amazing room rate. Magaluf was very much shutting down for the end of the season (although the weather was still great) and it was clear there were very few guests in the hotel.", "title": "Great hotel but lacking atmosphere", "helpfulness": 1, "user": "MatthewGreen", "date": "October 28, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 143907183}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled with friends", "text": "We upgraded to a sea-view suite (305). The room was faultless. Stunning modern hip design, clean, spacious and with a lovely balcony looking out over the pool and the beach right behind. Then there was also the great free standing bath complete with sea view! The rest of the hotel was very clean and clearly very trendy although almost a bit clinical. Sadly the bar was utterly dead which had the bonus of there being no late night noise. Pool area is very attractive although it's a pity the pool wasn't heated. The sea was actually warmer than the pool. I will also add that the beach in front of the hotel is surprisingly lovely with golden sand, palm trees and crystal clear turquoise sea.", "title": "Teething Problems..... But", "helpfulness": 4, "user": "Keith33", "date": "October 27, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 143820074}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "I would definitely return. It's probably difficult to judge when. Clearly mid-October it's dead but I suspect in mid season it would be annoyingly loud (Nikki Beach club is immediately outside).", "title": "Very nice hotel, but work to be done on customer experience.", "helpfulness": 1, "user": "henke7", "date": "October 7, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 142222667}, {"rating": 5.0, "stay_parameters": "Stayed September 2012", "text": "Finally I found all the staff delightful from receptionists to house keepers.", "title": "Amazing", "helpfulness": 2, "user": "karencracker", "date": "September 28, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 1.0, "rooms": 5.0}, "id": 141504327}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with friends", "text": "We arrived end of September two couples (regular visitors to Mallorca) we had seen the work start at the Beach house in April - after seeing the impressions posted by Melia we decided to booked for a late break - we arrived mid morning and had to wait for the rooms to be ready - which weren't going to be ready until - we decided to look around and have a drink (or two ?) at 2pm we were given the keys to the rooms - the rooms were at the front of the hotel over looking the mountains we were on floors 6 and 10 - (back room all have pool / sea views and free standing baths but at extra cost) we were half board... the staff were all very young and all very inexperienced and most of them friendly - they seem to have no direction ? small things like forgetting milk with coffee or tea - having to ask for glasses for drinks ? the list could go on and on but that enough moaning about the staff - the hotel seemed to be out of stock of certain drinks ( we put it down to end of season etc ) but with a four star hotel this should not happen - the lifts are very small and you have to wait ages ( max 4 people) being near the top isn't much fun ? the pool area has great views with limited sun beds etc - we were total that for 2013 the building next door will also become a part of the Beach House complex adding anoth 50 plus rooms - l just wonder where all the extra bodies are going to fit in the dining room or even around the pool area ? maybe they are trying to get you to move next door to Nikki Beach (you have to pay for sun beds etc) we shall see - all in all the trip was a good one - The Melia group still have a long way to go to make into a four star hotel ( what it lacks in inexperience makes up for it in style)", "title": "Thoroughly Recommend!!!", "helpfulness": 2, "user": "liane c", "date": "September 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 141480782}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with friends", "text": "I found this hotel online just looked really beautiful on the pictures and we were not disappointed. Myself and a friend went for a girls weekend (both in our 30's) and i have to say i was blown away. The hotel is beautiful, brand new, very cool with a great vibe. We upgraded to a seaview room (a must) and the room was exactly like the picture had a great view and was massive to boot!", "title": "Brilliant hotel!", "helpfulness": 1, "user": "Georgina H", "date": "September 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 141428704}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with friends", "text": "During the day you can hear the DJ tunes of Nikki Beach next door which was fab. The staff were polite and could not have been more helpful. It's waiters service round the pool and they bring you little cups of fruit and towels, all the small touches were there. We went out and partied all night knowing we could come back and enjoy the luxury and chilled vibe of this hotel.", "title": "\"What a Gem\"", "helpfulness": 1, "user": "Georgina H", "date": "September 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 141071299}, {"rating": 3.0, "stay_parameters": "Stayed September 2012", "text": "There is a mixed bag age group wise but we did go in sept after the kids had gone back to school, this mix seemed to work really nicely. Nikki beach next door is brilliant for people watching and we had a lovely lunch there both days.", "title": "Great rooms, service very slowww...", "helpfulness": 2, "user": "Tredelijkheid", "date": "September 23, 2012", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 4.0, "service": 1.0, "rooms": 4.0}, "id": 140983547}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "Really cant wait to go back.", "title": "Best hotel for hip adults", "helpfulness": 3, "user": "Ser A", "date": "September 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 140833986}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "Having stayed in some of the best hotels in the world I cannot praise The Beach highly enough as it is right up there with the best.", "title": "Best hotel ever", "helpfulness": 1, "user": "guernsey1", "date": "September 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 140748737}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "Stayed in a sea view suite, fantastic views and room, very romantic, bath by the window was great.", "title": "Fantastic views and rooms", "helpfulness": 2, "user": "K-Edin67", "date": "July 9, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 133901970}, {"rating": 4.0, "title": "Good with great potential", "text": "I think they are getting sorted with running the hotel, I thought the staff were nice and the breakfast was fantastic.", "helpfulness": 2, "user": "Rogier S", "date": "July 8, 2012", "id": 133773872}, {"rating": 3.0, "stay_parameters": "Stayed June 2012", "text": "Nikki beach is a real party place next door, we went there for a drink and to people watch which was fun. Sure the music was loud during the day and we were probably lucky our room was n her that end .", "title": "Disappointing!", "helpfulness": 4, "user": "HEJ26", "date": "July 5, 2012", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 3.0, "service": 1.0, "rooms": 3.0}, "id": 133543756}, {"rating": 3.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "A few niggles, no room book and the shower did flood but all in all I really liked tha place, I was very cool and chic. it will be interesting to see how it ges with more people in I and as they get more settled .", "title": "Nice 4 star hotel with 5 star prices", "helpfulness": 2, "user": "Ittelke", "date": "June 28, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 3.0}, "id": 132933107}, {"rating": 2.0, "stay_parameters": "Stayed July 2012, traveled with friends", "text": "My friend and I stayed here last week (two women - 28 and 31 years old) and after paying almost €200 each per night (without breakfast) we were extremely disappointed by the quality of the hotel, its location (its not Calvia - it's Magaluf) and the way we were treated by the staff.", "title": "Not 4*star", "helpfulness": 4, "user": "LeanneB81", "date": "August 2, 2012", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 2.0, "sleep": 2.0, "rooms": 2.0, "location": 1.0}, "id": 136025719}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "In the pictures, the rooms look swanky and modern with a high quality finish. Not the case in reality! They do have the same furniture but the quality is cheap and not at all what I would have expected of a hotel that is trying to justify €12 for a drink in the bar.", "title": "Great Hotel, Strange Location", "helpfulness": 5, "user": "D A", "date": "July 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 1.0}, "id": 135676083}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "Our shower didn't work properly for the three out of the four days that we stayed, on the first night it came off of the wall and sprayed all over the ceiling causing the paint to peel (which was unsightly and not rectified while we were there). Three out of the four nights the drain in the shower was blocked and it flooded the floor causing the skirting board to come off of the wall (also not rectified while we were there) and we constantly had to put towels down to soak up the water as it took the house keeping staff so long to come and resolve the issue and one day we didn’t have any water at all in the morning.", "title": "Amazing Hotel, Would Definately Recommend", "helpfulness": 2, "user": "Sunnydayz2012", "date": "July 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 135537487}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "We were not offered any compensation by the hotel staff for the inconvenience we experienced. We holiday 4-5 times a year and having stayed at some of the most amazing hotels, I feel the staff are lacking in basic customer service skills. This includes the security staff on the door in the evening who interrogate you and make you prove you are staying in the hotel – I understand that due to its location the hotel doesn’t want just anyone walking in but I’m sure the men staying in the hotel don’t get the same treatment if you know what I mean!", "title": "A-maz-ing!", "helpfulness": 1, "user": "myholidays2012", "date": "July 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 135269187}, {"rating": 4.0, "title": "Great trendy upscale hotel but in a slightly run down location", "text": "Unfortunately they make you pay the whole bill when you check in and so at the end of our stay we had no power to reserve payment. I was so disappointed by our stay that I would not have paid the whole bill.", "helpfulness": 2, "user": "ABerd", "date": "July 11, 2012", "id": 134124352}], "location": {"country": "Spain", "continent": "Europe"}, "stars": 4, "variance": {"poor": 8, "average": 17, "very good": 46, "terrible": 3, "excellent": 54}, "aka": "Beach House Majorca/Calvia, Spain", "slim_ranking": 0.17679558011, "description": "Beach House...feeling the mood. Unique, stunning hotel on the magic island of Majorca that will awaken your senses. Beach House hotel makes a difference if your destination is Calvia due the Nikki Beach, the world’s most acclaimed beach club with a reputation of being \"the Sexiest Place on Earth.\" Beach House invites you to relax, contemplate the sea, enjoy the afternoon and dance until morning, because the hotel is, above all, a life-style. A new concept of hotel in Magaluf designed to offer a bold, modern, fresh, and energizing experience."}