{"user_rating": 4.5, "review_count": 1014, "name": "Beachcomber Shandrani Resort & Spa", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled with family", "text": "Let's get the location issue out first.", "title": "Great resort but go knowing where it is located", "helpfulness": 8, "user": "Sayer", "date": "January 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 122662640}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "The good news is that the transfer from the airport to the Shandrani is only ten minutes. The bad news is that the Shandrani is only ten minutes from the airport. From the main restaurant you can actually see the larger aircraft taxiing to the end of the runway. When the planes leave Mauritius they fly past the Shandrani. At peak times this can be once every ten minutes, but this is not throughout the day. They are currently building a new airport with three gates for A380s, which should open by the end of 2012, which can only mean that the traffic (and the noise) will increase. If your idea of Mauritius is to get away from the modern world then this is probably not the hotel for you.", "title": "Very nice location / hotel resort", "user": "Roystand", "date": "January 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 122579293}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "Secondly on the location this hotel is primarily built on on a lagoon. For many watersports this is very good, It means for those wanting to learn to water skiing, wind-surfing, sailing or kayaking then the conditions are ideal. For the more experienced then the conditions will seem too tame. It also means that for those who sit on the beach near reception and the main restaurant of the resort the view sitting on the beach is of the other side of the lagoon not a view out to the ocean. Further away from reception there is the lagoon beach with views out towards the reef and the deep blue Indian Ocean. There is also an ocean beach which meets the image of the tropical beach with trees coming down to the water and a long stretch of white sand, however this is, somewhat unfairly, described as the 'wild beach'. It does have bigger waves than the lagoon beaches, but depending on the tide the sea can be really good to swim in and safe for children. There is allegedly a strong current but that is some fifty to a hundred metres out.", "title": "Amazing dream wedding-moon", "user": "LiliCaboose", "date": "January 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 122372091}, {"rating": 4.0, "stay_parameters": "Stayed December 2011", "text": "Thirdly about the location the resort is to be found on a small peninsula on the south-south east of the island. The north of the island tends to have the better climate (warmer, less windy and less cloudy), but, of course, has the longer transfer time. However over Christmas the temperature at the Shandrani was perfect, true cloud did tend to build up over the afternoon and depending where you sat at the resort there was either a gentle breeze or no wind. The other aspect of being in the South-South East is that you shouldn't expect to see a sunset over the sea, however due to the peninsula from the 'wild beach' you can see the sunset going down over the sea and behind the trees.", "title": "Happy Family", "helpfulness": 8, "user": "PatmanGP", "date": "January 1, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 122370142}, {"rating": 5.0, "stay_parameters": "Stayed September 2011", "text": "Enough on the location - the most important thing is to know where it is located so that there are no surprises when you arrive.", "title": "Cannot fault this resort, if you are going to Mauritius then STAY HERE!!! :-)", "helpfulness": 1, "user": "morone42", "date": "December 29, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 122244866}, {"rating": 5.0, "stay_parameters": "Stayed January 2012", "text": "Great location , excellent service,", "title": "Everything paradise should be!", "helpfulness": 3, "user": "StPatrick17", "date": "February 2, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 124019481}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "Very nice staff,wonderful food, offered late checkout without asking, great boat trips right on the beach, forget the catermarans, book a speed boat, we booked on two separate days, and both were fantastic! Will go back to Mauritius, and stay at the Shandrani!", "title": "Great place to do very little", "helpfulness": 6, "user": "tonysony", "date": "January 28, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 123734327}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled with friends", "text": "This was almost exactly what we wanted: beautiful beaches (3 in fact, as the hotel is on a peninsula so you have a choice of seas - ultra-calm, calm or a bit rough), great food, tennis & (mini) golf, a quality spa, excellent accommodation and good service. Being a 15 minute drive from the airport was a big plus especially if, like us, you want a 'fly and flop' holiday. Although you do get the odd jet engine roar, it's a minor issue unless you're the type who wants to escape any reminders of the real world.", "title": "The best holiday ever!", "helpfulness": 5, "user": "Bronja", "date": "January 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 123490207}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled with friends", "text": "Our room was a superior garden room (from memory) which was a good choice as it's near the main restaurant/pool and, even better, it's 5 yards from the beach. It's the least 'natural' beach - it's in a natural harbour with lovely views (the only sign of the airport is the odd plane tail-fin jutting out above the horizon), but you do get a fair bit of boat traffic including water-skiiing (despite the fact that, so I read, speedboats are banned from the harbour). But the golf buggy man delivering water, juice and wine more than made up for it!", "title": "WOW just amazing", "helpfulness": 3, "user": "lorelie21", "date": "January 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 123416593}, {"rating": 4.0, "stay_parameters": "Stayed December 2011", "text": "A few gripes: all the best restaurants were booked up for the whole 4 days we were there so we ended up just going to the main buffet restaurant every night (good as it was, a bit of variety might have been nice). We weren't given any warning about this - had we been aware of the possibility we'd have booked up when we got there, or even before we arrived. Also there's an annoyingly long queue to book a restaurant - why can't they do it when you check in? Just as annoying is the restaurant dress code: no T-shirts, shorts or sandals, which is crazy - it's a beach holiday! There's no need for such pretension, especially as it only seems to apply to men.", "title": "Fantastic holiday", "helpfulness": 3, "user": "Lindamariewebb", "date": "January 21, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 123390080}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "This was our second visit to the Shandrani hotel and we stayed for a month over Christmas and New Year, returning home only last week. What a stay!! A month gives you the perfect chance to see all of the features of such a location and we can say with the utmost sincerity that we will be back next year for a month again at the same time!!!", "title": "Thanks for the most wonderful month long stay with you!!!", "helpfulness": 8, "user": "Evergreen32", "date": "January 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 123267918}, {"rating": 3.0, "stay_parameters": "Stayed January 2012, traveled with family", "text": "Our experience was quite exceptional - from staff to room quality - even to customised meals from the chef! The Mauritian people are so very friendly and this is evident with all staff in the hotel. Of all of the venues we have visited in the past few years over the same period, the Shandrani comes out top over other 5 - star inclusive resorts in other parts of the world. The nature of our work means that we travel to many locations iso we take a close and critical view over what makes a resort like this ideal for a relaxing holiday which will offer all the features we look for in this type of location.", "title": "Convenient, but impersonal", "helpfulness": 5, "user": "Dia_Carstens", "date": "January 17, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 123201243}, {"rating": 3.0, "stay_parameters": "Stayed January 2012, traveled with family", "text": "From our arrival when we were greeted by Bea at Reception and by Jean Louis, General Manager, we knew that we had made the right decision to return. We were in a beautiful room near to the Sirius. Atma and Navin did an incredible job in ensuring that the room and our needs were fully met and exceeded in the care and attention they gave us. Krista's role as Housekeeping Manager was visible and she was always there to help.", "title": "Most consistent thing about this hotel is the inconsistency-The service ranges from bad to indifferent", "helpfulness": 2, "user": "LEGENDCapeTown", "date": "January 15, 2012", "detail_rating": {"service": 1.0, "cleanliness": 2.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 123112651}, {"rating": 4.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "We ate mainly at the Sirius restaurant because we loved the food, the staff and the atmosphere during the whole day. This is located at the quieter end of the resort and is ideal for couples like us. We found Noel, Prem, Madona and the team to be simply outstanding in their service, attitude, friendliness and desire to make sure that we were happy at all times. The Thai restaurant, under Dennis' watchful eye, was a wonderful experience. Gerard, the executive chef, made us some truly outstanding dishes and it shows just how flexible life at the Shandrani can be. On this occasion we didn't eat much at the other restaurants so it would be unfair to comment about the quality or otherwise.", "title": "Lovely hotel - the airport was a bit disturbing", "helpfulness": 3, "user": "NamibianJetsetter", "date": "January 12, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 5.0, "location": 3.0}, "id": 122958422}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "The beaches are magnificent with a constant flow of drinks from the carts ensuring that you don't have to walk too far. The gym has just been upgraded although the air conditioning still needs to be more effective in the really humid weather ( we believe that this is in hand). We did not visit the spa but the setting is quite beautiful.", "title": "Great Christmas & New Year 2nd year running", "helpfulness": 4, "user": "Thesparrows17", "date": "January 7, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 122717164}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "We, 2 adults, daughter 13 and son 20 stayed here for one week in September 2011. The welcome /check-in when you arrive is faultless, wonderful personal greeting with cold drink, shown round the resort and to our rooms. We had two rooms, right on the beachfront next to the main bar. The food is good in the buffet restaurant, but much better variety at lunchtime than in the evening. Pancakes are served at 4.00pm every day, taste great and there are many fillings available. The a la carte restaurants were not good at all, very little choice and poor service. The best service was in the Teak Elephant where our waiter was very attentive. Disappointed that our meal was a set menu, especially as we all wanted to choose different dishes and share. The cleanliness of the hotel however was second to none, housekeeping staff should be congratulated, our rooms were immaculate throughout our stay, mini-bars stocked up and rooms a good size. A must is a speedboat trip, half-day or even better full-day. We went jumping through waterfalls, stood in the middle of the ocean on a private sandy beach and had an amazing time. There are regular snorkelling trips throughout the day and waterskiing, but you need to book early to get on them. The snorkelling is amazing.", "title": "Good family fun", "helpfulness": 3, "user": "Clare T", "date": "December 26, 2011", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 122116915}, {"rating": 3.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "All inclusive is a fallacy in that there is no food service between the published meal times, no food and beverage service to the pool decks, all service is self service from the bars, beverage service is poor during the day. This I found truly shocking and have not seen at other all inclusive properties in the Caribbean or Asia.", "title": "Family Vacation 9th - 16th December 2011", "helpfulness": 9, "user": "Kamini_11", "date": "December 25, 2011", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 2.0, "sleep": 1.0, "rooms": 2.0, "location": 3.0}, "id": 122087065}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "Food and Berverage is poor overall - service, cleanliness and food is very average, the a la carte restaurants have very small menus, and they are not truly separate. Staff are not friendly, always have to ask for service.", "title": "Good Family Hotel", "helpfulness": 1, "user": "robandhaz", "date": "December 15, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 121771270}, {"rating": 3.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "Restaurants have no fans, some open air and others covered.", "title": "A nightmare holiday", "helpfulness": 5, "user": "P J", "date": "December 15, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 2.0, "sleep": 4.0, "rooms": 3.0, "location": 1.0}, "id": 121757738}, {"rating": 3.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "Room service does not give you a menu in the room and certain items like tea are charged for besides the service charge.", "title": "Great place, shame about the planes!", "helpfulness": 1, "user": "Claire C", "date": "December 5, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 1.0}, "id": 121424796}], "location": {"city": "Blue Bay", "continent": "Africa"}, "stars": 5, "variance": {"poor": 38, "average": 49, "very good": 193, "terrible": 10, "excellent": 724}, "aka": "Shandrani Hotel Blue Bay", "slim_ranking": 0.5, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}}