{"user_rating": 2.5, "review_count": 101, "name": "Beach House Bal Harbour", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed May 2005", "text": "We just got back from staying at the beach house for three nights. I was a bit nervous after reading the spotty reviews, but it was all fine. The common areas of the hotel are fabulous - great places to read and hang out, cool bar, lots of sofas, amazing beach/pool area, and right on the ocean. Staff was really nice and accomodating, for the most part - valet guys are particularly great. The food at the restaurant is good and decently priced - the pool bar drinks are really expensive, but it's a vacation hotel so that's to be expected. The rooms are smaller and not super luxurious, but they are perfectly adequate. This hotel is older and is not what most people would expect at a four star place, but - at least when we booked - the prices aren't four star either. We got a standard room and were upgraded to a suite and paid about 90/night, including taxes. Overall, it's a fine hotel - not super new, but perfectly clean and pleasant. What makes the hotel great, though, is the physical location - on the beach (literally) and couldn't be better for people who don't want the craziness of south beach (which is a 10-15 minute drive) but who want a beach vacation. We had a great time and it was a bargain at what we paid.", "title": "Great Deal", "helpfulness": 7, "user": "sara_em", "date": "May 19, 2005", "detail_rating": {"cleanliness": 3.0, "value": 5.0, "rooms": 2.0, "service": 4.0}, "id": 3487412}, {"rating": 5.0, "title": "amazing place!!", "text": "Why the bad reviews people??? when I stayed here the building next door was being demolished from sunrise to sunset but it didnt ruin my holiday at all!!! A bit noisy was all! I stayed here on business and then went straight back here on vacation, great hotel, room was great but small bathroom, great food and facilities...no problems here at all!!!", "helpfulness": 3, "user": "A TripAdvisor user", "date": "May 11, 2005", "id": 3460272}, {"rating": 1.0, "title": "Overbooked!", "text": "Well, we never actually got to stay at this hotel. My wife and I booked this hotel on Expedia only to learn several days later that the hotel had oversold its rooms and \"the hotel will not be able to accept [our] reservation.\" Don't even think about booking this hotel!", "helpfulness": 1, "user": "A TripAdvisor user", "date": "April 22, 2005", "id": 3397743}, {"rating": 1.0, "title": "Bad news", "text": "This hotel was terrible. The odor of restaurant powder room air freshener permeated the hallways and room. I suspect it is used to cover up the mildew. We found mold growing on the mirrors and walls in our room. Stayed one night but had to move to a place where the air was fresh. It's a health hazard to stay here.", "user": "lds122", "date": "April 19, 2005", "id": 3389636}, {"rating": 3.0, "stay_parameters": "Stayed April 2005", "text": "This is an aging property, which was once a bit more charming. Rumor has it that in a year or so the Beach House will be torn down, and condos built on the site.", "title": "Ups and Downs on my Second Stay at the Beach House", "helpfulness": 4, "user": "tradergirl93", "date": "April 17, 2005", "detail_rating": {"cleanliness": 2.0, "value": 3.0, "rooms": 1.0, "service": 4.0}, "id": 3369011}, {"rating": 2.0, "stay_parameters": "Stayed August 2005", "text": "after 2 wonderful weeks driving around florida we arrived in miami and were very disappointed with the beach house. the place has a dirty feel to it. the rooms need a clean and the pool had as much sand in it as the hotels private but disappointing beach. some of the staff were v helpful and it does have a charm but the hotels own book that you get in your room makes you laugh as what they deliver on is not what they promise you. stay somewhere else.", "title": "needs cleaning among other things!!", "user": "thomo33", "date": "August 19, 2005", "detail_rating": {"cleanliness": 1.0, "value": 2.0, "rooms": 2.0, "service": 3.0}, "id": 3788946}, {"rating": 5.0, "title": "This Hotel captures the charm of beachfront living as its best", "text": "My family stayed at the beach house the last weekend of July. The unhurried pace of the place left me feeling replenished at the end of my three night stay in an oceanfront suite, which for $199 per night is unheard of in South beach or other areas of miami beach. We found the place simply wonderful. From the moment we checked in, the staff treated us as I have only been treated in the caribbean. They were courteous and extremely helpful in making us comfortable. As a matter of fact, I felt that I was in someplace other than the tourist trap of Miami Beach. I forgot I was in Miami at all. Yes, the rooms arent luxury, but the plantation style, Ralph Lauren- designed furnishings make you really feel as though you are in someone's beach house in a relatively quiet part of the beach. In one of the large hotels on the beach, you dont feel like you have retreated, only that you have traveled. This is one of the few times that I have returned from a vacation relaxed!!!! At the beachhouse, I felt like I was at home. I could walk from my room to the beach in bare feet and a towel and feel comfortable. The place is small and intimate enough that I had no reservations sending my pre-teen kids down to the pool and the beach unsupervised. The rooms were very spacious and airy. There is a supermarket across the street where we bought fruit ,cereal, and juices for the kids. Neiman Marcus, Saks Fifth Avenue, and Tiffanys are just a short three block walk north. Bal harbour is the ritziest part of Miami Beach. No bumper to bumper traffic and the crowds found in the over-rated south beach. Shopping and fine dining are all within two to three blocks.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "August 1, 2005", "id": 3728749}, {"rating": 5.0, "title": "WONDERFUL!", "text": "The staff are wonderful especially the bartenders and waiters.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "July 27, 2005", "id": 3706186}, {"rating": 1.0, "stay_parameters": "Stayed July 2005", "text": "It's a shame that the hotel has been sold and will be torn down for another of the monstrous high rise glass condos that are going up all over Miami. Do yourself a favor and skip some of the name brand hotels and head for The Beach House for a charming retreat to the unhurried part of the beach", "title": "This place looks nice, but the Smell is terrible!", "helpfulness": 2, "user": "MarthaH2", "date": "July 25, 2005", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "service": 3.0}, "id": 3698432}, {"rating": 4.0, "title": "Great spot, great place!", "text": "I have no idea why anyone would give this place a bad review. Everything here was like staying in a rich friend's house. So relaxing and so beautiful. The decor was straight out of a Pottery Barn catalog, the poolside and beach area were just gorgeous, and the staff was friendly and courteous. My husband and I had a very romantic time there and have reccomended it to many friends and family since!!!", "helpfulness": 7, "user": "A TripAdvisor user", "date": "July 20, 2005", "id": 3688026}, {"rating": 5.0, "stay_parameters": "Stayed September 2005", "text": "We loved the Beach House! I stayed there with my boyfriend, the room was very clean and absolutely nice. People at the reception were absolutely friendly, they helped us with everything we needed. Breakfast is amazing, so good that many times we didn´t have lunch.", "title": "Great, great,great!!", "helpfulness": 1, "user": "Daliada", "date": "October 27, 2005", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 4056054}, {"rating": 4.0, "title": "LOVED IT", "text": "The location is good as well, between south beach and aventura, so not far from anything.", "helpfulness": 2, "user": "mewDenver", "date": "September 24, 2005", "id": 3936645}, {"rating": 2.0, "stay_parameters": "Stayed August 2005", "text": "If you are driving, you will have to pay $15 of valet parking a day, there is not a public parking around.", "title": "Filthy", "helpfulness": 2, "user": "LAholiday", "date": "September 20, 2005", "detail_rating": {"cleanliness": 1.0, "value": 2.0, "rooms": 1.0, "service": 2.0}, "id": 3925165}, {"rating": 4.0, "title": "Escaping to Miami", "text": "I can´t wait to go back, we had a wonderfull time!", "helpfulness": 3, "user": "Leslie T", "date": "September 13, 2005", "id": 3899131}, {"rating": 2.0, "stay_parameters": "Stayed September 2005, traveled on business", "text": "We loved this hotel!! Reasons? It was laid back, friendly, comfy, cozy, right on the beach, great pool, incredibly relaxing, hammocks under palm trees... It was exactly what we wanted. We only ate one meal there as we were visiting relatives and were out with them a lot. Also, it was not expensive for a beach front hotel.", "title": "Not Wonderful", "user": "Jeffrizo", "date": "September 12, 2005", "detail_rating": {"cleanliness": 2.0, "value": 3.0, "rooms": 2.0, "service": 2.0}, "id": 3897608}, {"rating": 2.0, "title": "Very Disappointing", "text": "After a 4 hour drive from Orlando, desperate for a refreshing shower, I discovered from the arrogant employee on check-in duty that our room was not ready yet (despite it being after 3pm). We waited in the lobby for around 30 minutes until I could take no more. I went over to the check in desk and asked if the room was ready, straight away the same guy gave me the key. So our room had become ready, and he'd not evey bothered to tell us. He was happy enough to let us wait. Not a first good impression.", "helpfulness": 3, "user": "shelbali", "date": "July 13, 2005", "id": 3662869}, {"rating": 2.0, "stay_parameters": "Stayed June 2005", "text": "We went up to our the floor our room was on to notice a rather strong smell of urine. Totally gross. I thought it would have to get better. Our room itself was fine, the beds big and comfortable and the room itself was quite spacious. The bathroom however was TINY. So tiny I felt claustrophic when the door was shut.Another big let down was discovering there was no in-room coffee, we had to buy it downstairs!", "title": "Nice commons areas, rooms and service need work!", "helpfulness": 5, "user": "jtrip", "date": "July 4, 2005", "detail_rating": {"cleanliness": 2.0, "value": 3.0, "rooms": 2.0, "service": 2.0}, "id": 3635359}, {"rating": 1.0, "title": "Never been in a worse hotel", "text": "We were short on bath towels, and it took 3 phonecalls to housekeeping to get a full complement. The next day they weren't replaced, so we had to call again. and again.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "June 25, 2005", "id": 3611083}, {"rating": 4.0, "title": "Excellent in many ways", "text": "The hotel was directly on the beach, which was great, and the swimming pool was lovely too.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "June 12, 2005", "id": 3547188}, {"rating": 3.0, "stay_parameters": "Stayed May 2005", "text": "The hotel itself appears more suitable for business travellers than tourists. The staff were largely disinterested and unhelpful. I'm just grateful we had this hotel at a very good rate. I wouldn't stay here again and would not class it as a 4* by any means. By the end of our three night stay, I couldn't wait to go back to our Orlando 3* hotel, for some decent and friendly service.", "title": "Fading fast..", "helpfulness": 2, "user": "BlueChiltern", "date": "May 31, 2005", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "rooms": 3.0, "service": 4.0}, "id": 3512730}], "location": {"country": "United States", "city": "Miami Beach"}, "stars": 4, "variance": {"poor": 23, "average": 10, "very good": 19, "terrible": 35, "excellent": 14}, "aka": "Beach House Bal Harbour Hotel Miami Beach", "slim_ranking": 0.831632653061}