{"user_rating": 4.0, "review_count": 2081, "name": "Beaches Ocho Rios Resort & Golf Club", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed February 2010, traveled with family", "text": "This was our 2nd visit to Beaches Boscobel. Had a great time. Seems like they are fixing up the resort more and more. Lots of painting, bathroom upgrades, etc going on. This is not a posh resort but is extremely comfortable. You don't need to dress up for dinner,etc. Food is very good. Service at the pool bar could be faster, but the main bar is very good.", "title": "Nice relaxing holiday. 2nd visit", "user": "Tbone911t", "date": "February 18, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 56356716}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled with family", "text": "Our experience at Beaches Boscobel was truly wonderful. We had a room at the airport with complementary drinks, the driver told us lots of interesting facts about the island on the drive to the resort, we were checked in and enjoying a delicious supper soon after our arrival. Our son and I scuba dive almost daily. The scuba staff have very high standards for safety and I have watched them introduce new divers to the sport. They are exceptional. They will be teaching my grandchildren as soon as they are old enough. The food is fresh and well prepared with lots of variety. From International night to Seafood night the variety and quality will have you looking forward to meal time like never before. You can enjoy nice wine and cool slushy drinks at your leisure. This resort caters to children and families. Our two granddaughters were kept busy and entertained the entire two weeks. It is not the fanciest resort, in fact there are some signs of wear in places but it is kept very clean and safe and the staff could not be improved upon. We have been to this resort 3 times and have booked again for next year. Even more of the family is coming next year. Our family loves it there. Can't wait to go back.", "title": "The Friendliest Resort Staff", "helpfulness": 2, "user": "ScubaLynnRedDeer_AB", "date": "February 17, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 56277118}, {"rating": 4.0, "stay_parameters": "Stayed January 2010, traveled with family", "text": "After reading many of the horror stories, I had my reservations about booking at the Beaches Boscobel, especially after staying at the Beaches Negril last year. However, the price was right and we took our chances. We were not disappointed! Our family of 4 (2 boys ages 9 and 6) had another fabulous time!", "title": "Great trip despite my reservations", "helpfulness": 2, "user": "scubamammaMilton", "date": "February 17, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 56224873}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled with family", "text": "The kids club was fantastic- I appreciate the fact that they separate the kids into age groups so that they can do more age-appropriate activities. Negril went one step further breaking up the 4-7 year olds into 2 groups. My boys met many friends who they played with later in the day by the pool/waterslides/beach. We even tried one evening at the kids club so that we could try Eleanor's and it was a lovely QUIET meal!", "title": "FANTASTIC.....WE WILL BE BACK!!!!", "helpfulness": 1, "user": "janie5", "date": "February 15, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 56059384}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled with family", "text": "The beach is small, but so is the resort. With children, this is a plus because you can give them some degree of freedom/independence (with their walkie-talkies). The waterslides are fantastic for the kids and the adults!", "title": "We could not have enjoyed our trip more.", "user": "rewie", "date": "February 15, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 56052926}, {"rating": 3.0, "stay_parameters": "Stayed February 2010, traveled with family", "text": "We just returned from Beaches Boscobel after a five-night stay. Travelled with a 13 yr. old and a 17 yr. old. Overall, we had a good trip. I was a little nervous after reading some of the reviews on here. Amazing how one person loves it and another hates it. The resort is older, but in decent shape. The food was good. Eleanor's is the best quality of food and children under 12 cannot dine there. We ate there once. Arizona's was probably the worst, but it was nice to eat outside. You can get nachos, soup and a salad buffet style and order your dinner. I got the spare ribs (beef) and they were not that good. The jerk chicken is good everywhere. The desserts, overall, were not very good, which was probably for the best. They did have a chocolate buffet one night, which was really good. Entertainment is good. Kids did get a little bored, as they are too old for the Sesame Street thing and got bored with the XBox thing. Beach is very small, but we never had a problem finding chairs and it's the only place to find shade- none at the pool. The thing we liked best about the stay is the people are amazing! Everyone is SO FRIENDLy and I don't think it's to try to get tips. They seemed genuinely sad when we were leaving- kisses and hugs all around. We did leave a couple of tips when we had exceptional service- such as in Eleanor's (Kirklon). Girls at the BBQ Park were super nice, too. I was really disappointed that we didn't get an upgrade. This was our 5th stay at a Beaches/Sandals property and I thought we should've received an upgrade with no question, but it didn't happen. It was about 70% occupied, I would say and we never waited for dinner (went early usually) and pool didn't seem ridiculously crowded. We did get to go to a nice luncheon for repeat visitors and they had an excellent red snapper and gave us a big bottle of Appleton rum. Overally, the Beaches/Sandals propeties are a good value. They are just a notch above their competition, but you pay for it.", "title": "Good trip, overall", "helpfulness": 1, "user": "aktlwer4", "date": "February 15, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 56044907}, {"rating": 3.0, "stay_parameters": "Stayed February 2010, traveled with family", "text": "Arrived a few days ago...its ok but things in room need to be replaced or upgraded.", "title": "its just ok not 5 star kinda needs redone", "user": "kjfiliault", "date": "February 14, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 2.0}, "id": 55972667}, {"rating": 4.0, "stay_parameters": "Stayed January 2010, traveled with family", "text": "Our bed has tons of scratches furniture has stains on them... Its ok just not a 5 star", "title": "Wonderful Family Vacation", "helpfulness": 4, "user": "DaveR-CT", "date": "February 13, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 55880032}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled with family", "text": "Food is not that great but its the carribbean. Very small portions and skimp on protein in sandwhiches lol. Service is pretty good except for the resturant on the pier. WE had horrible service there. Pools are ok grounds are nice . Its FAR from airport 2 hr ride just about killed my kids after being on a plane for 5 hrs. Be prepared for that. The beach is nice just VERY small. Lots of $ for what I thought should of been better, but we are having a good time", "title": "Fabulous vacation- The staff made the vacation", "helpfulness": 2, "user": "timssister", "date": "February 12, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 55850401}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled with family", "text": "My family (I’m 43) with two kids (8 and 6) just returned from a 10 day vacation at Beaches Boscobel. For a point of reference, last year we went to Paradisius in Punta Cana, and we have vacationed in Anguila and Mexico, along with several years at FDR Resorts in Jamaica. We decided to go back to Jamaica, in part, because of the people. The Jamaican people are so nice and friendly, and the employees at the resorts are so much nicer than other countries we’ve visited. They routinely go the extra mile – from the obvious people, such as bartenders and waiters, to the security personnel, the landscapers – everyone is always so friendly. Beaches Boscobel is no different – the staff is terrific. By the end of the trip about 15-20 of the staff new us by face or name – it makes the vacation feel more intimate and just makes you feel welcome.", "title": "awesome Vacation cannot be topped!", "helpfulness": 2, "user": "traceygrlee", "date": "February 12, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 55842615}, {"rating": 4.0, "stay_parameters": "Stayed January 2010, traveled with family", "text": "We arrived in Jamaica after our six hour flight where Elmo and friends met up with us- our three year old was thrilled (and our 9 month old seemed to enjoy elmo as well). We enjoyed a quick beer and cookie then headed to the hotel. Unfortunately the shuttle ride was just over 2 hours. When we arrived the check in was pleasant and quick, the staff were amazing. Our room was a good size, two double beds, a pull out sofa and day bed. We had a coffee maker, small fridge and lots of closet space. The room was very clean and the balcony was large and inviting.", "title": "Excellent vacation for families with young children", "helpfulness": 2, "user": "AshleynKeith", "date": "February 7, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 55355498}, {"rating": 4.0, "stay_parameters": "Stayed January 2010, traveled with family", "text": "We mostly ate at the buffet. The food was pretty good, a good assortment of meats, veggies and starches, I would have liked to see more fresh fruit- there wasn't too much of anything ( a few bananas, canned fruit, watermelon). No one in our gang got sick or had any tummy upset.", "title": "Not a good hotel for strollers!!!!!", "user": "housworth", "date": "February 6, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 2.0, "rooms": 2.0, "location": 2.0}, "id": 55351702}, {"rating": 4.0, "stay_parameters": "Stayed January 2010, traveled with family", "text": "The adult pool was smaller than I thought, but was nice, there wasn't too many people swimming and there was always a lounge chair to sit on. The children's pool was great, a little cool for the wee one but lots of slides and fun to be had. The only complaint was the hight restrictions for the slides. Our 3 year old wasn't tall enough to ride by himself (even with a life jacket) so there were only 3 slides to co-ride down, and the rest you had to be tall enough to ride single which was 3 ft 6 inches. The staff was very sticky on this!", "title": "Docked Cruise Ship", "helpfulness": 2, "user": "BlueLola", "date": "February 6, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 2.0, "rooms": 2.0, "location": 3.0}, "id": 55326702}, {"rating": 4.0, "stay_parameters": "Stayed January 2010, traveled with family", "text": "The beach was very small but awesome for little ones. The beach was very shallow with a small swimming area roped off. We didn't find the beach to be all that busy, it was easy to find a lounge chair. Towels were a bit tricky to find, they usually were all gone or in the wash. The pools usually had towels around. All water sports- kayaks, sailboats, glass bottom boat, banana boat and snorklling was all included.", "title": "Much better than expected", "helpfulness": 3, "user": "Glenn0404", "date": "February 5, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 55286287}, {"rating": 4.0, "stay_parameters": "Stayed January 2010, traveled with family", "text": "My husband and I had the best massage of our life on the beach- I would have liked to take her back home with us. We both had a 1 hour full body massage for only $160 USD and she threw in some massage oil too.", "title": "Great Place for kids not for parents", "helpfulness": 2, "user": "fatlady1", "date": "February 4, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 1.0}, "id": 55203434}, {"rating": 4.0, "stay_parameters": "Stayed February 2010, traveled with family", "text": "We had a very relaxing trip to Beaches Boscobel from Jan 29 - Feb 5, 2010!! I read reviews and was a little nervous but I did not find most of what I read to be true! The beach was beautiful!! Smaller than some other Beaches properties but \"private\". I much perfer a private beach where you don't have to worry about the kids venturing off too far!! (No-outsiders except a few Jamaican's selling home-made crafts.) We were fortunate enough to get a \"free\" room upgrade to an ocean-view with a balcony (VERY NICE!!) Perhaps the older rooms would not have been as nice - but ours was great! The bed mattresses were not the most comfortable! The staff was wonderful (especially Peter our omelet maker who remember us every morning!) The nightime entertainment was lacking. Not real professional, outside of a few vocal acts. Did not compare to the entertainment you find on a cruise! They could have offered more family type entertainment / like pictionary against other families etc. They also could have diversified their entertainment to include more prizes and also more age groups. The food was comparable to a cruise. Very good! We really like the \"all-inclusive\" so we did not have to pay extra for drinks. Frozen drinks were very good! Regular mixes were very strong =). The snorkel trips were very short, like only 30 minutes in length! MAKE SURE you get a doctor's approval slip BEFORE you go to BEACHES RESORTS \"IF\" you are planning to scuba!! (Check their medical questionaire on-line)!!! Very important as I am a relatively healthy person but because I have allergies & sinus issues I had to get a doctor's permission to Scuba!! This is difficult to do once you are already in Jamaica. (Took us three days!!) Loved the water-park and movie night by the pool!! Felt very safe the whole time!! Would highly recommend this resort as long as you get the ocean view!!", "title": "Beaches Boscobel was comparable to a cruise - pros & cons.", "helpfulness": 2, "user": "Funtimers", "date": "February 10, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 55641951}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled with family", "text": "We have been home for 2 days now and wish we were back in Jamaica.", "title": "AMAZING HOLIDAY!!!", "helpfulness": 2, "user": "Mika-23", "date": "February 9, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 55583720}, {"rating": 4.0, "stay_parameters": "Stayed January 2010, traveled with family", "text": "Before we left I read a lot of negative reviews and was very worried.", "title": "Great Family Resort", "helpfulness": 2, "user": "TK10NewBrunswick", "date": "February 9, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 55568553}, {"rating": 2.0, "stay_parameters": "Stayed January 2010, traveled with family", "text": "I can tell you that we had a great holiday!!!My 6 year old daughter had a blast at the Waterpark and in the pool. We did not visit the beach very much as we preferred the pool and waterslides. The staff was amazing, the food was great. We ate most of our meals at the Bayside and we did eat at Eleanores which was very good. The theme night of Jamaican food was great. I did not hear of anyone getting ill from the food and we drank the water everyday and did not get ill. The staff work extremely hard and were always willing to help you with anything you needed. My daughter visited the kids camp twice and she loved it. The ride from the airport was 2 hours and a bit but it was interesting to see the sights on the way to the hotel. Our room was clean and very spacious we had a view of the Ocean. This resort caters to families so if you are looking for nightlife this is not the place for you. My husband did go to the Appleton bar and had a fun time. He also went golfing 5 days out of the 7 we were there and had a great time, he did bring his own clubs.", "title": "Don't do it!", "helpfulness": 1, "user": "sophakingsp", "date": "February 8, 2010", "detail_rating": {"service": 3.0, "cleanliness": 1.0, "value": 1.0, "sleep": 3.0, "rooms": 2.0, "location": 2.0}, "id": 55516427}, {"rating": 4.0, "stay_parameters": "Stayed February 2010, traveled with family", "text": "I saw people painting and cleaning things everyday I was there and the weather was great.", "title": "Fantastic!", "helpfulness": 1, "user": "Amanscoem", "date": "February 7, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 55406242}], "location": {"country": "Caribbean"}, "variance": {"poor": 136, "average": 228, "very good": 637, "terrible": 124, "excellent": 956}, "aka": "Beaches Boscobel Resort & Golf Club Hotel Boscobel", "slim_ranking": 0.5, "detail_rating": {"service": 4.5, "cleanliness": 4.0, "value": 4.5, "sleep": 4.0, "rooms": 4.0, "location": 3.5}, "description": "•Minutes away from the newly renovated Ian Fleming International Airport•Kids Camp with certified nannies to pamper the kids •Supervised Xbox® Play Lounge with flat screen plasma TV’s•Kids can enjoy fun and games with Elmo & friends in our Sesame Street Caribbean Adventure•Adults-only El Dorado bar located on a terrace overlooking the Caribbean Sea •A state of the art “Liquid by Beaches” Disco •Pirates Island Water Park offering eleven slides for all ages•Voted Beaches Resorts ‘World’s Leading Family All-Inclusive’ 14 years in a row"}