{"user_rating": 5.0, "review_count": 289, "name": "Beausite Park Hotel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "We paid a little extra to have a balcony with a wonderful Mountain view. To say that it was money well spent would be a massive understatement. The views we spectacular and will stay with me for ever. We had a wonderful time. The staff were very friendly and helpful. The hotel was great. Wengen is a car less village (they do have a few electric vehicles). It was amazingly peaceful. Wengen is a nice town with good connections elsewhere by rail which is so reliable. We went in the summer, but in the winter we believe that you can ski right to the hotel.", "title": "A magical place", "user": "Nancy_n_Paul", "date": "August 3, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 73575748}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "This is the best run hotel we've ever stayed in. The service was excellent, the food was absolutely amazing, the rooms were spotless and spacious, and the location was beautiful. We found the pool and spa experience, along with the package deal to be an excellent value for the money. I highly recommend this hotel, will return there next season, and couldn't imagine staying anywhere else. The experience was that amazing!", "title": "Best overall service, food, and stay we've ever had", "user": "cravenhill", "date": "April 3, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 60261541}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled with family", "text": "We stayed for a week with our 3 children age 6 to 13 to celebrate my 40th birthday. Our 13 year old has severe milk egg and white fish food allergies. We cannot praise the hotel enough from the welcome on arrival to the fantastic persional service, especially to the hotel for catering for my daughters food requirements-they provided a seperate menu for her even going as far as to ask us what she liked and going out to purchase it specially-we had a wonderfully relaxing holiday as usually catering for our daughter is very difficult and having the hotel take care of her diet truly made it a holiday for us and our daughter. They also went the extra mile to make my birthday very special. The bedroom suite was large with plenty of room for the 5 of us and the hotel is in a great position. I would not hesitate to recommend the hotel-the staff were fabulous with our children, the food amazing and with views that took your breath away truly a fantastic holiday and a hotel that we will return to. The personal service from the owners and their professional staff was second to none", "title": "wonderfull! When can I go back?", "user": "IsleOfManEmily", "date": "March 19, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 59009930}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "Stayed with my wife for a skiing holiday Jan 23rd to 30th. Very well appointed room with fantastic views which was kept spotlessly clean throughout our stay. Breakfast and dinner were first class with plenty of choice. Dinner often has a buffet element but don't be put of as the variety and quality is excellent. Very good indoor poor, jacuzzi, sauna etc. Staff are all very helpful and the owners are always around to keep an eye on things. Can ski very nearly from the door and if you can't manage the nursery slope lifts to get back, the hotel will happily send their minibus to pick you up from the station.", "title": "Excellent hotel in", "user": "David061", "date": "February 16, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 56141157}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled with family", "text": "Can't recommend it highly enough.", "title": "Best hotel in the world", "user": "alexmitchellphoto", "date": "January 19, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 53831358}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "This hotel is located 8 min walk from the train station. Basically a great hotel with excellent view (need to stay south facing rooms!) Must go for their breakfast and dinners. It's a great value!!! Dinner is something we look forward to every evening after a long day of activities. Overall a great value with 5 star service in a 5 star location, although the room itself is more of a 3 star rather than 4 star.", "title": "Great hotel with excellent view", "user": "Honeymoon1107", "date": "October 9, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 46425035}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled with family", "text": "I have been coming to this hotel for over 10 years ith my adult family and often twice a year.The Way the owner Margrit runs this hotel with her husband is exemplary.", "title": "The Best Owner Managed hotel in Switzerland", "user": "bossybirdUk", "date": "September 8, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 40128820}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "The attention to detail and personal touch, combined with their desire to constantly upgrade things without loosing any character of the hotel make it a delight to stay at.", "title": "Great hotel with a beautiful view!", "helpfulness": 1, "user": "Fasttimes_NYC", "date": "August 31, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 4.0, "service": 5.0, "rooms": 3.0}, "id": 39396754}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "As a constant traveller it is rare to find such standards being maintained year after year . It is a jewel in the Swiss Mountains.", "title": "Wonderful hotel in a beautiful village!", "user": "pixie_confusion", "date": "August 28, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 39082675}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "We stayed in the Beausite Park Hotel for two nights while in Switzerland on vacation. The hotel is situated on the highest part of the town of Wegen. We parked our car in Lauterbruennen and took a train to Wengen. Once we arrived in Wengen we decided to walk up the hill to the hotel with our rolling luggage to the hotel. Wow, that hill is a pain to walk up with your luggage. I would recommend taking advantage of the complimentary pickup services unless you are in good physical condition.", "title": "Beautiful views, exceptional staff, wonderful holiday", "user": "CevCev", "date": "August 4, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 36696864}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "Stayed here for a few days skiing. Couldn't fault it for comfort, good food and pleasant host and staff. Our room had a lovely view out over the village towards the mountains across the valley and the one evening when we had sunshine we were able to enjoy the balcony! Slightly set back at top of village so very peaceful and quiet. Very comfortable beds! Swimming pool, sauna etc. were excellent and most welcome after a day on the slopes!", "title": "An enjoyable stay", "user": "disleksik", "date": "June 23, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 114676093}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "We stayed here for our honeymoon in Feb 2011 and couldn't have asked for better. Hotel was beautiful and immaculately clean. Rooms tidied twice daily and often gave us a laugh at the extremes they went to to keep the place looking smart! Service was first class - we were made to feel exceptionally welcome by the owners Margrit and Erich Leemann and their staff (special mention to our waiter Victor). Five course evening meal was consistently excellent. Breakfast buffet had everything you could want to set you up for a day on the slopes. Spa facilities were a welcome bonus at the end of a tiring day outdoors. Village had a lovely relaxed feel about it. Very family friendly but if you're looking for lively apres ski then suggest you maybe look elsewhere. Good base from which to access the vast skiing available in the jungfrau region. Swiss ski school tuition excellent. All in all this hotel is definitely worthy of at least its 4 stars - in terms of service we felt it merited 5 stars.", "title": "All we could have wished for in our honeymoon hotel", "user": "DCuster", "date": "March 27, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 101783304}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "We got married in Wengen last September. It was a childhood dream and we cannot thank Mr and Mrs Leeman enough for making it the most fantastic weekend of our lives. Nothing was too much trouble for them or their staff. They had thought of every detail to make our wedding day so special. Our guests had a wonderful time and I am sure will talk about the Park Hotel and the beauty of Wengen for years to come.", "title": "Our wonderful wedding in Wengen", "user": "Owen2010", "date": "March 21, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 100959746}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "The service, food, accommodation and facilities were excellent. It was a magical experience and we only wish we could re-live it every weekend. The attention to detail was incredible from the fresh flowers displayed in every room to the turning down of our beds each evening. We had such a wonderful time which we will never forget.", "title": "4 Star hotel with 5 Star service - just love it!", "helpfulness": 1, "user": "Mountaintraveler65", "date": "January 23, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 94156057}, {"rating": 4.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "I would highly recommend the Park Hotel.", "title": "Nice hotel, good food, a bit out of centre, freezing swimming pool", "helpfulness": 1, "user": "Skeptyk", "date": "January 18, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 93560976}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "We are a family from Ontario, Canada who traveled to Europe this summer visiting three countries. Our stay at Beausite Park Hotel was the most memorable part of our trip. Booking the hotel was easy as the responses I recieved were all personalized and reassuring. When we arrived the at the hotel the view took our breath away. The rooms were spotless and inviting. We were given the a fabulous one bedroom suite that provided ample space.", "title": "stunning location and exceptional facility", "helpfulness": 1, "user": "motherofthree33", "date": "October 3, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 81909282}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "The meals were excellent-healthy fresh and a multitude of options. We loved eating at the Beausite. My seven year old son with his fussy eating was made to feel included and valued.", "title": "What a fantastic hotel", "user": "ChessiePeake", "date": "September 18, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 80043119}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "The staff at Beausite are exceptional. Mrs Margrit Leeman-von Allmen is so gracious and to see her working alongside her staff said it all. Special thanks to Kathrina, Anne, Jana and Corrado-these staff members went above and beyond.", "title": "Best vacation ever.", "user": "EarnestTourist", "date": "September 10, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 79034849}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled with family", "text": "My sincere thanks to all of you. We will be back .", "title": "Perfection for adults and children alike", "helpfulness": 1, "user": "Surreyfamily89", "date": "August 29, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 77305877}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "Cannot praise this hotel highly enough. We stayed there for a week and were already planning another visit before we left. There seemed to be a huge number of clientele who had been there before and kept returning. The hotel is in a quiet location at the top of the town, a 10 minute walk to the train station and 5 minutes from the gondola. It is worth paying the extra for a Jungfrau view which is spectacular. The hotel is spotless and standards are high throughout. There is a 5 course dinner each night prepared to very high standards and every night a different section of the menu is a buffet with a huge selection. The staff were consistently cheerful and could not do enough to help. Coraldo the maitre’d ensures that the restaurant runs efficiently and doesn’t seem to miss a thing but is also a character who helps to make the stay enjoyable. The owners work hard to ensure that all of the guests needs are met. Wengen itself gives easy access to the neighbouring areas of Murren, Grindalwald and Interlaken.", "title": "Great quality - stunning location", "user": "SusanJones30", "date": "August 10, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 74563850}], "location": {"country": "Switzerland", "continent": "Europe"}, "stars": 4.5, "variance": {"poor": 4, "average": 6, "very good": 32, "terrible": 0, "excellent": 247}, "aka": "Beausite Park Wengen", "slim_ranking": 0.047619047619, "description": "Our hotel is majestically situated in the middle of a park in a most beautiful and tranquil location just above the village centre of Wengen. Views of the Jungfrau an surrounding Alps are breathtaking. The village centre and the mountain railway station can be easily reached on foot. In less than a few minutes, you can be hovering over the \"Männlichen-Kleine-Scheidegg\" ski an hiking paradise on the Wengen-Männlichen cable car."}