{"user_rating": 4.5, "review_count": 89, "name": "Bed and Breakfast La Limonaia", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "La Limonia was a FANTASTIC experience! Giulio and Christina are wonderful! Extremely friendly and welcoming. you are part of their family from the moment you walk in the door and added to their every growing extended family they continue to grow as more and more guest stay and play with them as we all learn and love the Italian culture and tradition!", "title": "molto buono!!!! La Limonia, Everyday people sharing the italian life!", "helpfulness": 1, "user": "ChipsAndSalsa", "date": "July 13, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 17853248, "likes": {"liked": "— The Owners and People - Location and Atmosphere", "disliked": "— I have no complaints"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "make sure to take Giulio up on one or more of their Tuscan \"Experiences\" to learn how to cook traditional pasta sauces or tasting wine and driving around the Tuscan country side as he explains history and introduces you to a few of his friends.", "title": "Tuscan Hillside Retreat", "user": "Fitzwillow", "date": "July 5, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 17566832, "likes": {"liked": "— A quintesential Tuscan villa experience", "disliked": "— That we couldn't stay longer"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "I would absolutely recommend La Limonia for anyone traveling in and around Florence (Firenze) and the Tusca region. This was a perfect place to stay and base our selves to enjoy both the city and the hills.", "title": "Memories that will last a lifetime", "helpfulness": 1, "user": "Steve W", "date": "June 11, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 16865219, "likes": {"liked": "— The wonderful hosts", "disliked": "— not a thing"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "Brian and Kristy MacLean", "title": "The Best B&B on Our Honeymoon", "user": "Adventures_r_Us_5-24", "date": "June 9, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 16808625, "likes": {"liked": "— The hosts - Giullio and Cristina were fantastic", "disliked": "— That we couldn't stay there longer."}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "The Italian experience is all about the people. Friendly and welcoming, passionate about life, food, wine, friends and family. That is the experience you get at La Limonaia, where you are greeted for the first time like you have just returned from being away, with a glass of wine and some delicious little somethings while they get to know you. From there the experience unfolds and you find that you are doing spice tastings, running down the rows of the vineyards in a Land Rover up hills that take you to exquisite views, that you are hanging for hours on the stone wall waiting to see the sun set over the Duomo in Florence in the distance with a glass of red and some local cheeses, that you are anticipating the cooking class tonight and the day trip tomorrow. You sit up talking until late at night on every subject around the heavy wood dinner table learning and laughing. You tuck in at night with real embroidered linen sheets and listen to almost nothing - look out the wood shuttered windows and see the lightening bugs light up the olive groves. But in the end, it is always for us the people, and Giulio and Christine are the kind of generous, loving people that we would like to hang out with and invite to our house for a long weekend so we could do it again.", "title": "Wonderful Setting and Gracious Hosts!", "user": "TravelerNJ1416", "date": "June 7, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 16744950, "likes": {"liked": "— The owners, the setting, location", "disliked": "— Nothing!"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "If you are looking for a truly unique and one-of-a-kind experience in the Tuscan region, then you need to stay here. The hosts Giulio and Christina are fantastic (and the breakfasts each morning were the best meals we had throughout our 2 week trip through Italy). The rooms are HUGE and the view of the city is breathtaking.", "title": "One-of-a-kind Experience", "user": "StaniMesh", "date": "June 6, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 16717822, "likes": {"liked": "— The personal attention and being outside of the hustle and bustle of downtown Florence", "disliked": "— Nothing at all, it was perfect!"}}, {"rating": 5.0, "title": "Beautiful, Gracious La Limonaia !", "text": "We did two different wine experiences and the saffron experience with Giulio. I could write a book about each, but to sum them all up, these are very personal tours/experiences that you CANNOT get with any sort of group or typical large named tours. These experiences truly immerse you in the Tuscan country side and culture and made our trip unique. The things you get to experience during these excursions are truly due to staying with people that have lived there and know people.", "helpfulness": 1, "user": "HBLovers", "date": "June 1, 2008", "id": 16549513}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "If you want more information, go to there website; there is a contact in the US you can speak with that has taken all of the experiences and can provide extensive feedback on each.", "title": "Fantastic \"Experiences\"", "user": "StaniMesh", "date": "May 17, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 16150688, "likes": {"liked": "— The personal attention and being outside of the hustle and bustle of downtown Florence", "disliked": "— Nothing at all, it was perfect!"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "We will definitely return!", "title": "A wonderful place to truly enjoy Tuscany", "user": "LynJerry", "date": "May 1, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 15557758, "likes": {"liked": "— Great hosts", "disliked": "— Narrow roads"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled with family", "text": "We absolutely loved our time at La Limonaia! It is truly a charming and peaceful retreat, set up on a quiet hillside overlooking beautiful Florence. This was perfect for us as we were only 10 minutes from the city when we wanted to visit there, but otherwise we felt worlds away, a welcome retreat after a long day of sightseeing ! Our hosts, Giulio and Cristina, were so warm and welcoming, and helpful in every imaginable way. They went out of their way to help us with everything we needed and were a wealth of information on all things Italian! Giulio even personally took us into town one day to help us take care of the details of our train trip from there to Sorrento, which we greatly appreciated. Giulio and Cristina's passion and love for what they do is evident, and we felt like very special guests in their home. We had a beautiful and spacious room with every amenity that we needed and a sumptuous breakfast every morning...and I should not forget to mention the wonderful wine and appetizers with which Giulio and Christina welcomed us upon our arrival! Our only disappointment was to not get to stay longer so that we could partake of some of the wonderful food and wine experiences that they offer. Well...it gives us a reason to go back !", "title": "Escape to simple, subtle perfection-", "user": "Tommy66", "date": "May 1, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 15554442, "likes": {"liked": "— Location, comfort and service", "disliked": "— I rained one night during our stay :( ..."}}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "What makes this B&B special are the owners and their kindness, conversation and willingness to go above and beyond for their quests. We took the bus to the B&B. Guilio, the owner, picked us up from the bus stop after we called from a pay phone. He also took us to and from the bus stop the following day and to the bus stop again the day we left. We did not have a rental car, but there is parking on site if you choose to do so.", "title": "Owners go above and beyond....", "user": "mrselett", "date": "October 31, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 48209369}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "We had great conversations and were treated to a complimentary bottle of wine since we were celebrating our anniversary. We did the candlelight dinner in the vineyard, which I must say was one of the most memorable parts of our entire trip to Italy. This excursion is organized by La Limonaia. Absolutely breathtaking!", "title": "Perfect day in Tuscany", "user": "likehow22", "date": "August 7, 2009", "detail_rating": {"value": 5.0, "service": 5.0}, "id": 36957298}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled with family", "text": "The view is gorgeous from the garden…you can see Florence in all of its glory. The room was the largest we stayed in during our entire time in Italy. The bed was very comfortable. We got a little warm during our summer stay and were quickly provided a fan.", "title": "A great way to stay in the Tuscan countryside", "user": "mgm112", "date": "July 27, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 3.0, "service": 5.0, "rooms": 5.0}, "id": 35977469}, {"rating": 5.0, "title": "La Limonaia", "text": "This is a place to get away from it all and turn on the romance. No tv, no phone, just wine, views and each other.", "user": "filippo_lippi", "date": "June 18, 2009", "id": 32590543}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "There are friendly cats that hang around the property. I’m actually allergic, but didn’t have any problems.", "title": "Such an great B&B, wonderful hosts", "user": "sonjasophia98", "date": "March 7, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 25772103}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "During our fabulous 3 week honeymoon in Italy, our stay with Giulio and Christina was by far the best. I'm not sure where to even begin. These two are the sort of rare gems you meet once in awhile and consider yourself lucky for having had the pleasure to know them. I was so impressed by them, their B&B and the tours they offer that I offered myself as consideration to be their Canadian Ambassador. That should say enough right there.", "title": "Exceptional Experience at La Limonaia", "user": "laurabutler8", "date": "February 2, 2009", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 24109000, "likes": {"liked": "— The amazing hosts!", "disliked": "— That we couldn't stay longer."}}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "To start with, we lost our flights over from Canada when Zoom Airlines when bankrupt. I contacted Giulio with my plight regarding our booking with him and he easily and happily re-booked our reservation without any fuss. Once we arrived (which was late at night due a transportation strike in Italy) he helped us with finding a place to eat dinner and then picked us up at the bus station and brought us back to his B&B. He routinely dropped us off each morning at the bus without our even asking. The service offered by he and Christina was top notch in every way. They are very attentive hosts and I felt I could approach them for anything. They made a delicious_complimentary_meal for us and another honeymoon couple who were staying there at the same time (home made fresh pesto on pasta with terrific wine and scrumptious mille foglie pastry with a local dessert wine)!! Christina gave us the La Limonaia wedding message written on a scroll while we were enjoying dinner. It was a fabulous evening that was completely unexpected. Breakfast was always great with lots of choices (omelettes made to order, fresh produce, meats, cheese, yogurt, scrumptious cherries, pastries, juice, coffee) and we always left full. Our spotless room was very elegant and very Tuscan--I loved it! They provide little extras like chocolates on your pillows and hanging your laundry outside the window for you. Honestly I don't know how they could have been any more attentive. If we had not already had another booking in Rome that we could not cancel, we would have stayed the last few days of our honeymoon at La Limonaia. If you are worried about getting in and out of Florence, don't. It is easily connected by a bus that runs frequently and a short walk from the bus stop to the B&B. We're already planning to return to La Limonaia as soon as we are able and I suggest you book with them if you can! Thank you Giulio & Christina and your lovely kitties!", "title": "Paradise in Tuscany", "helpfulness": 2, "user": "MSJ1", "date": "October 19, 2008", "detail_rating": {"cleanliness": 5.0, "location": 5.0, "value": 5.0, "rooms": 5.0}, "id": 21010093, "likes": {"liked": "— Hosts, food, accomodations and view", "disliked": "— Nothing"}}, {"rating": 2.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "We stayed at La Limonaia for five nights at the end of September. When we arrived at La Limonaia, I didn't realize how special it was going to be here in the hills of Bagno di Ripoli. Giulio had a fabulous lunch waiting for us, including cheeses, olives, bread, wine and much more.", "title": "could have been so great...", "helpfulness": 2, "user": "MMY86", "date": "October 17, 2008", "detail_rating": {"cleanliness": 5.0, "location": 2.0, "value": 2.0, "rooms": 4.0}, "id": 20965259, "likes": {"liked": "— the cleanliness of the room", "disliked": "— read my review!"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "We went on three different \"tours\" with Guilio, including a wine tasting to a beautiful castle in the hills where we tasted four different wines with our beautiful lunch in the music room; a saffron tour which included a four course lunch with each course made with saffron, and a visit to Pierre's beautiful herb garden and tasting of the herbs with cheeses and wine. Not only did each tour include delicious food and wine, but was also very personalized and a unique experience.", "title": "Like Home in Tuscany!", "helpfulness": 2, "user": "KandDfromNY", "date": "October 2, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 20575749, "likes": {"liked": "— personalized experience from owners", "disliked": "— no tv-- but we quickly learned this was a GOOD thing for relaxation !!"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "Each morning we had a delicious freshly prepared breakfast made by Giulio in the breakfast room, where Christina's personal touches were on the tables and throughout all of the rooms. We loved the beautiful garden in front of the room with the colorful flowers and trees and a little bench that you can sit on overlooking the olive trees and Florence in the distance. Giulio and Christina are very kind and gracious hosts and they went out of their way to make us feel as if we were at \"a home away from home.\" We have stayed at other Bed and Breakfasts, but this was a \"one of a kind\" unique experience that we will never forget.", "title": "The Tuscan Experience", "helpfulness": 1, "user": "diverunc", "date": "July 27, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 18310014, "likes": {"liked": "— The quaint atmosphere and stunning views of Florence were incredible.", "disliked": "— Nothing"}}], "location": {"country": "Italy", "region": "Tuscany", "continent": "Europe"}, "stars": 3, "variance": {"poor": 4, "average": 0, "very good": 10, "terrible": 1, "excellent": 74}, "aka": "Bed And Breakfast La Limonaia Province Of Florence/Bagno a Ripoli, Italy", "slim_ranking": 0.666666666667, "description": "La Limonaia is a family bed and breakfast specialised in wine and food experience. It gives you the oppoertunity to enter in our older toscany traditions in the respect of what our family teach us. Came, smell, taste, eat and drink the party is started!"}