{"user_rating": 4.5, "review_count": 101, "name": "Bed and Breakfast Diana Brown", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "Diana Brown is a friendly South African lady who owns this B&B (though she told us that she doesn`t do breakfast in August) in a little side alley off the main street. The room we had was on the second floor (watch that heavy suitcase) up a marble staircase. It had its own wonderful roof terrace with a small kitchen where you can cook or, like us, just buy it all in ready made and save yourself the bother. Then sit back and watch the locals on their terraces. There`s a supermarket a stone`s throw away which is open until 9.30. The room was very clean and appeared to have been recently made over; for example, the cupboards and shutters looked new. The air conditioning was efficient and very quiet - it helps to be able to sleep with the window shut if you`re a light sleeper as there`s always the noise of Italian family life going on outside from early til late. It`s a bit of a trek from the dock, especially in the summer heat, but Diana will meet you off the hydrofoil so you won`t get lost. This is very good, reasonably priced accommodation and I would definitely recommend it.", "title": "Good basic clean accommodation", "helpfulness": 2, "user": "Teithiwr", "date": "August 8, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 3.0}, "id": 18739005, "likes": {"liked": "— Roof terrace", "disliked": "— Narrow stairs"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "Reasonably priced, really friendly and helpful staff, nice rooms. I cannot fault this place and would stay here again when I next visit Lipari.", "title": "Perfect budget place to stay", "helpfulness": 1, "user": "starryeyedLondon", "date": "July 2, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 17446895, "likes": {"liked": "— economic"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2007", "text": "We stayed 2 nights in a studio which was adjacent to the B&B. This was a larger space than we were used to in Sicily, for about half the price. It was clean and the shower was good. The location was good also. Diana's husband came to meet us from the boat, and Diana herself is very approachable and pleasant.", "title": "Cheap & Pleasant", "user": "heidtheba", "date": "November 3, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 4.0}, "id": 10568999}], "location": {"country": "Italy", "continent": "Europe"}, "variance": {"poor": 0, "average": 6, "very good": 29, "terrible": 5, "excellent": 61}, "aka": "b&b Diana Brown", "slim_ranking": 0.178571428571}