{"user_rating": 5.0, "review_count": 361, "name": "Bed & Breakfast Gallery Yasmine", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "Beautiful rooms in a perfect locaton.", "title": "Probably the best B&B in the world.", "user": "Ronnie317", "date": "January 10, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 53095545}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "The hospitality is the best we have ever experienced, cannot recommend highly enough.", "title": "Wonderful surprise in wonderful Bruges", "user": "KaraLondon", "date": "January 3, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 52475995}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled with family", "text": "I booked this B&B on recommendation from a friend and i have to say it is the best advice i have followed. I took my partner here for this birthday and he said it was the best surprise but staying in Yasmine B&B made it all that more special. Albina is absolutely lovely and could not have done any more for us. We arrived earlier which was not a problem at all and we were shown to our room in fact we got to pick which room we wanted which was a nice touch. The rooms were all heated and just as well becuase it was freezing outside. Albina provided us with a quick map and guidance on what we should do and where we should go to make the most of our time as we were only staying for one night - wished i had booked for longer now. The breakfast in the morning is amazing and the best part is waking up to the fresh baked smell of criossants.", "title": "Stay here - you'll love it", "user": "1rover", "date": "December 30, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 52160747}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled with family", "text": "I can not recommend this B&B highly enough but can guarantee if you stay here you wont be disappointed!", "title": "Wonderful place to stay - but the owner is the best part - such a lovely person!", "helpfulness": 1, "user": "kiwi-overseas2009", "date": "December 28, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 52022077}, {"rating": 5.0, "title": "Yes, yes, yes, yes..........", "text": "Enjoy your stay!", "helpfulness": 1, "user": "emiller444", "date": "December 20, 2009", "id": 51574453}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "Reviews by guests of Yasmine's B&B are almost always positive. This is a review by guests who did not get to stay there. Scheduled for a mid-April four night stay, our flight from the U.S. to Brussels was cancelled due to the volcanic ash cloud. We contacted Yasmine's B&B by email only 3 days before our scheduled stay. The next day, the refund of our deposit was returned to our account.", "title": "Wonderfully reliable - impacted by volcanic ash", "helpfulness": 3, "user": "DaveHMaryland", "date": "April 17, 2010", "detail_rating": {"service": 5.0}, "id": 61742900}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "The quality of a business is not only how they treat you when you arrive, but also how well they react when conditions impact your arrival. Yasmine's reacted wonderfully. They will be our choice when we are able to reschedule our trip.", "title": "Fantastic", "helpfulness": 1, "user": "Takebashi", "date": "April 12, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 61062130}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled with family", "text": "We stayed at Yasmine's for 2 nights in early April 2010. Everything was great, and I would highly recommend staying here. The house was beautiful, and it even has an elevator to get you (and your stuff) up to guest rooms on the 3rd and 4th floors. The location is ideal - 5min walk into the heart of Bruges, and it has great restaurants even closer. We had breakfast included with our package, and the owner was nice enough to prepare it early the day we checked out. She was very helpful in helping us figure out where to go and how to get there. Very pleasant stay.", "title": "Exceeded all expectations", "helpfulness": 1, "user": "mdladen", "date": "April 5, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 60424049}, {"rating": 4.0, "stay_parameters": "Stayed April 2010, traveled with family", "text": "What a great place! We were greeted at the door by what has to be Bruge's friendliest B&B proprietor, Albina. She went out of her way to make us feel comfortable and welcome and was quite knowledgeable about the city. The following morning we had an early train and Albina packed us a complete breakfast to go...", "title": "Great stay!", "helpfulness": 1, "user": "AMYYAmsterdam", "date": "April 4, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 60347725}, {"rating": 4.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "i would highly recommend this B&B and if I am ever in this lovely city again will make sure that I once again return as a guest of B&B Yasmine.", "title": "Loved it and loved Albina", "helpfulness": 1, "user": "jeverett1955", "date": "March 28, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 59710762}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled with friends", "text": "What a joy to stay in Brugge in this beautiful home. My husband and I travelled with another couple and Abina allocated two beautiful rooms on the same floor. One of our group had a ankle problem and it was great to find a lift which serves all floors. Our hostessess are just fantastic and immediately had maps and great sightseeing tips for us. The breakfast was fabulous , I awoke to the smell of freshly baked croissants. Do try the local spread speculoos - my kids now love it..", "title": "Luxury stay at value price", "helpfulness": 1, "user": "leprachauntravel", "date": "March 19, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 59003556}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "we visited brugges on feb. 12-13 & stayed at the B&B gallery-yasmine. it was our best experience in belgium. the owner is a warm, welcoming person. she speaks great english. we parked our car in her private garage for free. the location is very central to old town: we did everything on foot. our room was spacious, sparkling clean, great beddings. breakfast was a star: albin baked every morning breads & croissants with so much more food to satisfy every one's taste. we got instructions for sight seeing with a good map of town. albin suggested & booked us great, reasonably priced restaurants. it's the first time i write a review, even though i use this site a lot for our extensive traveling all over the world. i wanted to thank albin for making the visit memorable.", "title": "the best experience", "user": "derekNewYork", "date": "February 21, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 56715461}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled with friends", "text": "My friend and I have just enjoyed a a weekend in Brugge made very special by Albina who was a terrific host. Brugge is a beautiful city best enjoyed staying at a local B&B. B&B Yasmine is in a great location and Albina helps give the city a personal touch and bring the city to life.", "title": "A Gem - the city and the B&B", "helpfulness": 1, "user": "EldridgeFam", "date": "February 20, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 56602049}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "We stayed here for two nights over the Valentine's weekend and were as charmed as everyone else who has reviewed B&B Yasmine - from our first dealings with Albina she was faultlessly efficient, kind and helpful. She runs a lovely establishment with lots of little wonderfully feminine touches. The rooms are large and well-furnished with comfortable beds and tea and coffee-making facilities - something often overlooked, but so welcoming after a day sightseeing in the February sleet!", "title": "Beautiful stay in Bruges", "helpfulness": 1, "user": "Litro_K", "date": "February 20, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 56587827}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "Breakfast was our favourite part - this was when you got to see Albina at her most impressive, moving from table to table chatting to guests in three or four different languages. It's clearly what she was born to do and we felt very at ease in that large dining room, watching the cat, the other guests , enjoying our home-made scrambled eggs, and allowing ourselves to be bewitched by Albina and her daughter Yasmine's hospitality. Highly recommended for anyone visiting Bruges - the location is also excellent, with some great bars and restaurants on Langestraat within a 2 minute hop.", "title": "the very best", "helpfulness": 1, "user": "riddlerSidcup_kent", "date": "January 18, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 53737228}, {"rating": 5.0, "title": "Even Better than The Reviews!", "text": "Bed and breakfasts by their nature provide standards that usually exceed those of even the best of hotels in terms of friendliness and attentiveness. Having stayed now in many Yasmine's and Albina the propeitor set a standard that is even beyond the very best of b and b's in the world.", "helpfulness": 1, "user": "DCSacramento", "date": "May 15, 2010", "id": 64202821}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "We arrived in Bruges after an 18 hour trip from San Francisco. After I made a phonecall to her residence Albina met us at the train station in Bruges and had been scurrying the busy station to find us. I must admit i was too cheap for a cab! Once in the b and b, which also serves as an art studio for her daughter she proceeded to fill us in about the sights we should see and the history of Bruges. It was done in such a warm and friendly manner and the tips were all first rate. The room we had which is the \"pink loft,\" is absolutely immaculate and a treat. A high series of stairs lead to a big bed with a skylight to the stars. Every thing in the room is super clean and well furnished. She also provided internet access to us through her own personal computer. The breakfasts which start at 9 am are first rate. A wide selection of meats, fruits, breads, and even eggs on different days. She cooks it herself and nowhere did we an assistant helping her. At 95 euros for two people the place is a steal and as I told her you should raise your rates! When we finished our two day stay she hugged us in a sincere way as if we were family. So if you are looking for a first rate b and b, conveniently located and quiet with an engaging hostess look no further stay here.", "title": "What a pleasant stay", "user": "vap", "date": "May 10, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 63755470}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "We stayed at Yasmine in the middle of our 2 week trip through the Netherlands, Belgium and France. From the moment we walked in until we left the experience was a pleasure! Albina was very accommodating when our trip was rearranged - twice - by the volcano and luckily we were able to stay! The B&B is more like a hotel in that the rooms have in-suite bathrooms and even an elevator! Our room was lovely. Beautifully decorated, clean, large bathroom and soft bed. Albina and her daughter made us feel at home and offered a full and delicious breakfast, suggestions about where to go and what to do and pointed us to a couple of charming bars and restaurants. We will stay again!", "title": "Perfect", "helpfulness": 1, "user": "cassiegee", "date": "April 30, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 62821375}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "My husband and I stayed here for two nights and thought it was fab. The location is perfect with a 5 min walk to the market square. The room was really lovley, clean, quite and beutifully decorated. Breakfast was a mixture of fruit salad, yoghurt, cereal, ham, eggs, cheese, crossiants and the most loveley fresh baked bread. (baked on the premises) Tea/coffee and juice. one of the nicest city breaks we have ever had.", "title": "The most beautiful place to stay in Brugge!!", "helpfulness": 2, "user": "Lauren_A09", "date": "April 19, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 61940286}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "We will be recomending this to our family and freinds.", "title": "A great find", "helpfulness": 1, "user": "Grappelli", "date": "April 18, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 61817711}], "location": {"country": "Belgium", "region": "Flanders", "continent": "Europe"}, "variance": {"poor": 1, "average": 1, "very good": 25, "terrible": 0, "excellent": 334}, "aka": "Bed And Breakfast Yasmine", "slim_ranking": 0.0603015075377, "description": "All guestrooms have their own individual character: there is, for example, the Lavender room: beautiful shades of blue and grey-blue emanate calm and tranquility... You find all comfort you could possibly want: rooms with an en-suite bathroom, television, mini-bar and internet connection. In the mornings a breakfast buffet is served in the dining room adjacent to the gallery. A stay in Bed & Breakfast Yasmine will be a true feast for your senses!"}