{"user_rating": 4.0, "review_count": 570, "name": "Bedford Swan Hotel", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "Ok it's a nice hotel. Has a lot going for it. Looks good when you arrive, delicious cakes in reception, sumptuous feel about it. We upgraded our room and it was a large suite with plenty of space but there is a lot that could be done to create a much improved experience.", "title": "Almost very good but not quite there", "user": "JMuk", "date": "September 18, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 177702391}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled with friends", "text": "Firstly. Bathrooms. Our luxury room had a bathroom from the seventies. Hideous decor. An underpowered and under hot shower. Just didn't have the true feel of luxury.", "title": "Excellent Quality, and Value", "user": "Lismaine", "date": "September 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 177517085}, {"rating": 2.0, "stay_parameters": "Stayed August 2013", "text": "No digital radio channels on the television", "title": "poor", "helpfulness": 3, "user": "KIRSTY0269", "date": "September 16, 2013", "detail_rating": {"cleanliness": 3.0, "location": 4.0}, "id": 177416988}, {"rating": 1.0, "stay_parameters": "Stayed August 2013, traveled on business", "text": "Then..... My biggest bugbear in almost all hotels. COFFEE. Put a cafetiere and decent coffee in the room. If you can put two chocolate bars in my fridge, put a small milk carton in there so I can enjoy decent coffee or tea in the morning. Left handers beware. For some peculiar reason the cups are right handed!!!", "title": "The crumbling edge of quality", "helpfulness": 1, "user": "RJ57", "date": "September 14, 2013", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 177080368}, {"rating": 2.0, "stay_parameters": "Stayed September 2013, traveled with friends", "text": "Nice breakfast buffet. A little chaotic at 9am, but good quality products. Could do with a better bread selection and a little more attention to detail on keeping the buffet area clean and tidy.", "title": "Disappointing", "user": "Uncle_spud", "date": "September 13, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 177046081}, {"rating": 4.0, "title": "Afternoon tea", "text": "I would like to congratulate your chef on the splendid afternoon tea. I found it to be excelent and great value for money and will not hesitate to bring my friends. The only thing to be improved upon were the scones.", "user": "brenda s", "date": "September 10, 2013", "id": 176607960}, {"rating": 2.0, "stay_parameters": "Stayed September 2013", "text": "We booked an afternoon yea for my brothers 21st birthday. 8 of us attended on Saturday 7th September 2013. We were all completely disappointed with the entire experience - which was not a cheap one either!", "title": "Afternoon tea - just don't do it!!", "helpfulness": 4, "user": "pinkpanther944", "date": "September 10, 2013", "detail_rating": {"cleanliness": 3.0, "location": 4.0}, "id": 176604976}, {"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "The sandwiches were plain and boring- plain ham - not even with a slice of tomato, plain egg (with shell added at no extra expense!), salmon (just plain, no cream cheese) all on slightly dry bread.", "title": "Time for Bedford", "user": "Duncan l", "date": "September 9, 2013", "detail_rating": {"value": 3.0, "sleep": 4.0, "location": 5.0, "service": 3.0, "rooms": 4.0}, "id": 176441980}, {"rating": 3.0, "stay_parameters": "Stayed September 2013, traveled with friends", "text": "Scones were also disappointing. Apart from being dry, they tasted of nothing more than bicarbonate of soda which literally makes your tongue fizz. One would also expect a 'traditional afternoon tea' to be served with clotted cream - as the website suggests. Not at the swan hotel. Instead they serve it with what was possibly a lemon pudding or a lemon flavoured cream and the sweetest and possibly cheapest jam known to man.", "title": "Very poor Afternoon Tea...", "user": "RansEm", "date": "September 6, 2013", "detail_rating": {"cleanliness": 5.0, "value": 2.0, "location": 5.0, "service": 4.0}, "id": 176109564}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "The remainder of the afternoon tea was substandard with the cakes clearly bought in, all dry and cut into the tiniest squares.", "title": "Anniversary treat", "user": "MelissaHay", "date": "September 5, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 175872895}, {"rating": 5.0, "title": "Brilliant hotel", "text": "Stayed for 3 days to go to Bletchley Park, really lovely hotel. Attentive staff especially in the dining room. Sense of humour and careful attention to detail. Food was really good and it was wonderful to have perfectly cooked vegetables served in dishes and nice and hot.the breakfast was really good and if you asked for a fried egg it was cooked fresh especially for you The room was tastefully decorated with lovely wallpaper and the most comfortable bed ( I even looked at the name on the mattress).it was great to relax in the pool, although not big it was fun to have a slide and of course the whirlpool. Will definitely be going again and would recommend it to anyone.", "user": "Heather R", "date": "September 2, 2013", "id": 175317467}, {"rating": 5.0, "stay_parameters": "Stayed September 2013", "text": "We had a meal in The River Room last night. The atmosphere was lovely, everywhere was spotless. The food was 1st class and the waiting and bar staff were very very pleasant. We didn't book a room so I can't review them.", "title": "Restaurant - food and service", "user": "mummam4", "date": "September 2, 2013", "detail_rating": {"cleanliness": 5.0, "location": 5.0}, "id": 175291474}, {"rating": 5.0, "title": "A Truely Wonderful Champagne Afternoon Tea", "text": "The location was wonderful, full of character & charm and relaxed, perfect for our champagne afternoon tea. We had a great experience, the staff were polite, attentive, caring and genuinely wanted to make the time special. The champagne was lovely, the food was very tasty and the presentation was beautiful. Would thoroughly recommend", "user": "Merlin A", "date": "September 1, 2013", "id": 175046839}, {"rating": 5.0, "stay_parameters": "Stayed August 2013", "text": "The title says it all really. Exceptional food and very well presented- we loved the profiteroles shaped like a swan - thought this was very clever. Atmosphere was great. Would recommend it to anyone. Thanks", "title": "An excellent afternoon tea experience- thoroughly recommended!", "user": "buffybabe", "date": "August 30, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 174860802}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "I booked Bedford Swan after seeing other good reviews on Trip Advisor and I was not disappointed. I went with my boyfriend for a weekend away (we did an Archery Experience just a little way out of the town centre, definitely recommend it) a few weeks ago and our stay they was just what we needed. There was a wedding reception going on on the first night we stayed with a lot of the guests staying at the hotel too. The Hotel was considerate enough to have us far away from where the reception and guests were staying but we still had a lovely view of the river.", "title": "Lovely weekend away", "user": "Soraya B", "date": "August 30, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 174800741}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "Spent one night in one of the suites at this lovely, friendly hotel.", "title": "Lovely, friendly Hotel", "user": "123Lola", "date": "August 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 174359965}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "There was one small problem with the room when we arrived but reported this to reception and a very helpful lady from housekeeping arrived in less than 5 minutes and sorted the problem quickly. The rest of the stay was wonderful. We ate in the River Room Restaurant, the food was delicious with generous portions and fair prices. Bed was very comfortable, and air con was easy to use so that the room could be kept at a nice temperature.", "title": "A STAY TO REMEMBER", "user": "Lorna J", "date": "August 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 174276142}, {"rating": 5.0, "stay_parameters": "Stayed August 2013", "text": "Overall, very happy and would definitely stay there again.", "title": "Beautiful place", "user": "Jeremy196", "date": "August 21, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 173294461}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "We stayed at the Swan for our daughter's wedding and had a wonderful couple of days, Without exception the staff were welcoming, courteous and helpful. The room was clean and comfortable and the little luxury extras were much appreciated. The wedding reception was fabulous and venue was perfect and the bonus of being able to enjoy the river terrace on a beautiful warm evening and watch the swans swim by on the river was magical.", "title": "Nice Weekend Away - Last Minute Booking", "user": "Cazzyb666", "date": "August 19, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 172957578}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "Everything is going well but the sight of history is awesome, this place is a work of art no doubt. Me and the Wife are loving it. We have a few days to go we don't want to leave :( we would like to thank all the staff at the swan.", "title": "Cracking wedding reception!", "user": "Sarahlovely1", "date": "August 18, 2013", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 3.0, "service": 4.0}, "id": 172851766}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "stars": 4, "variance": {"poor": 59, "average": 78, "very good": 168, "terrible": 34, "excellent": 231}, "slim_ranking": 0.533333333333, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.5}, "description": "The Bedford Swan Hotel is situated in a stunning town centre location overlooking the river and just 30 minutes from central London. Steeped in character and history yet fully refurbished to meet the needs of both our corporate and leisure guest The Swan provides outstanding hospitality expected from a 4 star Hotel. REST Enjoy a perfect night’s sleep in one of our stunning bedrooms with thick soft duvets, contemporary fabrics, throws and cushions, signature wall papers and stylish furniture. Air conditioning is in all rooms as standard along with flat screen 32 inch LCD TV with in - room entertainment offering a wide range of up to date movies and high speed internet access. EAT We offer a fantastic range of dining options including the fabulous AA rosette awarded River Room Restaurant and relaxing lounges. 24 hour room service is available daily and in the summer enjoy al fresco dining or drinks on our terrace overlooking the river. All our food is freshly prepared by our highly skilled team of Chefs. MEET: The Hotel is the ideal destination for conferences and meetings. Tailor made to suit the individual requirements of all our customers. CELEBRATE: With its superb location and stunning setting, the Hotel is a popular choice for weddings and functions. ENJOY: Our stunning roman bath inspired swimming pool and Jacuzzi provide the perfect way to unwind after a long, busy day. Our fully trained therapists also offer a wide choice of treatments including Swedish massages, holistic facials and luxury manicures."}