{"user_rating": 4.0, "review_count": 221, "name": "Bedford Hotel", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "We have just returned from a great holiday in New York. Stayed at Bedford Hotel. Great location. Really quiet at night . Room large compared to other hotels we have stayed at in New york. Bed very comfortable. Loved the walk-in wardrobe and really appreciated the lovely closet that contained a fridge and 2 hob cooker with kettle. Hob little slow to boil kettle so put on before you have shower. Bedroom really nice. T.V. is enclosed in lovely cabinet that matches headboard. Bathroom really clean and looks like it has been refurbished very recently. Weather hot while we were there but our room AC was excellent. Really nice Deli nearby . We will go back to the Bedford again. Grand Central Station two minutes away. Access to most of city from there at very reasonable rate. Daily ticket available for 7 dollars and covers subway and buses all over city. Port Authority just few blocks away. Staff very helpful. Would highly recommend this hotel.", "title": "Loved this hotel", "helpfulness": 1, "user": "chrisGalwayIreland", "date": "August 11, 2008", "detail_rating": {"cleanliness": 3.0, "front_desk": 3.0, "location": 5.0, "service": 3.0, "rooms": 5.0}, "id": 18860145, "likes": {"liked": "— privacy and quietness of room", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "Stayed at the Bedford 27 to 30 Jul, 08. Fantastic little hotel in the heart of all the action in NYC. Euro style yes, but only as far as the lobby goes, but the one bed suites are simply huge. Plenty of space for a family of four, very comfy king size bed in separate room, two also quite comfy double size sofa beds in living room, and plenty of space to move around within room. Not so European then, as the tendency on the other side of the pond is for very small rooms. A good size fridge in room (not usual minibar size) for storing your own cold drinks (and beers!) and a small kitchenette area with stove, microwave, sink, coffee maker etc.", "title": "Great Stay At The Bedford", "helpfulness": 1, "user": "SteveEdmunds", "date": "August 4, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 18624726, "likes": {"liked": "— location", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled with friends", "text": "Trouser press, iron, ironing board all in good working order. An AC that cools well, a must in NYC in the summer months! All in all, don't see the need to pay more (I paid 370USD per night inc taxes for this room, (its the third best in their 4 tier pricing of rooms) as after having checked out many many options, I couldnt find a bigger room with all these ameneties for under 600USD per night.", "title": "a little gem in the heart of the city!", "helpfulness": 1, "user": "ailzSligo", "date": "July 30, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 18424388}, {"rating": 4.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "Oh, and the icing on the cake must be the view of the Empire State Building, this if you are on or above the 12th Floor. Seemed to me the smaller rooms are from floor 2 to 10 or 11, the one bed suites from like 12 to 17 and the 'tower' suites above that. So, the higher you go, the more you pay!! Check out their website and you will get my gist.", "title": "Great Stay in the Big Apple", "helpfulness": 1, "user": "barney5California", "date": "July 5, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 17563030, "likes": {"liked": "— Great value for accomodations"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "A great stay, a clean hotel and very friendly staff, and I would not waste my time surfing the web for other options if we go back to this wonderful city someday.", "title": "Old, but cosy and comfortable", "helpfulness": 1, "user": "traveloldie", "date": "July 5, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 17545446, "likes": {"liked": "— location", "disliked": "— the view and the the very cramped toiletarea"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2008, traveled as a couple", "text": "Having stayed in a large number of hotels in Paris from the simplest to the most expensive over more than fifty years, this is definitely one of the better ones, especially as it comes at a reasonable price (though breakfast was not included). Excellent location for opera, shopping, sightseeing. We were on the 7th floor and room was large for French standard with very nice bathroom and separate toilet. Staff very friendly and most helpful. If you want to get there by taxi, tell the driver to drop you on the North side of Place Madeleine and you walk the last one hundred metres - this saves you quite a bit of money as the hotel is in a small and quiet side street.", "title": "Excellent price/quality rapport", "helpfulness": 2, "user": "blacklab", "date": "December 12, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 22666282, "likes": {"liked": "— Location", "disliked": "— only one washbasin in a double room"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2008", "text": "Just returned from a three night stay in the hotel Bedford from 11/11/08 to 14/11/08. Booked flights from Cardiff with Flybe and accommodation through Thomson city breaks which was significantly cheaper than booking with the hotel direct. Arranged transfers from Paris Cdg with Inter shuttle who were very efficient with prompt timekeeping.", "title": "Peaceful hotel in central Paris", "helpfulness": 5, "user": "Welshtraveller111", "date": "November 17, 2008", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 4.0}, "id": 21939053}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "On arrival we had a pleasant surprise when we were allocated a room on the seventh floor with a small balcony and a view of the Eiffel Tower which you could see in the distance. The room was a satisfactory size for a city hotel with lots of windows and a high ceiling. Bathroom was very small but was clean and adequate. Room had a complimentary safety deposit box but the position was a bit awkward as it was located at the back of a tall cupboard. Room was quiet with no traffic noise. The cleanliness of the room and hotel in general was excellent.", "title": "Loved the Bedford", "helpfulness": 4, "user": "NorthernRiversNSW", "date": "October 4, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 20613235, "likes": {"liked": "— Two balconies with great views over Paris was a tourist's dream!", "disliked": "— Nothing. We had no complaints at all."}}, {"rating": 2.0, "stay_parameters": "Stayed September 2008, traveled on business", "text": "Staff were always friendly, helpful and very efficient. Reception area was spacious with a comfortable seating area. However, felt that certain areas of the hotel such as the corridors and lift could benefit from refurbishment. Breakfast was served in the Victorian restaurant which was the best part of the hotel, very grand and upmarket in a typical 1900s décor. Good selection of cereal, cold meats, cheeses, ham, fruit etc and lovely fresh bread.", "title": "Hotel Bedford was OK but not great", "helpfulness": 2, "user": "traveller_1Australia", "date": "September 28, 2008", "detail_rating": {"front_desk": 1.0, "service": 2.0, "cleanliness": 3.0, "value": 2.0, "rooms": 4.0, "location": 4.0}, "id": 20449282}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "Hotel is located in the Madeleine / Opera quarter which is within walking distance to the main attractions such as the Louvre and Arc De Triomphe providing you have no mobility issues. Hotel is extremely close to some beautiful patisserie shops for fresh baguettes and cakes. Had a lovely lunchtime meal in Castel Lane restaurant (Castle Lane road) which is under a two minute walk from the hotel. Excellent selection of shops in the vicinity of the hotel which includes the popular and expensive ‘Hediard’ store (21 pl de la Madeleine) featuring mouth watering chocolates, fruits, exotic spices and oils.", "title": "Great hotel!", "helpfulness": 4, "user": "normilion", "date": "September 17, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 20153150, "likes": {"liked": "— The nice room!", "disliked": "— Nothing in particular"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "Just returned from 4 nights at the Bedford Hotel, Paris. Quiet central location with shops, bars, bistros and restaurants all close by. Clean, spacious rooms and bathrooms. Friendly, helpful staff. Great choice at breakfast and wonderful food in the restaurant. Would definitely recommend", "title": "Fantastic", "helpfulness": 2, "user": "AD-Derbyshire", "date": "July 7, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 17610390, "likes": {"liked": "— everything", "disliked": "— nothing"}}, {"rating": 3.0, "stay_parameters": "Stayed October 2007, traveled with family", "text": "I stayed at the Bedford some years ago on business and recalled it was smart but comfortable. The reception area and public rooms reinforce that view. But the rooms are fairly basic - we paid for an \"apartment - 4 person\" but had two adjoining smallish bedrooms (one with singles which dropped down out of the walls) with a couple of bathrooms off one of them. Not an ideal layout, with no space to just sit. And long overdue for a refurbishment - plenty of chipped melamine.", "title": "OK, but never again", "helpfulness": 2, "user": "Regular_traveller065", "date": "October 25, 2007", "detail_rating": {"front_desk": 2.0, "business": 2.0, "service": 2.0, "cleanliness": 2.0, "value": 2.0, "location": 4.0, "rooms": 2.0}, "id": 10327232}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "Great location, but rooms don't match the price and I would not stay again.", "title": "Belle Bedford", "helpfulness": 1, "user": "Camarche", "date": "September 29, 2007", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 10018474, "likes": {"liked": "— Location & comfort levels", "disliked": "— Nothing!"}}, {"rating": 5.0, "title": "Beautiful hotel", "text": "We decided to stay at the Bedford having stayed at their sister hotel \" de l'arcade\" twice . It turned out to be an excellent decision , everything was great - rooms-housekeeping-breakfast-bar.", "user": "helenps", "date": "September 4, 2007", "id": 8618957}, {"rating": 4.0, "stay_parameters": "Stayed March 2007, traveled on business", "text": "The location is perfect , everything we wanted was very close . The Madeline is a great area , safe and central.", "title": "Cosy hotel in a great location", "helpfulness": 3, "user": "Poots-UK", "date": "March 6, 2007", "detail_rating": {"front_desk": 2.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 4.0}, "id": 6920919, "likes": {"liked": "— Location"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "The Bedford is a lovely, charming hotel in the heart of Manhattan. Our room was spacious and having our own kitchenette was a lovely addition. The staff were incredibly friendly and courteous and organized our transport to JFK at the end of our stay.", "title": "Charming hotel", "helpfulness": 1, "user": "Juniper_ie", "date": "July 3, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 17494662}, {"rating": 4.0, "title": "Splendid Little Hotel", "text": "I'd recommend this hotel to anyone who's looking for a nice, friendly hotel close to all the sights. I'd certainly stay here again on my next trip to The Big Apple!", "helpfulness": 1, "user": "Peter_SWashington_UK", "date": "June 17, 2008", "id": 17003335}, {"rating": 4.0, "stay_parameters": "Stayed May 2008", "text": "We have just spent four wonderful days in NYC. staying at the \"Budget\" Hotel Bedford.", "title": "ideal location", "helpfulness": 1, "user": "hangus_8", "date": "June 12, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 16872613, "likes": {"liked": "— location", "disliked": "— nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled with friends", "text": "What a little gem this proved to be. We booked a \"Standard\" room through Trailfinders as it was our first visit to the USA.", "title": "Second stay at the Bedford", "helpfulness": 2, "user": "hotelgirl", "date": "June 5, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 16690347, "likes": {"liked": "— Gives you the flexibility to eat out or self cater", "disliked": "— Only news channels available on the T.V were American , couldn't even check the FOOTSIE !"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled with family", "text": "The room was more than adequate, spacious, clean, well appointed with a mini kitchen and a huge bed, room safe included and air conditioning that actually worked.", "title": "Great location & friendly staff", "helpfulness": 1, "user": "steveruthp", "date": "May 12, 2008", "detail_rating": {"cleanliness": 3.0, "front_desk": 4.0, "location": 4.0, "value": 3.0, "rooms": 3.0}, "id": 15945214, "likes": {"liked": "— location", "disliked": "— The room felt dated"}}, {"rating": 4.0, "title": "Great Location, Service and Rooms Ok", "text": "Stayed in hotel earlier this month.", "user": "dizzybabe45", "date": "October 31, 2008", "id": 21430876}, {"rating": 4.0, "title": "Good location", "text": "Good points- Rooms reasonable size, kitchenette includinig fridge,central location near grand central, walking distance from times square, rockefellar, empire state, central park (if ok walking 30 minutes) but off the main roads so quite.", "user": "Palamino2", "date": "October 26, 2008", "id": 21234154}, {"rating": 5.0, "title": "Great stay!", "text": "Bad points: no hotel bar, a bit dated, no electric kettle in room, rooms got hot in the morning, staff on reception helpful but bellboys not...wouldnt help us hail a taxi, didnt help with bags or directions. a bit noisy when a large school party stayed for the night.", "user": "bama08", "date": "October 13, 2008", "id": 20846765}, {"rating": 1.0, "title": "Awful Hotel - Ruined our night in NYC. Totally Unprofessional.", "text": "Stayed here in May this year for a week. Got a taxi from the airport but not a yellow one unfortunately - agreed a price but had to pay a toll on the way.", "user": "ticex", "date": "October 11, 2008", "id": 20800298}, {"rating": 4.0, "title": "I love this hotel!", "text": "The hotel was near Grand central - which was really handy.", "user": "MIKEYDREAD", "date": "October 7, 2008", "id": 20701042}, {"rating": 5.0, "title": "Honeymoon Hotel!", "text": "This hotel was absolutely lovely! My husband and I stayed here on our honeymoon in 2001, recommended by his parents who honeymooned here over 40 years ago as well! Good location. Nice rooms. Friendly staff!", "helpfulness": 11, "user": "A TripAdvisor user", "date": "August 24, 2004", "id": 2491524}, {"rating": 5.0, "title": "Fabulous memories", "text": "I stayed at the Bedford for 4 days during July. (during Bastille Day) It was my first trip abroad in 2001. My best friend and I had been throughout Italy and France. I have to say that this was one of the most charming, comfortable, spacious and clean hotels that we stayed in. We had a small balcony that overlooked the Eiffel Tower with a good sized bathroom that even had a view and balcony. My memories are so lovely that my husband and I are hoping to stay there this summer. I'd highly recommend this hotel.", "helpfulness": 17, "user": "A TripAdvisor user", "date": "June 16, 2004", "id": 2199044}, {"rating": 4.0, "title": "Perfectly located, great service", "text": "I stayed at the Hotel Bedford while on an 8-day tour of Paris with Rives Travel Excursions, April 16th to April 23rd, 2004. I stayed in a one-guest room on the 5th floor. The room was pleasant and servicieble, with the usual mini bar and other amenities. French doors open onto a pseudo-balcony. The bed was quite comfortable (fairly firm) with plenty of pillows. I loved the oversize towels in the bathroom, and the tub had a feature I found very convenient: There is a central knob to set your desired temperature. The left and right-hand knobs then determine if you want a tub bath or shower. That way, you set the temperature once and it stays the same throughout your stay. Some might find the temperature fluctuations (as other rooms use water) during their shower to be more extreme than we are used to in the United States. I found that to be true, but only during peak usage hours and easily fixed by stepping out of the water stream as necessary.", "helpfulness": 20, "user": "A TripAdvisor user", "date": "April 25, 2004", "id": 1835594}, {"rating": 4.0, "title": "Nice comfortable place at a good price", "text": "The hotel restaurant's decor is absolutely stunning, a must-see, with a stained-glass central dome that is riviting.", "helpfulness": 10, "user": "A TripAdvisor user", "date": "July 10, 2003", "id": 1133878}, {"rating": 4.0, "stay_parameters": "Stayed September 2008, traveled with family", "text": "Spacious rooms with a reasonable kitchenette. Fantastic location in downtown manhattan which was worth the $300 that we paid for. Walking distance to Times square from where all city tours are easily accessible. Staff were ok, not very friendly especially the doorman who seemed inclined to help only if we whipped our purses out first!! But we did enjoy our stay and would recommned this hotel for its great location and spacious rooms.", "title": "Good Hotel, great location", "helpfulness": 1, "user": "DhanyaRenny", "date": "October 5, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 20646120, "likes": {"liked": "— Location and rooms", "disliked": "— doorman"}}, {"rating": 3.0, "stay_parameters": "Stayed September 2008, traveled with family", "text": "The hotel location was good, just two blocks from Grand Central Station. We had a beautiful, huge room that had a mini fridge, microwave, table and four chairs! Amazing for NYC! But, the problem was the bed - it was the most uncomfortable bed I have ever slept on. It was like sleeping on a squeaky box spring.", "title": "Good location", "helpfulness": 1, "user": "jrks", "date": "September 25, 2008", "detail_rating": {"cleanliness": 4.0, "front_desk": 4.0, "location": 4.0, "rooms": 5.0}, "id": 20382968, "likes": {"liked": "— Location", "disliked": "— Beds"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "We booked this hotel based on some research, trip advisor reviews and the rates. We actually tried to find another hotel because some of the trip advisor reviews had us worried, especially since it was my wife's first trip to New York, I wanted her to have the best experience possible. I'm glad we couldn't find another hotel!", "title": "Offers what major hotels can't", "helpfulness": 1, "user": "fromsoca23", "date": "September 20, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 20235188}, {"rating": 3.0, "stay_parameters": "Stayed August 2008, traveled on business", "text": "As soon as we stepped in the lobby we were impressed with the atmosphere, it is an older hotel lobby, but clean and well kept.", "title": "3 nights in august", "helpfulness": 1, "user": "EST_DK", "date": "September 3, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 19692123, "likes": {"liked": "— Location"}}, {"rating": 1.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "We booked a regular queen room but were upgraded to a suite on the 15th floor. The room was beautiful. Very clean, remodeled, still had that older 60's feel to it at the same time. I believe the 15th floor is the only one that has a little balcony you can step out on and look around. The balcony is not big, just big enough to sit down for a cup of coffee, but a great view of the Empire State builiding, and look around the corner and there was the Chrysler building too!", "title": "Terrible Hotel", "helpfulness": 1, "user": "carinarod", "date": "August 26, 2008", "detail_rating": {"front_desk": 2.0, "business": 1.0, "service": 2.0, "cleanliness": 1.0, "value": 1.0, "location": 5.0, "rooms": 1.0}, "id": 19396302}], "location": {"country": "France", "region": "Ile-de-France", "continent": "Europe", "city": "Paris"}, "stars": 4, "variance": {"poor": 9, "average": 38, "very good": 101, "terrible": 10, "excellent": 63}, "aka": "Bedford Hotel Paris", "slim_ranking": 0.282208588957}