{"user_rating": 4.0, "review_count": 692, "name": "Beijing International Hotel", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed May 2006, traveled on business", "text": "In true luxury fashion, the lobby and mall areas are exquisite, but the actual rooms are a step above Super 8 (USA) standards. It is clear that this hotel was one of the first luxury hotels in Beijing, and the location is incredible. As you walk through the lobby you may run into government officials from any continent or travellers from any region. The lounge/bar area is pretty neat with indoor patio style configuration with trees and fountains.", "title": "OK-not as nice as other luxury hotels", "helpfulness": 13, "user": "tjschmidty", "date": "May 12, 2006", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 2.0, "service": 2.0}, "id": 5056939}, {"rating": 5.0, "title": "Surprised by the great standard", "text": "The negatives: Unless you are willing to get the super-suite, they will put you in a sub-par room. Hope you packed an iron....to get you suits \"pressed\" is a pretty good fee as they mysterously have no irons in the rooms. There is no door hangar to keep housekeeping out (also mysteriously missing) so your guarenteed to have someone in your room everyday (something to consider if you are on official business). Beds are ancient but useable (I've seen worse). I guess one needs to remember that you are in China and not set your lodging expectations too high. On my most recent business trip I stayed in much better new-western hotels, but had limited tradeoffs in location and price....Welcome to China!", "helpfulness": 31, "user": "A TripAdvisor user", "date": "January 20, 2006", "id": 4365326}, {"rating": 4.0, "stay_parameters": "Stayed November 2005", "text": "Overall it is grand for show, but for actual lodging it is well below the Marriot/Sheratons of the world. I guess the location offsets the financial burden of staying in a average room.", "title": "Hotel & Location are ok", "helpfulness": 17, "user": "mmyk72", "date": "November 14, 2005", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "service": 4.0}, "id": 4110576}, {"rating": 4.0, "title": "Very nice hotel", "text": "We have just returned to Australia from 7 nights spent at the Beijing International. As it was part of an organised tour and completely pre-paid, we had no idea what to expect. Having stayed in other Asian cities we thought it would be convenient and clean at best, cramped and with limited facilities at worst. We were very pleasantly surprised - Yes, it was convenient and clean, but it was also spacious and had great facilities. The service was efficient and polite, language only a minor barrier, most staff speaking quite good English. Bedding was comfortable, bathrooms clean and adequate with all the shampoo,etc you might need. Hairdryer also. Bottled water was supplied daily as the tap water is undrinkable. Also supplied was tea, coffee and whitener, as well as a kettle so that you can have that all important cuppa at the start and end of the day! The restaurants were good, coffee overpriced as it is all over BeiJing. Breakfast buffet includes all anyone could ever desire, no matter what part of the world you're from. We would definitely reccommend this hotel and will definitely stay again.", "helpfulness": 11, "user": "A TripAdvisor user", "date": "September 30, 2005", "id": 3976290}, {"rating": 4.0, "stay_parameters": "Stayed May 2005", "text": "Stayed at this hotel as part of tour package. It's rated 5 star, but it isn't as nice as a true 5 star in Western countries. I probably wouldn't stay here if I had to pay for the room (cheapest I found was US $130 for Nov).", "title": "Nice hotel", "helpfulness": 20, "user": "AFSOONRMOM", "date": "June 9, 2005", "detail_rating": {"cleanliness": 4.0, "rooms": 4.0, "service": 4.0}, "id": 3541119}, {"rating": 4.0, "stay_parameters": "Stayed February 2006, traveled on business", "text": "As part of a student group we had many expactations toward the hotel. First of all it's enormous! In a way it was like we where the only ones there..! But at breakfast we discovered that we weren't alone=) The buffét was great; a lot of different food, the traditional egg&bacon, but also japanese and a lot of sweet cakes, muffins and so on. On the other hand, to eat dinner at the hotel restaurant is an expensive experience, small portions and not especially good either.", "title": "Student-trip", "helpfulness": 1, "user": "lassh", "date": "February 26, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 3.0, "rooms": 3.0, "location": 4.0}, "id": 6841576}, {"rating": 1.0, "stay_parameters": "Stayed January 2007", "text": "We had learned about the hotels spa/pool facilities, but as we had dressed up in the robes that were provided in our rooms and took the elevator down, it was closed. Though they kept saying it would open, it never did..", "title": "Mold problem", "helpfulness": 4, "user": "Turner_traveler", "date": "January 21, 2007", "detail_rating": {"front_desk": 1.0, "business": 2.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "location": 2.0, "rooms": 1.0}, "id": 6630025, "likes": {"liked": "— Leaving them.", "disliked": "— Mold and hookers"}}, {"rating": 1.0, "stay_parameters": "Stayed November 2006, traveled on business", "text": "As for the rooms, they were clean and with comfy beds and a lot of different complimentary toiletries. And my favorite, a tower of clean towels!", "title": "Overcharge $++++", "helpfulness": 5, "user": "hotelsareus", "date": "December 18, 2006", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 4.0, "value": 1.0, "location": 2.0, "rooms": 4.0}, "id": 6457061}, {"rating": 5.0, "stay_parameters": "Stayed November 2006", "text": "Overall a nice hotel, but it's noticable that it must have been one of the first luxury hotels in Bejing.., but still, tasty breakfast, a feeling of freedom, free newspaper (in chinese) on each floor(the newspaper has one english page!), no noise, goldfish in the lobby and a currency trader (for free) in the hotel lobby.", "title": "Highly Recommend", "helpfulness": 6, "user": "JNevin", "date": "November 12, 2006", "detail_rating": {"front_desk": 4.0, "service": 4.0, "business": 4.0, "cleanliness": 5.0, "rooms": 4.0, "location": 4.0}, "id": 6109384}, {"rating": 4.0, "title": "Nice hotel", "text": "Stayed here as part of tour group. The shower (although \"renovated\") had a very serious mold (or dead aminal) issue and smelled so bad we had to open window and leave open the entire time. I think they just placed \"marble\" like material over already existing fixture. The water pressure was very low and the towels were very tiny and old. They smelled like mold too, but maybe that was just because they were in bathroom.", "helpfulness": 10, "user": "A TripAdvisor user", "date": "May 27, 2006", "id": 5227937}, {"rating": 4.0, "stay_parameters": "Stayed March 2005", "text": "Just returned from a four night stay at the Beijing International Hotel. It was the hotel our tour company booked and it was evident that a lot of tour companies use this hotel. It is the kind of hotel I probably wouldn't of stayed at if it wasn't booked through the tour company, mostly due to price than anything else (a moderate room books at $220 US per night). The staff are friendly, the rooms are immaculate and the breakfast that was included with our room was very good, with a mixture of Chinese and Western cuisine. They have a business centre (20 RMB for 10 minutes on the internet), fitness centre, and spa (massage was wonderful). The hotel shops on the second floor were very expensive but the supermarket on the lobby level for pop, snacks, etc. was reasonable. Within walking distance to Forbidden City and a 16 RMB cab ride to the Pearl Market. A great place to stay if you have the $ and like a more upscale hotel. Only complaint would be that the front desk staff have limited English, which made check-in and check-out somewhat frustrating.", "title": "Very nice, upscale hotel", "helpfulness": 29, "user": "loru100", "date": "March 18, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 4.0}, "id": 3284359}], "location": {"country": "China", "continent": "Asia"}, "stars": 4, "variance": {"poor": 26, "average": 131, "very good": 354, "terrible": 15, "excellent": 166}, "slim_ranking": 0.0317103109656}