{"user_rating": 4.5, "review_count": 201, "name": "Bel Soggiorno Hotel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "Wearrived in rain with sheet and forked lightening on september 14th having stopped off at naples the warm the room was welcoming (no 28) clean and with plenty of room the rain putting a dampener on the beginning of the holiday......but oh that veiw on the following morning when we opened the shutters to see etna in sunshine with a whisp of smoke we also over looked garni naxos.", "title": "ETNA WITH SUN RAIN AND SNOW", "helpfulness": 1, "user": "ozman13", "date": "October 7, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 20702803, "likes": {"liked": "— situation", "disliked": "— bar facilitys"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "company good and the staff very helpful breakfast on the terrace plenty of choice and all good quality", "title": "A charming, individual Hotel", "helpfulness": 4, "user": "steveandsally", "date": "September 28, 2008", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 3.0, "location": 5.0, "rooms": 4.0}, "id": 20445486, "likes": {"liked": "— The old-world atmosphere and the fantastic views.", "disliked": "— No bar and some less than welcoming staff."}}, {"rating": 4.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "evenings spent on terrace around round table with new freinds and then one spot of red on etna that spread over the next 2o minutes to a lava flow mid sunday we awoke to snow on etna first of the year", "title": "lovely hotel", "user": "suz-scotand", "date": "September 15, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 20096462, "likes": {"liked": "— nice room and very laid back and friendly staff", "disliked": "— no pool"}}, {"rating": 3.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "Bar faciltiys some what lacking altough having gone to reception to get assistance always promptly delivered to where you wanted the drinks", "title": "Only ok but could be amazing!", "helpfulness": 1, "user": "THH-2", "date": "August 28, 2008", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 2.0, "location": 3.0, "rooms": 3.0}, "id": 19467366}, {"rating": 5.0, "title": "My Sicilian Paradise", "text": "Both bus service and train (to messina ) both easy and clean and good value", "helpfulness": 2, "user": "Taorminatart", "date": "July 16, 2008", "id": 17936913}, {"rating": 4.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "We stayed three nights at the Bel Soggiorno, we chose this hotel as previous guests said it was a 10 minute uphill walk to the town, essential we feel if you want to take advantage of all that lovely pasta and pizza, and indeed I think you need to be fairly fit to get the best out of coastal towns like Taormina, Positano etc. Our room (No.9) was large and had it's own balcony with a good unrestricted view of the bay and Etna. The hotel was clean and the staff friendly, there was a new guy just started, and I did have to ask someone more senior before I got an iron on one occassion, and some ice on another (that was my only complaint regarding our room - there was no mini fridge). The breakfast was great, you don't feel rushed to finish, and indeed with such a fantastic view from the breakfast terrace it's tempting to linger a fair while.", "title": "Relaxed hotel with great views", "helpfulness": 1, "user": "jainBGodalmingUK", "date": "June 3, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 31498204}, {"rating": 4.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "We stayed in Bel Soggiorno in Taormina during the first 3 days of our holiday trip around Sicily. The hotel is on a hill on the way to the city centre. It is just a 10 minutes walk via some stairs up the road. No problem for us. The room was very nice and clean, with a small balcony and a wonderfull seaview. The shower was the only thing that could have been better. Breakfast is very good and we good have it outside on the terrace, delicious cappucino and very friendly staff! Taormin itself is a wonderfull place, great food and wines, not that expensive compared to the prices in the Netherlands. A bottle of wine for 15 euros, Sicily has got some great wines, try the Altavilla della corte. Enjoy!", "title": "Very nice hotel, love to come back!", "user": "VivianTimmers", "date": "June 3, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 3.0}, "id": 31480477}, {"rating": 4.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "we have just returned after a week at the hotel Bel Soggiorno. The hotel is located high on the mountain between the beach below and taorimina town above. we found this hotel to be very well run, clean and with very freindly staff. our only minor dislike was the breakfast did not differ at all for the whole week.due to its location to get to the beach would mean walking down a zig zag hill without footpaths which takes around 30 mins.or a cable car from the town. walking up hill to the town takes around 15 mins where there are plenty of places to eat although very expensive. there is a bus station in the town. on walking around here be aware of the mad italian drivers .", "title": "lovely Hotel with great views", "helpfulness": 2, "user": "holidaysfourtwo", "date": "May 17, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 30165183}, {"rating": 4.0, "stay_parameters": "Stayed January 2009, traveled as a couple", "text": "This is a hotel in the grand old style of early 20th Century resorts. Our room had french doors that opened onto a semi-private area with lounge chairs overlooking the sea. Set on the edge of the hills that lead from the ocean up to the town of Taormina, practically every room of the hotel overlooks the sea, including the breakfast solarium. We stayed here for two nights, including New Year's Eve. We ended up being very happy that we were just a short walk outside of town, rather than in one of the many hotels in the center of town, which I imagine must be fairly loud. The staff at Bel Soggiorno were very friendly and helpful in making recommendations for driving to areas outside of Taormina proper (including up to Etna).", "title": "Marlene Dietrich could have been lounging on the terrace", "helpfulness": 1, "user": "slsnyc", "date": "January 19, 2009", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 23708670, "likes": {"liked": "— The views", "disliked": "— Lots of stairs down to our room"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled with family", "text": "The Hotel Bel Soggiorno provided one of the highlights of our four weeks in Sicily: a friendly, welcoming, English speaking reception, a gorgeous buffet breakfast, fantastic views and a lovely location. Bel Soggiorno is on the approach road to Taormina (from the beaches below) and situated just behind a bus stop. We had a car and parked either in the driveway or just above. I have a walking handicap (and am \"older\") and although the steepish drive was a bit tricky, it was well worth the effort to stay in this \"grand old hotel\". Our room was a triple: our adult daughter had her own loft above our room with bed, sofa and writing desk-very spacious. Our accomodations included writing desk, wardrobe, nighttables and lamps, TV, air conditioning, and a well done, immaculate bathroom. Outside our french doors a terrace with table and chairs/sun bed and umbrella for our leisure use--all this overlooking the magnificent sea below! Nearby the huge dining room/bar and salon provided quiet corners where we could use the internet, write post cards, or just enjoy a drink and curl up with a book. The breakfast buffet was laid out along one wall (I vote this Sicily's best breakfast!) but all the guests found their way to the conservatory or the terrace to enjoy their meal.", "title": "Old Style Grand Hotel: a REAL FIND! Dog Friendly", "helpfulness": 3, "user": "maisonrosegoult", "date": "October 24, 2008", "detail_rating": {"front_desk": 4.0, "service": 5.0, "business": 4.0, "cleanliness": 5.0, "rooms": 5.0, "location": 5.0}, "id": 21183820, "likes": {"liked": "— The feeling of being pampered by the staff, the views!", "disliked": "— The steps."}}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "The highlight of our holiday to sicily was the views from our bedroom window. A full view of etna and the sea - beautiful both day and night. Ask for room No.1 when you book - 2 balconies (the other one faces the sea too). I think all the rooms must have some view of the sea but single number rooms are on the top floor and the view is best from there.", "title": "best view ever", "helpfulness": 1, "user": "a visitor from ireland", "date": "October 5, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 45866334}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled solo", "text": "Breakfast was great, plentiful and good choices. The staff were friendly and helpful. Parking at the hotel was typically Italian - but staff will park your car for you if you need help (we saw a few people asking them). Room and bathroom were clean and typically furnished by Italian standards.", "title": "Best Terrace in Town", "helpfulness": 1, "user": "Esme_Travels", "date": "September 15, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 41873185}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "It's about a 10-15 walk to the centre of town but quiet pleasant (uphill but not difficult). Internet access, onsite collection of books and magazines in lots of languages and good bar options at the hotel all added to the experience. Would certainly recommend.", "title": "Wow what a view", "helpfulness": 1, "user": "DonCarleone", "date": "September 2, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 39583788}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "Great Location: easy to find when driving (which is important to me as I'm uncomfortable driving a stick-shift in Italy) yet an easy walk to the center of town.", "title": "Couldn't have asked for a better hotel for our wedding", "user": "Nisi1912", "date": "July 24, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 35710456}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "Responsive Management: the management offered to help me with parking and were flexible with my reservation. They responded to my requests.", "title": "Beautiful view, quiet hotel", "helpfulness": 1, "user": "lovetomatopasta", "date": "June 25, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 33120710}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled with family", "text": "We experienced a magical stay at Hotel Bel Soggirono. The ambience was one of serenity & beauty, the views were breathtaking & the hospitality was warm & welcoming. Breakfast was delicious & generous and taken on divine terraces overlooking Naxos. You will spend much time on your balcony simply gazing at the beauty before you. The crowds in Taormina were extraordinary but Bel Soggiorno offered an oasis of calm.", "title": "Bellissimo", "helpfulness": 1, "user": "Peter_Joan", "date": "November 27, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 50176969}, {"rating": 5.0, "title": "Excellent for honeymoon", "text": "We had some of the best pasta we’ve ever eaten at al Giardiano & the staff were wonderful - it's opposite the gardens on the walk into the town.", "helpfulness": 1, "user": "anchorpoint2002", "date": "November 25, 2009", "id": 50020869}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled solo", "text": "It might not be the most lavish of hotels in the area, and doesn't offer any swimmingpool, but it's one of the most charming hotels I've ever stayed at. The service was really kind, warm, smiling and helpful. The real secret of this hotel though is the VIEW - it's got a spectacular view over the Mediterranean right from your room. There's also plenty of patio-space so you can have breakfast or dinner while enjoying that view. If you are as lucky as we were (corner room), you also get a view right at Edna. Nothing like waking up in the morning with your newlywed and looking straight at this magnificent volcano. At night you can even see small streams of lave coming out of it - not from the top - but from the sides and it glows beautifully in the dark. I would really recommend this hotels for honeymoons.", "title": "my absolute favorite", "helpfulness": 1, "user": "italaphileboston", "date": "November 11, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 48966167}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "I know Taormina very well having stayed there a dozen times over the past decade and Bel Soggiorno is always my choice. While it is a short walk uphill to points of interest, the lush gardens, panoramic view, and quiet old world atmosphere are a welcome respite after a busy day near the Corso or at the beach. There is simply nothing like it in Taormina in this price range. All rooms open out to a view of the sea and gardens and many have private patios perfect for a later afternoon glass of win. There is a spacious and comfortable parlor and solarium with wireless. Breakfast is generous with cheeses and salami and can be taken in the morning sunlight or on your porch. Lemon and orange trees grace the slope below. Carlo Capuana and his staff are dedicated to maintaining the horticultural and architectural beauty of this gem and provide a relaxing and most welcoming environment.", "title": "Good value, great views", "helpfulness": 1, "user": "Fiona133", "date": "October 15, 2009", "detail_rating": {"cleanliness": 1.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 3.0}, "id": 46909526}, {"rating": 5.0, "stay_parameters": "Stayed July 2009", "text": "I really nice hotel with stunning views. Our room was interesting and quaint with a nice little terrace. This hotel was great value for Taormina which is a pretty expensive place to stay.", "title": "A beautiful location for a wedding", "helpfulness": 1, "user": "scagover", "date": "October 8, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 46328681}], "location": {"country": "Italy", "continent": "Europe"}, "stars": 3, "variance": {"poor": 5, "average": 20, "very good": 92, "terrible": 1, "excellent": 83}, "aka": "Bel Soggiorno Taormina", "slim_ranking": 0.348837209302}