{"user_rating": 3.0, "review_count": 68, "name": "Belconnen Premier Inn", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed October 2010, traveled with family", "text": "We stayed here on a Thursday and Friday night on route to Victoria and wished we hadn't. I was travelling with my 8yo son and on both nights we found the other guests noisy to the point of being rowdy late at night. Another reviewer has written that this is a 'home away from home' for public servants travelling for work - frankly, most of them are young and they treat the place as if they own it. On Thursday we arrived at around 10.30pm exhausted after a long drive to find people talking loudly in the corridors. On Friday, although the Inn is advertised as having a restaurant, a note was slipped under all doors advising that due to a private function the restaurant would be closed that evening. Luckily, having read that the restaurant wasn't the best anyway and that there are few places nearby to eat, we had already booked to eat at the Alto on Black Mountain. We returned and tried to sleep at around 10pm only to find that guests from the function were continuing to party loudly in the corridors. Reception closes at 11pm, so I went out and spoke to guests myself. Then from the room above ours a series of sharp, loud bangs resounded at 11.30pm and after about twenty of these I went up in my pyjamas to enquire. On my way up another guest told me these noises had been emanating from Room 247 for the past several nights. The man in Room 247 said he'd been putting something together and was now finished, thankyou - and closed the door on me.... Unbelievable. On the off chance you don't have to deal with noisy office workers in the corridors, there's the fact that breakfast is uninpsiring - $14.50 for a cooked breakfast and $19.50 for 'full breakfast' including continental, but muesli isn't offered and coffee isn't included - it must be paid for separately at $3 a cup. The beds are fairly hard, the doona was unclad and uncomfortably rustly, the bedside tables were cheap plastic office furniture. The room was small. The absolute best thing I can say about the place is that the shower was good and the staff were uniformly charming and pleasant - but it doesn't make up for the shortfalls. Do yourself a favour if you're a member fo the travelling public and leave this place to its regular clientele.", "title": "If you wouldn't stay at a pub then don't stay here...", "helpfulness": 1, "user": "Thomidog", "date": "October 7, 2010", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 2.0, "sleep": 1.0, "rooms": 2.0, "location": 3.0}, "id": 82401336}, {"rating": 1.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "When we arrived, having booked a resonably nice room for a fairly high price, we discovered that the bed that looks like a king size is actually two single beds pushed up together. When we complained about this we were asked if we wanted them separated to two separate beds!! Eventually, after being told by an apathetic receptionist that they would \"try\" and fix the situation (with strong undertones that they might not be able to) we were put into an inferior room.", "title": "Absolute let-down", "helpfulness": 4, "user": "kazleberry", "date": "September 26, 2010", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 1.0, "sleep": 1.0, "rooms": 3.0, "location": 3.0}, "id": 81130731}, {"rating": 3.0, "stay_parameters": "Stayed June 2010, traveled on business", "text": "We decided to head down to dinner at the restaurant with over an hour to spare before our movie started to have a nice leisurely meal as it was not at all busy. I was served my coke with, not a long straw, but two short straws stuck together. Little details like this really let you know the calibre of the place you're staying. After waiting nearly an hour for our food and being told that because there was a big table being served before us (of 8 people) we should have expected to wait that long. I accept that this is a reasonable waiting period for a high end restaurant, but not at an over-priced isolated hotel eatery. We refused to pay for the meal (except for the coke and \"garlic bread\" - which I am convinced was just stale bread lathered in vegetable oil) and the two very unproffessional wait staff arranged for it to be charged to our room despite our complaints. The food we DID eat was dismal, the service was similar to what you'd expect at a sizzlers and there was very little choice in the meals available.", "title": "It's OK for business...but I wouldn't stay there for pleasure", "helpfulness": 3, "user": "flexitime23", "date": "June 11, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 2.0, "sleep": 5.0, "rooms": 3.0, "location": 2.0}, "id": 67228538}, {"rating": 3.0, "stay_parameters": "Stayed March 2010, traveled with friends", "text": "We arrived the day before the Wedding Open Day and walked past the display room a few times while walking to and from our room. I was shocked to recieve a few glares from the staff setting up! I apologise that my presnce was such an inconvenience. While the place did look very nice and the facilities were fine, the service of most of the staff (I say most because on the Open Day the staff were quite friendly and helpful, doubtful that it was a coincidence) I will most definantly NOT be holding my wedding there. We didnt even bother to enquire about it and left as soon as we checked out.", "title": "Belconnen... TG for the GPS", "helpfulness": 2, "user": "Aussiguys", "date": "April 13, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 61164264}, {"rating": 3.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "I wonder how many times you can say \"I dont feel that your experience was an adequate representation\". My experience seems to be similar to most other reviews on this website, so you have most definantly lost my wedding day, and I will not be returning.", "title": "It was all too much trouble for the staff", "helpfulness": 1, "user": "FussyNSW", "date": "September 23, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 3.0, "service": 2.0, "rooms": 4.0}, "id": 43854398}, {"rating": 4.0, "stay_parameters": "Stayed March 2007, traveled on business", "text": "I chose this hotel for its location near the AIS and Uni where I was training and because the receptionist was really nice on the phone.", "title": "Great Value during Peak Season", "helpfulness": 1, "user": "MoleyNarrendera", "date": "July 25, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 8231018, "likes": {"liked": "— Free internet in bar & location", "disliked": "— No underground parking"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "Check in was quick and painless and the room was comfortable and reasonably modern with the usual inclusions.", "title": "Excellent Hotel, but pricey!", "helpfulness": 3, "user": "galaga_girl", "date": "September 5, 2006", "detail_rating": {"cleanliness": 5.0, "front_desk": 5.0, "location": 3.0, "value": 4.0, "rooms": 4.0}, "id": 5772192}, {"rating": 1.0, "stay_parameters": "Stayed July 2009, traveled on business", "text": "I stayed at the Belconnen Premiere Motor Inn for two nights in July on business. My business divided between Civic and Belconnen and for a change rather than stay in the City I chose Belconnen. As other reviwers have commented, it is very quiet indeed after 6:00pm but I am used to staying in Civic which is quite noisy so this was not a problem - plus it is right next to a massive liquor barn that has excellent value Australian wines.", "title": "Abysmal Service", "helpfulness": 2, "user": "Mountainview547", "date": "July 31, 2009", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 3.0, "service": 1.0, "rooms": 2.0}, "id": 36283291}, {"rating": 2.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "First the good news: I was travelling on a corporate rate and was pleasantly surprised to be upgraded to a 1 bed apartment. Reception had actually called me earlier to confirm my booking so as you can imagine, I was well disposed already before I arrived. It is quite a striking design of building and it now offers free broadband in all the rooms - although you need your own patch cable - and this was just a symptom of the whole place.", "title": "Avoid, avoid", "helpfulness": 2, "user": "oztravellers1", "date": "July 1, 2009", "detail_rating": {"cleanliness": 1.0, "value": 2.0, "location": 4.0, "service": 1.0, "rooms": 2.0}, "id": 33693885}, {"rating": 3.0, "stay_parameters": "Stayed March 2009, traveled on business", "text": "Firstly there is only a service lift to get to the upper levels which has to be operated in a rather interesting way.", "title": "Choose somewhere else if you can!", "user": "olig", "date": "May 25, 2009", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 2.0, "service": 2.0, "rooms": 2.0}, "id": 30687525}, {"rating": 3.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "My room was cavernous and contained little useful furniture except for a massive LCD TV. The bedroom was cramped and entirely taken up with two single beds stuck together - very spongy as has been commented here before.", "title": "Room update required", "user": "Ozzieflyer", "date": "July 20, 2008", "detail_rating": {"front_desk": 3.0, "service": 1.0, "cleanliness": 2.0, "value": 2.0, "rooms": 1.0, "location": 3.0}, "id": 18083125, "likes": {"liked": "— Proximity to intended destination", "disliked": "— Dated room facilities,"}}, {"rating": 3.0, "stay_parameters": "Stayed August 2007, traveled on business", "text": "There is only one tiny reverse cycle AC in the bedroom so you cannot heat the lounge which in July is essential as it gets down to 0C. The bathroom was clean and refurbished with nice toiletries and the whole room had been painted recently.", "title": "The Price Is Right", "helpfulness": 1, "user": "brenc3", "date": "August 24, 2007", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 3.0, "cleanliness": 3.0, "value": 4.0, "location": 3.0, "rooms": 3.0}, "id": 8500158, "likes": {"liked": "— Close to Belconnen", "disliked": "— Wifi did not work in most guest rooms"}}], "location": {"country": "Australia", "region": "Australian Capital Territory", "continent": "South Pacific"}, "stars": 4, "variance": {"poor": 13, "average": 23, "very good": 27, "terrible": 3, "excellent": 2}, "aka": "Belconnen Premier Hotel Belconnen", "slim_ranking": 0.5, "description": "The Belconnen Premier Inn looks forward to welcoming you. Offering a variety of accommodation with the comfort of home intertwined with the services you would expect of a 4 star hotel, the apartments, suites & rooms are modern, stylish & well appointed. Featuring a suburb dining experience in Benjamin's Brasserie for both breakfast and dinner, you are sure to be spoilt for choice. 100% non smoking, Complimentary Car Parking, Free Wireless Broadband access in all Public & Function Areas, Accommodation Packages available, Quiet location 8 minutes from the city centre, 6 complimentary Foxtel channels, Belconnen Premier Inn – Aiming to exceed all your expectations."}