{"user_rating": 4.0, "review_count": 927, "name": "Belisaire", "reviews": [{"rating": 3.0, "title": "Lovely hotel NOT lovely food", "text": "We have just came back from a week here. The hotel is beautiful, the staff very friendly -the entertainment staff being exceptional. The room waslarge, we had two huge double beds aswell as chairs and a small table and it was spotless! Now the negatives, we were all inclusive so if we asked for a beer at the bar it was served in a very small, what can only be described as a champagne flute! All other alcoholic drinks were served in small wine glasses, however, if you were half board and paid for drinks then your beer was served in a pint glass and spirit measures were triple, and VERY cheap. The restaurant is very nice but the food is definitely not a 4* standard - I have had better food in 3* hotels we've stayed in, not alot of choice and very repetitive. If you are looking for a break with nice surroundings and a bit of a laugh, then fine but just go half board! Oh one more thing - if you like the use of a gym thisi snt the place as ALL equipment is broken!!!!", "user": "sunlovinbabeEngland", "date": "May 8, 2010", "id": 63560251}, {"rating": 5.0, "title": "Can't wait to go back!! EXCELLENT", "text": "Brilliant hotel, friendly staff, great for everyone.", "user": "-Em-York-", "date": "April 25, 2010", "id": 62422958}, {"rating": 4.0, "title": "THE REVIEW YOU'LL WANT TO READ!", "text": "My partner and i have just got back from Belisaire, i absolutely loved it and can't wait to go back. there was never a dull moment, the entertainers keep you busy all day and night. All the staff are great, really friendly and made us feel welcome. The hotel its self is beautiful and was alot better than i expected, however the main pool was smaller than i thought as the picture is misleading. the food was great, a lot of choice everyday and all delicious. Other than the let down at the size of the pool although it is still very large i dont have a complaint about the hotel, i cant wait to go back!", "user": "DEVONsunlover1", "date": "April 9, 2010", "id": 60855285}, {"rating": 4.0, "title": "Excellent value. Great holiday.", "text": "Stayed here for 10 days just before the \"summer season\" started. It was great, weather was awesome, great food, great room, great pool, great location, everything was great.", "user": "NottinghamHamble", "date": "April 6, 2010", "id": 60542819}, {"rating": 1.0, "title": "wysiwyg", "text": "Tunisia I think is an up and coming destination for Brits even though many people have been going for years. I can see why people go to Tunisia. Tunisians welcome you warmly because in this region Tourism is their livelihood. For this reason alone I felt extremely safe and wouldn't believe that security would ever be an issue at all. You do get a little annoyed however being in the markets and EVERYONE wanting to sell you something. I think this has to be the worst bit about the whole holiday. It does really annoy you after a while! It is actually hard work to shop! As soon as you say you're English they have \"a question\" I didn't want to know the question! \"No questions!\" It makes me laugh thinking about it now. Found a few sellers claiming to be the waiter from the hotel and happen to have an uncle or a brother with a shop. Believe this and you deserve to be conned! There is a commission sellers make if you go and buy carpet! Tunisian carpets are great and only selling for 2 days! This is the 2nd day. Don't be fooled by this either!", "user": "earlook", "date": "March 30, 2010", "id": 59911051}, {"rating": 4.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "We stayed at the Iberostar Belisaire last week on an all inclusive basis. It was our wedding anniversary, the hotel were aware of this and upgraded our room, we had fruit and flowers and a special anniversary cake which was a nice touch. The room and hotel were spotlessly clean, the staff always had a smile and nothing was too much trouble, the maid service was first class.", "title": "Nice hotel, resort still out of season.", "helpfulness": 1, "user": "ShropshireTilly", "date": "March 22, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 59232982}, {"rating": 3.0, "stay_parameters": "Stayed February 2010, traveled with family", "text": "On the down side the all inclusive menu did become a bit boring after a day ot two and we were glad we'd booked at the two theme nights available at sister hotels. It's wise to book early as places are very limited.", "title": "would go back again was lovely", "helpfulness": 1, "user": "smtoto100", "date": "March 10, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 3.0}, "id": 58224816}, {"rating": 4.0, "stay_parameters": "Stayed May 2009, traveled with family", "text": "The hotel was quiet, entertainment was available and on two occasions there was a disco which seemed to be rather loud and was quite intrusive if you were in your room and not wishing to join in. I think this may be a significant problem in high season if disco music is not your thing.", "title": "Solid hotel, great for beach location", "helpfulness": 1, "user": "zumbi", "date": "February 24, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 57013553}, {"rating": 2.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "The resort of Yasmine Hammamet is mainly hotels set back from the prom and in their own landscaped gardens, security seems quite tight and there are gatemen on every hotel entrance.", "title": "Not for young couples.", "helpfulness": 1, "user": "k87K87", "date": "February 2, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 1.0, "sleep": 2.0, "rooms": 3.0, "location": 1.0}, "id": 55019174}, {"rating": 4.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "I found the resort to be lacking in atmosphere, although to be fair it was very early in the season. as the week progressed there seemed to be more activity getting the beach cafes and bars ready for the season. We were not unduly hassled to buy, most of the wares available seemed to be cheap touristy tat and so were not tempted at all, but a quiet no thanks was all that was needed.", "title": "Good hotel but not without faults", "user": "LeafinUK", "date": "January 9, 2010", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 2.0, "service": 4.0, "rooms": 4.0}, "id": 53050792}, {"rating": 4.0, "title": "You get what you pay for!!", "text": "I paid £371 for my holiday this included flight & Half board accomodation. The hotel was very clean. The resturant had a good choice which varied every evening, The entertainment during the day was fun, but at night ruined by the ridiclous dance shows! With the over weight sweating entertainment boss hogging the limelight!!! I go on holiday to experience the culture of the country, Not to watch they'er interpretation of irish dance or Grease! Service at the Hotel was good, Down sides of the Holiday was being harrassed to buy everywhere i went, locals on the beach trying to scam you out of money. The airport at monastir is a nightmare, no queuing system or order at passport control, take plenty of tissues as you are expected to pay up to two dinars for a few pieces of loo roll in public toilets. I would reccommed single girls wear a band on their wedding finger and if asked are you married just say yes.", "user": "cheekybisom", "date": "June 17, 2010", "id": 67774068}, {"rating": 5.0, "title": "The best holiday I have ever been on", "text": "This is the best holiday I've been on so far and I cannot wait to go back. I went with 3 friends in our mid 20s and it was wonderful. Everyone in the hotel was great. The waiters and bar staff were so pleasant, funny and the animators were amazing! Ahmed, Marvin, Safoune, Abdul and Gi Gi are legend. They really made our holiday and the amount of effort the hotel made to make guests feel comfortable and the entertainment they provided was fantastic. Every night there was a show be it cabaret or a competition. The resort is 5 minutes from the beach and a nice stroll to the medina. Everything is so cheap and the people are lovely. It does help to be thick skinned as the sale methods and men can be a bit trying at time but I found them so funny and friendly. A fantastic holiday I would recommend to anyone, couples, friends of families. I cannot wait to get back to the Belisaire!", "user": "kit_kat_nut", "date": "June 15, 2010", "id": 67611527}, {"rating": 4.0, "title": "lovely holiday - total bargain!!", "text": "Stayed at the belisaire for one week in may.", "user": "douai86", "date": "June 12, 2010", "id": 67245703}, {"rating": 5.0, "title": "great holiday", "text": "It was amazing for what we paid!", "user": "cahan", "date": "June 7, 2010", "id": 66776345}, {"rating": 5.0, "title": "fantastic hotel", "text": "Service was top notch, nothing too much trouble.", "user": "evycumnock", "date": "May 30, 2010", "id": 65841670}, {"rating": 5.0, "title": "lovely hotel and staff, great holiday.", "text": "We stayed here for a week in may, myself, husband and one year old sun. We booked as a late deal so didn't know what to expect, having stayed at iberostar hotels in the past we hoped this would be similar.", "user": "UKTravellercleveland", "date": "July 21, 2010", "id": 71761627}, {"rating": 4.0, "title": "Good value hotel", "text": "The hotel itself was clean and comfortable, the pool areas were also clean. The food and drink was nice, we were all inclusive, the dine around at the other hotels was also really nice.", "user": "swissSwitzerland", "date": "July 18, 2010", "id": 71349182}, {"rating": 3.0, "title": "No good for disabled guests", "text": "the best part of the hotel for us was the staff, they were really helpful and friendly and could no tdo enough for you, they were wonderful with our son, who enjoyed the kids club disco and baby pool. The only downside was that as it was still classed as winter the evening entertainment was inside the bar instead of at the outdoor area and the bar allowed smoking, which I mainly didnt like for my son. Other than that we loved this hotel and would return.", "user": "marklandRedditch", "date": "July 16, 2010", "id": 71129219}, {"rating": 3.0, "title": "Not a 4* but Good value for Money", "text": "Having visited Tunisia many years ago it was with some trepidation that the family decided to opt for this destination for a family holiday in Jasmin Hammamet, first week of July. Our party of five, made up of two sisters, a teenager and two elderly parents, both with walking difficulties booked the vacation through Thomas Cook for one week staying at this hotel on a half board basis. After an uneventful and hassle free departure through the airport we proceeded to our awaiting coach, promptly leaving for the one hour and twenty minute drive to the resort. On arrival at the hotel we were greeted by a fairly nondescript lobby but a much more pleasant receptionist! We were kindly asked to be seated while we waited for our rooms to be ready and were soon accompanied by a free cocktail. Within twenty minutes we were pleasantly surprised by our rather large bedroom and even bigger bathroom! The bedroom was of a very good size, free fridge, sat TV, nice view and a safe (21 Dn) and two reasonably sized beds. The hotel offers two nice freshwater pools surrounded by nice bushes and flowers. The only downside is the fight for the sun beds, early morning rush for the best of the bunch as is usually the case in most hotels. The hotel offers half board or all inclusive and we all agreed the half board option is by far the optimal choice. Food and drinks were not so plentiful for the all inclusive guests; however, we were all basing our decision on the Caribbean! Choose half board, stroll one hundred metres to the nearest supermarket, fill up your fridge and enjoy the saving. Food at the hotel is of a particularly high standard, all factors considered of course. The breakfast was appreciated by my son as the pancakes were top quality. Fresh bread, eggs, fruit and a hot milky coffee were all we needed to embark on the day ahead. The evening meal was fine; however, by the end of the week we felt it got a little repetitive. The entertainment team were really friendly guys who did a good job with their renditions of different things; we did not seem to have the privilege of any professional groups etc. though. The ice white, fine sandy beach is accessed through the garden, across a road and a quick 200 metre stroll away. The hotel has its own section of the beach which is patrolled by the hotel staff and the occasional policeman on horseback. All in all we felt quite safe on the beach, even two ladies alone. Alcohol is on offer at the hotel but if you want to purchase your own, the only place to buy it is in a supermarket opposite the marina called Bravo. Outside the hotel you can catch the little train, it runs frequently and only costs 2.50 Dn or alternatively all other forms of transport are cheap to the marina or medina. In summary I would say Tunisia is definitely trying to expel its negative image of yesteryear, but you do still get moderately hassled to buy inside the medina. Of the hotel I would say if you are looking for an easy going hotel in a fairly quiet location with reasonable food and accommodation, then this is a good value for money choice.", "user": "hannahst25", "date": "July 12, 2010", "id": 70587915}, {"rating": 5.0, "title": "One of the best", "text": "Although Thomas Cook recommended this hotel because it had a walk in shower which suited us as my husband is in a wheelchair we took their word for it and booked to go first week November to celebrate my husbands birthday. Yes ok the room was good although the view from any of these four rooms was a border of high trees, dark and dismal. The larger pool we could'nt use as the longers are very close together and in rows no room to transfer my husband onto a sun longer. The pathways around the hotel were all small cobbled stone its a wonder my husband did'nt get whiplash !!!!! The smaller pool was fine but was difficult getting to, because of the wheelchair on thse stoney pathways. So dont go if you are less mobile or in a wheelchair. We could'nt even use the beach and outside the hotel was very high kerb stones i could get my husband down the kerb but could'nt lift him and the chair on the other side of the road.", "user": "mwhelan100", "date": "June 29, 2010", "id": 69122332}], "location": {}, "stars": 4, "variance": {"poor": 48, "average": 142, "very good": 303, "terrible": 36, "excellent": 398}, "aka": "Iberostar Belisaire Hotel", "slim_ranking": 0.102362204724, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "description": "The hotel lies directly Hammamet – Yasmine (Tunisia) and just 200 m from the beautiful sandy beach. Family–friendly complex. Lively entertainment program. Just 5 km from two golf courses. Thalasso – therapy centre with different treatments."}