{"user_rating": 3.0, "review_count": 177, "name": "Belknap Hot Springs Lodge and Gardens", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "The hot water in the pool and the location make this place worth going to. It is marvellous to relax in the pool after a day exploring.", "title": "Wonderful, hot spring pool.", "user": "Joanne2andPeter4", "date": "October 2, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 141871323}, {"rating": 3.0, "stay_parameters": "Stayed August 2012, traveled with friends", "text": "The rest of it is perfectly adequate and it is affordable. Sitting out by the pool in the sun is relaxing and the air is very clean. It will take all your cares away. Also, it is quite near to Clear Lake which is a lovely place and plenty of world class scenery to see.", "title": "Little touches could make this an exceptional place.", "helpfulness": 3, "user": "JosephFord", "date": "September 27, 2012", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 141383279}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "We have stayed here several times. On this particular visit we stayed in the lodge but we have stayed in 2 of the cabins, 4 of the lodge rooms, 1 rv site and tent sites over the many many years. My observations are...I think the staff has become jaded by previous guests who did not behave themselves and it has effected staff service for eveyone. There are some real safety issues that need to be addressed and taken seriously and not just passed off as someone who wants a free room. There are also very small changes they could make that would make a world of difference. Finish painting the patched drywall in rooms before you rent them, fix the draperies that hang there, clean the windows, address all of the dangerous slip hazzards by the pool, put local art in the rooms or have themed rooms, put hooks up on the back of the bathroom doors and other locations around the room so you don't have to hang damp towels on the lamps, chairs or the bed and try and find a better way to offer internet. On the bright side, the grounds are absolutely beautiful, the entrance and lobby are very inviting and of course the hot spring pool is the reason we go although it really needs some attention. Bottom line, you are paying for the grounds and the pool but don't set your expectations much higher.", "title": "Fun again", "user": "cruckwardt", "date": "September 26, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 141318371}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled with friends", "text": "My wife and I again had a great time at the Belknap Hot Spring. We have been coming to enjoy the very clean mineral pool and watch the water flow down the McKenzie for many years. The Pool , Lodge Rooms and some RV Sites are right next to the River. It is so close to our home ( about 80 miles one way) and we are very lucky that this spot is a place to go and relax. We have told may people about this place that is getting better each year.They have two very nice mineral pools. Our room have always been clean and we have been made to feel at home. It is fun to meet so many happy people in the pool. This last time we meet a couple that travels a long way twice a year to visit Belknap and told us it was the best place to go for a Spring and Fall trip in Oregon.We look forward to our next visit.", "title": "Beautiful Place", "user": "Bclouse", "date": "September 8, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "location": 5.0, "service": 3.0}, "id": 139770890}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with friends", "text": "The grounds were beautiful.We stayed at a camping site right next to the river.We were pleased with that.They had a microwave we could use in the lodge.", "title": "A great place to camp and RV", "user": "dzrad", "date": "September 7, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "location": 5.0, "service": 5.0}, "id": 139686470}, {"rating": 1.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "Think twice before making a reservation at Belknap! During our stay, we endured no air conditioning in 100 degree weather, one small fan for a two story room, tv’s in the room that don’t get reception (which still seems strange with satellite tv downstairs), but then dvd’s were an additional cost to rent, the shower door never closed, the hair dryer was broken, and the Assistant Manager Sandy was extremely rude. Even though we had shared that we were there for a special celebration, the only thing we were even told at check-in was to make sure that our pool towel were turned in upon checking out. Nothing was even shared about a continental breakfast that we later found out about ourselves but in the end was nothing special.", "title": "Think Twice", "helpfulness": 13, "user": "khindsm", "date": "August 6, 2012", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 1.0, "sleep": 1.0, "rooms": 2.0, "location": 4.0}, "id": 136349827}, {"rating": 3.0, "title": "I like Belknap...", "text": "We are very sad to deliver this type of a review. We stayed in the RV Park which is part of the Resort about 10 years ago. And the resort that we stayed in then and the one we just stayed at do not compare. The staff and the experience then was a memorable experience and this stay was an experience we never want to remember.", "helpfulness": 3, "user": "draePDX", "date": "August 3, 2012", "id": 136171984}, {"rating": 1.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "I have stayed here many times. I have always enjoyed my stay. The first night I was checking in at the time the pool was just about to close. I was disappointed, but the check in person told me to go ahead as I would sleep well. Breakfast each day was fine and I define fine as having protein (there were boiled eggs). When items ran low, the clerk had a slow approach. I never could get WiFi and the clerk at that time had no clue about what to do nor did she make an attempt to find some one who could help. I have always stayed at the lodge and it has always been acceptably clean and sparingly furnished. I was glad to have a fan. There are many movies to rent. The pool is clean and relaxing. I will return again.", "title": "Owners really need to listen!!!!!!!", "helpfulness": 19, "user": "Tracie G", "date": "July 29, 2012", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 3.0}, "id": 135743301}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled with friends", "text": "After 30 plus years of going to Belknap this trip has left me with complete disappointment in what use to be one of my favorite places to visit. The owners need to do a complete overhaul of thier managment/front dest clerks. It's sad that such a georgeous setting can have such ugly people running their establishment. Owners be aware that your front staff are loosing customer's left and right and are such an embarrisment to your resort.", "title": "Great place to visit chill and rejuvinate", "helpfulness": 1, "user": "Melbarsos", "date": "July 28, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 135637044}, {"rating": 1.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "We like to stay here when Diving in the area (clear lake for one place).", "title": "Road Construction On the Front Porch", "helpfulness": 9, "user": "Brad99999", "date": "July 19, 2012", "detail_rating": {"service": 1.0, "cleanliness": 2.0, "value": 1.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 134869373}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled with friends", "text": "Overall we had a lovely stay at Belknap Springs. Some factors in our favor were the time of year (October) and we really lucked out with beautiful sunny blue sky weather.", "title": "Cabin #6 - It helps to know what to expect", "helpfulness": 3, "user": "jodi_123", "date": "October 29, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 144027924}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled solo", "text": "We were checked in by the lady everyone says is mean. I can see where people got that impression, she is terse, but we did get a smile. Of course we had no children with us and she was really testy when I asked about towels. Knowing that situation, we had picked up some cheap extras - they will not give you anymore than what is in your cabin or room, you can wait until the next day for maid service or throw them in the dryer, once we saw how close we were to the laundry room we realized we would have been fine without the extras. The rest of our stay, the front desk clerks were great, friendly and helpful if you want to log on to their 25 mg WiFi. And the cleaning gal we ran into seemed very nice also.", "title": "My stay was very nice", "helpfulness": 3, "user": "Warren S", "date": "October 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 143776032}, {"rating": 1.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "The cabin itself was comfortable, all items provided in the kitchen are labeled and it is very clear where they all go. We were a little worried that with all the labeling, we would be in trouble when we realized the label said there were 8 coffee cups and we only had 7! Is it like a rental car where you need to do a walkthrough? If there would have been much missing I would have asked for one. Anyway, bowls, pans, dishes, silverware, all are provided. I would have brought a knife and a few of my own pans if I was traveling by car locally, but we made do with the ones they had (pans were pretty worn). And we had a really cool cast iron firepit outside on the driveway. The only problem was trying to grill on it was problematic. We ended up figuring something out, but the grill on the ground outside did not fit. The cabin overall was clean, the linens were fine, we had the downstairs bedroom and it was quiet and dark. The upstairs loft is open to the rest of the cabin, there are two queen beds and a full bath upstairs.", "title": "Very durty. Very low customer service.", "helpfulness": 9, "user": "Loren B", "date": "October 18, 2012", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 2.0, "sleep": 1.0, "rooms": 1.0, "location": 3.0}, "id": 143165665}, {"rating": 3.0, "title": "\"A Belknap Resort\" is NOT the traditional Belknap Hot Springs Lodge--it's two miles away.", "text": "Note there is nothing else in the cabin, no salt/pepper, no foil, paper towels. There are a few dishcloths. Of course, you can purchase these items, for a hefty price, at the little store by the front desk. If you keep in mind that it would cost that much extra in gas to go to the closest place for those items it helps.", "user": "A TripAdvisor user", "date": "October 18, 2012", "id": 143158957}, {"rating": 2.0, "stay_parameters": "Stayed November 2011, traveled with friends", "text": "The secret garden is a must do and we enjoyed hiking around that area and along the McKenzie River. It was quite a surprise to find such a beautiful garden in the woods.", "title": "Been going here for years", "helpfulness": 2, "user": "jen d", "date": "October 18, 2012", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 4.0}, "id": 143101179}, {"rating": 3.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "My husband and I discovered Belknap a couple of years ago and try to make it over a couple of times a year. While the grounds are still beautiful and the pools OK the front desk staff is horrible. We arrived on Labor Day as most people were checking out, planning for a relaxing evening at the end of long holiday weekend. The next morning my husband was reprimanded by the lodge front desk clerk as he was going to breakfast. He tried to walk into the front door instead of the side door and she told him she was just too busy to deal with guests like him...hmmmmmm, seems like without guests she would not be getting a paycheck? Later we were lectured regarding towel usage and I overheard the same front desk clerk berating a cabin guest for trying to trade in a dirty towel. Seems like it can't be a big surprise that white towels might get dirty camping or even staying in the cabins. The front desk clerk refused the towel and charged the poor women $2 for a new one. We really like the place but the owners need to remind their staff they are supposed to be welcoming the guests, not be bothered by them.", "title": "Great Place - Not so Great Staff!", "helpfulness": 3, "user": "sherrie b", "date": "September 5, 2012", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 139521313}, {"rating": 3.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "This is a beautiful spot. The gardens, although a bit worn, are still a site to behold. The pools were fine but the restrooms and showers need some work. The house we rented looked new and was clean but there were many clues that they were finished on a shoe string budget. Like cabinet doors that don't even come close to covering the opening they're meant to cover. We were jarred awake a few time by the smoke detectors. When we tried to get some help with the smoke detectors we were told no one was available. Other encounters with the help left us with no uncertain impression that they couldn't care less about the guests. So I'm torn because it is beautiful and as long as I didn't need anything from the front desk, I was happy.", "title": "As long as you have no complaints...", "helpfulness": 1, "user": "buzzboyd", "date": "September 4, 2012", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 5.0}, "id": 139421803}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "This was our second time to Belknap. We rented one of the walk-in campsite over the river. We had a secluded site within a couple minutes walk to the hot pool. We strolled the lovely trails and gardens. We rode on The McKenzie River Trail is adjacent to the property with great hiking and Mtn biking. The hot pool was nice though they could have been cleaner. Same for the shower and restrooms. The resort seems to function on a shoestring staff. They appear overwhelmed and stressed at times which may make them a bit curt. The grill that operates on their flowery patio overlooking the river served surprisingly good fare. There were several vegetarian options. The setting is very pleasant. Overall, don't expect a fancy \"resort\" - it is what it is: a simple rural retreat with down home, simple services.", "title": "camping is good", "helpfulness": 1, "user": "wino74", "date": "September 2, 2012", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "sleep": 5.0, "location": 5.0, "service": 3.0}, "id": 139201458}, {"rating": 2.0, "title": "Disappointed the last few times", "text": "I have stayed at Belknap either in RV or tenting over many years and find that the resort has gone downhill the last few years. Although they have added and remodeled cabins and increased the number of RV spaces, perhaps decreasing the number of tent spaces, there has been no improvement to the restroom/shower facility in the upper pool area. It seems to me that with all the money that has been spent to increase rent-able space that there should also be money spent to accommodate the increase in guests using the pool and restroom/shower facilities. They are dirty, worn and unsafe. There are always pools of water all over the dirty floor with no mats to raise one out of the dirt and water. As one guest pointed out when we were in the restroom, if someone were standing in the water and used their hair dryer or curling iron it could be very dangerous. My friend slipped and almost fell from the water on the floor more than once. They really need to have more than one sink in the restroom so more than one person can use it at a time too. I am sure that the restrooms are cleaned in the morning but in the summer with heavy use they need attention more than once or twice a day. I will say that when we reported that someone had put a lot of paper towels in one of the toilets and on the floor they sent someone to clean it out right away even though the maintenance person had gone home for the day by that time. The pools also need refurbishing. They look dirty because of the worn interior paint.", "helpfulness": 3, "user": "jannysue", "date": "August 29, 2012", "id": 138822540}, {"rating": 1.0, "stay_parameters": "Stayed August 2012", "text": "I was even disappointed in the gardens this time. They were wilting from lack of water (it was not that hot) and desperately needed some attention to deadheading flowers. Maybe they are trying to save money by cutting staff? Too bad for the prices that they charge...", "title": "Just stupid. Don't waste your money.", "helpfulness": 16, "user": "mybigworldoutthere", "date": "August 7, 2012", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "location": 4.0, "service": 1.0, "rooms": 2.0}, "id": 136440839}], "location": {"country": "United States", "city": "McKenzie Bridge"}, "variance": {"poor": 26, "average": 23, "very good": 41, "terrible": 54, "excellent": 33}, "aka": "Belknap Hot Springs Lodge And Gardens Hotel Mckenzie Bridge", "slim_ranking": 1.0}