{"user_rating": 4.0, "review_count": 28, "name": "Bellingen YHA Backpackers", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with friends", "text": "I had never heard of Bellingen, or the YHA until I stayed at the Newcastle YHA and saw some posters on the wall. It looked like a cool little place to stay, so on the way up the coast we booked 3 nights. Those 3 nights turned into 6 and would have been much longer if we didnt have other plans on the go) Bellingen is a tiny little town, but has the coolest vibe- funky and relaxed at the same time. The hostel just has a great atmosphere and overlooks a peaceful pasture. Its just one of those special places where you can just be there, and you don't really even have to be doing anything, but you just enjoy yourself anyways. Rooms and bathrooms are clean, grounds are nice, nice social area on the patio, well equipped kitchen and Bella the cat is a cute addition :) Go across the bridge and see the bat colony on Bellingen Island, and join the hostel's tour of Dorrigo National Park. Overall a great hostel in a great little town!", "title": "Loved it! Did not want to leave!", "user": "lovebeachtravel", "date": "December 1, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121303261}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled with family", "text": "A very unique experience... a welcoming hostel with friendly staff. They even parked my trailer! Meditation on the top floor overlooking the valley and the Bellingen river, horses on paddocks... very central and near the Dorrigo World Heritage Park. One of our best hostels we stayed in the mid north Coast of NSW: alternative staff like the town, happy atmosphere! We like the environmentally friendly atmosphere.. if all hostels were like this!", "title": "alternative hostel in a Transition town", "user": "MyBellingen", "date": "November 30, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121237758}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled with friends", "text": "One of the best hostels i stayed at in Australia.", "title": "Loved it", "user": "Annie V V", "date": "September 29, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 118722536}, {"rating": 4.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "Not the fanciest, perhaps not even the cleanest, or most characterful. Just the whole experience of staying there.", "title": "Very nice, relaxed and alternative hostel", "user": "Waddler", "date": "September 28, 2011", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 118678985}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled with friends", "text": "First, i loved Bellingen. What a great little town. The hostel is right in the middle, yet somehow has it's own view of a valley, a huge bat colony, and some rainforest.", "title": "Drink tea and float down the river :) The most magical place!", "user": "lalalaaa", "date": "September 2, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 5.0, "value": 5.0, "service": 3.0}, "id": 117569368}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "The YHA is on a back street, one block away from the main road. So quiet, and with a great view down the valley and over the rainforest. It was original built as a C19 brothel, so the structure is all timber, with beautiful polished floors. Rooms are quite good for a backpackers: typically 4-6 berths in bunks. There is an adequate kitchen, with big fridges for backpackers' food. And free tea/coffee any time.", "title": "It rained solid for 3 days - and we still enjoyed it", "user": "spanner48", "date": "June 1, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 5.0, "service": 4.0}, "id": 110972433}, {"rating": 3.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "But the centre of living at Bellingen is the huge verandah: 5 metres wide, with tables, sofas etc., where there is plenty of space to eat, chat, watch the birds and chill out.", "title": "Nice but nothing special", "user": "Fi123", "date": "August 14, 2010", "detail_rating": {"service": 4.0, "cleanliness": 2.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 75119372}, {"rating": 4.0, "stay_parameters": "Stayed December 2009, traveled with family", "text": "Bellingen is quite an 'alternative' place by Aussie standards, so there are normally some interesting characters around. Definitely a worthwhile change from the big cities with their boring, characterless suburbs.", "title": "Beautiful setting for a homely hostel", "user": "Lizzy_beth", "date": "July 20, 2010", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 71605505}, {"rating": 4.0, "stay_parameters": "Stayed June 2010, traveled with family", "text": "Stayed in a six bed dorm which was pretty basic, it had lockers but only two electrical sockets. The fan in the room was caked in dust, and there was no individual lamps for the beds, which i always prefer so when people come back late, they dont disturb everyone else too much.", "title": "totally value for money", "user": "tham_msia", "date": "July 3, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 69548582}, {"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "There wasnt too many people staying there when I was there, which I was grateful for because there only seemed to be 2 toilets and 3 showers in a unisex bathroom.", "title": "Let's say alternative", "user": "Gogs63", "date": "April 17, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 61767063}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "This hostel is right in the thick of Bellingen but is still quiet and relaxing. Just a few minutes walk from the river and no time at all from the main street. We stayed here just before the start of the Bellingen jazz festival so were able to sit on the balcony listening to sax music from the hotel restaurant across the road (which also served yummy food at cheap rates if you show your YHA rom key). Staff were incredibly helpful. They had run out of doubles when we booked so offered us the family room at no extra cost, sorted out our sunset kayaking trip for us and got rid of the spider from our room! Will definitely be back.", "title": "Great staff and location", "user": "Caroline S", "date": "September 16, 2009", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 42153996}, {"rating": 4.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "YHA Bellingen was definitely one of the prettiest places we stayed at in Australia. The Youth hostel is beautiful and very well looked after. We booked a double room for two nights and ended up in a family room. The staff is friendly and – just like Bellingen – a little alternative. It offers lots of great activities and day tours and has two hippie chicks (two chicken) in the garden as well as a cat. Bellingen is a great village. It has lots of old houses which have been kept in a good state and has lots of organic food. It's also a good place to start when exploring the Waterfall Way.", "title": "Very beautiful hostel in an „alternative“ village – great place to stay!", "user": "PufferfishMunich", "date": "April 26, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 28792607}], "location": {"country": "Australia", "continent": "South Pacific", "city": "Bellingen"}, "variance": {"poor": 3, "average": 2, "very good": 10, "terrible": 0, "excellent": 13}, "slim_ranking": 0.8}