{"user_rating": 5.0, "review_count": 96, "name": "Bella Baita Bed & Breakfast", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed October 2009", "text": "If you are looking for a seclusive spot to get away from the world, this is it. The bed and breakfast is located on the side of a gorgeous mountain and just outside your window is a breathtaking view of the snow-capped Alps. You can go hiking for hours and also do some mushroom hunting if you like. The owners/family of the bed and breakfast are the most charming people you meet, full of enriching and intelligent conversation, cheerful songs, bright smiles, and open arms. Our experience at Bella Baita was unforgettable and we have decided to visit again, hopefully very often. If I had any doubt in my mind that you could find nice people still in this world, it is gone because Fabrizio, Marla, and the parents of Fabrizio are diamonds in the rough.", "title": "One of the most amazing getaways you will ever experience and find", "user": "pacz0010", "date": "October 23, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 47551994}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "So pleased to get away from the hurly burly of the Savoie and back to the calm of Bella Baita and the great great grub and welcome by Fab and Marla.....", "title": "GREAT!!", "user": "lizspacebetween", "date": "October 11, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 3.0, "service": 5.0, "rooms": 3.0}, "id": 46547111}, {"rating": 5.0, "stay_parameters": "Stayed February 2006, traveled with family", "text": "Marla and Fabrizio are the best. They are fantastic hosts, great chefs, and very particular about even the smallest details. It was a wonderful trip. The views, hiking, and skiing were spectacular. Being a spectator at many 2006 Winter Olympic events was just a secondary gem. The real treasure was Bella Baita. Hats off to Bella Baita.", "title": "Trip Of A Lifetime!", "user": "FelipeColorado", "date": "September 21, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 43359635}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "Bella Baita is a true gem in the Italian Western Alps. The Bed&Breakfast is a little mountain resort run very well by Marla and Fabrizio. Marla prepares breakfast with local and homemade products. And if you have the opportunity to stay for diner, Fabrizio joins the team to perfectly do a piemontese style evening. The nature around this Val Grandubione and the seven-bridge hike is just fantastic. So a great place to spend your holiday with 4 kids. Aged 14,13,9,6. A small kitchen for an afternoon break whilst enjoying the view, a nice patio for a glass of wine in the evening under the starts in the sky it is all possible at Bella Baita. The three rooms were nice and clean with spectacular views. The Fenestrelle fortification tour, the 13 lake hike, a cycle ride from Val Chisone and walks around a nice old village are just a few things to do. But also lovely Torino can be done with ease from this spot.", "title": "Bella Baita is a true gem in the Italian Western Alps", "user": "geologist-explorer", "date": "August 17, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 37969072}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "We spent a very happy week with Fabrizio and Marla at their lovely B&B up in the hills north of Turin. The area is beautiful with plenty of options for walking, driving, biking or visiting the local villages, towns and cities. The food prepared by Marla and Fabrizio was so good - freshly prepared every evening and always very appetizing. We really enjoyed eating with our hosts whom we felt we got to know well and who gave us excellent advice on places to visit and things to do as well as background information on the local area and region. Our visits to Prali, Usseaux, Sestiere, Pinarolo, all within 40 mins drive time worked out really well. Walking in the local hills and valleys was lovely and so relaxing. We are hoping to return!", "title": "Wonderful time in Piedmont with Fabrizio and Marla", "user": "mcd53", "date": "August 4, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 36721781}, {"rating": 4.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "We stayed at with Marla & Fabrizio for one night at the end of December 2009 and had a fantastic time. The views from the hotel are just amazing and we were more than happy to sit and look out the window for a while. Marla and Fabrizio are both very welcoming and hospitable and are passionate about the area. We went for a walk around the area and it was all very beautiful.", "title": "Highly recomended", "user": "T-A-UK", "date": "January 12, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 53327025}, {"rating": 5.0, "stay_parameters": "Stayed September 2009", "text": "I was privilged to join them for dinner, but unfortuantly my husband was ill and couldn't join us. The meal was amazing and HUGE, I recomend that you eat lightly during the day so you can fit it in! They were both very concerned about my husband being ill and helped out as best as they could. The breakfast the next day was also amazing. We didn't realise that they had a cooking school and should we be in the region again we definately sign up for that.", "title": "Perfect Summer Holiday", "user": "HappyTravelling08", "date": "December 27, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 51964965}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "The room is cozy but it was very comfortable and it was most importantly warm as there was quite a bit of snow outside!! The bed is a little firm but some people like that. The bathroom was large and when my husband had a shower in the afternoon the hot water ran out but in the morning there was more than enough to go around. The best thing about the rooms are the view out over the valley and mountains. It was truely spectacular. I would definately recomend Bella Baita to everyone.", "title": "Most Amazing Place in Europe", "user": "Maggie-Becki", "date": "December 5, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 50678316}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "I was looking for something a bit different, not the usual tourist traps, to visit with mum...somewhere with beautiful unspoilt views, good food and ideally some sunshine. I saw the reviews on Bella Baita and decided to go for it. Our expectations were far exceeded! After the slight shock of driving up all the hair pin bends to reach the rustic mountain house, we were warmly greeted by the perfect hosts Marla and Fabrizio - relaxed, genuine, clearly experts at catering for all the needs of their guests. We slept well every night...a combination of healthy days out in the mountains, our hosts wonderful cooking (beautifully prepared but with no fuss) and the local digestivo. Our room at Bella Baita was fairly basic but waking up to sunrise over the Alps and even a rainbow one morning was compensation enough. Highlights were walking around the quaint village of Usseaux and the day out in Prali with views from the mountain top, reached by the ski lifts. Also the trip to the wine area, where we stumbled across a wine festival and enjoyed tasting the Barolo. Mum commented one day that it was the most beautiful place she'd ever seen and the next day it was even more beautiful! Having enjoyed views ranging from the Whitsunday Islands in Australia to the Scilly Isles, this is high praise! Every day, we got a personalised recommendation from our hosts - over breakfast with freshly baked pastries - suggesting where we might like to go. We enjoyed meeting other guests over dinner and breakfast and received some inspiring cooking lessons. I would highly recommend this to anyone who wants a great base for walking in the mountains with spectacular views, enjoys good food and company and wants to get a taste of the local culture.", "title": "We loved it !", "user": "rhumbagirl", "date": "November 15, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 49224432}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "Becki & I stayed here for Christmas. My very first white Christmas. What can I say about this beautiful place...Best hosts imaginable, nothing was too much trouble. Food was to die for. The most amazing Christmas of my life. Thanks Marla & Fabrizio...you guys know how to spoil your guests. We felt like family.", "title": "The best food in Italy.", "user": "stellissima", "date": "October 23, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 47587406}, {"rating": 5.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "We stayed here for a week: it was an excellent base from which to see Piedmont. We skied on several days and also visited Turin; we were guided throughout by the suggestions and assistance of the friendly and solicitous owners Marla and Fabrizio.", "title": "A beautiful place with wonderful hosts", "user": "Copgrove", "date": "March 1, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 25384877}, {"rating": 5.0, "stay_parameters": "Stayed August 2008", "text": "Bella Baita itself is beautifully located, though you really need access to a car unless you are preternaturally energetic, as it is 6km off the main road, halfway up a mountain.", "title": "Fantastic place", "user": "LiamS", "date": "August 31, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 19566236}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "The amazing breakfasts and dinners were full of superbly prepared home-cooked food, and they also ran their interesting and useful cookery course, even through there were only the two of us. By some distance the best B&B we have ever experienced. If we are anywhere near again, we shall certainly be back!", "title": "Fantastic views, food and company.", "user": "Catherine_Richard", "date": "July 30, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 18415850, "likes": {"liked": "— Food, scenery and the hosts.", "disliked": "— It was hard to leave."}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "We booked a 6-night stay in Bella Baita in August. From the moment Fabrizio picked us up from the train in Pinerolo we knew we had made a good choice. He made us feel at home straight away and by the time we arrived in Bella Baita, we were well acquainted with local history and culture.", "title": "Great stay in Val Chisone", "user": "jandsnj", "date": "July 27, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 18312876, "likes": {"liked": "— The wonderful personable proprietors."}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "Bella Baita is situated 6km from the village of Pinasca up a very steep and windy road. Those who arrive without a car should be prepared to face a 2 hour walk up!", "title": "Bella la Bella Baita", "user": "SteuMuncale", "date": "July 16, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 17935919, "likes": {"liked": "— The friendly atmosphere", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled with family", "text": "I realize it took me a little time to post this (ok, alot of time) but I need to weigh in. My wife and 5-year-old stayed at Bella B for about a week. Bottom-line: unforgettable.", "title": "Magnifico", "user": "Igorsky", "date": "July 31, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 36345106}, {"rating": 5.0, "stay_parameters": "Stayed June 2006, traveled solo", "text": "The drive up to Bella B from the main road is a small adventure in the best sense. Once there, the setting is quite beautiful, with serious mountains on the horizon and woods all around. Our rooms were very comfortable in a homey sense. What sets this place apart are the people, Marla and Fabrizio. Marla is an American with a passion for cooking, enjoying a good meal with guests, making sure they have a good time. Fabrizio is incredibly talented -- builder, cook, host. Their meals and cooing classes are truly memorable.", "title": "The Most Amazing B&B On The Face Of The Planet!!!", "user": "seanwring", "date": "July 26, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 35847937}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "Three memories especially stand out. One: our family of three hiked up the nearest mountain/big hill. It was an all-day affair and we had a blast. Wonderful vistas and just right for a family with kids.", "title": "Beautiful unspoilt mountain region, great walking and fantastic food", "user": "Hydroboy", "date": "June 22, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 32920946}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "Two: Marla and Fabrizio took us to the market in Pinerolo. It's not likely your guidebook mentions Pinerolo but the market was a marvelous slice of Italian life -- real people shopping for supper, pajamas, cooking utensils, whatever. Marla helped us with a few transactions and we all headed to the town's main pastry shop for a plate of pastries that makes us gasp to this day when we see photos. Oh my.", "title": "A jewel in the Alps", "user": "justgo38", "date": "June 7, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 31794584}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "Three: day trips. Perhaps most memorable: Barolo is a short drive away -- we are talking gorgeous Italian wine country.", "title": "Highlight of our trip!", "user": "Zentner", "date": "March 20, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 26531449}], "location": {"country": "Italy", "region": "Piedmont", "continent": "Europe"}, "variance": {"poor": 0, "average": 0, "very good": 3, "terrible": 0, "excellent": 93}, "slim_ranking": 1.0, "description": "We are a small inn, 57km (30 miles) SW of Turin in the mountains. We offer a balance of mountain activities and day excursions whilst enjoying the culinary delights of this region. All levels of walking, climbing, and cycling are just outside your door. We offer small custom \"Cooking Together\" sessions as well. Whether you are looking for relaxation or activities of Val Chisone, our peaceful alpine surroundings make Bella Baita the perfect choice."}