{"user_rating": 4.5, "review_count": 8092, "name": "Bellagio Las Vegas", "reviews": [{"rating": 5.0, "title": "Amazing Hotel", "text": "We went to Las Vegas to celebrate our 25th anniversary. We were not disappointed with the city or the hotel. The Bellagio is a gigantic, high end, luxury hotel and we had a great room overlooking the fountains and wonderful service. The room was spotless and everything worked. After we told the front desk that we were celebrating our anniversary, they sent up a box of chocolate truffles and a card. The restaurants in the hotel were expensive but that was expected. I found that the service was fabulous, from the bell men to the concierge desk to the coffee shop employees. An example of such service was when we had eaten lunch at the buffet one day and I had asked for ginger to go with the sushi. It seems that they had run out and their order had not yet arrived. After about 5 minutes a very pleasant gentleman arrived at our table with a bowl full of ginger, explaining that he was the assistant manager and that he had gone to room service to get the ginger. How wonderful, they had gone beyond the ordinary to please us. The only issue we had was with some neighbour having a screaming baby in the middle of the night. A suggestion that we have for the hotel is to try and segregate the rooms with little children. Otherwise a fabulous hotel and we will certainly stay there again.", "user": "dadofjessie", "date": "December 9, 2013", "id": 187194274}, {"rating": 5.0, "title": "Gorgeous holiday presentation, fabulous room, great gaming!", "text": "Just got back from a three night stay at Bellagio. It's got to be one of the most beautifully decorated hotels of the season. Wednesday afternoon through Saturday morning. A better time for us as the weekends are more crowded than we like.", "user": "bonny132", "date": "December 9, 2013", "id": 187184493}, {"rating": 5.0, "title": "The best hotel in LV", "text": "We had a fabulous time! Check in, seamless, the room, luxury, the beds like sleeping on a cloud, the bathroom, big with soaking tub. Wonderful pastry/coffee shop. I saw many people hit jackpots! Lot's of evening excitement in the bars and good music!", "user": "paul2361", "date": "December 8, 2013", "id": 187115626}, {"rating": 5.0, "title": "December Delight", "text": "The spa and work out area, super nice! Heated pool open and people were swimming on 29 degree mornings! Definitely the best hotel /casino I've stayed at in my 10th trip ( 7 different hotel/casino's) and I believe we've finally found our \"go to\" place in Vegas.", "user": "Dianne M", "date": "December 8, 2013", "id": 187099908}, {"rating": 5.0, "title": "A stunning hotel", "text": "Great security and friendly staff. The improvement's that could be made? Need more waitress's on casino floor. Coffee in room would be sweet but we purchased in hotel gift shop our own beverages and late night snacks and that worked out well! Good Luck!", "user": "7PW6", "date": "December 8, 2013", "id": 187087965}, {"rating": 2.0, "title": "get receipts", "text": "Went to Bellagio for my 40th wedding anniversary. On returning home found that our credit card had been charged for items we had no receipts for . Also a relative said she had left us a message for our anniversary. The message was not passed on and after numerous emails to hotel requesting a breakdown as to why our card was debited eventually got an email saying we had bought items through the room service. This was not true and although I have written they have totally ignored me. My advice is to always get receipts.", "user": "auldreekiescotland", "date": "November 12, 2012", "id": 145231444}, {"rating": 5.0, "title": "Worth every penny", "text": "Felt let down on what was for us a once in a lifetime holiday.", "user": "Stephen W", "date": "November 12, 2012", "id": 145228943}, {"rating": 5.0, "title": "Fantastic", "text": "What can I say .. great rooms, good prices if you know where to look and when to go.", "user": "GTC2012", "date": "November 12, 2012", "id": 145225759}, {"rating": 5.0, "title": "just wonderful............", "text": "Staff were excellent, whether it be check in, casino, restaurants ... just love this place.", "user": "GoldCoastJoey", "date": "November 12, 2012", "id": 145208570}, {"rating": 4.0, "title": "Good hotel if you forget about the casino", "text": "Worth getting the breakfast buffet, seriously .. everything you ever dream of for breakfast.", "user": "jamiebfUK", "date": "November 11, 2012", "id": 145184419}, {"rating": 5.0, "title": "Vegas' Best", "text": "Become a M-Life member and the discounts are awesome! You will never want to vacation anywhere else! Even if you don't gamble, the amenities offered and central location is the best for access to all of the \"strip\".", "user": "Charles N", "date": "December 10, 2013", "id": 187264836}, {"rating": 5.0, "title": "Outstanding View!", "text": "We were there back in '13. We've had a Superior room with an outstanding view on the Strip. The best thing was the huge fountain in the front at the hotel, though...What a thing! I thought that we'll watch the fountain show maybe twice....Not this time. It was so amazing that we watched it a bit more...Another gerat location is the Restaurant \"FiX\" ground floor, Casino. If you're a meat lover, you have to go there. It's awesome!", "user": "Corleano", "date": "December 10, 2013", "id": 187263135}, {"rating": 4.0, "title": "Birthday at the Bellagio", "text": "The staff of the hotel was very kind and the rooms were clean. We will recommend this place anytime! A good place to spent some time and money ;-)", "user": "chrissyteeps", "date": "December 9, 2013", "id": 187218966}, {"rating": 5.0, "title": "great hotel", "text": "By the way: You have to see the shows of the Cirque de Soleil. It's stunning. You won't believe it what they do until you see it.", "user": "jennmelzer", "date": "December 9, 2013", "id": 187210679}, {"rating": 4.0, "title": "Vegas baby", "text": "Enjoy!", "user": "hase1", "date": "December 9, 2013", "id": 187199627}, {"rating": 2.0, "stay_parameters": "Stayed August 2013, traveled with friends", "text": "So it wasn't just that I found a bug. It's how it was all handled. On the day I was going to leave I asked for a late checkout. I got one. So I started packing. When I got to the desk area to clean up there I saw it. A bug on the chair. About half the size of my thumb. I jumped back and let the stuff on the desk sit for a bit.", "title": "Well...I found a bug. A big one.", "user": "rileyray3000", "date": "August 26, 2013", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 2.0, "sleep": 2.0, "rooms": 4.0, "location": 4.0}, "id": 174132551}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "So I called downstairs. I told them what happened. They sent someone up. With towels. I pointed out to the guy with the towels what I needed was help with a bug. He said \"no no no\" and fled. So then I got a call asking if I got my towels. And they kept using the wrong variation of my name. I said I didn't ask for towels. I asked for someone to get rid of a bug. She kept insisting that I had asked for towels. And kept calling me Mr. Robinson. Which I'm not.", "title": "Very good", "helpfulness": 2, "user": "fkaCraig", "date": "August 26, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 174127685}, {"rating": 2.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "I hung up.", "title": "Very high expectation but very disappointed", "helpfulness": 1, "user": "marcnus", "date": "August 26, 2013", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 4.0}, "id": 174123826}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "I called back and asked for a manager. I got one. Eventually the apologizing manager sent up someone to look into it. It was a very nice lady who I assume was a housekeeping manager. I showed her the bug. She freaked out. Then I heard her on the phone with someone who told her to pick it up and I heard her say she wasn't picking it up either.", "title": "The best Vegas experience", "helpfulness": 3, "user": "Galatia_12", "date": "August 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 174077327}, {"rating": 4.0, "title": "Excellent, comfortable, first class hotel", "text": "At this point and close to an hour of this I said the hell with it.", "helpfulness": 4, "user": "i-live-for-lunch", "date": "August 26, 2013", "id": 174065027}, {"rating": 5.0, "stay_parameters": "Stayed August 2013", "text": "I stayed here with my two boys to celebrate my 50th Birthday!", "title": "It's 'The Bellagio'...!", "user": "EvsFetcham", "date": "August 24, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 173813541}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "It was basically a 'base', but a nice one at that!!!", "title": "Had a great time here", "helpfulness": 3, "user": "Fabella1963", "date": "August 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 173779253}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "We ended up with two other friends of my boys joining us so had 5 in the room with two Queen beds!!!", "title": "Everything the movie suggested it would be", "helpfulness": 1, "user": "Jimplis", "date": "August 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 173771671}, {"rating": 5.0, "stay_parameters": "Stayed August 2013", "text": "There were no problems!", "title": "Excellent location on the strip", "helpfulness": 2, "user": "Phil C", "date": "August 24, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 173759346}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "Our room over looked the pools, the accommodation was fine, daily maid service - twice a day I think.", "title": "Nice weekend", "user": "Edward J", "date": "August 23, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 173725974}, {"rating": 3.0, "stay_parameters": "Stayed June 2012, traveled on business", "text": "I stayed at this hotel for a conference this past June for 3 nights. I was looking forward to staying at the Bellagio for the first time after many trips to Las Vegas. At first glance, the hotel is beautiful. But what a nightmare checking in - it felt like there was not nearly enough front desk staff as 3/4 of the wickets were empty. On top of it - it was a mosh pit as people were scrambling for their spot in the queues. Take a less from other properties which have clearly marked lanes for queueing up. Was never offered the option of having my bags taken to my room. Check-in was quick, but I am starting to get tired that you have walk through a casino to get to the elevators - there is a constant train of people with all their luggage continually walking through the casino - maybe at Circus Circus, but not the Bellagio. The room was very nice, but I was facing the Bellagio Fountains - so felt like gunshots were going off in my room every 15 minutes. And the walls are super thin - felt like The Hangover was taking place next door to me minus the tigers. Finally got fed up because I was catching up on some work, I just packed my bags, and went downstairs and I was moved to the Spa Tower. Still a nice large room, and quieter, but walls are still super thin so any noise in the hall came through. I know that you shouldn't spend that much time in the room in Vegas - but at some point you have to sleep or in my case get some work done - and all I kept thinking was, \"How did this place get a 5 Diamonds - did the reviewer actually stay here?\"", "title": "Not sure why this hotel is rated AAA 5 Diamonds", "helpfulness": 3, "user": "LeisuresuitEDR", "date": "August 1, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 1.0, "rooms": 4.0, "location": 4.0}, "id": 135988214}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "Must see lobby with flower displays changed seasonally. This is a nice place but over priced and not as good as caesars palace next door. Also the fountains out front are a great show. The casino is expensive.", "title": "Great hotel lobby", "helpfulness": 5, "user": "postrawb", "date": "August 1, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 135976443}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "We haven't been to Vegas in 10 years and decided to take the kids on our trip our West. Stay in a room over looking the fountains and at night the kids will be entertained for hours. Don't take them to Freemont street at night. Sin city is alive and well and you'll get tired of explaining the oddities to kids down there. We did the Shark reef at Manadalay Bay, walked the hotels, the Eiffel Tower at Paris, the gondolas at the Venetian and took them to see \"O\" at theBellagio. The kids were entertained and exhausted at the end of each day. We are dying to go back but next time, sans children.", "title": "Wonderful but crowded.", "user": "Bubaroo", "date": "August 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 135970493}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "First time at the Bellagio and we will be back..fantastic service could not be faulted.", "title": "Perfection", "helpfulness": 2, "user": "kerryann988", "date": "July 31, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 135925259}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled with friends", "text": "So reasonably priced..the meals were superb. room service was stunning and so graciously served. We can't wait to return.", "title": "Still the Queen of Vegas!", "helpfulness": 1, "user": "CyborgStu", "date": "July 31, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 135920573}, {"rating": 4.0, "title": "Disappointing check-in but otherwise excellent", "text": "This is about our 8th stay at The Bellagio. Hotel is gorgeous, with higher class surroundings, etc. refurbished rooms in main tower are great and views of the lake/fountains well worth paying for though you may need to re-arrange the furnishings to sit in front of the window and watch (strange set up really for one of the main attractions in Vegas?). Unfortunate episode at Check in when we were told they did not have a room as we requested (Full Fountian view on high floor). Took about 1 hour of arguing (and calls to management) and being offered two other unnacceptable rooms before they amazingly found the one we had requested was indeed available. Just felt like we were being fobbed off, even though we had booked and paid deposit 4 month searlier. Shoddy treatment was not normal here and very disappointing.", "user": "r d", "date": "December 10, 2013", "id": 187295652}, {"rating": 5.0, "title": "Beautiful hotel", "text": "I took my oldest son to Vegas and we spent 4 nights at the Bellagio last September. This hotel is very elegant and the staff is very nice. My son loved his first time experience in Vegas and on my side I had been here a few times in the past, but every time I go to the Bellagio I fall back in love with the place. Even if you don't end up staying at that hotel you must go visit the place, try the food and the casino.", "user": "Mzakov", "date": "December 10, 2013", "id": 187291051}, {"rating": 5.0, "title": "Fountains", "text": "Its also very well located on the strip.", "user": "Mauricio M", "date": "December 10, 2013", "id": 187278514}, {"rating": 5.0, "title": "Don't Hesitate to Stay at the Bellagio", "text": "Got to this hotel because my niece in her first travel to Vegas wanted to see the fountains, so I got a very good deal through Facebook and I really was surprised with the overall experience.", "user": "DianeC", "date": "December 10, 2013", "id": 187277118}, {"rating": 5.0, "title": "Family get together", "text": "The fountains view from the deluxe rooms is excellent, even the TV has a channel dedicated to better enjoy them.", "user": "Lois M", "date": "December 10, 2013", "id": 187270202}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with friends", "text": "I gotta have my fountain view!! Just came back from a 4 night birthday stay at Bellagio Las Vegas and I have to say they never disappoint. I had one of the newly remodeled rooms in a premier fountain view room. Check in was early and they accommodated us, rooms became ready as we were checking in. Gaming there was fun...a little tight at first but looser later. Housekeeping was great, security was good. Only problem was one slot attendant who had quite a bad demeanor and presentation...she fixed the Zeuss slot when it wouldn't spit out my ticket. She was so crass...but she was just a meanie. I had fun!!", "title": "One of my favorite places to stay in Vegas!!", "helpfulness": 1, "user": "JAMAICA_CHICK", "date": "April 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 158239177}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled solo", "text": "Although disappointed that the cirque show was blacked out during my visit ...I heard from many people that it was excellent. I did attend Zarkana which was pretty good the theatre was awesome. The bellagio is the most beautiful hotel/casino that I saw there and I went in to many of them. I highly recommend if you are looking to pamper yourself and feel wonderful!", "title": "Wonderful beautiful hotel", "user": "Dianne I", "date": "April 19, 2013", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 1.0}, "id": 158237334}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "It is the great hotel. Everything was perfect. We booked the lake view room. It is more expensive than the city view, but it is so beautiful, we were glad that we did it. The restaurants were amazing. We would like to stay there again.", "title": "Exccelent hotel", "helpfulness": 1, "user": "Valerie_shl", "date": "April 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 158228719}, {"rating": 5.0, "stay_parameters": "Stayed December 2012", "text": "This is at the top end of places on the strip but it is worth it. My wife and I have stayed in Vegas a lot and this place is one of the nicer places we have stayed at. The decor is lovely and the help is wonderful.", "title": "High priced but worth it for sure.", "user": "Pentukey", "date": "April 19, 2013", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 158225901}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "My wife and I decided to go with the Bellagio for our anniversary trip. The prices are higher, but, in my opinion, totally worth it. The rooms are nice. I mean, for the money, I expected a bit more, but to be honest, we weren't there entirely too much. Our view was onto the Strip, which was nice. I understand that for a bit more, you can have a view of the water in the front. Rooms aside, the place is a blast. Jean-Georges Vongerichten, at the time (this was last year) was the head chef at Prime, the steakhouse overlooking the Bellagio fountains. The staff, hearing this was our anniversary, set up a table outside with an incredible view. We were right on the water, so when the fountain show came on, we had one of the best views in the house. They served a deconstructed split pea soup that was amazing, and when my wife asked for a sauce for her steak, the waiter took that request to the chef, who came back with three sauces he put together for her to try. Holy Cow! All three were great! We were treated like rock stars, the food was amazing, and they didn't blink when I asked for some bread to feed the ducks.", "title": "Anniversary Gold", "user": "SpathicRugger", "date": "April 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 158207478}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "Stayed in room 25076 (25th floor, #76) for one night. King room facing fountain. This is an adjoining room. Very nice room, comfortable bed, awesome bathroom. Robes provided. Lots of room to plug in electronics and spread out. Enjoyed watching fountain shows throughout the afternoon and evening when we came back to room. Good view of the strip and planes at nearby airport. We self parked - it was easy and free. Check in was straightforward, tho the lines can get long. We had dinner at Fix at Bellagio – service was awesome, meal was pretty ho-hum and made us each sick later that evening.", "title": "Solid staff, nice room, fun fountain shows", "helpfulness": 1, "user": "MaineIzzy", "date": "January 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 122822063}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "Turn-down service was wonderful. Everyone on the staff we encountered was very helpful and polite –from front desk to housekeeping to room service.", "title": "Bellagio, great hotel with a perfect location!", "helpfulness": 3, "user": "Hema_Ramasamy", "date": "January 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 122816537}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "We ordered room service – it was very good and arrived right on time.", "title": "Stunning!", "helpfulness": 3, "user": "collierminx", "date": "January 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 122808404}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "Flat screen TV and remote controls for window blinds. The room was non-smoking – tho the casino is filled with smoke and noise, we smelled no smoke and the room was very quiet.", "title": "Top Notch in Las Vegas", "helpfulness": 3, "user": "PBANDJLancaster", "date": "January 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 122794644}, {"rating": 5.0, "stay_parameters": "Stayed January 2012", "text": "The “resort fee” is bull----, but I was made aware of it in advance.", "title": "Good", "helpfulness": 3, "user": "TravelinPam3", "date": "January 8, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 122789139}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "We stayed at a hotel suite for 1 night. The front desk was nice enough to upgrade us to fountain view suite. The rooms were clean, toiletries excellent. The view from our room priceless at night and day.", "title": "The place to stay when visiting LV", "helpfulness": 1, "user": "mendiratta", "date": "April 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 158127104}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled with friends", "text": "The hotel pool and hot tubs are amazingly clean and beautiful. The big pool is 3.5 feet deep and has 2 lifeguards, so a nice touch. The pastry shop is amazing, i had a lot of my meals there.", "title": "Bellagio for 7 days March 2013", "user": "Stevie2ticks", "date": "April 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 158126980}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "I did visit a lot of other casinos on the strip, but nothing compare to the big and clean Bellagio. Bellagio is on a different level. the tulip filled conservatory area and its numerous fountains is great.", "title": "Beautiful Hotel!", "helpfulness": 1, "user": "scorpiogirl65", "date": "April 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 158114856}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "I look forward to visiting back with my family again to Bellagio soon.", "title": "Vegas in Style", "user": "mm1357", "date": "April 18, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 158099886}, {"rating": 5.0, "stay_parameters": "Stayed April 2013", "text": "Booked this trip last year as it was my sister-in-laws 40th birthday in March 2013 so 13 friends and family wanted to spend time together with her in Las Vegas.", "title": "Top location, service, quality , view! And cirque du soleil show is a must!", "user": "Alexschwae2", "date": "April 18, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 158083684}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with friends", "text": "WOW! That's the best way to explain the Bellagio. I had a strip view room in the tower adjacent to the main building. The room was big, the bed very comfortable and the views unbeleivable!!", "title": "Perfect Las Vegas location", "helpfulness": 1, "user": "Craig R", "date": "August 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 174063092}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled on business", "text": "The room was serviced twice daily. I never heard anyone or anything inside the room, or hallway. The staff were all very friendly and helpful.", "title": "Great convention property", "helpfulness": 1, "user": "MichaelBroadhurst", "date": "August 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 174010957}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "It's location is right in the middle of the strip with the Aria on your right, Ceasars on the right, and Paris and Planet Holliwood directly oposite.", "title": "Great experience in a truly 5 star hotel", "helpfulness": 3, "user": "MSV V", "date": "August 25, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 174001549}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled on business", "text": "The buffet is absolutely worth trying, it has everything you could hope for, especially the Brunch served weekends.", "title": "A good Vegas Premium Hotel", "helpfulness": 1, "user": "Mark N", "date": "August 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 173991274}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "Enjoy!", "title": "4 night trip", "helpfulness": 3, "user": "Oscar827", "date": "August 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 173935529}, {"rating": 5.0, "title": "Exceptional Staff", "text": "We found the staff at the Bellagio, particularly the serving staff in the restaurants, to be exceptionally helpful and friendly. They actually seem to enjoy their work and to take pride in the work they do - unusual today. The hotel public areas were kept very clean, no easy task considering the high volume of people walking through it each day. Our room was attractive, comfortable, and very clean. The location is great, with easy access to other hotels to see shows. The fountain shows are great and we make a point of watching many of them. We have stayed at the Bellagio before and we will stay there again.", "user": "Brynny2", "date": "December 11, 2013", "id": 187333029}, {"rating": 4.0, "title": "Beautiful Suite", "text": "We recently returned from a 3 night stay at Bellagio. We stayed in a Salon Suite. Very nice corner room with wonderful views, huge bathroom and lots of windows. It was on the 16th floor at the end of the hall - quite a walk, but worth it. It was a birthday celebration and the Bellagio sent up chocolates. I had ordered a birthday cake through room service before we arrived. They did a great job and were much cheaper than trying to get one from a local bakery.", "user": "KareninColorado", "date": "December 10, 2013", "id": 187326096}, {"rating": 5.0, "title": "Anniversary Getaway", "text": "We have stayed at numerous hotels in Vegas over the years and have lived in Vegas as well. The Bellagio is top-notch and in a great location.", "user": "BrentKS", "date": "December 10, 2013", "id": 187311719}, {"rating": 5.0, "title": "Best Vegas Wedding Here!", "text": "The only negatives were the smoke smell in the hallways of the hotel buildings (the air just really needs to circulate in the hallways), some lightbulbs were out in the room and I guess we were supposed to have turn down service each night but only received one night. None of these were major negatives. I would stay at this location again.", "user": "Jennifer S", "date": "December 10, 2013", "id": 187307244}, {"rating": 5.0, "title": "B does come before W", "text": "If you can do so, the splurge on a suite is definitely worth it!", "user": "jmpmd", "date": "December 10, 2013", "id": 187307118}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled with family", "text": "Bellagio Suite.", "title": "Almost a 5", "helpfulness": 2, "user": "Ben P", "date": "January 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 122744512}, {"rating": 1.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "Preface by saying I’d stay again in a heartbeat.", "title": "Find a broken Glass at the Floor, can't up keep with the PLACE", "helpfulness": 3, "user": "supermario0810", "date": "January 8, 2012", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 3.0, "sleep": 1.0, "rooms": 1.0, "location": 3.0}, "id": 122744138}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "It started not so good. We arrived late on a weekday and were installed in a smoking room. Do not recall anyone ever mentioning/asking about it.", "title": "Stunning!", "helpfulness": 4, "user": "Lt85", "date": "January 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 122740126}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled with friends", "text": "Teeny problem getting to hotel management (had to call twice), but he resolved the problem instantly and almost magically – over phone. Walked straight to new room. Entire ordeal, about 45 minutes.", "title": "Great Hotel Stay", "user": "Joe c", "date": "January 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 122737383}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled on business", "text": "Only and last problem.", "title": "Winter visit", "user": "SolarT", "date": "January 7, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 122723978}, {"rating": 5.0, "title": "Great hotel in a great location! Love the Bellagio fountains, and the VIP service.", "text": "We have just returned from a week long stay at the Bellagio in Las Vegas whilst my husband attended a conference at Caesar's Palace next door. We opted to stay in a one bedroom Penthouse lakeview suite overlooking the fountains, and also spent our last day in a deluxe room, so had the advantage of experiencing two different accommodation styles. Regardless of room type, my advice would be to opt for a lake view room overlooking the fountains - this is definitely the highlight of having stayed here. We booked directly through the hotel website, which allows you to select the upgrade of a lake view room (you do pay a little more, but it is worth it for the entertainment value) - if you book through other accommodation search engines, whilst you may get a great rate, you may have to take pot luck on getting an upgrade at check-in, so if room type is of paramount importance then I would book directly with the hotel. Just beware though if you are a light sleeper, the sound of the fountains may disturb you - I thought they were meant to stop at midnight, but I saw them running beyond 1am on a few nights. We were on the 34th floor and could still hear them, so I'm not sure how loud they would be on the lower floors late at night.", "user": "CarKri02", "date": "November 10, 2012", "id": 145113032}, {"rating": 5.0, "title": "Wow", "text": "I decided to book a one bedroom penthouse suite because I thought that I may want to spend some time relaxing in the room whilst my husband attended his conference - little did I know that Vegas would be such wonderful fun that I would hardly ever see the inside of the room! The penthouse suite was lovely - situated on the upper floors, spacious, luxe furnishings, high ceilings, and amazing floor to ceiling windows from the living area and bedroom. We had a small entry foyer with powder room, bar area, separate living and dining, and a large bedroom. We had two ensuite bathrooms off the bedroom - a \"his\" with steam shower, and a \"hers\" with bath, each with their own separate toilet & BIRs. The beds were super comfy, and the air con temp control was reliable. Despite the room and floor not being a non-smoking, there was no stench of stale cigarette smoke, much to my relief after hearing bad stories of the smoking indoors in Vegas. This room category also comes with VIP access, which includes refreshments all day (my husband would often grab a coffee & danish in the morning to save having to go to breakfast) and excellent VIP service in the lounge. They were fabulous in booking us VIP seats to shows, and arranging our transportation.", "user": "mack0168", "date": "November 10, 2012", "id": 145099691}, {"rating": 5.0, "title": "Excellent trip for a memorable 21st", "text": "On our last day, we requested day use of a room as our flight did not leave until 7.30pm and we had a long trip back home ahead of us. I think the rate works out at US$109 on a weekday & US$139 on a Friday or Saturday, for a deluxe room which could be used until 6pm. The deluxe room was on the 11th floor, and had a view out the rear of the property. Whilst the view was nowhere near as exciting as the fountain view, you still overlooked the lights of Vegas and the mountains in the background. The room itself was extremely comfortable & spacious, newly refurbished and also had large lounging chairs and a super comfy bed. If you don't want to pay the extra for a suite, then I think this is a very good room option, even for extended stays.", "user": "Nsbuckley", "date": "November 10, 2012", "id": 145094009}, {"rating": 5.0, "title": "Thanks for the great memories Bellagio!", "text": "The restaurants and bars in the Bellagio are excellent. We dined in Olive, Yellowtail, Le Cirque and Picasso. The meals in the latter two were superb - beautiful food, great dining atmosphere and excellent service.", "user": "JCap561", "date": "November 10, 2012", "id": 145086316}, {"rating": 5.0, "title": "Bellagio", "text": "The spa is an amazing complex with excellent therapists, but I was shocked with the price of the treatment, and hence did not book any more! Whilst everything else in Vegas compared favourably cost-wise with our strong Australian dollar, the spa was the most expensive I have ever been to!", "user": "bill b", "date": "November 10, 2012", "id": 145077756}, {"rating": 5.0, "title": "Worth staying here if you get the correct room", "text": "Stayed for 5 nights with or 2 children. Our rooms were in the spa tower, on the back side ( not overlooking the fountain) rooms were very clean and comfortable beds. Buffet breakfast was good, but if you are not big breakfast eaters probably give it a miss as its quite expensive. If you plan to not consume mini bar items, but want to buy your own drinks to put in there just let house keeping know or they will take your items from the refrigerator and put more of the hotels in, leaving your drinks on the counter. Not a huge hassle but can save you a bit of issue.", "helpfulness": 1, "user": "Renees0212", "date": "April 18, 2013", "id": 158080919}, {"rating": 4.0, "stay_parameters": "Stayed July 2012", "text": "Great say.", "title": "THE Place To De-Stress in Vegas...Bellagio makes 1 forget the harsh reality of work life!!!", "user": "Rob K", "date": "April 18, 2013", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 158078433}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "* Step right into a world of luxury, Bellagio though older than other Vegas hotels still continue to have that classic, friendly, warm & welcoming ambiance.", "title": "Great Place to Relax", "user": "Scott R", "date": "April 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 158074725}, {"rating": 3.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "* Besides the obvious casino-playing, this hotel has other forms of awe-inspired offerings:", "title": "You Lost 2 Stars!", "user": "PinkSaguaro", "date": "April 17, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 158066256}, {"rating": 3.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "- fabulous garden atrium unlike any other in Vegas", "title": "ok", "user": "spay-cast", "date": "April 17, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 2.0, "sleep": 2.0, "rooms": 3.0, "location": 5.0}, "id": 158065570}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "This was my second stay at Bellagio and I loved it just as much as the first. It is gorgeous there with all the fountains, conservatory, and the ceiling when you first walk in. The rooms are decorated with a fun funky vibe. The pool is so pretty and always a great time. I highly recommend staying at Bellagio when you make a trip to Vegas!", "title": "Gorgeous hotel.", "helpfulness": 3, "user": "MallorieOwens", "date": "July 31, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 135918070}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "I chose this hotel for my partners 30th birthday, and i do not have one compliant about this hotel.", "title": "Excellent! Everything we expected and More!", "helpfulness": 1, "user": "eady56", "date": "July 31, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 135912065}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "The check in was quick and easy, it at the most took 10 minutes.", "title": "Wowza!", "helpfulness": 1, "user": "GeoGirl87", "date": "July 31, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 135911311}, {"rating": 2.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "The room was spacious, clean, and the bed was the most comfortable i have ever slept in.", "title": "probably not gonna stay unless i can afford a presidential suite", "helpfulness": 3, "user": "tongtong_9", "date": "July 31, 2012", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 2.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 135850651}, {"rating": 1.0, "stay_parameters": "Stayed July 2012, traveled with friends", "text": "The staff were friendly and would go out of there way to help you with anything.", "title": "Terrible, terrible, terrible!!", "helpfulness": 7, "user": "Megan L", "date": "July 31, 2012", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "location": 3.0, "service": 1.0, "rooms": 1.0}, "id": 135849576}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled on business", "text": "Rooms spacious and renovated with taste ..all the perfect except a couple of things ..if you want to use the gym there is $20 a day fee which doesn t include shower facilities which you d have to tyhat 29$ a day package which gives access to steam and whirlpool etc..so basically if you only need the gym ...you ve got to go (nice and sweaty)through the lobby the casino to the elevator to your room. Wi Fi sucked ..i don t know if its a way to make get out of your room!! i had to buy a kit which they have available in the room for $12 to connect by wire to the net..the internet was free ..but if you don t have a labtop..well. By the way funny thing signal was very good in the lobby. But the rest was awesome!", "title": "just what you would expect!", "user": "Paolo1005", "date": "January 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 122723104}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "We stayed at the Bellagio for 12 days in May 2011 as we had chosen to get married here and we had a fabulous time.", "title": "Bellissimo Bellagio", "helpfulness": 2, "user": "foxyreds", "date": "January 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 122717083}, {"rating": 2.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "The hotel staff were wonderful throughout and helped make our stay really special.", "title": "Iconic hotel but terrible terrible service!", "helpfulness": 4, "user": "Ginsengwu89", "date": "January 7, 2012", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 1.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 122695792}, {"rating": 5.0, "stay_parameters": "Stayed August 2011", "text": "We had a fabulous corner room overlooking the fountains. The bed was really comfy and the bathroom was lovely and spacious.", "title": "Probably the best in Las Vegas!", "user": "Calyan", "date": "January 7, 2012", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 122695177}, {"rating": 2.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "We especially enjoyed spending time in the piano bar near the lobby, the pianists were very talented and it was a great spot to enjoy a drink and do some people watching.", "title": "no lights no fun", "helpfulness": 2, "user": "nytravels", "date": "January 7, 2012", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 2.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 122694966}, {"rating": 1.0, "stay_parameters": "Stayed July 2012, traveled solo", "text": "What a horrible experience. I overlooked the bad reviews and still booked at the Bellagio. We stayed in the Penthouse Suite, which makes you a VIP quest. The room was dirty, the drapery did not work and was stuck open which allowed all the light from Vegas in. Even after an \"Engineer\" promised it would be fixed in the morning, let me just say it never got fixed. The carpeting in the room is marked with dirt, half the lighting in the room didn't work. The lamp shades had holes in them. I don't normally complain, nor feel tempted to complete a review, but in this case I HAVE TO! Now the food was great, some of the staff was wonderful, the spa was great. Visit and don't waste your money staying. PENTHOUSE SUITE. What a joke! Oh, ya - the hotel also added false charges to my bill that I am still disputing the charges and will rely on American Express to step in", "title": "VIP Rooms Penthouse - Stay somewhere else!", "helpfulness": 7, "user": "uGetwhatUgive", "date": "July 30, 2012", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 3.0, "rooms": 1.0, "location": 3.0}, "id": 135842400}, {"rating": 4.0, "stay_parameters": "Stayed July 2012", "text": "Among the top LVNV resorts, the Bellagio doesn't disappoint.  Newly renovated rooms are comfortable, large, wired for the digital age with interesting decor that doesn't offend.", "title": "Yes, it deserves it's reputation", "helpfulness": 2, "user": "Todd H", "date": "July 30, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 135835194}, {"rating": 5.0, "stay_parameters": "Stayed July 2012", "text": "We arrived at 11:20 pm local time to a crowded lobby. Figuring out how to get in line to check in was definitely a challenge and clear as mud.", "title": "Good break", "user": "Antz517", "date": "July 30, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 135831312}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled on business", "text": "The Chihuly sculpture, the centerpiece of the arrival experience, is beautiful and impressive. Definitely a place to take photos.", "title": "One of the better hotels on the strip", "helpfulness": 1, "user": "Line123", "date": "July 30, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 135797979}, {"rating": 4.0, "stay_parameters": "Stayed July 2012", "text": "Once figuring out if you are in line the check-in is efficient.  The front desk staff were friendly and energetic.", "title": "Beautiful hotel but pricey...", "helpfulness": 1, "user": "Kat W", "date": "July 30, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 135792010}, {"rating": 5.0, "title": "Great Place to watch the beautiful Fountains - Tight Slots", "text": "The Gambling here is extremely tight if you play slots. Played in several Casinos as we walked on both sides in between Luxor down to Bellagio’s and crossed over to Bally’s and walked back toward MGM. Played slots in every Casino we went in and spent about 6 hours and didn’t get any of the bonus round on some of the Konami Games or Quick Hit Games we played; which is very surprising. The machines are very tight on the strip and Bellagio is no different; if they are trying to attach the Gamblers, they surly are missing the mark. Play the table games and you might be able to get some value for your gambling money. I am not sure why all the Casinos have made the slots so tight that you get no play for your money. I know the Slots are the Casinos Cash Cow, but if they don’t loosen the machines a little where you can get at least play for your money, they will lose those players. It’s kind of sad the way all the Casinos have gone to very tight slots…and they wonder why their business is down on the gambling side? The true Gamblers have given up on the Strip and on Las Vegas because there a lot other places to go across America where you can gamble and you actually get gambling value and play for your money. Overall it’s a nice place to visit and site see; but gambling should be somewhere else.", "user": "KarenTravelLover", "date": "November 11, 2012", "id": 145176703}, {"rating": 5.0, "title": "Best place to stay in LV", "text": "We have stayed at most hotels in LV. We always come back to Bellagio, rooms are very nice and have little touches that are appreciated. Each night the maid returns and changes towels, closes curtains and puts on music and lights. Beds and pillows are great. Getting around - the self parkings is right off strip and easy to access. You come out right at registration. Casio is good, could use a bit more updated machines. No loud music to condend with. Piano bars are great. Buffett was great.", "user": "jandol", "date": "November 11, 2012", "id": 145171631}, {"rating": 5.0, "title": "Best Hotel on the strip", "text": "Loved the environmental awareness practiced at this hotel without the \"in your face\" feel. Nice clean rooms. Great table and slot play. The lounge areas are a nice way to chill during your trip, the drink prices could be better tho. I liked the overall feel and would gladly stay here again.", "user": "130DWC", "date": "November 11, 2012", "id": 145163721}, {"rating": 4.0, "title": "Nice place to sleep...", "text": "We hardly spent any time in our room, but it was a nice place to sleep none the less. Being that this was such a huge hotel it took a long time to get back to the room. Forget about running back up to the room to get something that you forgot if you are in a time crunch. My family had a view of the fountains from their room and I highly recommend that as it makes for a mesmerizing view. Our view wasn't much to speak about.", "user": "phiflyers", "date": "November 11, 2012", "id": 145163566}, {"rating": 5.0, "title": "Bellagio", "text": "The room had been recently updated when we stayed here and it was very comfortable and quiet. The hotel is conveniently located on the strip and we would definitely consider staying here again when visiting Vegas.", "user": "Tri P", "date": "November 10, 2012", "id": 145118736}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "We were on the 26th floor, overlooking the fountains, and it was great; and definitely worth the extra cost. By seeing the fountains from above, you really can appreciate the fantastic show that is put on. We saw the Celine Dion show (very entertaining) at Caesars, so the Bellagio was very convenient.", "title": "Splurge for the fountain view", "user": "EncinoCaCPA", "date": "January 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 122787347}, {"rating": 3.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "We stayed here over Christmas and although we paid for an executive suite with private check in and line pass this was not explained on arrival (defeating the object)", "title": "Good but not great", "user": "Martyn28", "date": "January 8, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 122753841}, {"rating": 4.0, "stay_parameters": "Stayed June 2011", "text": "Overall the hotel looks and feels 5 star, but the sheer size and the numbers of non staying visitors makes for a frustrating and chaotic experience.", "title": "Nice hotel and traditional decor but may stay elsewhere next time.", "helpfulness": 2, "user": "Waterm", "date": "January 8, 2012", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 3.0, "rooms": 3.0}, "id": 122753812}, {"rating": 2.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "Room was nice, but ice maker and mini bar didn’t work and panel off the bath was disappointing. Long waits when ringing to housekeeping, front desk, concierge was annoying. A few issues with late room cleaning took the shine off what would have been a nice visit.", "title": "Disappointing due to rude staff and tired appearance", "helpfulness": 2, "user": "MrsSee", "date": "January 8, 2012", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 1.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 122748994}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "The casino floor was very smokey, even for someone who once smoked although you cannot deny the buzz and excitement in this area. The spa and fitness room are very nice.", "title": "Very good hotel", "helpfulness": 1, "user": "vistee", "date": "January 8, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 122748356}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "My wife and I spent a night at the Bellagio. We were upgraded to a suite, which had THREE bathrooms. Great HD TV in the living room where we sat overlooking the city from the 30th floor while we watched the Olympics. Not bad for $300 (with tax). We really like being treated special, and we were.", "title": "We wereare blown away", "helpfulness": 2, "user": "grapdad", "date": "August 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 136056565}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "Can't wait to come back.", "title": "Blissful nights sleep", "user": "Langton_Traveller", "date": "August 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 136046964}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "We drove here and used self-park. Access to the car park is easy to find and parking so plentiful that valet parking is unnecessary. Reception was busy, but once we'd hopped between a couple of lines and they'd opened some more stations check-in was really quick. We were up-graded to a larger room, which turned out to be really spacious.", "title": "Classy, but....", "user": "Magistrand", "date": "August 2, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 136030204}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "We were very impressed with the standard of the room - everything about it was quality, particularly the beds. It must rank as the most comfortable bed with the best linen I've experienced in a hotel. It was quiet at night, and we heard nothing from outside resulting in a blissful nights sleep. The hotel Cafe Gelato is fine to pick up a breakfast coffee and pastry - handily positioned on the way the way to the pool. The pool areas are large, with plenty of sunbeds and a great place to while away a few hours in the sun.", "title": "Beautiful", "user": "luckyone3", "date": "August 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 136016233}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "Dining in the hotel seemed pricey. For family dining we enjoyed getting out to places like The Cheesecake Factory across the road in Caesars, which offers more choice at reasonable prices.", "title": "Spectacular", "user": "Joe H", "date": "August 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 135989923}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled solo", "text": "The Bellagio is nice - very nice - but it lacks the wow factor one expects. Rooms are nice, too, but little flaws make prevent the experience from being great. For instance, there's no coffee in the rooms, and the nearest cafe takes nearly 10 minutes to walk to. Mind you, there's are tons of overpriced mini-bar items spread all over the room. It's stuff like that - decisions made to benefit the casino, rather than the guests - that make the Bellagio into a bit of an annoyance rather than a great experience.", "title": "Nice, but...", "helpfulness": 2, "user": "tedstevens42", "date": "April 19, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 158203008}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled on business", "text": "Regular fountain view is to the side of the fountains, these rooms can on certain nights be noisy from the bars next door at the Cosmopolitan. Otherwise, very enjoyable. Buffet was expensive and not very good. Bellagio is a beautiful luxury hotel. Pools are amazing, atmosphere is wonderful. Upscale clientele.", "title": "Fantastic", "user": "cwilsonOhio", "date": "April 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 158202725}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "Family and friends recommended the Bellagio when we started planning our trip to Las Vegas. Everything about the hotel is beautiful. The room, the lobby, the conservatory.... Watching the fountain show from our room was exciting and well worth the cost. The hotel is located within walking distance to so many places. Perfect!", "title": "Excellent hotel", "user": "Diana C", "date": "April 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 158192704}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "We stayed 6 nights at the hotel to celebrate our 10th wedding anniversary. Our room on the 11th floor overlooked the fountains - lovely. Buffets are good value, more expensive at the weekend for brunch. Go early to avoid the queues!!The ice cream was heavenly - especially the peanut buuter flavour - what a find!! The pool can get very busy and sun loungers in the shade are very hard to come by so go down early and secure your spot. There are water coolers placed around the pool which keep you hydrated in the desert sun.", "title": "The best hotel in Vegas", "user": "Nicola F", "date": "April 19, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 158185237}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled on business", "text": "Reception area is always very busy as are the main walkways. It can smnell a bit smokey in peak times at night.", "title": "Surprisingly inviting, if higher priced", "user": "HepAdvisor", "date": "April 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 158162616}, {"rating": 5.0, "title": "Wow", "text": "Wow stayed here with my family and had the best time. Great location as Bellagio was the heart of Las Vegas and the strip. Had a monorail train that took you to Montecarlo casino the crystal shopping mall and vdara this was very useful.", "user": "Rita V", "date": "August 25, 2013", "id": 173892674}, {"rating": 4.0, "title": "Almost a 5 star experience", "text": "Pool was absolutely amazing and the pool cafe was lovely. We would of preferred more places to be able to eat in the casino.", "helpfulness": 3, "user": "N M", "date": "August 25, 2013", "id": 173879662}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "This hotel is great. We stayed here for 3 nights and the first 2 nights were perfect. First the good. Great central location. Great decor and room condition. Great selection of restaurants. If you stay here try the croissants from the pastry/coffee place at the north exit main floor. Now the bad and there was only one and this is what soured my review. On the check out day we had forgotten to put the privacy sign out and forgot to lock the door so at 8:30 AM we had very loud visitors in our room. They came in without knocking, yelled and before I could get out of bed to check who it was they left. This happened again at 9:30 as well. It was the housekeeping staff asking if we were checking out today. In all my stays at a hotel (which are quite a few) this has never happened. I think the housekeeping staff should know who's checking out and if they've checked out and regardless should not go around entering rooms without knocking at 8:30am. So yeah, if it wasn't for this I would have given the hotel 5 stars.", "title": "Overall a nice stay despite few hiccups", "helpfulness": 5, "user": "KFamilyNewJersey", "date": "August 24, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 173871438}, {"rating": 4.0, "stay_parameters": "Stayed August 2013", "text": "We enjoyed our stay at Bellagio. The rooms were quite nicely done with big bathroom containing all the fine amenities. Everything about the hotel was on a grand scale but then, this is what one would expect from Vegas - over the top! Nevertheless, I wish hotel management would improve their check in process. It took us almost 30 minutes to check-in which was quite irritating after a long flight from east coast. If I am paying top dollar for my stay, I want my check-in to be smooth & quick. We chose to stay in spa tower which is a bit of a walk from main casino and restaurants, however we did not regret our decision as the rooms were much quieter and traffic less intense. The housekeeping service was top notch and done twice a day. We asked for firm pillows & extra toiletries, they gladly brought those to our room promptly. The pools were nice but crowded most of the time. I tried their fitness center/gym twice and found it to be more than adequate for my needs. The hotel boasts of quite a few fine dining options and we enjoyed some of our memorable meals there. However, I do feel they should improve their service. The restaurant staff attitude seemed cold & unfriendly on many occasions. On most afternoons, we loved our coffee & pastry at Jean Philippe. It is one of the finest patisseries we have been to. Don't miss the fountains in the evening. Overall a nice stay.", "title": "Almost 5 star, almost.", "helpfulness": 2, "user": "Smittzel", "date": "August 24, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 173853569}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled solo", "text": "Stated one night in a central premium fountain view room. Everything wss great except reception forgot to unlocked my minibar which took a while for them to fix. The views were great. Possibly just a tad high if you're after good photos of the fountain.", "title": "Exceptional Live Jazz in Lounge at Baccarat Bar", "helpfulness": 1, "user": "DawnStarr", "date": "August 24, 2013", "detail_rating": {"value": 3.0, "location": 5.0, "service": 5.0}, "id": 173818045}, {"rating": 5.0, "title": "Still got it's stuff!!!", "text": "I have probably reviewed the Bellagio before as we have stayed here often. We have stayed at most of the higher end properties on the strip and seem to always come back here.", "user": "Msk6261", "date": "November 12, 2012", "id": 145271798}, {"rating": 5.0, "title": "Perfect location - great hotel!!", "text": "I just wanted to say that this resort is still one of the best in the area. Our Spa Tower room has been completely remodeled and renovated since we were here last year.The style of the furnishings before was more to my liking but no one can doubt the caliber of what they have installed. Everything was modern, shiny, clean and fresh.", "user": "jodi a", "date": "November 12, 2012", "id": 145268192}, {"rating": 5.0, "title": "Relaxing and Family friendly", "text": "Beds, linens and towels are first quality. The new design offers every convenience for modern technology (aka.....lots and lots of conveniently located plugs.....yea! This is a hotel pet peeve of mine).", "user": "Jan K", "date": "November 12, 2012", "id": 145247483}, {"rating": 4.0, "title": "Hot Room", "text": "Food options are not so hot. The Bellagio Cafe is badly in need of an update and some of the food items we ordered were definitely \"off\". Not much else available if you don't want a buffet or to eat your breakfast on your lap in the hallway. Most of our restaurant choices were at other properties but the location of the Bellagio and the convenient tram make that easy.", "user": "Debra2011", "date": "November 12, 2012", "id": 145241489}, {"rating": 5.0, "title": "Beautiful Hotel", "text": "And even when we stay elsewhere, my husband tends to come here to play at the Bellagio tables anyway.", "user": "betsysp", "date": "November 12, 2012", "id": 145237613}], "location": {}, "stars": 5, "variance": {"poor": 198, "average": 571, "very good": 1770, "terrible": 145, "excellent": 5408}, "aka": "Bellagio Las Vegas Hotel", "slim_ranking": 0.0333333333333, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 5.0}, "description": "Inspired by the villages of Europe, AAA Five Diamond Bellagio overlooks a Mediterranean-blue lake in which fountains perform a magnificent ballet. Within Bellagio are award-winning dining experiences including two AAA Five Diamond restaurants, Julian Serrano's Picasso and Le Cirque from the renowned Maccioni family. The resort’s retail promenade, Via Bellagio, includes the luxury shops of Giorgio Armani, Gucci, Tiffany & Co., Prada, Fred Leighton, Chanel, Dior, Louis Vuitton, Fendi and Bottega Veneta. A world-class art gallery, exquisite Conservatory, Cirque du Soleil’s stunning performance of “O,” sumptuous spa and salon and elegant casino add to the extraordinary Bellagio experience."}