{"user_rating": 4.5, "review_count": 257, "name": "Bellesuite Rome", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed December 2005", "text": "As a family of 5 we went to Rome as a surprise for my dads 50th birthday. We stayed at the Bellesuite Rome for 3 nights over new years and enjoyed our time there.", "title": "Roma bella!", "helpfulness": 16, "user": "jmepani", "date": "January 7, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "service": 5.0}, "id": 4330111}, {"rating": 5.0, "stay_parameters": "Stayed December 2005", "text": "Alessandro and the rest of the staff were very helpful and welcoming, we had free internet access, maps, and the staff were happy to make reservations on our behalf.", "title": "Perfect location, beautiful room", "helpfulness": 3, "user": "JetSetJeny", "date": "January 5, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4326987}, {"rating": 2.0, "title": "Ok but wary of the location", "text": "However the only negative point is that my parent’s room was on the same floor as the reception and I shared with my sisters on the 3rd floor. The difference in the quality of the rooms is very noticeable and my parent’s room had basic decor in terms of the room and bathroom, also there was no shower curtain. On the other hand my room had a flat screen TV, DVD player and was very comfortable and matched the photos on the hotel site. I cannot say if all rooms on 2nd floor were like this but I would advise requesting a room on the 3rd floor if you are staying here. (Unfortunately didn’t take pics of the basic room)", "helpfulness": 9, "user": "A TripAdvisor user", "date": "December 18, 2005", "id": 4250036}, {"rating": 4.0, "stay_parameters": "Stayed November 2005", "text": "The other comment I would like to make is the basic choice of breakfast which was now in fact being served in a room on the second floor and not in the Target restaurant as previous visitors have experienced. If you like cereal and pastries this is OK, but not for those that like a hearty hot breakfast.", "title": "A central oasis", "helpfulness": 8, "user": "l1n", "date": "December 2, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 4158218}, {"rating": 5.0, "title": "Fantastic place to stay !!", "text": "Lastly we found the area to be perfectly safe with a good range of shops and restaurants around the corner of the hotel. All the sites are in walking distance (15-20mins to colosseum, capitoline museum, palatine hill, forum) and about 45mins to vatican city. It is a city centre to be walked and we did not have to take the cab or the metro anywhere. I would easily stay here again if I come to Rome.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "December 2, 2005", "id": 4157801}, {"rating": 4.0, "stay_parameters": "Stayed February 2006", "text": "good location near the station, near the via Nationale, correct room, shower a little bit too small for 1,89 meter, every-one very kind, but breakfast is very bad, at 9 o'clock no bread anymore, but i will return !!", "title": "almost perfect", "helpfulness": 1, "user": "wimpiot", "date": "February 8, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 5.0, "service": 4.0}, "id": 4446330}, {"rating": 4.0, "stay_parameters": "Stayed January 2006", "text": "Weekend stay at the Bellesuite, chosen largely as a result of the positive postings on Tripadvisor.", "title": "Excellent choice", "helpfulness": 5, "user": "Papofurado", "date": "February 2, 2006", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 5.0, "service": 4.0}, "id": 4409902}, {"rating": 4.0, "title": "great hotel centrally located", "text": "I'm happy to endorse most of the positive comments in that the hotel is centrally located and maintained to a high standard - the room we had was immaculate and tastefully decorated/furnished.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "January 17, 2006", "id": 4358320}, {"rating": 5.0, "stay_parameters": "Stayed October 2005", "text": "Be warned, however, that the reception is on the second floor.", "title": "Very Good Hotel with Great Service", "helpfulness": 13, "user": "christy74", "date": "January 10, 2006", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 4.0, "service": 5.0}, "id": 4335359}, {"rating": 5.0, "stay_parameters": "Stayed December 2005", "text": "We also found the hotel difficult to find in the dark - the street in which it is located is not well lit. We arrived late in the evening, deciding to walk from the Terminee (straightforward) and found the street easily enough, but we found the hotel quite difficult to locate - it does not have an illuminated sign, and enquiries with a number of 'locals' drew blank expressions when asking for directions to the hotel. In fact, we had passed the hotel several times before a receptionist from another nearby hotel helped us find it!! We saw the small sign for the Bellesuite next morning on our way out sightseeing.", "title": "Great location & staff", "helpfulness": 19, "user": "Tiggr6381", "date": "January 8, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 4330533}, {"rating": 5.0, "stay_parameters": "Stayed October 2005", "text": "My Wife and I spent 3 nights at the Hotel based on reviews from Tripadvisor and enjoyed it very much. The staff are excellent and very attentive. They called ahead to make reservations for us at the Accademia in Florence to see David. The rooms are modern and clean. The free internet was a nice touch and allowed us to get our emails daily. Breakfast at the Byron was a great way to start the day. We found the area to be very safe and we never felt uneasy walking around at night. The hotel is well located and very close to all the attractions if you don't mind walking and exploring. Get the city map from the front desk and you'll be fine. Trevi fountain and the Spanish Steps are about 15 min walks. There are numerous restaurants and gelateria's so you won't look long for a place to eat. We highly recommend this hotel to anyone staying in Rome, especially if you will be using the train stn. It's only a 10 min walk over rough streets or a 4 min/$14.00 E cab ride!! If you were staying across town, that might be the end of your spending money.", "title": "Excellent Hotel!!", "helpfulness": 6, "user": "Lumelux", "date": "November 8, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4094232}, {"rating": 5.0, "stay_parameters": "Stayed October 2005", "text": "I've just returned from a whirlwind weekend stay in Rome and so much wanted to pay compliments to the Bellesuite. We arrived early at the hotel, and was shown to our room with no hassle. Lovely modern and very clean room with very large and comfortable bed. All the staff were really nice and even reminded me when returning late Saturday night to turn my watch back by an hour (due to daylight saving). Breakfast at the nearby George Byron cafe was a treat too. The only slight negative was the small size of the bathroom. Loved this hotel!", "title": "A quiet oasis in a busy city", "helpfulness": 9, "user": "MrsMungo", "date": "November 2, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4081084}, {"rating": 5.0, "title": "Great Place to Stay in Rome", "text": "My wife and I were traveling in Italy for our honeymoon, with Rome being the last stop. We found the Belle Suite on the internet and booked it solely based upon a link on the internet. Although it was a little tight for the shuttle bus (one one of Rome's notoriously narrow lanes), we found the amenities and service to be top notch. Allessandro met us at the entrance and helped us carry the bags to the elevator and our room. We actually checked in a and got settled before presenting credit cards, etc!!", "helpfulness": 23, "user": "A TripAdvisor user", "date": "October 24, 2005", "id": 4047057}, {"rating": 5.0, "title": "book it asap!!!", "text": "Take comfortable shoes.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "November 24, 2005", "id": 4142227}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "Great little hotel with a 5 minute walk from the Termini station. We loved the staff who spoke English very well and gave us good information about the area. The breakfast that was included, was the perfect start to our day and the hotel was close to many other restaurants for lunch and dinner.", "title": "Charming with good location.", "helpfulness": 2, "user": "Tacoma_Gritty", "date": "February 18, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 13663389, "likes": {"liked": "— Location.", "disliked": "— Hard to see, at first."}}, {"rating": 4.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "BelleSuite was a little difficult to see from the street, but once you we're buzzed in and on your way up the old lift, the hotel was very clean and secure.", "title": "Perfect for a weekend break in Rome", "user": "JaneLondon_UK", "date": "February 12, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 3.0, "location": 3.0, "rooms": 4.0}, "id": 13506187, "likes": {"liked": "— Cleanliness and decoration of room", "disliked": "— Not clear from the outside where the hotel is - no sign easily visible"}}, {"rating": 4.0, "title": "A good stay at the BelleSuite", "text": "We'll visit again.", "user": "Pilgrimgreen", "date": "February 12, 2008", "id": 13489597}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled with family", "text": "We have just returned from a weekend stay at the Bellesuite. I can definitely recommend it...although we were initially concerned from the outside. We had to walk up and down the street in the dark a couple of times before we figured out where it was as there is no sign outside to show it is a hotel - just the name next to one of the doorbells of an appartment block - the BelleSuite is on the 2nd/3rd floor of the building. However once we eventually found out where we needed to be and got checked in, the hotel itself was excellent. The bedroom was very clean and tastefully decorated. The staff were friendly and helpful (although they could only speak basic English) and the hotel is literally round the corner from the nearest underground station. Breakfast was nicely presented. We would definitely consider staying at the BelleSuite again if we return to Rome in the future...especially now we know how to find it!!!", "title": "Would stay again", "helpfulness": 1, "user": "yldwest", "date": "February 5, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 13294326, "likes": {"liked": "— staff & location"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "Just back from a two night stay at the BelleSuite - really enjoyed it.", "title": "Great hotel!", "helpfulness": 4, "user": "ndm77", "date": "January 22, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 12886796, "likes": {"liked": "— Clean, well-designed room.", "disliked": "— Nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "We stayed in this hotel for a weekend break in February. While it is located near to metro stations we felt that everywhere was walkable to the hotel.", "title": "A great place to stay in Rome", "user": "122309d", "date": "May 6, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 5.0, "value": 3.0, "rooms": 4.0, "location": 3.0}, "id": 15701554, "likes": {"liked": "— size of the room"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled solo", "text": "The layout of the hotel is a little disjointed but this infact made it feel like we were staying in our own apartment. The rooms were spacious and clean. The windows had electric shutters which shut out most of the noise from the street.", "title": "Great location and friendly service", "helpfulness": 2, "user": "vincent_sg", "date": "April 3, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 14766295, "likes": {"liked": "— Location", "disliked": "— Signage"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "One tip for Rome, book your trip to the vatican prior to going as the queues can last for hours even if you get up early! Also the pantheon is an absolute must!", "title": "Perfect stay", "helpfulness": 3, "user": "kirbycooper", "date": "March 13, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 14269653, "likes": {"liked": "— Modern, clean, friendly hotel"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "I just returned from a 8 days trip to Italy, of which 2 days was at BelleSuite (Single Room) in Rome.", "title": "Great Place", "helpfulness": 3, "user": "Nisse73", "date": "March 8, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 14139114, "likes": {"liked": "— The nice and clean rooms", "disliked": "— The hard bed"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "The location of the hotel is about 100 meters from the Repubblica Metro station. Just off the main road, Via Nationale.", "title": "Well-located quaint little hotel", "helpfulness": 2, "user": "Aviator26", "date": "March 7, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 14128370, "likes": {"liked": "— Location", "disliked": "— Small elevator!"}}, {"rating": 3.0, "stay_parameters": "Stayed February 2006", "text": "We booked this hotel on the strength of the glowing reports it had received on this site. The hotel is extremely clean, the rooms are comfortable and modern. It is well situated within walking distance of Termini Station and it is easy to walk to all of the central tourist attractions (only the Vatican is too far on foot).We are not the type of travellers to be fussing around the staff finding out their names/asking for recomendations etc.. so cannot comment except to say that they were courteous, pleasant and efficient which is all we ask. We checked in at the Hotel Adler desk which is on the second floor of the building, then we were taken up to the third floor, which is the Bellesuite. Breakfast is in a tiny room on the second floor and consists of cereals, croissants, cakes, juice etc.. very basic fare. All in all, a pleasant stay in what amounts to a business type hotel. If you are looking for a reasonably priced place for a couple of nights this place fits the bill, but dont be taken in by the romantic praises of some of the reviews otherwise you will be disappointed.", "title": "Well situated business hotel", "helpfulness": 8, "user": "hesketh27", "date": "February 22, 2006", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "service": 3.0}, "id": 4477662}, {"rating": 5.0, "title": "Brilliant little hotel.", "text": "General Tips - there is little in the way of nightlife in the vicinity of the hotel (bars etc..) best place is Flann O'Briens Irish Pub on the Via Nazzionale just round the corner from the Bellesuite. It is always busy with a nice mix of locals and tourists. It also serves good quality food throughout the day. If you are using a budget airline to Ciampino Airport, book your coach transfer to Termini on the Terravision website and walk it from the station to the hotel. When returning give yourself plenty of time to get back to the airport - coaches can get very full and the traffic in the morning can make the 30 minute journey to the airport much longer.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "February 20, 2006", "id": 4472977}, {"rating": 3.0, "stay_parameters": "Stayed February 2006, traveled on business", "text": "Enjoy your trip to Rome - we certainly did!", "title": "Note: Big Changes Have Taken Place Here", "helpfulness": 3, "user": "Awarely", "date": "February 14, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 4460473}, {"rating": 1.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "Based on the good reviews the Bellesuite had received here on tripadvisor.com, my husband and I decided to stay at this hotel during our honeymoon.", "title": "Nosiy, bug infested hotel in a state of disrepair", "helpfulness": 3, "user": "chickles", "date": "January 2, 2009", "detail_rating": {"front_desk": 1.0, "business": 5.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "location": 1.0, "rooms": 1.0}, "id": 23205070, "likes": {"liked": "— Free internet so we could find a new hotel.", "disliked": "— Everything else."}}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "Unfortunately, this was a MAJOR mistake.", "title": "Great location and staff!", "user": "DH_Spore", "date": "November 7, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 21618097, "likes": {"liked": "— Location and Alexandro!", "disliked": "— Bed was a little soft."}}, {"rating": 4.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "After requesting a quiet room, they put us in a room that was 30 feet away from Via Modena, which is a major street. The windows didn't shut, so it was very noisy… not at all what we requested. There were also tons of mosquitoes in the room, the sink didn't drain in the bathroom, and the shower was broken. Please see my attached pictures.", "title": "Convenient location", "user": "kikizzy", "date": "October 1, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 20543820, "likes": {"liked": "— close to termini and metro", "disliked": "— lack of view"}}, {"rating": 3.0, "stay_parameters": "Stayed September 2008, traveled with family", "text": "We asked for another room, but the only other available room was directly next door, where the windows shut just as poorly as the first room.", "title": "Location ace, accomodation average", "user": "Claire_murray", "date": "September 12, 2008", "detail_rating": {"front_desk": 4.0, "service": 2.0, "cleanliness": 2.0, "value": 2.0, "rooms": 2.0, "location": 4.0}, "id": 20012354, "likes": {"liked": "— Location", "disliked": "— Problems with service"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled with friends", "text": "Finally, after hours of complaining, they put us into a new room that was on the inside of the building, but in a totally different hotel completely (the Adler Hotel), which is just one floor below the Bellesuite. This room was very small and barely could fit the bed in the room with more than 2 feet to walk in around two sides of the bed. There was a small wardrobe with no safe (nor was there a hotel safe), no deadbolts on the door, and more mosquitoes.", "title": "Great Hotel and Service!", "user": "GreeceCruise", "date": "September 2, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 19675087, "likes": {"liked": "— The large room...", "disliked": "— The breakfast..."}}, {"rating": 5.0, "title": "Perfect Bellesuite !!", "text": "The location, near the Plaza Republica, is about as convenient to EVERYWHERE in Rome as you would need. If you don't wish to walk, the hotel staff will call you a cab.", "helpfulness": 20, "user": "A TripAdvisor user", "date": "September 19, 2005", "id": 3914361}, {"rating": 5.0, "title": "Excellent Stay", "text": "As a manager/conceriege, Allessandro is the best. He helped us with whatever we needed. Breakfast is served around the corner at a lovely bakery/cafe. The 'Target\" restaurant nearby might possiblly serve the best food in Rome.", "helpfulness": 15, "user": "A TripAdvisor user", "date": "September 16, 2005", "id": 3909882}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled solo", "text": "I stayed at Bellesuite Rome few days in this august. It's a fabulous tiny hotel in the center of rome. You can enjoy quiet and relaxing atmosphere though it's just off Nazionale street. The rooms were nice and clean. I found so unique to have a breakfast at their balcony with a fountain. The staff was so friendly and helpful to arrange for me a pick up service at the airport, train tickets, restaurants, etc... I really had a great time there and would definitely come back!", "title": "a small oasis in rome", "helpfulness": 1, "user": "pic77", "date": "August 31, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 19587082, "likes": {"liked": "— atmosphere", "disliked": "— building elevator"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "We stayed at BelleSuite for 3 nights as part of our honeymoon. With the dollar being so bad, we really tried to find inexpensive hotels that were still very nice. And we were very happy with BelleSuite. My husband LOVED the old style elevator (although at first it scared me, after I got used to it, it was fun). The people at the front desk were always welcoming and helpful. The room was large for city standards and the bathroom was especially nice. The breakfast was a little odd. Mostly crackers/toast with prepackaged meats. They did have a tasty selection of juices though. The location was also great. Just steps away from the metro and within walking distance to everything. We walked everywhere. Oh, and they had free internet!! That was such a welcome surprise. We really enjoyed our stay and would recommend to anyone traveling to Rome.", "title": "Great location, lovely hotel", "user": "laurendavis", "date": "August 10, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 18818632, "likes": {"liked": "— Location, staff, modern decor", "disliked": "— nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "Overall I had a positive experience at this hotel. The scenery is beautiful, the staff was kind, the rooms were well-equipped, and the food was excellent.", "title": "Had a good time", "user": "scarg0", "date": "July 24, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 18190548, "likes": {"liked": "— ok", "disliked": "— n/a"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2008", "text": "Bellesuite is a clean hotel that represents good value in a city like Rome where good hotels are very hard to find. I stayed at Bellesuite on two separate occasions over a one week period in late May. I had the opportunity to see three different rooms as we had friends traveling with us during the first part of our stay. Some things to point out:", "title": "Nice stay for the price", "user": "towsonnc", "date": "June 2, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 3.0}, "id": 16609673}, {"rating": 4.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "1. the service is good and employees are friendly even with broken english some of the time.", "title": "Met All Expectations", "user": "PatriciaF", "date": "May 18, 2008", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 4.0}, "id": 16182170, "likes": {"liked": "— Location/Location/Location", "disliked": "— Odd bathroom configuration"}}], "location": {"country": "Italy", "region": "Lazio", "continent": "Europe", "city": "Rome"}, "variance": {"poor": 6, "average": 16, "very good": 94, "terrible": 4, "excellent": 137}, "aka": "Bellesuite Rome Hotel Rome", "slim_ranking": 0.338595106551, "description": "Bellesuite Rome is an elegant and quite property situated by the third floor of an ancient late 19th century building .The interior decor in harmony with modern , classical and comfort style : Bellesuite Rome will be your home ...away from home....Vi aspettiamo...."}