{"user_rating": 4.5, "review_count": 765, "name": "Bellasera Hotel", "reviews": [{"rating": 3.0, "title": "okay", "text": "Very nice place maybe in the wrong location * very loud at night and somtimes to load you cant sleep . pool area has no sun in the middle afternoon but other wise very nice place and lot of people would enjoy this", "helpfulness": 4, "user": "A TripAdvisor user", "date": "March 2, 2005", "id": 3241152}, {"rating": 3.0, "stay_parameters": "Stayed January 2005", "text": "A nice hotel in the WRONG location. If you want to be in Old Towne Naples, the Bellasera is just a few blocks too far away. You have to cross a 6 lane highway that takes forever and then walk a few more blocks. It isn't a far walk -- it's just that you do not feel a part of Old Towne Naples. The hotel itself is very clean and a great set up -- granite counter tops in the kitchen which was immaculate and completely stocked --- but we checked out and moved to the Inn on Fifth after one night when a room became availalbe there. Also, the staff there was nice but they all sounded programmed with a script. Just seemed like a junior league place. Also, didn't like that it was sort of set up like a motel. For these reasons, I would not go back.", "title": "Location, location, location: not", "helpfulness": 4, "user": "lrfolino", "date": "February 25, 2005", "detail_rating": {"cleanliness": 5.0, "rooms": 5.0, "value": 4.0}, "id": 3230103}, {"rating": 5.0, "title": "You feel like Royalty here", "text": "Ok, first timer here... I'm a lifetime South Floridian that has never been to the west coast until now. We decided to stay at the Bellasera because of TripAdvisor as a matter of fact. I did much research and found the Bellasera to be the best for my money. (By the way, do not book this hotel through any secondary websites, go right to the bellasara website, you'll save lots of money!!) Arriving to the hotel, we passed it, the hotel does sneak up on you and it's in a place where i didn't expect. right off 41. Do not expect a large luxourious hotel like I did. It is nice, but there are only 2 floors. The only negative I heard about the hotel is the fact that it's right on a major road and you can here traffic. That was a lie. I'm a light sleeper and I slept oh so good. My room was toward the back of the hotel so maybe that played a role. Anyway, the room was spectacular. I initially went with the studio, but 2 days before my stay I changed to the 1 bedroom suite. It was unreal.. Up to date everything. Me and the wife even stocked up at Publix so we could make breakfast in the morning. It was a very relaxing getaway.. The beach was literally 3 minutes away. And shopping was 2 minutes away. Here's a tip. In the room, there is a book about Naples with directions for all the restaurants, (and theres tons of em)", "helpfulness": 13, "user": "A TripAdvisor user", "date": "February 21, 2005", "id": 3214828}, {"rating": 5.0, "title": "Best Hotel In Naples; Period", "text": "shops, and scenery. It will help you tremendously. Oh, another bonus.. they just opened a Cheescake Factory right down the road. That should convince all of you to go now..", "helpfulness": 16, "user": "A TripAdvisor user", "date": "February 14, 2005", "id": 3184597}, {"rating": 5.0, "stay_parameters": "Stayed January 2005", "text": "I first stayed at this hotel in January of 2004, and more or less stumbled onto it by accident. I had been at another of the ownership's resorts (GreenLinks), and when my party left I decided to stay around Naples for another week. The two and three bedroom models have private entrances with ample parking for simple ingress and egress. The interiors are stunningly appointed with marble and granite, and include a full kitchen as well as a washer and dryer. The living and sleeping areas are quite large and resemble condominiums and not hotel rooms. Each is furnished with a screened-in patio. Amenities include two or three televisions with cable, a DVD player in the living room, the most comfortable bathrobes you can imagine (I bought one; Hef would be jealous), and high speed internet access, although it is not wireless, so if that is a requirement, bring your own router (I did). The pool area is spacious and elegant, the workout facilities are quite nice, the Zizi restaurant is delicious, and the staff of the Bellasera is second to none. The hotel is located right in the heart of downtown Naples, close to fine shopping and a variey of restaurants. It is also central to many of the area's best golf courses including Naples Grande, The Rookery, and Hammock Bay. Bellasera is not located on the beach, nor is it an \"action\" joint; if the beach is a must then look elsewhere. What it is is a brilliantly elegant, first-rate hotel that feels like home. I have stayed there four times now and each experience has been wonderful. I have stayed at many of the finest hotels in the United States, and while Bellasera is hardly inexpensive, but in terms of its elegance, staff, accommodations, and location, it IS a real value. If you're a couple looking to get away or a foursome who needs first-rate accommodations with spacious elegance that afford some privacy, Bellasera is for you.", "title": "Great time", "helpfulness": 9, "user": "Velomedic", "date": "February 7, 2005", "detail_rating": {"value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3168463}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "Our family stayed at the Bellasera for a vow renewal ceremony. Barbara Bates the Group and Catering Sales Manager planned everything for the ceremony via email. I didn't have to worry about a thing. It was a perfect ceremony! The staff was great. The resort is beautiful and clean. They met all our needs before we even thought of them. I hope to go back again soon.", "title": "Perfection!", "user": "NewBucketList", "date": "August 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 136008138}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "Recently stayed at Bellasera for five nights in July. Very nice studio room, well appointed with tile shower and soaking tub. Staff was pleasant and very accommodating. Free bike use and courtesy van to locations within three miles was a very nice extra. Location is a quick stroll to old town Naples with its fabulous shops and restaurants.", "title": "Great location at a reasonable price!", "helpfulness": 1, "user": "graymar6", "date": "July 31, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 135935002}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "Fabulous place. Excellent service from every single employee. Beautiful pool and hot tub area, with outdoor dining area for breakfast, lunch and dinner. Fresh fruit platter for breakfast was outstanding. Very reasonable rates considering the location and all of the amenities. We stayed 10 days in June and wished we could have stayed longer!", "title": "Would live there year-round if possible", "helpfulness": 3, "user": "MinniMom2112", "date": "July 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 135015453}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "Stayed for 11 nights in June, we couldn't have been happier with the hotel, the room was very comfortable and the staff couldn't be more helpful and Omar in the bar was charming. 5th Ave is only a 5 minutes walk. I could not recommend this hotel high enough, so much so that we booked again as soon as we got back to England,", "title": "Fantastic hotel, booked again", "helpfulness": 1, "user": "hockeydizzle", "date": "July 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 134808462}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "We just returned to the Midwest from our third trip to Naples. Our family of 5 stayed at the lovely Bellasera. It was PERFECT in every way. The location can't be beat - easy easy walk to 5th Ave district with all the shopping and dining options - which we did for lunches and dinner every day. Easy easy walk to the beach - which we did several times to enjoy the sunsets. (We drove our rental vehicle there with all our beach gear the times we went all-day.) Easy walk - or bike ride on free cruiser bikes from hotel - to 3rd Street Farmers Market and more dining and shopping. The hotel itself is terrific. Spa is great - enjoyed a facial there! I don't know why their restaurant, Zizi's, isn't packed.......terrific happy hour, great service and good menu options for all meals. We enjoyed happy hour several evenings, dinner one night and lunch poolside! We also cooked some meals in the condo hotel. All the necessary ammenties of a fine kitchen set-up. Blender, serving bowls, strainer for pastas, coffee maker, etc. etc. The master closet in the 2-bedroom is nice and roomy. We used the pull out sofa for one child and it was reportedly \"comfy\" (which isn't always the case). We will be back to Naples and back to Bellasera as soon as we can! And BTW - summer in Naples is hot termperature-wise but it was HOTTER in the Midwest!! It's technically off-season in Naples during the summer months so it's less crowded and we loved it there in July! Enjoy!", "title": "Favorite place!", "helpfulness": 2, "user": "MominIOWA50362", "date": "July 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 134473846}, {"rating": 5.0, "stay_parameters": "Stayed April 2005", "text": "just returned from 5 nites at bella sera. we selected this property based on trip advisor reviews and our stay here exceeded expectations. the 1 bedroom suite was very nice, with a fully equipped kitchen with new appliances, a nice bedroom (tv), a separate living room area with tv as well, a screened in porch, and nice sized bathroom with a separate \"vanity\" area.", "title": "loved bella sera", "helpfulness": 8, "user": "napper18", "date": "April 17, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3370363}, {"rating": 5.0, "stay_parameters": "Stayed March 2005", "text": "the bella sera is clean, quiet, and well maintained. service is good and staff is helpful and friendly. location is convenient (walking distance) to naples 5th avenue restaurants and shops and no more than 15-20 minutes to north naples beaches. silverware and glasses and dishes are provided. we ate every meal \"out\"; all kinds of restaurants (some pricey) are on fifth. just \"up the road\"(north) on us 41 are also a good deal of restaurants, some more \"family\" priced.", "title": "A Wonderful Stay!", "helpfulness": 9, "user": "Docray", "date": "April 4, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3328375}, {"rating": 5.0, "title": "great family spring break", "text": "pool is nice, a restaurant is just off the pool area. we did not try it but it looked inviting especially for a drink at the outside bar.", "helpfulness": 9, "user": "A TripAdvisor user", "date": "April 1, 2005", "id": 3318320}, {"rating": 5.0, "title": "Best of the best... exceeded expectations... excellent value.. A+", "text": "all in all, a great value and would have been worth more than we paid. hopefully, bella sera remains somewhat of a \"secret\" so the crowds don't flock and the prices rise.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "March 31, 2005", "id": 3315730}, {"rating": 4.0, "title": "Outstanding value and accomodations", "text": "We stayed for 4 nights at the end of March, 2005 and found this hotel to be one of the best we have EVER stayed at. The location is close enough to the shopping, beach and fine dining of naples while being just outside of the most crowded areas. The hotel is very clean and well maintained and the staff is very helpful. Our family had no issues at all during our stay. Very highly recommended!", "helpfulness": 8, "user": "A TripAdvisor user", "date": "March 12, 2005", "id": 3268408}, {"rating": 5.0, "stay_parameters": "Stayed May 2004", "text": "We were looking for a lovely economical \"city\" hotel prior to our stay at the Ritz on the beach (another story). We learned of Bellasera via tripavisor and were delighted to find that the rave reviews were spot-on. The room was modern, spacious, beautifully appointed, clean and comfortable, albeit a bit dark. The staff accomodating, pleasant, ready and able to assist. Although not a beach hotel (just off a busy road, but please know that our room was quiet), it provided a perfect launch to days of shopping, the Everglades, Corkscrew Sanctuary (the highlight of our trip), Sanibel, etc. Our stay at the Ritz comes with mixed reviews and a hesitant recommendation, however, we have no reservation on recommending the Bellasera. A truly great stay and great value.", "title": "Great Stay, Great Value", "helpfulness": 9, "user": "ANGshire", "date": "June 19, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3576259}, {"rating": 5.0, "title": "I LOVED Bellasera!", "text": "Bellasera was a beautiful place, by far the best I've stayed in. On all counts, I'd give it five stars! The staff was friendly and always willing to help, the pool and hot tub were wonderful (and lit by the fountain, so you could swim as late as you liked), and the food from the Zizi restaurant was delicious! It was only a ten minute drive from the beach, and the staff would willingly take you there, or you could walk (the houses of Naples were gorgeous- my friend and I made up our minds that someday we would move into one of them). Bellasera wasn't far from many of our other destinations in Naples, either, whether it be shopping or dining. The rooms were absolutely wonderful, too, with very comfortable beds, big, warm, welcoming bedrooms, a kitchen that provided you with all the necessities for cooking (besides the food, of course), and clean, nice bathrooms. Bellasera was my best experience with hotels anywhere, and I will definitely return!", "helpfulness": 5, "user": "A TripAdvisor user", "date": "June 14, 2005", "id": 3550592}, {"rating": 5.0, "title": "Great Resort", "text": "This is a great find. Quite, well appointed rooms and amazing service. The Shuttle drivers were excellent.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "June 12, 2005", "id": 3544400}, {"rating": 5.0, "stay_parameters": "Stayed June 2005", "text": "Fantastic Hotel! I've used Trip Advisor in the past to make sure the hotel I will be staying at is worth it or not and I must say I am glad I checked on this site before booking some random Hotel. We had the one bedroom suite and it had everything you need (washer & dryer, full kitchen, separate dinning area, all marble), probably the best hotel I've stayed at EVER! And I'm a Consultant which means I travel a lot too! I will return to Bellasera in the future.", "title": "Excellent Hotel!", "helpfulness": 6, "user": "greekspartan77", "date": "June 8, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3539832}, {"rating": 5.0, "title": "Enjoyed our stay.", "text": "My husband and I just got back from a 4 night stay at the Bellasera Hotel in Naples. The resort is very nice. We stayed in the studio room, which was about the size of a regular hotel room. The bathroom is huge with a separate shower and jacuzzi bathtub - granite counters and a nice tiled floor. Yes, the fact that there is only a slatted window separating the bathroom from the bedroom was a little disconcerting as we each generally prefer privacy in the bathroom, but if you turn the fan on or the water, you generally can cover any sounds. The room was very clean and provided a decent size mini-fridge for storing wine, beer, munchies, etc. Our view overlooked the pool area and we had a nice balcony. The bedspread was starting to look a little tired, but all in all it was a nice room for the price. The pool area has a water fountain that constantly runs, which drowns out any traffic from nearby highway 41. The grounds are nicely manicured, which helps you to forget you are in the middle of town.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "May 24, 2005", "id": 3496916}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "Stayed here with mya familit 5 days ultimo July 2012. Very nice and spacious apartments with 2 bedrooms - well furnished. Easy parking just outside your apartment door.", "title": "Very nice apartments - small pool", "helpfulness": 1, "user": "SteRos", "date": "August 16, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 137345889}, {"rating": 4.0, "stay_parameters": "Stayed July 2012", "text": "A very small pool/pool area.", "title": "Is it hotel?, more like your own place", "helpfulness": 1, "user": "lowieEngland", "date": "August 13, 2012", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 137101852}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "The hotels is situated not fare from the main street and ther are a lot of restaurants within walking distance.", "title": "Amazing service", "helpfulness": 2, "user": "Ivona_453", "date": "August 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 136556641}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "We would love to stay there again.", "title": "Great location to Downtown Naples and the Zoo", "user": "Stmirli", "date": "August 6, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 136402531}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "My wife ad I stayed for five days towards the end of July. We arrived early but managed to grab a room, one bedroom apartment on ground floor. Room very spacious for all your needs. The location of the hotel is great and close to fifth avenue. All staff throughout hotel very helpful. We had a issue where we had to move rooms and terry on the desk was very helpful and accommodating. Also the hire of beach chairs and umbrellas was good to use", "title": "Great Staff, Good Choice for Downtown Stay in Naples", "helpfulness": 1, "user": "boyntonbeach", "date": "August 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 136133039}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "We stayed for 3 nights with our teenage daughters. Found staff very welcoming and helpful, 2 bedroomed suite spotless and high quality furnishings and fully equipped kitchen. Master bedroom smaller than I expected but v nice en-suite with spacious alcove which acted as wardrobe, suitcase storage etc. Daily cleaning was thorough and washing powder/tea/coffee etc replenished.", "title": "Very good choice", "user": "RATSOMATIC", "date": "September 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 139242313}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "Convenient location for restaurants and shops but not that handy for the beach. This wasn't a problem for us as we used hotel as a base for touring around but not sure if I would recommend it to people with younger children as I would say it doesn't really have many facilities suitable. The pool is nice but again not geared up for kids.", "title": "In one word: WOW !!!!!", "helpfulness": 1, "user": "BB_reviews", "date": "August 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 138457494}, {"rating": 3.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "We wanted to stay somewhere with a lounge/kitchen as it gets very expensive eating out all the time so the Bellasera was perfect but if you are looking for a \"romantic\" holiday or a child-focussed one, then this might not be the best choice.", "title": "Not what we expected", "helpfulness": 2, "user": "AlwaysOnLocation", "date": "August 25, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 138302738}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "Overall found this a well managed and comfortable hotel.", "title": "We liked it - cpmfortable if a little dated and limited", "user": "BWOverseas", "date": "August 21, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 137900209}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "We stayed here during our round trip through Florida. What a wonderfull place is the Bellasera to stay. The best word to describe the Bellasera and our apartment is cosy.", "title": "Naples is very nice an relaxing", "helpfulness": 1, "user": "BrownEyez35", "date": "August 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 137588533}, {"rating": 5.0, "title": "Enjoyed our Anniversary Here", "text": "My wife and I went to the Bellasera for our anniversary and we loved it.", "helpfulness": 8, "user": "A TripAdvisor user", "date": "May 23, 2005", "id": 3495224}, {"rating": 5.0, "title": "Great experience", "text": "We were like most people, a little skeptical and not sure whether the", "helpfulness": 2, "user": "A TripAdvisor user", "date": "May 8, 2005", "id": 3449936}, {"rating": 5.0, "title": "Wonderful Vacation", "text": "hotel would live up to the many good reviews. But in our opinion it did.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "May 6, 2005", "id": 3445267}, {"rating": 5.0, "stay_parameters": "Stayed April 2005", "text": "We booked a Studio suite but the hotel (knowing it was our anniversary) gave us a free upgrade to a 1 bedroom with full kitchen & comfy living room. Also they sent up a free bottle of wine to start off our anniversary only 5 minutes after we entered the door. Now it is true the hotel is right off the main road but as soon as you enter, you practically forget where you are. We had no problems with noise. Unfortunatley we didnd get a chance to swim in the pool but boy was it tempting. Everything from the bathrooms to the kitchens had top quality appliances and fixtures. Mad me want to come home and remodel. I'm not even a coffee drinker but we had such good coffee in our room that i drank 2 or 3 cups. Housekeeping comes early sometimes but they are very nice and good. The bed is huge and too comfy. Rooms come with extremely comfy robes as well. All in All it is a great place to stay. You will feel comfortable and will have a hard time finding something to complain about. We didnt get to the Zizi Rest but we did have room service for breakfast. Make sure you read fine print about gratuity and other charges. I could continue but anyway we loved it and plan to go back one day. oh, Concierge is good, fd is great (Especially Yashira (?).. You'll enjoy it.", "title": "No disappointments at the Bellasera!", "helpfulness": 11, "user": "traveldallas,pa", "date": "April 17, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 4.0}, "id": 3371100}, {"rating": 5.0, "stay_parameters": "Stayed April 2005", "text": "feel free to email me for questions", "title": "Intimate Boutique Type", "helpfulness": 8, "user": "JoyceKNewYork", "date": "April 17, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3370630}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "The condo units are beautiful. Large, updated, clean, and nicely decorated. So nice to have a kitchen and laundry in each unit. The beds could have been a little softer with nicer linens, but it was comfortable. The only real disappointment was the size of the pool. It was much smaller than it looks in the photos. It was a nice pool area and had a nice hot tub, but the pool would have been much nicer if it were twice as big. We did not eat at the restaurant on the property as there are so many nice restaurants within walking distance on 5th street. Service was average, but when my husband called back after check out to say that he thinks he left his cell phone charger in the room, the woman said \"can you call back, we are really busy right now\" and wasn't very helpful at all. It is a great value though. I think we paid about $150/night and that was a very good value for this location. The beaches are a short drive away and are very nice. Overall, I'd stay here again.", "title": "Beautiful units, great location, small pool", "user": "sunshinesaj", "date": "July 15, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 134421986}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "Bellasera is one of the nicest hotels I stayed in.", "title": "Fantastic hotel", "user": "LePope", "date": "July 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 134416594}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "We were greeted by a kind lady who warmly welcomed us to the property. Our room was great and overlooking the pool area. The bathroom is equipped with a large shower and a whirltub that separates bathroom from sleeping area. It is possible to have a bath while looking at the room and the balcony. King size bed is fantastic. Room service is perfect and they pay attention to small details such as folding the towels in shell shapes and turning the hi-fi radio to nice and easylistening radio station.", "title": "Great location, lovely hotel", "user": "jenster212", "date": "July 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 134275299}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "I got a very good price by making web reservation and mentionned incidently that we were travelling with my wife for our 30th wedding anniversary.", "title": "Excellent standards and perfect location.", "user": "JeremyKingsbury", "date": "July 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 134264861}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "A couple of minutes after checking, room service brought us a large plate of chocolate dipped strawberries with two glasses of prosecco, togethe with a handwrtittent card wishing us a geat stay in Naples for our anniversary.", "title": "Great Location.Walking distance to beach ,cvs,market and restraunts.", "helpfulness": 1, "user": "karen r", "date": "July 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 134108287}], "location": {"country": "United States"}, "stars": 4, "variance": {"poor": 11, "average": 42, "very good": 146, "terrible": 8, "excellent": 558}, "aka": "Bellasera Hotel Naples", "slim_ranking": 0.0677966101695, "detail_rating": {"service": 4.5, "cleanliness": 5.0, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "Bellasera is a hidden gem located in the heart of old Naples, which is just moments away from all the fashionable shops, sidewalk cafes, art museums, cultural attractions and Naples' world-famous shoreline. Designated by the Florida Green Lodging Program, Bellasera boasts authentic Italian architecture, studio, one-, two- and 3-bedroom condo suites, Esterra Spa, Zizi Restaurant & Lounge, outdoor pool, whirlpool spa, concierge services, fitness center, catering, meeting space and no additional resort fees!"}