{"user_rating": 3.5, "review_count": 153, "name": "Belvedere Beach Hotel", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "Run down 4 star hotel, which now struggles t o achieve 3 stars. Bathrooms are tiled with dodgy brown things and most of the electrical fittings and sockets look doubtful. Food was poor. air conditioning was faulty some of the time and hot water was not after 19:00hrs. Consider the Oceanis at Ixia before booking at the Belvedere", "title": "4 Star...... Maybe in the 1970s", "helpfulness": 10, "user": "Ohmaid54", "date": "September 14, 2006", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 1.0, "rooms": 1.0, "location": 3.0}, "id": 5799564}, {"rating": 3.0, "stay_parameters": "Stayed August 2004", "text": "Stayed at this hotel in mid-August 2004 with my boyfriend. Travelled with Apollorejser and had been looking fwd to spend an entire week at \"one of the better hotels in the city of Rhodos\" (which they claimed it to be in the catalog). This is one of the worse hotels I have ever stayed at!", "title": "A poor 3 star hotel - nothing more nothing less!", "helpfulness": 7, "user": "KrisKros", "date": "July 16, 2006", "detail_rating": {"cleanliness": 2.0, "value": 3.0, "rooms": 2.0, "service": 4.0}, "id": 5471691}, {"rating": 4.0, "stay_parameters": "Stayed May 2006", "text": "After working in Greece as a rep, I know that the standard of the hotels can be low, but this hotel was really not a 4 star hotel - more like a 2-3. The view was absolutely fantastic, the food was OK, but the hotel is really run down and the pool-area is dirty and a little bit too basic with tons of platic chairs! The staff was really friendly and helpful, but it doesn't make up for the fact that Belvedere Hotel is one of the oldest hotels in the city of Rhodos - and in terrible need for some serious re-modelling!", "title": "Good value for money hotel", "helpfulness": 9, "user": "GrahamWalsall_U_K_", "date": "July 13, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "service": 5.0}, "id": 5462387}, {"rating": 4.0, "stay_parameters": "Stayed June 2006", "text": "Unfortunately I can not recommend this hotel to anyone who wants to stay at a 4 star hotel. But to everyone who loves 2-3 stars hotels - this is a great option.", "title": "fab location", "helpfulness": 6, "user": "branty", "date": "July 8, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 3.0, "service": 5.0}, "id": 5439714}, {"rating": 4.0, "title": "Great Holiday", "text": "Our holiday at the Belvedere was in May 2006. The hotel is well positioned near to the Old Town. It's clean but the room we had was dated. It's obvious that the whole hotel has had a face lift. The bedroom was ok, the only disappointment was the bathroom which was small and in need of an upgrade, having said that it was acceptable. Our room overlooked both the pool and the sea. The public areas of the hotel are pleasant, the dining room has a smokers section so that non-smokers can eat in peace. The food is buffet style but apart from a couple of nights when we went out to restaurants in the town we ate there twice everyday and enjoyed it. The bar is small but comfortable and the staff are excellent. The biggest draw back is the wind. I can't speak for the rest of the year but in May it's impossible to sit comfortably by the pool, the wind is fiece. Once away from the sea front there is no wind.", "helpfulness": 8, "user": "A TripAdvisor user", "date": "July 8, 2006", "id": 5439693}], "location": {"country": "Greece", "continent": "Europe"}, "stars": 4, "variance": {"poor": 16, "average": 35, "very good": 61, "terrible": 4, "excellent": 37}, "aka": "Hotel Belvedere Beach", "slim_ranking": 0.415584415584}