{"user_rating": 5.0, "review_count": 221, "name": "Bentwood Inn Jackson Hole", "reviews": [{"rating": 5.0, "title": "Spoiled Forever", "text": "The Bentwood Inn turned out to be beyond our expectations. We were initially attracted by the photos on their web site and spent a long time deciding which room to choose. However the ambiance exceeded our expectations. Upon arrival we were warmly welcomed by innkeepers Peter and Jennifer Tignor with a picture perfect gourmet spread of wine and cheese on the patio. They gave us wonderful suggestions for dinner which we would have never found on our own. Our room was so cozy and comfortable that we slept through a terrible storm. The piece de resistance of our stay was the five star breakfast prepared by Peter who is a professional chef. We are spoiled forever as The Bentwood Inn is our new gold standard for Bed & Breakfasts.", "helpfulness": 1, "user": "junetalks", "date": "July 16, 2008", "id": 17949235}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "We travelled out west for our honeymoon and I searched and researched places to stay that would be the best at the best price and I hit the jackpot with the Bentwood Inn. We stayed in the \"wildflower\" room for one night when we first arrived in Jackson then we traveled to Yellowstone and came back to Bentwood for three nights at the end of our trip. Peter and Jenny are excellent hosts and cook delightfully. Our rooms were beautiful and very comfortable. Thinking back to the \"other\" places we considered and seeing them in town I am very happy with our decision. We drove by the Rusty Parrot, Snake River, Wort Hotel, etc. and they disappointed us. Teton Village is very crowded together and the Four Seasons is packed right in the middle. We are very happy with our stay and whenever we get out to that part of the country again we will definately stay at the Bentwood Inn.", "title": "Excellent", "user": "Jul9977", "date": "July 14, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 17882293, "likes": {"liked": "— Wine and cheese every afternoon!", "disliked": "— We couldnt stay longer."}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled on business", "text": "A bit hard to find at first, the Bentwood Inn is the best B&B I've ever had the pleasure to stay at, bar none. From the moment you open the front door, you feel at home and embraced in the lap of luxury, all at the same time. The beds are the most comfortable you can imagine, linens are wonderful, the views magnificent, the back yard a paradise. Unpretentious and welcoming, Peter and Jennifer are fantastic managers, keeping everything pristine and spotless, while seeing to every visitor's needs. I happened to be here on business, and it was a refuge and a delight; most travelers are on holiday. If at all possible, be sure to participate in the Tuesday night Bistro Dinner done by Peter. Unbelievable. The man is a culinary genius with a genuine passion for his work. Another plus are the guests, all of whom I found to be intelligent, fascinating, and engaging people.", "title": "Unsurpassed", "helpfulness": 2, "user": "Leenda324", "date": "June 25, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 17233526, "likes": {"liked": "— Everything", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "Starting with the basics, the hand hewed log mansion is beautiful, well maintained and well located for exploring the Jackson, Teton, Yellowstone area. Over and above the complete satisfaction of a first class Inn, you will experience the care and hospitality provided by the managers, Jennifer and Peter. They are a very special couple. Jennifer makes you fell as though you are sharing her home as an extended family member. Peter is a world class chef having worked in premier restaurants. The ‘Bistro’ concept is not to be missed as Peter will prepare you a gourmet meal for dinner you will remember for a long time to come. It is having your own private four-star chef in house. Three-course breakfast is normal there. Jennifer has fresh baked wonders every morning. These two young professionals will leave you wondering why you could have thought of staying anywhere else and looking forward to your return trip. You will not be disappointed.", "title": "Above and Beyond wonderful", "helpfulness": 3, "user": "bwalsh-bostcom", "date": "June 4, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 16680822, "likes": {"liked": "— The Inn keepers", "disliked": "— Leaving"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "The Bentwood Inn was everything we expected and more because of the warmth and hospitality of Peter and Jen. The breakfasts were delicious culinary adventures as Peter previously worked as a chef. The late afternoon complimentary wine and snacks were an especially nice addition since it afforded the opportunity to mingle with other guests. The room was inviting, spacious and our balcony overlooked trees filled with singing birds. We highly recommend this Inn for anyone looking for an intimate bed and breakfast experience.", "title": "A wonderful experience", "helpfulness": 2, "user": "CitySlickersNewYork", "date": "May 31, 2008", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 16544984, "likes": {"liked": "— Large and comfortable room and delicious breakfast.", "disliked": "— Lack of street sign to entrance on road to inn."}}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "Recently my wife and I spent two nights at the Bentwood Inn in Jackson, WY. While it is a bit difficult to find, it is well worth the effort. It is a beautiful log structure about five miles outside of Jackson on heavily treed property. The Inn is quite impressive as one drives into the driveway. But the real beauty lies within. From the three story stone fireplace in the great room to the private balconies or decks off the guest rooms, it is obvious that this Inn was designed with beauty and guest privacy as prime motivators. Peter and Jennifer, the new Innkeepers, are both friendly and knowledgeable, and make most gracious hosts. They gave us great recommendations for dining, assisted with making the reservations, and provided guidance on how best to travel to area sights and to our next location. Breakfasts were visually as well as palate pleasing. And the wines and selected cheeses in the afternoon were a welcome treat after a day of sightseeing. There are only five guest rooms, so make your reservations early.", "title": "Great Find", "helpfulness": 1, "user": "satisfaction", "date": "October 4, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 20622432, "likes": {"liked": "— See review"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "Relaxing B & B outside Jackson on the road to Teton village. It's like visiting a favourite relative. The superb breakfast sets you up for a day of exploring the nearby Parks. The closest gem is the Nelson Rockerrfeller reserve which is now part of the Grande Teton park. Great trails to a magical lake and a visitors centre which would rival any in North America for its uniqueness. Our vsit was fortunate to coincide with one of the inn's twice weekly bistro nights. The hosts Peter and Penny produced a four course meal which became the evening social event. There is also a daily wine and cheese so if you are staying here you will meet all the other guests to share stories and recomend places to visit. There is a paved trail from the inn to Teton Village and the Park gates so running or biking are just outside the door. This place is a great set up for couples and older families. One couple were married while we were here and the next day a female moose and two calves spent nine hours sitting on the lawn and eating off the crabapple trees. How cool is that!", "title": "You have to love this place", "user": "CdnAcct", "date": "September 22, 2008", "detail_rating": {"business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 3.0}, "id": 20288625, "likes": {"liked": "— Instant rellaxation", "disliked": "— Having to leave"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "The Bentwood Inn, located in Jackson, Wyoming, is a magical getaway. Situated in the midst of the awe-inspiring Grand Tetons Mountains, this is the perfect place to stay. The Inn is elegant in every sense of the word. As you enter, a grand yet cozy lounge and library await you. Each room is beautifully appointed and the food is outstanding. Landscaping at the Inn is breathtaking. Lush lawns, flowers and cottonwoods surround the property. Wine and cheese is served every afternoon in this naturally exquisite setting. The Bentwood Inn is a must for anyone looking to be pampered.", "title": "A Magical Getaway", "helpfulness": 2, "user": "EdTeach55", "date": "September 16, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 20130481, "likes": {"liked": "— Elegance, food, setting"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "My week at the Bentwood Inn was a dream come true. The location is superb to The Teton and Yellowstone National Parks. The Bistro dinners are 5 Star and included a professional lecture and discussion of Teton and Yellowstone ecology that stimulated conversation into the evening and at breakfast the next day. The seasonal weather was ideal for hiking and relaxing. The hospitality from Jenny and Peter, Innkeepers, was outstanding.", "title": "Bentwood Inn Experience!", "helpfulness": 1, "user": "BergMan8", "date": "September 16, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 20104757, "likes": {"liked": "— Mountains and friendly ambience.", "disliked": "— Having to leave"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "The rooms are clean and comfortable. This is an environmentally friendly inn using many natural products and apparent environmentally friendly practices. Local foods are used to enhance the Jackson Hole experience. You can't go wrong by staying here!", "title": "Unforgettable Bed & Breakfast", "helpfulness": 4, "user": "CKRK", "date": "September 4, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 19751896, "likes": {"liked": "— The breakfast and the ambiance.", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "Bentwood Inn is one of the best places we have ever stayed. It exceeds expectations even for wonderful Jackson Hole. The hospitality and food is wonderful and the welcoming attention of Peter and Jenny, the Innkeepers is sincere. If you have a chance, take advantage of the Bistro dinner on Saturday night, prepared by Peter, an experienced gourmet chef. You can't go wrong!", "title": "Absolutely terrific", "helpfulness": 3, "user": "esanderse", "date": "August 26, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 19362225, "likes": {"liked": "— Location, room quality, food and service", "disliked": "— nothing"}}, {"rating": 5.0, "title": "A dose of bliss in the wild of Wyoming", "text": "Ed and Peg Sanders, Boulder, Colorado", "helpfulness": 2, "user": "gonetowyoming", "date": "August 14, 2008", "id": 18937612}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "I loved the Bentwood, it was a wonderful stay combining a relaxing 'western' atmosphere with excellent and original food and wine offerings. Staying here, you're at the doorstep of the Grand Teton National Park, with trails, bike paths, wildlife, and only minutes from the center of Jackson but w/o all the tourist bustle. It's a perfect location, equally close to Jackson, Wilson, and Teton Village and surrounded by lush trees and at the base of the Teton mountains. The innkeepers, Jenny and Peter, are completely warm and welcoming and are passionate about food that's original and interesting and sustaining. The back porch and grounds are enough too to keep you sitting in one spot with a good book for hours. I have missed the relaxation since we had to leave and can't wait to get back to Jackson and the Bentwood. Check it out and get away from your bustle!", "title": "Perfect Family Vacation", "helpfulness": 1, "user": "kswBoulder_Colorado", "date": "August 6, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 18664140, "likes": {"liked": "— the trees, food!, bikes, beds, birds, location, feeling", "disliked": "— leaving"}}, {"rating": 5.0, "title": "What a place! What a breakfast!", "text": "We went to the Bentwood Inn in Jackson for five nights this summer and had the perfect family vacation. We have three children and found the Bentwood to be spacious and accommodating for us all. The serene woods create a relaxing landscape to simply enjoy the outdoors. The wine and cheese is a brilliant way to unwind and enjoy the Inn and remember to relax on vacation. Peter and Jenny are lovely and amazingly exceptional cooks. The chocolate chip cookies are incredible! Breakfast was truly gourmet. We loved bike riding on the bike path right outside the Inn and biked to Wilson for coffee and along the Village road for dinner...so nice not to have to get in the car all the time (a plus with three kids). The Bentwood Inn feels like a friend's cabin in the woods. Now it feels like our cabin in the woods that we will return to again and again. What more could anyone want in life???? We HIGHLY RECOMMEND.", "user": "Webcrap1", "date": "July 21, 2008", "id": 18098042}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "This B&B is one of the top lodging establishments that I have ever had the pleasure of staying. Wonderful hosts (Peter & Jenny) and beautiful lodging. The meals were all delicious and presented so professionally. Service was outstanding. The innkeepers were always available to guide you and make you feel at home without imposing on your stay. The lodge is perfect for couples or families and a good location for any excursions in the surrounding areas. Absolutely check this lodge out if you have the opportunity. You will not be disappointed!!!! J. Bryant, Indiana", "title": "Loved the Bentwood Inn", "helpfulness": 1, "user": "semmesgirl", "date": "July 19, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 18042602, "likes": {"liked": "— Breakfast!", "disliked": "— I honestly can't think of anything"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "We spent 8 nights at the Bentwood Inn the week of Thanksgiving. We got married on Monday in the main room and Peter and Jen did an outstanding job setting everything up. They anticipated things we had not thought of and gave us recommendations for things like a cake maker. Peter is an outstanding cook and made incredible breakfasts each morning. He also made a traditional and non-traditional Thanksgiving dinner for us and three other couples and we all had a wonderful time. The rooms are comfortable and very quiet. The service was overall excellent and we will be staying there again as soon as we can and recommend it to anyone who wants truly excellent experience, great cooking and homey feel.", "title": "Fantastic Hosts and Incredible Inn", "user": "GoodCompany2000", "date": "November 30, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 22328308, "likes": {"liked": "— Peter and Jen and the care they give to their guests.", "disliked": "— Having to leave."}}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "Friends in Jackson Hole recommended the Bentwood to us as their favorite. Wow, we couldn't have been happier. The lodge was absolutely perfect for a romantic Fall escape from Denver. Genuinely surpassed all expectations. The breakfasts were over-the-top, delicious and filling. The evening wine and cheese proved to be our favorite time of day, as we hungout with other guests and talked about our daily hikes. An unexpected highlight was participating in the Bistro Dinner, and having Benj, a naturalist from the Teton Science School, give a presentation about the natural history of the valley. We can't wait to return, probably for some skiing.", "title": "More than we expected", "helpfulness": 1, "user": "ekccolorado", "date": "November 21, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 22072718, "likes": {"liked": "— We discovered it through friends - we liked the surprise and loved the food.", "disliked": "— As a coffe lover, the coffee could have been better"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "We had the most amazing time at the Bentwood Inn, from the moment we arrived until we left. The innkeepers are so gracious and hospitable. The gourmet breakfasts were delicious, as was the complimentary wine & cheese every afternoon. The atmosphere is very cozy and comfortable, and our room was very well kept. It is the perfect place to stay if you're looking for the ideal cozy mountain getaway. The Bentwood's location is ideal as well - around 30 minutes from the airport and close to both downtown Jackson and Teton Village. It's also very easy to get to Grand Teton National Park from the inn. On our very first day there, we were already talking about staying there again next time we're in Jackson!", "title": "Really, really wonderful!!", "helpfulness": 1, "user": "sbz2101", "date": "October 30, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 21408659}, {"rating": 4.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "The Bentwood was nice. Jenny and Peter, the hosts, are super friendly and breakfast was yummy. There are cookies out 24-7, which are excellent!. Our room (the Cabin) was comfy and clean; however, the house is right on the road, so we heard traffic most of the night (we live in the sticks, so we're not used to traffic!) We missed the cocktails each day (it is held from 4:30-5:30), so I can't comment on that. Breakfast is set at a specific time (8:30 or 9), so no early/late risers! We would have liked a bit more flexibility with the times of things, but we understand the hosts have a life as well!", "title": "Very Nice", "user": "softfoot", "date": "October 22, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 21105722, "likes": {"liked": "— breakfast", "disliked": "— traffic and timing of meals/cocktails"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "From the Inn, it's an easy drive to town and to the Tetons (by the way, if you go left out of their driveway, you end up in the Tetons....but beware of HUGE POT HOLES!)", "title": "Delightful Getaway.", "helpfulness": 1, "user": "ChandlerHall", "date": "October 7, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 20704847, "likes": {"liked": "— Cozy, comfy, fun decor, f riendly atmosphere, great food.", "disliked": "— I liked everything."}}], "location": {"country": "United States"}, "stars": 3.5, "variance": {"poor": 5, "average": 4, "very good": 13, "terrible": 0, "excellent": 199}, "aka": "Bentwood Inn Jackson Hole Hotel Jackson Hole", "slim_ranking": 0.428571428571, "description": "Few inns in Jackson Hole offer the unique character and qualities found at the Bentwood Inn. It is the only \"Select Registry\" inn in Wyoming. The inn is situated in a beautiful wooded setting across from a tree-lined lane leading to the Snake River. The majestic Teton Mountains backdrop the inn providing that picture perfect image of what you’re looking for when you come to Jackson Hole."}