{"user_rating": 4.0, "review_count": 627, "name": "Beresford Arms", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "The Bereford has lots of charm and character and the location really is ideal. The rooms were large and had good facilities (except a/c). I particularly liked the bath tub and the double sinks. The staff were helpful and the internet access free. The two computers in the foyer are free to guests though the printing costs 50cents per page. My only grumble is the breakfast: very limited (sweet pastries, melon, tea and coffee. Nothing else) Don't expect fruit juice or anything savoury. The complimentary wine in the late afternoon is a nice touch, though once again, don't ask for juice or soda instead. The room bar is good value and the hotel was very well maintained. I'd go back again.", "title": "Great value...you can't go wrong here", "helpfulness": 1, "user": "BillParis", "date": "July 20, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 35220088}, {"rating": 3.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "My brother's room was very small and the closet was inside a decent bathroom while my wife and I had a room that was quite large, had a kitchen, but contained a small very old bathroom (separate spigots for hot and cold water). Both rooms were booked together and were the same class of room so in our experience the rooms were highly variable. The furniture in both rooms was nice wood that had seen better days. Also despite being on the top floor the rooms suffered from a fair amount of street noise. The staff was courteous and helpful, and the valet parking is a pretty good deal at $20/day in the heart of SF. The hotel offers a continental breakfast which consists of a few pastries a lit bit of a fruit and coffee/tea, but no juices or hot items. Overall the rooms were clean but are definitely in need of updating so if you don't mind rooms with a bit of \"character\" the Beresford Arms is a pretty good deal considering its location.", "title": "Clean but tired", "helpfulness": 1, "user": "dwbpnm", "date": "July 8, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 3.0}, "id": 34234880}, {"rating": 5.0, "stay_parameters": "Stayed June 2009", "text": "I stayed overnight here with a few friends. For the price ($139 a night) it was perfect. We were within walking distance of the muni and several parking garages. We came out for SF's Pride so we were only a few blocks from the parade and civic center. The room itself was pretty dated but we had a large bathroom with shiny, floral wallpaper, deep bathtub, bidet and 2 sinks. It made getting ready VERY easy and comfortable. We also had a kitchen, which was great because it cut costs on food since we brought our own and heated it up in the oven. There was no salt though, so bring your own if you think you'll need it. The room was decently sized, we fit 7 people, 4 in beds, 3 on the floor. The downside was no AC, luckily SF is cool enough at night so we could get away with opening windows. We did hear some rooms DO have AC though, you just have to specify when you make the reservation. We also called ahead and requested to be put in a room with a kitchen. The hotel was located in an OK area, you just have to be a little careful walking down certain streets at night as they fill up with homeless people. Then again, so does the rest of SF. All in all, we had a nice stay. Will go to this hotel again.", "title": "Large room, kitchen and 70's decor", "user": "Travel_Lover_CA", "date": "June 29, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 33503612}, {"rating": 4.0, "stay_parameters": "Stayed June 2009", "text": "The Beresford Arms Hotel is located in a building on the National Register of Historic Places. This should be your first clue that it is very old. But, while old, it is well taken care of. Our room, one of the Junior Jacuzzi Suites, was VERY clean.", "title": "Beresford Arms: Historic Hotel on the Outskirts of Union Square", "helpfulness": 1, "user": "ladyjadegd", "date": "June 16, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 3.0}, "id": 32422477}, {"rating": 4.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "My first impression when I walked into the room was disappointment. I had expected something a little different based on the description of the aforementioned “Junior Jacuzzi Suite”. I had assumed the beds were in a separate room and that there was a sitting room, but I checked the website again and it said “sitting area”, not sitting room. Of course, we didn’t have a sitting “area” either, but that wasn’t really necessary. The furniture is dated, but as I said the room is quite clean, looked freshly painted and the bathroom was sparkling white. I was pleased that there was very good lighting in our room.", "title": "Excellent value and good location", "helpfulness": 1, "user": "Penders65", "date": "June 12, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 32193664}, {"rating": 4.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "At $99 per night, I wasn't expecting too much. I was pleasantly surprised however. The hotel was 5 mins walk from Union Square, so nice and central. Whilst the hotel is quite \"old\" looking, the rooms were spacious and comfortable. The complimentary breakfast was basic but provided a good start to the day. The complimentary cheese & wine in the between about 4.30 and 5,.30pm was also enjoyable, if you are around at that time of day.", "title": "Great value, great location", "helpfulness": 1, "user": "bjen79", "date": "June 9, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 31978752}, {"rating": 4.0, "stay_parameters": "Stayed April 2009", "text": "We stayed from April 27th-May2nd, five nights. This hotel is one of the oldest in San Franscico but I think it was full of character.", "title": "Good location, clean, spacious, but a bit noisy", "helpfulness": 1, "user": "MonanMatt", "date": "June 8, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 31826414}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "We had two rooms with an adjoining door between. As there were 8 of us, it made it easier to put the children to bed and we still had somewhere to sit and watch TV. The kitchen made meals easier.", "title": "You can spend $$ more and not have the hospitality of the Beresford Arms", "helpfulness": 1, "user": "azmove", "date": "June 6, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 31734084}, {"rating": 3.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "There was free internet access in the lobby which we used and a laundry mat straight across the road (run by Lee who was a great person to talk to). We didnt take advantage of the breakfast as we ate in our room but it did look nice, with fresh fruit and pastries, coffee and juice.", "title": "A positive experience but know what to expect", "helpfulness": 2, "user": "jmintouch33", "date": "June 1, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 3.0, "rooms": 3.0}, "id": 31339519}, {"rating": 4.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "The negative thing about this hotel was that the fire station was not far away and they came down the street regularly, so it was quiet noisy at times including nighttime. The windows are not double glazed.", "title": "great location and value", "user": "alhusted", "date": "May 19, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 30307420}, {"rating": 4.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "We stayed for 2 nights in the Beresford Arms, was the last part of our three weeks' honeymoon in the U.S.", "title": "Great stay in the Beresford Arms", "helpfulness": 2, "user": "tjielp23", "date": "September 17, 2006", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 3.0, "cleanliness": 3.0, "value": 5.0, "location": 3.0, "rooms": 3.0}, "id": 5808746}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "With a price of $152 per night, which is very reasonable for San Francisco standards, we were very happy. Although the website looks great, in all honesty, the rooms in real life are pretty old-fashioned. It all has a real 70's feel to it.", "title": "Very nice Hotel", "helpfulness": 2, "user": "Buzzy15", "date": "September 7, 2006", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 3.0, "cleanliness": 3.0, "value": 4.0, "location": 3.0, "rooms": 4.0}, "id": 5776307, "likes": {"liked": "— Room layout"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "Pro's:", "title": "Great Vintage Hotel at a convenient location", "helpfulness": 6, "user": "o2binny", "date": "August 27, 2006", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 5713054, "likes": {"liked": "— Location to everything", "disliked": "— First couple of days the halls smelled a bit musty."}}, {"rating": 3.0, "stay_parameters": "Stayed July 2006, traveled with friends", "text": "- junior suite is very large, with old kitchen and bathroom but all works well", "title": "Wasnt that bad...", "helpfulness": 1, "user": "kharm", "date": "August 22, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 5698924, "likes": {"liked": "— Affordable suite with big bathroom and kitchen", "disliked": "— Carpet could have been cleaner"}}, {"rating": 3.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "- very quiet, no noise from street", "title": "Great price for SF", "helpfulness": 1, "user": "Jersey1879", "date": "August 21, 2006", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 2.0, "rooms": 3.0}, "id": 5651023, "likes": {"liked": "— That it was clean and afordable", "disliked": "— Parking and that it was on the corner of busy streets"}}, {"rating": 2.0, "stay_parameters": "Stayed May 2009, traveled on business", "text": "Stayed here again for a return visit after a 6 year absence, and what a disappointment! The Beresford Arms is on the National Registry of Historical Places, but what a disservice they are doing to the building. The hallways reek of -- I'm not sure how to describe it -- old dirt, grease, and dampness. The rooms are large, which is a plus, but the building has a old, outdated heating system. The radiators were spewing heat during one of SF's hottest days in years (it was in the 90s!), so of course we turned them off. There is no A/C, which in this town is usually not an issue, but open the windows at your own risk -- even on the top floor the street noise is enormous, what with drunken youth screaming until 4 am, psychotic homeless people shouting at random passersby, the sirens of fire engines and ambulances, and general street noise -- but closing them won't be much help as the glass is single paned and many of the top panes are stuck open and won't allow you to close the windows all the way anyway. (The \"Nuits de Paris Massage Parlor\" is a block away, so this is the kind of neighborhood you get in Union Square/The Tenderloin.)", "title": "OMG, what a crummy dinosaur of a hotel!", "user": "watercao", "date": "May 19, 2009", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 4.0, "service": 1.0, "rooms": 3.0}, "id": 30263104}, {"rating": 4.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "The wireless, which is free, is pathetically slow. What, do they have everyone going through a dial-up modem? My Outlook email kept failing and asking me repeatedly for my password. The lobby computer is no better. They have so many controls on the browser that I couldn't even log into my airline's website well enough to download and print my boarding passes. The desk staff were completely uninterested or helpful in my plight -- I had a very early flight and wanted to make sure I made it -- that they made no effort at all to help, telling me that everyone else was fine so tough luck for me.", "title": "Great value heritage hotel", "user": "chimbo", "date": "April 27, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 3.0}, "id": 28894763}, {"rating": 4.0, "stay_parameters": "Stayed April 2009, traveled with family", "text": "Old bathroom, old furniture (the beds look like they're from the Montgomery Ward catalogue, c.1964. The towels are soft, at least. The rooms, at least ours, didn't smell too funky, a testament to the hardworking women who change the rooms -- the biggest plus for the place.", "title": "Good value no nonsense hotel", "helpfulness": 1, "user": "coantrimtripadviser", "date": "April 22, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 3.0}, "id": 28579402}, {"rating": 5.0, "stay_parameters": "Stayed January 2009, traveled as a couple", "text": "Breakfast is basic: a bunch of cut up melon in a utility bucket, a selection of uninteresting pastries (the decent doughnuts are gone by 7:15 am), and serviceable coffee. Kind of blech, but there are other places for a cheap coffee and baked good around town, most notably the La Boulange chain out of the Bay Bakery Group.", "title": "Old World Charm", "helpfulness": 2, "user": "stephanie60", "date": "April 3, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 4.0, "rooms": 5.0}, "id": 27326715}, {"rating": 3.0, "title": "Value hotel in San Fran", "text": "Overall, a fairly miserable experience. We only stayed because of the kitchen and the kids, but you'd be better off in another more modern SF hotel -- at this point the economy has the occupancy rate down and the prices competitive. We paid on average $230 a night for their largest suite, but unless you can get it for much, much less than that, look someplace else.", "helpfulness": 1, "user": "mountforest", "date": "March 29, 2009", "id": 27052408}, {"rating": 4.0, "stay_parameters": "Stayed March 2009, traveled with friends", "text": "Older hotel just off Union Square. Able to walk or take Muni to everything. Very friendly staff and a great value. Rates include continental breakfast (croissants, pastries, fruit, coffee, tea - even saw them bring out juice boxes for some children) and afternoon wine & cheese. Great break during the middle of a hectic day sightseeing. Our rooms were facing the courtyard and were quiet. Rooms looked a bit tired, but overall quite nice. Honor bar is very reasonable. Would definitely stay again.", "title": "Charming Hotel, Great Location", "helpfulness": 1, "user": "NB815", "date": "March 23, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 26704322}, {"rating": 5.0, "stay_parameters": "Stayed January 2009, traveled as a couple", "text": "Arrived late evening to a friendly greeting. Room was on the top floor looking into the courtyard and was clean with fresh decoration. Bed was comfortable. Usual inner city police sirens could be heard at intervals, but otherwise it is a quiet hotel.", "title": "Friendly staff, wonderful building, comfortable room", "helpfulness": 3, "user": "Rojee", "date": "January 27, 2009", "detail_rating": {"front_desk": 5.0, "service": 5.0, "business": 3.0, "cleanliness": 4.0, "rooms": 5.0, "location": 5.0}, "id": 23935438, "likes": {"liked": "— Location", "disliked": "— City noises at night"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2008, traveled with family", "text": "Breakfast is complimentary with fresh fruit and pastries and is in the elegant foyer. Very relaxed atmosphere", "title": "Beresford Arms - I was pleasantly surprised", "helpfulness": 2, "user": "jjessie", "date": "December 29, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 23065257, "likes": {"liked": "— Location", "disliked": "— Rooms on lower floors get a lot of street noise"}}, {"rating": 4.0, "title": "Couldn't be Happier!", "text": "Staff were very helpful when we discovered we had left something in our room, after we had checked out.", "helpfulness": 2, "user": "DMH27", "date": "December 12, 2008", "id": 22661422}, {"rating": 2.0, "stay_parameters": "Stayed October 2008, traveled solo", "text": "Would stay here again.", "title": "It is quaint but make sure you get a good room", "helpfulness": 2, "user": "BrisCaz", "date": "December 8, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 3.0, "rooms": 3.0}, "id": 22533263, "likes": {"liked": "— The friendly staff", "disliked": "— The location"}}, {"rating": 5.0, "title": "Beresford Arms, Value for Money", "text": "A room in downtown San Francisco can be quite expensive. But Beresford Arms Hotel gave our family value for our money. We stayed for 6 nights( May 2006) in their Parlor Room and WOW, it was immaculately clean. It had a full working kitchen & whirpool. The staff from the doorman to the cleaning lady were all efficient & couteous. Most importantly, NO MUSTY ROOM SMELL. This boutique hotel gives free continental breakfast buffet to guest in their lobby each morning as well as wine and cheese at 6pm evey night. It is walking distance to the Union Square, bus stops, the F line, and shops. There is also a convenient store in front. We will definitely stay in Beresford Arms when we vacation again in San Francisco.", "helpfulness": 5, "user": "mcmina", "date": "June 21, 2006", "id": 5373016}, {"rating": 5.0, "title": "Great Value, Comfortable Accommodations", "text": "The Bereseford Arms offers travelers to San Francisco great value, comfortable rooms and a lot of charm. This hotel does not rip you off, for instance, with outlandish prices for bottled water or beer in the minibar -- $1.25 for water, $2 for a beer. The hotel also provides free high speed Internet access on two computers in the lobby. The complimentary continental breakfast consists of coffee, fruit, danish and croissants and there is wine nd cheese in the lobby from 4 to 5 pm each day. The staff is helpful and hospitable. The rooms are clean and comfortable and include TV, ironing board and iron and in some a kitchenette. The location, on Post Street, several blocks from Union Square is convenient, and provides a neighborhood experience, as opposed to a \"downtown' or touristy epxerience. We met a lot of repeat guests during our stay and that tells of the quality and value this hotel provides.", "helpfulness": 9, "user": "A TripAdvisor user", "date": "June 21, 2006", "id": 5372052}, {"rating": 4.0, "title": "Great hotel", "text": "We were really happy with the Beresford Arms. The neighbourhood is not great but only three blocks to the cable car line and Union Square. It is an old building with a great ambience. Our room was huge with a large bathroom and kitchen. Whilst there was no view it was very private due to deep window sills. The internet is free and fast and breakfast very basic yet adequate. It was extremely affordable (booked on line), would definitely stay there again.", "helpfulness": 7, "user": "tripellen", "date": "June 6, 2006", "id": 5314393}, {"rating": 4.0, "stay_parameters": "Stayed May 2006", "text": "The Beresford Arms is a very nice hotel and a great value. Our room was very large, it had two queen beds, a small kitchen, a large bathroom and a space for a couch! The prices there are also very reasonable. One nice extra is that they have a complimentary wine and cheese hour, a good opportunity to get to know the other guests in the beautiful lobby. The hotel is also conveniently located in the Union Square area, but off the main tourist street, so it is somewhat quieter.", "title": "Good Value", "helpfulness": 5, "user": "Blar22", "date": "June 3, 2006", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 5.0, "service": 4.0}, "id": 5294066}, {"rating": 5.0, "stay_parameters": "Stayed May 2006", "text": "My wife and I spent three nights here in May.The staff are wonderful(5*).The location is execellent and the price was unbeatable. Extra perks included continental breakfast in the morning and cheese and wine in the afternoon.Highly recommend", "title": "GREAT HOTEL IN SAN FRANCISCO", "helpfulness": 6, "user": "benducci", "date": "May 22, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 5188687}, {"rating": 5.0, "stay_parameters": "Stayed May 2006", "text": "My wife and I loved the hotel, the staff were very friendly and helpful, the room was quiet (exactly what we asked for), the atmosphere was great and we both loved the old world charm of the histiric building. Great shopping nearby and an easy walk to most of downtown San Francisco.", "title": "Wow, what a great little hotel.", "helpfulness": 10, "user": "Patrick D", "date": "May 15, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 5068942}, {"rating": 5.0, "title": "Great option for Downtown", "text": "We would not hesitate to recommed the Beresford Arms Hotel in San Francisco to any traveller looking for great priced accomodation. This is the second time my wife stayed at the Beresford and it was as a result of her first stay (10 years ago) that we decided to stay there this time, neither of us regretted that decision and we will certainly be staying there the next time we visit San Franciso.", "helpfulness": 12, "user": "A TripAdvisor user", "date": "April 13, 2006", "id": 4971060}, {"rating": 4.0, "stay_parameters": "Stayed March 2006", "text": "Stayed here for 3 nights in April 2006. Great value hotel for the location. We had a back facing room (616) which had no view, but was absolutely quiet at night. Recommended.", "title": "Good location, quiet, clean, safe", "helpfulness": 9, "user": "texfoolette", "date": "March 8, 2006", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "rooms": 3.0, "service": 4.0}, "id": 4594570}, {"rating": 4.0, "stay_parameters": "Stayed September 2005", "text": "I don't know if it's possible to pay less at any downtown SF hotel than the $115/night plus 14% tax I paid on a single at Beresford Arms, and still get the safety, cleanliness, and QUIET I got. I requested a quiet room in the back and was on the 8th floor, away from the street. True, I had a view of the backsides of buildings, but it was so quiet I almost thought I was the only person in the hotel. The beds were perfectly OK, and I was never awakened by outside lights or noise. It's a 5 minute walk to Union Square; 10-15 minutes to Chinatown. I was very satisfied/", "title": "The Beresford is a good hotel", "helpfulness": 9, "user": "yougetspaz", "date": "March 4, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "service": 3.0}, "id": 4582053}, {"rating": 5.0, "title": "What a great place to stay!", "text": "Stayed at the Beresford for 3 nights in Sept 06. We were really pleased, it's a good hotel in a good location. If you are on a budget and can't afford £100 + a night which many of the hotels are, stay here. It's a beautiful old building, pretty well kept. The rooms are large and it's great to have a fridge and kettle. In the morning there's complimentary coffee,pastries and fruit in the foyer and free internet. The staff are helpful too. I would definately stay here again. Don't forget to check out Bobby C's Owl Bar on Post street on your way back from a hard days sight seeing.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "February 21, 2006", "id": 4476181}, {"rating": 1.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "This hotel is a disaster! Stay away! We arrived at 5:00 a.m. because our flight was delayed. The front door was locked. There is a bell outdoors and we rang it for 5 minutes, no one came! Our cabby used his cell phone to call the front desk. It had to ring several minutes until some answered. A young man came to the door and let us in. He was sleepy and not the least bit concerned that we had been waiting in what is an unsafe area of the city. This was just the start of our terrible stay.", "title": "This hotel is a disaster! Stay away.", "helpfulness": 2, "user": "travelingteacher25", "date": "August 20, 2006", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "location": 1.0, "rooms": 1.0}, "id": 5629965, "likes": {"liked": "— I liked nothing", "disliked": "— the dusty, small room"}}, {"rating": 2.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "We found out it was unsafe by witnessing 2 drug arrests during the day a block away from the hotel.", "title": "Beresford Arms is OK for the Price", "helpfulness": 4, "user": "CalTrip", "date": "July 31, 2006", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 2.0, "value": 2.0, "location": 2.0, "rooms": 1.0}, "id": 5531667}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled on business", "text": "The hotel itself is old and not well kept. The rooms are small. There is no air conditioning and it was very warm. The furniture is uncomfortable and dusty. The hotel is located on a main street and you can hear sirens going off often during the day and night! The staff is not helpful and cleaning is not done often. Our room was never picked up during our stay. They did make the bed but they did not pick up the used glasses from the snack bar (or anything else for that matter).", "title": "Perfect bargain for the family", "helpfulness": 8, "user": "brookedny", "date": "July 19, 2006", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5488033, "likes": {"liked": "— Great value!", "disliked": "— Internet access only in the two computers in the lobby"}}, {"rating": 5.0, "title": "Wonderful Gem in The City", "text": "The front desk is not helpful or concerned about your well being. I know this hotel is a bargain but I don't believe that it is worth it. There really isn't a good thing I can say.", "helpfulness": 2, "user": "Camille T", "date": "July 18, 2006", "id": 5480315}, {"rating": 1.0, "stay_parameters": "Stayed July 2006, traveled on business", "text": "My husband and I have been traveling in CA for the last 3 weeks. We stayed at Beresford Arms for four nights in July. Yes, this hotel is a good deal for San Fran, but may not be worth your money.", "title": "Worst hotel have ever ever stayed in", "helpfulness": 15, "user": "jwbiv", "date": "July 18, 2006", "detail_rating": {"cleanliness": 1.0, "value": 2.0, "rooms": 1.0, "service": 1.0}, "id": 5477967}], "location": {"country": "United States", "city": "San Francisco"}, "stars": 3, "variance": {"poor": 25, "average": 105, "very good": 310, "terrible": 21, "excellent": 166}, "aka": "Beresford Arms Hotel", "slim_ranking": 0.395744680851, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.5}}