{"user_rating": 4.0, "review_count": 55, "name": "Berkeley Springs Cottage Rentals", "reviews": [{"rating": 1.0, "stay_parameters": "Stayed October 2012, traveled with friends", "text": "After a decade of yearly repeat business, our relationship with Berkeley Springs Cottage Rentals comes to an end. This stems from an abundant list of maintenance/ cleaning issues at above property. Main amenities we rented property for were lacking in all ways: hot tub, jet- impaired, located below deck facing road, with pungent sewage odors wafting through as you tried to enjoy mountain air and game room with only one fully functioning game, in a most unwelcoming, smelly basement.", "title": "Nestled Pines Chalet-Disappointing!", "helpfulness": 1, "user": "Dthiess", "date": "December 1, 2012", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 1.0}, "id": 146591934}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "Wish disappointment ended there, surprisingly it didn't. More surprising is when matters were brought to management, it was received in a condescending inhospitable manner, we're told they had no other properties to move us to and didn't give additional discounts, neither of which we requested. No mention of refund or additional cleaning visit. When asked if increasing our price point for future visits would ensure a rental more up to our standards, we were asked to take our business elsewhere in the future. Imagine giving glowing reviews and consistent business to a company, just to be told you're no longer wanted/welcome due to a poorly handled hospitality issue! An additional discount was issued upon returning home. This discount is an admission of guilt on their part (so we'll take it) their failure to provide accommodations up to the standards we've come to expect from them. Disloyalty, lack of concern for customers / inability to address obvious maintenance indicates standards have slipped in recent years. I've forwarded pictures / list of maintenance issues to Stephanie Rebant as well so that their staff can address in full.", "title": "Wonderful Cabins....Cacapon Breeze", "user": "MLEichhorn", "date": "November 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 146398005}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "https://skydrive.live.com/?cid=b28a4c1e2ed5f662&id=B28A4C1E2ED5F662%21360&Bsrc=Share&Bpub=SDX.SkyDrive#cid=B28A4C1E2ED5F662&id=B28A4C1E2ED5F662%21359", "title": "We LOVE Berkeley Springs Cottage Rentals!", "user": "Emily C", "date": "November 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 146235571}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "This is one of the many Cabins I have stayed at through Berkeley Springs Cottage Rentals over the past two years. I try to get a different Cabin each time I go. They have everything from rustic Cabins to elegant Chalets. The staff go above and beyond to make your stay as pleasant as possible.This property was beautiful ! Secluded, very clean, so much room, very nice Hot Tub. Would be great for several people, Had a great time with just two of us!", "title": "Excellent getaway for a family", "user": "Christy W", "date": "November 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 146106348}, {"rating": 5.0, "stay_parameters": "Stayed November 2012", "text": "I have been using Berkeley Springs Cottage Rentals now for approximately 6-7 years and have stayed in numerous cabins that they offer. Every time I call to schedule another visit, the staff are very polite and friendly, efficient and they even provide me with discounts for being a repeat customer. They also offer early check-ins or late check-outs at no extra cost if available. All of the cabins I have stayed in were beautiful and clean! The staff are available 24/7 if you need them but otherwise they don't bother you while you are enjoying the peace and quiet. Our most recent stay was in \"Oak Forest\" which just became our new favorite cabin! Breathtakingly beautiful!", "title": "Nothing Left Out!", "user": "TarH50", "date": "November 5, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 144558273}, {"rating": 2.0, "stay_parameters": "Stayed June 2012, traveled with friends", "text": "Stayed at Cacapon Breeze for a long weekend. The house was a bit old, but functional, the hot tub was also quite old and broke, which we were liable for, but thats in the rental agreement.", "title": "Dead Mouse", "helpfulness": 2, "user": "mhaiv1", "date": "June 25, 2012", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 132763151}, {"rating": 5.0, "title": "Clean, Comfortable, very nice \"Almost Heaven\" Cottage", "text": "The kicker was we found a dead mouse in the house and could smell another dead animal somewhere in one of the closets and the rental company acted like it was no big deal.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "June 8, 2012", "id": 131580919}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with friends", "text": "Place wasn't bad but the rental company has poor customer service.", "title": "Mini's Hideaway", "helpfulness": 1, "user": "Becky_Pultz", "date": "April 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 128532458}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "We rented \"Almost Heaven\" a 4 bedroom, 5 bathroom, cottage in the Coolfont Resort area. It really was almost heaven with 5 bathrooms for a girls getaway weekend. The house was exceptionally clean and the beds were wonderful with pillowtop matresses and featherbeds. The furnishings were very nice, many of them being log type exactly as pictured on the website. With a separate living room and 2 other dens (both dens with Direct Satellite TV) it was great separate space especially if someone wanted a quiet reading area while others watched TV. Great value for the price! The reservations were very easy to complete and the staff I spoke with was very friendly and helpful. We had no issues or problems during our stay. It's a short drive back to town (about 7 miles) and it was a very relaxing location. Would definitely rent tis home again!", "title": "Visit to Castle View Cottage in Berkeley Springs, WVA", "helpfulness": 1, "user": "Stephanie B", "date": "April 4, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127259958}, {"rating": 5.0, "stay_parameters": "Stayed April 2011", "text": "My friend and I recently spent the weekend at Mini's Hideaway (one of Berkeley Springs Cottage Rentals). We get together every three months for a relaxing get-away, and therefore, have rented many cottages.", "title": "Berkeley Springs Cottage Rentals is ALWAYS a pleasure to do business with and a WONDERFUL place to stay!!!", "user": "laurenv82", "date": "March 30, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 126963565}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "I was concerned when I read the review of the property from August. We thought the place was down home and very enjoyable. If you are looking for a new, upscale vacation home, then this is not your place. River's Edge is a down to earth older place on the river. It was spotless and the downstairs bed was comfortable. We didn't try upstairs. The sectional does have a couple of hard spots where the cushions have worn and a few chairs need to be tossed outside. For us, this was minor compared to the river, which is very clear and calm, practically out the back door. It is very peaceful. The river bed is quite rocky, so we wore old tennis shoes in which, I think, worked better than water shoes. The yard is level with a nicely placed fire ring, where you can look up at the stars. The road was not well traveled, so the traffic noise was not a problem for us. The musty smell was typical of all places on the river and easily cleared by opening the windows for a bit. We loved our time there and would love to return.", "title": "Another perspective of Rivers Edge rental", "helpfulness": 1, "user": "Laura B", "date": "September 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 140043443}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled with family", "text": "As an individual who must travel throughout the country for work, I have stayed at multiple places, and can honestly say that Berkeley Springs Cottage Rentals are the most special places I have been. Each cabin is more than a room for the night, it is a home. All rentals have their own charm and own stories. They truly have something for everyone. Whether it’s a fire place and a hot tube, or a gourmet kitchen and a big screen TV, these cabins have it all. One great thing about this rental company is that it is family owned/operated. From the moment I arrived in Berkeley Springs, I was not treated as a customer, but like another member of their family. Their hospitality is top of the line. Upon check-in, I was given their cell phone number to call with any questions/concerns, day or night. Making my stay perfect always seems to be their number one concern. For example, during one of my stays, there was a snow storm on our last night at the cabin. As we were leaving, my small car had gotten stuck in a patch of snow, just outside of town. Mr. Rebant came and got me going again before AAA could even get there! Where else can you get that service and attention to detail!? This is just one example how this company goes above and beyond to make sure we have the best experience ever. Visiting Berkeley Springs Cottage Rentals has become a tradition in my family, which I hope is carried on for many years to come.", "title": "BEST VACATION SPOT ON THE EAST COAST", "user": "Jeb H", "date": "August 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 138160222}, {"rating": 2.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "We could get past the very old photos posted on their website, what we couldn't get past was the musty smell and over all feeling that we were staying in a sponge. It felt wet all the time and having inadequate light in the cabin only adds to the problem (this was mentioned in the comments journal other guests left).", "title": "Update River's Edge - PLEASE!", "helpfulness": 1, "user": "Honest P", "date": "August 19, 2012", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 137619322}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled with friends", "text": "This cabin needs serious updates: new outdoor furniture, gas grill, patio furniture, flooring (felt rotten between the living room and kitchen and who puts carpet in a kitchen?) to mention only a few.", "title": "Haven", "user": "chips118", "date": "August 11, 2012", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "location": 4.0, "value": 5.0, "rooms": 4.0}, "id": 136926097}, {"rating": 1.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "Finally, the cabin is on route 9, 20 feet from route 9 where the road noise is terrible. Go somewhere else for a relaxing time.", "title": "Mouse/mice problem", "helpfulness": 3, "user": "Jennifer T", "date": "July 23, 2012", "detail_rating": {"service": 1.0, "cleanliness": 2.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 135174264}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "I had rented a different property from Berkeley Springs Cottage Rentals a few years ago for a girls' weekend (Cub's Loft) which was wonderful, and this time my family wanted to get away to the woods for Christmas so we tried a smaller place (Treetop at the Woods Resort). The folks in the office were a pleasure to work with, and when I tried to book a different cottage initially which resulted in a double-booking, I was offered a discounted rate for my second choice (which actually turned out to be perfect). The cottage was very clean, a bundle of wood was waiting next to the fireplace, and it had a great view of the woods. Wifi was faster than what we get a home, and while we never really watched TV (we had Scrabble tournaments instead!), we noticed that there were hundreds of channels available. Loved the fireplace and the views! We would definitely rent from this company again.", "title": "Another great experience", "helpfulness": 1, "user": "StJohnFan", "date": "December 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 148133590}, {"rating": 5.0, "title": "Another great stay.", "text": "We have been using Berkeley Springs Cottage Rentals for the past four years and have been consistently pleased with their service and selection. We have been treated professionally and fairly each and every time. We would not hesitate to recommend these folks to others.", "user": "JSS54", "date": "December 16, 2012", "id": 147542553}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "Stayed at the Log Cabin Getaway during the long weekend in July 2011. The place was comfortable and tastefully decorated. Loved the porch ! A number of games and movies were also provided. One of our favorite log cabin experiences ! Highly recommended.", "title": "Great place !", "user": "Srbk2009", "date": "December 13, 2012", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "location": 5.0, "value": 4.0, "rooms": 5.0}, "id": 147404215}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "We have rented from these folks for several years. We consider one cottage to be our \"home away from home,\" but we and our family members have rented several places, and the service has always been outstanding. Any minor problem has been handled quickly. The properties are clean, comfortable, and homey. In July during the big storm, my daughter had rented a property that lost power. The staff was quick to find her another residence, and our family reunion went on as scheduled. We also appreciate the pet-friendly accommodations. Great people, great service, great rentals!", "title": "Great people to work with", "helpfulness": 1, "user": "Margaret T", "date": "December 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 147124185}, {"rating": 1.0, "stay_parameters": "Stayed October 2012, traveled with friends", "text": "After utilizing Berkeley Springs cottage rentals for more than 5 years, I typically recommend properties to my friends and family. While staying at Nestled Pines Chalet for my annual women's retreat, it was obvious upon arrival that we made a big mistake renting this property. Not only was the place unclean, (i.e. stained carpets, dirty dishes, a broken microwave, mold in the bathroom,) the sewage smell near the hot tub was unacceptable! In fact, I didn't utilize the hot tub for this reason. The game room was hardly in tact, broken games, smell of mildew and overall, uninviting! Although they replaced the microwave, management told us that we are no longer welcome due to our complaints. This saddens me greatly, as I have been a huge fan of staying within their propterties. There were 6 women staying in the house (some of us are not very picky), who all agreed that we wouldn't have stayed there had we known what it would be like inside. The view was nice...enjoyed the outside of the property much more than the inside.", "title": "Nesteled Pines Chalet...unpleasant experience.", "helpfulness": 1, "user": "lpalmes", "date": "December 7, 2012", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 2.0, "rooms": 1.0, "location": 3.0}, "id": 146937904}], "location": {"country": "United States", "city": "Berkeley Springs"}, "variance": {"poor": 4, "average": 3, "very good": 10, "terrible": 9, "excellent": 29}, "aka": "Berkeley Springs Cottage Rentals Hotel", "slim_ranking": 1.0}