{"user_rating": 4.5, "review_count": 562, "name": "Bernini Palace Hotel", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed September 2007, traveled with family", "text": "This hotel was very disappointing. It capped off our month long trek of Europe and what a shame. The location is great and so is the breakfast but the staff was very rude and not helpful at all. We had one nice bell hop the 1st night and that was it. The room that we booked was for a “city view” and when we got our room the “view” was the room on the other side of the hotel and there was mold growing in our shower. For the price I would look elsewhere for a nicer, friendlier hotel.", "title": "Not worth the money", "helpfulness": 4, "user": "MESchlegel3", "date": "February 14, 2008", "detail_rating": {"front_desk": 2.0, "service": 2.0, "cleanliness": 2.0, "value": 2.0, "rooms": 2.0, "location": 5.0}, "id": 13561399, "likes": {"liked": "— location and breakfast included", "disliked": "— Staff"}}, {"rating": 4.0, "title": "It was a memorable stay", "text": "I stayed at Hotel Bernini for 4 days in december 2007 with my four year old son. The room was big, very clean and comfortable. I was really impressed. Location is also great, very central and you can easily walk around to shops,restaurants & museums. It is also very quite. Some of the staff can't really speak English & it was a bit fustrating at times, although i did come across a lady who was really helpful , knowledgeable & patient!. I certainly recommend this hotel to other travellers.Can't wait to stay there again the next time i visit Florence!.", "user": "savemysoul", "date": "January 22, 2008", "id": 12891823}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "This hotelhas a perfect location. The staff is friendly and helpful.", "title": "Wonderful Hotel", "helpfulness": 1, "user": "Aston11", "date": "January 22, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 12889219, "likes": {"liked": "— Position", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled with family", "text": "The rooms are clean and very nice. I booked a standard double room. It was large, the bed was huge and the bathroom was very nice with a big bathtub.", "title": "Loved the Bernini Palace", "helpfulness": 3, "user": "Kriselda", "date": "January 19, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 12795736, "likes": {"liked": "— Location", "disliked": "— small rooms"}}, {"rating": 4.0, "title": "A lovely stay at the Bernini Palace", "text": "Our family of two adults and three children stayed at the Bernini Palace for three nights. We had heard that the rooms were quite small, so we booked Superior Double and Triple rooms. The rooms were small, but no smaller than many European hotels. I can't imagine how small the normal rooms would be! However, the rooms were beautifully appointed. All furnishings were great. The bathrooms were small also, but ours managed to have a separate shower and bath,so not too cramped! The triple room for the kids was larger and had a fold-up bed. They had a nice window looking out to the street.", "helpfulness": 2, "user": "bubbula3551", "date": "November 14, 2007", "id": 10824390}, {"rating": 3.0, "stay_parameters": "Stayed June 2006", "text": "We stayed at the Bernini on the last night of our tour of Tuscany and were a bit disapointed. We figured we would splurge a bit for our last night but I don't think we got our money's worth. The hotel is undeniably in a great location, right off the Piazza della Signora. Our room was comfortable but somehow we expected more from a five (or four depending which web site you look at -- they claim to be 5 star) star hotel. The decor was very overdone -- unless you like everything covered in gold leaf -- and then you'll feel right at home. The photos showing the hotel on expedia must be old because the hotel didn't quite look like the pictures. The breakfast room was really lovely, as was the breakfast -- until we found out at checkout that it cost 30 euro for the two of us -- even though we were told the breakfast was included when checking in. Overall -- the location was great but the hotel was not worth the price.", "title": "Nice Location but a bit gaudy", "helpfulness": 4, "user": "Jason K", "date": "June 3, 2006", "detail_rating": {"cleanliness": 4.0, "value": 1.0, "rooms": 4.0, "service": 3.0}, "id": 5295117}, {"rating": 5.0, "title": "Loved the Bernini", "text": "I'm just back from spending the Easter weekend at the Bernini Palace Hotel, Florence. From reading previous reviews I understand the reception and bar/lounge areas have just recently been upgraded - and what an upgrade! When walking in off the street first impressions are of a boutique hotel but on a very grand scale. The lighting, though a bit dull, adds to the atmosphere - contemporary meets a flavour of Morocco - fabulous.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "April 20, 2006", "id": 4990237}, {"rating": 5.0, "stay_parameters": "Stayed June 2005", "text": "The breakfasts were fantastic though not included in our room price. One could spend all morning in the stunning breakfast room sampling the various dishes on offer.", "title": "It was great!", "helpfulness": 2, "user": "lawyerguard", "date": "March 30, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4822753}, {"rating": 5.0, "stay_parameters": "Stayed July 2003", "text": "The roof terrace on the fifth floor became our little haven away from the hustle and bustle of the streets below.", "title": "If only all my hotel stays were like this...", "helpfulness": 6, "user": "unimportant", "date": "March 25, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4731194}, {"rating": 5.0, "title": "Wonderful Florence Hotel", "text": "Our holiday experience was hugley enhanced by our stay at the Bernini. Loved it.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "January 1, 2006", "id": 4315649}, {"rating": 5.0, "title": "Should be a 5 stars", "text": "Wonderfull tuscan floor with daily canapes, fruits and champagne, great bar and terrace with jacuzzi, the staff is friendly and the location near signoria plaza terrific.", "user": "TUCK58", "date": "October 17, 2007", "id": 10090767}, {"rating": 3.0, "title": "Only stay on the Tuscan floor!", "text": "I'll be there again.", "user": "MrsRenard", "date": "October 10, 2007", "id": 10062617}, {"rating": 4.0, "title": "We, too, loved this hotel", "text": "We booked this hotel as part of our honeymoon trip. When we arrived we were shown to our room which was large but unfortunately very tired in appearance. Despite the images on their website it was not very opulent and was a mix of uninspiring furniture, chintz and a worn carpet. The bathroom was no better and had dirty grout and chipped tiles.", "user": "tanbo", "date": "October 7, 2007", "id": 10050658}, {"rating": 1.0, "title": "So Terrible we left!", "text": "My husband went to the desk to complain and to their credit they showed us other rooms - this time a suite and a regular double but the same in decor. We explained that we wanted something a bit more befitting for a honeymoon and they upgraded us free of charge to a room on the Tuscan Floor.", "user": "sweeetyjh", "date": "September 11, 2007", "id": 8692829}, {"rating": 5.0, "title": "Love this hotel!", "text": "Although not large the room was very nice with lovely furnishings and a large newly decorated bathroom. The hotel staff were very pleasant and recommended some nice restaurants and museums etc – it was a nice touch that on the Tuscan Floor pastries and coffee are left out in the afternoon and prosecco and nibbles in the evening for guest to help themselves to.", "user": "becd11", "date": "September 2, 2007", "id": 8606865}, {"rating": 5.0, "title": "Excellent Central Location", "text": "The staff and service were exceptional. Room was small but elegant and very quiet. But best of all for us was the location. The central location was ideal as we were within easy walking distance of every point of interest on our agenda. Very nice breakfast available in the mornings. I would not hesitate to recommend this hotel.", "user": "Got_soccer", "date": "November 6, 2007", "id": 10649614}, {"rating": 5.0, "title": "Fantastic Florence", "text": "Stayed in this fantastic hotel on a recent trip to Florence. I had a wonderful weekend break which was made even better by this lovely hotel. I stayed in room 504 which was beautiful; breakfast in Sala Parlemento was excellent and the staff were all very professional and friendly. Definitely a place I will return to in the not too distant future.", "user": "MazzaBerkshire", "date": "November 5, 2007", "id": 10619392}, {"rating": 2.0, "title": "Beautiful hotel, mediocre service", "text": "This is a beautiful hotel in a great location. Unfortunately, the front of house service is not up to scratch, especially for the price (420 euros for a double Tuscan room, 300euros for a single).", "user": "cuthbert", "date": "October 26, 2007", "id": 10348460}, {"rating": 5.0, "title": "The best!", "text": "One of the receptionists (apparently the senior front-of-house person) was very terse, bordering on the unfriendly.", "user": "dfalato02", "date": "October 20, 2007", "id": 10169573}, {"rating": 4.0, "title": "Good location and value", "text": "On our first night, as we sat down for the dinner we had booked, we were told to vacate our table for 5 minutes as the table was being used for a photo-shoot. Inevitably this soon became 10 minutes and so forth. No-one seemed to care that we were left hanging around for our table to be free.", "user": "tama_shiro", "date": "October 18, 2007", "id": 10121924}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "The Bernini Palace Hotel's selling point is its location in the historic center of Florence, a block from Piazza Signoria, three blocks from the Duomo in the undistinguished and busy Piazza San Firenze. Ask for a room that doesn't face the street--we didn't, but got lucky. The hotel's interior decoration is rather schizophrenic, the spare modernist lobby-lounge-bar area standing in sharp contrast to the heavily draped and brocaded guest rooms. I would have gladly traded our room's fancy trimmings for more floor, drawer, and closet space, though I could easily say the same about most city hotels I've stayed in--there's rarely enough drawer space. That said, our room was clean, very quiet, and well-maintained, the bathroom spacious and spotless. (I don't understand what Europeans have against shower curtains or full-width doors--it's so cold in the partially enclosed set-ups they seem to favor.) We didn't eat at the hotel at all, breakfast being extra and expensive. We grabbed coffee and pastry at a bar on the way to wherever we were going each day, and for dinner would particularly recommend Trattoria Gabriello, Via Condotta 54, just around the corner from the hotel--best bruschetta I ever ate. For fantastic gelato, don't miss Gelateria Vivoli, Isola delle Stinche 7, just a few blocks away near Santa Croce. The best part of our experience at the Bernini Palace actually took place after we got home. I realized I'd left behind a scarf that I'd bought in Venice and called, not really expecting anything. But the maid had in fact found and saved the scarf, so my cousin (who lives in Florence) stopped by and retrieved it. To me, that experience alone speaks volumes about the quality of both the staff and the management of this hotel. I'd definitely stay there again.", "title": "Unbeatable Location in Florence", "helpfulness": 6, "user": "WHTraveler", "date": "April 10, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7327306, "likes": {"liked": "— location", "disliked": "— lack of drawer space"}}, {"rating": 2.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "This hotel is in a great spot and is very beautiful if you like the classic Italian decorated rooms.(We did)", "title": "Christmas week in the Bernini Palace Hotel", "helpfulness": 7, "user": "OHMSS", "date": "April 7, 2007", "detail_rating": {"cleanliness": 4.0, "front_desk": 2.0, "location": 3.0, "value": 2.0, "rooms": 4.0}, "id": 7291688, "likes": {"liked": "— Location", "disliked": "— Manager"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "We booked for 4 nights half board, breakfast and dinner.", "title": "Lovely 4 star hotel", "helpfulness": 2, "user": "Royal_Honeymooners", "date": "April 4, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7280829}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "All was fine for the first two days fantastic food and service.", "title": "Pure luxury", "helpfulness": 5, "user": "E_Hemingway", "date": "March 5, 2007", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 6917517, "likes": {"liked": "— Location", "disliked": "— Mini Bar prices. But easily got around by buying the contents at local shops."}}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled with family", "text": "Then on the 3rd night we went down for our evening meal.", "title": "Excellent hotel with superb location!", "helpfulness": 5, "user": "astro50", "date": "December 18, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6457362, "likes": {"liked": "— location", "disliked": "— Not too many tv channels, no business center with pc."}}, {"rating": 4.0, "title": "Nice hotel in the center of town", "text": "This hotel was lovely, newly renovated and very centrally located. We had 2 large rooms with a private hallway connecting them, which was perfect for our family with young children. The rooms are decorated with beautiful antiques, as is the entire hotel - the breakfast room is particularly beautiful. The staff was helpful and our stay was enjoyable.", "user": "syland", "date": "August 21, 2007", "id": 8465447}, {"rating": 5.0, "title": "Great location, great service", "text": "We used this hotel for a week as a base for my daughter's wedding in Florence - so we had about 12 rooms. The management couldn't have been more helpful, particularly David Foschi, the reception manager who did everything possible to make our stay as comfortable and convenient as possible.", "user": "Hypercritic", "date": "July 23, 2007", "id": 8222289}, {"rating": 5.0, "title": "Loved this hotel!", "text": "The first floor of the hotel has recently been refurbished, Tuscan style, and these rooms are sizeable and beautifully appointed - very stylish and in keeping with the area.", "user": "denlex", "date": "July 16, 2007", "id": 8128905}, {"rating": 3.0, "title": "Great location but...", "text": "The position of the hotel is perfect - right by the Palazzo Vecchio and Uffizi Gallery, 2 minutes from the Ponte Vecchio and 3 minutes from the Duomo - but despite its central location it manages to be very peaceful - with a cool (in all senses) bar to retreat to.", "user": "RoloSD", "date": "July 6, 2007", "id": 8068379}, {"rating": 5.0, "title": "Good hotel in the heart of Florence", "text": "Great, historical breakfast room with great big and varied breakfasts - and a lovely little roof terrace if you want to chill out for a bit, several floors above the Florentine hubbub.", "user": "tjjism", "date": "June 27, 2007", "id": 8004539}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled with family", "text": "Hotel Bernini is within walking distance of so many of the points of interest in Florence. You can walk out the front door and stroll to a plaza within minutes. We booked a private tour through the hotel, we visited the Tuscany wine areas, with stops at San Gimignano and Siena. Helena, our tour guide and driver was excellent. She was very knowlable and fashioned our tour to our interests. Hotel Bernini's foyer is a bit much with the gold glitz but the housekeeping is wonderful when they turn down your beds and light candles in your rooms at night. The breakfast room is huge, with a nice selection of foods with great background music playing. Stefano, the bartender is also highly recommended. He takes pride in preparing your drinks and tapas with the highest of care and quaility. We would defineitly stay at this hotel again. It's worth 5 stars!", "title": "Great Location", "helpfulness": 1, "user": "DiFred", "date": "November 5, 2006", "detail_rating": {"cleanliness": 5.0, "front_desk": 4.0, "location": 5.0, "value": 5.0, "rooms": 5.0}, "id": 6060289, "likes": {"liked": "— Location.", "disliked": "— Outdated halls and elevator."}}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "My husband and I stayed here for two nights on our honeymoon across Italy. The staff are wonderful and the hotel is in prime position in Florence. We would love to stay here again.", "title": "Lovely Experience", "user": "smh888", "date": "September 18, 2006", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5811805, "likes": {"liked": "— The room", "disliked": "— The stairs"}}, {"rating": 4.0, "title": "Excelent hotel, tiny room", "text": "A superb and very elegant place, right in the heart of this magnificent city.", "helpfulness": 6, "user": "cymroabroad", "date": "September 12, 2006", "id": 5791797}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled solo", "text": "Our experience was very satisfying, with efficient and helpful concierge (not many smiles, but very courteous and professional in all dealings). Our bedroom was booked via an Expedia package and by coincidence or maybe as a consequence, was the smallest on the third floor - Room 308. However, despite the lilliputian dimensions, the room was spotless, sumptuously furnished, with a comfortable 5' bed and a gleaming chrome and marble bathroom.", "title": "Loved it!", "helpfulness": 2, "user": "Luli", "date": "August 23, 2006", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 5701394, "likes": {"liked": "— The very warm and sumptous atmosphere", "disliked": "— The breakfast, which was still good."}}, {"rating": 4.0, "title": "Good locaton with in easy walking distance to all attractions", "text": "The cocktail lounge is very swish and served an awesome Negroni, accompanied by freshly made appetizers that made the experience very stylish indded.", "helpfulness": 1, "user": "BJFRITZ", "date": "July 31, 2006", "id": 5531998}, {"rating": 5.0, "stay_parameters": "Stayed October 2005", "text": "My husband and I knew this hotel was a little pricey but decided to splurge and stay here our last night in Florence. We're so glad we did! Of the 5 hotels in 4 towns we stayed in in Italy in October, this was our favorite. We were given a reduced rate for a newly renovated 2 room suite (#109) that took our breath away. Moroccan design, gorgeous furniture and fabrics, 2 flat screen TV's, state-of-the-art lighting, huge marble bathroom with double sinks and bathtub. Breakfast was included in a beautiful dining room and included all the usual offerings plus scrambled eggs and champagne. We hope to return to this lovely hotel and stay for a week!", "title": "Our favorite - sumptuous and elegant!", "helpfulness": 7, "user": "sharon2004", "date": "November 2, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 4080933}, {"rating": 5.0, "title": "Loved the \"white stuff\" you put on the croissants!!!!", "text": "I LOVED this elegant old hotel. My son had just moved to Florence and I had been staying with him. I stopped in the Bernini to see if I could get a room. They had a suite available for a very reasonable price. I stayed alone for a week and enjoyed every second of it!! I especially loved their breakfast.....that white cream or cheese or whatever it was that I put on their croissants was unbelievable!! I often wake up thinking about that stay and dreaming I am eating that \"white stuff\"!! I loved getting up, stopping down the way to get my latte and then headed for the internet cafe!! It is so much fun to do that. Everything is so close to that hotel. Even one of the world's most famous gelati stores!! I had about 3 of those a day! And at the end of the day I was always anxious to go to my wonderful hotel and crawl into that big, soft, squishy bed!!!! Stay there....you would love it.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "August 24, 2005", "id": 3805440}, {"rating": 2.0, "stay_parameters": "Stayed August 2005", "text": "We stayed in this hotel for the final 3 days of our honeymoon. Although when we arrived the staff were excellent (received champagne etc) and given a great room we didn't feel the hotel reflected 4 stars. There was no e-mail access or terrace and we found the staff very unhelpful and rude.", "title": "a bit of a let down!", "helpfulness": 4, "user": "JP75", "date": "August 24, 2005", "detail_rating": {"cleanliness": 5.0, "value": 1.0, "rooms": 4.0, "service": 1.0}, "id": 3803254}, {"rating": 2.0, "title": "Great location, but that's it", "text": "Although very central we would not stay here again. We felt the hotel was not in the four star league!", "helpfulness": 4, "user": "A TripAdvisor user", "date": "August 14, 2005", "id": 3760859}, {"rating": 2.0, "title": "beware of renovations", "text": "We spent four nights at the Bernini. The location is excellent. Florence is small enough that you walk almost everywhere, but by staying here we were able to return to our hotel several times a day to freshen up, drop off packages, pick up umbrella, etc.", "helpfulness": 5, "user": "SPP", "date": "May 22, 2005", "id": 3492691}], "location": {"country": "Italy", "region": "Tuscany", "continent": "Europe"}, "stars": 4, "variance": {"poor": 20, "average": 28, "very good": 141, "terrible": 5, "excellent": 368}, "aka": "Bernini Palace By Baglioni Hotel", "slim_ranking": 0.0562770562771, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 5.0}, "description": "Originally a 15th century “Palazzo”, the Hotel Bernini is built according to the Classic Florentine architectural style, with string-course cornices along the walls and wooden shutters giving it a charming antique flavor. The Bernini Palace is located in Florence’s historic center, right behind Piazza della Signoria - just a stone’s throw from the Uffizi and Florence’s main historical attractions. The rooms are 74, Classic, Superior, Deluxe, Junior Suite and Suite, all are fitted out with the best, most up-to-date mod-cons and still preserve the charm of the past. The Tuscan Floor is reminiscent of old world Tuscan colours and themes, very warm and inviting. The new restaurant La Chiostrina is located in a historical courtyard of the hotel, it is the ideal place for delicious gastronimic specialities in Florence, its versatility makes it an excellent restaurant offering an innovative menu. A full breakfast is served in the magnificent Sala Parlamento (complete with a splendid frescoed ceiling) formerly a meeting place for members of Parliament and Senators of the Kingdom of Italy"}