{"user_rating": 3.5, "review_count": 31, "name": "Berrima Bakehouse Motel", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "The reception greeting was efficient and the room was quiet, warm and clean. This motel is in a fantastic position in Berrima within a short stroll to everything. We were able to keep our cars parked in the motel even after checkout which was very helpful.", "title": "Great location", "helpfulness": 1, "user": "ohsevenphive", "date": "May 18, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 130142539}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled on business", "text": "We will certainly stay again.", "title": "Cosy & Quiet", "helpfulness": 1, "user": "Mel S", "date": "April 27, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 128738475}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled with family", "text": "Found the Motel to be clean, comfortable, and cosy specially during the cool evenings. The air-conditioning worked well and the filter was clean. I ate at the Magpie Cafe for dinner and breakfast (after 7)and the meals were superb without the high price tag. The Cafe was not licensed but the Hotel (Surveyor General Inn) was next door. The Hotel also has a Bistro and both are directly opposite the Motel.", "title": "The Place To Stay!!!!", "helpfulness": 4, "user": "grilldog", "date": "April 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 127276056}, {"rating": 3.0, "stay_parameters": "Stayed August 2011, traveled on business", "text": "My family and I recently spent two nights at the Berrima bake house motel.", "title": "Poor reception", "helpfulness": 3, "user": "jpr243", "date": "August 26, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 2.0}, "id": 117271521}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "On arrival we were amazed how neat and tidy the motel grounds were kept.", "title": "pleased good value", "user": "rogerbairnsdale", "date": "May 31, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 110846284}, {"rating": 4.0, "title": "Just what we were after", "text": "Very happy with our stay at the Bakehouse. It is not a quaint B&B but as a motel accomodation it was at the better end in terms of cleanliness and nice grounds where the kids could run around. It is also in a cracking location if you want to do anything on foot - ie short walk to the shops and not too far from the country pub. Very convenient base for a big family group (we had 4 rooms in total).", "user": "jvws94", "date": "September 22, 2010", "id": 80543129}, {"rating": 3.0, "title": "pleasantly comfortable", "text": "Felt anxious about staying here after browsing through recent reviews, however, the room was large, very clean and comfortable. Heating was exceptional given the dreary conditions, the bed slept well. All in all, a very comfortable and cosy stay in a fabulous location with restaurants, shops and pub just steps away. You must dine at the BLACK SWAN which was perhaps one of the finest meals we have ever had within an ambience that is sooooo perfect it will remain literally UNFORGETTABLE!!!", "user": "caroline077", "date": "September 4, 2010", "id": 78265738}, {"rating": 4.0, "title": "Neat, Clean, Conevnient", "text": "Stayed at this motel in Berrima in August. Not sure as to the individual experience of the previous reviewers. Didnt have any problems. Motel was neat and tidy and what i'd expect for an older style place. There isnt much choice in terms of places to stay. Was close to the restuarant (across the road) we were eating at for a family function. Take your warm clothes in winter as the Southern Highlands is COLD in winter.", "user": "Jamebo888", "date": "September 2, 2010", "id": 78063460}, {"rating": 1.0, "title": "Abysmal", "text": "Old and delapidated and smelly room with out of date furniture. Rude manager named Danni who could not get the details of our booking correct and was abusive in return in spite of us remaining very pleasant to her.", "user": "mokumBondi", "date": "April 1, 2010", "id": 60123122}, {"rating": 1.0, "title": "Berrima should be ashamed of its motel", "text": "The crunch came when loading luggage in the vehicle I lost some of my belongings as there were no other guests remaining on the complex, and nothing was left in the room except a loaf of stale bread. I will leave the rest to your imagination, the matter was reported to my local police station but without clear evidence no action could be taken.", "user": "broadwood24", "date": "October 1, 2009", "id": 45564737}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "This is a great motel and was recommended by a friend who has been going to it for years. We were impressed with the cleanliness, nice grounds, welcoming staff and the warmth factor! The new aircon unit worked a treat as well as the electric blanket. We stayed on a Saturday night and found it quite highly priced but the location was great so I guess it was worth it.", "title": "Good motel accommodation, quiet and clean", "helpfulness": 1, "user": "CiaraB", "date": "July 22, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 135036923}, {"rating": 4.0, "stay_parameters": "Stayed July 2012", "text": "I recently stayed here for one night with my partner. We were pleasantly surprised at the rate and Loved the tranquil setting and access to all cafes etc. Very clean and would definitely stay here again. A great short stay/getaway location.", "title": "A really pleasant place to stay that's good value.", "helpfulness": 1, "user": "BooBoo007", "date": "July 4, 2012", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 133415578}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "We are locals who got flooded out and couldn't get home. Michael and his family were very generous at 9:30pm at night and nothing was a problem. Checkout was easy from this very centrally located motel with lovely comfortable beds, fresh linen and good pillows. We all slept soundly and the price was excellent!", "title": "Lovely accommodation with Generous Innkeepers", "helpfulness": 1, "user": "Madala53", "date": "June 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 132716921}, {"rating": 4.0, "stay_parameters": "Stayed June 2012", "text": "Clean quiet and comfortable rooms. We stayed a Sunday night. Excellent value for money. Air conditioning worked a treat.", "title": "Perfectly central", "helpfulness": 1, "user": "Michelle_LWollongong", "date": "June 17, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 132194384}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "We stay here each year on our way back from Northern NSW. I love Berrima, and the Bakehouse is right in the middle of everything. The rooms are basic, but fine, and have everything we need. Price is good.", "title": "Great location", "helpfulness": 1, "user": "hillbilliechic", "date": "June 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 131581495}, {"rating": 4.0, "title": "Motel in quaint historic town", "text": "We were recommended this motel by a friend living in Berrima as we were attending a wedding - quite a few of the guests stayed there. The rooms were massive but fairly basic (we only had \"standard\" level accommodation - the higher levels offered slightly nicer decor or more comfortable chairs). The bathrooms were a little basic aswell - probably need some modernising, but quite adequate and certainly nice and clean. Breakfast was extra and had to be ordered the night before; it is delivered to your room at a time of your convenience.", "user": "JoFromBracknell", "date": "April 20, 2007", "id": 7402823}], "location": {"country": "Australia", "continent": "South Pacific", "city": "Berrima"}, "variance": {"poor": 1, "average": 5, "very good": 20, "terrible": 2, "excellent": 3}, "slim_ranking": 1.0}