{"user_rating": 4.0, "review_count": 120, "name": "BEST WESTERN of Walterboro", "reviews": [{"rating": 4.0, "title": "Comfortable and clean", "text": "We were on our way from NYC to Fla and decided to stop for an overnight stay.", "helpfulness": 6, "user": "NativeNYorker", "date": "March 27, 2006", "id": 4738237}, {"rating": 4.0, "title": "Safe Port in a Storm", "text": "Stayed here briefly to hunker down during a tornado warning. Front desk staff were friendly and polite, quickly finding us an available room.", "user": "The_Lewis", "date": "March 18, 2008", "id": 14363020}, {"rating": 2.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "The room and bathroom were clean, with two double beds on the ground floor facing the interior courtyard. Coffee maker in room and breakfast included in the morning.", "title": "Hidden cost for pets", "user": "sherriinfreehold", "date": "February 9, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 13400478, "likes": {"liked": "— ease of access", "disliked": "— hidden costs"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled with family", "text": "Paid $90, avoided the hail and no tornados touched down within 5 miles! Which has to be a positive.", "title": "Fantastic motel-Great stays", "helpfulness": 2, "user": "1gale1", "date": "December 13, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 11515225, "likes": {"liked": "— Clean rooms- great staff", "disliked": "— Nothing-Everything was fabulous"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "The hotel was nice enough but we did not find out about a $15 fee for our dog until we checked out. It wasn't posted anywhere and I told them on check in that we had one but the cost was not mentioned. I couldn't find anything about a fee on the website when I booked. Clean room, comfortable bed, right off 95.", "title": "Nice Motel, Great Staff", "helpfulness": 1, "user": "soulprovider915", "date": "December 3, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 11226004, "likes": {"liked": "— Cleanliness"}}, {"rating": 4.0, "title": "remodeled and clean", "text": "We have stayed at this motel several times this past year and each stay the rooms were immaculate! That was the cleanest motel we have ever stayed in. There were lots of pillows, nice fresh soft linens and the bed was unbelievably comfy. The entire staff was pleasant and helpful in making our stay as comfortable as possible. The rate was very reasonable also.The breakfast, which was sausage gravy, sausage and egg biscuits, cereals, patries, yogurt etc. was delicious.We would definitely recommend this motel to everyone. The great southern hospitality everyone speaks of can definitely be found there.", "helpfulness": 1, "user": "shopperqueen", "date": "August 15, 2007", "id": 8425468}], "location": {"country": "United States", "city": "Walterboro"}, "variance": {"poor": 13, "average": 19, "very good": 54, "terrible": 4, "excellent": 30}, "aka": "Best Western Of Walterboro Hotel", "slim_ranking": 0.3125, "description": "Welcome to BEST WESTERN Of Walterboro!Explore historic Walterboro and nearby Charleston with a stay at the pet-friendly BEST WESTERN of Walterboro, located near Tuskegee Airman Monument.A variety of key area attractions surround this superior Walterboro hotel located in the South Carolina low country, close to I-95 and halfway between South Florida and the Mid-Atlantic States. Browse the South Carolina Artisan Center, browse antique shops, visit the famous Great Swap Sanctuary, see historic sights at the Veteran's Memorial and the Tuskegee Airman Monument, get some sun on nearby Edisto Beach, or indulge in outdoor adventure with a variety of hunting, fishing and hiking opportunities nearby. In addition, Savannah, Charleston, Hilton Head and Beaufort are all just an hour drive away, making them great day-trip destinations for those staying at this Walterboro hotel. While in town, try to catch the annual Rice Festival in April and the Criterion Race and Rodeo in May - both local favorites!For those here on business, BEST WESTERN Of Walterboro is the perfect lodging choice because of our on-site business services and close proximity to local businesses, including Colleton County Industrial Park and the Boeing Manufacturing Plant. Charleston Air Force Base is also nearby for those visiting friends or family living on base.For the ultimate in comfort and convenience, each guest room at this hotel in Walterboro comes complete with cable satellite television with HBO® and free wireless high-speed Internet access. Other amenities at this Walterboro hotel also include complimentary full breakfast each morning, an Olympic size outdoor swimming pool, state-of-the-art fitness center and easy access to the adjacent Ruby Tuesday's restaurant.BEST WESTERN of Walterboro's friendly staff is ready to welcome you here and make your nest Walterboro hotel stay unforgettable."}