{"user_rating": 4.5, "review_count": 237, "name": "BEST WESTERN PLUS Vancouver Mall Dr. Hotel & Suites", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "Check in was fast and easy. Room was large and clean. Bed was comfortable. Room was quiet and I did not hear our neighbors. Location was next to mall, however, we didn't go to mall, so can't speak to it. We did eat at Round Table Pizza in the mall area and wasn't very impressed. Pizza was okay, Wings were awful. Breakfast buffet was clean and served cereal, fruit, yogurt, waffles, eggs, sausage/bacon, bagels, toast, and juice. It was plenty and all you can eat.", "title": "Nice Clean Hotel", "user": "Bobkatevan", "date": "July 16, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 167820692}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "Great place to stay if catching a flight out of Portland, OR. Several good restaurants within the vicinity. Nice place to relax around the pool. Arrived late and every thing was ready for check in. Went with grown up family and they all enjoyed the rooms and area. Nice large rooms instead of two chairs maybe a small sofa would be nice to set in and watch tv.", "title": "Oregon vacation", "user": "Scott H", "date": "July 16, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 167877331}, {"rating": 5.0, "stay_parameters": "Stayed July 2013", "text": "I came in a few weeks ago and the front desk gentlemen was kind, couteous, and very polite. I believe his name was Joe or Josh, cant remember. Moreover, he made our check in an enjoyable experience and talked to us like we were old friends. I will most definitely be returning because of him and the rest of the great friendly staff. Thanks again!", "title": "Amazing customer service!", "user": "lalalittlebird", "date": "July 16, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 167736956}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "Our family of 5 stayed at the BW Plus Vancouver Mall, WA in July 2013. The suite we had (2 King Beds plus a sofa bed with 2 bathrooms) was adequate for our need. The complementary continental bfast was above average and there was always a freas pot of coffee available throughout each day of our stay. The front desk staff were very courteous and helpful. The location was convenient as the biggest mall in Vancouver, WA was 5mins away. Also, as the hotel was our homebase, we found it easy drive across into Portland and around Oregon for day trips. It was always wonderful to comeback to the BW Plus Vancouver after a whole day of activities. Thank you to the wonderful staff at the hotel who always had a welcoming smile!", "title": "Excellent Experience", "user": "Chris F", "date": "July 15, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 167744556}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "I stayed in your Hotel from the 9th to the 12th of July 2013. I simply can't find the words to express my experience . Your hotel works like a well oiled machine. Every person on the staff was kind and very efficient in their job. This was very difficult for me physically and emotionally. This staff me they cared what was going on in my life at that time. This trip to see my sister whom I hadn't for ten plus years would not have been possible without the generosity of the general manager of this hotel. I have no doubt that God allowed our paths to cross for a reason. Beyond this, I choose not to go into great detail.I cannot thank you enough for making this trip tolerable.i will be eternally grateful and pray that God will bless you and the business. Keep up the excellent work in serving those who need you.", "title": "Fabulous Stay", "helpfulness": 1, "user": "shadowdck", "date": "July 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 167584521}, {"rating": 4.0, "stay_parameters": "Stayed June 2013", "text": "I was in town for the Cat Fanciers' Association annual meeting, and booked this BW several months in advance. The clerk at the front desktried to charge me the rack rate of $150/night, but I had booked it for significantly less, and received my rate. When I went to check out, a different clerk had my rate as $116.99 per night, again, higher than what I had initially received. He said he would straighten it out and email me the corrected bill.", "title": "Clean, spacious rooms, minor glitches", "user": "Suziewrite", "date": "July 2, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 3.0, "rooms": 5.0}, "id": 165990607}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "I flew back home to VA, but no sign of an email. Called the hotel, and they finally hd someone on the front desk who knew what she was doing, and cheerfully fixed the problem, refunding the $100+ difference.", "title": "AMAZING", "user": "Ayanna N", "date": "June 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 165614377}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled with friends", "text": "All that aside, the hotel is very clean, the rooms are spacious, the beds are comfy, flat screen tv works well. The buffet breakfast is typical, snd also offers scrambled eggs with bacon or sausage.", "title": "clean", "user": "TMac012", "date": "June 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 165387262}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled with friends", "text": "Although it's supposed to be in or near a mall, it is very quiet, and you can't see the mall from the property. It's about 10-15 minutes from Portland.", "title": "Really Great.", "user": "Carol S", "date": "June 24, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 165058236}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled on business", "text": "I was in between homes during our stay and it was a very hard time for me and my family and all the staff down to the cleaning staff made my trip amazing. The manager was amazing and worked with me to make it possible to even stay. I can't gush enough about my room and my over stay. I didn't want to leave:) I will definitely recommend this hotel as well as this will be the only hotel in Vancouver I will ever stay in again.", "title": "MH", "user": "Micky H", "date": "June 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 164920058}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "We recently had a small family reunion with my Dad (92) and his 3 brothers (youngest 80). Your facility had the best service, cleanliness, comfort, and the best experience I've seen in many years. Your full breakfast provision was great. And, being a bunch of crazy Scandinavians, the readily available coffee and cinnamon rolls were a hit, too. Will definitely stay here next trip to Vancouver, WA.", "title": "Best Hotel Experience in Many Years", "user": "David F", "date": "June 22, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 164809352}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "PS, glad We booked early as I noticed others here who also regarded the accommodations excellent as there were no vacancies while we were here.", "title": "Barb&Dave", "user": "dlstock", "date": "June 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 164662322}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "Have stayed at your hotel several times in the past few years. We are both 82 years old have have traveled extensively. We both agree that your hotel ranks among the best in value, service, comfort and over all great staff. Appreciate the cleanliness and great breakfast, also the lobby coffee. Keep up the good work!", "title": "I highly recommend staying here...", "helpfulness": 1, "user": "R D", "date": "June 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 164508798}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled on business", "text": "My husband and I recently attended our daughter's graduation from Prairie High School. We booked our hotel based on the following criteria: location (proximity to when my step-children live, accessibility to/from major highway, near restaurants and shopping), amenities, price, and reviews on TripAdvisor. We arrived around midnight and checked-in. My first impression when I walked in the lobby was it did not have high-tech stuff but it was welcoming and felt like home. The front desk staff was very friendly and efficient, he gave us a brief direction of where things were and we were in our room quickly. The room was very pleasant, clean, and much nicer than what I expected. We stayed for 3 very restful nights. The hotel has a pool, breakfast and other amenities that I did not really get to enjoy but my step-son did with his dad. We spent a lot of time in Portland, Oregon which is only a 20-minute drive from Vancouver. I would definitely stay here again next time we visit Vancouver, Washington. With or without kids, this is a great place to stay.", "title": "Great value, great sleep, friendly staff", "user": "Chadderboxx", "date": "June 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 164435574}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "I live in Vancouver, Vancouver BC though. I drove down last Sunday for a business trip that had me working my way from Portland back toward Vancouver for 4 days and decided to get a hotel in Vancouver, WA for the night as I had been driving for a better part of the afternoon/evening and I had some meetings to start in the AM that kept me just on the WA side of the Columbia River.", "title": "Nice Hotel", "helpfulness": 1, "user": "Schwib", "date": "June 6, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 163171766}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "If you want relaxation and to be away from the bustling city center this is the place for you. You can easily catch a cab and attend any of your favorite attractions. At night you can relax on your balcony and watch the boats in the harbour. There is a few good restaurants across the street and you can get some exercise by walking along the docks.", "title": "great place to stay", "user": "smartcook", "date": "July 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 167471468}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "I have found the Van Mall Best Western to be, far and away, the BEST lodging I've experienced, even after a 30 year career with some traveling on Government Business. This specific location exceeds my expectations and makes it VERY easy to make reservations and to enjoy the services provided. I would only suggest that, if feasible, that more handicapped rooms (with the walk-in shower) be available, and that at least one be able to accommodate another adult in the room.", "title": "Customer Satisfaction", "user": "Meredith M", "date": "July 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 167471593}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "I'll just start by saying that I stay at Hotels once or twice a week, and have done so for the last 30 years. So being a seasoned veteran I can truly say that my experience at this property was first class. I had never been to this particular Best Western before, but found the room to be very CLEAN and QUIET !!! This was the 1st vacation I had taken with my wife without our kids in many moons. At check I was visiting with the front desk clerk and mentioned how very happy I was to get away with my wife and that we were in town for the Fleetwood Mac concert that night,( yes they rocked) and then off to the coast. When we got to our room, much to our surprise they had up graded us to a hot tub suite. WOW... The morning breakfast bar was well stocked with all the basic food groups, and check out was a wave to Alex and his wonderful staff.", "title": "BUT WAIT THERE'S MORE !", "user": "COOKIEVAQUERO", "date": "July 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 167118220}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled on business", "text": "I will visit this Best Western again when I get to the Vancouver area and will recommend this Hotel to all my co-workers and family.", "title": "Wonderful hotel!", "user": "HuskerFan24_48", "date": "July 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 166682937}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled on business", "text": "Keep up the good work !!!", "title": "Novinium/Clark PUD work/visit", "user": "Dennis M", "date": "July 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 166221691}], "location": {"country": "United States", "city": "Vancouver"}, "stars": 2.5, "variance": {"poor": 6, "average": 16, "very good": 51, "terrible": 1, "excellent": 163}, "aka": "Best Western Plus Vancouver Mall Dr. Hotel And Suites", "slim_ranking": 0.0384615384615}