{"user_rating": 3.5, "review_count": 430, "name": "BEST WESTERN McCarran Inn", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "Staff were very helpful, rooms large and clean and close to the airport.", "title": "Very handy for one night in Vegas", "user": "TravellingM", "date": "November 29, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 121201693}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "We had to change rooms as we were right next to a very noisy vending machine. Not a problem though as they moved us straight away. My husband heard a lot of air traffic over night but i didn't, you are next to the airport though so you would expect that type of noise.", "title": "AN ECONOMICAL PALCE TO STAY IN LAS VEGAS", "helpfulness": 1, "user": "CLARECM", "date": "November 28, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 121151893}, {"rating": 3.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "There is a free shuttle that takes you where you want on the strip which is great, the only slight problem is if you do have to get a Vegas taxi, they don't know where the hotel is! They were asking us for directions, we'd only landed a few hours ago so didn't really know!", "title": "Great location next to the airport and the strip but a bit old", "helpfulness": 2, "user": "adventix", "date": "November 25, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 121009552}, {"rating": 3.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "That's not the fault of the hotel as it's just off the strip but something to bare in mind, keep a map of where the hotel is in your bag, even with the address the taxi drivers were lost!", "title": "Just an okay place to stay", "user": "DiegoFlorida", "date": "November 24, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 120996890}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled with family", "text": "I'd definitely stay here again.", "title": "Cheap Hotel near the Las Vegas Strip", "user": "rainner d", "date": "November 16, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 120683945}, {"rating": 1.0, "stay_parameters": "Stayed October 2011, traveled on business", "text": "Pretty much the worst experience I have ever had at any Hotel! Broken glass on sidewalk cut my friends foot extremely bad and after telling them it was still there 3 days later, no offer of medicine or a bandaid. They gave a card key to some old guy that just about tore the security lock off our door trying to get in, their response was, he's ok. My reply, are we ok? No apology! Most employees obviously did not like their job and were rude ( the desk help). The housekeepers could not understand enough english to help w/ anything we asked for. People fighting in room next door and locking each other out so the other would beat on the door. Alarm in empty room next door going off for hours in the very early Am ( Like 1:00), had to ask desk help to shut it off, their response was why didn't you call instead of walking to desk. Homeless people going through the garbage cans just outside our window and an all night Postal dist that yelled 24 hrs a day on an intercom system just a stones throw away!", "title": "Sucked!", "helpfulness": 9, "user": "Billie s", "date": "November 13, 2011", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 1.0}, "id": 120552447}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "Room and overall property was very clean. Service personnel were friendly and helpful. Desk clerk was available in the after-hours for late registration. Continental breakfast at the property was generous. Noise level was never an issue. All room equipment worked. Plenty of easy access parking space. Free shuttle to the strip. Best Western McCarran Inn was definitely a great alternative. We will definitely come back to the Inn again.", "title": "Much better than expected.", "helpfulness": 1, "user": "Victor S", "date": "November 13, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120549180}, {"rating": 1.0, "stay_parameters": "Stayed October 2011, traveled with friends", "text": "As a Platinum Member of Best Western, I expected better treatment from this property, but management obviously doesn't care about customer service at all. This property made an error with regards to a Best Western Gift Card that I had, and their error cost me 20 Dollars. When I talked to their Manager on the phone, I was told that they could do nothing for me! This was their error, not mine, yet he refused to help me at all. I mentioned that I was a Platinum Member, and stayed at their property often, but that got me nowhere, just the sorry, there is nothing we could do. He did offer to suspend the employee who made the error, which isn't what I was looking for! I asked that they not do that, but look after me in some way on my 20 Dollar loss which was their fault. Nope, they weren't going to do it!! I finally told the Manager that I would never stay at the property ever again, and that I already had 2 reservations to stay there in a couple of months that I was going to cancel. he told me he understood if I did. Wow, not what I was expecting to hear. Business must be very good for them to treat customers this way. I was thinking maybe they would give me a discount for 1 of my upcoming nights, or comp a room for a night, but no, nothing. So, I cancelled 3 nights of stays which equals over 8 times what they screwed me for Dollar wise. I can't believe the Manager was willing to lose thousands of Dollars of revenue over the upcoming years, all over a 20 Dollar mistake that generated at their end. In fairness to the Best Western Chain, they are looking after me and sending me a 20 Dollar Gift Card to cover the Hotels error, so I am fine with that. Stay at any Hotel except this one in the Best Western chain, the customer service from management is horrendous at this location, and very unprofessional that their solution to this is to suspend the poor employee who made the mistake.", "title": "Poor Customer Service From Management", "helpfulness": 18, "user": "stern4422", "date": "November 4, 2011", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 3.0}, "id": 120161254}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "I thought right next to the airport would be noisy but it was not. Excellent breakfast. Great shuttle service to airport", "title": "Surprisingly good", "helpfulness": 2, "user": "Thomas L", "date": "October 29, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119876033}, {"rating": 3.0, "stay_parameters": "Stayed October 2011, traveled solo", "text": "Older hotel, virtually on the airport property. It took 3 calls and 40 minutes for the driver to pick us up from the airport. Then neither he nor the other guy in the van (friend? trainee?) spoke any English. Happily going back to the airport at 0500, he was on time!", "title": "Great location to airport, but that's it.", "helpfulness": 1, "user": "doxieladytitusville", "date": "October 29, 2011", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 119867238}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "We stayed here one evening on our way to the national parks in Arizona and Utah. It served its purpose. If visiting Las Vegas for the dining and casinos I would recommend choosing another hotel as it is not convenient or close to these options. It is very inexpensive if just stoppping over (be sure to check out senior and AAA discounts). Great breakfast included. For the price and location was a good option for us.", "title": "For short stay good choice", "user": "sedum37", "date": "October 12, 2011", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 5.0, "sleep": 5.0, "rooms": 3.0, "location": 3.0}, "id": 119219470}, {"rating": 2.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "One complaint: the room smelled musty upon arrival. After running the AC for a while it was ok. Didn't change rooms or complain to management since we were there only one night and wanted to get to sleep to get an early start the next day.", "title": "Not What We Expected", "helpfulness": 3, "user": "luvstravel2", "date": "October 11, 2011", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 3.0, "sleep": 1.0, "rooms": 2.0, "location": 3.0}, "id": 119191635}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "We stayed here the last night of a 15 day trip because of the convenience to the airport and free shuttle service. We had to return our rental car that evening because we needed to be at the airport the next morning at 5 am. We were told by the front desk to take the rental car shuttle back to the airport, give McCarran Inn a call, and they would pick us up within 1/2 hour. When we called them at 7:05 pm, we were told we would be picked up at 7:30. At 7:45 I called again, and the person at the front desk said he would look into it and someone would be right there. Finally at 8:10 the shuttle arrived and the driver said he was never told earlier that anyone was waiting for him. If we thought it would take that long, we would have taken a cab back to the hotel. The front desk just shrugged when we told them we were unhappy with their service.", "title": "Good location with fresh baked cookies.", "user": "SDAnnie", "date": "October 8, 2011", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 5.0, "sleep": 5.0, "rooms": 3.0, "location": 4.0}, "id": 119089433}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "Once in the room, the air conditioner would turn on for about 5 minutes and then shut off. It was extremely stuffy and hot in the room and no matter how my husband adjusted the a/c, it provided no relief and perspired all night. We could not participate in the breakfast since we left too early but the morning shuttle did leave on time as there were a number of other passengers taking it. Overall, we would look for a different location with free airport shuttle service if we came again.", "title": "Just the job!", "user": "dandb", "date": "October 6, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 118999162}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled with friends", "text": "Three of us stayed here when we met a family member in Las Vegas, on our way to Southern California. Great location near the airport and no traffic noise. The pool was great on a warm afternoon, and the rooms were very comfortable. Nice breakfast and friendly staff. They actually had fresh baked cookies in the lobby that afternoon when we checked in. The only drawback was noisy guests late at night in the halls.....not the motel's fault. Overall a good place to stay.", "title": "comfortable beds", "user": "Caldwellbelle", "date": "October 4, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 3.0}, "id": 118949789}, {"rating": 2.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "Standard fayre for a lower cost Best Western, but we found thew shuttle service to be very patchy (little clear info on stops, times etc) and the driver we had couldn't speak any English and was just plain indifferent to his passengers, so we ended up being dropped off nowhere near where we expected, leading to a 20 minute walk in the dusty heat of Vegas! Nice.", "title": "Shuttle disaster", "helpfulness": 3, "user": "EdwardJAllen", "date": "October 27, 2011", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 2.0, "sleep": 2.0, "rooms": 2.0, "location": 2.0}, "id": 119791706}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "Some good, and some bad staff. luck of the draw.", "title": "Old but cheap and clean", "user": "LWvisitor_11", "date": "October 21, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 119567398}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "View from our window was a wall about 4 foot away (well at least we could walk around naked if we wanted too!)", "title": "Best value ever--", "user": "traveler6245", "date": "October 21, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 119558566}, {"rating": 3.0, "title": "Good Alternate for \"Off the Strip\" Hotel", "text": "Oh, did I mention the planes? bring your ear muffs.", "user": "A TripAdvisor user", "date": "October 20, 2011", "id": 119513923}, {"rating": 2.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "This hotel was perfect for us. We landed late one evening and were leaving for the Grand Canyon first thing the next morning. It is nothing fancy, in fact everything seemed quite old, but the room was very clean. The price was great and it even included a nice breakfast!", "title": "Wish we stayed somewhere else.", "helpfulness": 3, "user": "kybaseballmom", "date": "October 17, 2011", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 2.0, "rooms": 2.0, "location": 3.0}, "id": 119395415}], "location": {"country": "United States", "city": "Las Vegas"}, "stars": 2, "variance": {"poor": 50, "average": 86, "very good": 162, "terrible": 29, "excellent": 103}, "aka": "Best Western Mccarran Hotel Las Vegas", "slim_ranking": 0.418518518519, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.5, "location": 4.0}, "description": "Welcome to the Best Western McCarran Inn, conveniently located just minutes from the world famous Vegas Strip and adjacent to McCarran International Airport. Best Western McCarran Inn offers newly renovated guest rooms and superior customer service at an affordable price. Each of the well-appointed guest rooms and suites at this Las Vegas hotel features cable satellite television and free wireless high-speed Internet access. Begin the day with a complimentary deluxe continental breakfast before relaxing in the outdoor heated swimming pool or exploring all that Las Vegas has to offer. Best Western McCarran Inn also features free parking, free business center, and a complimentary shuttle to McCarran International Airport and Las Vegas Strip."}