{"user_rating": 3.5, "review_count": 353, "name": "BEST WESTERN PLUS Dover Marina Hotel & Spa", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled with family", "text": "My daughter, granddaughter and I stayed for about 10 days in the hotel and were quite pleased with the accommodations. While the hotel is old and, yes, the room did creak and slope but the warmth of the staff and other hotel amenities more than made up for that. We were there in November and while it was getting cold outside, the room was heated comfortably. We had a \"family room\" which consisted of a double bed and sleeper sofa in a rather large room which faced the water. (No complaints!) We found the hotel to be clean so I don't know the reason for the other negative reports. The dining room is very attractive and we found the food to be of good quality. The buffet breakfast is extensive and similar to that found in American high end hotels. There are 2 other resources for eating: a cafe which serves Starbucks and a bar in which one can also order from a limited menu. We found the location to be perfect for us as we could walk into the town itself and one day we were able to catch a bus to Canterbury. There is also a train station nearby where one can catch a train to London but we did not do this during this trip. I would say that we were most impressed with the friendliness and helpfulness of the staff so if our travel take us to Dover again, this hotel would be our choice.", "title": "A warm welcome which continued throughout our stay", "helpfulness": 2, "user": "Annekoco", "date": "December 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 147539662}, {"rating": 3.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "We had booked a Superior Room as we like extra comfort. The room was small and felt \"cramped\". It appeared to be a standard room but with a balcony. The decoration was quite good and the view acroos the sea front excellent.", "title": "Some good points, some not so good", "user": "HandAL", "date": "December 13, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 2.0, "sleep": 2.0, "rooms": 2.0, "location": 4.0}, "id": 147374511}, {"rating": 3.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "The bed comfort was OK but nothing special, the bathroom had very minimum toiletries and the Tea and Coffee facilities as one would expect.", "title": "Great view of harbour", "user": "Number34", "date": "December 10, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 147114949}, {"rating": 1.0, "stay_parameters": "Stayed December 2012, traveled with friends", "text": "We dined in the hotel the first evening and the food quality, quantity and service was amongst the best I have had in any hotel. The breakfast was just as good and being a buffet style met just about everyone's needs. So full marks for food and service.", "title": "Never again", "helpfulness": 99, "user": "Klaus B", "date": "December 4, 2012", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 146773088}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "It appears that all the superior rooms are on the first floor as is the suite. Our room was immediately above the dining room. But even with so called \"normal\" Christmas music playing it could be heard in our room. Luckily there were very few diners and they all seemed to be early diners. So the music stopped early.", "title": "A friendly hotel with class and style", "user": "Melanie T", "date": "December 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 146708241}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "This was a good hotel in a great location. We used it after a short trip from Dover to Calais. The rooms are definitely full of character. I dont think the floor or walls very very straight but this added to the charm of this old building. Our room was a touch on the small side but the view of the ferry port and across the channel was great. Breakfast choice and quality was exceptional and the dining room itself was lovely.", "title": "great view", "user": "melanie d", "date": "November 30, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 146471671}, {"rating": 2.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "We had actually booked a night at the Ramada which was 4 miles away. This was overbooked and we were sent to this hotel. When we arrived we had problems actually getting in to the hotel as a large party occupied the reception lobby and were encroching into the revolving doors.", "title": "Disappointing", "helpfulness": 67, "user": "Cheshire174", "date": "November 25, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 1.0, "rooms": 3.0, "location": 3.0}, "id": 146168843}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "The noise inside was horrendous and it was very difficult to hear the receptionist. The bar and the restaurant were packed and it was impossible to get food or a drink.", "title": "Nice Hotel", "user": "Steve5059", "date": "November 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 146036683}, {"rating": 2.0, "stay_parameters": "Stayed October 2012", "text": "The room was OK and the bathroom was very good. A major issue was the window. The room had a sash window and a the wind was very strong over night thw continual rattling overnight made sleeping impossible.", "title": "Not for families, more like a cheap bedsit", "helpfulness": 35, "user": "Lady-Hameln", "date": "November 18, 2012", "detail_rating": {"cleanliness": 2.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 2.0}, "id": 145687771}, {"rating": 5.0, "stay_parameters": "Stayed November 2012", "text": "Thye parking was on a shared car park beyond the shops opposite. It did not seem vert secure.", "title": "Worth paying for upgrade", "user": "Painty_boy", "date": "November 17, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 145574477}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "We happened upon this hotel thirty years ago and have used it many times since, for one night stop-overs. The location is perfect, right on the seafront, just a short walk from town and a quick drive to the port. We were a little disappointed this time though. The hotel used to be called The Churchill and its public areas spoke of a former time of late-Regency/early Victorian grandeur whereas now, the fake-Deco reception area and bar seem out of place. Still, this shouldn't be a deterrent. The hotel is clean, the staff friendly and helpful and the rooms adequate. Wi-fi is free (ask for a code at reception) but is a bit iffy in some rooms. Parking is easy. There are pay-and-display spaces right outside the hotel, or you can obtain a free permit from reception to park across the road behind the hotel. And finally, a tip for those who book a room without breakfast included. Just go next door where they serve an all-day full English breakfast for about half the price of eating in the hotel.", "title": "Excellent stop-over hotel", "user": "MoTrish", "date": "January 1, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 148487670}, {"rating": 3.0, "stay_parameters": "Stayed December 2012, traveled with friends", "text": "I stayed here for a friend's wedding. The reception was first class, great food.", "title": "Great Views", "user": "Tom S", "date": "December 28, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 148194040}, {"rating": 4.0, "title": "Ok for one nights stay", "text": "Room was clean but I spotted the toilet whilst sitting in the bath. Ugh! around the rim was disgusting. I do not think it had been cleaned since fitted'", "helpfulness": 1, "user": "Sailtorace", "date": "December 23, 2012", "id": 147930463}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "My only complaint was the bar. I had a pint of very well kept Shepherd Neame Spitfire. Alas it was the only one I had as it ran out. The staff were eventually bullied into looking at it. The second pint was like mud. \"It's ok\" I was told.want to guess my answer to that?", "title": "PERFECT OVERNIGHT STAY", "helpfulness": 1, "user": "Karen_Kingswinford", "date": "December 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 147749769}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "Like many hotels the staff do not work slick enough. There were two functions on this evening and the staff could not cope. They must be trained to look for customers instead at looking at other staff and themselves in the mirror.", "title": "The balconies make it very good", "helpfulness": 2, "user": "David P", "date": "December 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 147746171}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "Before Christmas we were looking for a hotel in Dover for the night before an early morning ferry departure. Having had a poor experience at the Premier Inn next to the ferry terminal (noisy party in restaurant, expensive given the hotel standard), we decided to try the Dover Marina Hotel next door. On entering, my wife was pleasantly surprised to be greeted by the Lady Mayoress of Dover, having bumped into her (literally) at a civic reception which was filling the entrance. So, the standard of party at least was definitely superior to that at the Premier Inn! We found our room spacious and well-appointed and good value for the price. The hotel overall has benefitted from a relatively recent renovation. We had dinner here and found the food good and the service excellent. Overall, a pleasant experience.", "title": "Good overnight choice pre-channel crossing", "helpfulness": 3, "user": "dg74", "date": "January 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 149247908}, {"rating": 3.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "Went for a weekend holiday with my girlfriend and was very excited not until we check in. As we came in the back entrance of the hotel and straight to the reception. The receptionist saw us straight away from their back office. Thinking I will be served for the check in I was wrong we waited minutes before she came and attended us, not even an apologies for keeping us waiting or even a simple hello or greet us with a smile. That was the first poor service. As we had a long journey to get there we thought we will have a late lunch in the bar. As we sat at the table next to the window again we thought we will get some service we have waited for 15minutes so I went to the bar instead asking if I can order some food. It will be too long to mention all the poor service that we received from the staff. If it wasn't for the beautiful room and a beautiful view that we have that weekend would have been ruined completely.", "title": "Beautiful Hotel but a Poor Service", "helpfulness": 4, "user": "TJM86", "date": "January 9, 2013", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 149225617}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "Stayed for two nights 28th Dec 12 - 30th Dec 12. Room 404", "title": "Fantastic views", "user": "ohappydays", "date": "January 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 148874718}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "Reception team (John and Lucy) extremely helpful. Arrived and informed car park around the back and given a free parking pass. The hotel has two entrances, front and back. Our room was on the fourth floor and we had requested a sea view. Was not disappointed. The room was fairly roomy, however only had one chair (double room). Usual tea/coffee facilities, hairdryer, dressing table, tv. Iron and Ironing board in wardrobe. No trouser press (not that we wanted one but just pointing out) and no mini bar/fridge. Room was clean and fresh. Like a fellow trip advisor, we too noticed the toilet rim, not nice but the rest of the bathroom clean. We did have a bedding issue but this was rectified quickly and efficiently.", "title": "Awww a Beautiful Stay", "helpfulness": 1, "user": "Xenahussain", "date": "January 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 148863270}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled with friends", "text": "The evening restaurant team are equally helpful and the food cooked well. The breakfast on the first day 29th was great with an egg chef at the ready and plenty of the team around however on the 30th, we had to wait and eventually ask for the egg chef, the hot plates run out and the team seamed not so helpful.", "title": "New Year Break", "user": "janlangton", "date": "January 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 148622448}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "stars": 4, "variance": {"poor": 37, "average": 69, "very good": 142, "terrible": 16, "excellent": 89}, "aka": "Best Western Dover Marina Hotel And Spa", "slim_ranking": 0.666666666667, "description": "The new 81 room Best Western Dover Marina Hotel is set in a Georgian Terrace building and commands stunning views across the Dover seafront with the famous Dover castle in the background. It is centrally located just a few minutes from the Ferry and Cruise terminals and 5 minute walk from the town centre, the hotel facilities include Free Wifi, a Restaurant, Bar & Lounge, and Coffee Shop brewing Starbucks Coffee and Movenpick Icecream.The Waterfront Spa will be open from 01st March 2013 offering a range of Beauty Tretments, Manicure, Pedicure and Massages."}