{"user_rating": 4.5, "review_count": 39, "name": "BEST WESTERN TimberRidge Inn", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed May 2006", "text": "I needed a place to stay in Grove after being at the Candlewyck Cove Resort for 3 nights for my cousin's wedding. The Resort which is right on the lake was great though with the wedding over and guests and family gone, I saw no need to continue staying there. I found the Best Western to be everything written about in the reviews here: friendly staff, super clean rooms, great bed and accomodating facilities. I missed the continental breakfast (first decent night's sleep in several days after partying with the family) which means that I was very comfortable. I am sure it is great however, you can always go to one of several really great breakfast places in town if you can't make it by 9.", "title": "An Oasis in Grove", "helpfulness": 1, "user": "TravlingBard", "date": "May 20, 2006", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 4.0, "service": 5.0}, "id": 5184237}, {"rating": 4.0, "stay_parameters": "Stayed March 2005", "text": "We stayed at the Best Western in Grove, OK (Room #216-level 2) over the week-end. My husband was in town for a bass fishing tournament. I reserved the room through the Best Western website. It was a good thing I did since the hotel was sold out by the day before our stay. There is a very limited number of hotel rooms in Grove and we could not get a room with a king bed so we had to settle for one with two queens.", "title": "Very friendly employees, clean hotel", "helpfulness": 7, "user": "mfinn", "date": "March 14, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 3272688}, {"rating": 3.0, "stay_parameters": "Stayed September 2004", "text": "The hotel is in a very convenient location since it is right in the middle of the restaurants and across the street from a Wal-Mart Supercenter (where my husband had a pre-tournament meeting). There is also a new car wash next to the hotel, a new Arby's within walking distance and a 24-hour convenience store across the street (my husband loved this since he got up at 3:45 a.m. for the fishing tournament and can't make it without his morning java). The hotel check-in was easy. The employees are very friendly. The hotel lobby was very clean and our non-smoking room smelled fresh. I noticed at check-in the hotel had received several awards for cleanliness, which made me feel better. We received a room on the second floor and there are no elevators, so it was a bit inconvenient since I have a medical condition that makes it hard for me to walk up and down steps. The lady at check-in attempted to find us a room on the first floor, but since we were only staying one night, she did not want to inconvenience any of the other guests by moving them, which we completely understood.", "title": "Nothing Fancy, But Friendly", "helpfulness": 4, "user": "AWTSc", "date": "September 7, 2004", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "rooms": 3.0, "service": 5.0}, "id": 2517103}, {"rating": 5.0, "title": "Clean room and kind staff", "text": "The beds were not real firm, like we are used to, but we both slept well. The room had a 27-inch t.v. with HBO and around 30 channels, and a small table with three chairs. One of the chairs had a small rip in the front, but other than that, the room appeared to be well-kept. The bathroom and shower/tub was very clean. The room was equipped with a small hair dryer, coffee maker and iron/ironing board.", "helpfulness": 4, "user": "JoHoWiDe", "date": "August 8, 2004", "id": 2429813}, {"rating": 2.0, "stay_parameters": "Stayed September 2011, traveled solo", "text": "My 90 year old mother with dementia could have worked registration better than the person who checked me in. Slow. Condescending. Rude. Tickets with private guest information spread all over the counter for easy theft of personal information. But she sure was proud of those fresh baked cookies across the lobby? And did I mention she was slow?", "title": "Well, at least it's western", "helpfulness": 2, "user": "Twoprofs", "date": "September 20, 2011", "detail_rating": {"service": 1.0, "cleanliness": 5.0, "value": 2.0, "sleep": 1.0, "rooms": 3.0, "location": 3.0}, "id": 118366048}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "Registration are reeked of smoke. Or maybe it was the slow woman at the counter who reeked of smoke. Either way, if it hadn't been past cancellation time when i checked in, I would have left.", "title": "Highly recommend this place to stay!", "helpfulness": 1, "user": "Mrs_Wallace10", "date": "August 7, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116398011}, {"rating": 3.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "But now this morning, having spent the night on the worst bed of my life, I now wish that I had left anyway. At least I had a room with two beds, which I have named \"Worst\" and \"Even Worster.\"", "title": "Nice rooms, good breakfast, staff needs a little work on \"courtesy\".", "helpfulness": 1, "user": "stranieri_divertenti", "date": "June 27, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 3.0, "value": 3.0, "service": 2.0}, "id": 114803679}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "The halls smell bad. The presentation of food at the breakfast bar is unsanitary. The internet is OK and the TV reception is passable, though the set itself is out of date. Not a decent chair in the room and no real work space.", "title": "Greatest hotel I've ever stayed at.", "user": "grannycdm3", "date": "May 3, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 106752433}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled with family", "text": "About 20 miles north, in Miami, is a nice Hampton Inn. Trust me; it's worth the extra drive.", "title": "One of the Best Hotels we have stayed at in a Very Long Time!", "user": "OklahomaRich", "date": "October 5, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 45882530}], "location": {"country": "United States", "city": "Grove"}, "variance": {"poor": 1, "average": 4, "very good": 10, "terrible": 2, "excellent": 22}, "aka": "Best Western Grove", "slim_ranking": 0.4}