{"user_rating": 4.5, "review_count": 156, "name": "BEST WESTERN PLUS Prairie Inn", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed October 2008, traveled with family", "text": "Great overnight spot! Had a great breakfast and the room was clean and spacious.", "title": "Great Deal!", "user": "GoBeavs", "date": "October 13, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 4.0}, "id": 20860999, "likes": {"liked": "— Location, price, breakfast", "disliked": "— pool hours...wished they opened earlier for the kids!"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2008, traveled solo", "text": "This is a modern, clean motel, convenient to I-5. My room was spacious, pleasant and quiet, and the price was very affordable. Nice lobby with newspapers; very good breakfast options including make-your-own waffles.", "title": "Very good value for money", "user": "kawaguy", "date": "August 30, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 4.0}, "id": 19559401, "likes": {"liked": "— Spacious, well-equipped room at good price"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2008", "text": "Minor quibbles: the bathtub plug is a weird design, very easy to dislodge. And the pool has a \"buddy\" policy - you can't swim alone. Well, I was alone, and no one else was in there, so I was out of luck. After nine hours on my motorcycle, I had been looking forward to a hot soak.", "title": "Nice Facility", "user": "MissMyGolden", "date": "August 19, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 3.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 19095679, "likes": {"liked": "— clean and attractive"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2008", "text": "But I'd stay there again, and recommend it to others.", "title": "Great Value and Clean", "user": "getmeoutoftherain", "date": "July 14, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 3.0, "rooms": 4.0}, "id": 17891010, "likes": {"liked": "— clean"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "This is a recently refurbished Quality Inn, and the facility is very appealing. Good experience with check in. Bed had a pillow top and was very comfortable. Microwave and fridge in room, with two sinks. Very clean, quiet. Breakfast was pretty good with waffles, individual omelettes, the usual breads, pastries, juices, nice breakfast area. The only problem we had was our room was not made up the first day. We were in the room for 45 minutes between noon and 1:00 p.m. Cleaners were still in the hallway when we left, but they never came back to clean. We got fresh towels from the front desk, but the cleaning staff left the property before we returned, so we slept in the same sheets, etc. Not awful, but thought this was an avoidable or correctable problem that might have been handled better than it was.", "title": "great stay", "user": "rtgt", "date": "July 12, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 17823297, "likes": {"liked": "— the staff", "disliked": "— nothing all was great"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled on business", "text": "After reading the recent reviews, I decided to give this hotel a try. I had usually stayed elsewhere at a higher rate! I'm glad I chose this hotel. The beds were just like Goldilocks would enjoy...not too soft, and not too hard. Just right! The breakfast was terrific and served in an atmosphere that felt like family. The attendant made sure everyone had what they wanted. The hotel is clean, comfortable, and close to everything.", "title": "Very comfy hotel!", "user": "DrewStringer", "date": "July 24, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8230380, "likes": {"liked": "— Cleanliness and the comfortable beds.", "disliked": "— The hours for breakfast. I like to sleep late on weekends, and I would like even longer hours than already provided."}}, {"rating": 4.0, "stay_parameters": "Stayed March 2007, traveled with friends", "text": "We stayed here last December and the rooms were terrible. We decided to stay one more time and found the place to be wonderful. The pool and spa are being remodled and and the chlorine smell was no longer in the lobby. The staff was great and the breakfast was very good. Bisquits and gravy, fruit, yogurt, rolls. We would defintly stay here again. New ownership and management sure made a difference even with the staff.", "title": "Nice change", "user": "twins67", "date": "May 10, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 7582775, "likes": {"liked": "— The staff and the clean rooms", "disliked": "— Pool and spa were down"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "This is a very nice Inn, and a far cry from the former operation a year ago. The beds are terrific! The staff is friendly, helpful and accommodating. Everything is clean, and fresh. And the breakfast was great. Indoor pool was closed for major repair, and hope to see it finished when I return.", "title": "What an Improvement!", "user": "rlaw811", "date": "May 1, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7490090, "likes": {"liked": "— Great bed! Slept like a TOP!", "disliked": "— The pool was closed for refurbishing"}}, {"rating": 3.0, "stay_parameters": "Stayed June 2008", "text": "Stayed one night here. Everything was fine; nothing special, but certainly nothing bad, either.", "title": "It works", "user": "KDUB7", "date": "July 2, 2008", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 3.0, "rooms": 3.0}, "id": 17425549}, {"rating": 4.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "The walls were a bit thin, though. We could clearly hear the conversations next door, and, fortunately, their morning alarms went off the same time ours did, because we could hear those, too.", "title": "Great stay, highly recommended.", "helpfulness": 1, "user": "clairdesol", "date": "June 21, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 17101750, "likes": {"liked": "— Large rooms, very clean, friendly staff.", "disliked": "— Size of breakfast room."}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled on business", "text": "One note: the front desk was really, really, insistent on how one needed a swimsuit to use the pool: not cutoffs, not shorts, not in the nude (ha!) but a proper swimsuit. When we checked in, we got grilled about whether we planned to use the pool, and whether we had the proper attire. Not a problem for us; we had our suits! But, two teenagers got kicked out of the pool because they had shorts, not suits. SO: if you want to swim here, or use the spa, be sure to bring a proper swimsuit!", "title": "Best hotel in Albany!!!", "user": "rvivian", "date": "May 19, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 16193690}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled on business", "text": "We read the reviews of this place and decided to give it a try. We usually don't stay at this chain, prefer 3 star if we can find one. But the reviews persuaded us. We were very satisfied with our stay. The staff is very helpful and friendly. The room is good size, with a king bed plus a sofa and desk. Bathroom on the small side, but great shower head. Very quiet, even though there are a lot of people staying here. Comfortable bed and pillows. Clean and well maintained. Breakfast is the usual motel continental breakfast, but plenty of fresh fruit and nice selection of teas, make your own waffles. Only downside might be the smallish breakfast area, and the pool is right in the lobby area, but neither of those were a problem for us. I would definitely stay here again, on one of our many trips along Interstate 5.", "title": "we loved our stay!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!", "user": "carlsjr", "date": "April 5, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 14820106, "likes": {"liked": "— comfortable and clean", "disliked": "— n/a"}}, {"rating": 5.0, "title": "Not Days Inn", "text": "Stayed here May 16-17. Room was very spacious and clean. Stayed in king room. Room has a refrigerator/freezer and microwave. Also had a large flat-screen tv, table and chairs and a couch. Staff was professional and very friendly. Tine (Tina with an e) was extremely helpful and kind! Always took care of my every need! Hotel is convenient to I-5 with a very good chinese restaurant next door. Included breakfast was very good! I am already planning another trip in August and will not hesitate staying here again!", "user": "Jayhawk_in_WI", "date": "October 2, 2007", "id": 10032717}], "location": {"country": "United States", "city": "Albany"}, "stars": 2.5, "variance": {"poor": 4, "average": 16, "very good": 54, "terrible": 4, "excellent": 78}, "aka": "Quality Inn Albany", "slim_ranking": 0.3, "description": "The Quality Inn hotel in Albany a 74 unit interior corridor hotel located near I-5 (easy to find, but not traffic noise) close to shopping, antique stores, movie theater, restaurants and the Linn county fair and expo center. Free hot breakfast with omelets, fresh baked Belgian waffles, biscuits and gravy, fruit, cereals, etc. 24 hour desk service, indoor heated pool and hot tub, fitness room, meeting room, wheel chair access and non smoking rooms."}