{"user_rating": 4.0, "review_count": 649, "name": "BEST WESTERN Montecarlo", "reviews": [{"rating": 5.0, "title": "Home Away From Home", "text": "What a great hotel! The rooms were clean and cozy, the staff was friendly, and the location could not have been more convenient. A great complimentary, hot breakfast (scrambled eggs, sausage) was served every morning and the coffe was wonderful. After a full day of siteseeing, it was such a comfort to come back to the Montecarlo to collapse! If we ever have the good fortune to return to Venice, we will also be returning to the Montecarlo.", "helpfulness": 8, "user": "A TripAdvisor user", "date": "September 26, 2005", "id": 3939097}, {"rating": 3.0, "stay_parameters": "Stayed August 2005", "text": "We stayed for one night before returning home. The best things about this hotel were the staff, who were all friendly and helpful and spoke good English and the location - a stones throw from the Piazza San Marco. On the down side the room we stayed in was a little bit cramped and the bed was small, to use the toilet in the bathroom required skillful maneuvering - you could sit on the loo whilst washing your feet in the bidet! It was okay for one night but wouldn't have liked to stay there for any length of time.", "title": "You can use the toilet and the bidet at the same time", "helpfulness": 5, "user": "EastofHampstead", "date": "August 11, 2005", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "rooms": 2.0, "service": 4.0}, "id": 3754707}, {"rating": 4.0, "title": "great location, shame about the room", "text": "We were supposed to get a king size bed, we only had a double. The decor was horrible. The room was just grim, however it was clean. The bathroom look ok but it was difficult to shower in such a small space. AND when you did shower the water flooded straight in to the bedroom. So much fun walking about on a soaking wet carpet. The staffs were helpful and friendly though but there is so much choice of hotels that i wouldn't bother staying here again, and it wasn't cheap in comparison to some of the others. The location is perfect though. Your right in ther heart of everything 2 mins from the main square.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "August 3, 2005", "id": 3734768}, {"rating": 4.0, "title": "Great Location, but crowded area.", "text": "Above average hotel just steps from San Marco Square. Clean rooms, good breakfast. The only downfall to this hotel is trying to get to it through the crowds, especially with luggage! Research how to get to hotel from water bus.", "helpfulness": 2, "user": "kmf4003", "date": "July 25, 2005", "id": 3700355}, {"rating": 5.0, "stay_parameters": "Stayed June 2005", "text": "Excellent location, just 3 blocks from St. Mark's Square. Friendly and helpful English speaking staff. Full American buffet breakfast included. Rooms were a bit on the small side but efficient use of space. Very clean with stylish Venetian decor.", "title": "Venetian Jewel", "helpfulness": 3, "user": "Leisure", "date": "July 2, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3630329}, {"rating": 4.0, "title": "Great Hotel", "text": "The Location of the Hotel is fantastic, 2 minutes from St Marks Square - we got up at 7 am for a walk before breakfast - had the whole square to ourselves and watched the sun come up! Fantastic.", "helpfulness": 11, "user": "A TripAdvisor user", "date": "March 1, 2005", "id": 3238242}, {"rating": 4.0, "title": "brilliant locatation", "text": "The staff were really helpful and friendly and the room was great-decorated really well and the bathroom included a fab power shower.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "February 28, 2005", "id": 3234578}, {"rating": 4.0, "title": "Great Hotel", "text": "I wouldn't recommend eating in the immediate area of the hotel- as it is in the hub of everything prices are high and quality low. Walk a few blocks away from the square- you don't even need to go that far to find where more locals eat and drink- these places are much better value.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "February 26, 2005", "id": 3231806}, {"rating": 4.0, "title": "little gem", "text": "this hotel couldn't be in a better location. Easy to get to from waterbus. Very new and clean bathrooms. Staff are very helpful with excellent English. Rooms are venetian style. We truly enjoyed our 2 night stay. Breakfast was ok, not a big selection but none the less fine. Would stay again if going to Venice.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "February 7, 2005", "id": 3167376}, {"rating": 4.0, "title": "Best Western, Best Hotel...!", "text": "Stayed in the Hotel Monte Carlo for 4 nights 17th Feb to 21st, good sized room,very clean. Reception staff couldn't have been more helpful. Breakfast good. This is good priced Hotel in a very good location.", "helpfulness": 13, "user": "EnglishRomers", "date": "January 25, 2005", "id": 3085134}, {"rating": 4.0, "stay_parameters": "Stayed June 2005", "text": "We had three rooms at the hotel after a cruise. all rooms were slightly different but very nicely deocorated with the venetian glass and very nice furniture. Staff was helpful, spoke satisfactory English. We had no problem with breakfast, possibly because it was early. Staff very helpful in arranging transportation to the water taxi to the airport. Location of the hotel is great for all the walking and sightseeing in Venice. We would most certainly recommend this lovely hotel.", "title": "good location-once you find the street", "helpfulness": 2, "user": "DotAtlanta", "date": "June 12, 2005", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "service": 3.0}, "id": 3546570}, {"rating": 5.0, "title": "Charming, comfortable, great location and value", "text": "I've traveled a lot and the Monte Carlo is definitely one of the better hotels I have stayed at. I was there for 5 days/nights and it was a great experience. The room was a bit small, but very comfortable, charming, nicely furnished and pleasant. Very clean room/bathroom. The local is excellent, only a couple of minutes' walk away from St. Mark's Place. There's a bit of a walk from the water taxi docking place to the hotel door when you arrive with your luggage, but the hotel sent out a staff member to help bring it in so we had no problem at all.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "May 29, 2005", "id": 3507585}, {"rating": 4.0, "title": "Favorite hotel in Italy.", "text": "Generally the staff was very friendly and helpful. My parents, who were traveling with me, initially got a room they weren't happy with, on the top floor -- it was too small, with a very low ceiling and rather stuffy, but when they complained about it to the staff they were promptly moved into an excellent 2nd floor room.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "May 25, 2005", "id": 3500963}, {"rating": 4.0, "stay_parameters": "Stayed May 2005", "text": "The only drawback as far as I'm concerned was that the breakfast buffet didn't have a great selection, but it was okay.", "title": "Unbeatable location", "helpfulness": 1, "user": "DancerDevon_UK", "date": "May 16, 2005", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "service": 3.0}, "id": 3476865}, {"rating": 2.0, "stay_parameters": "Stayed December 2004", "text": "Generally you definitely get more than your money's worth with this one.", "title": "Great Location!", "helpfulness": 5, "user": "DHGM90265", "date": "May 1, 2005", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 4.0, "service": 1.0}, "id": 3429770}, {"rating": 4.0, "stay_parameters": "Stayed January 2006", "text": "We stayed here for 3 nights in Jan 2006. would rate it as excellent. Perfect location for a good price, Really good breakfast - hot food as well as continental. Rooms snall but were fine, very clean, ventian style decor, good balcony with view down the street which was lit by little fairy style lights in the evening. TV in room, and staff were all helpful. would recommend it.", "title": "perfect location! would stay here again", "helpfulness": 10, "user": "jofroberry", "date": "February 1, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 4406826}, {"rating": 3.0, "stay_parameters": "Stayed December 2005", "text": "The hotel itself was very nice. Totally tacky decor but that was part of the charm. Breakfast was good, location is IDEAL! The staff were all nice until the very last one we were in contact with. We were doing our checkout and needed to do it quickly to catch the boat to the trainstation. We came downstairs and he told us that we were going to have to wait for a five minutes while his printing finished off. during this time he was very rude and wanted us to go away from the desk as he thought we were looking at his printing. After five minutes and then some still printing. I told him that we had a train to catch and could he please hurry up. It started into a mini head to head and luckily enough i have a cool enough head at that time of the morning. by the time he finished printing i got my reciept and he then had the nerve to question why i wanted a reciept! Lucky for him my time was running out and i needed to catch the ferry. No thank you's or hope you enjoyed your stay or hope you come back one day. Just a very sour note to leave on. Would be a great place to stay... just hope you dont run into that guy at the front desk!", "title": "good til the end", "helpfulness": 3, "user": "bvicritter", "date": "January 6, 2006", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "service": 3.0}, "id": 4328688}, {"rating": 5.0, "title": "I want to go back!", "text": "I recently spent 3 nights in the Best Western Montecarlo in Venice and thoroughly enjoyed my stay. The hotel is ideally situated on a small Venician street, lined with curious boutiques, and is literally 30 seconds walk from St. Mark's Square.", "helpfulness": 14, "user": "Drmaz", "date": "December 17, 2005", "id": 4246952}, {"rating": 3.0, "stay_parameters": "Stayed September 2005", "text": "Our room was elaborately decorated and had three huge French doors providing a quaint view over the rooftops of the neighbouring palazzos.", "title": "Could be better", "helpfulness": 9, "user": "mar11beth", "date": "November 8, 2005", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "rooms": 1.0, "service": 5.0}, "id": 4092874}, {"rating": 4.0, "title": "Notes on the Monte Carlo", "text": "The hotel was very clean - the bed linen and bath towels were changed daily.", "helpfulness": 9, "user": "A TripAdvisor user", "date": "October 30, 2005", "id": 4072094}], "location": {"country": "Italy", "region": "Veneto", "continent": "Europe"}, "stars": 3, "variance": {"poor": 21, "average": 81, "very good": 292, "terrible": 14, "excellent": 241}, "aka": "Best Western Montecarlo Hotel Venice", "slim_ranking": 0.267716535433, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.0, "rooms": 4.0, "location": 5.0}}