{"user_rating": 4.5, "review_count": 109, "name": "BEST WESTERN PLUS Kentwood Lodge", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled with family", "text": "My 5 year old daughter and I went on a girls' ski trip to Sun Valley and stayed at the Kentwood Lodge based on recommendations from friends. The snow could not have been any better since we received over 3 feet while there.", "title": "Great price and location!", "helpfulness": 3, "user": "kitty811", "date": "February 28, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 13901769, "likes": {"liked": "— Cleanliness and convenient location to restaurants and ski shuttles? :-)", "disliked": "— No room service. :-("}}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "Room: decent king size bed, table with chairs, big jacuzzi tub in the corner, double sinks, microwave and a dorm-sized fridge. The room itself was rather large with enough room for us to dance around, do some yoga, and have a pillow fight. My daughter felt like a princess taking her bubble bath in the jacuzzi tub while watching her dvds and sipping juice.", "title": "True Hospitality", "helpfulness": 3, "user": "lpetrovay", "date": "January 29, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 13105581, "likes": {"liked": "— great location and great service", "disliked": "— can't think of something I didn't like"}}, {"rating": 3.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "Hotel: clean and well-maintained property; large indoor pool and jacuzzi; gym was so-so; loved the complimentary use of the pc in the lobby to check email/flight status.", "title": "Disappointing Stay", "helpfulness": 1, "user": "Terri Eggeman", "date": "November 10, 2007", "detail_rating": {"cleanliness": 4.0, "front_desk": 4.0, "location": 2.0, "value": 2.0, "rooms": 3.0}, "id": 10731851, "likes": {"liked": "— view from balcony", "disliked": "— traffic noise and funny smells"}}, {"rating": 1.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "Location: great restaurants and shops within walking distance. On one very snowy day, we took a day off from the slopes and hung out in town. We ate ice cream cones watching the world go by from our covered bench outside of the Rocky Mountain Chocolate Factory. For us, life could not get any better!", "title": "Rude, Overpriced Mediocrity", "helpfulness": 5, "user": "highlandvoyager", "date": "October 15, 2007", "detail_rating": {"front_desk": 5.0, "business": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 2.0, "location": 5.0, "rooms": 1.0}, "id": 10081558, "likes": {"liked": "— location", "disliked": "— staff, room, amenities, cleaning policies, management, pillows, decor, etc."}}, {"rating": 2.0, "title": "on vacation", "text": "Price: $180/night was a bargain compared to the cost to stay at the Sun Valley Resort properties. The Lodge was not the 4 Seasons, but neither was the Sun Valley resort.!", "user": "tap7", "date": "August 12, 2007", "id": 8401274}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled with family", "text": "We stayed here one night but wished it could have been longer!", "title": "Great Ketchum Motel", "helpfulness": 6, "user": "travel lovin' family", "date": "October 8, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 4.0, "rooms": 5.0}, "id": 5929592, "likes": {"liked": "— everything", "disliked": "— view was of the parking lot"}}, {"rating": 4.0, "title": "Better Hotel", "text": "For just a few dollars more we got the oversized room - it was beautiful - with 2 sinks ( great when traveling with teen daughter), refer, microwave and a sitting area with sofa. The beds were wonderfully comfy. The pool and hot tub were the cleanest we have ever seen. Staff helpful and very apologetic when our room wasn't quite ready on check-in. And when we checked out they apologised again for our wait.", "helpfulness": 11, "user": "QueenoftheBorg", "date": "March 8, 2004", "id": 1713831}], "location": {"country": "United States"}, "variance": {"poor": 3, "average": 4, "very good": 39, "terrible": 3, "excellent": 60}, "aka": "Best Western Plus Kentwood Hotel", "slim_ranking": 0.166666666667, "description": "Premier Location! Steps away from dining, dancing, theatre, shopping in the heart of Ketchum, Sun Valley's place to be. All rooms are non-smoking,spacious,and comfortable with Deluxe pillow top beds and triple sheeting. Upgraded with NEW 42\" LCD TVs in all rooms and NEW WIFI system. Fireplaces, balconies, in-room spas, kitchen suites with an extended area complete with kitchen amenities are available. Honeymoon suite has a red heart-shaped jacuzzi spa, fireplace, double headed shower & bidet! We offer our guests a $5.00 value at the Wrap City Cafe onsite restaurant,with qualifying rates. Pets, bikes, skis, snowboards are not allowed in the rooms. We do have free ski lockers to help accommodate. Some covered parking is available. Mt. views are spectacular, being only 7 blocks away from Mt. Baldy for your enjoyment. We are certified in Best Western's Ultra Clean program, and have been awarded by Best Western Int. 3 Best of the Best Awards. This past year we have earned Chairman's Awards, signifying being in the top 5% of all Best Westerns."}