{"user_rating": 4.0, "review_count": 395, "name": "BEST WESTERN Trianon Rive Gauche Hotel", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed January 2008, traveled on business", "text": "I have just returned from a 3 night stay a the Trianon Rive Gauche, in the Latin quarter of Paris. The hotel is across the road from the Sorbonne (which was handy as I was working there). 5 mins walk towards the Seine past some fantastic restaurants and bars you come to Notre Dame. Another 10-15min walk along the river is the Louvre. So all in all a fantastic location. The hotel reception was undergoing some refurbishment while I was there but the staff were very helpful and friendly. Breakfast is a traditional continental affair but good quality with bread, pastries & croissants on your table, with cereals, cheeses, cold meats, yoghurts etc available from the counter. There is pretty stable WiFi available(1euro/hour) which had reasonable signal in my room which was on the 1st floor, although some guests on higher floors had to use the lobby to get any reception. My twin bedded room was of a reasonable size with a desk and tv, there was a small 1/2 size bath with a shower in the ensuite. The room looked very recently refurbished and was of good quality. I would definitely reccomend", "title": "Great location, helpful staff", "helpfulness": 1, "user": "DrNog", "date": "February 1, 2008", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 13166969, "likes": {"liked": "— Location", "disliked": "— nothing, thought it was great"}}, {"rating": 2.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "Although in a very handy position for exploring Paris, I would really not class this as a 3* hotel. The bar was closed for renovation, the breakfast was very limited and the room was tiny - the smallest I have ever stayed in. Having been to Paris quite a few times, it would have certainly been a wise choice to spend a little more for more comfortable surroundings.", "title": "A bit disappointing", "helpfulness": 1, "user": "karenandwayne33", "date": "January 15, 2008", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 3.0, "cleanliness": 3.0, "value": 2.0, "location": 4.0, "rooms": 1.0}, "id": 12638883, "likes": {"liked": "— location", "disliked": "— uncomfortable room"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2007", "text": "We thoroughly enjoyed our stay at the Trianon Rive Gauche Hotel. This was a last minute trip, my mother was visiting from the States and wanted to go back to Paris. This was our first stay at this very charming, Parisien hotel. All the staff members were lovely, very friendly and helpful. They made a reservation for us at a local restaurant, and we had a wonderful dinner. I want to thank them very much for trying so hard, because the calling card we gave for the restaurant had an old phone number on it! We stayed in a triple with a balcony overlooking Rue de Vaugirard, just off Blvd. Saint Michel, a very convenient location. The bathroom was small (c'est normal), but it was very modern and clean. No problem with the elevator, most elevators in Europe are small. The bar was closed for renovation when we were there, but it isn't a problem because there's a very nice terrace across Blvd. St. Michel that's open late. I think it's called Tabac. If you have a car, parking is within a few blocks. Metros are very close and convenient. I would definitely give the Trianon between a 3 and 4 star because of the hotel's personnel. They were all very helpful, and it's very important to have a friendly, helpful front staff. I would definitely stay at this charming hotel again, I recommend it.", "title": "J'aime Paris!", "helpfulness": 2, "user": "RosebudBrussels", "date": "September 22, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "location": 5.0}, "id": 8850699}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled with friends", "text": "If you're looking for a reasonably priced hotel, in an EXCELLENT central location, then I would recommend the Hotel Trianon Rive Gauche without hesitation. I got this trip on a special offer, and I admit I really did not expect very much from this hotel, especially since I did some research on the internet and saw all those gaudy coloured bedrooms!! But then I figured we'd be out sightseeing all day so we'd put up with it. But – it was so much better than we expected. We were in a room on the 4th floor. You can choose to use the little old lift (which is fine even though it’s tiny) or take the stairs which had really nice window decoration on each floor.", "title": "Great location - definitely recommend it", "helpfulness": 9, "user": "Akai", "date": "September 8, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 8675486, "likes": {"liked": "— location", "disliked": "— The decor"}}, {"rating": 4.0, "title": "Loved it!", "text": "The bedroom colours were thankfully not quite as bright and clashing as the photos I’d seen – it looked like it had been redecorated. It was an adequately sized room for 2 people, and even had a little balcony - from which we were surprised to see that we were opposite the Sorbonne - we certainly didn't expect that. I had read that the hotel was supposedly in a 'noisy area' but 4 floors up we certainly didn't have any problems. The hotel staff were really good - all spoke English, and were keen to help out with any problems, and were always around to answer typical tourist questions. We had breakfast in our room on several occasions and it always came at the time we requested it. The rooms were cleaned and tidied well each day.", "helpfulness": 3, "user": "JeanieNorfolk", "date": "April 18, 2007", "id": 7390994}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "We booked this hotel through venere.com which I recommend. It was a perfect little hotel. Clean, good customer service (they all spoke English well). It's a great location - right off the Luxembourg RER stop which connects to both Orly & DeGaulle. Also the Luxembourg gardens are a great place to enjoy sunset with a bottle of wine & some cheese from a fromagerie. This is close enough to walk to Notre Dame & see the sights of the Latin Quarter along the way. I didn't think the bathroom was crazy small but only one person could really be in there at a time. And yes the shower doesn't quite have a shower curtain/door but you make do (don't let this deter you!). This is a perfect little European hotel in a great location!", "title": "Perfect location, very good hotel", "helpfulness": 1, "user": "lolomojo", "date": "July 20, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 18069488, "likes": {"liked": "— The location, the customer service, the cleanliness", "disliked": "— only one computer for internet access"}}, {"rating": 3.0, "stay_parameters": "Stayed June 2008", "text": "Second stay in this hotel so knew what to expect. Decor looked the same but the bathroom, which was very small has been refurbished and was really clean and fresh 'though geeting in and out of the bath/shower safely was a bit of a challenge. The dining room has also had a facelift and looks lovely and served great breakfasts.", "title": "Great location", "user": "mandnLondon", "date": "June 27, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 5.0, "rooms": 3.0}, "id": 17288847, "likes": {"liked": "— Juliet balcony Big french doors", "disliked": "— limited bathroom space made it difficult to enter/exit the shower"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2008", "text": "The front of house staff were very pleasant and efficent. Next trip to Paris will be visit No3", "title": "Great beds", "helpfulness": 1, "user": "Blackrockgal", "date": "April 17, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 15098954}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "We were very pleased with this hotel. The rooms was not huge but not as small as I had been led to expect. The bathroom was excellent, the beds were very comfortable and there was a walk in wardrobe for clothes and bags. The front of house staff were extremely pleasant and helpful. The location is superb. Overall we felt if was very good value for money", "title": "Would return to this simple but convenient hotel", "helpfulness": 2, "user": "TootsieBoston", "date": "April 1, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 4.0}, "id": 14706181, "likes": {"liked": "— Front Desk Staff being so helpful and friendly", "disliked": "— Size of room"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "Though the rooms are small, they are clean and quiet, and the hotel location is quite good, though not easily accessible by Metro. The staff at the Front Desk was outstanding with great help in getting around by bus and foot. Great bathroom with excellent hot water and pressure.", "title": "Small, but perfect location", "helpfulness": 2, "user": "London_UkVisitor", "date": "March 19, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 14388240, "likes": {"liked": "— Position to main sights in Paris", "disliked": "— None"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled with friends", "text": "I'm always amazed about other peoples reviews. We've just come back from a 4 night stay at the Trianon Rive Gauche and we honestly didn't have a problem with anything.", "title": "spot on - couldn't fault it", "helpfulness": 1, "user": "chrisdy", "date": "March 11, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 3.0}, "id": 14206909, "likes": {"liked": "— location", "disliked": "— tiny lift"}}, {"rating": 1.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "Our initial thought about the room was 'ugh' but when we looked closer it was the choice of decoration (60's striped wallpaper) and an awful colour carpet, but so what! The bathroom was new and sparkling (and tiny), the breakfast room brand new, the breakfast great and included in our price from jet2.", "title": "Noisy, tiny and rude", "helpfulness": 1, "user": "triptolondon", "date": "March 7, 2008", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 3.0, "value": 1.0, "rooms": 1.0, "location": 3.0}, "id": 14110352}, {"rating": 3.0, "stay_parameters": "Stayed February 2008, traveled with friends", "text": "the location was perfect - RER from charles de gaulle to within 50m, a short walk to isle de la cite, surrounded by the bars and restaurents of the latin quarter.", "title": "Great location, day time reception staff can improve", "user": "the_Sal_of_Man", "date": "February 26, 2008", "detail_rating": {"front_desk": 2.0, "business": 2.0, "service": 1.0, "cleanliness": 3.0, "value": 3.0, "location": 5.0, "rooms": 3.0}, "id": 13850429}, {"rating": 4.0, "stay_parameters": "Stayed February 2007, traveled with friends", "text": "Our only advice was don't order a grande beer from the cafes outside the sorbonne just over the road 18euro (13 quid) and it was undrinkable, but we found a place for lunch in the latin quarter behind the pantheon 3 courses with wine 10 euro (7 quid) - can't fault it", "title": "The hotel was really great!", "user": "tsot75", "date": "February 22, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 13748825, "likes": {"liked": "— Room, Location", "disliked": "— Breakfast"}}, {"rating": 4.0, "title": "Perfectly placed!", "text": "I wasn't sure what to expect wih this hotel but was really disappointed- especially as when we booked our trip we were told it was 'the equivalent if a 4 star' - it really isn't.", "user": "Margaret B", "date": "February 11, 2008", "id": 13465886}, {"rating": 3.0, "stay_parameters": "Stayed March 2007", "text": "Before my trip, I read the reviews of this hotel very carefully and held my breath as I headed to Paris with a group of students and colleagues. None of my fears were founded: the rooms were actually of decent size for Paris hotels (and our group needed 9 rooms altogether from singles to twins to triples). Yes, the paint on the walls in the hallway is a bit chipped from wear...but honestly, we found it to be a sort of \"shabby chic\" that is only found in Europe. All was clean, and no one complained of noise, especially given the location right off the Boulevard Saint Michel. There was great subway access from Cluny, Odeon and Saint Michel stations. The RER at the Luxembourg gardens was right up the street too. The front desk staff was very helpful and kind, whether working in French or in English. Some may be interested to note that the views from the upper floor windows truly are fabulous. All in all, I felt pleased with the hotel. Would I stay there again? yes, by all means. Would it be my first choice for a three star in this neighborhood? probably not; but only because I have found others in the area that suit my personal style better. Don't be afraid to stay here. It is a fine option.", "title": "very pleased", "helpfulness": 2, "user": "parishoes", "date": "March 22, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 5.0}, "id": 7203429, "likes": {"liked": "— location"}}, {"rating": 2.0, "title": "Great location and staff, awful rooms. Do not use the parischarmig hotels websi", "text": "We travelled at half term with our three teenage children.The location of the hotel was excellent and reception staff couldnt have been more helpful..but ..would we ever stay again? Definitely NOT.", "helpfulness": 4, "user": "ClannParis", "date": "November 6, 2006", "id": 6062881}, {"rating": 3.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "The rooms were awful. The 3 children shared and their room looked as if it hadnt been redecorated since the 70's and then by someone who was colourblind. The carpet looked grubby and was bunched up in several places. The corridors were scuffed, wallpaper coming off and large cracks in a couple of places.", "title": "Good Location, Good Service, Average Rooms", "helpfulness": 2, "user": "azzure", "date": "October 28, 2006", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 5.0, "rooms": 3.0}, "id": 6023291, "likes": {"liked": "— Location", "disliked": "— Red wallpaper!"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2006", "text": "Our bedroom the first night was terrible but on request the reception staff moved us after night 1. The second room was poor but infinitely better than the first.", "title": "A Terrific Hotel", "helpfulness": 3, "user": "sue2001", "date": "September 4, 2006", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 5.0}, "id": 5768251, "likes": {"liked": "— Location", "disliked": "— tiny lift"}}, {"rating": 1.0, "title": "No air conditioning.", "text": "I have read the other reviews and yes the lifts are small and its noisy but these didnt bother us at all. The breakfast was ample and pleasant but served on dark brown plastic 'school canteen' type trays which was a bit odd.", "helpfulness": 2, "user": "RogerThere", "date": "July 20, 2006", "id": 5490330}], "location": {"country": "France", "region": "Ile-de-France", "continent": "Europe", "city": "Paris"}, "stars": 4, "variance": {"poor": 23, "average": 75, "very good": 191, "terrible": 18, "excellent": 88}, "aka": "Hotel Trianon Rive Gauche", "slim_ranking": 0.346904629113, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.5, "location": 4.5}, "description": "The BEST WESTERN Trianon Rive Gauche is a charming hotel decorated in a traditional style with antique furniture, centrally located in Paris Saint Germain des Pres. Just minutes away from the Luxembourg Gardens, the Odeon Theater, the Musee d'Orsay and the Louvre, the hotel enjoys a prestigious location in the heart of the Latin Quarter, an area renowned for its enchanting historical streets and lively restaurants and bars. Our attentive, multilingual staff will be delighted to welcome you in one of our 110 comfortable rooms, fully equipped. You’ll also enjoy a delicious buffet breakfast in our cosy lounge. Direct access to Charles de Gaulle airport as well as most train stations."}