{"user_rating": 4.0, "review_count": 239, "name": "BEST WESTERN InnSuites Phoenix Hotel & Suites", "reviews": [{"rating": 1.0, "title": "Terrible Hotel", "text": "There were not parking lot available for hotel guests. The hotel should have informed us that they are having construction work done on the premise. The construction work permitted us to find parking spaces. The construction noises started by 6:30 in the morning.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "April 5, 2005", "id": 3335930}, {"rating": 4.0, "stay_parameters": "Stayed March 2005, traveled on business", "text": "Both phones in the hotel room do not work. The carpet looks dirty.", "title": "Will stay here again", "helpfulness": 8, "user": "LEckman", "date": "April 1, 2005", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 3317880}, {"rating": 3.0, "title": "OK but expected better", "text": "It's not deluxe accomodations, but it's just fine. I've stayed in 3 star hotels that were worse. The thing I liked is that it had all the amenities I wanted: High speed internet access in your room at no cost, free breakfast (and a very good one - not just the typical \"continental\"), fax service (n/c), nice pool and spa, good location. And two drinks (beer, wine, soda) every afternoon - again n/c. The bed was great. Quiet. M/W and fridge in the room. For the price, it's a great deal. I will stay here again.", "helpfulness": 19, "user": "A TripAdvisor user", "date": "December 1, 2003", "id": 1503277}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "We stayed here two nights, at the beginning and end of our trip to Arizona. Despite booking the hotel on-line well in advance I got two different rates $116 for the first night, $152 for the second + tax. I'd say that the first rate is closer to the real value of the room - we debated looking for another less expensive hotel for the last night and canceling the second reservation but didn't want to go through the hassle, especially since we were traveling with a baby.", "title": "Two nights - $40 difference in price", "user": "tripjimbc", "date": "March 31, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 3.0, "rooms": 4.0, "location": 5.0}, "id": 14692859, "likes": {"liked": "— Good quality, clean rooms, excellent breakfast", "disliked": "— Variation in price"}}, {"rating": 2.0, "title": "doubtful for another visit", "text": "What you get for your money - convenient location close to I51 but not close enough to hear the traffic. Easy 30 minute drive to the airport or car rental drop off. Good quality, clean rooms, comfortable beds, excellent breakfast (already described in detail in other reviews). Good area.", "helpfulness": 1, "user": "trippingJack", "date": "March 17, 2008", "id": 14348823}, {"rating": 4.0, "stay_parameters": "Stayed November 2007, traveled with family", "text": "We were upgraded on our first night to a two room suite (because they were overbooked) which came equipped with two washrooms (one wheelchair accessible), flat screen tvs, fold out couch bed. Very nicely done. Only complaint would be that the view was the stairwell heading up to the second floor and several mattresses that were being stored(?) there. On our second night we had a standard room with a single king bed - also very nice (but not worth the extra $40 we paid). We overlooked the pool and the jacuzzi was running all night.", "title": "We always stay here in Phoenix!", "helpfulness": 1, "user": "LMomNY", "date": "November 25, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 11052793, "likes": {"liked": "— quiet location, easy to get to from airport, breakfast buffet, good layout of rooms", "disliked": "— uncomfortable sofa bed"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled with family", "text": "Front desk staff were very helpful and had good recommendations for restaurants -you're within walking distance (about 1 mile) from several restaurants - try Carlos O'Brien's. A crib was requested and a playard was provided - mattress too hard for a baby to sleep on.", "title": "Pretty Nice, Clean, Convenient", "user": "nashuanh5", "date": "May 5, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 7546866, "likes": {"liked": "— Location"}}, {"rating": 3.0, "title": "OK for the Price...15 Minutes to Airport", "text": "Start with the positives: Housekeeping service was first-rate and the hotel location is convenient. The king non-smoking room had a comfortable bed and a plasma-TV and couch for $150/single. The room had both refrigerator/microwave.", "user": "azahunting", "date": "April 11, 2007", "id": 7330752}, {"rating": 1.0, "title": "Skip this place", "text": "tidy, but keep your shoes on. The carpets are a little dirty. Nice happy hour and not bad breakfast. Hot tub air jets broken pool jets broken but both clean. The area was nice and SAFE for out-of-towners.", "helpfulness": 1, "user": "CindyDeerfieldMA", "date": "March 15, 2007", "id": 7165706}, {"rating": 4.0, "stay_parameters": "Stayed December 2006, traveled with family", "text": "We just got back from Phoenix where we had stayed at this hotel for four nights. Normally we stay at Hampton Inns but wanted to be in the Squaw Peak area and thus decided to stay here. Right from check-in we should have known what to expect. We arrived too early to check in but since we travel very often we knew it was possible to leave your baggage there until check-in. While initially the staff was rude, the gentleman FINALLY agreed to have us leave our luggage and said it would be in our rooms when we checked back in later. Of course it was NOT in the room and we were on the second floor and no elevator! We are in our 60s and this was NOT convenient for either my husband or me. Breakfast is boring with the same thing every day, not like Hampton Inns that vary the menu. The air conditioning did not function well, the water in the tub did not drain out so that when taking a shower you were up to your knees in water. When we arrived and I asked where one could go to check on e-mails, as had been advertised in their listing service available in the Business Center, they told me it was \"down\" and not expected to be up until Monday.........this was Sat. On Monday when I checked again I was told still not up until Tuesday. One couple standing at the desk when I asked that question and heard this, turned on their heal and left as this was a businessman who needed that service. VERY inconvenient. Still not up when we left on Wednesday. Maintenance is terrible......lot of evidence that the place has been \"let go\". Breakfast area is very small..........as is the pool.......and with a tendency to cater to kids' traveling sports teams, you are lucky to find a spot to sit. This is the second time we have encountered this with a Best Western and will never stay at one again. Hampton Inns much better. Skip this place.........", "title": "Good motel, Poor location", "user": "Benbimi", "date": "January 2, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 3.0, "cleanliness": 3.0, "value": 4.0, "location": 2.0}, "id": 6540501, "likes": {"liked": "— Good value for the price", "disliked": "— The location"}}, {"rating": 2.0, "stay_parameters": "Stayed October 2006, traveled solo", "text": "We stayed at this hotel for four nights. My overall sense is that this was a good motel, comparatively inexpensive.", "title": "Good service but rude desk clerk", "helpfulness": 2, "user": "keepcool", "date": "October 8, 2006", "detail_rating": {"front_desk": 1.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 5926660, "likes": {"liked": "— service", "disliked": "— Book reservations through the hotel not AAA. It's cheaper."}}, {"rating": 4.0, "stay_parameters": "Stayed May 2006, traveled on business", "text": "Pros:", "title": "Convenient and clean", "helpfulness": 6, "user": "glbtrttr", "date": "May 28, 2006", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "rooms": 3.0, "service": 3.0}, "id": 5230019}, {"rating": 5.0, "title": "Highly recommend", "text": "This is not a fancy resort, but it has all the aces and for less than 100 bucks during season, it's an excellent value. Beds very comfortable, free internet, attentive staff, nice breakfast and little extras.", "helpfulness": 10, "user": "skagit46", "date": "April 9, 2006", "id": 4954250}, {"rating": 4.0, "stay_parameters": "Stayed January 2006", "text": "Stayed 9 days in Phoenix but only three nights at this hotel. Wished we had booked our whole stay here. Staff very friendly and available. Any time we requested something it was attended to right away. Rooms clean. Bonus is the breakfast, social time and the 3 computers in the lobby. Would definately stay here again. Thanks David, Pamela and Mila.", "title": "Everything you need", "helpfulness": 14, "user": "moonkwean", "date": "January 18, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 4361732}, {"rating": 5.0, "title": "Awesome full breakfast every morning!!!!!!", "text": "My husband and I stayed here for 7 nights from Nov. 11th to Nov. 18th, 2005 in a King Suite. The room was extremely clean in every way! The maid staff was sure to keep it spotless and restocked every morning. The room had a microwave, coffemaker, hairdryer, bottled water replenished each day, a small fridge, the sheets and pillowcases very soft and new pillowtop matress was lovely. We did our laundry here and took advantage of the vending machines each night for snacks. Too cold for the pool and hot tub, but we saw family's taking advantage, looked really neat & clean. Best of all, the breakfast off the lobby is worth your while not to skip! Eggs, toast, hash browns, make your own waffle station, yogurt, coffee, cereal, the works! For excellent coffee, drive one block into corporate area for specialty shops, gas, great chinese food and banks. Lobby has 3 computers with internet access (beware the firewalls that keep you from checking email, had to find Barnes and Noble to check mine, only drawback) and a nice fireplace, staff is very helpful and friendly. Free maps at front desk and loads of direction help. The pictures on line don't do it justice, much nicer than we expected. Highly recommend, don't hesitate on this one!", "helpfulness": 16, "user": "A TripAdvisor user", "date": "December 6, 2005", "id": 4216696}, {"rating": 3.0, "title": "Traveling with a toddler", "text": "Stayed at the Inn Suites beginning of May. We were looking for a budget hotel and I got an awesome deal on the Best Western site. (49.00 a night) Good points: room was clean and comfortable what you would expect. NOTE: We traveled with a 2 year old and there was NO room for a crib/ playpen with the two queen beds. This proved problematic as she was in/out of bed!!! Therefore keep this in mind before you order two queens! GOOD: Free breakfast in AM - \"You make waffles\" yummy, lots of juice, cereal, and other goodies. Unfortunately the breakfast room was small and often cramped, as well you may have to wait for your turn at the waffle cooker. GOOD: Staff where polite and offered travel tips. GOOD: First Wed of month they have a free BBQ (Hamburgers) looked OK but we skipped it. NOT SO GOOD: Pool was not the cleanest - scum around edge of pool. Hot tub either bath tub temp. or too hot? Also pool is located around the parking lot...therefore not the most relaxing, private or scenic. NOT SO GOOD: no place to sit outside room. There is a little deck, and pool area but we had to stay close to our room when our daughter was sleeping. We sat on cement railing and were in the way of cleaning staff.", "helpfulness": 14, "user": "cridge", "date": "June 8, 2005", "id": 3539626}, {"rating": 5.0, "stay_parameters": "Stayed April 2006", "text": "- Microwave, refrigerator, coffee maker in room", "title": "Great place to stay", "helpfulness": 7, "user": "Shouldercat", "date": "April 11, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 4966082}], "location": {"country": "United States"}, "stars": 2.5, "variance": {"poor": 11, "average": 35, "very good": 89, "terrible": 7, "excellent": 97}, "aka": "Best Western Plus Innsuites Phoenix Hotel Phoenix", "slim_ranking": 0.25988700565, "description": "Perfect for business and leisure travel, we set a new standard among Phoenix hotels for suite accommodations, free amenities and superior service in coveted Biltmore-area. Delight in magnificent Phoenix Mountain Preserve views. Enjoy nearby golf courses, renowned attractions, decadent dining and spectacular shopping options, not to mention exciting sports events around the Phoenix/Scottsdale/Glendale area. Suite Luxury for Less with Cloud 9 Beds & Bedding and FREE: Hot Full Breakfast, WiFi, Evening Social Hour & more!"}