{"user_rating": 4.5, "review_count": 216, "name": "BEST WESTERN Eurociel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled with friends", "text": "I owe this fabulous place a review. We spent 3 nights at Montpellier and are very delighted that we made the choice of staying at BW Eurociel. Very efficient, friendly, informative and fluent English-speaking reception staff who went out of their way to help. 10 minutes with luggages on foot from main gare. 3 stops by tram to airport shuttle bus, or if you are fit and do not have much to carry, by walking in 20 minutes or so. Very close to the new shopping mall too. A pity that we did not have breakfast there, which looked extremely attractive!", "title": "No wonder it is #1", "helpfulness": 2, "user": "JJB", "date": "October 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 181773330}, {"rating": 4.0, "title": "Good value for money", "text": "I agree with all the reviews, the room was very small no 43 but comfortable, clean and helpful staff. Bathrooms are good and great coffee machine in the room. Off street parking at €12 per day. It's an easy stroll to main shopping area and restaurants. The tram stop is very close but you have to walk up steep stairs or walk to the main square 5 mins away. At the price I would recommend it for a couple of nights.", "user": "Jill M", "date": "October 13, 2013", "id": 180757125}, {"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "This hotel is very clean, very neat, very handy in location, nice staff and nicely decorated but basic and with small rooms. The hand basin is in the room itself and the shower door opens straight into the room ie you have to come back into the bedroom area to dry yourself. This was fine on this occasion when I was travelling with my husband, but on other occasions I travel with my daughter or mother. This would not have been fine! At least the toilet is a separate room!", "title": "Handy to train station", "user": "ozzie5melbourne", "date": "October 11, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 180553219}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "That said it is quiet, well priced (102 euro w/o breakfast) and a very easy walk to the station and to the rest of the town. Montpellier was a beautiful place to visit and from there we caught the TGV straight to CDG airport. How easy was that!", "title": "Pleasant and clean", "helpfulness": 1, "user": "Hellnar", "date": "October 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 180080252}, {"rating": 3.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "My husband and I spent a night in this hotel and we really appreciated :", "title": "Good location but small room", "user": "LambertCheshire", "date": "September 27, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 4.0}, "id": 178802640}], "location": {"country": "France", "region": "Languedoc-Roussillon", "continent": "Europe"}, "stars": 3, "variance": {"poor": 3, "average": 8, "very good": 57, "terrible": 0, "excellent": 148}, "slim_ranking": 0.0246913580247, "description": "An invitation to travels, relaxation and rest for this new hotel opened in 2012.Immersed in a warm and contemporary atmostphere, the journey can begin. Spain, Italy, Germany, Benelux, England and Greece: 6 floors / 6 stopovers, the choice is yours. The decoration subtly combines the travels and the charm of Montpellier. Family operated and independent hotel where customer service and attention are the motto. Hotel fully sound proofed.Our salon ''Stars'' welcomes you in a felted and contemporary atmosphere suitable for relaxation (starry sky, living green walls, aquarium and Mediterranean plants).Reception open 24 hours. An outdoor terrace equipped with a smoking area/solarium. Internet corner free and fully equipped (printer and fax)"}