{"user_rating": 4.5, "review_count": 162, "name": "Best Western Plus Slidell Inn", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed February 2007", "text": "We saw this hotel in the AAA guide book and it seemed that it was a convenient place to stop. It was nice that there were quite a few places to eat around the hotel.", "title": "New Rooms, and a pretty smile", "helpfulness": 1, "user": "DoreenSanAntonio", "date": "February 28, 2007", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6892615, "likes": {"liked": "— Rooms", "disliked": "— None"}}, {"rating": 1.0, "title": "RUDE STAFF & MISLEADING ADVERTISING", "text": "My husband just wanted a place to lay his head for the night. The place looked nice when we walked in, The girl at the desk was friendly, she could see we were tired and gave us a little extra attention, so we felt a little more at ease. She told us the rooms had just be remodelled, so we thought that they probably just put on a new coat of paint, but to our surprise the rooms looked marvelous and the beds were so comfortable. We got a great night sleep.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "May 9, 2006", "id": 5045122}, {"rating": 1.0, "title": "Patron Beware", "text": "Breakfast was fine also, it was a nice break on our way to Florida. We stopped there on our way back also and enjoyed the same polite staff. They must really have straightened out what ever problems they've been having. Good work !!", "helpfulness": 8, "user": "A TripAdvisor user", "date": "September 13, 2004", "id": 2526967}, {"rating": 5.0, "title": "Best hotel in the \"Little Easy\"", "text": "I was quoted a rate of $99 by the hotel directly. Everything on their website and the third-party websites indicated \"Free Limited Continental Breakfast\" which is one of the reasons we chose the hotel. When we arrived, we were informed that there was no breakfast. I asked if there was a rate adjustment since we were never told that the breakfast would not be included. The front desk clerk said no and asked if we wanted to find other accommodations. This was at 11 p.m. on a Friday night! Talk about customer service! They've never heard of it! You should never mislead a guest. It's just false advertising. It got worse when we entered the room. There was mold on the curtains and live mosquitoes buzzing about. Ignoring the \"privacy please\" door hanger, a male employee entered our room without knocking well before check out time. Thankfully, we had just dressed. Only one of the machines in the \"gym\" worked and there was no TV or music. It's pretty hard to work out to silence. Again, it's false advertising to say you offer amenities that you don't have. Best Western should be ashamed to put their name on this dump.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "September 8, 2003", "id": 1276060}, {"rating": 5.0, "title": "A Hidden Haven", "text": "I want to inform you about Best Western Slidell Inn at 120 Taos Street if you are considering staying there. Don't! There is a sleep inn that is the next exit over---it is about the same price and at least there you will be guaranteed a \"clean\" room. I stayed early this month. We booked the hotel on Travelocity. During our first night, when we checked into our room there was a pungent odor. We thought it was the smell of the hotel and could not understand why such a new hotel smelled so bad. We complained to the desk clerk about the smell. He said we could either check into a smoking room or there was a suite available for an additional charge. We could not check into the smoking room, because my companion has asthma and we didn’t want to pay an additional fee for the room so we stayed in the room. Upon our investigation of the foul odor, we found huge mold spores in the air conditioning vent. When we called to tell them about the mold problem and that we would take the other room, it was no longer available. We had no choice, but to spend the entire night in this room.", "helpfulness": 5, "user": "Atul P", "date": "August 30, 2003", "id": 1269820}, {"rating": 3.0, "stay_parameters": "Stayed August 2009, traveled on business", "text": "The competition in Slidell amongst several garden variety motels is close, but unfortunately not fierce. Don't let the few rankings fool you: Slidell motels are highway side places catching sleepy travelers that can't make it 30 more miles.", "title": "Average place in a town of average motels", "user": "Chase71", "date": "August 15, 2009", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 2.0, "service": 4.0, "rooms": 3.0}, "id": 37741624}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "The somewhat hidden location of this motel, not visible from the highway -another motel sits in front of it- is a little of a let down. The breakfast is basic, but that's to be expected from a BW.", "title": "The nicest hotel staff I ever encountered", "user": "JackpotJudy", "date": "July 21, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 35347532}, {"rating": 4.0, "title": "Nice hotel", "text": "One thing to note, this motel has a very good cable channel line up. If you prefer Best Western then this chain will not disappoint. But in Slidell there is a better choice. And its 2 exits south on the east side of I 10.", "user": "sctraveler15", "date": "November 30, 2008", "id": 22312965}, {"rating": 4.0, "title": "Pretty Good stay", "text": "We stayed at the Best Western Slidell Inn in Slidell, LA during a return trip from Walt Disney World. The reason I chose this hotel was due to its close proximity to New Orleans, which we planned to tour the next day.", "user": "MrsJonesD", "date": "July 24, 2008", "id": 18211584}, {"rating": 4.0, "title": "Nice for the price, and newly redecorated!", "text": "We arrived at this hotel at around 8:00 in the evening and our first impression was the overly crowded swimming pool. It was swarming with kids – all preteen boys - and the noise level waaaay was up there.", "helpfulness": 2, "user": "TreetopFlier", "date": "March 5, 2007", "id": 6919319}], "location": {"country": "United States", "city": "Slidell"}, "stars": 2.5, "variance": {"poor": 6, "average": 11, "very good": 35, "terrible": 8, "excellent": 102}, "aka": "Best Western Slidell", "slim_ranking": 0.277777777778, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "Enjoy comfortable accommodations and easy access to NASA's Stennis Space Center, the Superdome, Mardi Gras and Textron Marine.The BEST WESTERN PLUS Slidell Inn puts you right in the middle of all the area's attractions including the Gulf Coast Beaches. Those traveling for work are ensured a productive trip, as, Textron Marine, Manheim Auto Auction and Lockheed Space Operations are all nearby. Many business travelers also enjoy taking meetings to the greens of Oak Harbor Golf Club.New Orleans - just 25 miles away - provides lots of entertainment and excitement. There you can enjoy visiting the Aquarium of the Americas, The National WWII Museum, Harrah's New Orleans Casino, Audubon Zoo, Riverwalk Market Place, New Orleans Arena and Louisiana Superdome. You'll only be a short drive away from Mardi Gras, Essence Music Festival and other New Orleans festivals. The area also offers swamp tours, plantation tours and cruise lines. While staying at this Slidell hotel, sports enthusiasts will not have to travel far to participate in National Fishing Rodeo's, see our \"Super Bowl Champion\" New Orleans Saints, New Orleans Hornets, Sugar Bowl, Bayou Classic or many other sporting events. Within 15 miles of our property, you can also enjoy visiting Fort Pike State Historic Site or our Slidell Outlet StoresDelight in all the comforts of home in this Slidell hotel's spacious, well-appointed rooms - all featuring a 32-inch LCD TV with cable satellite television and HBO®, a microwave, a coffeemaker, a desk, a refrigerator, high-speed Internet access and much more. Get the perfect start to each day with a delicious complimentary full breakfast. Spend some time relaxing in our outdoor salt-water pool, which is kinder on the environment and your skin. Hotel guests are more than welcome to also take advantage of the free parking, 24-hour exercise facility and complimentary coffee.For a memorable stay in Slidell, make a reservation at the BEST WESTERN PLUS Slidell Inn today and save!"}