{"user_rating": 4.0, "review_count": 185, "name": "BEST WESTERN Prescottonian", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "The room was big and clean clean clean!! The free breakfast was a FULL breakfast, not continental, and it was so good. It snowed for three days and the heater was awesome, and the maintenance man cleared all the car windows of snow. The bed was very comfortable and so were the pillows and fluffy soft blankets. I will definitely stay there again.", "title": "Super Clean", "user": "LilaB72", "date": "April 11, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 103633568}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled on business", "text": "I have stayed at the Best Western Prescottonian several times and will continue to do so, I have an upcoming reservation. The rooms are always clean, internet is good, front desk staff is friendly, Mexican restaurant is good. I enjoyed the breakfast as well.", "title": "Great hotel", "user": "AZINTraveler", "date": "January 6, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 92022865}, {"rating": 3.0, "stay_parameters": "Stayed January 2011, traveled with family", "text": "We took the kids up to spend some time in the snow. Motel was very easy to find and staff was friendly and helpful. The room was typical for a motel but very large with small tv. Fridge and microwave in room which is nice. Beds are VERY comfy with new bedding. The only complaint I have was that they did not shovel the snow off the stairs to the upstairs rooms. To be fair though they let us check in early and did warn us that they only had rooms upstairs available unless we wanted to wait till check in time. The free breakfast was awesome!!", "title": "Comfy beds and excellent free breakfast", "user": "hotrodlassie", "date": "January 2, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 91427131}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled with friends", "text": "Myself and my wife plus another couple, recently spent five days in Prescott and the entire stay was a pleasure. A beautiful town and very friendly people but the stay at the Prescottonian was jewel of the trip. Starting with the staff, I have never felt more welcome at any Hotel/Motel in my entire 61 years. The rooms were spacious, well appointed and comfortable. The beds were as good as my own and each bed had FIVE large pillows. My only want was for my 60\" HDTV but I suppose that would have been too much to ask for. The Wifi worked great after a young lady at the front desk came to my room set it up for me when I couldn't quite get working on my own. The free breakfast was great also and it was as complete a meal as I have ever wished for. Eggs, bacon and sausage, biscuts and gravy, orange and apple juice, fresh cinnamon rolls and cerel with milk. That is NOT continental !", "title": "A Very Good Experience!", "helpfulness": 1, "user": "jakebrake49", "date": "December 8, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 89363961}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "We will be going back next year and the Prescottonian will be our only choice for a hotel!!", "title": "A quality motel for the price", "user": "highflyer46", "date": "November 21, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 87720997}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled on business", "text": "Whether traveling with Collegues or Family you can't beat this! Friendly Staff, Great Rooms, Brand new Beds : ) Loved the Happy Hour, just a $5 taxi ride to Whiskey Row and incredible Hot Breakfast Buffet including a Waffle Bar is included.", "title": "Best Bang for Your Buck in Prescott!", "user": "hgroom", "date": "October 25, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 84802769}, {"rating": 5.0, "title": "Greatest value in town for the price!", "text": "Cant wait to bring the Boys Up and love the fact that they have tons of parking so we can bring the trailer with the quads up!", "user": "ILoveAZ", "date": "October 15, 2010", "id": 83629998}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled with friends", "text": "This is not your typical motel. The rooms are very plush, great showers, great breakfast buffet, and I love the inroom refrigerators. Location is convenient to downtown, but a bit of a walk, so plan to drive, or take is taxi (its very cheap) if your visiting whiskey row.", "title": "High quality hotel/motel with plush rooms", "user": "elynor250", "date": "September 26, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 81047635}, {"rating": 5.0, "title": "Good Time", "text": "Great hotel though bit of a walk down into town, if you don't want to drink and drive. Taxi cheap though. Restaurant attached looked good but didn't eat there. Breakfast lovely. Pool a bit close to busy road, though not overlooked.", "user": "tf97355", "date": "August 23, 2010", "id": 76494315}, {"rating": 3.0, "stay_parameters": "Stayed June 2010, traveled solo", "text": "I have nothing but good things to say about a convient and nice hotel. The Breakfast in the morning was excellent, the staff was courteous and very accomadating, the rooms were in excellent shape, the beds were firm with pillowtops, the pillows were excellent, the airconditionar was easily regulated by the tempature control and the room was spacious with an excellent TV. I would highly recommend the motel when you are staying in Prescott because it is easily accesible to everything at a price you can afford.", "title": "Decent hotel", "user": "ddinthelou", "date": "June 27, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 68856938}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled with friends", "text": "We got a great group rate for the team, and the rooms were huge and clean. The breakfast was great, hot, and FREE! so it saved us a bundle. The service was absolutely outstanding. I had an air conditioning issue in my room for the first night, and mentioned it to the front desk the next morning. By that afternoon they had completely changed out the A/C unit and the problem was solved. Our team will definitely be staying at this hotel again.", "title": "Softball Team Friendly", "user": "dellahiser", "date": "July 25, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 5.0}, "id": 115771467}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "Except for a carpet that could use a shampoo this was a great place to stay. The restaurant served wonderful large portions of mexican food. There was a lot of space in the room and the staff was very helpful. The breakfast was excellent and the attendent/chef provided the best customer service.", "title": "Very Comfortable, roomy and quiet", "user": "papamikeinaz", "date": "July 17, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 115463404}, {"rating": 5.0, "stay_parameters": "Stayed June 2011", "text": "I was so pleasantly surprized at the quality of this room. Family owned, everything about this was up to par. Comfortable bed, spacious, modern, flat screen tv, this is not you average Best Western. Close to down town. So glad we stayed here!", "title": "Excellent! Large, clean, updated..family owned, wow!", "user": "kymreiss", "date": "June 25, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 114736709}, {"rating": 3.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "We stayed here for one night while visiting Prescott. This is more of a motel than hotel; rooms open to the outside and are very spartan. We changed rooms twice due to proximity to the stairway and street. Consists of several buildings which look quite institutional from the outside. The tv was small; sliding door to a balcony overlooking a dump-like area; not very inviting. Sliding doors were filthy. Bed was pretty comfortable; had pillows that were about 1/2 the size of normal and overly fluffy; I used a folded towel instead. A/C worked fine. The room was pretty quiet and parking was convenient. Breakfast buffet was pretty sparse but adequate. The desk clerk let me use the office computer/printer to print our boarding passes; they were very helpful and friendly.", "title": "Very basic motel", "helpfulness": 1, "user": "Lmarsh4444", "date": "April 27, 2011", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 105878900}, {"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled with friends", "text": "I know i have not stayed in every bed in Prescott, but I cannot imagine a more comfortable bed than the one I slept in at the Prescottonian on Tuesday night. The room was clean and comfortable an relatively quiet too. The breakfast was an added perk.", "title": "Most comfortable bed in Prescott", "user": "EscalanteBeezy", "date": "April 15, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 104175975}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "This is an Average Best Western with wonderful customer service and the added value of a complimentary full breakfast. Makes for a great value.", "title": "Great Value", "user": "NrsMary", "date": "September 16, 2011", "detail_rating": {"value": 5.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 118214473}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "We stayed here one night while visiting Prescott in August to attend an Arts Fair at the Courthouse. The rooms were clean, large and very comfortable. Each room comes with micro and fridge so it's very convenient if you are purchasing drinks and snacks for your room. There is a mexican restaurant on site which serves great food and margaritas by the picture! Also the hotel serves a huge American breakfast with make-your-own waffles, hot eggs and meat, breads, juices and coffee. We felt this was a good choice for the comfort of the room, closeness to the downtown and great food choices. Would stay here again.", "title": "Nice hotel with Great Breakfast", "user": "4VICCI", "date": "September 12, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0}, "id": 118001394}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with friends", "text": "we have stopped in prescott a lot on our two motorcycle trips to america every year.we have tried most of the other motels the prescottonian is the best,very freindly staff,we got the room we wanted so could park the motorcycle right outside the door,clean and roomy and safe walking distance to family resturants.there are motels just down the street for maybe $20 cheaper but the excellent hot breakfast you get here outweighs the saving,we have never been disapointed and will be back next june and september", "title": "the best", "user": "bosshog1", "date": "September 12, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117977764}, {"rating": 2.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "The air conditioner was so loud that we couldn't sleep all night, and the rooms are less than marginal. It's hard to get out from the hotel to the street because the way the hotel is situated. We would not come back.", "title": "Would not stay there again", "helpfulness": 1, "user": "Kaypo9999", "date": "August 27, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 1.0, "value": 1.0, "service": 2.0}, "id": 117317273}, {"rating": 3.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "We chose this inn primarily because they welcomed our two small dogs. The location was close to everything from Costco to Whisky Street and the town square which is fabulous.", "title": "It was O.K. but a little more attention to detail would go a long way.", "helpfulness": 1, "user": "cheguaverra", "date": "August 19, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 3.0, "value": 3.0, "service": 3.0}, "id": 116966317}], "location": {"country": "United States", "city": "Prescott"}, "stars": 2.5, "variance": {"poor": 7, "average": 32, "very good": 58, "terrible": 5, "excellent": 83}, "aka": "Best Western Prescottonian Hotel Prescott", "slim_ranking": 0.363636363636, "description": "True \"Down Home\" hospitality is the foundation of the Best Western Prescottonian and we are literally expecting company everyday and treat them like our family. We are constantly striving to improve our hotel and completed a total award-winning renovation of all our guestrooms and suites in 2007. Our central Prescott location is a safe harbor for the wayfaring stranger and our hallmark service will host their many returns as friends. Most of our guests enjoy an authentic, delicious Mexican meal at Plaza Bonita Family Mexican Restaurant located right on our premises. We provide a wide array of amenities and services to make your stay with us comfortable and convenient, like free high speed wireless internet access in all rooms so you can catch up on email with family and friends and there’s always the chance the office needs a little of your time. Relaxing in our outdoor heated pool is one of the most popular activities. How about a perfect way to start your day? A Free Full Hot Breakfast Buffet, every morning from 6am to 9pm lets you choose what’s best for you. The best breakfast deal in Prescott!"}