{"user_rating": 4.5, "review_count": 96, "name": "BEST WESTERN PREMIER Hotel Rebstock", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled with family", "text": "Hotel lobby is very nice but the spacious rooms are a bit tired and could use some sprucing up. Staff was very helpful and pleasant. They offer a lovely breakfast.", "title": "Ok, could use a little update", "user": "japindy", "date": "September 28, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 10015266}, {"rating": 5.0, "stay_parameters": "Stayed April 2007", "text": "I noticed several lukewarm reviews about this hotel on this website before travelling. I have just returned from a 4 day trip staying at this hotel as a member of a touring choir. We all thought the hotel was excellent. The staff were extremely friendly and helpful. The breakfast buffet was exceptional - very extensive and attractive. The hotel provided a last night buffet supper after the final concert which was excellent and beautifully presented. My (shared double) room was large and well appointed, especially the bathroom - certainly not 'tired-looking'. My one small criticism would be that the reading light fitting set into the bedhead was placed so as to make sitting up in bed rather awkward. However, to anyone looking for a good quality hotel I would definitely recommend this one.", "title": "Great hotel in the heart of a lovely city.", "helpfulness": 3, "user": "happytraveller40", "date": "April 15, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 7363932, "likes": {"liked": "— very friendly helpful staff", "disliked": "— rather subdued bedroom lighting"}}, {"rating": 3.0, "stay_parameters": "Stayed October 2006, traveled solo", "text": "I chose Wurzburg as the starting point for my Romantic Road tour. Although the room wasn't what I expected, the hotel staff and restaurant quality made up for it. The room was clean and comfortable, although it did seem a little tired. I took into consideration the \"Old World Style\" because of its location, however it could use some updating. The bathroom looked as though it had been recently refurbished and THE TUB WAS AMAZING! The front desk staff were very attentive to every need and the food was of excellent quality. The location is convenient to many of the sites of Wurzburg and there is a tram stop located within 1 block.", "title": "A Taste of Bavaria", "helpfulness": 4, "user": "mattmc1976", "date": "December 7, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 3.0, "location": 5.0, "rooms": 3.0}, "id": 6343785, "likes": {"liked": "— Front Desk, Food, Staff", "disliked": "— Although there is a tiny elevator, hallways tend to be long and there are some steps and door to go through before you get to your room so I don't reccomend for passengers with handicaps."}}, {"rating": 3.0, "stay_parameters": "Stayed December 2005", "text": "Although the exterior and the lobby area of this hotel are quite elegant, the guest rooms themselves are looking a bit frayed and tired; however, the bathrooms are very modern with excellent bright lighting. The room we had was almost \"closet-size\", with one very tiny window (though we had booked well in advance); we immediately requested a room change but were told that the hotel was fully booked. Considering the high rates that they charge, a room of that size and in need of some renovations, is unacceptable.", "title": "Perhaps getting a bit tired...", "helpfulness": 8, "user": "Rupes", "date": "January 8, 2006", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "rooms": 2.0, "service": 3.0}, "id": 4330650}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "This is a terrific hotel, the best on our recent trip to Vienna, Prague and Germany. My brother and sister in law stayed there eons ago and have spoken fondly of it ever since. Based on that I checked it out and found mixed reviews, some suggesting that it was nice but had seen better days. Nonetheless I booked it and it was wonderful. It’s now affiliated with Best Western as one of the Premier properties. It’s directly in the Old Town probably a half kilometer from the Residenz.", "title": "Rebstock--still a great hotel", "user": "FloridaTravelmum", "date": "October 18, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 20989207, "likes": {"liked": "— Well kept rooms, beautiful breakfast room, tasty breakfast, nice restaurant", "disliked": "— Close to but not right in the middle of the old town."}}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled solo", "text": "Our room was spacious and nicely decorated in modern style with a couch, coffee table and desk besides the bed. The bathroom was very large and had both a tub and a separate walk in shower of some size with terrific “just right” water pressure. There was also a large walk in closet. There were nice little touches everywhere, like a note on the night stand offering delivery of warm milk with honey for anyone having trouble falling asleep.", "title": "Best hotel experience ever.", "user": "johnrconley", "date": "September 8, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 19892117, "likes": {"liked": "— the staff", "disliked": "— the street construction (no control of hotel)"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "There was free internet at the reception desk and a lovely included buffet breakfast in an airy atrium-like breakfast room with a growing tree in the middle. Everything you could imagine was offered on the breakfast buffet, even champagne or some German sparkling wine. The cheese plate had a large variety of cheeses all listing their respective “fett” contents. We dined one night at the hotel in their small but lovely dining room and had a very respectable dinner, including perfectly done lamb with a horseradish flavored crust and gratin of potatoes.", "title": "Definitely needs refurbishing", "helpfulness": 1, "user": "SW19Traveller", "date": "August 28, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "rooms": 3.0, "location": 5.0}, "id": 19461956, "likes": {"liked": "— Friendly and helpful staff", "disliked": "— Dated furnishings and decor"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "Service was both pleasant and prompt as well as competent. We left very early on our final day for a flight and were both given bottles of water to take on our journey. All this for the least expensive stay of our trip—140 euros per night double via an internet booking.", "title": "Loved it!", "helpfulness": 1, "user": "Hoffeld", "date": "August 21, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 19203214, "likes": {"liked": "— The Staff and the little touches", "disliked": "— noise from the street when the windows were open"}}, {"rating": 2.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "Perhaps there has been some kind of major renovation since the people whose reviews I read stayed at this hotel, but there is no sign of shabbiness or need of renovation at this lovely, well kept, top drawer hotel and I would be happy to find similar lodging at every stop I ever make in the future. If I return to Wurzburg, I will insist on staying at the Rebstock.", "title": "Not-so-pleasant Stay in Würzburg", "user": "gfmPennsylvania", "date": "June 8, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 3.0, "value": 2.0, "rooms": 1.0, "location": 4.0}, "id": 16773921, "likes": {"liked": "— Good location", "disliked": "— The room and noise"}}], "location": {"country": "Germany", "continent": "Europe"}, "stars": 4, "variance": {"poor": 6, "average": 10, "very good": 27, "terrible": 1, "excellent": 52}, "aka": "Best Western würzburg", "slim_ranking": 0.104166666667}