{"user_rating": 4.0, "review_count": 357, "name": "BEST WESTERN Inn at Face Rock", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "we upgraded to a suite because we didn't care for the config of the regular hotel room. the suite was wonderful. they gave us a pretty good price. Breakfast costs but the hotel splits the price with you.", "title": "great location", "helpfulness": 1, "user": "CottonwoodCindy", "date": "September 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 175378911}, {"rating": 4.0, "title": "Lovely surprise", "text": "We enjoyed a wonderful dinner and great night at the BW Inn at Face Rock. Desk service was great. We made a last minute reservation on Labor Day weekend and were welcomed even though we arrived two hours before check-in. Though the property is older, our room was clean and updated. Upon entry, it was a bit musty, maybe was once a smoking room, but we opened windows and weren't bothered by it. The highlight of our evening was a delicious dinner at the restaurant! When checking out, the staff asked about our stay and when my husband hesitated (thinking of a nearby guest's barking dog) staff encouraged us to share our concerns. Turns out they'd received a call about the barking and followed up w the owner resulting in the barking stopping before it became a problem for us. We felt well fed, well slept, and well served. All that and a lovely walk down on the beach!", "helpfulness": 1, "user": "JennAndFrans", "date": "September 2, 2013", "id": 175188094}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "The ocean is very accesible across the street and you can hear it at night with your windows open. Rooms are very clean and the staff is exceptional in making sure you are settled in and have no questions. Beds are soft and very comfortable. On site restaurant, golf course and indoor pool.", "title": "Across The Street From the Ocean, Good Price, Clean Rooms, Friendly Staff", "helpfulness": 1, "user": "dandkc", "date": "August 27, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "service": 5.0}, "id": 174431585}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled on business", "text": "My husband and I always travel and stay at Best Western, because the service either by phone, or online is great. And their rooms are very comfortable and very accomodating. I would definately recommend Best Western Hotels; especially the \"Plus\" Best Western's as well as the \"Premiere.\"", "title": "A great time with business trip!", "helpfulness": 1, "user": "Robert F", "date": "August 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 174431757}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "For our 4th anniversary, we opted for the \"Hopeless Romantic\" package on their website. It includes a spa room, dinner gift certificate, flowers, and sparkling cider or wine. When I made the reservation, the information the clerk gave me and what the package said did not match. Even though the information the clerk had was different, she said they would honor what was on the website. At check in, I had to again remind them that the package I paid for was the one on the website and they again agreed to honor what was on the website without any fuss, and gave us a second dinner certificate for the trouble. We had one of the spa rooms, and everything was very clean and well stocked. The flower bouquet was beautiful and the wine was delicious. The staff went above and beyond, making sure every request we had was met in a timely fashion. They made our visit very enjoyable and we will definitely visit again.", "title": "Above and Beyond", "user": "Kari B", "date": "August 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 174045854}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "This was a condo on a golf course. It was very nice and has a short walk to the beach, dinner at Bandon bills was ok. Front desk staff added an extra star, they are great! Face Rock was a cool attraction.", "title": "Best in Brandon", "user": "JFruitsdad", "date": "September 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 177176660}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "We stopped here without having a reservation and it turned out to be a wonderful experience. The front desk staff was so helpful. The grounds are pretty. The pool, spa and sauna were all clean and relaxing. Room was pretty and clean. We didn't have any problem using the walkway to the beach. The laundry facilities were great and affordable. I thought about keeping this gem to myself but they really do deserve the accolades.", "title": "A Relaxing, Pleasant Experience", "user": "Sandi S", "date": "September 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 176941121}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled on business", "text": "I stayed here only one night for business but was very pleased. I would definitely consider returning for pleasure. The rooms were very comfortable and clean with lots of room to spread out. The breakfast was a bit spendy but the half off coupon made it more than reasonable.", "title": "Great value", "user": "Stephanie C", "date": "September 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 176956747}, {"rating": 4.0, "stay_parameters": "Stayed August 2013", "text": "The rooms were adequate, nothing fancy, but for the price it is fine. There is a walking path that takes you down to the beach, it is short, about 500meters. The location is great, the coast is beautiful right there, walk either direction for nice views. The downtown area is a short drive. We ate at the restaurant at the hotel, bandon bills, it was decent food and good service for the price! We would go back again.", "title": "Nice hotel for a stopover at the coast.", "helpfulness": 1, "user": "areneeCR", "date": "September 4, 2013", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 3.0}, "id": 175634327}, {"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled with friends", "text": "This was literally one of the most enjoyable hotels we've stayed in all year! We had a queen suite with a roll-away for my son. Wonderfully roomy with a nice fireplace, small deck, separate queen bedroom, kitchenette, and 2 full bathrooms. The kitchen was nicely stocked and you could literally make a pot of clam chowder if you chose to because it was selectively but nicely stocked. No wine glasses but they did have a wine bottle opener. The room itself was very clean as were all of the linens and towels. The bathrooms were also VERY clean upon check in.", "title": "So Comfortable & Spacious", "helpfulness": 2, "user": "moonovrmiami", "date": "September 3, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 175625255}, {"rating": 3.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "Nice location in a beautiful part of the country and a functional hotel but nothing spectacular. The beach access is across the street so there is no view of the ocean available from any of the rooms. The restaurant next door Barnacle Bill's is horrible! Highly recommend that you find another place to eat if you stay here. The service was okay at the restaurant but the food was a mess and did not arrive for close to an hour. We were told they were understaffed when we sat down so we should have left then, but when the food arrived, we knew we were in trouble. The crab cakes were not edible. To their credit, when I complained they took it off the bill.", "title": "Functional Hotel", "user": "TBS55561", "date": "September 22, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 178191537}, {"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled on business", "text": "Staff very friendly and gave us an upgrade to a ocean-view king suite. Suite had living area, kitchenette, 2 bathrooms and BR with king bed. Room was on second level and very clean, quiet and well-equipped.", "title": "Best Western - Bandon, OR", "user": "Eye-on-ocean", "date": "September 22, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 178188793}, {"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "Biggest issue was scented cleaners used which caused an issue until we opened windows. Advised staff at check-out and were told we weren't the only guests to bring this issue up; so, why continue to use the product????", "title": "Nice Beach nearby", "user": "GramaSue2007", "date": "September 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 177740791}, {"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled with family", "text": "The next day we realized we left a down pillow behind in the room. Called the Best Western and they located and shipped the pillow to us and just chsrged the shipping cost. Very nice response on their part.", "title": "Hotel", "user": "Leanne T", "date": "September 15, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 177331565}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled on business", "text": "Other than the scented cleaner issue, we really enjoyed the place.", "title": "Bandon does not disappoint", "user": "Michael O", "date": "September 15, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 177331444}, {"rating": 3.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "I was hoping for a bit more when I booked this property. I knew it was not ocean front, but I had hoped to get some glimpse of the ocean, but not to be. The service was fine. The room itself was nothing special. The whirlpool spa was toasty, the pool a bit on the chilly side. We had breakfast at the next door restaurant, Bandon Bill's. Skip it, dreadful is the only word to describe it. I'd not stay here again and really can't recommend it either.", "title": "OK Motel", "user": "highdesertbadger", "date": "October 3, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 179651843}, {"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "After a long, tedious drive we were ready for bed and sleep. We checked in and found our room with no problems. The room was clean, comfortable and we had a good night's sleep. The bed was very comfortable and the room was quiet. We only had a few issues --- no a/c so the room was very, very warm when we opened the door. This was relieved by opening both the front and patio doors to air it out. The toilet flushing chain broke the morning we left. Also the hot water in the shower took a long time to heat up. We will definitely come back when we can really enjoy the location and the area. There was no complimentary breakfast but was given a 1/2 off coupon for the restaurant next door. As we were leaving early and the restaurant wasn't open, we did not use the coupons. No beach views from the rooms that we could see.", "title": "Nice Room across the road from the beach", "user": "jav9206", "date": "September 28, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 179004268}, {"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "We stayed for two nights here while on a road trip in Oregon. We really liked this hotel. Room was large and comfortable. Staff friendly and helpful. Breakfast was very good and a great deal for the price .One complaint about it was there was only one waitress working for two large rooms and she was actually trotting from table to table. Also not enough kitchen staff so buffet kept running out of food, cups etc. However, the view from the main dining room made up for it. We ate dinner at the restaurant one night - my husband loved his meal but I found the rockfish to be totally overcooked and dried out. Very disappointing. The second night we ordered pizza and ate in our room - I am not a big pizza fan but actually rather enjoyed this one.", "title": "Great stay", "user": "GabrielSurrey", "date": "September 23, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 178358843}, {"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "The walk to the beach is not a long one and the beach is absolutely glorious.", "title": "Great!", "user": "BobandSheila2013", "date": "September 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 178337855}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "One issue we had. The rooms had a card to mark whether you required full service or \"towels and garbage pick up only\" As we were only there for two nights, we chose the latter one. Much to our surprise, our bed did not get made. Surely this is a given in a hotel?", "title": "Practically on the beach...", "user": "trunkbaygirl", "date": "September 22, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 178219253}], "location": {"country": "United States"}, "variance": {"poor": 15, "average": 55, "very good": 127, "terrible": 11, "excellent": 149}, "aka": "Best Western Inn At Face Rock Hotel", "slim_ranking": 0.5, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.0, "location": 4.5}, "description": "Bandon's only full service resort. Just across the beach from the Pacific ocean and within minutes of world class golf and other attractions. The only AAA 3 diamond property in the area, and the Westernmost Best Western in the continental U.S.!"}