{"user_rating": 3.5, "review_count": 148, "name": "BEST WESTERN PLUS Merrimack Valley", "reviews": [{"rating": 4.0, "title": "Best Western is your Best Bet!", "text": "We had a great experience at the Best Western hotel in Haverhill, MA earlier this month. I would certainly recommend this hotel to anyone. We stayed there for two nights and only paid around $70.00 a night. I thought this was very reasonable for such a clean, comfortable and quiet room. What really impressed us was the way we were treated at the front desk. Their staff was very friendly, courteous and helpful with any questions we had. They also suggested two nice restaurants for dinner in the area and we had great meals at both of them. The front lobby of the hotel was decorated very nicely and had a fireplace too. The location was perfect, right off Route 495, can't miss it. Plus there is a 24 hour CVS store close to the hotel. We also enjoyed a dip in the pool and used the brand new fitness room too. I'm sure you will like this hotel as well.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "April 30, 2005", "id": 3427483}, {"rating": 4.0, "title": "Comfortable and Convenient", "text": "I stayed at this property on a last minute trip from Florida to take my daughter to see a Doctor in Boston. It was a suggestion from a friend. I found it to be very convenient and close proximity to the highway. It took us only about 45 minutes to get into the city during off peak travel time.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "April 29, 2005", "id": 3424616}, {"rating": 1.0, "title": "Popularity Index #1??? I don't think so.", "text": "The rooms were very clean and spacious. My daughter at 8 years old really enjoyed the warm heated pool the hot waffles at breakfast and the cookies at the front desk. The staff was very helpful with restaurant suggestions and with travel directions.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "April 10, 2005", "id": 3349044}, {"rating": 4.0, "stay_parameters": "Stayed January 2005", "text": "The only drawback I can see is that I forgot my hair conditioner at home and would like to have had that in my morning shower. We do need to make some return visits and will make this our place to stay in the future.", "title": "Free wi-fi in King Size rooms", "helpfulness": 1, "user": "neilyork", "date": "January 16, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 3011128}, {"rating": 4.0, "title": "Good Value north of Boston", "text": "My colleague and I stayed here on business for a week in March, 2005. The hotel was the only hotel in close proximity to our client that offered \"high-speed\" internet. That was our first mistake - only going for internet access. First of all, the \"high-speed\" access was wireless, which we didn't bring our wireless card and had to go buy one. The wireless connection was much slower than a dialup connection when you got a connection. Most of the time the connection kept getting dropped. Beyond internet access, the hotel was rank. The hallway carpet was severely stained and smelled horrible. The carpet in the room was a little better and the smell was bearable but I spent all week with the bathroom light on just waiting for the bugs to come out. Thankfully I never saw one but suffice it to say that I wasn't the most rested human being after a week's worth of sleepless nights. The best thing I can say about this hotel is that it's cheap. So if you could care less where you sleep, pick this one. Otherwise try the Comfort Suites across the street (new hotel, new high-speed internet coming sometime in April) or drive a little further to get a much nicer hotel. One other thing - the lobby displayed a plaque showing that the hotel was named Best Western's \"Best of the Best\". I would seriously hate to see the worst of the worst. Bottom line: go somewhere else.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "October 21, 2004", "id": 2771570}, {"rating": 3.0, "stay_parameters": "Stayed September 2007", "text": "I stayed in Haverhill 2 consecutive nights and spent one night at the Best Western and the other at the Comfort Suites. Between the two, I'd definitely choose the Best Western, which was actually $10 cheaper.", "title": "Decent place to sleep", "helpfulness": 1, "user": "soljc", "date": "October 1, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 3.0}, "id": 10027711}, {"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled on business", "text": "I did not use the pool or take advantage of the free breakfast, so can only comment on the check in/out process and the room, both of which were fine, but nothing more. Room was large and clean, but certainly equipped with some rather cheap fixtures, including the bathroom.", "title": "A Good Hotel", "helpfulness": 1, "user": "jt57", "date": "June 5, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 7780947, "likes": {"liked": "— Location"}}, {"rating": 1.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "Overall, not a bad choice, but not a room I'd want to spend any considerable time in.", "title": "Keep Driving!", "user": "V&Steve", "date": "August 28, 2006", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 3.0, "cleanliness": 2.0, "value": 1.0, "location": 1.0, "rooms": 1.0}, "id": 5716928, "likes": {"liked": "— Leaving", "disliked": "— Staying there"}}, {"rating": 2.0, "stay_parameters": "Stayed August 2006, traveled with friends", "text": "Stayed here one night in May 2007 while driving across the country. I was originally looking for the Comfort Inn but could not find the entrance to it so I stopped here. The hotel was above average and reasonable. It is located right off the interstate next to a CVS Pharmacy, easy to get to. The room was large, clean and quiet. The bathroom counter space was a bit small. Buffet breakfast Ok but is located on one end of the building, not in the central lobby area. I was very happy with my stay.", "title": "Just okay won't stay here again", "helpfulness": 2, "user": "xaby", "date": "August 15, 2006", "detail_rating": {"front_desk": 2.0, "business": 2.0, "service": 1.0, "cleanliness": 4.0, "value": 2.0, "location": 3.0, "rooms": 4.0}, "id": 5613393, "likes": {"liked": "— Waffle breakfast", "disliked": "— Staff"}}, {"rating": 2.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "Do not stay here unless you absolutely can not drive anymore! My husband and I stayed here for one night. We had originally booked for 2 nights but one was more than enough. We were put in a dingy, dark basement room. Basically we walked in and walked back out to the front deask to ask for a different room. Very noisy from people overhead and extremely dreary.Were given a room on the second floor, a bit brighter and definitely quieter.", "title": "Get what you pay for...", "user": "ssmith071273", "date": "August 3, 2006", "detail_rating": {"front_desk": 2.0, "business": 1.0, "service": 2.0, "cleanliness": 2.0, "value": 2.0, "location": 4.0, "rooms": 2.0}, "id": 5543055, "likes": {"liked": "— Breakfast", "disliked": "— Internet access"}}, {"rating": 3.0, "stay_parameters": "Stayed July 2004", "text": "The hotel is exactly what it appears from the outside, plain and boring. Rooms were dark and soleless, corridors were long and airless. Breakfasts were adeqate although very busy with little room to eat. Avoid the Chinese restaurant over the road - it too was bland and uninspiring!", "title": "Plain but adequate", "user": "gingerwanderer", "date": "August 26, 2004", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "service": 3.0}, "id": 2496167}, {"rating": 4.0, "title": "What we expected", "text": "My wife, teenage son & I stayed for 1 night & found this hotel to be above average. The rooms do need to be updated but were clean. The staff was helpful. The location isn't bad. There's a CVS Pharmacy next door that could be helpful. The breakfast is one of the better ones with many choices (including a waffle maker). I would stay here again.", "helpfulness": 1, "user": "Art_Vandeleigh", "date": "July 4, 2006", "id": 5425609}, {"rating": 4.0, "stay_parameters": "Stayed June 2006", "text": "We stayed here for five nights in late June and early July of 2006. The hotel is very conveniently located just off I-495. Checking in was quick and easy, and our room was large, clean, and well kept. It is a plus to have a refrigerator and microwave in the room. The continental breakfast provided an adequate selection, although the breakfast room was a bit crowded on a few mornings. I was nice that it stayed open until 10:30 on weekends. When we had a minor problem with the toilet, the staff reponded very rapidly.", "title": "Nice hotel with one exception ...", "helpfulness": 1, "user": "Western55", "date": "July 4, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 5424230}, {"rating": 4.0, "title": "no surprizes", "text": "The only quibble I had was the timing of housekeeping. The housekeeping staff routinely knocked on the door and attempted to clean the room between 9 AM and 10 AM. This is unconventional and just too early (even before breakfast is closed)! I had to tell them on three occasions to come back in an hour or two. On one day, this meant that we were skipped entirely. Happily, the remaining staff responded with new towels, etc., when we notified them in the late afternoon that we were skipped that day. The housekeeping staff even tried to clean the room around 9:15 AM on the day we were checking out! This makes no sense, even from their perspective. Housekeeping needs to start later in the day and stay later; there seems to be a lack of common sense in their supervision.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "January 30, 2006", "id": 4397685}, {"rating": 5.0, "title": "a little gem in haverhill", "text": "Just got back from a 2 night stay at this hotel. No problems, room was good size, free continental breakfast was good, hours are 7 - 10:30 am which is nice, beds quite comfortable. Good location, decent pool, downside - no bar, no sauna, no suites. Would stay again as I don't think the comfort suites hotel has a pool for the kids.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "October 14, 2005", "id": 4021733}, {"rating": 4.0, "title": "great value", "text": "Very very friendly staff. Nice indoor pool and hot tub that was kept very hot. Too hot actually for my taste. Great breakfast but get there early as they close promptly at 9 30 which is not good for a late sleeper. Wireless internet worked well.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "April 30, 2005", "id": 3427934}], "location": {"country": "United States", "city": "Haverhill"}, "stars": 2.5, "variance": {"poor": 15, "average": 22, "very good": 51, "terrible": 17, "excellent": 43}, "aka": "Best Western Plus Merrimack Valley Hotel", "slim_ranking": 1.0, "description": "The Best Western Plus Haverhill, MA has recently been awarded the Best Western Worldwide Chairman's Award in November 2012 for its outstanding achievements in customer satisfaction and quality assurance. We offer a full hot complimentary breakfast, wireless internet throughout the building, as well as ample parking. We are situated right off of Interstate 495 Exit 49 which is very convenient for traveling throughout New England. We love having you stay with us!"}