{"user_rating": 4.5, "review_count": 594, "name": "BEST WESTERN PLUS Abbey Inn", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "The quality was outstanding, as was the price. Great location, excellent staff (Abby was superb at the front desk), and wonderful breakfast included. Loved the spacious rooms, which included microwave and fridge. Outstanding beds!!! We will definitely stay here again when in the St. George area. Loved everything about it! Also good location to many restaurants nearby. Expecially loved the Black Bear Diner. Way to go Best Western Plus!", "title": "Comfortable, perfect stay!", "user": "bessiedear", "date": "January 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 150437147}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "We stayed here for two nights in the middle of January and it was excellent. The staff were all very friendly and above all very helpful. The rooms are quaility and the beds very comfortable. We started a circular road trip from here that took us to Zion, Bryce Canyon and Arches National Parks and then back to Zion and it was great knowing that we were heading back to the Abbey Inn to end our trip. We made our bookings with the hotel whilst we were travelling and the staff were very helpful with our accomodation needs. Breakfast was also very good. The staff also helped with a great recommendation for where we could eat dinner, the Black Bear Diner that is only 100 metres down the road from the Hotel. What a combination! Definitely one of the best hotels that I have stayed in and to top it off it is a very reasonable cost for the accomodation. We would stay there again without hesitation.", "title": "Great Hotel to explore Zion from", "user": "Brian P", "date": "January 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 150423650}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "This is a sister to the Abbey Inn in Cedar City and both are the best places to stay. Close to shopping, several good restaurants - if your into Chinese Buffets there's a very good one next door - and fairly near to Bryce, Zion and Cedar Breaks, a bit of a drive down to Grand Canyon and Vermillion cliffs, but not terribly far. Very good breakfast lay out.", "title": "Always the place to stay.", "user": "Heychief", "date": "January 23, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 150381280}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled solo", "text": "Having stayed here numerous times over the years, I am still impressed with the quality of this hotel. The price is right for what you receive in return. The location is great, the building and accommodations are great, the free breakfast is great, and all the staff I met are great. I always enjoy using the 24-hour fitness center located near the lobby. And I have always been upgraded (if available) after asking the clerk at check in. I still think it is great to be able to read the complimentary USA Today newspaper available in the morning on weekdays. Okay, so hopefully by now you have figured out that this is a great place to stay! Having lodged at hundreds of Best Westerns across the United States, the Abbey Inn in St. George is the standard I use to compare all others. As I checked out, I wanted to commend upper management of the superior job that they were doing. I spoke with Jordan, who is the assistant general manager. I let him know that this Best Western Plus is just as good as the two Best Western Premier hotels that I have stayed at in the past. I was informed that the Best Western Plus Abbey Inn is run by a family (compared to a corporate entity), and they have made the choice not to serve alcohol at this location, which is one criterion for obtaining the \"Premier\" rating from Best Western International. You cannot fault anyone for standing by their values. For all the reasons stated above, I will be looking forward to residing here once again when in the St. George area.", "title": "The best Best Western!", "user": "MrLorin", "date": "January 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 150317515}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled on business", "text": "The hotel has great staff with a well kept pool and hot tub open all year round .The location is very easy to get in and out of very close to everything you may need !! I always love the clean room that has a great TV be sure to order a movie in your room and relax.", "title": "Work and Pleasure pool and hot tub are open all year round and is maintained very well.", "helpfulness": 1, "user": "Craig B", "date": "January 22, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 150298256}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "This was a very good choice, as we traveled thru the area, for a one nite stop. Very clean; new accomodations, friendly & helpful staff. Great breakfast. Very good value for our dollars. We will definitely stop here again.", "title": "Friendly and very clean", "user": "Sandy M", "date": "January 10, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 149355205}, {"rating": 5.0, "stay_parameters": "Stayed December 2012", "text": "We will definitely stay here again!! Staff was friendly and helpful, the beds were very comfortable, and breakfast was full with both hot and cold breakfast foods. They steered us to a wonderful cafe for lunch that is homegrown. I think it was called Sixth and Main Street Cafe. (The address is its name) They serve great sandwiches, salads and have a specialty cupcake shop!", "title": "Comfy beds, full breakfast, clean, and easy access to freeway or downtown.", "user": "ErickNVickie", "date": "January 10, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 149346862}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "Nothing but the best here from the staff to the rooms to everything! AMAZING! Thanks so much for making our Christmas trip the best ever! I can't wait to stay here again! Even the maids stopped to greet us as we walked down the hall and the hotel is beautiful and everyone is so friendly", "title": "Best Hotel EVER", "user": "Darcey M", "date": "January 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 149146064}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "Passed through St. Geoge on our way to Jackson Hole for a couple days of skiing. Party of 6 got a fireplace, two room, 2 queen + sofabed suite for 120 AAA rate. Definitely much higher priced than similar rooms in this area. Fireplace heated the room very well, beds were clean and comfortable. both rooms were a very good size, sofa room had a seperate desk and chair area with lots of empty space around it. Bathroom was exactly like a master bath, huge tube, separate shower stall, toilet, granite and tile. Sink area was outside. Bathroom has two doors, one from sofabed fireplace area and another door by sink area, brilliant. Breakfast was exceptional, hot buffet style. Scrambled eggs, eggs with bacon, biscuits, gravy, hash browns, many juices, delicious jasmine green tea and many other teas, coffee, milk, fruits, waffles, cereals, oatmeal, yoghurt, breads, cottage cheese, and still more. Staff cleared tables and picked up finished plates promptly. Hotel was close to freeway but not noisy at all. Negatives: Extremely dim lighting in rooms, no to go cups for coffee and tea, no covered walkway from second builiding to the main building where breakfast is which is kind of a deal when the weather is 2 degrees outside, price to value ratio on the high side....4 stars.", "title": "All the positive reviews are accurate", "user": "Marzia620", "date": "January 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 148945465}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "Spacy Rooms, Clean hotel, Best Breakfast that a hotel has to offer. Rooms beautifully decorated.", "title": "Customer Friendly Great Place to Stay", "user": "Janet B", "date": "December 31, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 148405937}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "Free breakfast, Heated pool, Clean, Safe, Friendly", "title": "Families, Veterans and Visitors-stay here", "helpfulness": 2, "user": "Gist W", "date": "January 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 150153178}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled on business", "text": "BREAKFAST: I can’t please everyone at home when I cook and I didn’t expect a hotel to do the same, but there was something for everyone; bacon, sausage, hashbrowns, scrambled eggs, waffles, fresh fruit, yogart, 4 different kinds of cold cereal, oatmeal or grits, OJ, apple juice, hot chocolate, coffee. Did I mention-Free…AND their breakfast goes from 6am to 10am. Yes, I said 10am. We got to sleep in. The only problem is, everyone else did the same thing, so expect a rush from 9-10am. I could tell the staff took a lot of pride in their work.", "title": "The Abby is the place to stay in St. George", "user": "Jeff W", "date": "January 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 149770709}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "CLEAN: The property, building, and room were clean. Large pillows,, large TV, great décor. The cleaning crew did a great job.", "title": "Best Western Abbey Inn", "user": "Patti B", "date": "January 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 149739715}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "SAFE: The parking lot was well lit and the hallways and stairs felt safe.", "title": "Best Western is usually always dependable.", "user": "gerronimo", "date": "January 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 149617784}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "My husband and I recently spent three nights in this hotel in late November 2012 as a home base for visiting Zion park. This town is about 45-60 minutes away from the park, but it was nice staying in a larger size town since this was our first visit. We both feel that our stay was an overall pleasant one. The front desk staff was pleasant and generally helpful, our room was clean upon check-in and the maid service was great. The quality and cleanliness of the room far exceeds what you would expect for the price paid. One big advantage of this hotel is the free breakfast each morning. The quality was very good and the selection was more than you could ask for. The coffee was great too! We would certainly stay again.", "title": "Great Option in St. George, UT", "user": "stevenssn", "date": "December 30, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 148365005}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "Recently stayed at the Best Western Abbey Inn as an overnight stop on a roadtrip from California to Colorado. Certainly not a posh resort property, but definitely 5-star based on high quality and excellent service delivered for the money. Friendly staff, nicely appointed rooms with fridge, microwave, flat screen and super comfortable beds, plus wifi, full breakfast and newspaper included in rate. Property also has heated outdoor pool, spa, exercise room and laundry if you wish to use those. Would not hesitate to recommend or stay here again the next time we are on the St George area.", "title": "Best value for the money anywhere", "user": "dspicher", "date": "December 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 148308377}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled on business", "text": "The Best Western Abbey Inn is our go to hotel in St. George, Utah. It's always, clean, comfortable and nice to stay out. Each room has a small fridge and microwave. Hot breakfast is included. Very friendly staff if you need anything. Rooms are quiet making it good for business but it's also family friendly.", "title": "Always clean, comfortable, nice", "user": "DreadPirateMo", "date": "December 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 147681854}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "Stopped into St George on our way to Yellowstone,it was a Saturday and didn't know the World Seniors Games was in town and since we lost 1 hour due to time zone change it was getting late in the day didn't want to drive on to next town.", "title": "Perfect stay", "user": "aussiebill42", "date": "December 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 147537031}], "location": {"country": "United States", "city": "St. George"}, "stars": 3, "variance": {"poor": 11, "average": 32, "very good": 135, "terrible": 1, "excellent": 415}, "aka": "Best Western Plus Abbey Hotel St. George", "slim_ranking": 0.047619047619, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}}