{"user_rating": 4.0, "review_count": 228, "name": "BEST WESTERN PLUS Suites Downtown", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed July 2005", "text": "This hotel is worth the price. We stayed in a 2 bedroom suite that was very spacious. The kitchen is small. It is a bit run down but the price is very reasonable. It is about a 5 block walk to 17th street which has restaurants and shops. In the other direction, it is about an 8 block walk to downtown and the C-Train which will take you to the Stampede. THere is a grocery store, liquor store, and Starbucks within 2 blocks which makes it very convenient. Parking is free and the front desk is helpful. The breakfast was continental but very adequate; sweet rolls, toast, cereal, oatmeal, etc.", "title": "Well worth the price", "helpfulness": 2, "user": "April102", "date": "August 9, 2005", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "rooms": 3.0, "service": 3.0}, "id": 3748968}, {"rating": 3.0, "stay_parameters": "Stayed July 2005", "text": "A little deceiving as this hotel isnt actually Downtown, it is about 8 blocks or so away (20 mins walking) from the main shops etc and it is a good 30 mins walk to the Stampede Grounds.", "title": "A little deceiving", "helpfulness": 3, "user": "Emma1110", "date": "July 18, 2005", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 4.0, "service": 3.0}, "id": 3679246}, {"rating": 4.0, "stay_parameters": "Stayed June 2005", "text": "The room was nice and on the 15th floor it had a big bed, desk, kitchen & sofa but it was a little noisey eg we could hear people in the corridor and doors opening & closing - other than that it was an ok hotel.", "title": "What a surprise!", "helpfulness": 1, "user": "Quaris", "date": "June 21, 2005", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 4.0, "service": 3.0}, "id": 3599148}, {"rating": 3.0, "title": "Adequate at best", "text": "The promo photo for this hotel had us thinking it would be a tacky place to stay. We ended up in a HUGE room, on the corner with windows on two walls. Nicely decorated & soundproof.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "January 7, 2004", "id": 1541136}, {"rating": 4.0, "title": "Good Place to Stay", "text": "The \"expanded\" continental breakfast was pretty basic, and we thought it might be more than just muffins, apples & dry cereal - but it wasn't.", "helpfulness": 2, "user": "mitchmurr", "date": "October 12, 2003", "id": 1385390}, {"rating": 4.0, "title": "Quite Nice", "text": "We stayed at the Best Western Downtown Suites in Calgary for 2 nights in mid October 2005. As some other reviewers said it is not right in the middle of downtown but we had no trouble walking there and back. We got some exercise and enjoyed looking at the architecture of the houses and buildings on the way. Parking at the hotel was free and was either underground or right outside the hotel. There were plenty of restaurants within 1-2 blocks and a supermarket. The room was clean and quite nice. The breakfast was quite sufficient, mostly cereal and bagels and muffins and fruit. Some at the front desk were friendlier than others. The room was fairly quiet. We would stay here again.", "helpfulness": 4, "user": "Sky22", "date": "October 30, 2005", "id": 4071702}, {"rating": 3.0, "stay_parameters": "Stayed October 2005, traveled on business", "text": "Stayed for five days for a conference. Paid C$92 on the weekend and C$135 during the week. The elevators are terribly slow at busy times of day. Breakfast is fine and free, as is parking and high speed internet. I don't know why cheap hotels offer internet for free and expensive hotels need to charge. Location is decent with great restaurants on 17 Ave. Hotel is reasonably clean but it is a little noisy both from the hallways and the street.", "title": "Adequate", "helpfulness": 5, "user": "bjstirling", "date": "October 28, 2005", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 4.0, "service": 3.0}, "id": 4069546}, {"rating": 4.0, "title": "Best Western Suites Downtown", "text": "Not a great place to stay, but not terrible either.", "helpfulness": 3, "user": "Amdamguy", "date": "October 25, 2005", "id": 4050565}, {"rating": 2.0, "stay_parameters": "Stayed September 2005", "text": "We had a five day visit in Calgary for this past Thanksgiving. We paid about $100 for a 1 bedroom suite at this hotel. It was not in perfect shape, but it was good enough for our needs. It was clean, had a seperate bedroom, 2 tvs, a kitchen a storage area and a living room. Plus it was close to a wide variety of bars and restaurants. Although not right in the centre of Calgary, it was close enough to walk if you are able (15 mins).", "title": "Very disappointing", "user": "Kyle_Mac625", "date": "September 5, 2005", "detail_rating": {"cleanliness": 1.0, "value": 2.0, "rooms": 2.0, "service": 2.0}, "id": 3844937}, {"rating": 2.0, "stay_parameters": "Stayed July 2005", "text": "The hotel at time of this writing offered free parking, and free high speed internet access which was great...other hotels were charging up to $14 for the internet access and up to $15 for parking.", "title": "A little disappointed...", "helpfulness": 2, "user": "fc", "date": "August 25, 2005", "detail_rating": {"cleanliness": 2.0, "value": 3.0, "rooms": 2.0, "service": 3.0}, "id": 3806078}], "location": {"country": "Canada", "city": "Calgary"}, "stars": 2.5, "variance": {"poor": 11, "average": 35, "very good": 80, "terrible": 10, "excellent": 92}, "aka": "Best Western Plus Suites Downtown Hotel Calgary", "slim_ranking": 0.268041237113, "description": "Welcome to the BEST WESTERN PLUS Suites Downtown, located between Stephen Avenue and 17th Avenue, steps away from the business core, shopping, a wide variety of restaurants and Calgary attractions! In addition to our comfortable beds, excellent customer service and fantastic location we also offer: complimentary wired or wireless high speed internet access, complimentary underground or above ground parking, a full hot breakfast and access to the fitness centre, sauna and the business centre! We also have meeting rooms that can hold anywhere from 3 to 30 people. Please contact us for group rates, meeting rooms and to reserve your room today!"}