{"user_rating": 4.0, "review_count": 163, "name": "BEST WESTERN PLUS Lincoln Inn", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "I usually choose to stay at Best Westerns because they are pet-friendly, and I often travel with my dog. This hotel was pet-friendly, but do be aware that it is a hotel (not a", "title": "Clean, safe location - off the highway a ways in nowheresville", "helpfulness": 1, "user": "Gemutlichkeit", "date": "November 30, 2009", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 2.0, "service": 4.0, "rooms": 4.0}, "id": 50337117}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled on business", "text": "motel), so you will need to bring your pet down a hallway to get to your room.", "title": "Beautiful!", "helpfulness": 1, "user": "Durmis", "date": "August 11, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 37415589}, {"rating": 5.0, "title": "EVERYTHING IS BRAND NEW", "text": "We always take a trip to all the wineries in Yakima. This is by far the best hotel in Yakima. To our amazement everything was recently remodeled. The lobby, tile, beds, carpet, furniture...ect. The breakfast room has an amazing flat screen t.v.,makes staying in a hotel feel at home.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "March 20, 2006", "id": 4718496}, {"rating": 4.0, "stay_parameters": "Stayed July 2005", "text": "The Peppertree was a welcome oasis after a long drive. Rooms are spacious and clean. Especially enjoyed the breakfast buffet which graciously provided two waffle makers and two microwaves for making souffles. Would definitely stay here again.", "title": "Loved the Peppertree", "helpfulness": 3, "user": "Elphaba", "date": "December 29, 2005", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "service": 4.0}, "id": 4311053}, {"rating": 5.0, "title": "Loved the service!", "text": "I just returned from a weekend trip to Yakima and stayed at the Best Western Peppertree Inn. While I was there, the staff helped me a number of times with directions and suggestions on what to do in Yakima. Their indoor pool and hottub were excellent after a long day and their breakfasts in the morning were delicious! I loved the make-your-own waffles and highly recommend staying at the Peppertree Inn. They were also reasonably priced and offered a lot of amenities for the money. I will definitly be back to stay there again!", "helpfulness": 3, "user": "A TripAdvisor user", "date": "November 5, 2005", "id": 4088632}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "We were suprised about how much we liked this hotel. The lobby and pool area are really decorated nicely; it looks much nicer than the photos on their website. The room was also nice with a separate seating area and mini-fridge. We swam in the pool but it was really warm (the temperature of most hotel's hot tubs), which was unfortunate because it was really clean and new looking. The continental breakfast was decent, with Seattle's Best coffee (much appreciated early in the morning), waffles and all the regular continental breakfast fare. We found Yakima a little rough looking (we were concerned to leave our car when we went shopping), but the hotel is out of the city enough to provide a safer environment to leave your belongings. Basically, it was a great hotel for the price, and we would stay here again if we were passing through Yakima.", "title": "Great Hotel", "user": "dogbone1002000", "date": "August 26, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 8510934, "likes": {"liked": "— Pretty lobby/pool/continental breakfast area, clean rooms", "disliked": "— temperature of the pool"}}, {"rating": 3.0, "stay_parameters": "Stayed April 2007, traveled with family", "text": "Our family stayed briefly at the Lincoln Inn in late April for a quick in-out overnight stay. We stayed in a larger two queen room. I asked the clerk for a quieter room, and was assigned something on the street side. But there was little noise, and we slept fine.", "title": "Decent stay at Lincoln Inn", "user": "scooterwa2", "date": "April 28, 2007", "detail_rating": {"cleanliness": 4.0, "front_desk": 3.0, "location": 4.0, "value": 3.0, "rooms": 3.0}, "id": 7478487, "likes": {"liked": "— Accessability, breakfast, cleanliness, room size", "disliked": "— Loud refrigerator, broken sink light"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2007", "text": "Negatives? The refrigerator ran every 15 minutes (I would unplug it next time), and the overhead light at the sink was out in the morning (I opened the unit and fiddled with the florescent fixture to make it work), and the overall price ($126) seemed a little high, but mostly competitve for that area. Positives: it was quiet, the property seemed to be updated (and more work appeared to be planned at the front entrance), and the morning breakfast was just fine. We didn't use any of the other facilities (exercise room, pool, Internet). I am not jumping up and down over our stay there; it was okay and I would stay there again.", "title": "Good hotel for business trip", "user": "wikiSeattle", "date": "January 18, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 3.0, "rooms": 4.0}, "id": 6615999}, {"rating": 4.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "I stayed here 4 weeks ago, and this hotel is now under new Management. Biggest change I've noticed? They now have Seattle's Best Coffee in the breakfast room, (finally, good coffee)! Too bad they haven't switched the coffee in the actual rooms yet. Carpets are new, rooms are a good size, rooms are well-kept and clean, free wireless internet. I'd love to see them replace some of the mattresses--I've stayed here twice now, and I can tell that the beds are old--because there's a dip in the bed where people typically sleep (at least in the 2 rooms I slept in)--not so good for my back. But overall, I love being so close to the highway, can't hear the noise from it, but it's easy to get to where I need to go for my business trips. Yes, views aren't the greatest, but there aren't a lot of hotels in Yakima with views. There's also a microwave & refrig in each room, and an abundant number of cable channels. I recommend it.", "title": "Clean, inexpensive", "helpfulness": 1, "user": "GD2004", "date": "September 28, 2006", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 5.0, "value": 3.0, "location": 2.0, "rooms": 4.0}, "id": 5889132, "likes": {"liked": "— Inexpensive, clean", "disliked": "— Location - boring to run down"}}, {"rating": 2.0, "title": "Not the best place in yakima", "text": "The room is clean, large, inexpensive. The breakfast standard motel fare but generous. The laundry room is clean. Room view was of RV park, the area is fast food/freeway. Would have liked to be more \"in town\" - assuming there is an in town, we got in at 7 pm and left at 7 am, more or less a pitstop between Columbia River Gorge and Mt. Ranier/Seattle. So I can't say if there are better locations.", "helpfulness": 2, "user": "canamara", "date": "July 26, 2006", "id": 5514218}], "location": {"country": "United States", "city": "Yakima"}, "variance": {"poor": 9, "average": 18, "very good": 56, "terrible": 4, "excellent": 76}, "aka": "Best Western Yakima", "slim_ranking": 0.2, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.0, "location": 4.0}, "description": "Stay at this 100% Non-Smoking Yakima hotel in Washington. The Best Western Lincoln Inn offers a business center complete with fax and photocopy services. Each mini-suite guest room has a separate sitting and work area complete with two telephones, a microwave, a refrigerator, cable television with HBO and free high-speed Internet. Hotel guests start the day off right with a complimentary full hot breakfast. The hotel offers 24-hour fitness center and an indoor pool."}