{"user_rating": 4.0, "review_count": 1541, "name": "BEST WESTERN PLUS Carolinian Oceanfront Inn & Suites", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "Stayed for four nights. Had a king room. The room was clean. Loved the balcony overlooking the beach. We like to walk, so it was easy to get to Starbucks, Sea Captain's House, and Harry's Pancakes. The pools were a little cool, but the hot tub was nice, although the jets splashed very high. Bathrooms on the first level if you needed to come in from the beach. Parking was nearby in a garage. Easy to get in and out.", "title": "Good location, nice rooms.", "user": "Leeamoore", "date": "September 24, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 118546416}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "We've stayed at the BW Carolinian for a few years, and I have to say it is still a very nice place to stay. We love the view of the ocean, and the room service was terrific. Everyone at the desk was very friendly and helpful. We were disappointed, however, in a few things. First, they did not put our two rooms together on the same floor as we requested when we made the reservations. But they did what they could to get us within one floor of each other so there wasn't much of a hike between rooms. The other problem we had was that they don't let you take a luggage rack up to your room yourself. You have to pay a bus boy $8 to do that. It didn't used to be this way. I think that should be a choice, and the folks who want to do it themselves should be allowed to use a cart! The safe in the room did not work, and was never fixed the entire time we were there. The blow-dryer did not work, but was fixed. Other than those things, the rooms were clean and comfortable. The pillows were fantastic! We did not see any bugs. We did not hear any neighbors. It was a very nice place to stay.", "title": "Very nice.", "user": "redsox r", "date": "September 24, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 118526665}, {"rating": 3.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "Recently spent 3 nights here and it wasn't the worst, but II was disappointed. I will say I took advantage of the BTS special they had going on so maybe you get the crappy rooms at that rate? Pros: Staff nice, quick check in, check out, good oceanfront view, beds really comfortable and HK cleaned well. Cons--one of the elevators in lobby scared me to death (very squeaky--we resorted to using the stairs most of the time and we were on the 10th floor!!), not able to adjust air in room-I couldn't even turn it off (I was freezing!), Kleenex dispenser in bathroom kept falling off every time I used a Kleenex, closet door was broken and room just seemed kinda old--maybe the carpe?. Last year when I stayed in Myrtle I stayed at the Anderson next door and LOVED it..I might give BW Plus one more try during a non-promo stay and see if I get better results. But will probably go with what I know and go with Anderson from now on...", "title": "Not that great...", "helpfulness": 1, "user": "SherriNC", "date": "September 22, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 2.0, "location": 4.0}, "id": 118465832}, {"rating": 5.0, "stay_parameters": "Stayed September 2011", "text": "Staff was very friendly. The guest services rep was very helpful and very nice. The suite we stayed in was great. It had a great view of the ocean, was very clean, much more than what my wife and I were expecting. Great place to stay in while at Myrtle Beach.", "title": "Perhaps one of the best resorts I've stayed in.", "user": "gmichaels1184", "date": "September 22, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 118455719}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "The only problem we had was room 603 had air conditioning issues.But we changed rooms the next day and everything was fine.", "title": "Pleasant stay", "user": "Linda R", "date": "September 22, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 118445864}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "The room we had was excellently appointed, and very clean, and the view was everything promised. Convenient parking, and within walking distance of the boardwalk downtown, great central location to surrounding entertainment. Staff was friendly and helpful, the only downside was that we accidentally left our camera battery charger in the room, and left messages at the front desk and with housekeeping asking if it could be mailed to us, and haven't heard anything back. Other than that, everything was wonderful!", "title": "Great place for great value", "user": "Frescolns", "date": "September 18, 2011", "detail_rating": {"value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 118287920}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "Nice place to stay, we were there in the off season so the room was affordable. The staff was very friendly. The only downside was the check in -- we stood in line about 30 min to check in. Good location, easy walking distance to food and it's right on the beach. The room was clean and comfortable, our friends who had a different style room on another floor also were happy with their room. The bathroom was a little small, but the efficiency kitchen was very nice - just what we needed for a few days. Would recommend the ocean front rooms, from the 6th-10th floors -- this way you get the ocean sounds and not the pool-side conversations :) We were on the 6th floor and it was very nice.", "title": "great view from room", "user": "emsgrl1", "date": "September 18, 2011", "detail_rating": {"value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 118267169}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled solo", "text": "I love going to Myrtle Beach and everytime I go I stay here or one of there sister properties. The rooms are nice and modern, not like allot of the beach hotels. The service there is wonderful, staff is very friendly. The location is also a plus its very close to everthing and with the special offers that you receive youll always have something fun to do.", "title": "I always stay here.", "user": "itsCrystal", "date": "September 15, 2011", "detail_rating": {"value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 118163565}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "Front desk staff was extremely friendly, pleasant and helpful. We had a 2 bedroom suite and brought friends with us that have never been to MB --they loved it and they plan on coming back for a week next year! The room was very clean and had everything we needed in the kitchen to cook meals with - with the 2 BR suite and 2 bathrooms made this place awesome -the pool and hot tub areas were clean/ we were all very impressed!! We are already booking for next year!", "title": "GREAT STAY!", "user": "RockinRobin17", "date": "September 15, 2011", "detail_rating": {"value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 118156039}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled with friends", "text": "I loved that the Hotel was very closed to all the fun. No need to ever drive a vehicle! No reason to stay elsewhere. Friendly professional staff. Caught up with lots of sleep for sure! Extremely peaceful. Nothing like having an Ocean Front - Lovely at all times. What an amazing experience. Thank you again! I will see you in the future.", "title": "Marine get away time", "user": "Albert P", "date": "September 14, 2011", "detail_rating": {"value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 118122037}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled with friends", "text": "This was a great experience. The accommodations were above and beyond what we expected. The unit was well maintained and the furniture was comfortable. We had to call maintenance because we could not open the safe. He couldn't either, it was locked by previous occupants. Not a big deal just an inconvenience. The staff was friendly and very helpful. Pool and hot tub were great. Having a room on the 21st floor was amazing. The view was spectacular. Would love to return for a future stay.", "title": "Great location, very nice experience", "user": "boston530", "date": "September 25, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 118586921}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "Stayed one week at this resort in September. Check in was a breeze and we were upgraded to a suite. The room was tactfully decorated and clean. The kitchen was stocked with what we needed and the unit included a washer and dryer(didn't use them but assumed they worked). Only used maid service a few times but each time our room was well cleaned. The unit contained a big screen tv in both the bedroom and living area and the deck provided a great view of the ocean. The AC unit worked well but unfortunately blew into the bedroom so could not be left on all night. There are two pool areas; one covered and one open air. The covered area contains the lazy river, which is very small and does not have a current so you have to push yourself around and a small hot tub. The open air pool was clean, although small and the area had lots of lounge chairs. There was easy and quick access to the beach which is very clean and miles long.", "title": "Relax, You're on Vacation", "user": "KJS74", "date": "September 25, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 118586572}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "The only complaint for the whole week was the elevators. There are 3 but on numerous occasions one or two were not working and at times the wait was long. The noises coming from the elevators were very disconcerting and when we informed front desk staff about the elevators not working (stalled at a floor) they dismissed it and said they were working.", "title": "absolutely lovely", "user": "carla j", "date": "September 25, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 118584348}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled with friends", "text": "Overall, I would recommend this resort.", "title": "I LOVE this place!", "user": "Sybil L", "date": "September 25, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 118573725}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "This was one of the lovely rooms I ever had at the beach it was a two bedroom, two bath unit ,it had a nice kitchen and living room and beautiful views. It was convient to eating places like starbucks and pancake house. The staff were friendly and helpful and I will be going back real soon. I cant say anything bad because It didn't happen. I love the BW Carolinian.", "title": "A great deal!!", "user": "julia d", "date": "September 24, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 118547386}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "Very nice Sept mid week visit. Stayed on the 7th floor (heard upper floors are remodeled). Wonderful view of the ocean. Ocean front King room with microwave and refrig was perfect for us since we didn't need a kitchen, HUGE king bed, clean room. Every employee we saw was pleasant and friendly. My husband was waitng for me by the elevators with our luggage, and 4 different employees asked if they could help.", "title": "Very nice Sept mid week visit", "user": "Mary_and_Jim", "date": "September 21, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 118410984}, {"rating": 5.0, "stay_parameters": "Stayed September 2011", "text": "Would definitely stay here again.", "title": "Great place to stay!!", "user": "hollarjb", "date": "September 20, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 118363926}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "Great experience here. We had a two bedroom oceanfront suite, and we were very happy with it. The only issue was that our light above the tub in the master bath was out and I did call it in. They never did come to replace the bulb, which did make taking showers a bit dark.", "title": "my stay at the Best Western", "user": "cmcneill47", "date": "September 19, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 118329269}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "I enjoyed my stay at this hotel the service was excellant and the hotel was great loved the room we stayed in", "title": "Great views and friendly staff", "user": "Kathy W", "date": "September 19, 2011", "detail_rating": {"value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 118327196}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "We had a great 3 days at this hotel. I get really freaked out by staying hotels, so cleanliness is always huge for me and this hotel did not disappoint. Like most beach places, the carpet was very worn and the place is pretty basic, but overall it was very good. We stayed in a 2 bedroom with a full kitchen and the kitchen seemed very clean. We also enjoyed the free mini golf across the street. Like I said, I am picky, but I would definitely stay here again.", "title": "Great Place!", "helpfulness": 1, "user": "SunnyGirl13", "date": "September 19, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 118324013}], "location": {"country": "United States"}, "stars": 2.5, "variance": {"poor": 66, "average": 121, "very good": 564, "terrible": 49, "excellent": 741}, "aka": "Best Western Plus Carolinian Oceanfront Hotel", "slim_ranking": 0.0900900900901, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "Discover a great location, superb facilities and affordable rates at the Best Western Plus Carolinian Beach Resort, an award-winning hotel where children under 18 stay FREE with parents. Enjoy a Myrtle Beach hotel with a friendly atmosphere and smartly-appointed accommodations for families, couples and group getaways."}