{"user_rating": 4.5, "review_count": 128, "name": "BEST WESTERN Grandma's Feather Bed", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "Like everyone I read the great reviews of this hotel and it was the decisive factor in staying there. We stayed two nights at this hotel and two at the Country Lane. They are litterally a few blocks from the airport and offer shuttle service. The hotel however is about 8 miles from downtown Juneau. The hotel is very attractive and looks more look a bed and breakfast than a hotel. The room we stayed in was average size with a large whirpool bath in the main part of the room. While I liked the whirlpool my wife found it absolutely impossible to use the shower while in the tub. The room is very nice with a fridge and microwave. The bed was exceptionally comfortable and the room at the end of the hall was quiet. The service was generally great but varied tremendously depending on who was there at the front desk. The young woman who is the cook is exceptional! Not only was she a good cook but she went so far as to obtain some deodorant at a store from me when there was none available at either of their hotels. This was in sharp contrast to the other young woman who was serving as the front desk who forgot that we and another couple were sitting for breakfast. They have a shuttle service that runs every two hours to downtown. You are dropped off at and picked up at Centennial Hall which is close to the wharf and cruise terminal. Both of the shuttle drivers were courteous and on-time. Staying here you really feel like you are in a bed and breakfast but at the outskirts of town.", "title": "Attractive Hotel But Far From Downtown", "helpfulness": 1, "user": "DCSacramento", "date": "July 31, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 3.0, "service": 4.0, "rooms": 5.0}, "id": 36350655}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled on business", "text": "I recently stayed at Grandma's for 5 days on a business trip to Juneau. I can't rave about this place enough; from the luxurious rooms, to the super attentive staff, to the great food, to the wonderful location. It reminds me of a Swiss hotel it's that good. When I return to Juneau, I wouldn't dream of staying anywhere else. Thank you.", "title": "Most perfect place I've stayed!", "helpfulness": 2, "user": "snowgirlanchorage", "date": "July 6, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 34088100}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "Grandma's was truly just like home. The entire staff was warm, friendly, and very helpful. We were fortunate to be able to choose our own room which was not an easy task. All of the rooms we were shown had their own distinct country charm with a wonderful whirlpool tub. We made our selection and enjoyed 6 wonderful nights. Our bed was extremely comfortable although it did squeak a little.", "title": "Just like home", "helpfulness": 1, "user": "LadyOLasVegasNV", "date": "July 2, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 33768356}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled solo", "text": "The location and shuttle service made it very easy to get around. The breakfast which was included in the rate was a definite bonus. The food was delicious and the staff felt like family. The restaurant was open for dinner except on Sunday and Monday, and the food was absolutely the best we had in Juneau. Upon returning home, my husband said that he had been spoiled by all of the delicious food and service. I certainly hope to go back to grandma's. It felt just like home.", "title": "They made me feel at home.", "helpfulness": 1, "user": "HelloMartha", "date": "June 6, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 31729565}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled on business", "text": "It was an incredible experience !!.... The rooms are comfortable and cozy.", "title": "Dont look at other hotels in Juneau...this is it!", "user": "ferb55", "date": "May 31, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 31220003}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "Our best of three hotels that we stayed at in Juneau. Comfortable, Clean, Cozy and Country Decor. Beds are like the name implies, featherbeds with decor to match the comfy surroundings. Breakfast and Dinner in the little restaurant were really nice. Not so far from anything if you plan to rent a car. We especially loved the large Jacuzzi in the room.", "title": "Romantic and Special hotel in Juneau Alaska", "helpfulness": 4, "user": "kscAnchorage", "date": "September 4, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 3.0, "rooms": 5.0}, "id": 8616283, "likes": {"liked": "— The room was so nicely decorated!", "disliked": "— Only one tiny outside window"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "The hotel is lovely, rooms were clean and well equipped (jacuzzi, comfortable mattresses, wireless access). Service is friendly and accurate. In addition the hotel offers an excellent restaurant service that in Juneau - a town catering mainly (too much?) to cruise passengers - can be particularly appreciated. A little jewel, good value for money.", "title": "best accomodation in our alaska trip", "helpfulness": 1, "user": "silkroad91", "date": "August 25, 2007", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 3.0, "rooms": 5.0}, "id": 8503478}, {"rating": 4.0, "stay_parameters": "Stayed November 2006, traveled on business", "text": "The beds are amazing, the service is great! The hotel itself could use a little updating but overall I was thrilled with my experience. Breakfast is amazing here, by the way!", "title": "Probably the best in Juneau", "helpfulness": 2, "user": "milljame", "date": "July 18, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 5.0, "rooms": 5.0}, "id": 8181864}, {"rating": 5.0, "title": "Best in Town", "text": "That's what the cab driver said and we agree. The rooms are very nice, quiet and comfortable. The hotel was built to look like an old Victorian home and is pretty successful at pulling it off. The breakfast room and breakfast are first rate. We were there on the weekend so were not able to try the restaurant's evening meals, pity.", "helpfulness": 5, "user": "Call_us_Canucks", "date": "April 8, 2007", "id": 7295342}, {"rating": 2.0, "stay_parameters": "Stayed June 2006, traveled with family", "text": "Make sure you go on a whalewatch with Captain Larry. It was the highlight of our trip. If I could figure out how to post pictures I would but you'll have to take my word for it there were literally tons of whales.", "title": "Small Room, Noise from the other room", "helpfulness": 3, "user": "AMP0907", "date": "January 22, 2007", "detail_rating": {"front_desk": 2.0, "business": 4.0, "service": 3.0, "cleanliness": 3.0, "value": 1.0, "location": 4.0, "rooms": 1.0}, "id": 6640886, "likes": {"liked": "— Tastefully decorated", "disliked": "— Small, noisy rooms"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2008, traveled solo", "text": "Maybe I'm getting grumpy in my old age, but I was disappointed to get an upgrade from the sister hotel just up the road.", "title": "Upgrade from Best Western Country Lane", "user": "2manydogs", "date": "February 16, 2009", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 24646185}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "I usually stay to the Country Lane, which is an easy walk to the airport and has spacious rooms and guest laundry facilities.", "title": "Best", "user": "newestwave", "date": "January 2, 2009", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 23207902, "likes": {"liked": "— The excellent service, the food, the elegant room, and the peaceful home-like atmosphere of the bed and breakfast."}}, {"rating": 5.0, "title": "Great Food and a Charming Place", "text": "Those were the attributes I wanted when I came back from a trip on the ferry and just wanted to wash my clothes, get some sleep, and have a quick breakfast before I left again.", "user": "CoastnCoast", "date": "December 14, 2008", "id": 22719991}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "That said, I have to admit that Grandma's is better outfitted than Country Lane. I certainly didn't spurn the nice bedding, the whirlpool tub, or the cooked breakfast. But my room seemed cramped compared to the larger rooms I've had at Country Lane.", "title": "A pleasant, very friendly hotel", "user": "TTARRY", "date": "October 12, 2008", "detail_rating": {"business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 20825587, "likes": {"liked": "— The friendliness of the staff", "disliked": "— The weather (which is hardly the hotel's fault ;-)"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "For people with more time to spend, you can walk from Grandma's to Country Lane with your laundry or arrange for the shuttle. Or not have to do your own laundry at all. Grandma's also has a well regarded restaurant.", "title": "Charming Bed and Breakfast Style Hotel", "helpfulness": 1, "user": "colt123", "date": "August 6, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 18696162, "likes": {"liked": "— Location, decor, comforatble bed, and hot breakfast", "disliked": "— Tub and Shower right in bedroom so lack of privacy for bathing"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "We stayed at Grandma's for two nights. It was our honeymoon and they were kind enough to put us in the honeymoon suite. The kind bed was extremely comfortable. It had a lovely sitting area and a separate bath area behind two french doors. The bath had a jacuzzi tub in it. This tub doubled as a shower and, as such, would have benefitted from a shower curtain. We had only booked one night here, but loved it so much we booked another!", "title": "Extremely comfy beds and great service", "helpfulness": 4, "user": "hfpsychologist", "date": "September 30, 2006", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 5895097, "likes": {"liked": "— The comfy beds", "disliked": "— Check in desk was at a neighboring hotel"}}, {"rating": 4.0, "title": "Missed Grandma but enjoyed our Stay!", "text": "Great hotel which holds a lot of charm and would highly recommend for a stay in Juneau. The beds were wonderful, jacuzzi was a luxury and breakfast was delicious. We enjoyed it so much we plan to cancel our booking with a hotel in town to go back to Grandma's for our return trip. Make an effort to speak to Percy, the van driver, he is lovely!", "helpfulness": 1, "user": "frankie_frodsham", "date": "September 16, 2006", "id": 5805765}, {"rating": 4.0, "title": "Beds to die for", "text": "Our flight was over an hour late coming into Juneau so we were not able to pick up our rental car as the rental place closed at 10:00. The only number we could find was for the Best Western Country Lane so we called them to get the number for Grandma's feather bed motel. They knew who we were and said they would come pick us up. We were relieved but a little confused about the fact that we had to check in at the Country Lane and that they shuttled to the feather bed. Because we arrived late there was no one there (at the Feather Bed) and we had to use our key to get in the front door then find our way to the room. It was a little eerie, because it felt like we were the only ones there. The room was nice though and the feather mattress was absolutly wonderful and we both slept like a log. The next morning when we stepped out into the hall, we were greeted by the smell of breakfast and coffee. A full breakfast is included in the price of the motel and the restuarent is cute and cheerful. I would definitly recommend it. There are 14 rooms and it is advertised as the smallest Best Western. The motel doesn't really have any views, but it is still very nice because of it's other amenities and they were very good about shuttling us back and forth to the airport.", "helpfulness": 9, "user": "A TripAdvisor user", "date": "March 15, 2006", "id": 4626037}, {"rating": 5.0, "title": "Juneau lodging near airport", "text": "Friendly, comfortable B&B in Douglas, convenient to Juneau airport and nearby nature trail. Only six or eight rooms, if my memory serves me correctly. A short drive to Mendenhall Glacier. Serves dinner most nights (but we didn't try) as well as breakfast. You check in at the nearby Best Western and they will shuttle you over to Grandma's. We have tried other airport-neighborhood hotels and much prefer Gandma's. Real feather comforters in rooms!", "helpfulness": 7, "user": "A TripAdvisor user", "date": "August 26, 2001", "id": 280906}], "location": {"country": "United States"}, "variance": {"poor": 5, "average": 6, "very good": 31, "terrible": 1, "excellent": 85}, "aka": "Best Western Grandma`s Feather Hotel Juneau", "slim_ranking": 0.0625, "description": "Best Western Grandma's Feather Bed, the smallest hotel in the world's largest hotel chain, comes complete with deluxe suites and is the perfect place for a weekend getaway in beautiful Juneau, Alaska. All 14 guest rooms are designed especially to meet your vacationing needs. Each guest room are designated non-smoking with single queen feather beds for the ultimate in comfort. Sink into your in-room Jacuzzi and let the comfort take you away."}