{"user_rating": 4.0, "review_count": 1971, "name": "BEST WESTERN PLUS The Tuscan", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "room was quiet, clean with good beds but very very small", "title": "liked it", "user": "Gerald1961", "date": "November 19, 2008", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 3.0, "rooms": 3.0, "location": 5.0}, "id": 22000223, "likes": {"liked": "— location"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled solo", "text": "not a cheap hotel", "title": "Awesome hotel!!", "user": "JLBMountJoy_PA", "date": "November 19, 2008", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 21999786, "likes": {"liked": "— the quaintness and beauty of the hotel inside", "disliked": "— I thought the front desk staff could have been a bit more cheery!"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled on business", "text": "valit parking was to much expencive but oke its the location", "title": "Liked staying at Tuscon Inn", "user": "Gidoctor", "date": "November 16, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 21902993, "likes": {"liked": "— location", "disliked": "— Nil"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "I stayed at this Tuscan Inn in the Fisherman's Wharf in San Francisco recently. What a lovely place in the midst of a fast-paced environment! The thought that it was a Best Western made me think ahead of my stay that this is an okay place to rest a night but what a surprise when I found the cutest place in the City of San Francisco. The room was adorable and had everything I needed. The concierge, Hugo Vides, is the absolute best. The welcoming wine event between 5 and 6 p.m. was a nice twist to get to know others who were staying there. I only wish I would have had more time there and hope to someday return. I am so glad my travel agent at Liberty Travel suggested this.", "title": "Cozy, friendly place to stay on the wharf", "helpfulness": 1, "user": "PandaExpress", "date": "November 15, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 5.0, "rooms": 4.0}, "id": 21876931, "likes": {"liked": "— location", "disliked": "— The price and the parking are very expensive"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2008, traveled with friends", "text": "I booked this hotel via booking.com at KLM website. I went through a lot of reviews and the one from Frommers Guide was most helpful. I got a good rate and no prepayment from the KLM website( linked to booking.com). Tuscon Inn was near the pier 39, which is a great location, checking in and out was easy. The staff were very helpful. The room was nice, good size and quite clean. The bathroom was big and clean as well. Although I was alone, room was good enough for a couple. The hotel had free coffee and drinks everyday and free access to wireless internet. The adjacent served nice breakfast. Great location and hotel. Try and not book anything from the hotel though, just walk up pier 39 and you will have more choice. The hotel does arrange a shuttle to the airport without any extra charge.", "title": "Nice, Convenient Hotel", "user": "catmachine", "date": "November 11, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 3.0}, "id": 21728902, "likes": {"liked": "— Convenient and nice room once moved from original shabby room and internet", "disliked": "— shabby room and no gym"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2005", "text": "I will be back! I have been staying in San Fran for a while as i visit my college aged son. This hotel is the first i have felt totally comfortable in. The staff is friendly and the hotel itself is not what it appears from the outside. The Kimpton Group has taken it over and i believe, have given it a shakedown.....down comforters......gorgeous lobby and friendy restaurant and lounge. The food at the \"Cafe\" is quite \"hotel-like\" but the service makes up for it.....plus SF is a food town! So many other places to explore other than your hotel!", "title": "Just returned", "helpfulness": 14, "user": "Travelingtoo", "date": "March 10, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 3263630}, {"rating": 5.0, "stay_parameters": "Stayed June 2004", "text": "This place geets major reccomendations from me. I will stay there again.", "title": "Great Hotel and brilliant location near Fishermans Wharf", "helpfulness": 19, "user": "Valjf5", "date": "March 5, 2005", "detail_rating": {"cleanliness": 3.0, "value": 5.0, "rooms": 3.0, "service": 4.0}, "id": 3253655}, {"rating": 5.0, "title": "Loved it", "text": "Stayed at the Best Western Fishermans Wharf Hotel in June 2005 and really loved everything about it. A warm welcome on arrival and a nice suite although the rooms were quite compact, however I understand this is common in Fishermans Wharf . Our suite was located on the inner courtyard of the Hotel and lovely and quiet away from any possible traffic noise. Can highly recommend the Restaurant attached to the Hotel for both breakfast and dinner. All in all a great Hotel to stay in at a reasonable cost close to all the action on Fishermans Wharf.", "helpfulness": 10, "user": "A TripAdvisor user", "date": "March 2, 2005", "id": 3240079}, {"rating": 5.0, "title": "The good outweighed the bad", "text": "Free internet use in the reception area was a great touch.", "helpfulness": 4, "user": "Warneringyou", "date": "February 28, 2005", "id": 3236983}, {"rating": 5.0, "stay_parameters": "Stayed January 2005", "text": "Recently stayed at the Tuscan Inn and had a great experience. The staff were helpful, it was in a great location, and was very charming. The complimentary evening wine reception was great, a nice chance to find out what's good or not good to do. Will probably stay when return in May.", "title": "a great 5 days", "helpfulness": 15, "user": "sjr27", "date": "January 19, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3018206}, {"rating": 4.0, "title": "great hotel", "text": "Great hotel, nice location for everything! Very clean, get a glass of wine free between 5&6pm in the lobby. Get an internal top floor room if you can, no noise from traffic or people upstairs. There's no view anyway so best to get some peace and quiet (no that it a noisy hotel anyway). Also book Alcatraze trip as soon as you get there (from Pier 31 I think it was) as it gets busy days in advance.", "user": "claira2609", "date": "April 11, 2008", "id": 14957834}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "Just got back from a recent trip to San Francisco. Stayed at the Tuscan Inn near Fisherman's Wharf and it was excellent.", "title": "Great rooms; great staff; great hotel", "helpfulness": 1, "user": "Malcontent", "date": "April 5, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 14811801, "likes": {"liked": "— Friendly helpful staff", "disliked": "— No complaints"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "Tuscan Inn has exceptionally helpful and friendly staff. There was never a time where I saw the concierge desk unstaffed. In fact, the concierges seemed to be the busiest people in the hotel; always assisting someone with a reservation, recommendation, a jogging route, etc.", "title": "Excellent location, friendly staff, clean and pleasant rooms", "helpfulness": 1, "user": "CowboysRMyWeakness", "date": "April 3, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 14763670, "likes": {"liked": "— Excellent service and location!", "disliked": "— Had some trouble using PC in business center, but helpful staff got us refund AND let us use their computer!"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "The hotel had nIce, well-decorated, fairly-modern rooms. Some of the common spaces are a little worn but our king guest room was very comfortable.", "title": "Location, Location, Location", "helpfulness": 2, "user": "C8", "date": "March 31, 2008", "detail_rating": {"front_desk": 2.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 14686615, "likes": {"liked": "— The room decor with shutters was great.", "disliked": "— The room facing a wall."}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled on business", "text": "OK... this is Fisherman's Wharf so there are some obnoxious, tourist-trap activities around. But.. the hotel is also only a few blocks from North Beach where we found some great little restaurants and cafes.", "title": "Loved the Tuscan Inn San Francisco", "helpfulness": 1, "user": "talullab", "date": "March 28, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 14601425, "likes": {"liked": "— Atmosphere, and attitude of the staff", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2005", "text": "My husband & I spent the day in San Fran. We stopped there before our week long trip to Napa. It was wonderful. The rooms were great and the Service wonderful. They did have a Wine/Beer serving at 5pm which was nice. It is located 2 blocks from the wharf which was outstanding considering parking is hard to come by. The only complaint I have is the Valet service. Not that it was horribly but the pull in nook is not very big. We waited about 10 mins before being helped but we were on vacation, So what's the hurry, right??!", "title": "Great rooms,location & service", "helpfulness": 10, "user": "mrstuckey", "date": "May 23, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 4.0}, "id": 3494864}, {"rating": 2.0, "title": "Great Room - Appalling Front Desk", "text": "Enjoy your stay. We did!", "helpfulness": 10, "user": "A TripAdvisor user", "date": "May 10, 2005", "id": 3454850}, {"rating": 4.0, "stay_parameters": "Stayed April 2005", "text": "The rooms and building are quite nice - location is excellent. The front desk is the worst service I have had in years. It took 45 minutes to check in and we didn't wait in line. While we were waiting, the desk clerk stopped helping us to talk to other guests, never apologized for the interruption, and never looked up once. He was also training serveral others in the same manner - it was the night manager!!!!! Dreadful service!!!!", "title": "great location and reasonably priced", "helpfulness": 10, "user": "soccermom327", "date": "April 29, 2005", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 3424165}, {"rating": 5.0, "title": "such nice folks", "text": "The rooms were clean and well appointed - the maid staff were excellent.", "helpfulness": 4, "user": "goodgirlIllinois", "date": "April 25, 2005", "id": 3415052}, {"rating": 5.0, "stay_parameters": "Stayed April 2005", "text": "I just recieved my credit card bill, there are two extra charges for a total of $20.00. When I called, the desk clerk mumbled into the phone and I had to ask if I had the right number.. Then in a snotty tone, he imformed me that \"you know, accounting is only here during the day.\" I would only stay here again if they changed management.", "title": "Great Hotel", "helpfulness": 6, "user": "MCLScituateMA", "date": "April 23, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3400243}, {"rating": 5.0, "stay_parameters": "Stayed February 2006, traveled as a couple", "text": "While looking for a romantic yet affordable place to take the love of my life for Valentine's day weekend, my search via the internet let me to the Best Western - Tuscan Inn. Although I had frequented San Francisco on many occasions, I had never even noticed this property, and I wanted this weekend to be the most romantic ever.", "title": "Perfect Romance in Tuscany", "helpfulness": 7, "user": "DarinFrazier", "date": "October 12, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5944140, "likes": {"liked": "— The Service...Absolutely, The Staff Is The Best!!!", "disliked": "— Nothing."}}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "Prior to our arrival, I had contacted the concierge' desk and asked them to arrange for roses to be waiting in the room, and for a limousine for dinner on Saturday evening. They said they could accomodate me.", "title": "Not cheap but worth it", "helpfulness": 5, "user": "Chris_and_Linz", "date": "October 9, 2006", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 5931394, "likes": {"liked": "— The free wine tasting", "disliked": "— Pricey"}}, {"rating": 3.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "Upon our arrival, we were directed to a \"mini-suite\" on the fourth (top) floor, southeastern corner of the hotel. Although it was not particular large, it had a quaint sitting room with a television, and coffee table, and the entire suite was very nicely decorated. This particular room had views of the Bay bridge, the Golden Gate bridge, and if we were sitting up in bed, we had a beautiful view of the bay and Fisherman's Wharf. There was a DVD copy of \"Under the Tuscan Sun\", which was a nice touch, although my girlfriend couldn't figure out why they left that particular movie. I explained to her that we were staying in the \"Tuscan Inn!!!\" We both had a good laugh, but never got to watch the movie.", "title": "Tiny Room", "helpfulness": 2, "user": "Dawn29", "date": "October 5, 2006", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 2.0, "rooms": 2.0, "location": 3.0}, "id": 5911804, "likes": {"liked": "— Size of room"}}, {"rating": 4.0, "title": "Great Location", "text": "The roses in the room were the most beautiful my love had ever seen, and were in a beautiful vase with the stems hidden by a giant leaf wrappped inside the clear vase. Excellent choice of florist by the hotel.", "helpfulness": 3, "user": "Maedog", "date": "September 12, 2006", "id": 5794224}, {"rating": 4.0, "title": "NIce Place", "text": "The evening Italian wine & beer reception was very nice, and complimentary for hotel guests. The limousine arrived on time, and the driver was very cordial and accomodating.", "helpfulness": 3, "user": "su432", "date": "September 6, 2006", "id": 5775455}, {"rating": 2.0, "stay_parameters": "Stayed February 2007", "text": "We're sitting in our hotel room, waiting for another set of towels (there are three of us and we were given towels for two). The ice machine is empty. The vending machine doesn't work. The concierge does not answer the phone. Exactly who runs this place!?!?!?!?!", "title": "Wonderful --- NOT!", "helpfulness": 6, "user": "ConnieD53", "date": "February 11, 2007", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 2.0, "cleanliness": 4.0, "value": 1.0, "location": 1.0, "rooms": 2.0}, "id": 6780662, "likes": {"liked": "— Location", "disliked": "— Terrible Service"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled on business", "text": "From checkin to checkout, our stay was fabulous. The staff's professional, spirited attitude--be they reservationist, valet, front desk, or housekeeper--deserves 5 stars. For instance, mention in passing by one of us about an allergy to down brought an instant change of linens. The hotel's evening wine hour and morning's biscotti hour also distinguish the property as a cut above, and our group, which has stayed at many a biz hotel, had no problem whatsoever; in fact, a courtesy upgrade got us a fine meeting space with free internet, which even impressed our boss. And while we weren't expecting to dine at their restaurant, given how many fine ones there are to choose from in this neighborhood, as it turns out we relished the food, both dinner and breakfast. We're already planning our next stay.", "title": "Fabulous Hotel", "helpfulness": 16, "user": "latenightredsox", "date": "February 6, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 6750338, "likes": {"liked": "— polished service, exceptional value", "disliked": "— not a thing"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2007, traveled on business", "text": "Just came back from a one night stay at the Tuscan Inn. Although we are \"locals\" having lived in SF Bay Area for the last 16 years, we were attending a wine event at Fort Mason and didn't want to have to drive home. When I got a GREAT deal ($99 INCLUDING parking!!!!) I jumped at it. But being the Wharf had no great expectations, and didn't really need much more than a bed for the night.", "title": "Great find in touristy Fishermans Wharf", "helpfulness": 13, "user": "LarkspurGirl", "date": "January 29, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 6713646, "likes": {"liked": "— Location", "disliked": "— Parking was not covered, but was a public lot across street"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "This hotel is a weird hybrid.. calling itself Best Western, but being in partnership with Kimpton Hotels (which for those that don't know is a chain of more upscale boutique hotels). I have to think this is why the hotel looks and feels a lot better than other Wharf hotels I've stayed at previously. And frankly more upscale than other Best Westerns too.", "title": "Good Place, if you can get a Discount", "helpfulness": 9, "user": "Marc D", "date": "January 28, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 6710504}, {"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "Staff were very pleasant, always asking if we needed directions or anything (we didn't, but it's nice to be asked) and smiling and opening doors etc. (including all the maids and bell boys we encountered) Small touches, but very pleasant. We didn't make it to the wine hour (having been drinking wine all day, it was not high on our agenda!) but have done that at other Kimpton hotels and it's a nice extra.", "title": "Saved the Trip", "helpfulness": 8, "user": "bosox2022", "date": "January 27, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6704812, "likes": {"liked": "— it was clean", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2004", "text": "We spent 2 weeks (which I gather is quite a long time!!!) at the Tuscan Inn in Sept 04 & had a great time.The hotel was lovely - really clean with friendly helpful staff & fantastically situated in between North Beach & Fishermans Wharf.", "title": "Fantastic San Fran !!", "helpfulness": 10, "user": "rogerrab", "date": "January 12, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3003175}, {"rating": 5.0, "stay_parameters": "Stayed January 2005", "text": "We had a room facing the inner courtyard on the first floor & found it both quiet & very comfortable.We really could not find any fault with either the hotel or San francisco at all, & would not hesitate to stay there again. ps....do not miss Alcatraz - book in advance !!!", "title": "A Bargain Hotel With Class", "helpfulness": 19, "user": "honu-lover", "date": "December 25, 2004", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 2944631}, {"rating": 4.0, "stay_parameters": "Stayed November 2004", "text": "We spent 4 days at the Best Western Tuscan Inn, Fisherman's Wharf in San Francisco the week before Christmas. I booked the room through Expedia, and because of this, the hotel wouldn't credit my Best Western Gold Card with either points or air miles. The price was great for a small but comfortable room. We did have a room on the 3rd floor over the sidewalk and street of North Point. The windows are crank operated, and thin, so there was some street noise from city buses from about 5:30 in the morning until about 10 at night. We are heavy sleepers and it didn't really bother us, as it seems to have bothered other reviewers. The hotel is an Italian mediterrean theme everywhere, entrance, lobby, garden courtyard, restaurant, and rooms. The staff are 100% present and attentive to your every need. Their friendliness reminded me very much of the Aloha spirit at Hawai`ian resorts and hotels. The lobby is small and cozy with a gas log fireplace, perfect for taking away the chill after those cool, foggy walks down to the waterfront. Guests actually talk to one another during morning coffee, and the free hour of wine at 5 pm. I highly recommend this hotel, for both quality and economy.", "title": "Excellent", "helpfulness": 7, "user": "glasgow1-TRIP", "date": "December 14, 2004", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 2882331}, {"rating": 5.0, "title": "top marks for the tuscan", "text": "We bought some of our food at one of the 3 grocery stores a block from the hotel. I'ts about 2 blocks to Fisherman's Wharf, 2 blocks to the cable car turn-around, 1 block to the F-Line trolley car, and 3 blocks to Pier 39. I liked to start and end my day walking out to the sea lions on the K pier at Pier 39. I also took the Blue and Gold ferry out to Alcatraz, and suggest everyone visiting S.F. see this sight for both the ferry boat ride, and for the rich history lesson. Another of my day trips was to rent a car and drive down to Monterrey Bay.", "helpfulness": 4, "user": "bblpleasance", "date": "November 28, 2004", "id": 2850514}, {"rating": 5.0, "title": "Convenient and well managed", "text": "Stayed here in November '04, and loved it! Convenient for all wharfs, and trips to Alcatraz. VERY helpful staff allowed us to check in 4 hours early, and continued to impress! Complementary wine tasting in the evening was a bonus too!! Recommended.", "helpfulness": 6, "user": "Mike Swindley", "date": "November 20, 2004", "id": 2836792}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "My husband and I stayed at the hotel for 4 days. Our flight came in early so the room we requested wasn't ready yet. The concierge recommended a bus tour and called to see if there were seats available and booked us on the tour that was leaving in an hour. The tour was fabulous and the driver was wonderful and provided excellent information during the tour. The tour ended around 2:30 and we were dropped off back at the hotel. By this time our room was ready.", "title": "Great Hotel Great Location", "user": "Beatons", "date": "October 19, 2008", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 21013185}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "We had asked for a courtyard room as I am a very light sleeper. I had no problem at all even though everything in San Francisco was booked and there were people everywhere due to it being the start of Fleet Week. The room was extremely clean and very spacious. The carpet was a bit worn and outdated but that isn't a complaint just an observation. We found the staff to be very helpful and courteous and we had no problems at all.", "title": "Just the Job", "user": "chunky1974", "date": "October 15, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 20908575}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "We didn't participate in the wine social that occurred everyday at 5 but there were a lot of people that did as every time we went through the lobby it was packed. We did however take advantage of the free coffee and biscotti that was offered every morning in the lobby.", "title": "Great time in San Fran", "user": "SteelersFan27", "date": "October 10, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 20790916, "likes": {"liked": "— the staff, clean/comfortable room"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "The hotel is in a fantastic location just a 5 minute walk from Fisherman's Wharf and no more then 10 minutes from the cable cars and other attractions. There is an Ihop one block down which we ate at a couple of times.", "title": "Excellent service, great location, good value", "user": "Phototravelgirl", "date": "October 3, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 20603567, "likes": {"liked": "— Location", "disliked": "— Nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "Our stay was a pleasant one with no complaints at all. We would definitely stay there again.", "title": "Great location and price", "helpfulness": 4, "user": "AxeMcFookie", "date": "September 28, 2008", "detail_rating": {"front_desk": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 20453977, "likes": {"liked": "— Location", "disliked": "— Street noise"}}, {"rating": 3.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "Stayed at this hotel for three days and then moved down the street to the Hyatt(also reviewed the Hyatt) for three days on our trip.This hotel was clean and in a excellent location to everything.The cable cars were one block behind the hotel,waterfront was two blocks in front of the hotel and the #10 bus to AT&T ballpark was right across the street from the main entrance.We arrived early in the morning and tried to check in and the front desk staff said they would have a room cleaned asap for us.We left and came back two hours later and room was still not ready.We had tickets to a 12:45pm Giants game and were hoping to get our room before going to the game.We were having a casual conversation with the concierge and mentioned this fact to him,he then said he'd see what he could do and had us checked into our room in minutes.The front desk staff didn't seem to care but the concierge who took care of us was great(there were two of them working different days)he also had many suggestions and tips for us about the Bay area.The only other negative and its a small one, was the size of the rooms,they are tiny but were cleaned well and were ready when we returned every day.", "title": "Good Hotel", "user": "albertafamily", "date": "August 13, 2008", "detail_rating": {"front_desk": 2.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 18931758, "likes": {"liked": "— location", "disliked": "— small rooms"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "A good location if you want to be walking distance to sights and transportation. The rooms were very nice, clean and comfortable. The 2-room suite was a little crowded, too much furniture, nicely done otherwise. It's walking distance to many sights,, as well as the cable car line,and the trolleys. Very convenient. Every day in the lobby: a very nice complimentary coffee and biscotti in the morning, and a wine tasting in the evening. Wifi was included if you have your own laptop, otherwise internet available in the lobby. The highlight of this hotel for us was the service offered by the staff, particularly the two concierges on duty while we were there. Their service was of the level and knowledge I would expect at at 5-star hotel. I had also called ahead for some information regarding bilingual tours (information I had a very hard time finding on the internet) , and everything was taken care of for us before we arrived.", "title": "Good Location, Great Value", "user": "gringa-1", "date": "August 12, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 18887886, "likes": {"liked": "— service and convenience", "disliked": "— crowded bedroom in the suite"}}, {"rating": 2.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "Similar to some other disgruntled reviewers here I was assigned a different room than I had booked. There were three of us and I had booked a two double bed room and had a confirmation to prove it. I had chosen this hotel for that particular reason as I was having difficulty getting a two bed room at nearby wharf hotels. I was given a king room with a cot on check-in. After a few trips by the clerk back to the manager who remained out of site I was told I had not booked a double bed room but a double occupancy room which wasn't true. They said they noticed we had three people so had automatically provided a cot to our room, I was told they were full and there were no other rooms available.", "title": "Experienced the good and the bad", "helpfulness": 2, "user": "These_are_my_travels", "date": "August 11, 2008", "detail_rating": {"front_desk": 1.0, "business": 2.0, "service": 1.0, "cleanliness": 2.0, "value": 1.0, "location": 3.0, "rooms": 1.0}, "id": 18865613, "likes": {"liked": "— location", "disliked": "— Mix-up with room, less than helpful staff"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "When we got to our room the cot was already there but due to the small room I had to re-arrange furniture to get it to fit, in doing so having to re-assemble their cheap particle board table. The room faced a side street, the street directly below became very active at 5 am with motorcycles in particular in addition to trucks noisily heading up the street. I'm a sound sleeper normally and nothing wakes me so this was just a sign of how noisy it was.", "title": "A brilliant start to our vacation", "user": "napolitoneath", "date": "August 10, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 18796425}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled with friends", "text": "I managed to get switched to a two double bed room for our next couple of nights and experienced what all the good reviewers must have. The room was significantly larger, still small but liveable, and although still on the 3rd floor it faced the wharf and what I would have thought was the busier street but the traffic was much quieter and I didn't hear much at all the next two mornings.", "title": "Check out the free wine", "user": "Irene-Weston", "date": "August 7, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 18715972}, {"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "The Tuscan Inn was in a great location a few minutes from Fisherman's Wharf. It was easy to walk to North Beach as well. We didnt' have a car, so we liked the fact it was a short walk to the cable car stop. The room was small, but clean, quiet, and suited our needs. The afternoon wine and cheese was a nice bonus as was the free Internet. The concierge at the hotel was extremely helpful and nice. He checked into baseball tickets, offered dinner reccomendations, and answered all of our san francisco questions.", "title": "Enjoyed the Tuscan Inn", "user": "dysan1", "date": "August 3, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 18583131, "likes": {"liked": "— location, service"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "I would definitely stay at this hotel again in the future. It was a great base to explore San Francisco.", "title": "A nice surprise.....", "user": "Mainframer", "date": "August 2, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 3.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 18553100, "likes": {"liked": "— Location", "disliked": "— View"}}, {"rating": 3.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "What can you say about a place that does not dazzle but delivers solid consistent performance.. The price was reasonable based on others in the vicinity and it does a good job. The room was clean, the staff was great and it was CLOSE to Pier 39 and Fisherman's Wharf (easy walk). I'd stay there again. The restaurant looks nice but I'm not a big Italian food fan so I bypassed the place. I went with average expectations and came away pleasantly surprised.", "title": "Fisherman's Wharf overrated", "helpfulness": 1, "user": "aoshell", "date": "July 27, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 3.0, "value": 4.0, "rooms": 3.0, "location": 3.0}, "id": 18298999, "likes": {"liked": "— The staff and free wine happy hour", "disliked": "— The stinky bathroom and the trashy Fisherman's Wharf area."}}, {"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled with friends", "text": "Although we enjoyed our stay at the Tuscan Inn it wasn't all I'd hoped it would be. Probably because I was so disappointed in the Fisherman's Wharf area itself. It was really dirty, crowded, crime-ridden and touristy. The food was bad and overpriced in general. The only place I really liked were some of the places on Pier 39, but I wouldn't eat at a sit-down restaurant here. I would stay in North Beach or Sausalito next trip. Food in North Beach was fabulous!.", "title": "A Good hotel", "user": "Glasgow_Member06", "date": "July 22, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 4.0}, "id": 18143756, "likes": {"liked": "— The individual style", "disliked": "— The wallpaper!"}}, {"rating": 3.0, "stay_parameters": "Stayed March 2008", "text": "As far as the hotel, the room was clean but small. Beds very comfortable - we had a King with pull-out sofa for our 12-yr-old son. Nice big flat screen tv. They comped us an in-room movie when I reported that it was \"jerky\". Bathroom shower curtain reeked of mildew enough to smell up the room. I should have had them take it down and wash it, but probably got used to it. Staff was great. Concierge very helpful.", "title": "Right position to visit SFO", "user": "giothelion", "date": "July 21, 2008", "detail_rating": {"cleanliness": 3.0, "front_desk": 3.0, "location": 4.0, "value": 4.0, "rooms": 2.0}, "id": 18092897}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled with friends", "text": "Three friends and I just returned from Tuscan Inn, Fisherman's", "title": "Tuscan is Great Location", "helpfulness": 1, "user": "TravelGirlNC", "date": "July 16, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 17956176, "likes": {"liked": "— Location", "disliked": "— View of the wall from my window"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "Wharf, in San Francisco. We booked our reservation with Southwest Vacations. We had a great time and could have", "title": "Loved It!", "user": "myllek", "date": "July 15, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 17926302, "likes": {"liked": "— location, rooms, view, staff, atmosphere", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "stayed longer. The room was very nice, and had a nice bathroom. We did have a wall view from the window, but since I was not in the room except to sleep I did not make a big fuss. It was nice having the Safeway store across the street to get snacks. I enjoyed the hot chocolate every morning in the lobby. The fireplace in the lobby was very pretty, and the courtyard flowers were beautiful. The location was perfect. Alot of other hotels were more expensive but we were very happy at the Tuscan. The desk clerks were nice and helpful. My friend celebrated his birthday there!", "title": "No Problems", "user": "gbh001", "date": "July 11, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 17776509, "likes": {"liked": "— Good room"}}, {"rating": 2.0, "stay_parameters": "Stayed July 2008", "text": "We walked to a lot of places. It was very convenient. We did not have a car, hotel parking is expensive. We had a Tower Tour", "title": "OK but not as good as our last stay", "user": "NYerUWS", "date": "July 10, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 2.0, "location": 4.0, "rooms": 2.0}, "id": 17763435}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "We stayed here for the first 3 days of our honeymoon beofre getting some sun in Palm Springs. The room was lovely and clean with everything you need wether on business or pleasure.", "title": "A nice hotel for a short getaway", "helpfulness": 1, "user": "partonj", "date": "August 27, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "business": 5.0, "cleanliness": 5.0, "rooms": 5.0, "location": 5.0}, "id": 8514908, "likes": {"liked": "— Clean, good location", "disliked": "— Nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "All the staff were extremely helpful and polite and always saying hi when eye contact was made.", "title": "Great Location", "helpfulness": 5, "user": "LaraH19", "date": "August 26, 2007", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 8507059, "likes": {"liked": "— Location, cleanliness, price", "disliked": "— Consierge"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled with friends", "text": "A good hotel in a good location for all the tourist attractions if you're walking, taxi or by bus.", "title": "Great hotel Good location", "helpfulness": 1, "user": "infrequentflyer", "date": "August 25, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 8503582, "likes": {"liked": "— Well appointed room", "disliked": "— Size of room"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "We ate at the hotel restaurant on our first night which was value for money.", "title": "Great hotel, great experience!!", "helpfulness": 1, "user": "StuAndNatty", "date": "August 24, 2007", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 8498481, "likes": {"liked": "— Most of it", "disliked": "— tea and coffee facilities, side table made from cheap chipboard hidden under a table cloth - but that's just nit picking."}}, {"rating": 3.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "We would definately stay in this hotel again if we're ever in San Fran again.", "title": "some disappointments", "user": "DaveK3", "date": "August 20, 2007", "detail_rating": {"front_desk": 2.0, "service": 2.0, "cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "location": 3.0}, "id": 8460928, "likes": {"liked": "— Clean, comfortable, convenient", "disliked": "— less-than-steller service, restaurant"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "My wife and I took a weekend trip up to San Francisco and wanted to stay at a place that was cheap and close to Fisherman's Wharf. This place did not disappoint.", "title": "Pleasantly Surprised", "user": "Austher", "date": "June 11, 2008", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 3.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 16864440, "likes": {"liked": "— Cheap and great location", "disliked": "— Apathetic front desk"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled with family", "text": "Our room was only $99 per night through some promotion found on Travelzoo. I figure you get what you pay for... but the room was actually pretty nice. There wasn't much of a view (I think the window faced the adjacent building) but the room was fairly large, clean, and the room (as well as the whole floor) was nice and quiet. There was a very private feel to the hotel.", "title": "great hotel", "user": "sheilanj", "date": "June 9, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 16790990}, {"rating": 4.0, "stay_parameters": "Stayed April 2008, traveled with friends", "text": "They also had a staffmember serve soda and wine in the loungy lobby area in the early evening, which was a nice bonus. The surrounding area of the hotel, to our surprise, seemed safe and relatively clean. But the location was great... just a few blocks from the touristy parts of the Wharf. Would definitely recommend this hotel for your next brief stay in the bay.", "title": "Really enjoyed this hotel", "user": "bookworm8", "date": "June 8, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 16780178, "likes": {"liked": "— atmosphere, decor", "disliked": "— no view"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "we just stayed at the tuscan inn for about 5 nights. it was definetely worth it. we had a great room, clean and spacious enough for 2 adults and 2 small kids. and the price was fantastic. we first booked thru hotels.com and thought we got a great deal..our sf itinerary changed a bit, and we needed another 2 nights at the tuscan inn, and the hotel said they would match our hotels.com price, they actually gave us a lower price than that! wow! all the staff we encountered were super friendly and the hotel location is great..enjoy your stay there, i'm sure you'll love it.", "title": "Fantastic stay", "user": "lorelie21", "date": "June 1, 2008", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 16564400, "likes": {"liked": "— The vicinity to the wharf", "disliked": "— nothing1"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "I really enjoyed the atmosphere of the hotel. It was reasonable and close to Fisherman's Wharf. The hotel offered coffee, tea, and biscotti in the morning and wine and an appetizer in the late afternoon. The staff were helpful and efficient. I had not stayed in a Best Western in a while, and I was very pleased.", "title": "Overall Excellence!", "user": "ManHeadingNorth", "date": "June 1, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 16552456, "likes": {"liked": "— Great staff and room.", "disliked": "— Slow elevators."}}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "My husband and myself stayed at the Tuscan Inn 12/8-10. We absolutly loved the hotel and would stay again. Comfortable bed, staff was excellent....great get a way!!!", "title": "Great Hotel", "helpfulness": 3, "user": "tammycash", "date": "December 14, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6441249, "likes": {"liked": "— The Location was Great"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled with family", "text": "We stayed in a suite at the Tuscan Inn the weekend before Thanksgiving. I certainly would recommend a suite for parties of 3 or more. (I traveled with my wife and teenage son.) The rooms' furniture and amenities were quite nice.", "title": "Lovely Evening", "helpfulness": 5, "user": "LOVENATLPARKS", "date": "November 29, 2006", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 6305835, "likes": {"liked": "— Pleasant room / wine party", "disliked": "— Continental breakfast"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "The afternoon wine party was well-attended and pleasant. We had pizza hors d'oeuvres. The continental breakfast is inadequate (only tiny biscotti are provided).", "title": "Great Hotel", "helpfulness": 4, "user": "tammycash", "date": "October 24, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6008237, "likes": {"liked": "— The Location was Great"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2006, traveled with family", "text": "We ate dinner at the Cafe Pescatore (the on-line site restaurant). Our meals were OK; however, I have never been impressed with restaurants in the Fisherman's Wharf area.", "title": "Excellent Location!!", "helpfulness": 2, "user": "maurice1123", "date": "October 16, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0}, "id": 5962624, "likes": {"liked": "— Location"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2006", "text": "After dinner we walked to Pier 39 and enjoyed the sea lions and the atmosphere.", "title": "Loved Staying at the Tuscan Inn", "helpfulness": 4, "user": "mlmjra", "date": "October 12, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 5944345, "likes": {"liked": "— Accessibility to Fisherman's Warf"}}, {"rating": 5.0, "title": "Excellent !", "text": "Just returned from a week in San Francisco at the Tuscan Inn and thought I would give my views on an excellent stay.", "helpfulness": 2, "user": "TheBaron", "date": "November 9, 2004", "id": 2813703}, {"rating": 5.0, "stay_parameters": "Stayed October 2004", "text": "Had picked this hotel on reviews on this site and a couple of others and I was pleased with my choice.", "title": "Loved the Tuscan Inn", "helpfulness": 2, "user": "Clark1950", "date": "November 1, 2004", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 2799753}, {"rating": 4.0, "title": "Shattered our image of a Best Western", "text": "The room itself was medium size - we were on the 4th floor which was nice and quiet , the chiller was useful and the bed most comfortable - surprising for a hotel.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "October 13, 2004", "id": 2701919}, {"rating": 4.0, "title": "Easily Accessible to Wharf", "text": "The location is 1st class , a few minutes from the Wharf and all its attractions , and close to a Safeways Supermarket ( open 7 to 12 pm ) and handily placed for buses , trams and cable cars.", "helpfulness": 1, "user": "patty0240", "date": "October 4, 2004", "id": 2619256}, {"rating": 4.0, "title": "Clean and Close", "text": "The staff seemed pleasant and efficient whenever I had dealings with them , indeed the only quibble I had was that the bell boys at the front were a little undermanned on occasions but I will not let this alter my view of the hotel overall.", "helpfulness": 2, "user": "OlPO", "date": "October 4, 2004", "id": 2619227}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "The valet's were a little slow and I hated the vulture baggage guy. I don't have a problem being helped up to the room although I;m fine doing it myself. This guy immediately put all my bags on the cart while I was pre-occupied with the valet but then while I was trying to correct the problems with the room at check-in he was impatiently trying to get us to hurry up in spite of me telling him just to leave the bags.", "title": "absolutely loved it", "helpfulness": 1, "user": "gothepanthers", "date": "August 7, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 18702749, "likes": {"liked": "— friendliness of staff"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2008, traveled with family", "text": "We read reviews on many hotels looking for above average accomodations in a convenient location. The Tuscan Inn fit that well. Very comfortable stay and got a good deal on Orbitz to boot. Only drawback is room size. We started w/ a king w/ sofa bed for my son but we were tripping on each other so we upgraded to a suite. We also moved from a street view room to a courtyard as the street noise was extremely loud. Staff was some of the nicest I have encountered in a long time. The concierge here was 1st class. Would highly remonmmend this hotel.", "title": "Very Nice --Would recommend to my friends", "user": "i00567", "date": "April 12, 2008", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 14991951, "likes": {"liked": "— locations, service", "disliked": "— room size & traffic noise"}}, {"rating": 3.0, "title": "Wharf on one side, ghetto on other", "text": "On one side of the hotel was Fisherman's Wharf just a few blocks away. On the other was a kind of seedy area with lots of bums. The neighborhood the hotel is in wasn't the best. We always kept it in our heads that we should get back to the room before it got too late. There were some problems with people at the front desk, one younger guy (can't recall his name) was uncooperative and unprofessional. Our airconditioner wasn't in the best working order. We had a nice size room with 2 double beds. My parents' room with only one king bed was really small they wanted to change, but the hotel was booked up. Breakfast isn't included in the room rate, although there is a restaurant adjoined to the hotel with decent, average-priced food. I think it was around $10.00 for an omelette. We expected a better hotel and even thought \"This is it\" but it was reasonably princed. There are so many SF hotels, we should have taken more time to find a nicer place. It wasn't necessarily bad, just not any thing great, either.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "August 9, 2005", "id": 3749688}, {"rating": 5.0, "stay_parameters": "Stayed August 2005", "text": "Wife and I stayed at the Tuscan Inn from August 1-8. I chose this hotel based on Trip Advisor customer reviews. We were very pleased with our choice. The location is perfect. Five minute walk to Fisherman's Wharf, and a short walk to cable cars, busses, and many great restaurants. Staff and concierge were very helpful. We had a courtyard room and it was very quiet. Weather was very cool at night and we slept with the window slightly open. Very comfortable for sleeping and we never used the air conditioning, even though we are from Michigan and keep it on in our home for most of the summer (like today, when it is 90 and humid). The coffee and biscotti offered in the morning is a good way to start the day, and the free wine hour from 5 to 6 is very pleasant, although we were so busy we only attended twice. I would definately return to the Tuscan.", "title": "Good Choice", "helpfulness": 5, "user": "TeacherMan", "date": "August 9, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 3749562}, {"rating": 5.0, "title": "Great place to stay--Tuscan Inn", "text": "My 18-yr old dtr and I just returned from staying 4 nights at the Tuscan Inn in San Francisco. We had never traveled there and booked the trip thru Priceline. Tuscan was wonderful! The rooms were clean and nicely decorated. The rooms were also quiet and we felt safe. The location was great, just a few blocks from Fisherman's Wharf. One day we got a day pass and took the cable cars and buses to view other parts of the city such as Chinatown, Golden Gate Park, Painted Ladies houses. The bus line we needed was just across the street and the cable car was a block away. Again, the location was great! The 5-6 pm complimentary wine hour was a nice feature. They did have soda for younger people, but ran out so my dtr didn't get anything to drink. In the morning there is complimentary tea, coffee, hot chocolate and biscotti. We arrived at the Oakland Airport and took BART to get to SanFrancisco and then the f-line muni to get to Fisherman's Wharf. It was ok, but it took a good hour to get to our motel. It cost about $8 per person to travel this way. We decided to take a shuttle back to the Oakland Airpost. There was a shuttle that advertised $23 for one person and $10 for additional people...so it cost $33 which was worth it. It only took about 20-25 minutes by shuttle to get back to the Oakland Airport. I'd definately stay at the Tuscan Inn again. Other places I'd recommend seeing include Alcatraz (audio tour), Muir Woods tour, and biking the Golden Gate bridge.", "helpfulness": 6, "user": "AVacationer", "date": "August 7, 2005", "id": 3744463}, {"rating": 5.0, "stay_parameters": "Stayed August 2005", "text": "We were very pleased with the Tuscan Inn. After going back and forth trying to decide whether to stay at the more expensive Argonaut, we chose the Tusan Inn and were very happy with the choice. It is set back just far enough from the wharf area that you feel you can get away from the tourist madhouse, but close enough that in five minutes you can be at pier 39 or the cannery. The location was great! We were able to hop on the cable car right around the coner, we walked to Lombard Street, Coit Tower, the square, the marina, and the wharf many times. The rooms were celan and well kept. The bathroom was just okay, but for the price we survived. The staff of the hotel was very friendly and the evening cocktail hour was a great touch with many choices.", "title": "Great deal with lots of charm", "helpfulness": 6, "user": "Lins94", "date": "August 6, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 3741256}, {"rating": 2.0, "title": "Not Impressed", "text": "We enjoyed a meal at the ajoining Pescatore's and found it to be affordable and delicious. The hotel is just across the way from Safeway, Trader Joe's, and Branes and Nobles. We were able to grab danish or donuts in the morning at Safeway which was a great way to save on money.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "August 5, 2005", "id": 3738664}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "I will always come back to this hotel for business travel or for pleasure.I travel quite often and have stayed in many different hotels. Right now this hotel is at the top of my list. I will always tell everyone to try it.", "title": "Loved this hotel and location! Great city for couples", "helpfulness": 1, "user": "Roll-Tide-5", "date": "March 20, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 14420484, "likes": {"liked": "— Location, free MUNI passes each day for trolleys and buses", "disliked": "— Concierge was always busy"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled on business", "text": "Loved the location of this hotel! It was near the ocean- about 2 blocks away. Location was also near Pier 39 (shopping, sea lions, and marina), Ghiradelli's chocolate factory, and Alcatraz. Lots of little shops nearby- very touristy. At Pier 39 the shops were nicer with a great outdoor atmosphere. Loved eating at Bubba Gump Shrimp Co.- as in Forest Gump. Great shrimp, fish, chicken fingers, hushpuppies, etc with lots of windows to enjoy the ocean and marina. The gift shop is great, too, if Forest Gump is one of your favorite movies like mine. My husband and I went for our anniversary and it was perfect. The Golden Gate Bridge is unbelievable! It just makes you happy inside seeing it. We walked across and back which was so nice to enjoy each other's company without toddlers wrapped around our legs. With this hotel we received a free 1 hour tour/cruise around Alcatraz and down to the Golden Gate Bridge. You also get 2 free transportation passes each day of your stay that we used for the trolley systems. Their travel system is called the MUNI and includes the trolleys or the city buses. The drivers are a great help for any questions you have. We used the trolley and buses for the Golden Gate Bridge. WE Loved the Trolleys! You can just ride with no particular destination in mind to get a feel for the city. Also great for going to the section of the city for the major shopping area (I can't remember what it's called but the area feels like New York City- very busy, hustle and bustle.) And remember the MUNI passes were free! We rented a car to go to Napa Valley to see the vineyards and Muir Woods to see the giant redwood trees. This was a nice little morning hike that my husband really enjoyed. Whatever the weather says for your trip to San Fran, take a heavy jacket/ coat. Everybody that doesn't do this buys one at the little tourist shops. (smile) Hotel was clean and a great price. However, don't count on the concierge for help. He was always covered up when we went by. This city is a must for any couple!", "title": "Great Stay!!", "helpfulness": 2, "user": "kaszobody", "date": "March 16, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 14322627}, {"rating": 5.0, "stay_parameters": "Stayed February 2008", "text": "Great location, near lots of stuff to walk too. Concierge was EXCELLENT!!! His name was Clay, very helpful and spent lots of time with you. Has a restraunt/bar in hotel, limited italian food, but nice to sit and have a few drinks. Rooms nice, beds very comfortable!. Would stay again.", "title": "A great hotel in a great location", "helpfulness": 1, "user": "RosinaK", "date": "March 16, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 14315538}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "We stayed here for 3 nights on our way to New Zealand.", "title": "Couldn't have been better", "helpfulness": 2, "user": "BnB_SE_Texas", "date": "March 14, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 14280179, "likes": {"liked": "— Proximity to Fisherman's Wharf"}}, {"rating": 4.0, "title": "Good Location, Clean", "text": "Fisherman's Wharf has to be the best area for a tourist to stay in San Francisco and the Tuscan Inn is in easy walking distance of Pier 39, the Alcatraz Ferry, the main promenade of Fisherman's Wharf and the Cable Car line.", "helpfulness": 8, "user": "A TripAdvisor user", "date": "July 29, 2005", "id": 3721473}, {"rating": 5.0, "title": "WOW! Cannot imagine better in the Warf!", "text": "Our room (2 x Double Beds) was clean and of reasonable size.", "helpfulness": 8, "user": "A TripAdvisor user", "date": "July 29, 2005", "id": 3721090}, {"rating": 5.0, "title": "Great Decision to Stay Here!", "text": "The Foyer / Lounge was very attractive and filled with comfortable seating.", "helpfulness": 9, "user": "A TripAdvisor user", "date": "July 29, 2005", "id": 3720594}, {"rating": 5.0, "title": "Bella! Wonderful Hotel!", "text": "The complimentary early evening (5 to 6pm) Wine reception was a nice feature - choose from 3 x wines, beer and soft drinks.", "helpfulness": 14, "user": "A TripAdvisor user", "date": "July 28, 2005", "id": 3707749}, {"rating": 5.0, "title": "dobre! dobre!-----great ! great!", "text": "Did not try the attached Cafe Pescatore or the 24-hour fitness centre (not complimentary) that was one block away.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "July 27, 2005", "id": 3705154}, {"rating": 5.0, "title": "Warm and Comfortable", "text": "Stayed three nights and wish we could stay longer. The staff members were extra helpful, the room well decorated, detailed, clean, and bright. Liked the wine, beer, and soft drinks happy hour, the proximity to all points of interest in Fisherman's Wharf, the cable cars, grocery stores, gym, etc.", "helpfulness": 1, "user": "Coit", "date": "March 8, 2008", "id": 14150345}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "This is a real find. Nice Italian restaurant in hotel, too. Watch out for steep parking rates of about $45 per night. This total includes the taxes and tips for mandatory valet parking.", "title": "Loved the Tuscan Inn", "helpfulness": 1, "user": "keokimax", "date": "March 6, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 14102866, "likes": {"liked": "— Close to tourist attractions, restaurants", "disliked": "— Really missed having a clock in the room and a small refrigerator"}}, {"rating": 5.0, "title": "will stay again", "text": "Aside from the parking rate, you won't be disappointed.", "helpfulness": 2, "user": "rosemariestlouis", "date": "March 2, 2008", "id": 13994334}, {"rating": 4.0, "stay_parameters": "Stayed February 2008", "text": "Beautifully furnished rooms. Was disappointed not to have a small refrigerator or a clock radio.", "title": "Good experience", "helpfulness": 2, "user": "mf-sandiego", "date": "February 26, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 13874869}, {"rating": 1.0, "stay_parameters": "Stayed February 2008", "text": "Maid service was excellent ! Front desk and bell men were all very friendly and efficient. They gave out maps to help us find Chinatown, Union Square, Fisherman's Wharf, Pier 39, as well as point out bus routes.", "title": "Stay away during renos", "helpfulness": 1, "user": "travellingtourister", "date": "February 23, 2008", "detail_rating": {"front_desk": 3.0, "service": 2.0, "cleanliness": 5.0, "value": 2.0, "rooms": 4.0, "location": 3.0}, "id": 13791365, "likes": {"liked": "— Location", "disliked": "— Noise"}}, {"rating": 2.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "Booked two rooms on Priceline for $139 each, just an overnight stay while flying home the next morning. Check in was good, rooms both ready, and we upgraded with no problems. Room was very small for 4, we apparently had an \"outside\" room, because trucks crashed around all night loading and unloading. Tried to tip the maids for 2 extra towels as there were 4 of us and it was a HUGE problem, apparently no more than 4 towels per room? Didn't want to pay for the mini-bar, but frig leaked all over floor. When maintenance guy came in, he blamed us for turning it down, it was in a locked cabinet! Asked for a wake up call and did not get it. One male working the desk the morning of 10/20 was rushed, rude, so checked out without talking to them. Hotel is clean, very convenient to the Wharf and shopping. Would not stay here again, due to noise and staff, but ok for the price, if I would have paid rack rate, I would have been more upset.", "title": "Ok for the price...", "user": "divecozumel", "date": "November 4, 2008", "detail_rating": {"front_desk": 4.0, "service": 1.0, "cleanliness": 3.0, "value": 2.0, "rooms": 2.0, "location": 4.0}, "id": 21546556, "likes": {"liked": "— Location to Fisherman's Wharf", "disliked": "— Rude staff, noisy room"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "We stayed at this lovely, incredibly well located hotel for 6 nights as we explored the hills of San Francisco. The staff was wonderful, our room was very pretty with a view of the Fisherman's Wharf area. The bathroom was marble and we had luxurious bathrobes and really, every detail attended to. When we first arrived at 2am, there had been a mixup with the room reservation and the man at the desk was so competent and accomodating - while the hotel was full, he found a room for us, for which we were eternally grateful.", "title": "Our comfy room at the Tuscan Inn", "user": "bannalouise", "date": "October 28, 2008", "detail_rating": {"cleanliness": 4.0, "front_desk": 4.0, "location": 5.0, "value": 5.0, "rooms": 5.0}, "id": 21341816, "likes": {"liked": "— Coziness", "disliked": "— One night noisy out on the street"}}, {"rating": 3.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "We met the manager, who was incredibly helpful about restaurants in the area, and also a lovely person to talk to. The breakfast at the neighboring restaurant (attached to the hotel) was delicious and the evening wine hour was the perfect thing after a day on one's feet. I'd highly recommend the Tuscan Inn based on location, cheerfulness of staff, aesthetics in the room and general overall service.", "title": "great stay at the tuscan inn", "user": "soccerdeb", "date": "October 27, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 21294463, "likes": {"liked": "— location", "disliked": "— smaller rooms"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "stayed for three nights at the tuscan inn. easy walking distance to fishermans wharf , cable cars, and streetcar stop to ferry building. older hotel with smaller rooms but updated nicely. thin walled rooms. only coffee and bisquits for breakfast. overall a pleasant stay.", "title": "Loved the wine at 5pm", "user": "Lytia", "date": "October 26, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 3.0}, "id": 21231461, "likes": {"liked": "— Free wine and eats at 17:00", "disliked": "— the attached restaurant"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "We stayed two nights in August following a flight from UK. We had a room on the ground floor that was very well decorated but a bit gloomy. As we had come to sleep that actually helped. It was large with enough space for our cases. Disappointed with coffee making faclities.", "title": "Perfect Location", "user": "bigjeannie1", "date": "October 26, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 21228503, "likes": {"liked": "— Location and wine evenings!!", "disliked": "— nothing"}}, {"rating": 5.0, "title": "A Gem of a Hotel!", "text": "This hotel is a real gem! It is in a really good position, is not too large, and the staff are really helpful, and, contrary to what we expected on visiting America for the first time, are not waiting around for tips all the time! The furnishings are superb, rooms comfortable, and the icing on the cake was that every evening between 5 and 6pm they put on wine and beer tasting with nibbles for all the guests in the lounge! You can spend the whole hour or just pop in. Also, if you are not a breakfast person, you can just pick up a complimentary coffee and biscotori in the mornings. We only stayed for three nights, wish it had been longer!", "helpfulness": 9, "user": "EnglandPoppy", "date": "January 20, 2007", "id": 6627793}, {"rating": 3.0, "title": "Hotel Good, Beware the Breakfast!", "text": "For our Silver Wedding Anniversary we decided to go round the world, & one stop, albeit only for 2 nights, was San Francisco. We've used Best Western hotels quite a lot, so had no fear of booking the Tuscan Inn. Reviews on-line were generally favourable - as is ours.", "helpfulness": 6, "user": "Acker", "date": "January 18, 2007", "id": 6615434}, {"rating": 4.0, "stay_parameters": "Stayed December 2006, traveled with family", "text": "We arrived on the evening of december 5th, and the check-in staff were helpful and efficient. The room was a fair distance from the elevator, but adequate, and no different to most others in this class of hotel as far as amenities went. Our room looked out onto a very small internal courtyard, & plants and flowers made it quite pleasant, but one had to be careful about the shutters because other guests could see into the room. The reverse applied, of course!", "title": "Loved the Tuscan Inn", "helpfulness": 5, "user": "kajowisconsiin", "date": "January 10, 2007", "detail_rating": {"cleanliness": 4.0, "front_desk": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 6572964, "likes": {"liked": "— THe convenience and ambiance."}}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "The next morning, we went down to the adjacent restaurant, which had been in prior publicity material, for breakfast. We didn't enjoy it, because some of the staff seemed to have little English, and misunderstood our requests. We were given saute potatoes that were inedible because they were so hard and undercooked, and the coffee wasn't so good, either. We sent the potatoes back, and the bill was reduced by a small amount. The Eagle Cafe on Pier 39 is a far better bet, and has a view of Alcatraz whilst you're eating.", "title": "Wonderful Hotel", "helpfulness": 9, "user": "Judy1954", "date": "December 28, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6509244, "likes": {"liked": "— Price and location.", "disliked": "— N/A"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "We used the hotel's safety deposit without any problems, and the checkout was good and swiftly done. The hotel is quite close to Fisherman's Wharf and the terminus of one of the Cable-car lines, and also close to the streetcar line, so getting into the city centre was easy. The general area that the hotel is in is a bit scruffy. The only quibble we had with the Tuscan Inn was that outside our room was a large cupboard, and staff kept going in there, made quite a noise, and finished off by banging the door. Overall it was quite good, but not so good as to be a 'must go back' sort of place. We paid £172 (stg) for our two night stay.", "title": "I Left My Heart.....", "helpfulness": 9, "user": "TinaG", "date": "December 17, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 6450841, "likes": {"liked": "— Location, location, location!", "disliked": "— Ask for a room in the back. Very quiet!"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2008, traveled as a couple", "text": "My Husband and I chose this Hotel for out New Year's Eve \"gettaway\" based on the great reviews from Trip Advisor and we were not dissapointed! I booked a standard king room and was up graded to a premier king free of charge upon our arrival. The staff were very nice. The wine hour in the cozy lobby was great. Enjoyed talking with fellow travelers by the warm and inviting fireplace. Our room was very nice. We expected the room to be small based on all the reviews but it was very nicely decorated and super clean. The bed was very comfortable and the room itself was very quiet. The hotel is walking distance to many attractions. We ate at the Italian restaraunt located in the hotel and the food and service was outstanding. Check out the following morning was fast and flawless as we enjoyed fresh coffee and biscotti served complimentary in the lobby. I will go back to this hotel again!", "title": "A great place to stay in San Francisco!", "helpfulness": 1, "user": "BarbCalifornia", "date": "January 2, 2009", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 23202188, "likes": {"liked": "— Location and hotel theme", "disliked": "— Nothing!"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2008, traveled as a couple", "text": "Having stayed at this hotel awhile back, I sort of knew what to expect. Check in was flawless, and we were even early arrivals at approx 12 noon. Room was on 4th floor overlooking the interior garden area. Seems the hotel has been completely renovated since our last stay. Our room had a nice clean bath/shower, all tile, and sink that was marble. Plenty of toiletries. The bed was very plush, and king size that was very comfortable. There were 2 alarm clocks on either side of the bed. Nice mini bar, and plenty of tv stations to watch before going to bed. The rooms are done in an Italian hue, and recently new carpet through out the entire hotel and our floor. The refridge was a bit noisy, and the air conditioner seemed a bit loud and woke me several times during the night, but really was not bad at all. Never experienced the room service. Never did partake in the 5 pm wine tasting as we were usually out at the Buena Vista chugging down Irish coffee until the late night. The hotel is very well located as previously mentioned in other reviews. We ate dinner at the attached restaurant the night prior to our departure for convenience, and was pleasantly surprised at the quality of the food. Well done. All in all, would and have stayed here again. Paid around 205 a night booked through a hotel vendor website. It is very \"touristy\" by the wharf. As other times we have stayed more in the financial district, and probably would the next time for a different feel again.", "title": "Again, a nice quaint hotel, perfect location", "helpfulness": 1, "user": "BrentD", "date": "December 9, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 22594570, "likes": {"liked": "— location to wharf and water", "disliked": "— nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "We have just returned from a 3 week vacation incorporating 6 days in California followed by a cruise.", "title": "Great time in San Francisco", "helpfulness": 2, "user": "Emily's_Grandad", "date": "November 28, 2008", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 5.0}, "id": 22264813, "likes": {"liked": "— Location", "disliked": "— Nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "We chose the Best Western Tuscan Inn as our base whilst in San Francisco on the first three nights of our tour.", "title": "A Great Stay", "user": "fadedtan", "date": "November 22, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 22093874, "likes": {"liked": "— Convenience"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2008, traveled on business", "text": "We arrived at SFR approximately 1 hour late due to flight delays at London Heathrow and in the pouring rain and, of course, suffering from jet lag. Despite all this, we found the Tuscan Inn easily in a city strange to us.", "title": "Very Dog-Friendly", "user": "LAKen2", "date": "November 19, 2008", "detail_rating": {"front_desk": 3.0, "business": 5.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 22006887, "likes": {"liked": "— dog-friendly", "disliked": "— tried to charge extra, rather than my quoted AAA rate"}}, {"rating": 3.0, "stay_parameters": "Stayed July 2005", "text": "The location is excellent right in the centre of fishermans wharf, a few minutes walk to all the major attractions and cable car. The rooms are comfortable, clean and nicely furnished. The bathroom was clean but a little dated. The staff at check-in were nice enough, but unfortunately the concierge was not very helpful, giving us wrong information about our car hire location causing us to get 2 cab rides instead of one. Not good with heavy luggage! We did not sample the evening wine reception, as it's a bit early if you are out sightseeing. The tea, coffee and biscotti in the morning however, was a nice touch. Good value hotel for the location.", "title": "Excellent location", "helpfulness": 3, "user": "Simon_and_Ali", "date": "August 20, 2005", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "service": 3.0}, "id": 3792454}, {"rating": 5.0, "stay_parameters": "Stayed August 2005", "text": "I cannot praise this hotel highly enough. We chose the hotel because of the reviews on this site and we weren't disappointed. The location of the hotel was fantastic it takes a couple of minutes to walk to pier 39 and is right next to the tram stop to take you into the main shopping areas. I really don't know where the \"ghetto\" was as mentioned in another review because I always felt perfectly safe. I think that SF has a problem with vagrants in general and they were not especially prevelant around the hotel. The reason that I liked this hotel so much was that it felt cosy and welcoming, the lobby had a log fire going constantly and all the staff were very friendly and helpful. The free beer, wine etc and snacks on an afternoon was a lovely touch and helped you swap tips and chat to other guests. The rooms were very nice - it wasn't the usual beige hotel room which made a nice change. The only thing wrong with the room was the bathroom, it was not up to the standard of the rest of the decor but it was clean and large enough. The restaurant that adjoins the hotel was excellent - the prices were reasonable and the food was very good.", "title": "a wonderful hotel", "helpfulness": 7, "user": "ratchet4", "date": "August 17, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3779507}, {"rating": 5.0, "stay_parameters": "Stayed May 1999", "text": "Just one tip... regardless of the hotel you stay in I would thoroughly recommend the bike hire that allows you to bike over the golden gate bridge. We spent a glorious morning exploring the bay area on our own and the bike paths made it very safe and easy to do.", "title": "Perfect place", "helpfulness": 4, "user": "42WWeber", "date": "August 16, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3778656}, {"rating": 5.0, "stay_parameters": "Stayed August 2005", "text": "On the 30th anniversary of our marriage my wife went on the internet and arranged a week in California. We flew from Philadelphia to San Francisco and arrived at the Tuscan Inn at Fisherman Warf in the early afternoon. The front desk treated us like royalty. Our room was tastefully decorated in white and yellow. It was so cheery and felt like a bed and breakfast room. We could walk everywhere and felt right at home when we returned in the evening. We would recommend this location for anyone who wanted to be close to all attractions. Don't hesitate, try it.", "title": "Great Location and comfort", "helpfulness": 5, "user": "ronnyber", "date": "August 12, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3756687}, {"rating": 5.0, "stay_parameters": "Stayed July 2004", "text": "We stayed at the Tuscan Inn for one night in August 2005. I chose this property for its proximity to Fisherman's Wharf and the Blue and Gold Ferry to Alcatraz. It was an easy 5 minute walk to both of these as well as the Cable car line. Dinner in the hotel restaurant was excellent and the beds were very comfortable. I was also pleased with the wireless internet access. paid $161 plus tax along with a $20 parking fee.", "title": "Great Hotel!", "helpfulness": 3, "user": "Brutus_Buckeye", "date": "August 10, 2005", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 4.0, "service": 4.0}, "id": 3750955}, {"rating": 5.0, "title": "Enjoyed our stay at the Tuscan Inn", "text": "This is the first time we stayed at the Tuscan Inn, our room was very nicely furnished and the bathroom was neat and shiny. The location was great for sight seeing and visiting the many restaurants close by. The social hour between 5 and 6 p.m. was a nice touch. We met a very nice couple from Vancouver (even though the U.S. Olympic Hockey team got beat by Canada the Sunday we were there). The restaurant serves a very nice breakfast.", "user": "EagleCalifornia", "date": "March 1, 2010", "id": 57480368}, {"rating": 3.0, "stay_parameters": "Stayed February 2010, traveled with family", "text": "Booked after checking out on Trip and looked okay. When Amercans say small rooms you normally imagine they will be bigger than european sizes but this is no bigger. Facilities in room average but could do with better cupboard space.", "title": "Nice Place - Shame about the size", "user": "spatan", "date": "February 26, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 2.0, "rooms": 2.0, "location": 4.0}, "id": 57180392}, {"rating": 4.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "Coffee in the lounge fair but would be better if you could brew up in your room. Wine party great novelty and nice drop off and change stop before going out for the evening.", "title": "Some Nice Touches", "helpfulness": 1, "user": "Somerset-RoadRunner", "date": "February 13, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 55873163}, {"rating": 4.0, "stay_parameters": "Stayed January 2010, traveled with family", "text": "Only thing to remember is the bin men collect at ungodly oclock so road facing rooms get disturbed.", "title": "A good place to stay at Fisherman's Wharf", "user": "Dave's_reviews", "date": "February 2, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 55017189}, {"rating": 4.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "My wife and I stayed 3 nights at the Tuscan Inn and enjoyed every minute. We got a late internet deal but even so this hotel was not cheap by comparison to others in this area. However it is in a great position, one block from all Waterfront attractions, and throws in some nice little extras that actually made it good value for money. These included discount vouchers for the attached Italian restaurant and free wine tasting (max 2 glasses) and pizza (from the restaurant) between 5 and 6 pm every evening. For good reason was this hotel recently given an award for it's standard of service.", "title": "Very nice hotel with a great restaurant and convenient to many locations", "user": "BigSal56", "date": "January 28, 2010", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 54607505}, {"rating": 3.0, "title": "A Mixed Bag", "text": "You can't beat the location with a stick, but the \"suite\" was awfully small. The thermostat gave us a choice of baste or chill until frosty.", "helpfulness": 1, "user": "fortunakim", "date": "November 18, 2004", "id": 2832049}, {"rating": 5.0, "title": "this is the place", "text": "At $80-100 this is a 4 star but at $150 a night I was looking for a little more.", "helpfulness": 2, "user": "whatayanuts", "date": "November 17, 2004", "id": 2831745}, {"rating": 4.0, "title": "tuscan inn was wonderful", "text": "the tuscan inn was a great place to spend a week since it is located away from the noise and action of the wharf but also close to the cable cars to travel around the city. our early flight arrival actually let us into the room before check in which was the first of many pluses of this hotel. the hotel has a wine hour each day which is a great way to relax after a day of touring and also meet others. friendly service was evident each day and the gentleman conceirge was patient and helpful. there is a grocery store right around the corner which was nice to grab some juice and pastry rather than a full scale breakfast. i could not recommend this place more and will return to the tuscan on my next vacation to california.", "helpfulness": 4, "user": "jeanburkeHull", "date": "November 15, 2004", "id": 2826957}, {"rating": 5.0, "title": "Enjoyed our stay", "text": "we stayed here for 3 nights last week. the rooms are small but very nice. the staff was very friendly and the location is great. got the \"best rate\" and it was a good deal.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "November 13, 2004", "id": 2822887}, {"rating": 5.0, "title": "Wonderful Hotel!", "text": "Really enjoyed the Tuscan Inn. Staff was extremely friendly and helpful. Coffee in the morning was great. \"Happy hour\" from 5-6 was a great touch. We enjoyed drinking wine and meeting some of the other guests. Very close to Fishermans Wharf. Basically 2 blocks or so to the water. The only minor downside, as a few others have mentioned, is the bathroom/sink lighting. Room is a little small, but was totally fine for two people with two full sized suit cases. We will stay at this same hotel the next time we are in San Fran.", "helpfulness": 5, "user": "Penney1000", "date": "November 9, 2004", "id": 2814127}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "We checked into this hotel after a long flight from Florida. They were very efficient at the reservation desk and surprised us with an upgrade to a suite. The rooms seemed to have been recently renovated with updated decor. They were very comfortable and quite attractive. The bed was perfect as were the pillows. (I always carry travel down pillows, but didn't even unpack them.) The wine reception in the late afternoon is a nice extra. The bathroom was adequate with thick, fluffy towels. If I had any complaints, it would be that there could be a larger sink area to hold cosmetics.", "title": "Great Place to Stay", "helpfulness": 3, "user": "eyenurse", "date": "September 10, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8690872, "likes": {"liked": "— Beautiful rooms", "disliked": "— No breakfast included"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "I would highly recommend this hotel. It is a great value.", "title": "Great stay", "helpfulness": 1, "user": "grotbags", "date": "September 1, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 8603047}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "We stayed for three nights,our room was on the fourth floor and adequately big enough for the three of us, my husband and adult daughter.The staff were friendly and helpful,it was a good base from which to explore San Francisco.", "title": "Excellent Hotel & Location", "helpfulness": 1, "user": "bdorgan", "date": "August 29, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8534821, "likes": {"liked": "— Location & quality of rooms", "disliked": "— No pool"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled with friends", "text": "We took an evening Alcatraz tour and a City tour with Shuttle tours which I would recommend if you have limited time in town.", "title": "LOVED IT!!", "helpfulness": 2, "user": "antnyp73", "date": "August 28, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 8521668, "likes": {"liked": "— cleanliness and staff", "disliked": "— NOTHING!"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "The Best Western in Fishermans Wharf is a fabulous hotel and an ideal base to enjoy your trip to San Francisco.", "title": "Great location and staff !", "helpfulness": 1, "user": "Matty33", "date": "August 27, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 8516787, "likes": {"liked": "— Log fire and morning and evening complimentary refreshments", "disliked": "— slow internet access"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2010, traveled with friends", "text": "Nice hotel and was close to everything. Only had a couple minor complaints. First, there was noise from garbage trucks early in the am on the first night and loud people causing a ruckus outside the following night. Neither occurance is really the hotel's fault. But, as others have indicated in their ratings/reviews, get a room that faces the courtyard if you are a light sleeper. Second, the shower curtain did not work well and we had puddles of water on the bathroom floor after each shower. Beyond that the hotel was nice and clean and the staff took care of any needs we had. The lcoation was great for sightseeing.", "title": "Liked it", "helpfulness": 1, "user": "BWAirportExecutel", "date": "January 11, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 53222068}, {"rating": 3.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "Perfect location if you like busy areas. It is very close to fisherman's wharf near all the action - restaurants, souvenir shops, pier 39, ferry departures and the cable car. As the hotel is located in the street parallel to fisherman's wharf you don't hear the noise from outside.", "title": "Fine hotel", "user": "tenenbaum", "date": "January 7, 2010", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 4.0, "rooms": 3.0}, "id": 52855650}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled with family", "text": "The hotel is nice and the staff we met was friendly. The room was smaller than we're used to and there was no view. The room was clean and the bed were comfortable. The value for money is a bit low as you mainly pay for the location.", "title": "Fun location and they LOVE pets!", "helpfulness": 1, "user": "EdenTravels", "date": "December 31, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 3.0}, "id": 52247935}, {"rating": 4.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "This is a very comfortable, quaint property in an excellent location. The rooms are a little small but very comfortable and a great value.", "title": "Fantastic Hotel", "user": "Neats1269", "date": "December 21, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 51608582}, {"rating": 5.0, "stay_parameters": "Stayed December 2009", "text": "I really appreciate being able to bring my two bichon frise's. They even have doggie treats in the lobby. We didn't have to pay extra to have the pets with us. Our dogs loved walking around Pier 39 and the Wharf. If you are planning to bring your doggies, this is an excellent choice. I highly recommend.", "title": "The perfect hotel on Fisherman's Wharf...", "user": "AliceMorales", "date": "December 17, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 51425034}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled with family", "text": "Stayed for two nights, there were six of us in three rooms. We all had the same great opinion of this property. Very clean and well maintained through-out. It was an easy walk to the bus stops and Fisherman's Wharf areas. There was a Trader Joes and Safeway within a block of the hotel to buy snacks and such. The adjacent Cafe Pescatero was handy for breakfast but had some hiccups in service, but it was okay overall. We would highly recommend this hotel to others.", "title": "Great hotel", "helpfulness": 4, "user": "Hanfordmom", "date": "September 24, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 10000220, "likes": {"liked": "— location and cleanliness", "disliked": "— price"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled with friends", "text": "My sister and I stayed at the Tuscan Inn over the weekend. It is a great hotel - clean and comfortable. We had a courtyard view, and there was NO noise at night. A lot of the people staying there were older and very quiet. I would DEFINITELY stay there again. It was a couple of blocks from the warf. The streets in San Fran were filthy and the homeless people were scary, but the hotel was wonderful!!!", "title": "Great Hotel!!!", "helpfulness": 1, "user": "gozzerino", "date": "September 19, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8822860, "likes": {"liked": "— It was so quiet at night. Comfortable beds. Clean!", "disliked": "— Front desk help. Some were friendly - some not..."}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "This was our second stay at the Tuscan (THe first was 10 years ago). It is a wonderful clean place to stay and but two short blocks to Fisherman's Wharf. Earily evening free wine tasting (or wine drinking- they give you a full glass af several wines). In the morning free great coffee and biscotti in the lobby- with carry-out cups.", "title": "Great place to lay your head and tour from", "user": "tomlynn907", "date": "September 18, 2007", "detail_rating": {"cleanliness": 4.0, "front_desk": 4.0, "location": 5.0, "value": 4.0, "rooms": 5.0}, "id": 8750847, "likes": {"liked": "— Location and quality", "disliked": "— N/A"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "Our room was always cleaned but they only give out 2 towels? I guess you only get one towel per day.", "title": "Loved the Tuscan Inn", "helpfulness": 1, "user": "lisasully101", "date": "September 18, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 8740660, "likes": {"liked": "— Friendly staff", "disliked": "— view from our room"}}, {"rating": 4.0, "title": "Tuscan Inn 2 blocks from the Piers", "text": "It was interesting that we received a better room price by going thru Travelocity then by calling the hotel direct???", "helpfulness": 8, "user": "FNPMSN", "date": "September 11, 2007", "id": 8697599}, {"rating": 3.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "We stayed at the Tuscan Inn, because its walking distance to the Cruise Pier. We were going on a cruise and wanted to be close to cruise terminal. Not only close, but in the Fishermans Wharf area, did not need to rent car, public transportation out front. Our room was very nice and comfy, only complain about room was it was too small. Would stay here again, event hough they did not know what they did with our luggage when we checked out, but I am trying to work with them now about it, we eventually found it, but the experience was not great. (lack of communication and very unhelpful about it on there end)", "title": "Would stay here again, eventhough we had an issue", "user": "kjshurbet", "date": "May 19, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 16221243, "likes": {"liked": "— Location", "disliked": "— Lack of communcation between front desk and bell hops"}}, {"rating": 3.0, "stay_parameters": "Stayed April 2008, traveled with family", "text": "Hotels in SF are not cheap,and room sizes are not overly big,so a pretty tiny room for $180 was no big surprise. Valet parking for $40 per night seems a bit steep,but at least the service was efficient and quick.", "title": "Reasonable value for money", "user": "johnPerpignan", "date": "May 8, 2008", "detail_rating": {"front_desk": 4.0, "business": 1.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 15803399, "likes": {"liked": "— location", "disliked": "— no pool"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled on business", "text": "Overall the Tuscan Inn is a nice hotel. very clean,well maintained,with efficient,if not overly friendly service. the couple of faults with room features were fixed very quickly,which was a nice change from the interminable wait often suffered in European properties.", "title": "Nice hotel!", "user": "Gemela01", "date": "May 7, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 15765124, "likes": {"liked": "— Location", "disliked": "— Steep price for parking"}}, {"rating": 5.0, "title": "Beautiful Hotel", "text": "The hotel makes a big thing of the coffee/bisc service in the morning,and this is quite nice. I'd say that,as far as the evening (5 to 6 ) wine service is concerned,if you happen to be in the hotel,it's fine. But not worth rushing back from a day out for.", "user": "skm52", "date": "April 25, 2008", "id": 15336804}, {"rating": 4.0, "stay_parameters": "Stayed April 2008, traveled with family", "text": "Breakfast was OK,but expensive. Much better option is Pats Cafe,just round the corner nr the cable car terminus.", "title": "Great stay", "user": "JuanitaBrighton", "date": "April 23, 2008", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 15283155, "likes": {"liked": "— excellent position", "disliked": "— expensive restaurant for what it was"}}, {"rating": 2.0, "stay_parameters": "Stayed September 2005", "text": "All the negatives are true. Something good to say.... I liked the blinds and they helped block out the noise from our \"quiet courtyard\" room overlooking the noisy street. The valets/bellhops were excellent. If you get a cheap rate here, have low expectations and are sound sleepers, then this is good for location to Fisherman's Wharf attractions. The room was clean enough. Our reservations were completely wrong and staff were clueless, so I thought, until further inquiries proved that they were lying through their teeth. One morning I overheard people booking in experiencing similar difficluties and a staff member trying to be helpful, I offered some assistance and we were told by him that since Best Western shifted its booking facility offshore there's nothing that Tuscan Inn staff can do to help guests.", "title": "Try elsewhere", "helpfulness": 3, "user": "NorthForWinter", "date": "September 19, 2005", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "rooms": 2.0, "service": 1.0}, "id": 3914294}, {"rating": 4.0, "stay_parameters": "Stayed March 2005", "text": "We stayed at the Tuscan Inn last weekend, and found it perfect for our needs. We were able to walk lots of great places, we did not take the cable car because the lines were so long, but it was easy to get to. It was very easy to find a cab when we needed one. The staff was very friendly, we had no issues at all with the front desk. The mini bar fridge was set too low - a bottle of beer actually exploded, and although we called housekeeping for some new towels no one ever arrived. I happened to go up to our room when the housekeeping staff was out in force - every single woman I passed said hello to me! I usually have trouble sleeping in hotels, but I was able to open the window (I need that street noise that others complain about!) and get some fresh air, and the bed was very comfy.", "title": "Great location", "helpfulness": 1, "user": "heads_up", "date": "September 14, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 3904155}, {"rating": 1.0, "title": "Good location - and that's it", "text": "A complete disappointment - from losing the reservation made through Best Western toll-free number (\"our computer crashed when receiving reservations from BW\" - lame) to charging our credit card for someone elses stay 3 WEEKS AFTER WE LEFT! There appears to be no management actively involved with running this dump, cause when we asked to speak with one the front desk staff got very nervous and suddenly worked hard to find our lost reservation. Dont let the \"free\" wine and biscotti fool you. There is a Holiday Inn Express exactly one block away.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "September 6, 2005", "id": 3847495}, {"rating": 5.0, "stay_parameters": "Stayed August 2005", "text": "We recently spent 3 nights at the Tuscan. Nice, medium sized hotel in a good location. Walking distance to all Fishermans's Wharf attractions, cable cars, etc. Very good Italian resturant attached (forgot the name). Wine tastings each afteroon. The staff is friendly and helpful. The room is medium size, clean and comfortable. I SUGGEST YOU REQUEST A COURTYARD ROOM TO AVOID THE STREET NOISE. This IS a city!", "title": "Great Hotel !!", "helpfulness": 1, "user": "RichDe", "date": "September 2, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 3839329}, {"rating": 4.0, "stay_parameters": "Stayed March 2005", "text": "This hotel is in a great location in terms of a walking distance to key Fisherman's Wharf attractions. From the Wharf area you can catch a trolley car or sightseeing bus to other parts of the City.", "title": "Great location", "helpfulness": 1, "user": "heads_up", "date": "August 29, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 3813235}, {"rating": 4.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "Great Hotel in good location. On checking young lady at reception decided to take a phone call and leave us standing there with no instruction for 5 mins. Her colleague eventually took over and handed us our room keys.......okay ! what room where we what floor were we on, no communication, so first impressions not good. The room was very clean and modern abit on the small side, but overlooking the courtyard was better than overlooking a road. Wine tasting is served between 5pm-6pm which is great after a long day sight seeing. On check out again, we had a rude receptionist, as you can be charged to use your room safe or ask for it to be waivered. I asked for it to be waivered and the reply was 'that was not my question miss' oh dear someone got out of the wrong side of bed.....So yeah great hotel, but beware of the two grumpy staff,the others seemed fine when observing.", "title": "Great Location,Reception Staff Rude", "user": "courtod", "date": "March 20, 2010", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 59089313}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "The Tuscan Inn was a GREAT place for us to stop after a long flight from the East Coast and on our way to Hawaii. The room was spotless! The amenities were so much more than we'd expected! (although I DID read the reviews on TripAdvisor before booking!). The restaurant attached had a wonderful breakfast menu - everyone was very friendly and helpful. The location was ideal - walk to Pier 39, restaurants, shops, grocery, etc. The tour bus company picked us up right at the door. The only way to have made it better, would have been to stay a couple of days more.", "title": "Wished we could have stayed longer!", "user": "nynana614", "date": "March 20, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 59086392}, {"rating": 4.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "We've already decided to return to the Tuscan the next time we make our way back to Hawaii!", "title": "Within Walking Distance of Fisherman's Wharf", "user": "AAMEL", "date": "March 20, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 59060430}, {"rating": 4.0, "stay_parameters": "Stayed January 2010, traveled with friends", "text": "Thanks for such a relaxing and comfortable couple of nights!", "title": "Fantastic Location", "helpfulness": 1, "user": "IndiTravell", "date": "March 17, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 58815788}, {"rating": 4.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "The convenience of walking to all the Fisherman's Wharf attractions, made this the perfect hotel. We had a car, so the room+parking package saved us quite a bit. The staff was efficient and friendly. There is a free public computer in the lobby and free wine tasting in the afternoon. Breakfast was not included in our package, but there were many places to eat close by.", "title": "We would stay here again!", "user": "Craazylulu", "date": "March 13, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 58506473}, {"rating": 4.0, "title": "Great Location", "text": "I spent two nights at this hotel. It is about a 5 minute walk to Fisherman's Wharf. Good base for exploring local sights. Generally very quiet hotel.", "helpfulness": 9, "user": "DDMOttawa", "date": "April 23, 2005", "id": 3399493}, {"rating": 4.0, "title": "Oh my gosh, the Best beds!", "text": "Wine at 5 pm was a nice treat.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "April 19, 2005", "id": 3375794}, {"rating": 4.0, "stay_parameters": "Stayed June 2004", "text": "Room was slightly bigger than a typical room.", "title": "Great place to stay", "helpfulness": 2, "user": "tinkerbell3637", "date": "April 7, 2005", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "rooms": 3.0, "service": 4.0}, "id": 3341329}, {"rating": 1.0, "title": "Jerks", "text": "While I have no substantive complaints about this hotel, areas for improvement include:", "helpfulness": 15, "user": "atmo", "date": "April 4, 2005", "id": 3329496}, {"rating": 5.0, "stay_parameters": "Stayed March 2005", "text": "$29/day to park a car seems like a lot to me.", "title": "Absolutely fabulous", "helpfulness": 3, "user": "Bergs", "date": "April 4, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 4.0}, "id": 3329165}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "Fantastic choice, 10 days at the Tuscan, location is wonderful only a couple of blocks from pier 39. The Coffee and Biscotti in the morning were a nice touch, and the wine tasting every evening became a must get back to the hotel for. Room spacious 2 double beds gave us plenty of room, the beds were comfortable and the bathroom was a good size. there is a bar up the road if you are a sports fan at the grand hyatt which is worth a visit. Overall a fantastic time was had there and i look forward to returning A+++++++++++++", "title": "Fantastic Hotel", "helpfulness": 1, "user": "Tuggster", "date": "May 31, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 16539134, "likes": {"liked": "— Everything", "disliked": "— Nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "Our room was absolutely lovely, although dresser drawers and closet were small. The bed was very comfortable. Windows don't open - so no fresh air. Internet is free. I needed something printed two different times, and after following their directions I went to the front desk and was able to get it right away. There is a small refrigerator, but it was stocked so very little space for our own \"goodies\". The location is perfect - two blocks from Fisherman's Wharf and only a block to the street car and trolley. The bathroom was large and included a mounted makeup mirror. Towels were large and soft. The shampoo, conditioner, soap and lotion they provide is heavenly! Coffeemaker in the room and when \"regular\" coffee wasn't left one day, it was delivered immediately when I requested it. Lots and lots of restaurants nearby. We had a wonderful time and would definitely stay here again.", "title": "Perfect Location and Lovely Inn", "user": "Lynn_StPaul", "date": "May 29, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 16486816, "likes": {"liked": "— Location, lovely room.", "disliked": "— Can't think of a thing!"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled solo", "text": "I cannot say enough good things about this hotel. I was on a strict budget for my trip to SF and was thrilled to get this hotel for $59 on Priceline (off season, and between conventions, I did my homework). The hotel is perfectly located in my opinion: close to Fisherman's Wharf, but away from the crowds; within a very short walk to North Beach (an absolute must see); literally around the corner from the cable cars (buy a multi day pass-much cheaper); stores and restaurants closeby; excellent transportation connections besides the cable car. The hotel itself is elegant, but not stuffy. One of the friendliest desk/concierge staffs I've encountered (they made a luggage tag, mapped out driving directions, gave bus/trolley directions, gracious with special requests, wine & cheese hour etc). The rooms are abit smallish (absolutely typical of SF), but immaculately maintained, and tastefully decorated, with excellent bathroom facilities. One stand out example: the painter who was touching up nicks on the hall mouldings, cheerfully greeted me in the morning on my way out. I am a budget traveller who has travelled all over the world, and this hotel is one of my top five picks for best value (just don't pay rack rate). This hotel is managed by the Kimpton folks and they do a great job for the price.", "title": "Tuscan Inn was incredible", "user": "johnnyv1954", "date": "May 26, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 16419318, "likes": {"liked": "— location, transportation options, friendly staff, decor", "disliked": "— no view, smallish rooms"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "Tuscan Inn has it all, exellant location,very close to public transport, very clean, impeccable, friendly service and a supermarket opposite. Our king bed room was quite overlooking the courtyard and the decor lovely. The complimentary toiletries, coffee and biscotti and the happy hour drinks each eveing just go to prove they go the extra mile.", "title": "Terrific stay at the Tuscan Inn", "user": "shona62", "date": "May 20, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 16226178, "likes": {"liked": "— location and service", "disliked": "— nothing comes to mind"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "bus pick us up every morning at the hotel and they did an", "title": "Perfect locatin for exploring the city", "user": "flowerd2004", "date": "July 9, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 3.0}, "id": 17676603, "likes": {"liked": "— Location", "disliked": "— Street noise, room size"}}, {"rating": 3.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "We stayed here for three nights in early August before heading to the Tenaya Lodge in Yosemite. The hotel was clean and decorated nicely, and biscotti and coffee in the morning was nice. Staff was friendly. The rooms and the double beds were very small, both quite a bit smaller than the Tenaya.", "title": "Hotel OK, good location.", "helpfulness": 1, "user": "ccmac", "date": "August 20, 2007", "detail_rating": {"front_desk": 2.0, "business": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 8460907, "likes": {"liked": "— location, price", "disliked": "— small rooms & beds"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "We had booked two connecting rooms since we were travelling with our boys, ages 11 & 15, and I called several days prior to arriving to remind them of our request. At check-in, they had our kids in a room at the end of the hallway, which we were not comfortable with. We took just one room for that night and they moved us to adjacent, though not connecting, rooms the next two nights. This was much better and gave us a lot more space. Beware, if you request adjoining rooms, they are not guaranteed and really not even planned. They told me they don't assign rooms until the day of check-in, and they were also overbooked.", "title": "Nearby the Wharf and Charming", "helpfulness": 2, "user": "jph948", "date": "August 18, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 5.0, "rooms": 5.0}, "id": 8447314, "likes": {"liked": "— Location and amenities", "disliked": "— On the street"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "The Tuscan Inn is in a great location in Fishermen's Wharf and our boys really enjoyed Pier 39. I'm glad we stayed in FW instead of downtown - much more for kids to do there.", "title": "Great location, clean rooms, we enjoyed our visit....", "helpfulness": 1, "user": "bebalm", "date": "August 18, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 8446308, "likes": {"liked": "— great location, very clean", "disliked": "— one room was very bright at night and musty smelling"}}, {"rating": 3.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "The Tuscan Inn is run by the Kimpton Hotel group and therefore a step above the typical Best Western. The hotel is very clean and modern. Our room was decorated with white wood shutters and accents of black and red. It was quaint and nice sized. The bed was comfortable and the views were overlooking the street and the bay, from our corner room.", "title": "Enjoyed the wine in the afternoon", "user": "NeedaSeaview", "date": "August 14, 2007", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 3.0}, "id": 8420511, "likes": {"liked": "— Location for ferries and transport links", "disliked": "— Location for restaurants at night"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "There was coffee and biscotti in the lobby daily. We also used the convenient shopping across the street to buy some bagels at Safeway which we stored in the bar refrigerator. Then we picked up the free lobby coffee and the WSJ and the USA Today newspapers, thus having a cheap breakfast. There's also a Trader Joes and Cost Plus just a block away.", "title": "PA Traveler", "user": "Zebra11", "date": "August 13, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 8408103, "likes": {"liked": "— Location to the Wharf and Cable Cars", "disliked": "— Size of the rooms."}}, {"rating": 3.0, "stay_parameters": "Stayed June 2005", "text": "PROS", "title": "Great Location", "helpfulness": 5, "user": "juxie", "date": "June 28, 2005", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "rooms": 3.0, "service": 3.0}, "id": 3616600}, {"rating": 3.0, "stay_parameters": "Stayed June 2005", "text": "The location is wonderful. Two short blocks to the cable cars, 1 block to the electrics trolleys and steps to the bus. We never used our car to explore the city. Pier 39, Fisherman’s Wharf, the Cannery and Ghirardelli all an easy walk (with kids).", "title": "Great Location", "helpfulness": 8, "user": "juxie", "date": "June 16, 2005", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "rooms": 3.0, "service": 3.0}, "id": 3558971}, {"rating": 3.0, "stay_parameters": "Stayed May 2005", "text": "Our room was very quiet as well. It was nice not having to listen to cars and buses throughout the night or other guest.", "title": "Good Location", "helpfulness": 14, "user": "yellowpony", "date": "June 1, 2005", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "service": 3.0}, "id": 3519238}, {"rating": 5.0, "title": "Great Hotel!", "text": "CONS", "helpfulness": 9, "user": "A TripAdvisor user", "date": "May 30, 2005", "id": 3510570}, {"rating": 4.0, "stay_parameters": "Stayed July 2004", "text": "We were initially given a smoking room although I requested nonsmoking and then the desk clerk argued with me that it was not a smoking room, but just on a smoking floor… there was an ashtray in the room. They did switch rooms eventually and even the bellhop thought it smelled horrid in the room.", "title": "Great location at a reasonable price", "helpfulness": 7, "user": "mwano", "date": "May 29, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 3.0}, "id": 3508439}, {"rating": 4.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "Arrived early after a 12 hour flight and a 21 hour time switch (NZ to San Francisco) - feeling like zombies. The room was ready! Really needed a shower but there was a bit of a hot water shortage early afternoon. More tepid than hot. This isn't unusual in hotels. It was fine the next morning. The rooms are small by American standards and it wasn't helped by the presence of a fairly large and noisy fridge which we weren't given a key to. We ended up unplugging it, which was easier said than done. The hotel doesn't provide coffee and tea making facilities in the room but it is available to take away in the lobby from around 7 a.m. to 10 a.m. We actually found this more useful, especially as you could use the internet at the same time. There is also a wine hour from 5 to 6pm in the lobby. Free wine and free pizza. It was a great way to meet other guests. The hotel has a great location. A few minutes walk from Pier 39 and the wharf area, a short stroll from the F-line trolley cars and one block from the Powell and Mason St. cable car turnaround. There are plenty of restaurants nearby and we also tried the Cafe Pescatore at the hotel. The food was very good but the portions are more European than American.", "title": "Good location and mainly friendly staff. Rooms are small", "user": "WilliamPayer", "date": "January 26, 2010", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 3.0}, "id": 54399555}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled solo", "text": "We also suffered from the work on the windows that was mentioned in an earlier post. It was a bit of a pain but we never had a major problem although we had to keep our shutters closed. Most of the staff were very friendly although there was one guy on reception who never seemed to crack his face. If you can't lighten up in San Francisco, you are in trouble. By the way, if you are down by the wharf and want to see some sharks, just pop into any camera shop.", "title": "perfect location", "user": "dmac15209", "date": "January 22, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 54089150}, {"rating": 5.0, "stay_parameters": "Stayed January 2010", "text": "We would stay here again but would check about the window work. It is annoying.", "title": "Outstanding location, outstanding hotel!", "user": "neonp", "date": "January 21, 2010", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 53989015}, {"rating": 1.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "Very friendly and helpful staff. Clean, comfortable rooms. Great Location. Walking distance to everything from a grocery store, convince store, pharmacy, public transportation (all within one block) and most of all...Fisherman's Wharf. My only complaint is the room was a little small. But then really didn't spend much time there.", "title": "Terrible experience!", "helpfulness": 3, "user": "FangsDK", "date": "January 18, 2010", "detail_rating": {"cleanliness": 4.0, "value": 1.0, "location": 5.0, "service": 1.0, "rooms": 2.0}, "id": 53791290}, {"rating": 5.0, "title": "Highly Recommendable", "text": "Spent 4 nights here with my two adult children on a tourist visit to SF. My daughter and I had stayed at this hotel about 5 years ago, and loved the location and the comfort! Near Fisherman's Wharf, two blocks from the Powell-Mason cable car terminus, and close to the F line stops. Because we would be there for several nights, I booked a King Suite. The bedroom with the King bed was kind of small, very little room between the foot of the bed and the TV stand, and the same in the living room when the sofa bed was out, but who cares! We basically slept there. Bed was comfortable, nice cushy linens, lovely appointments.", "helpfulness": 1, "user": "YuYoNeT", "date": "January 17, 2010", "id": 53657544}, {"rating": 4.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "This was a wonderful Hotel. After reading some of the bad reviews, we started to worry about staying here. Our worries washed away the moment we reached the hotel. The staff was amazing, and went out of their way to help us. The coffee and treats in the moring was amazing. The wine and treats at night were great also, nice touch. We took the advice from other reviewers and requested a court-yard side room. Glad we did, it was very quite. Some say the rooms are small, but ours wasn't that tiny. A normal size hotel room compared to other hotel rooms we have stayed in, besides we didn't spend much time in the room when there is so much to do around San Francisco.", "title": "Great Hotel", "helpfulness": 1, "user": "hard_working_girl", "date": "September 6, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 19833381, "likes": {"liked": "— Great location, nice staff, and clean", "disliked": "— The food next door (over-rated)"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "I will stay here again if I ever get the chance to go back to San Francisco.", "title": "Helpful staff and great location", "user": "pagirl11", "date": "September 6, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 3.0}, "id": 19818651, "likes": {"liked": "— hotel staff", "disliked": "— small rooms"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "This hotel is in a convenient location. It is within walking distance to the wharf, as well as the pier that sails boats to Alcatraz. There are many public transportation options including the cable cars, the trolley line and bus service. It is within easy walking distance to China town and sits within the City's Italian neighborhood. The hotel is across the street from a Dollar rental car drop off, so you can rent a car at the airport, tour the area and then drop the car off when you get into the city. The hotel does have parking, but it is expensive and hard to get around the city while driving. The hotel itself had attractive common areas. The rooms were small, very small. They were, however clean and well equipped. The staff at the hotel more than made up for the tiny rooms. They were extremely helpful and would go out of their way to meet your every demand. The Consigliore was extremely knowledgeable and very helpful. If you are looking for an inexpensive hotel to stay at where the staff will make your tour of their city a good experience, this is it.", "title": "Great Location!", "user": "MNandMN", "date": "August 27, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 19432384, "likes": {"liked": "— Location, knowledgable staff", "disliked": "— prices for parking"}}, {"rating": 1.0, "stay_parameters": "Stayed August 2008", "text": "My wife and I stayed two nights to kick off our honeymoon. The staff was very friendly and we really enjoyed their dinner recommendations. The hotel was clean, and the evening wine hour was a nice touch. The parking was steep (over $40/day after taxes), so if I had to do it again I would have parked 1/2 block north for about half of that. Overall, we would highly recommend this hotel as it is two block from the warf, dining, etc. M&M", "title": "would not recommend it", "helpfulness": 2, "user": "hsam", "date": "August 13, 2008", "detail_rating": {"front_desk": 2.0, "business": 2.0, "service": 2.0, "cleanliness": 2.0, "value": 1.0, "location": 4.0, "rooms": 1.0}, "id": 18934230}, {"rating": 4.0, "stay_parameters": "Stayed March 2005", "text": "My wife and I stayed for three nights in March 2005. We had a room facing into the Courtyard. Quiet and well designed. Best feature was the freebie drinks in reception from 5-6pm. We met couples from all parts of the world and had interesting chats over several glasses of wine. Don't bother with the Italian style cafe attached to the hotel. The best and nearest breakfast is at Wharf Inn on Beach St, a block away (Chinese run).", "title": "I Don't often give compliments", "helpfulness": 12, "user": "caniscorpus", "date": "March 31, 2005", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 3316064}, {"rating": 5.0, "title": "great rooms, fantastic location and great service!", "text": "Another English couple we know has stayed here since our departure and they too confirm our opinion that this is a lovely hotel, well situated for all the delights of Fishermans Wharf", "helpfulness": 23, "user": "A TripAdvisor user", "date": "March 23, 2005", "id": 3296694}, {"rating": 2.0, "stay_parameters": "Stayed February 2005", "text": "My husband and i stayed here for 2 nights in march, I was concermed by the number of comments regarding the size of the rooms - yes they are a little on the small size but as there was only 2 of us plus my toddler daughter we found them to be more than adequate and very family friendly (particularly liked the lock on the mini bar/fridge door which housed a seemlessly endless supply of candy!) the beds were VERY comfortable and we had a great room which overlooked the street below with the bay in the distance (NOT overly noisy at all considering the location) the valet and the porters all very friendly and nothing seemed to be too much trouble for any of the staff! overall we had a fantastic stay and i would not hesitate to book here again, being a travel agent i am very picky by the nature of work i am in, and i would DEFINATELY reccomend this hotel as a first option to any of my clients who wanted to stay in San Fran. i would also urge other vistors to prebook Alacatraz with Blue and Gold Fleet direct on there website before they arrive in San Fran as you can pick up your tickets at the self service machine without the miles of queues!", "title": "Everything appeared okay", "helpfulness": 11, "user": "Tellte", "date": "March 21, 2005", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 5.0, "service": 2.0}, "id": 3292418}, {"rating": 3.0, "stay_parameters": "Stayed March 2005", "text": "Stayed here recently. Everything went well. I really liked the place. The hotel had been pre booked so on check out I had nothing else to pay. However, when I returned home, I discovered the hotel had charged my credit card $1.63 without my knowledge the day after check out. It is only a small sum of money but I was very concerned as I had not stolen anything from the hotel or used any of the stuff in the bedroom bar!", "title": "Spent three nights last week", "helpfulness": 10, "user": "ecwc54", "date": "March 15, 2005", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "service": 4.0}, "id": 3275600}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "I originally requested a courtyard room but since we checked in around 11 a.m. the front desk person said one would be available around 3 p.m. but they had a 4th floor room facing the street available immediately. I am a very light sleeper so I’ll admit I was apprehensive about having a room facing the street.", "title": "Charming and Comfortable!", "helpfulness": 2, "user": "lilacbirman13", "date": "September 10, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 19970520, "likes": {"liked": "— Charming boutique feel.", "disliked": "— Can't think of anything."}}], "location": {"country": "United States", "city": "San Francisco"}, "stars": 3.5, "variance": {"poor": 60, "average": 201, "very good": 801, "terrible": 25, "excellent": 884}, "aka": "Best Western San Francisco", "slim_ranking": 0.0851063829787, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.0, "location": 4.5}, "description": "Since 1997, Frommer's Guide designates the Tuscan Inn, a Kimpton Hotel, located just steps from the breathtaking San Francisco waterfront, as \"the best hotel at Fisherman’s Wharf.\" This gracious boutique hotel is characterized by its warmth and charm, impeccable service and Italian country villa ambiance. Adjacent to the hotel is the inviting Italian trattoria, Café Pescatore, completing the picture for an ideal stay in the City by the Bay."}