{"user_rating": 5.0, "review_count": 1038, "name": "BEST WESTERN PLUS Elm House Inn", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "This place just felt like it belonged in wine country; everything from the decor to the exceptional staff/owners. We checked in during the afternoon and there were fresh lemon cakes to be had. After having dinner near the river (which is about 2 mins away), we came back and there were freshly baked chocolate chip cookies. They also had complimentary tea/coffee/water available all day.", "title": "Feels like home!", "helpfulness": 2, "user": "Johnsmithy123", "date": "September 10, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 40635450}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled with family", "text": "I've stayed at many nicer hotels, but none were quite as welcoming as this. The rooms were cozy, clean and there was even a fireplace in the corner, which was a nice touch. We did a lot of research prior to booking here and I'm glad we stayed here rather than some $300/night place.", "title": "Loved it!!", "helpfulness": 2, "user": "holadebbo", "date": "September 8, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 40114246}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "As other posters have mentioned, they have awesome freshly made waffles for breakfast. Along with that, there were: grapefruit, apples, oranges, hardboiled eggs, oatmeal, yogurt, pastries and juice/coffee. The spread was quite impressive, and best of all, it's included!", "title": "Cozy, Comfortable, and Welcoming!", "helpfulness": 3, "user": "TravelingRN", "date": "September 1, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 39424883}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "The location is great if you want to explore the Napa wineries or just head downtown. I suggest working North to South so that you can end your day near the Inn, restaurants, outlets, and shops downtown. We met the husband who runs the place with his wife and he was a real down-to-earth person, and genuinely nice and appreciative of our business.", "title": "A Great Surprise", "helpfulness": 1, "user": "ROKChicago_IL", "date": "August 31, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 3.0}, "id": 39406732}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "I have never tried a B&B, but if it's anything like this, I will be seeking them out! I loved this place and will be recommending it to all of my friends and family who head to napa/sonoma. The #1 ranking on trip advisor is well deserved.", "title": "Loved it - like a B&B - will definitely return", "helpfulness": 1, "user": "babystepstraveler", "date": "August 29, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 39180028}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled on business", "text": "We love, love, love this place! My family was very impressed. We have stayed at many five star hotels and our room at this Best Western was one of the cleanest we have ever seen. Also, the service was amazing! Their continental breakfast was impressive and the afternoon treats were delicious! The staff was friendly, curtious and attentive... I give the Best Western Elm House 5 stars and look forward to our next stay! Believe me and others when we say this is, definitely, not your average Best Western. The owners have gone out of their way to make your stay in Wine Country one to remember!", "title": "Welcome home!", "user": "m_chu_lovetotravel", "date": "August 29, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 39117573}, {"rating": 4.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "Well this is a lovely little Best Western. They have really put their heart and soul into it. You even get robes (which you don't in the five star Bellagio in Vegas!). It has free parking outside, very handy. Big room. It's very handy for the wineries, it's pretty much a straight run. It's probably a mile from town so not as convenient as I thought (problem if you both want to drink as you'll have to walk). The road down to the side of the motel is just too pretty for words, it's like a chocolate box scene. It's real 'white picket fence' country, just charming and quaint and gorgeous. I wanted to live in Napa after walking down that road! The staff are very friendly. The owner makes chocolate chip cookies every afternoon, they are the BEST COOKIES I HAVE EVER EATEN. EVER!! They are served with pear cider (warm), it's just delicious and welcoming and sweet. Had waffles for brekkie next day, very nice. There are lots of places in town to get brekkie though and I do love a big American breakfast so I'd recommend going out for breakfast. The vineyards themselves are divine. Go to the visitor centre in Napa town centre, they very kindly give you a list of things you might enjoy, you tick the ones you like, then they tell you which wineries are the best ones to suit your tastes! It's brilliant. We went to Beringer and Silverado, really beautiful. Beringer is old and full of tradition. Silverado looks very contemporary and has a cable car ride up to it. You get divine views over Napa. The tours are fantastic, well thought out, great value for money, fab friendly staff. I want to go back and see lots more. Oh, stay away from the fake castle winery, we drove in and drove straight back out - it looks like cheap tack. Maybe it's great on the inside, but on the outside it's a hideous eye sore.", "title": "Very very nice", "helpfulness": 1, "user": "irishinealing", "date": "August 28, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 4.0, "service": 4.0, "rooms": 3.0}, "id": 39047598}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "We stayed 4 nights for part of our honeymoon. One night in 401 and 3 in 402... both rooms were GREAT! Both were in a seperate building from the lobby and office. They were both HUGE rooms and the little gardens that our room looked out onto were so cute and peaceful. The location is very close to the highway, but from our room- we couldnt hear any traffic. The breakfast was awesome and the staff is great..... couldnt recommend this place more!", "title": "The best!", "user": "elizab569", "date": "August 27, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 39012421}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "This was our second time to stay at the Elm House Inn, and we were very pleased again. The rooms are large and clean. The only complaint we had was the air conditioner cycled on and off all night. Great cookies in the afternoon, and also a nice breakfast in the morning. It is also reasonably priced for the area.", "title": "Great place to stay", "user": "genelary", "date": "August 6, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 36920061}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "Sweet, intimate and friendly place. Folks staying there are so comfortable there they actually leave their rooms to hang out off the patio, or in the common room. We came in late and knew about their cookies per the reviews here. We thought we had missed out on them. The hostess noticed us looking and said I have more in the oven and will bring up some to your room. Rooms are clean and have a/c. It was cozy almost like you were visiting a relative at their home. Old fashioned but inviting.", "title": "What's not to like?", "user": "likeslocalstuff", "date": "August 6, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 3.0, "service": 5.0, "rooms": 4.0}, "id": 36854642}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "Enjoyed a wonderful two night stay in Sept 2009. There are many glowing reviews and I think they’re all justified.", "title": "Reviews are Justified - It's great!", "user": "SimonRufus", "date": "September 29, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 45458685}, {"rating": 5.0, "title": "Unbelievable hospitality", "text": "Price: Our budget was in mind when booking a place in Napa and the Elm House was right in the middle, not the cheapest thing in Napa, but not $300+ a night either. We felt it was a great value when you consider how much you “got” compared with how much you spent.", "user": "boardthedogandgo", "date": "September 27, 2009", "id": 45049249}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "We stayed in the room above the office and not at anytime were there noises from downstairs or in the hallway (or from other rooms for that matter), pretty well insulated. We were also on the street side and couldn’t really notice any street noise.", "title": "Fantastic hotel", "user": "UkCrockett", "date": "September 25, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 44447156}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled with friends", "text": "I was surprised on how large the room was, I would say it’s probably one and a half to maybe twice as big as a “typical” hotel room at a chain hotel.", "title": "RECOMMENDED", "user": "sanstique", "date": "September 18, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 42755075}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "Breakfast was great as mentioned. Fresh mini banana nut bread one day with cranberry orange the next. Very tasty. Waffles were great, fruit was fresh, coffee was hot. We also took advantage of the hot ciders and cookies each night as a night cap after dinner and before bed. Nice to unwind out on their little patio.", "title": "Best place we ever stayed in the valley", "user": "bkperal", "date": "September 16, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 42167102}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "This hotel really goes out of its way to make guests feel at home!", "title": "Great Place !", "user": "fraire", "date": "October 13, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 46767469}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled on business", "text": "The situation is ideal for anyone visiting Napa and the valley. Although it's not right in the centre, it's not far to walk downtown through the quiet streets, and it only takes a couple of minutes by car if you're lazy.", "title": "Lives up to it's reputation", "user": "JBTucson", "date": "October 12, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 46656756}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "We had a double queen room which was huge, spotlessly clean, extremely comfortable and met all of our needs entirely. The extra wash-hand basin just outside the bathroom is a great plus when there's four of you.", "title": "It was PERFECT for us all.", "user": "vanofwhite", "date": "October 8, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 46317158}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "The decoration may not be slap bang up to date, but it's kind of homely and comforting.", "title": "Exceeded expectations in every way", "user": "ElThomo", "date": "October 6, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 45984889}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "For the tired and weary after all that wine-tasting, shopping ( Outlet stores close by ) and laundry ( coin operated in the hotel itself - great !) there's even a hot tub too, in a lovely garden at the back.", "title": "Absolutely Delightful Hotel", "user": "winelovergirl", "date": "October 1, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 45626759}], "location": {"country": "United States"}, "stars": 2, "variance": {"poor": 9, "average": 21, "very good": 144, "terrible": 3, "excellent": 861}, "aka": "Best Western Plus Elm House Hotel Napa", "slim_ranking": 0.04, "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.5, "rooms": 4.5, "location": 4.5}}