{"user_rating": 4.0, "review_count": 312, "name": "BEST WESTERN PLUS Agate Beach Inn", "reviews": [{"rating": 5.0, "title": "Best Western at Agate Beach Restaurant", "text": "They have some of the best clam chowder in Newport! I have sampled many different chowders in Newport, Lincoln City, Depoe Bay, etc. and I like the chowder here over places like the Blackfish Cafe, the Chowderhouse, Mo's, and more.", "helpfulness": 2, "user": "Dwilliams76", "date": "July 27, 2005", "id": 3703183}, {"rating": 4.0, "stay_parameters": "Stayed May 2005, traveled on business", "text": "I stayed at this hotel while on business in Newport. I brought my teenage daughter along and she had a great time running around the hotel and beach all day while I was working. The staff was extremely friendly to her as well. The indoor pool was nice. The rooms were spacious and had a mini refrigerator and microwave. The oceanfront view rooms are well worth the extra money, as the view is great.", "title": "Excellent for Business or Pleasure", "helpfulness": 3, "user": "Josh97056", "date": "June 23, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 5.0}, "id": 3607364}, {"rating": 4.0, "stay_parameters": "Stayed June 2005", "text": "The only downside is the restauraunt is overpriced and the food is not that good, with the exception of breakfast which was great! Also the parking is a little inconvienent, but the rest of the hotel makes up for it.", "title": "Liked it a lot", "helpfulness": 4, "user": "denverflora", "date": "June 23, 2005", "detail_rating": {"cleanliness": 4.0, "rooms": 4.0, "value": 5.0}, "id": 3605806}, {"rating": 4.0, "title": "Very pleasant stay!", "text": "My husband and I were very happy with our stay here and absolutely would stay here again.", "helpfulness": 2, "user": "SierraMT", "date": "June 18, 2005", "id": 3574882}, {"rating": 2.0, "title": "Better to make reservations by phone", "text": "We arrived in Newport and I was immediately dismayed by the suburban style strip we drove along trying to find the hotel. Luckily, as others have mentioned, this hotel is north of the \"hub bub\" and sits nestled below Highway 101 on a hill above the beach. The setting is quite magical.", "helpfulness": 8, "user": "A TripAdvisor user", "date": "March 15, 2004", "id": 1726270}, {"rating": 4.0, "title": "Nice Stay", "text": "This hotel used to be run by Holiday Inn a few years ago but is now a Best Western. It's on the North end of Newport so it's away from the hustle and bustle of the downtown area. The beach access is great and the room was modest but in good shape. There is a nice indoor pool and sports bar as well as a restaurant and gift shop in the hotel. The only problem my family had was the rainy weather - no fault of the Best Western.", "helpfulness": 5, "user": "SpudChucker", "date": "January 25, 2004", "id": 1613448}, {"rating": 5.0, "title": "Great views of the beach right from the rooms", "text": "this hotel is great. great views, clean rooms,a cool bar and quick beach access make this the only hotel we stay at in newport.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "October 2, 2003", "id": 1373588}, {"rating": 2.0, "title": "Make sure you get it in writing...and keep a copy", "text": "First of all, if you make reservations by phone, make sure you keep copies of your confirmation number, dates of stay, room rates, and any coupons. The reason I say this, we \"upgraded\" our reservation from non-view to ocean view, and were given a confirmation number for the upgrade - before we made the trip.", "helpfulness": 15, "user": "A TripAdvisor user", "date": "August 25, 2003", "id": 1258923}, {"rating": 5.0, "title": "An awesome hotel and location", "text": "Second, be prepared for some \"less than hospitable\" greetings by some of the staff. It appears they are more than willing to take your credit card or cash, without even as much as a smile or a \"welcome\". This was compounded, when the shift supervisor at the front desk, the same one who was lacking in etiquette, announced to us that the rooms were non-view, and that all of the other rooms were booked for the weekend.", "helpfulness": 24, "user": "Spokane203", "date": "May 5, 2003", "id": 987791}], "location": {"country": "United States"}, "variance": {"poor": 30, "average": 48, "very good": 119, "terrible": 11, "excellent": 104}, "aka": "Best Western Plus Agate Beach Hotel Newport", "slim_ranking": 0.44, "description": "All of our rooms have been recently redecorated and new carpet as of 7/31/2013!"}