{"user_rating": 4.0, "review_count": 115, "name": "BEST WESTERN Hotel Cap Coz", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "This is a perfect hotel for an 'end of the summer' break--a fairly short drive through the stunning Brittany countryside to the peninsula of Cap Coz just south of Quimper. The Mona Lisa is a modern and welcoming hotel fronting directly onto a beautiful white beach with views across to Concarneau in one direction and the little port of Beg Meil in the other. Nearly all the other guests were French which ensured that the quality of the restaurant was superb and prices reasonable. We were pleased to have paid 10 euros a night extra for a balcony room fully equipped with table, chairs and loungers, a perfect place to sip wine and admire the beautiful views. We drove into the pretty village of Fouesnant for breakfast thinking that 11 euros was too much at the hotel but soon discovered that the current exchange rate results in these high prices everywhere, a small downside to our otherwise lovely and relaxing trip.", "title": "Lulled to sleep by the gentle sound of the sea", "helpfulness": 1, "user": "Snapshot", "date": "September 25, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 44376770}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "After visiting the lovely area of Quimper, we arrived at our Mona Lisa Hotel..The lady at check in very profesional told us that we had been upgraded to a front room with ocean view. GREAT!! . Everything was ok in the hotel ; clean and tidy , beautiful view, peaceful enviroment. Our room had a marine ambience ad_hoc with the athmospehre. Beds, sheets and pillows very confortable .. We slept very well. Breakfast was abundant and of very good quality. I would have enjoyed to stay more time in that place and would deffinetly go back.", "title": "Lovely place to stay", "helpfulness": 1, "user": "ceciliacastelli", "date": "August 25, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 38737788}, {"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "First of all, a lovely view! (if you manage to book a more expensive room with a sea view- those rooms with a so-called garden view face the parking or a narrow path leading to the sea).", "title": "Beautiful view on the bay", "helpfulness": 1, "user": "Itsybitsytraveller", "date": "July 23, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 3.0}, "id": 18166305, "likes": {"liked": "— the sea view", "disliked": "— the small room"}}], "location": {"country": "France", "region": "Brittany", "continent": "Europe"}, "stars": 3, "variance": {"poor": 13, "average": 26, "very good": 48, "terrible": 1, "excellent": 27}, "aka": "BEST WESTERN Hotel Cap Coz Fouesnant, France - Brittany", "slim_ranking": 0.625}