{"user_rating": 4.0, "review_count": 39, "name": "BEST WESTERN of Hartland", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed June 2007", "text": "Stayed here 1 night and was pleasantly surprised by the comfort of the bed, good price for a walk-in and quietness, even though it is located very near an expressway.", "title": "Nice place", "helpfulness": 1, "user": "Wise_One", "date": "June 14, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 3.0}, "id": 7849430}, {"rating": 3.0, "stay_parameters": "Stayed August 2011, traveled with friends", "text": "Pros: Bed was pretty comfy, good shower, a/c unit not too loud, convenient location right off freeway, pool open 24/7.", "title": "Your basic Motel", "user": "MIRay", "date": "September 12, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 4.0, "value": 3.0, "service": 3.0}, "id": 118021454}, {"rating": 3.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "Cons: No corridors - room door opens to outside, no elevator to 2nd floor, ice/vending in office building next door to actual motel rooms building.", "title": "Enough Beds but not real conducive to spending time in room", "user": "rotmeister", "date": "August 23, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 2.0, "service": 3.0}, "id": 117153990}, {"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "I had requested and reserved what I thought was a suite with two double beds and a king size bed. All the beds were in one room and there was two tv's. Made it difficult to watch two shows different shows at the same time. Hotel was clean. The continental breakfast was acceptable. The pool was open 24 hours. All in all it was a decent hotel.", "title": "Great Place to Stay", "helpfulness": 1, "user": "traveltourismxpert", "date": "March 31, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 27158142}, {"rating": 2.0, "stay_parameters": "Stayed October 2008", "text": "We stayed here while attending my cousin's wedding last summer. The desk staff was super friendly and accommodating. We had 4 rooms total for our group and they were all very clean and comfortable. They got our rooms all right next to each other which was perfect for visiting and relaxing during down-times. The breakfast was awesome, lots of choices for a free continental breakfast. I really enjoyed our time at this Best Western.", "title": "rude! rude! rude!", "helpfulness": 2, "user": "AMS_or_BUST", "date": "October 7, 2008", "detail_rating": {"front_desk": 1.0, "service": 2.0, "cleanliness": 2.0, "value": 2.0, "rooms": 2.0, "location": 2.0}, "id": 20694361, "likes": {"liked": "— Close to where we needed to be", "disliked": "— The (one) RUDE clerk and the INDIFFERENT management response to our situation"}}, {"rating": 2.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "The clerk accidently re-rented our room while we were out at dinner - we found out when our key didn't work when we got back. My husband was upset, but said, \"Mistakes happen...no problem\". While waiting on a new key, another customer overheard the clerk say, \"They walked in and right back out\" and he said, jokingly, \"Oh! So it was a prostitute!\" and we all laughed...except the clerk. When we got to our room and the key didn't work AGAIN, my husband went back to the office to have it fixed AGAIN. the clerk immediately says, \"Oh, your just being a [--] jerk because I accidently let someone in your room! It was NO BIG DEAL, but if you want to report me I don't give a [--] because I'm looking for another job anyway!\" We called the corporate office and they took a report, but NO follow-up call from the local manager or the corporate office! Just an \"I'm sorry - I was having a bad day...\" from the clerk would have been nice! Had this not been the only motel in this town (we were there for my son's wedding), we would have left!!! They did, however, loose revenue for 6 other rooms we were going to rent for the wedding party after the ceremony...instead, we paid to have them taken to a nearby city for the night. VERY POOR CUSTOMER SERVICE!!!", "title": "Not very accessible", "user": "PereMarquette1225", "date": "September 10, 2008", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 2.0, "rooms": 2.0, "location": 4.0}, "id": 19971806, "likes": {"liked": "— near to where we needed to be", "disliked": "— not really a handicapped room"}}], "location": {"country": "United States", "city": "Hartland"}, "stars": 2, "variance": {"poor": 4, "average": 6, "very good": 8, "terrible": 1, "excellent": 20}, "aka": "Best Western Hartland", "slim_ranking": 1.0}