{"user_rating": 4.5, "review_count": 154, "name": "BEST WESTERN PLUS Kansas City Airport-KCI East", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled solo", "text": "Check in was quick and friendly. Room and bath were very clean. Not a spot or dust anywhere. Small mini fridge and micro wave. Free airport shuttle. Free wifi, flat screen tv. Large very comfortable bed. Breakfast included, typical hot/cold breakfast that you find at most hotels these days. My hotel stay was prepaid, so there was nothing to pay upon check-out, when I checked in was asked for my credit card for incidentals, this I find acceptable, but I do not find it acceptable when the hotel puts a $100.00 hold on an over night stay. This is way to much, so be prepared for this high hold charge when you check-in.", "title": "Very very nice place to stay", "user": "yvr1", "date": "August 3, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 170623577}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "We stayed at Best Western Plus KCI East on our Midwest vacation. The hotel was very clean and appeared to have been remodeled because it seemed like new. Our room was excellent, king bed, microwave, refrigerator, desk, flat screen TV. The parking lot was convenient. The breakfast was excellent with many choices. However, there is not much in the area but a few other hotels. It is about a 10 minute drive of 5 miles to Zona Rosa area where there are shops and restaurants.", "title": "Like a New Hotel", "user": "SeniorTraveler65575", "date": "August 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 170512739}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "From the moment I walked in the door I was pleasantly surprised. Online the rate was excellent and the customer reviews and ratings were really good so I booked it. We enjoyed the hot breakfast and accommodations. I Highly recommend this hotel.", "title": "You will love the price and the stay!!!", "user": "Toi A", "date": "August 1, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 170384267}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "We were completely satisfied with our stay at this hotel. They handled our late check in with ease and the rooms were precisely what we requested. It was quiet and clean and there was a nice breakfast ready in the morning. We would happily stay there again.", "title": "Clean and convenient", "user": "AF_TanyaA", "date": "July 29, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 169836933}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "This is pretty much your standard Best Western Plus. They do have an indoor pool, however there is not a hot tub. Pool is not real large but seems to be well maintained. Hot breakfast in the morning includes the standard BW fare of sausage, sausage gravy, biscuits, scrambled eggs, and waffles. They also have cereal, pastries, bagels, etc. and hard boiled eggs. My room was a king bed with an easy chair/ottoman and desk. It all seemed to be in good condition - my desk chair was broken but they brought up a replacement right away. The night I stayed there were a bunch of little league teams there for a tournament so the common areas were not the quietest! However my room was pretty quiet, especially once all the players went to bed around 10. A 24 hour fitness center and business center are also available.", "title": "Comfortable Room", "user": "Chuck M", "date": "July 21, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 168429773}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "We arrived from Arkansas to this hotel it was clean the desk clerk Johnathan greeted us with a smile I am a real critic when it come to the beds but the beds in this hotel was wonderful!!! My only complaint was there was a baseball team there kids running around everywhere couldn't use the pool, fitness center or even get in to get breakfast in the morning they were very loud!! which this has nothing to do with the hotel..would stay here again.", "title": "GOOD HOTEL", "user": "rn7100", "date": "July 19, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 168193714}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "I got this hotel through Priceline and wasn't expecting much, but it surpassed my expectations. The desk clerk was very helpful and gave us dinner suggestions with directions. There were two computers in the business center which was useful. It was nice to have a refrigerator in the room.", "title": "Pleasantly surprised", "user": "kriszk", "date": "July 9, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 166969046}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "We had to leave to catch a flight about 5:45am and there was food out so we got to have a quick breakfast. I would stay there again.", "title": "Good Hotel", "user": "Rohit38771", "date": "July 8, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 166773891}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "This is my second stay at this hotel. I was impressed with the promptness and friendliness of the staff. Nice hotel. good staff. value for money. close to airport. decent breakfast. room size okay. enjoyed my second stay at this hotel. will continue to come back.", "title": "Very Nice Hotel", "user": "Barbara O", "date": "July 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 166269499}, {"rating": 4.0, "title": "Not bad...Good clean room", "text": "I am currently in this hotel, and have had nothing but a great experience. This hotel is very, very clean, my room is spotless and any area of the hotel I have been to is the same way. The breakfast in the morning was more than adequate for a hotel, hot food was more than enough. The customer service here is exceptional, from check in to the man that brought an extra blanket for my daughter to the room. The front desk staff are very friendly and welcoming. I would definitely stay here again and recommend it to anyone else.", "user": "K P", "date": "June 27, 2013", "id": 165501431}, {"rating": 3.0, "title": "Good Value", "text": "Stayed overnight before an early morning flight. Arrived late to a packed hotel but they held our guaranteed rooms and we did not get walked. This is a good choice for the price. Even late at night the staff was friendly. Bus to the airport was on time. Room was good but the HVAC ptac units in both rooms did not handle the heat from the day and a hot evening. That drops the grade from a 4 to a 3 for my review.", "user": "creloans", "date": "June 23, 2013", "id": 164934883}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "We had to fly out really early in the morning, so it was nice to have a place to stay the night before that was close to the airport. Wasn't woken up by planes during the night. The bed was a little too firm for my comfort, but it did the job. Would stay there again.", "title": "Nice hotel near airport", "user": "Brandy B", "date": "May 31, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 162575973}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "We chose this hotel because of its close proximity to airport and it worked out great. Room was very clean, bed was comfy, but what made it a winner was the early breakfast served. First hotel to have breakfast available at 3:30-4:00am for those flying out of KCI early in the morning. Only cereal, pastries, yogurt, nothing fancy but adequate. Will definitely keep this hotel in mind if early flight again.", "title": "Great hotel for early flight", "user": "mss09", "date": "May 31, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 162547890}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled with friends", "text": "Our baseball team stayed here and the staff was really nice - very clean rooms. The hotel is near the airport but did not hear the planes. The bed was firm and room had a fold out couch. We were amazed how clean the room was.", "title": "Nice Hotel for Team", "user": "131KathyC", "date": "May 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 162342702}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "We are a family of four that recently stayed here to visit other family in the area. We enjoyed our stay here, the hotel seems fairly new and is in very good shape. Upon check in the staff was very courteous and we were on our way to our room quickly. Pros: room was very clean and attractive, bathroom was great - lots of counter space (I love that), nice marble tile, great shower with tall shower head (I'm 6'4\"). Another commenter said there's no bathroom fan and they were correct although there is a vent directly above the shower head which I think serves that purpose, although the bathroom still can get a little steamy. Nice little microwave and fridge, new LG HD TV with remote that's apparently cleaned for each guest (haven't seen that before, interesting). We enjoyed the small pool although there was no hot tub which my wife was kind of hoping for. Breakfast bar was fairly good with the usual assortment of sausage, biscuits & gravy, belgian waffle maker, cereal, yogurt, fruit, milk, juices, and assorted muffins & danishes. No donuts. Cons: beds were OK, not great. Our main issue was that the main window in the room would not close completely (this was room 308), so all night we had to listen to the wind whistling through the small opening, which was annoying. However, I'm happy to point out that when I told the front desk about this the following morning the staff did not hesitate to switch us to another similar room, which we appreciated very much especially since this was Memorial Day weekend. Our new room had no window issues and we slept much better the following night. Did not use the wi-fi so I don't know how well it worked. Pool and business center areas are both pretty small and looked fine as long as there wasn't a crowd. Public areas were kept very clean during our stay. Overall a great hotel and I wouldn't hesitate in recommending it.", "title": "Nice hotel, fixed our only issue promptly", "helpfulness": 2, "user": "ChemSteve", "date": "May 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 162131456}, {"rating": 4.0, "title": "Good stay", "text": "This hotel is close to the airport. Well kept and comfortable. Beds were great. Was quiet. No fan in bathroom,strange for relatively new building. No restaurants close, need to go down freeway couple of exits for many choices. Have stayed in many hotels in this area...at this time this is the place...Great option -good quality and price for a place to sleep before an early flight.", "user": "61hawaii", "date": "May 26, 2013", "id": 161885683}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled solo", "text": "Great rate, convenient to airport, room in good condition. I didn't have a chance to try the breakfast, pool, or workout room, but I got a good night's sleep (I had a room on the third floor), and the staff seemed very pleasant.", "title": "Very nice hotel", "user": "Andrew W", "date": "May 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 161330664}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "Recently stayed at this hotel for a morning flight out of KCI. Hotel was a good value and very clean. Pros include a workout room, swimming pool, and proximity to airport. There is a hot breakfast, but I left too early to partake. There are great little trails around some ponds across the street from the hotel. Be aware there are not restaurants within walking distance, but some options for short drives. The hotel was very very noise. The breakfast area is setup in the lobby so the noise seems to echo throughout the entire lobby. The pool was also very noise and you could hear screaming of kids throughout the first floor corridors. Luckily I was on the third floor, however, I could hear people in other rooms and people in the hall clearly. Even worse was that there was no bathroom fan. I like to let it run to drown out the noise but this was not an option. Also, the bathroom gets incredibly hot and steamy without a fan. Also be aware that there was not hot tub, I guess I just assumed that with the pool there would be a hot tub but was disappointed to find there wasn't. Also, even though the hotel was not full, the workout room and pool appeared to always be full so never could utilize them. Despite these things, the service was impeccable and I was extremely impressed by all of the staff as well as the shuttle driver to the airport, but especially the gentleman who checked me in. This alone would make me stay here again if I'm ever flying out of KCI.", "title": "Good choice for flying out of KCI (MCI)", "helpfulness": 1, "user": "Zippy-zappy", "date": "May 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 161200106}, {"rating": 3.0, "stay_parameters": "Stayed May 2013, traveled with friends", "text": "When I showed up, the attendant barely said 2 words to me, not sure if he didn't want to be working, or what the deal was, but it felt a little awkward. Then I went to my room and was disappointed. The room was plenty nice, but due to a disability I asked in my reservation to please have a jacuzzi room, and I was willing to pay extra for it. Being a reward member, I thought they would try to accommodate or at least contact me if they were unable to. So seeing the room did not have a jacuzzi I called downstairs, and the same attendant barely said two words again, I asked what was the problem, were there no jacuzzis available?, and again the response \"no\". No explanation, nothing. I was disappointed because had they told me they couldn't accommodate this, I could have looked elsewhere, but I felt like they would just rather not tell you and you show up so they still get their money.", "title": "Not too bad!", "user": "NEHuskergal", "date": "May 19, 2013", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 4.0, "sleep": 2.0, "rooms": 4.0, "location": 4.0}, "id": 161138602}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "Other than this disappointment, the room was very nice for the price. Another reviewer mentioned it not being cool in the room, and i have to agree. The temperature went from too cold to too hot all night. Even though we had the temperature set, and the auto button pushed i woke up at least once an hour drenched in sweat. Then once the ac would kick back on i was freezing. So it seems they have trouble regulating the temperature. The waffles in the morning were delicious, although the breakfast area is very small, and there was a large group just sitting in there socializing - they were done eating- making it necessary for other guests to have to bring their food to their room. I realize this isn't the hotels fault, but when leaving we saw the area was still filled to capacity, so maybe a little larger area or a few tables would be great.", "title": "Convenient, clean and moderately priced", "helpfulness": 1, "user": "LangtoNic", "date": "May 13, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 160602395}], "location": {"country": "United States", "city": "Kansas City"}, "stars": 2.5, "variance": {"poor": 0, "average": 17, "very good": 49, "terrible": 1, "excellent": 87}, "aka": "Best Western Plus Kansas City Airport-Kci East Hotel Kansas City", "slim_ranking": 0.0810810810811}