{"user_rating": 4.0, "review_count": 278, "name": "BEST WESTERN PLUS Milwaukee Airport Hotel & Conference Ctr.", "reviews": [{"rating": 2.0, "title": "A dump", "text": "This place is a dump. The rooms are okay but on the ratty side. The pool area was fillthy: cracker crumbs and french fries on the floor, discarded fast food containers on the tables, wet towels on the chairs and puddles all over the place. The number of people in the hot tub was obviously exceeded yet no one from management did anything about it. The Brown Family reunion overran the place; huge kids making cannonballs into the pool without looking for others first. The bathroom and shower were filthy as well.", "helpfulness": 2, "user": "2bises", "date": "August 7, 2004", "id": 2428551}, {"rating": 5.0, "title": "Oh my gosh--wonderful!", "text": "Yuck!", "helpfulness": 1, "user": "A TripAdvisor user", "date": "June 3, 2004", "id": 2149365}, {"rating": 1.0, "stay_parameters": "Stayed January 2006", "text": "Don't be fooled by the pictures on their Web site. I thought the hotel looked nice, but after checking in I knew I was in trouble. Upon entering my room, there was a musty smell - a cross between bad feet and cheap cologne. The room was old and dingy and there were cobwebs in the corners. I asked for a new room and got one that was similar in smell and appearance. Ugh!", "title": "Dump... dee... dump... dump", "helpfulness": 2, "user": "Karch72", "date": "January 9, 2006", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "service": 1.0}, "id": 4333969}, {"rating": 2.0, "stay_parameters": "Stayed December 2005", "text": "I couldn't stand the thought of sleeping in the room, so I checked out and went to another hotel down the street. Same price, smaller room but much, much cleaner.", "title": "Pool was great...but....", "helpfulness": 3, "user": "mitaliano", "date": "December 9, 2005", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "service": 1.0}, "id": 4229275}, {"rating": 3.0, "stay_parameters": "Stayed April 2005", "text": "We enjoyed the pool but would not stay again based on room and amenities such as the free breakfast. Food was horrible, just grab some coffee and juice and go down the street to Denny's or even McDonald's for a better breakfast. Dinner at the restaurant there was very plain and not worth the price by a long shot. The room was not too good either, beds uncomfortable and the heat was on too high with no way to control it.", "title": "About What I Expected", "helpfulness": 3, "user": "CWhittaker", "date": "April 21, 2005", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "service": 3.0}, "id": 3396363}, {"rating": 2.0, "title": "Would never return to this hotel", "text": "This Hotel is Just what I had expected..an Average Hotel. Room was decent size 2 double beds..everything worked fine..Its a Best Western People..Its not going to be a Paradise at the Milwaukee Airport. You get what you pay for..For About 65 Bucks a night it was fine.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "September 1, 2004", "id": 2506541}, {"rating": 1.0, "title": "Horrible", "text": "The Pool was closed when we were there but we liked it better because it was quiet and peaceful while we sat around the pool. For families on a budget this hotel would work fine, kids would like the pool area ..it has video games pool tables ..etc..", "helpfulness": 2, "user": "A TripAdvisor user", "date": "August 19, 2004", "id": 2476813}], "location": {"country": "United States", "city": "Milwaukee"}, "stars": 3, "variance": {"poor": 19, "average": 37, "very good": 71, "terrible": 19, "excellent": 132}, "aka": "Best Western Plus Milwaukee Airport Hotel Milwaukee", "slim_ranking": 0.25}