{"user_rating": 3.5, "review_count": 567, "name": "BEST WESTERN Dublin Skylon Hotel", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled on business", "text": "Although the hotel itself is a bit of a run of the mill Best Western, the staff more than make up for any shortcomings with their friendliness and helpfullness. The rooms are pretty standard, but the beds are large and comfortable. I was on the front of the hotel, and the windows do not well insulate the room from the noise of the busy road outside. The traffic started early, around 06:00 and the rumble was quite significant. A good Irish breakfast is provided, once again by friendly staff, so as to get off to a good start to the day. Would come back!", "title": "Very friendly and helpful staff", "user": "BraddyBarcelona", "date": "July 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 166255749}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "Don't normally bother with reviews, but just had to this time!", "title": "Fantastic!!", "helpfulness": 1, "user": "Dawn M", "date": "July 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 166187946}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled with friends", "text": "My sister & I absolutely loved our stay here.", "title": "Pleasant hotel and Staff. Good value for money.", "helpfulness": 1, "user": "AshSmash1980", "date": "July 1, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 165861129}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "Spotless rooms, (spotless everywhere!) great, great staff - what a lovely team! They are so helpful & great fun, nothing is too much trouble.", "title": "Very enjoyable stay, food excellent and staff couldn't be more helpful", "helpfulness": 1, "user": "BiddyDoherty", "date": "June 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 165405744}, {"rating": 4.0, "stay_parameters": "Stayed June 2013", "text": "Fantastic breakfast (seriously good)& great food in the bar. Really nice, friendly atmosphere a proper home from home.", "title": "Greath staff", "helpfulness": 1, "user": "Claremoun", "date": "June 25, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 165244484}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled with friends", "text": "Stayed here for part of a hen group, booked last minute as our flight to magaluf was cancelled due to French air strike.", "title": "Great Stay - staff excellent", "helpfulness": 2, "user": "niknak89", "date": "June 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 164579967}, {"rating": 3.0, "stay_parameters": "Stayed June 2013, traveled solo", "text": "From get go hotel staff could not be more accommodating. The bar manager arranged for us all to receive a complimentary cocktail after lunch because it was a hen. Food was lovely we ate lunch and dinner in the hotel and reasonably priced also.", "title": "Good location, welcoming staff, skip the bistro and iron at home.", "helpfulness": 2, "user": "Foodlover0769", "date": "June 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 164219977}, {"rating": 3.0, "stay_parameters": "Stayed June 2013, traveled on business", "text": "Location isn't bad - there is a bus service that runs into the city centre but its only a 5/10 minute taxi ride.", "title": "Decent Hotel", "helpfulness": 1, "user": "royal999", "date": "June 15, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 4.0}, "id": 164029858}, {"rating": 5.0, "stay_parameters": "Stayed June 2013", "text": "We had a fantastic 2 nights in this hotel and if returning to Dublin would consider staying here again.", "title": "Wonderful!", "helpfulness": 1, "user": "joanne-mb01", "date": "June 14, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 163949426}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "This is a good value, well located hotel on Dublins Northside with lots of places to eat around and about. Check in was pleasant and the receptionist bantered with the guests in front of me, who were English and extended a warm welcome to them. I had to work the following day and was worried about the front facing room being too loud. The hotel was too busy to change room but a very nice friendly receptionist assured me the noise would die down and it did. The food from the bistro - I had crab cakes - was awful, though cheap - very disappointing. But there was a trio of Irish musicians who played and brought the whole place to life. The ironing board I was given had very little padding and left a pattern from the underlying metal grid on my outfit - not a good look! I slept well, breakfast was good and check-out was painless. I probably won't go back because of the iron and the crab cakes but it wasn't the worst hotel - a little bit of effort from management and the Bistro and it could be a hidden gem!", "title": "Excellent staff and location", "helpfulness": 1, "user": "Jackmccw", "date": "June 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 2.0, "location": 5.0}, "id": 163905189}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "Let me say first of all that we knew nothing about this hotel as it was booked for 2 nights as a short break through a special deal with booking.com. It turned out to be a most pleasant and exceptional experience.", "title": "A Warm Irish Welcome", "helpfulness": 2, "user": "Guerndonkey", "date": "June 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 163718540}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled with friends", "text": "We arrived early and was greeted and duly checked in by Aoife the Irish Receptionist. We were immediately made to feel special as she was friendly and welcoming to us and nothing was of too much trouble to her.", "title": "Diamond in the rough?", "helpfulness": 1, "user": "KenmareLisa", "date": "June 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 163626772}, {"rating": 4.0, "stay_parameters": "Stayed June 2013", "text": "Our room was 410 facing the front main road but in difference to the last Reviewer from USA we were not at all bothered by traffic noise, due probably to the double glazing. However, the wall between the bed rooms seemed to be on the thin side, as my poor partner was kept awake by the sound of the person next door snoring. The room itself was comfortable and clean with a good supply of tea/coffee etc. We did initially have a problem with the bath cold tap, but that was fixed immediately on reporting to Aoife in the Reception.", "title": "Excellent hotel for the price definitely would return", "helpfulness": 1, "user": "Melissa-fawcett", "date": "June 9, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 163498118}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled with friends", "text": "We enjoyed having the Sunday roast carvery. The roast beef and even the gravy was superb, but spoiled by the lack of Yorkshire Pudding and the use of frozen roast potatoes. I particularly enjoyed the pint of Guinness served in the Bar which was perfectly poured. Breakfast was plentiful and the staff serving on both days were friendly and cheerful. Unfortunately on the first morning the bacon turned out to be hard due probably to reheating. That was rectified satisfactorily on the second day.", "title": "Enjoyable stay", "user": "DonegalBuddy", "date": "June 5, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 163116778}, {"rating": 4.0, "stay_parameters": "Stayed June 2013", "text": "The hotel is conveniently situated half way between the Airport and Dublin city centre with frequent bus service in both directions.", "title": "Great airport hotel", "user": "LucieCork", "date": "June 4, 2013", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 162999392}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "Once again we had a very relaxing stay at the Skylon for 2 nights from the moment we arrived, check in was pleasant & friendly, fantastic breakfast. Only disadvantage was that we couldn't stay any longer. We will be back!", "title": "Great return visit!", "helpfulness": 1, "user": "Jo D", "date": "June 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 162774602}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "Stayed here from 25th-29th May little leisure break, not far into town we just got a bus. The drivers will tell you where to get off if you ask them, few nice pubs locally, telco metro over the road etc. we had the breakfast twice well worth it for ten euro, everything you could want and cooked on request. Just had a snack at the bar couple of times it's average. Bar staff lovely and Male receptionists great, ladies on the desk however very patronising and usually gave wrong information. Overall hotel room clean and comfy, oh if your from Liverpool they either love you or hate you! Prepare to be ignored completely by some staff in this hotel particularly the elderly gent bringing snacks and drinks....quite funny actually. Overall would recommend.", "title": "Nice hotel", "user": "JillLiverpoolUK", "date": "June 2, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 162702224}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "My overall stay at the Skylon was excellent, the staff were very friendly, made us all feel very welcome, the service was excellent. the rooms were lovely, just an overall fantastic time. Thankyou very much to all the staff at the Skylon.for making are stay very enjoyable.", "title": "My stay at the Skylon, Dublin.", "helpfulness": 1, "user": "Catherine B", "date": "May 31, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 162498960}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "17of us stayed at the skylon hotel in dublin in a variety of different rooms we were looked after by the friendly staff superbly nothing was too much trouble. It was located on the main road which leads you in to the city centre .it was a 25min walk or a10min bus ride we did both, the bus stop right outside the hotel was so handy. The rooms were lovely everyone was happy with there rooms the breakfast was good lots of choices. The deli across the road was great for sandwiches as we all went to the zoo one day. Well worth the visit . Free wifi kept the kids happy. All in all a great experience at the skylon.", "title": "Great holiday in dublin", "user": "Mary L", "date": "May 30, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 162388837}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled solo", "text": "Stayed here as its a Brian McEniff Hotel, and I am a frequent visitor of The Great Northern in Bundoran, I needed somewhere close to the airport and bus links as I don't drive. This hotel was spot on. Check in was prompt and professional. I was given directions to room and found it no problem. Room was spacious and clean, bed was comfortable and I had a good nights sleep. Breakfast was great and set me up for the day. Would stay again if visiting Dublin, it was ideal as on over nighter.", "title": "Perfect Location", "user": "anne f", "date": "May 29, 2013", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "location": 4.0, "service": 3.0, "rooms": 4.0}, "id": 162345230}], "location": {"country": "Ireland", "continent": "Europe"}, "stars": 3, "variance": {"poor": 63, "average": 104, "very good": 160, "terrible": 68, "excellent": 172}, "aka": "Skylon Hotel Dublin", "slim_ranking": 0.351955307263, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.5, "location": 4.0}, "description": "Modern, luxurious hotel with free Wi-Fi throughout. The hotel is located ten minutes from Dublin International Airport and five minutes from Dublin City Centre. The hotel operates an aiport shuttle bus which is €3 each way and a shuttle service to the O2 and Aviva Stadium. Croke Park Stadium is within walking distance. The Skylon Restaurant serves breakfast from 7.00am and dinner is available with the Pre-Theatre menu from 5.30pm. The Skylon Bar & Grill serves food from 12pm to 9.30pm and features great live music. Owned and operated by the Mc Eniff family guests at the Skylon Hotel can expect the very best of Irish hospitality."}