{"user_rating": 3.0, "review_count": 103, "name": "BEST WESTERN Envoy Inn", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed October 2011, traveled on business", "text": "Came here for a convention, elected to stay at Best Western Envoy bc of location to Civic Center, Board Walk, etc. Poor experience. Hotel smelled old and musty, and it reeked of cigarette smoke. Bed was sunken, uncomfortable. Fought the sheets all night long....The mattress cover and fitted sheet LITERALLY came off if you turned over one time. We woke up several times to re-make the bed. Cancelled our third night and was refunded $195. Went to Best Western Extended Stay in Pleasantville, about 10 miles away, and had a wonderful experience. Clean. Spacious room. Comfortable bed. Saved $80!", "title": "Best Western Envoy in Atlantic City", "helpfulness": 1, "user": "Mitzi A", "date": "October 23, 2011", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 1.0, "sleep": 1.0, "rooms": 2.0, "location": 4.0}, "id": 119639572}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled with friends", "text": "Came here with a group of friends, one night during Labor Day weekend 2011. As expected, the going rate for rooms at the casinos was anywhere from 400-500 dollars - not very budget friendly. After scouring through Tripadvisor reviews and various travel websites, we elected to stay at this Best Western for about $200 (taxes inc, special Automotive Association rate).", "title": "Very pleasantly surprised", "helpfulness": 3, "user": "shadowsjc", "date": "September 6, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 5.0, "service": 4.0}, "id": 117768393}, {"rating": 3.0, "stay_parameters": "Stayed August 2011, traveled with friends", "text": "Outside:", "title": "Generic at its best", "helpfulness": 1, "user": "KKua", "date": "August 13, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 5.0, "value": 3.0, "service": 3.0}, "id": 116683968}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "The hotel has a couple of parking lots (some covered, some outdoors), and parking is included with the hotel stay. The lobby is fairly small, but clean. I noticed a computer in the lobby that seemed to be for guests' usage, although I did not use it.", "title": "Great Value for the boardwalk", "helpfulness": 2, "user": "caribseabreeze", "date": "August 1, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 5.0, "service": 4.0}, "id": 116134276}, {"rating": 2.0, "stay_parameters": "Stayed July 2011, traveled with friends", "text": "I noticed some reviews stating that it is in a \"run -down\" section of the town. As someone who has been to Atlantic City many times, I can attest that it is not in a \"run down\" section (for proof, travel a few blocks west of the Boardwalk to see what the actual \"run down\" sections are). The hotel is a few blocks from both Bally's and Trump Taj (right in the middle of them), and while the immediate surroundings aren't luxurious (it's about average for Atlantic City), it's not in a crime ridden block either.", "title": "Wished I stayed somewhere else", "user": "travelaround_8", "date": "July 30, 2011", "detail_rating": {"cleanliness": 2.0, "sleep": 3.0, "value": 2.0, "service": 3.0}, "id": 116029541}, {"rating": 3.0, "title": "Very friendly service", "text": "Hotel was a great deal for the money. Our family likes to stay in Best Westerns if we can when we travel. The Envoy staff was so friendly and always making sure we have everything we need. We traveled to see the ocean with our kids 11 and 6, and I heard no complaints out of anyone. The neighborhood seemed a little dicey and the rooms are a little older otherwise I would have gave this hotel an excellent. While we were there we could tell that the staff was continuesly making improvements to the premises. Because of other posts we looked for bed bugs and we had none in our room. If we every came to AC again we would stay here again in hopes that the same staff is still here.", "helpfulness": 2, "user": "Julie B", "date": "June 28, 2012", "id": 132999210}, {"rating": 3.0, "stay_parameters": "Stayed June 2012", "text": "We stayed at this hotel for a long weekend while our favorite band was in town. Upon our arrival we realized we weren't in a very good part of the city. The parking lot around back seems a litle unsafe, I wouldn't park there. Friday night there were a bunch of possibly homeless people and other unsavory characters around. On Saturday morning we were awaken by the hotel phone and the woman on the other end of the phone said she was from the front desk and something happened with the computers, she wanted us to provide her with information. I responded with \"that is fine, but I can't do this right now\" and hung up the phone. When asking the front desk about this later they said I wasn't them and another guest was complaining about it as well. The front desk wasn't very helpful and didn't deal with the situation. We have to assume that the woman on the phone was staying at the hotel too. The moral of this story is don't stay here and don't EVER give your information out over the phone without double checking!", "title": "Wake up call at 9am", "helpfulness": 1, "user": "Travelhappy1980", "date": "June 17, 2012", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 2.0, "service": 3.0, "rooms": 3.0}, "id": 132163190}, {"rating": 3.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "We stayed here for 2 nights on a weekend in May, 2012. First, the good...great value for the price of this room to stay off the boardwalk. It is actually about a three-block walk from the boardwalk. Centrally located. Staff was extremely friendly and nice. Room was clean and comfortable. We stayed on the first floor to avoid the elevator/stairs. 7-11 is right next door to the hotel and this was pretty convenient for a few things.", "title": "Some good, some bad.", "helpfulness": 4, "user": "Angela L", "date": "May 29, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 2.0, "rooms": 3.0, "location": 3.0}, "id": 130871720}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "Now, the bad...because we stayed on the first floor, our door was bordering the hotel parking lot, and we could hear all of the street noise and everyone's conversation that passed by, Unfortunately, throughout the night, those conversations woke us up a few times. The Continental breakfast, which was very basic, was included, but the coffee machine was out of order. 7-11 was good for that.", "title": "Nice Hotel Close to the Marathon Start and Finish", "helpfulness": 1, "user": "marathonjk", "date": "April 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 127667314}, {"rating": 3.0, "stay_parameters": "Stayed March 2012", "text": "Since this was our first trip to Atlantic City, my advice would be...spend the extra money to stay at one of the 11 casinos on the Boardwalk because that's what I'm going to do next time. The Boardwalk was great for walking, going to the beach, eating, and buying souveneirs, but once you go off of it, the city is not pretty. There are all kinds of down-on-your-luck types all over the place.", "title": "Stay somewhere else", "user": "Jax20fl", "date": "March 10, 2012", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "location": 3.0, "service": 4.0, "rooms": 2.0}, "id": 125907038}, {"rating": 1.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "I stayed at the Envoy Inn in August and not only did I find bed bugs in my room (which I put one in a cup and took to the front desk) but I also ended up finding them in my car on the way home. My girlfriend and I both had red welts on our legs from them biting. I ended up paying almost $90 to clean out my car, clean everything that was in the hotel room and for a mattress protector to make sure that I didn't infest my home with the bugs. I first tried to contact the hotel about the issue in September, and they directed me to Priceline, through which I booked my hotel. Priceline informed me then that the hotel manager would be the one to refund me and that they had to speak with them. Priceline left several messages on the answering machine for the manager over a period of 4 and a half months. Finally today, I called the hotel and got ahold of this manager. He was EXTREMELY rude to me, questioning why I was just now calling, as if Priceline and myself hadn't called already, and then told me he would refund me $50. I have to say this was the BIGGEST waste of money and time. I would have rather slept in my car, or better yet, not even gone on vacation for all the hastle that I dealt with. It was the worst vacation ever.", "title": "bed bugs and a horrible manager!", "helpfulness": 5, "user": "amber j", "date": "February 23, 2012", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 2.0, "rooms": 1.0, "location": 3.0}, "id": 125101172}, {"rating": 3.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "We took a trip to Atlantic City this past weekend. 2/17 - 2/20. We stayed at thie Best Western on the strip because it was alot cheaper then staying in the casino hotels. While reading this review keep in mind AC isn't the cleanest / nicest of places as it is. The hotel is just about in the middle of the strip. It's a few blocks walk to the Taj Mahal, Showboat, Mardi Gras casinos but not bad at all. There is a Jitney stop right outside hotel which makes it easy to get anywhere you want. The rooms was clean, just a little outdated. People were nice and the parking was free. The breakfast was just what we needed in the morning. Cereal, coffee, fruit, waffles, bagels, etc. The hotel was a place for us to sleep, other then that we were out and about. Great choice for a group of guys / girls going down to have a good time and not spend an arm and a leg on the hotel. Overall - average hotel", "title": "Valentine's Day trip to Atlantic City", "helpfulness": 2, "user": "Majestic500", "date": "February 20, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 124928904}, {"rating": 2.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "This BW needs a update!!!! I stayed at the BW in Minnesota last week so I knew that they all have to be a 10. Nope, the beds are HARD!. Had to ask for more linen cause the ones in room had someone elses hair on it. (We recieved them quickly). Linen needs to be replaced no fluff. Cigarette hole in top comforter. I was sitting on foot of bed boyfriend came and sat next to me and top of bed moved. The continental breaksfast was fair only Lipton tea available. Will not be staying there again. Pictures on site must have been taken when BW first opened picture of front desk and there's a tv, on the screen is the security system of building. Do I want to see that as a customer?", "title": "Never again", "user": "mmws0218", "date": "January 18, 2012", "detail_rating": {"service": 2.0, "cleanliness": 1.0, "value": 2.0, "sleep": 1.0, "rooms": 2.0, "location": 2.0}, "id": 123279772}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "I do have to say that the staff was friendly.", "title": "VERY NICE", "user": "lorri c", "date": "November 29, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121216660}, {"rating": 3.0, "stay_parameters": "Stayed October 2011", "text": "we stayed here one night june 2011, it was a nice place to stay. clean rooms all the staff was friendly. other reviews say dont go out at night but we had no problems going out at night, walked to casino at midnight, no one bothered us. very nice place to stay.", "title": "Everything you heard it was, but not as bad as you think!!!", "helpfulness": 13, "user": "Shawn L", "date": "October 25, 2011", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 3.0, "rooms": 3.0}, "id": 119710518}, {"rating": 3.0, "stay_parameters": "Stayed October 2012", "text": "The hotel staff were helpful", "title": "Not a good area", "user": "moodycow", "date": "October 19, 2012", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 2.0, "service": 4.0, "rooms": 3.0}, "id": 143197801}, {"rating": 2.0, "stay_parameters": "Stayed August 2012, traveled on business", "text": "The first room smelt of damp and no wifi", "title": "Outdated and dingy", "helpfulness": 1, "user": "Bernie C", "date": "August 18, 2012", "detail_rating": {"service": 2.0, "cleanliness": 1.0, "value": 1.0, "sleep": 2.0, "rooms": 1.0, "location": 3.0}, "id": 137588462}, {"rating": 1.0, "stay_parameters": "Stayed July 2012, traveled on business", "text": "The second was fine. Nice size.", "title": "DANGEROUS / LOW CLASS", "helpfulness": 2, "user": "Honest_Mark1140", "date": "August 17, 2012", "detail_rating": {"service": 4.0, "cleanliness": 2.0, "value": 3.0, "sleep": 2.0, "rooms": 2.0, "location": 1.0}, "id": 137461243}, {"rating": 1.0, "title": "No way!", "text": "Was breakfast is included but basic", "helpfulness": 2, "user": "Quintersfamily", "date": "August 8, 2012", "id": 136667021}, {"rating": 2.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "Free parking we were there mid week so very quite", "title": "Never Again", "helpfulness": 1, "user": "Julie C", "date": "July 11, 2012", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 2.0, "sleep": 2.0, "rooms": 2.0, "location": 3.0}, "id": 134097828}], "location": {"country": "United States"}, "stars": 2, "variance": {"poor": 15, "average": 34, "very good": 26, "terrible": 11, "excellent": 17}, "aka": "Best Western Envoy Hotel Atlantic City", "slim_ranking": 0.283333333333}