{"user_rating": 4.0, "review_count": 608, "name": "BEST WESTERN PLUS Hacienda Hotel Old Town", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "Second time we have stayed here and we love it. Convenient for restaurants, bars and trolley which takes you all over San Diego. Room a bit out of the way (up 6 flits of stairs) but fitter when we left! Pool area lovely and access to old town spot on.", "title": "Great location!", "helpfulness": 1, "user": "Kerzy", "date": "August 22, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117092962}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "We hosted a reunion at this resort hotel with relatives from multiple familes for several nights. The hotel is in Old Town with access to the trolley system for visiting other areas of San Diego. The rooms are nicely furnished with all of the amenities. The on premise restaurant called the Acapuco has a nice breakfast (included in the price) and parking was plentiful although $12 per night. The grounds are very nicely landscaped and well maintained with a tropical atmosphere. Old Town and the historical Old Town state park are right next door where many shops and restaurants are olcated.The only drawback for the resort was the Plaza Level rooms were next to the conference hall where a wedding party stayed up until 2:00 AM keeping some of our guests awake.", "title": "Great Location", "helpfulness": 1, "user": "Visitor91931", "date": "August 12, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 3.0, "value": 5.0, "service": 5.0}, "id": 116609649}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "Be prepared to pay $12 a day for parking, %5. a day for 2 small bottles of water, and climb A LOT of stairs every day getting back and forth.", "title": "Perfect location, beautiful hotel", "helpfulness": 1, "user": "WantToSeeItAll", "date": "August 8, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 3.0, "value": 2.0, "service": 3.0}, "id": 116427988}, {"rating": 5.0, "stay_parameters": "Stayed July 2011", "text": "Other than that, I loved the place. Within walking distance of Old Town.", "title": "Great location", "helpfulness": 1, "user": "Densonfrnc", "date": "August 4, 2011", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 116272731}, {"rating": 3.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "Very nice rooms updated and clean. Nice pool area. The property is spread out over a large area do be prepared for a little walk. A bit confusing they way it's set up. Pool very nice. Room service very limited for kids easy walking to old town", "title": "GOOD LOCATION", "helpfulness": 1, "user": "drewantha", "date": "July 30, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 3.0, "service": 3.0}, "id": 116033882}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "My husband and I stayed for the second time at the Best Western Hacienda Hotel in Old Town, San Diego for a quick weekend getaway. We had such a great time...we are loyal customers to this hotel. The staff is very friendly, and the location is ideal. It's so great to be able to just park your car once, and be within walking distance to Old Town, with lots of shopping and restaurants like Fred's. We had a gorgeous view, with a perfect room with a nice balcony, overlooking the pool. It's a nice, quiet hotel, even while being over the pool! The decor is nice, and the lack of noise was amazing. Even with a wedding reception going on below, we still slept great!", "title": "Gorgeous hotel, perfect location...best kept secret!", "user": "Karen F", "date": "July 23, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 35582283}, {"rating": 3.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "A decade ago we spent several nights each year at this charming hotel. It was one of our most favorite places to stay, and even though it was above our budget we always found the money to indulge in the delights of this lovely hotel. We returned to San Diego recently after having not been in the town for more than ten years. We know that ten years is a long time in the life of a hotel, but we made reservations hoping things had not changed for the worse.", "title": "Not Quite As Good As We Remembered", "helpfulness": 2, "user": "Busy-retired", "date": "July 14, 2009", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 4.0, "service": 3.0, "rooms": 3.0}, "id": 34794959}, {"rating": 3.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "The good news: The hotel has attempted to keep up with the times by adding small refrigerators and microwaves as well as internet access. Drapes and spreads were fairly up-to-date, and the old Spanish-style furniture still looked good. Our room was fairly large, with a decent-sized bathroom. Service is still a high-priority. A problem in the bathroom was fixed within minutes of our report.", "title": "Beautiful hotel, not so nice staff", "user": "artbird88", "date": "July 9, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 3.0, "rooms": 4.0}, "id": 34284395}, {"rating": 1.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "The bad news: Internet access is via cable so only one of us could work on a computer, which was a huge inconvenience for us. We were surprised that wireless was not available. In the past our rooms were always located under shady roofs surrounded by luxurious bougainvillea, over-looking interesting little gardens. This year we were placed in a building that overlooked a parking lot which did not even belong to the hotel. No special feelings from this view unless you want to compare it to a motor court of the 1950's. The absolutely fantastic restaurant in the hotel is under different management and a new menu and we will probably never taste lime-roasted chicken again. What a pity!", "title": "Aggressive manager", "helpfulness": 3, "user": "deannamg", "date": "July 6, 2009", "detail_rating": {"cleanliness": 4.0, "location": 4.0, "service": 1.0}, "id": 34042864}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "The first quoted price of $159/night would have been totally outrageous for this hotel, even though it does enjoy a good location. Our negotiated price of $120/night was still excessive for what we received.", "title": "GREAT VALUE!!", "user": "LongDuckDong", "date": "June 21, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 32839265}, {"rating": 2.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "My family and I have stayed here several times before since we always enjoyed our rooms and the service, but this time when I went with my boyfriend the hotel staff was terrible!", "title": "Best location in Old Town. Beautiful hotel but rude and unpleasant staff", "helpfulness": 1, "user": "HapaKLM", "date": "February 21, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 1.0, "rooms": 2.0}, "id": 24899743}, {"rating": 2.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "I put in a request when I first reserved our room for a certain room that my folks and I used to stay in. I was told there was no guarantees that I'd get that room (which was fine) but they'd be as accommodating as they could to give me a similar room. When my boyfriend and I went to check in the woman staff member that helped us was already unfriendly. She didn't seem like she knew what she was doing. She assigned us a room without looking at the special request I put in and when I mentioned my request she then stated that \"someone, not her accidentally gave that room away that day.\" If she simply said that room wasn't available I'd be fine, but \"accidentally\" gave it away doesn't sound right to me. I then asked if I could get a similar room to what I originally requested and so she booked my boyfriend and me into room 411. Do not stay in that room! It has to be one of the worst rooms on the property.", "title": "great location, poor service", "helpfulness": 1, "user": "haru2", "date": "February 18, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 1.0, "rooms": 4.0}, "id": 24704346}, {"rating": 4.0, "stay_parameters": "Stayed July 2008", "text": "When we got to the room we were very surprised. Walls were paper thin (could hear the neighbors the whole time), extremely small and has absolutely no view. I felt like we got downgraded from what we were originally supposed to have. We were paying 139 a night plus $12 dollars parking so we most certainly were not happy with this tiny room. When my boyfriend and I went back downstairs to request another room the manager came out and assured us that all the rooms were similar in size.", "title": "Very nice hotel, good location", "user": "superstarintheworld", "date": "December 8, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 22539950}, {"rating": 1.0, "stay_parameters": "Stayed November 2008, traveled with family", "text": "The manager and his employees need to actually go through all the rooms on the property to see how very different they all are. Very unprofessional of them to say the rooms are all similar in size. By his definition, similar most definitely sucked.", "title": "Haunted Hotel Room", "helpfulness": 1, "user": "RockyHarada", "date": "November 16, 2008", "detail_rating": {"front_desk": 2.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 2.0, "location": 5.0, "rooms": 2.0}, "id": 21916201, "likes": {"liked": "— Location", "disliked": "— Haunted room"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled solo", "text": "Since I have stayed at this hotel several times I know this not to be true. That is, the rooms are not all similar in size. Of the rooms I know I've stayed in is 403 and 407. Those rooms are both much much bigger than 411 and we paid much less for those rooms! What makes those rooms better is they have high ceilings, two full size beds (I believe they're full size and not queen), one fold out couch and a sitting area/patio right outside the room to enjoy a gorgeous San Diego sunset/sunrise and other views. I know my family has also stayed in the buildings higher up the hill which had similar layouts.", "title": "Great Location,Great Hotel,Beautiful City", "user": "the_gamekeeper", "date": "October 21, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 21071040, "likes": {"liked": "— Clean Spacious rooms.Lovely well maintained hotel,great location", "disliked": "— Nothing really"}}, {"rating": 3.0, "title": "Hit or miss service - lumpy pillows - brown 1970s decor", "text": "Let's start with the pros: nice airport shuttle service and great driver from Brazil, good location if you want to explore Old Town, they gave me (eventually) a voucher for free breakfast+free dinner+two free drinks. My last day there, I also had (finally) some pleasant interaction with the staff.", "user": "sd_in_switzerland", "date": "January 29, 2013", "id": 150966533}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "Cons, however, abound. Upon entering the room, I was repeatedly struck by how dated the furnishings were. Tables, couches, bath, toilet all from the 1970s. Many of the wooden materials (i.e. arguably 'hacienda style') were scratched and made me feel like they were bought from a garage sale. The bed was hard, but as I like that, so it worked well for me -- but I doubt it would work for everyone. The pillows (there were four) were incredibly lumpy and it was a real effort to find something that could work.", "title": "Upper class resort feel with motel prices!", "user": "TL-StacyNelson", "date": "January 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 150929004}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "There were also a few service incidents that surprised me. First, the maid service didn't come until close to 4pm, which was useless for me as I had to get ready for an event then. Second, after I checked in, the front desk called me to tell me they'd forgotten to give me my meal vouchers; but as I was going to bed I told them I'd pick them up in the morning. When I went to collect them in the morning, the front desk was surprised and treated me a bit like I was lying. But perhaps it was because of the next incident I am about to relay that happened immediately before I asked for the vouchers. Third, there was a customer immediately in front of me who was checking out, and there was some sort of a disagreement with the management. The line I heard him say was, \"I understand your position but I do not agree with it.\" As he was leaving, the woman at the front desk called him a \"jerk\". Wow. I was shocked. I can appreciate that you do not always like your customers, but please -- learn to hold your tongue. It's not professional to actually insult your customers verbally in front of other customers.", "title": "Nice Location for San Diego", "user": "lujunk", "date": "January 25, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 150592302}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled solo", "text": "A note on the gym. The equipment is nice. There isn't that much of it, so consider getting in early. But not too early. When I went at 6am (when it opens), it was actually closed. They were good about immediately sending a security guard to sort things out.", "title": "Charming and comfortable!", "user": "GBS630", "date": "January 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 150369793}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "As a last point, I've seen other reviews commenting about the stairs. Please take this point seriously. If you don't like stairs, beware. There are a lot of them; and in a way that I have never experienced at another hotel that I've ever stayed at. Good thing I like stairs. Just not with bags. One morning I saw an older couple on the third level really struggling to get down.", "title": "Perfect Location While in Old Town", "user": "MilMascaras", "date": "January 23, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 150367369}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled with friends", "text": "I stayed here for a night with a friend as a stop over. We found the hotel to be lovely. The gardens were really pretty and the rooms were large and very nicely decorated. We got to the hotel a bit early when we checked in, but they stored our bags for us.", "title": "Lovely stay", "helpfulness": 2, "user": "DM85", "date": "July 30, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 4.0}, "id": 116018197}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "The location of the hotel was very good as well. At the bottom of the street were bars and restaurants. The first bar at the bottom of the street did nice drinks (alcoholic slushie type drinks were our faves). If you went through the car park opposite the hotel it led straight to the Old Town Historic Park which was nice and also had some great places to drink/ eat.", "title": "nice hotel, very convenient", "helpfulness": 1, "user": "Gillette18041", "date": "July 30, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 4.0}, "id": 116001768}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "The train station was only 5/10 mins walk away too which was handy as we were travelling by train (the train from San Diego to LA was a really beautiful trip).", "title": "So glad we went by other reviewers and not my daughters advice", "helpfulness": 3, "user": "JoeHanley18", "date": "July 29, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115975519}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "All in all we had a great stay at this hotel. The area was really nice and we only wished we had longer to sample San Diego and the food and drink.", "title": "Perfect San Diego hotel", "helpfulness": 3, "user": "ABH57", "date": "July 29, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115970444}, {"rating": 4.0, "title": "Great location in Old Town, fabulous room, \"Just OK\" customer service", "text": "I usually dislike Best Westerns but this was a pleasant surprise. Good value.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "July 28, 2011", "id": 115901264}, {"rating": 3.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "thought it was a gorgeous hotel and loved the way the rooms looked, ie. decor, comfort of bed, bathrooms, television, etc. In that it exceeded my expectations. I also really loved the pick up service at the airport. That was so helpful. I was at the hotel for a wedding and had two seperate reservations for two days each with a night in between where I stayed elsewhere. But a few problems to note, 1. Our room was not ready in time for check in. It took a few hours to find us a room. However when we did get the room it was beautiful so there is that. 2. We had to cancel one night of our second reservation. I understand that you have a 48 hour policy but it was not posted anywhere. I notified the hotel within 24 hours and they rebooked the room with another guest but still I was charged the full amount of the stay. I felt that this was slightly unethical since the hotel recouped the money twice. 3. While most of the staff that I dealt with was very friendly even when I was voicing a complaint about the above two issues. When I did check in the second time at night (around 12:30 am) there was a staff member who had a bit of an attitude which was a bit surprising because I was not voicing a complaint, just checking in. She might have just been having a bad day because she was also short with the gentleman who was ahead of us in line. But then when it was our turn next she barked at us asking whether we were guests at the hotel. Then she seemed a bit nicer when we told her we were checking in but then when we asked for a wake up call and cab in the morning this was just too much for her and she was aggrevated again. 4. my bill was incorrect the first time i checked out but it was fixed immediately as soon as I pointed it out. 5. while the breakfast far exceeded my expectations in that it was really delicious, the best hotel breakfast I've ever had. But the service was awful. We must have waited 20 minutes for a waiter to take our order and then almost 40 minutes for it to show up. I had to go to the kitchen myself to get a drink. 6. wifi did not work at all in the hotel room or lobby but the computers in the lobby were great and loved the printer for my boarding pass. 7. I did not appreciate the $5 a day resort fee which was basically for two bottles of water that were not replenished every day. So I paid $10 for two bottles of water the first stay and $10 a day for two bottles of water the second stay.", "title": "beautiful but with a few problems", "user": "rachelia18", "date": "July 11, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 3.0, "service": 1.0}, "id": 115233007}, {"rating": 3.0, "stay_parameters": "Stayed December 2010, traveled on business", "text": "The hotel is quite large and built on many levels along a hillside near the old town of San Diego.", "title": "Mixed feelings about this one - won't be back.", "helpfulness": 3, "user": "okazon69", "date": "July 3, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 3.0, "service": 3.0}, "id": 114989089}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "The rooms were unremarkable, but clean and ok for a night or two.", "title": "Terrifc Place to Stay in Old Town", "helpfulness": 2, "user": "Terrapin621", "date": "June 27, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 114806927}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "Unfortunately, the service was not up to par. The front desk was unaware of the fact the AAA rate included free parking, and we had to show them a printout of the web page to get the discount. At a very early checkout (4:30 AM) prior to catching a flight, the front desk person was busy for over 15 minutes with another guest, and completely ignored us even though we needed to leave.", "title": "good stay, great location!!!! free parking across the street", "user": "alvakare", "date": "June 3, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 4.0, "service": 4.0}, "id": 111212593}, {"rating": 2.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "To add to that, the hotel subsequently insisted on sending us unsolicited emails at least twice, even though we specifically requested not to receive this the first time it happened.", "title": "Huge DIsappointment -- Tiny Outdated Suite", "user": "jeffepops", "date": "May 25, 2011", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 2.0, "sleep": 2.0, "rooms": 1.0, "location": 2.0}, "id": 109744555}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "We've been to Old Town, San Diego a few times and we had stayed at the Holiday Inn before. Well on our last visit we decided to try a different hotel and came upon the Best Western Hacienda Hotel. We wanted to stay because of the location and we were so pleasantly surprised on how nice it was. There is a nice courtyard outside the rooms and stairs that lead down into Old Town. All the restaurants etc. were close by and so much nicer not having to find a parking spot. The location was perfect and the room was very nice and clean and the hotel grounds were so relaxing. We will definately be back!!!", "title": "Very Nice Decor and in a great location of Old Town, San Diego", "helpfulness": 3, "user": "lisee43", "date": "July 28, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 4.0}, "id": 115878965}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled with friends", "text": "We were in town for Comic Con and we always like staying in Old Town, which is away from the hustle and bustle of the convention, but close enough to be convenient.", "title": "Excellent location, comfy room", "user": "savetheredheads", "date": "July 27, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 5.0, "value": 4.0, "service": 4.0}, "id": 115869471}, {"rating": 3.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "We had a room in the 800 building, which was easy to find and a great location. From the balcony outside the room, we watched the Sea World fireworks which was a neat bonus. The room was really spacious and very comfortable. The beds (2 queens) were new and the linens and pillows were very comfy. There were only 2 of us, but the room would easily accommodate a family of 4 (or 4 close friends). The bathroom was spacious and everything worked perfectly. The only odd thing was the mirrored door inside the bathroom directly across from the toilet. You had to watch yourself pee, which was weird. We enjoyed the microwave and refrigerator in the room, including the free bottled water daily. A nice perk, even though we were assessed a $5 charge (for tourism or something) to cover the cost.", "title": "A bit out of the way, but good", "helpfulness": 1, "user": "maryb35", "date": "July 27, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 3.0, "service": 4.0}, "id": 115830302}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled with family", "text": "The hotel is directly across from San Diego State Park, which is where the historic buildings of Old Town are, and just beyond is the train/trolley station, so it's super easy to use public transportation. Plus, it's just a nice spot to wander around and spend the day.", "title": "Excellent Hotel", "helpfulness": 1, "user": "dokel", "date": "July 20, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115573957}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "Parking is $12/day and the lots fill up fast, so take a tip from others and find street parking for free.", "title": "Quaint Hotel", "helpfulness": 1, "user": "travelfan223", "date": "July 15, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115406295}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled with family", "text": "This hotel was so convenient to old town, which I regularly frequent. I normally stay at another Old Town hotel but this was a spur of the moment trip and that hotel was booked so I checked online and found this one. What a great surprise. This hotel was very clean and everyone from the front desk to the gardener was so friendly and helpful. Great value for the money. I will definately stay here again. I have also recommended it to my friends that normally stay in other areas of San Diego.", "title": "Why Didn't I Stay Here Before", "user": "Mitchsgirl", "date": "June 17, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 32542871}, {"rating": 3.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "I made the reservation for a king and I also stated in the comments that I would prefer a room with a view. Arrived to check in and they did have a room with a view. Went to our room and it was a queen, not a king and the view was partially of the city but also a palm tree smack in the middle of the view. Called the front desk and they said that it was an upgrade because I have a \"view\". There are also a LOT of stairs and the layout is very confusing. Nice hotel for the price. And there is one computer in the lobby and it was being repaired. Although I did not rent a car, I don't think that hotel guests should have to pay for parking on top of their room rate!", "title": "Should communicate better...", "user": "craftyca", "date": "May 18, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 3.0, "rooms": 4.0}, "id": 30237280}, {"rating": 2.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "This place was a disappointment. The setting is lovely, the grounds are beautifully kept and immaculately landscaped, the staff are good. Housekeeping was not good though: by 4 pm on our second day we had to go find someone to beg some clean towels and TP off of, and they were not that busy. Parking fee is a rip-off as are the GOUGING resort fees. The restaurant is not very good (worst of all places we ate). Old, tired bathroom with a toilet that did not flush properly - not very romantic. Overwhelming I5 traffic noise, and airport noise really ruined the otherwise nice setting. Transport this to another location, fix the bathroom and get better housekeeping, and I would possibly go back. As it is, I would not stay there again.", "title": "Noisy, noisy, noisy - but beautiful property", "user": "IslandParents", "date": "April 20, 2009", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "location": 2.0, "service": 1.0, "rooms": 2.0}, "id": 28431419}, {"rating": 4.0, "stay_parameters": "Stayed April 2009, traveled with family", "text": "We loved the layout of this 5 acre hotel although we had difficulty finding our rooms. The hotel is beautiful with amazing views of the city. The location is perfect for walking around Old Town San Diego. The staff were very helpful and accommodating. My only complaint would be that the showers were not the greatest. But not a huge deal in my books. I wouldn't recommend this hotel if you have any sort of mobility issues though as there are a lot of stairs and you need to walk a fair distance to use the elevators.", "title": "Nice hotel, interesting layout, great location", "user": "ruky", "date": "April 13, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 3.0, "rooms": 4.0}, "id": 27953624}, {"rating": 4.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "PROS:", "title": "Nice hotel overall.", "user": "OneWorldTraveler68", "date": "March 26, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 3.0, "rooms": 3.0}, "id": 26875646}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "Other than staying in a hotel downtown at 3 times the cost, this place was great!! The grounds made me feel like we were in Mexico! Old Town really quaint with lots of Mexican restaurants. Short walk to the tram that goes downtown - easy, safe and cheap! We went to Little Italy one night for dinner and the Gas Lamp District twice for dinner. Tram can also take you to a big mall and all the way to Tijuana (check the public transit site on line).", "title": "A great, reasonably priced place to stay!", "helpfulness": 4, "user": "kristine61", "date": "February 20, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 5.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 152667475}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled with family", "text": "Hotel charges $12 for parking but only $6 if you have AAA.", "title": "Great Hotel!!!!!", "user": "James F", "date": "February 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 152631442}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled solo", "text": "I would highly recommend this hotel. Easy to get to just off the I-5 and you don't have to drive downtown. Breakfast included; waffles, toast, cereal, eggs, sausages, coffee etc", "title": "Wonderful staff , Comfortable room", "user": "jill2736", "date": "February 20, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "location": 5.0, "service": 5.0}, "id": 152627121}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled on business", "text": "Will definitely recommend this hotel to friends.", "title": "My Favourite Hotel in San Diego.", "user": "Susan F", "date": "February 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 152525049}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "My wife ,and I ,had a wonderful vacation, due mostely to the great hotel! Everyone was wonderful! The room was great! So easy to just park, and leave our truck...and take a trolley, or walk to anything. The resturant was not very good. Would not eat there,again. Loved everything erlse about this hotel! Can't wait to come back,soon!", "title": "Great Best Western", "helpfulness": 1, "user": "Mae-Sal4", "date": "February 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 152486420}, {"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled with friends", "text": "The hotel had fairly large, comfortable rooms with a sofa. The location is right in Old Town, perfect for walking everywhere. We had an issue where we didn't have any water at all coming into our suite for a couple of hours, and with a little negotiation, they didn't charge us for parking as compensation. The hot tub is great. I would stay there again.", "title": "Really nice hotel with a great location.", "user": "NMacKay", "date": "October 19, 2008", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 2.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 20997541, "likes": {"liked": "— Great location.", "disliked": "— Hotel needed some improvements"}}, {"rating": 2.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "We spent a weekend at the Hacienda Hotel and stayed in the 700 building, which is on the same level of the lobby. The outside area of the resort was very nice and fit in beautifully with the Old Town \"Spanish\" feel. We were pretty disappointed with our room though. The carpet needed to be replaced, this was really the main thing that bothered us. It was visibly worn and dirty. The bathroom also could have used updating. For as expensive as it was, we expected much more. We did enjoy a little time at the pool though, nice view.", "title": "Location great, not impressed with room", "user": "SteelersFan27", "date": "October 10, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 2.0, "value": 2.0, "rooms": 2.0, "location": 5.0}, "id": 20791467, "likes": {"liked": "— the location", "disliked": "— dirty/worn carpet, bathroom needs to be updated"}}, {"rating": 2.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "Aside from the room, the location in Old Town San Diego was terrific! It's very close to the Historical Park, which was neat. The main street through the area was also packed with Mexican restaurants and cafes. We loved the Cafe Coyote across the street and Fred's Mexican Cafe up the street. The area had a small town feel and we felt very safe and comfortable, but it was still a fun, festive feel in the evenings!", "title": "Beware of hidden charges!", "user": "kelleygirl52", "date": "September 30, 2008", "detail_rating": {"front_desk": 2.0, "service": 2.0, "cleanliness": 3.0, "value": 2.0, "rooms": 4.0, "location": 5.0}, "id": 20519229, "likes": {"liked": "— Location was great", "disliked": "— Management....."}}, {"rating": 3.0, "stay_parameters": "Stayed August 2008, traveled on business", "text": "Some San Diego notes:", "title": "Great Location", "user": "kek1781", "date": "August 14, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 5.0, "rooms": 2.0}, "id": 18955041}, {"rating": 4.0, "stay_parameters": "Stayed July 2008", "text": "-very easy to navigate in a car!", "title": "Very Beautiful Hotel In The Centre", "user": "mariandfedeloveusa", "date": "July 26, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 18269137, "likes": {"liked": "— the location", "disliked": "— the tax and resort fee"}}, {"rating": 3.0, "title": "Okay place but not necessary", "text": "Was on vacation in San Diego and decided to spend the last two days in downtown SD. We picked this place, the description and location appeared to be interesting and attractive. The publicity around old town was also a seller! I am happy that i used my points to stay at this place. We had a room with a view to the city... The airport! The location is in fact right in old town. Is it necessary? Not really. Old town is okay place but not a place to spend two days. The hotel is old style ( cowboy) and its huge. They have other buildings located few streets from the main lobby. The furniture in the roo is not that great.. I would describe this place to be a bit old age or old style. You feel lie you are somewhere in mexico in the 1900...", "helpfulness": 1, "user": "Gerald M", "date": "February 2, 2013", "id": 151261998}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "Anyway, here is my two cents...", "title": "A spacious resort in my favourite part of SD", "helpfulness": 2, "user": "Blurgeshmurg", "date": "February 1, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 151181292}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "Location: right in the middle of old town. Walking distance from hotel.", "title": "Wonderful stay", "user": "mbroon43", "date": "January 31, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 151094989}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled on business", "text": "Signage: very easy to find by car or on foot. The BW sign outside indicate the location very well.", "title": "HACIENDA HOTEL", "user": "SanDiegoWayne", "date": "January 31, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 151078217}, {"rating": 5.0, "stay_parameters": "Stayed December 2012", "text": "it was a great place to stay. 2 families in one two bedroom. it was 11 of us in all. 4 adults 2 teenagers 5 kids all in one room. We had 2 queen size beds and a couch bed and two roll out beds all in one room. The view was great. We are all the Shopping stores and restaurants.", "title": "Great place", "user": "joe_garcia2009", "date": "February 17, 2013", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 152309040}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled with family", "text": "My family was very comfortable and the location is beautiful. We highly recommend the Best Western Hacienda, it's walking distance from Old Town San Diego, great for business or pleasure. We will definitely be returning!", "title": "Great Deal!", "user": "Olivia C", "date": "February 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 152268737}, {"rating": 3.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "This could have gone so much better but it didn't. The rooms were a little expensive but I figured they'd be great... my mistake. The room was tiny. It felt like it was an office that was converted into a hotel room. The closet didn't open because the nightstand was too big and in the way, they shower door hit the toilet when you opened it, the bathroom door and the shower door could be opened at the same time because of the size of the bathroom, the bed took up 2/3 of the room itself... I could list everything that went wrong but the end result was that the room was miniscule and the price was too high for it. Will I be back? Not likely.", "title": "Overall: Okay", "helpfulness": 2, "user": "Danyael G", "date": "February 15, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 1.0, "sleep": 3.0, "rooms": 2.0, "location": 5.0}, "id": 152191686}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "Pay VERY close attention to the photos for the room as they are NOT what the rooms actually look like.", "title": "Wonderful view", "user": "Angela B", "date": "February 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 151918907}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "This is our first time staying at the Best Western Plus Hacienda Hotel in Old Town. Great location since we could walk to each place we visited in Old Town, San Diego. We had a nice view of San Diego. I did not have any idea it would be a total of 112 steps up to our room. We really got a workout that day, as we spent the afternoon touring the USS Midway and climbed many, many stairs on it as well. If you have a fear of heights or cannot climb dozens of stairs up a steep hill, you might consider another location. After we reached the top of the hill, we looked back and enjoyed the view! We enjoyed a quiet night of sleep and ate a huge, delicious breakfast. I would really consider staying at this hotel again. Thank you everyone at the Hacienda Hotel for such a nice visit!", "title": "2013 visit", "user": "James L", "date": "February 6, 2013", "detail_rating": {"cleanliness": 5.0, "location": 5.0, "rooms": 4.0}, "id": 151532922}], "location": {"country": "United States"}, "stars": 3, "variance": {"poor": 41, "average": 81, "very good": 245, "terrible": 33, "excellent": 208}, "aka": "Best Western Hacienda Hotel Old Town San Diego", "slim_ranking": 0.292592592593}