{"user_rating": 4.5, "review_count": 231, "name": "BEST WESTERN Lumberton", "reviews": [{"rating": 1.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "Have always stayed here while traveling thru Lumberton, but my last visit i found that it is pet friendly, maybe a little too much i thought as i watched someone enter a room with three dogs, one the size of a small horse. Pets carry fleas and i think it is unsanitary and digusting personally and will never stay there again!!! And to top it off, i left my phone charger there, called the nxt day and the day after and still noone had seen it or turned it in, very unpleased!! Did it grow legs and walk away!!!! SMH", "title": "Pet Motel", "helpfulness": 3, "user": "Jerry H", "date": "May 22, 2012", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 1.0}, "id": 130408026}, {"rating": 4.0, "title": "Recommend", "text": "We had stayed at this Best Western before as a stopover en route to Emerald Isle, and it has always been a good value, with the necessary benefit of allowing small dogs. The rooms are relatively large and clean, with a flat-screen TV with multiple cable channels available. They offer free wi-fi and complimentary breakfast. The staff was friendly & professional. There are a number of \"chain\" type eateries located nearby and a large Lowes Foods less than a mile away. This is not a \"luxury\" hotel, but all in all is a good value and more than satisfactory stopover place.", "helpfulness": 5, "user": "Rupes", "date": "May 11, 2012", "id": 129758420}, {"rating": 3.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "Picked the hotel because they allowed dogs, have stayed there twice...very adequate and great staff, on our list now every time we get in the area...snow birds heading north and south", "title": "Good value", "helpfulness": 3, "user": "John5754", "date": "April 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 129007081}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "Nicely decorated and clean. I was a little hesitant after reading all the reviews that it was pet friendly, meaning maybe the rooms would not be fresh. I was pleasantly surprised from start to finish. Reservation was made online (cheapest rate), check in was a breeze, room was fresh and clean and there really is no checkout-just leave your key in the room when you leave. I definitely recommend this hotel. Close to 95 also.", "title": "Recommended", "helpfulness": 4, "user": "luvtovacn", "date": "April 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127526019}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "We were traveling with our dog for the first time and I found the Best Western on a site for traveling with pets. I checked reviews and decided to give it a try. I did not want to give up the comfortable beds we had at other motels. When we got there I recognized the building of a Holiday Inn we had stayed at many years before. Before we even got to our room we were impressed with the pleasant and helpful staff. The rooms were extremely clean and newly decorated. There was a new TV, a sitting room area with large coffee table, and a desk with a comfortable chair. The two queen beds were very comfortable and gave all a good nights rest.", "title": "Better than expected", "helpfulness": 4, "user": "images99", "date": "April 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127472094}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled with family", "text": "We are \"snowbirds\" traveling between Connecticut and Florida with our two Golden Retrievers.", "title": "Dog Friendly Hotel exceeds all exectations!", "helpfulness": 5, "user": "gddelaney", "date": "February 1, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 123982518}, {"rating": 1.0, "title": "Don't stay here unless you want an \"unwanted wake-up call\"", "text": "This hotel was the nicest one we've stayed in-staff very sweet, room was immaculate and the bed very comfortable.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "January 20, 2012", "id": 123370771}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled with family", "text": "This Best Western is nicely appointed for an older motel with outside entrances. We stayed there because it is pet friendly. We drove a very long way that day and got in late. Check in was fine.", "title": "Plan on making this a regular stop", "helpfulness": 2, "user": "sambucca45", "date": "January 15, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 123127238}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled with friends", "text": "Now it gets ugly....My wife got up early to conduct some business. While I stayed in bed. All of asudden the room phone began ringing and woke me up. They had hung up before I could get to the phone/ I called the front office and as I was dialing the front desk number there was a load knock on the door along with \"Housekeeping!\"", "title": "Convenient to I-95", "helpfulness": 2, "user": "TonyTTA", "date": "January 10, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 122890922}, {"rating": 3.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "I said what is it and then then she must have gone away. Back to the phone....I said to the front desk lady \"What is going on, check out isn't for another one and a half hours. Her remark was that the cleaning lady didn't see any cars in the parking lot in the area around our room. I noted that there was a \"Do not disturb\" sign on the door, but the front desk lady just repeated her first comment. No aplogy, no customer concern.", "title": "Not quite as good as other reviews", "helpfulness": 3, "user": "servicecomesfirst", "date": "January 4, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 122526702}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "When we decided at 3 PM how far we would travel the first day on our snowbird return route from FL, we called ahead to make a reservation. There were no nonsmoking 1st floor rooms available so we took a 2nd floor room. Once we got our pets and ourselves up the stairs, we were pleased to see that our room was nicely decorated, clean and comfortable. There were 2 comfortable chairs for reading or watching TV, a desk for our laptop and desk-chair for us. The check-in clerk was very welcoming and pleasant even though there was a queue of 5 traffic weary travelers waiting to check into their rooms. The room was quiet, beds were comfortable, coffee good. Complimentary breakfast was basic, no frills. There are many, many chain restaurants near this hotel so lots of dinner choices. All in all, it was a good place to spend the night.", "title": "Clean, recently redecorated, convenient to I 95", "helpfulness": 3, "user": "delbeach", "date": "March 31, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 127030832}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled with family", "text": "We were on our way home from florida and needed a stop for the night. This Best Westeren was above our expectations. The location is close to I-95, it is updated and very clean. We travel with our dog and there was only a small charge for him. We plan to make this a regular stop in the future.", "title": "Great Choice", "helpfulness": 4, "user": "suzanne33ma", "date": "February 26, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 125249515}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "On a long drive from Florida we needed to stop just for the night. I looking into many hotels off of I 95, and this one had the best reviews that allowed pets. We arrived at 6:00 pm, and was very happy with the location. The rooms were very clean, and look just like the pictures. The property has grass as a perimeter, which helping in walking my dog. I also like that it was close to a shopping plaza, I felt very comfortable walking my dog at 2:00 am, for his last minute bathroom stop. Would recommend this particular best western to anyone looking for a one night stay on a drive to Florida from New Jersey.", "title": "Great stop!", "helpfulness": 5, "user": "Nicole Z", "date": "February 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124690300}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled with family", "text": "On our way home and needed a decent place to stop, have have really good experiences with Best Western and this was no exception....very nice staff, room was very clean and comfortable, breakfast was the basic but very well stocked and the lady that kept everything stocked was really helpful. Will stay here again...", "title": "Very Nice", "helpfulness": 3, "user": "Linda R", "date": "February 13, 2012", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 124554483}, {"rating": 3.0, "stay_parameters": "Stayed February 2012", "text": "Stayed one night en route from Florida - hotel is as good as reviewers describe: clean, flat screen tv, loveseat, microwave - all newly done. Great bathroom with massaging shower, nice breakfast buffet.", "title": "Clean dog friendly spot off 1-95", "helpfulness": 2, "user": "Diver4comm", "date": "February 8, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 3.0, "service": 4.0, "rooms": 4.0}, "id": 124292465}, {"rating": 3.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "This property is located very close to the freeway and so a number of commercial vehicles with propensity for early starts were there. This is a motel type property with all room opening directly to the parking lot. Spacious rooms with comfortable beds. Typical American 'complimentary' breakfast. May be good for dog owners but it was a pity about the 2 yapping dogs next door!", "title": "Good stopover", "helpfulness": 2, "user": "travguy", "date": "June 28, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 132990660}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "A reasonable choice for a stop over if this is on your route.", "title": "NOT AS GOOD AS PREVIOUS VISITS", "helpfulness": 2, "user": "sambucca45", "date": "June 21, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 2.0}, "id": 132468344}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "This was our 3rd or 4th visit and generated our 1st complaint. It was the 1st time we stayed on the \"Walmart\" side of the building. It's only about 200 feet from the Walmart parking lot. Trucks park there overnite and it was quite noisy. When I complained at the front desk, I was told that there was nothing they could do about it.", "title": "One Night Not Enough", "helpfulness": 2, "user": "DCNCcouple", "date": "June 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 132054008}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled on business", "text": "I will only stay there again if they can guarantee me a room on the other side of the building.", "title": "this is the place to stay!!!", "helpfulness": 2, "user": "S S", "date": "June 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 131734261}, {"rating": 5.0, "stay_parameters": "Stayed June 2012", "text": "Traveling south after an 8 day trip we booked one night stay, using Best Western points. We enjoyed quick check in, so quick I walked away without my credit card. Before I could get to the room they called me on my cell and brought the card to me. Assigned room was being serviced and housekeeper called desk to get me another room, again they brought the keys for exchange. Wow, we never had to move, they handled everything in 5 minutes, and with an apologetic smile. We were impressed with their cordial, efficient handling of all this. Room was above average in appearance & cleanliness. 2 queen beds, sofa, chair, coffee table, with desk., fridge & microwave. Flat screen with choice cable package + HBO, free wi-fi. Motel located in shopping center at Exit 22 on Interstate 95, with restaurants, Walmart, gas stations, fast food places. After 8 nights in 2 other hotels in N.Carolina & Maryland, we found this to be the best and wanted to stay another night, but had to get home.", "title": "Good place for people who travel with dogs. For those without pets, still a great clean place with no pet odors.", "helpfulness": 1, "user": "DanBeagle", "date": "June 10, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 131664983}], "location": {"country": "United States"}, "stars": 2, "variance": {"poor": 4, "average": 21, "very good": 76, "terrible": 7, "excellent": 123}, "aka": "Best Western Hotel", "slim_ranking": 0.047619047619, "description": "The Best Western Inn offers spaciously-appointed guest rooms and suites, each equipped with a microwave, refrigerator, cable television with HBO® and free high-speed Internet access. Hotel guests will wake each morning to a complimentary continental breakfast. Additional amenities include an outdoor swimming pool, free access to a nearby fitness center and a business center."}