{"user_rating": 3.5, "review_count": 324, "name": "BEST WESTERN Bretagne Montparnasse", "reviews": [{"rating": 5.0, "title": "Excellent", "text": "Nice hotel, good price, staff very helpful....", "helpfulness": 3, "user": "A TripAdvisor user", "date": "June 8, 2005", "id": 3539324}, {"rating": 4.0, "stay_parameters": "Stayed June 2004", "text": "excellent address for all your trip in Paris!", "title": "Cute, comfortable, and haunted", "helpfulness": 1, "user": "hevavahkema", "date": "May 20, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "service": 5.0}, "id": 3489382}, {"rating": 5.0, "title": "excellent hotel", "text": "lot of shops, bars, restaurants...", "helpfulness": 3, "user": "A TripAdvisor user", "date": "May 20, 2005", "id": 3488873}, {"rating": 4.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "This hotel is a fabulous find for budget travellers. Great rooms (they are small, but all hotel rooms are small in Europe), the bathrooms are nice, and the staff is friendly. We really enjoyed the breakfasts. It's in a nice area in Paris and close to the subway. Avoid booking a boat tour along the Seine through the hotel. They offer it at the front desk, but you will pay an arm and a leg for it. Take yourself down to the river, and visit one of the boat places directly. The hotel quoted us around 60 euro a person for the boat ride; my husband and I went to one of the places on the river to book a ride and ended up paying 7 euro a person. Otherwise, this is a great hotel and I highly recommend it, especially for budget travellers who don't want to sacrifice quality and service.", "title": "Loved this Hotel", "helpfulness": 3, "user": "maminshe", "date": "July 24, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 5503136, "likes": {"liked": "— The friendly staff--they went out of their way to accomodate us.", "disliked": "— Nothing."}}, {"rating": 3.0, "stay_parameters": "Stayed March 2006", "text": "We spent 3 nights at this hotel in March 2006, and found it to be decent for the money. It is 2 blocks up from the Pernety Metro in a quiet residential area. The breakfast is 10 Euro each, but if you make a sandwich to take away for lunch or a snack, that helps offset the cost a bit. Yes, the rooms are small, but most in Europe (at the price range of $100 per night)are going to be. One drawback is that the lights in the halls go out automatically so you have to open your door into a dark hall to turn the light on. The Air France bus drops at Gare Montparnasse, just 3 blocks away, so getting to and from the airport is very easy. The staff could have been more helpful, but we had very little interaction with them anyway. All in all, we would stay here again without hesitation.", "title": "Nice small hotel in good area", "helpfulness": 7, "user": "ahtraveler", "date": "March 25, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "service": 2.0}, "id": 4731837}, {"rating": 4.0, "title": "Best Western Bretagne Montparnasse a good bet", "text": "My girlfriend and I stayed here for a bit more than a week at the end of Sept. and found the hotel to be quite good considering its two-star rating and location seemingly a little off the beaten path, (which we found to be one of its charms in the end). The price certainly worked for our somewhat budget-conscious trip.", "helpfulness": 14, "user": "A TripAdvisor user", "date": "December 29, 2005", "id": 4309629}, {"rating": 3.0, "stay_parameters": "Stayed November 2005", "text": "We found the rooms to be comfy though typically a bit smaller than American-sized rooms. No problem. They were clean (and cleaned each day), water pressure and utilities worked well and we found the staff to be helpful, particularly Yohann, who gave us some great sightseeing and restaurant tips and helped us get acclimated to the neat little neighborhood we were not really familiar with, which added significantly to our \"Paris experience.\"", "title": "moderate hotel", "helpfulness": 4, "user": "TurkeyMarazi", "date": "November 10, 2005", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "service": 3.0}, "id": 4104371}, {"rating": 5.0, "title": "Wonderful and magnificent Hotel de Bretagne", "text": "Access to the Metro was good with two stops pretty close by, though I wouldn't encourage travelers with much baggage to make the walk from Gare Montparnasse to the hotel. Though it's only about five blocks or so from the hotel, it's just far enough to make the jaunt cringe-worthy. It's better to make the switch to the closer Metro stop, Pernety, or get a cab.", "helpfulness": 9, "user": "A TripAdvisor user", "date": "November 3, 2005", "id": 4082854}, {"rating": 2.0, "title": "Don't expect the staff to lead the way...", "text": "We have just returned from our very first trip to Europe. I did extensive research on line and found this Website very helpful on my quest to get the best hotel for our money. I wanted to share the honest opinion regarding this hotel with the intent of helping someone in a similar situation as us. (Young first time travelers in France with a mid budget that wanted a nice safe place to stay with maybe some nightlife around).", "helpfulness": 4, "user": "ValeUK", "date": "October 29, 2005", "id": 4071569}, {"rating": 1.0, "stay_parameters": "Stayed October 2005, traveled on business", "text": "Overall I would rate this hotel as okay for the money. The thing that disappointed us the most of this hotel was definitely the staff. I am sure it has been said before in this site, but in this hotel is particularly true, do not expect any help from the concierge on anything or any greetings day or night for that matter. The three reservation desk clerks we came in contact with pretty much had the same attitude. They even found it a hassle when we asked were the nearest metro was. We also had one occasion where we stayed until 10am in our room because we had a late start that morning and the housekeeper knocked in our door and expected to get in the room and clean it. I tried to explain we would be leaving shortly and she left upset. The fact that we had the \"do not disturb sign\" did not deter her one bit.", "title": "A Horrible Place to Stay.", "helpfulness": 2, "user": "Cleybrooke", "date": "October 5, 2005", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "service": 1.0}, "id": 3994585}, {"rating": 4.0, "stay_parameters": "Stayed August 2005", "text": "This attitude was kind of hard to swallow but other than this it was okay.", "title": "Not bad for Best Western!", "helpfulness": 3, "user": "ijhodgson", "date": "August 8, 2005", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 3745584}, {"rating": 4.0, "title": "What a little Gem", "text": "We did not hang around the area too much because it wasn't the best of areas for sightseeing compare to the rest of Paris.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "August 6, 2005", "id": 3741522}, {"rating": 2.0, "title": "Not what I expected", "text": "The room was the size we needed and very clean. The metro was 2 blocks away.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "August 3, 2005", "id": 3735061}], "location": {"country": "France", "region": "Ile-de-France", "continent": "Europe", "city": "Paris"}, "stars": 4, "variance": {"poor": 31, "average": 67, "very good": 139, "terrible": 15, "excellent": 72}, "aka": "Best Western Bretagne Montparnasse Hotel Paris", "slim_ranking": 0.398215281651, "description": "Installed in elegant Mansart style building, the BEST WESTERN Bretagne Montparnasse 4 star hotel is situated on the left bank of the Seine River; in the famous Montparnasse historical district which was attended once by many well-known painters such as Pablo Picasso, Modigliani, Ferdinand Leger and Henri Matisse. The district somehow keeps this mixed spirit of nightlife and culture with on one hand all the most renowned Parisian Brasseries, La Coupole, La Rotonde or further away."}