{"user_rating": 3.5, "review_count": 77, "name": "BEST WESTERN PLUS Grand Hotel Victor Hugo", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed January 2012, traveled on business", "text": "I agree with previous reviewers that the name promises more than what you get. It's a decent, clean \"no frills\" hotel. Be careful, they have the main building and an Annex on the opposite side of the street. I stayed in the Annex (my employer booked it). Since there seem to be different rates, I believe that the rooms in the main building must be somehow different (better) than in the Annex. Also the breakfast in the Annex is a bit simpler than in the main building but for my taste still with enough options. In the Annex there is no free WiFi (there were just about to install it when I left). The location is excellent, for the city center as well as for the business district at Kirchberg.", "title": "Nothinh special but good location", "user": "melaba", "date": "January 21, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 123390645}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled on business", "text": "This small and nice hotel is in walking distance of both Luxembourg city center and the Kirschberg plateau with the EU buildings. I booked a room in the annex but got a room in the main building. Everything was new, held in simple Scandinavian style and well functioning. Staff was very helpfull. The breakfast was international with few surprises and served in a nice glass veranda.", "title": "New hotel between city center and the Kirschberg plateau", "helpfulness": 1, "user": "Ester G", "date": "January 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 122648124}, {"rating": 3.0, "stay_parameters": "Stayed December 2011, traveled on business", "text": "The name indicates something big, but this is actually very small. It is a kind of wanna-be. I've stayed here a couple of times (did not book it myself). The beds are bad, like travel beds with a wooden frame around to make them look like real beds. The still have the impossible hangers that needs two hands and ton of patience to use, the soap dispenser is broken or empty and the quality of their shampoo etc is bad (smells bad). The hotel is divided in premium and economic, with one entrance on each side of the street. Try to take breakfast on the premium side (there they serve nice coffee, fresh fruits, nuts etc). The rooms have OK Internet connection with cable and no hassle - this is a very good thing! The staff wants to do good (friendly, speaks many languages etc) but their equipment is so, so. I asked for an ironing board and got a miniature board to put on the desktop - even the bed was better to use as board. The \"hotel\" looks nice, modern design and fancy decoration - but my impression is that they are running it at low cost to show profit.", "title": "Ok place for a night or two", "user": "laotse2", "date": "December 9, 2011", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 2.0, "sleep": 1.0, "rooms": 3.0, "location": 3.0}, "id": 121561823}, {"rating": 3.0, "stay_parameters": "Stayed November 2011, traveled on business", "text": "The room I got was very small, the breakfast buffet well below what I expect in a 4 star hotel.", "title": "Average ...", "user": "Bozzie4", "date": "November 9, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 120364465}, {"rating": 3.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "Also a bit noisy - I can hear my neighbours in the next rooms a bit too good for my liking. There is no parking in the hotel, although a few parking garages very near by.", "title": "Good hotel", "helpfulness": 1, "user": "St_yugi", "date": "November 2, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 120087866}, {"rating": 3.0, "stay_parameters": "Stayed October 2011, traveled on business", "text": "Despite having enjoyed the photos and description of the hotel, on arrival at reception they told me that my room was in the building across the street. The hotel has some rooms in a smaller building across the street who probably do not deserve the designation of 4-star hotel. Nevertheless, the hotel has a nice breakfast and the rooms are clean.", "title": "Different from expected", "helpfulness": 1, "user": "Ricardo_Marques", "date": "October 26, 2011", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 119748747}, {"rating": 3.0, "stay_parameters": "Stayed May 2011, traveled on business", "text": "You take about 10 minutes walking to the center, or less if you rent a bike that costs 1 euros for 7 days, and if you walk only 30 minutes each time it's free.", "title": "Disappointing", "helpfulness": 1, "user": "ljbnixon", "date": "October 5, 2011", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 118977366}, {"rating": 1.0, "stay_parameters": "Stayed September 2011", "text": "As others have mentioned, this 4 star hotel also has rooms in another building opposite which are presumably of lower quality. While the main building does look welcoming, I was given a room in the opposite building which was large but sub-standard for \"4 star\" quality.", "title": "DO NOT STAY IN THIS HOTEL", "helpfulness": 1, "user": "HipHopHip", "date": "September 6, 2011", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "location": 1.0, "service": 1.0, "rooms": 1.0}, "id": 117753646}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled with friends", "text": "I can not confirm if the \"4 star\" rooms in the main building are truly better. My only experience there was one evening trying to get a beer and a baguette in the hotel bar. No staffing, the receptionist eventually came over, and after a too long wait brought first the beer (in a bottle... why did it take so long?) and 5 minutes later a still half frozen baguette... so even if the rooms are better, it is not much of a 4 star hotel.", "title": "Enjoyed my stay, with a few tiny reservations", "helpfulness": 2, "user": "dokelly", "date": "August 8, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 3.0, "service": 4.0}, "id": 116417161}, {"rating": 1.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "I have travelled around the world and this is the most disonest hotel I have ever seen.", "title": "In two words: Russian Roulette", "helpfulness": 1, "user": "edu28015", "date": "August 1, 2011", "detail_rating": {"cleanliness": 1.0, "sleep": 3.0, "value": 2.0, "service": 1.0}, "id": 116098469}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "My partner and I decided to go away for the New Year, visiting France & Luxembourg. We stayed in France for the first two nights (see other review) and then caught the train to Luxembourg for the third day. This is the hotel that we stayed in for the night.", "title": "A hotel that will take some beating!", "helpfulness": 1, "user": "MikeyGS", "date": "May 5, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 106944826}, {"rating": 3.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "To kick things off, I will just mention the sort of negatives with our stay in Luxembourg. Because we were there New Year's Day, most of the shops were shut and the city was pretty much deserted. Don't get me wrong, it was nice not having to contend with crowds of people but nevertheless, I do like to see the odd crowd when I'm visiting a city. The only other thing was the fact that the hotel was a bit of a walk from the epicentre. It was in a lovely neighbourhood but with it being quite cold and the pavements being covered in snow, it made the walk to and from the centre that little bit difficult.", "title": "Very small rooms and uncomfortable beds", "user": "psych4trvl", "date": "September 15, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 2.0, "sleep": 2.0, "rooms": 2.0, "location": 3.0}, "id": 79659770}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled solo", "text": "Don't worry though, this is where the negatives end. The hotel was spotless and the reception staff were very helpful and friendly and nothing was too much trouble for them. Our room was massive and if I didn't know better, I'd think that we were secretly upgraded (not sure why they would do that but it sounds good to me!). The room was also very clean and the bed was lovely and comfy. The bathroom again was very clean and the bath was that big that even two people could fit in it which is something that I have never encountered in all of the hotels that I have stayed in. In the lobby, there was a computer with internet access that was free to guests and must admit, this was something I took full advantage of.", "title": "Very comfortable, nice staff, good amentities", "user": "RayBuck007", "date": "July 15, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 71056748}, {"rating": 3.0, "stay_parameters": "Stayed June 2010, traveled on business", "text": "We did not eat any food during our stay so I am unable to comment on the food.", "title": "Purposeful hotel with all the right amenities", "helpfulness": 1, "user": "Ldn_Neil", "date": "July 12, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 70581420}, {"rating": 5.0, "title": "Nice", "text": "Overall; a fantastic, friendly and clean hotel in a lovely part of Luxembourg that is about a 10-12 minute walk into the centre - just be careful though if its been snowing as the pavements can be very slippy!", "helpfulness": 1, "user": "Kchopel", "date": "March 24, 2010", "id": 59459971}, {"rating": 1.0, "stay_parameters": "Stayed June 2012, traveled on business", "text": "I had room 101 in the annex which was on the street and even with the windows closed it was noisey.", "title": "Awful..... even for one night", "helpfulness": 1, "user": "KCS", "date": "June 28, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 3.0}, "id": 132988626}, {"rating": 3.0, "stay_parameters": "Stayed April 2012, traveled on business", "text": "It was also near the lift and at the top of the stairs where the sound carried. So in bed I could hear people coming back after dinner talking. Then..... around 5:15 I heard all the banging and clattering as the breakfast was set up.", "title": "Adequate but too expensive", "helpfulness": 2, "user": "zuurstok", "date": "April 27, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 128891130}, {"rating": 4.0, "title": "Pretty good, but you get what you pay for.", "text": "Also rated badly because of the room itself..... NO-WAY is this a 4 star hotel, no way!", "helpfulness": 1, "user": "Philbraden", "date": "April 25, 2012", "id": 128605937}, {"rating": 3.0, "stay_parameters": "Stayed September 2011, traveled on business", "text": "Very basic room.", "title": "Not very Friendly", "helpfulness": 1, "user": "firemanstep", "date": "February 17, 2012", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 4.0}, "id": 124709801}, {"rating": 3.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "The worst mattress I have slept on and I have stayed in cheaper hotels and hostels with better beds. My colleague said the same thing about her bed (and room)", "title": "Avoid the room in the annex building", "user": "rmcolin", "date": "February 15, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 2.0, "location": 3.0}, "id": 124639009}], "location": {"country": "Luxembourg", "continent": "Europe"}, "stars": 4, "variance": {"poor": 5, "average": 25, "very good": 22, "terrible": 6, "excellent": 19}, "aka": "BEST WESTERN PLUS Grand Hotel Victor Hugo Luxembourg/Luxembourg City", "slim_ranking": 0.461538461538}