{"user_rating": 4.5, "review_count": 523, "name": "BEST WESTERN PLUS Harbour Pointe Lakefront", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "We checked TA for recommendtions and chose to stay here. The view was very nice and they had campfires in the evening for the guests. Hotel was clean and staff was very helpful for restaurant recommendations in the area. This was a wing-it trip so I was glad we stayed here. Breakfast was so-so but the same as other hotels in the area. Would stay here again.", "title": "Beautiful View", "user": "GrannyCIndiana", "date": "September 27, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 20419895, "likes": {"liked": "— The View", "disliked": "— The breakfast"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "After searching Tripadvisor hotel reviews for St. Ignace & Mackinaw City, we chose the Best Western for 2 night stay. Had great room on 3rd floor of Ontario building at very reasonable senior rates. Uphill walk from Ontario to breakfast, but OK. Breakfast area can be busy & crowded place when tour bus patrons arrive, but is large area for a motel. No problem with bus noises, etc., because our room was lakeside. Would stay at again in off-season.", "title": "Never regretted the choice - Great value & location", "user": "ljcs1308", "date": "September 25, 2008", "detail_rating": {"front_desk": 5.0, "business": 1.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 20370658, "likes": {"liked": "— Location", "disliked": "— WiFi internet connection"}}, {"rating": 2.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "I did not have the same experience that many on this site had. We were moving across the country and had our dog with us. We were informed that our dog could not stay in the hotel, but were not informed that the dog couldn't even be in our car in her kennel on the property (we were only there from about 10 pm until 7 am). We checked with local police and there was an empty hotel next door where we could park the van, that was fine, as I said it was only for a few hours. HOWEVER it was also listed as a non-smoking property and in order to enter the lobby I had to go through an awful cloud of smoke to get into the building. The folks waiting for the casino bus stood right outside the doors to the lobby and smoked away. It was disgusting. Then to add insult to injury, they allow tour busses to park right outside the doors to the rooms and they start up a little before 7 in the morning. It was loud and stayed there for well over 30 minutes, so much for getting a little sleep. When I questioned about that, the front desk clerks just shrugged, and said we get alot of busses. If that's the case make the doors a little more sound proof. I could hear noises outside all night, even before the bus incident. It was just not a pleasant stay.", "title": "Not Consistant and NOISY", "helpfulness": 3, "user": "kimND", "date": "September 22, 2008", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 2.0, "cleanliness": 3.0, "value": 3.0, "location": 3.0, "rooms": 2.0}, "id": 20281836}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "I have never written a review before, but after using this site to locate a good hotel for our trip I felt like I had to. There were two couples travelling to the Mackinac Island area for a weekend getaway and had no idea where to stay. We checked in Mackinaw City, but eventually decided on St. Ignace based on a suggestion from a friend that had been to the area. I looked around online and came across the Best Western Harbour Pointe. Based on their website it looked to be a very nice hotel. After reading a number of reviews on this website, I knew that did not always mean anything. I continued searching and kept coming back to them. I finally called the hotel to get some info on the area and the lady at the front desk was very helpful and answered all of my questions. I booked the rooms on the phone and was looking forward to the trip. When we arrived, the front desk staff was very helpful and gave us info on good places to eat, etc. We made our way down to the ONTARIO building which is the key to your stay. Make sure you ask for the ONTARIO building. The view from our King room was simply amazing. The room was clean, the bed was comfortable and our private deck was great. We did use the outdoor whirlpool and (supposedly) heated pool both nights. We had the breakfast on the morning we checked out and it was good (doughnuts, bagels, cereal, toast, etc.). I have to say our entire stay was as good as expected and would not hesitate to go back to the Harbour Pointe!!!! Mackinac Island is also pretty cool too. We were able to ride our bikes(2 minute ride) from the hotel to catch the ferry downtown St. Ignace. As for food in the area we at at Driftwood (sports bar) and the Mackinac Grille. Both were very good. Had a great trip!!!!!!!!", "title": "The Perfect Place!!!!", "helpfulness": 1, "user": "mackinactravels", "date": "September 19, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 20199019, "likes": {"liked": "— views", "disliked": "— nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "We chose this hotel based on the positive reviews on Trip Advisor. We were not disappointed and I agree with all of the comments previously written. The hotel staff was especially friendly and the grounds were clean and spacious. We stayed on the ground floor overlooking the lake and enjoyed the view. Unfortunately, the sea gulls are becoming more and friendlier and would have entered the hotel room if we had left the slider door open. I think most hotels in this area have sea gull problems. Please do not feed them!! The other disappointing thing about this hotel was the continental breakfast. The breakfast area was spacious and there was plenty of seating. However, the continental breakfast had the bare minimum of items and was limited to cereal, muffins, toast, coffee, and juice. This simple breakfast seemed to be out of place with the high quality service that had been provided up to this point. We would stay here again, but eat breakfast elsewhere.", "title": "Great hotel in St Ignace, MI", "user": "NatlPark", "date": "August 11, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 18855617}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "We stayed at the Harbour Pointe as a base for exploring both St. Ignace and of course, Mackinac Island. The hotel staff was accommodating, polite, and efficient in check in and in giving advise for restaurants, ferry prices, etc. Hotel room was very clean, although curtains were a bit tattered. Our children, aged 3 and 5, found the pools exciting as well as the nightly bonfire. We were engaged at this property 7 years ago, so it was especially enchanting to go back with our children. We will return.", "title": "Perfect base for families", "user": "Domivinci", "date": "July 25, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 5.0}, "id": 18254689, "likes": {"liked": "— Family friendly atmosphere"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "In looking at Trip Advisor for Saint Ignace hotels, I really liked the sound of Harbour Pointe Motor Inn. It was also half the price of the Best Western Harbour Pointe Lakefront. But I couldn't find a number for the Motor Inn and couldn't book through Trip Advisor. What do you know, Motor Inn is now Best Western, with a huge upgrade. My review is simply to save the next person the time. I suggest delisting Harbour Point Motor Inn or combining its reviews.", "title": "Now known as Best Western Harbour Point Lakefront", "user": "ScubaTraveler99", "date": "July 19, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 18049728, "likes": {"liked": "— St. Ignace is so much nicer and a better value than Mackinaw City", "disliked": "— Nothing."}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "Having 4 kids it is difficult to find a hotel that will allow you to stay in one room. It is typical to have to book two rooms and then have to split up with one parent to each room - not fun when trying to enjoy a family vacation together! After giving up on Macinac City, I decided to try the other side of the bridge in Saint Ignace. I immediately stumbled upon the Best Western Harbour Pointe website which allowed me to enter 4 children in the room reservation search. The room descriptions were very confusing so we opted to call direct and talked to Tim Harrington who was extremely friendly and helpful. We found that the hotel is run resort style and is very kid friendly. We were able to get two rooms that were separated by a sliding door that allowed the whole family to be together and it cost less than other hotels that were quoting us two rooms!", "title": "Beautiful Place and great for a large family!", "user": "kajonwill", "date": "July 19, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 18043955, "likes": {"liked": "— room and the view"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "Our room had a balcony overlooking a gorgeous view of Lake Huron and Macinac Island. The rooms were clean and comfortable and with a choice of an outdoor heated pool and indoor pool our kids were very happy. They especially loved the nightly campfire and smores! All the staff we encountered were extremely helpful and courteous and we took advantage of the discounts they offer on Macinac island ferry's and island tours.", "title": "Large property, not just a building", "user": "4-H", "date": "July 8, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 17671047, "likes": {"liked": "— the large property"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "I highly recommend this hotel for anyone looking for a place to stay while visiting the island or for anyone just wanting a little R&R!", "title": "Good choice for Saint Ignace", "user": "thebandteacher", "date": "July 6, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 17583161, "likes": {"liked": "— The balcony and the view", "disliked": "— Our building was far from the breakfast area and the front office"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "We stayed here in the Michigan building for two nights in a 2 double bed room. It was an average sized hotel room although the bathroom was pretty tiny (the sink was outside the bathroom). Nevertheless, the room was very clean and comfortable with a small fridge. The breakfast was okay, muffins, cereal, toast/bagels, hard boiled eggs, coffee, and juice so not really \"deluxe\" but good enough for us. The pools were nice and the grounds were very well taken care of. There was a playground right outside of our door although we didn't use it. Located within short walking distance of the ferries to Mackinac.", "title": "Nice room and nice grounds", "user": "HMTY", "date": "August 10, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 37312727}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "We stayed at the Harbour Pointe Lakefront with a great view of Lake Huron and Mackinac Island. I called the hotel direct to make reservations and spoke twith Ann. Having never been to Michigan, she was gracious and answered my many questions. I had to call back and change our dates due to a family emergency and Ron handled it with ease. \"No problem, he said. Call us back if anything else comes up.\" Harbour Pointe was easy to locate and is just a couple of blocks from Shepler's Ferry, well within walking distance. Check-in was a breeze and Pam was 'spot on' with information. She gave us tour and ferry information for the Island and a few valuable insider tips for biking around its perimeter. Kathy was our housekeeper during our stay and we felt comfortable leaving our belongings in the room while we visited the surrounding area. Everything was kept immaculate and we felt safe. No complaints. The hotel provided a nightly bonfire on the beach. There were two pools; one indoor and one outdoor, but we were busy doing other things and didn't take time to enjoy them. The grounds were groomed continuously and management paid attention to detail; very clean and well maintained. I personnally applaud this hotel for being pro-active in regards to guest safety. The shower tub's base is coated to prevent falls, which I appreciate after suffering falls at two different hotel chains. Our room had a balcony facing the lake with a view of Mackinac Island. The seagulls and Canadian Geese would gather in the courtyard below as if to welcome visitors. Raleigh worked the desk and was available to assist with questions and always queried as to how our trip was going. Couldn't ask for a nicer staff. After staying at this hotel, we can't think of staying at Mackinaw City - ever. Saint Ignace and the Harbour Pointe Lakefront make this a perfect getaway. We will definitely return to this hotel again. It's a resort hotel in a quaint setting. Don't overlook this hotel for crowded Mackinaw City. You can have it all right here in Saint Ignace. The weather could have been a little better, but that's Mother Nature for you. Thanks for the great vacation, Harbour Pointe staff!", "title": "Idyllic setting to enjoy nature's offerings", "user": "MBrown4059", "date": "August 4, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 36750476}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled with family", "text": "Excellent hotel with a wonderful staff. I think that some of the staff are part of the family that owns the franchise. They do an excellent job with the entire site. There is a bonfire in the evening with roasted marshmallows and smores. We visited in early June so the rates were quite reasonable. The room had a balcony and a view of the lake. We highly recommend this property.", "title": "Very Nice - Excellent Value", "user": "LiketoeatCincinnati", "date": "August 1, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 36433535}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "This is my 8 or 9th stay at this hotel. It is tradition for us to stay here the night before we head to Mackinac Island. I love this hotel. It is a best western, not a resort, but has many extra ammenities that you don't ordinarily see in a chain hotel: 2 pools, outdoor pool has glass walls to keep out the wind and has an attached hot tub and zero entry, indoor pool with hot tub which is open until 11:00pm, standard chain hotel breakfast, playground, evening bonfire with free marshmallows and roasting sticks, and a game room. The only thing missing is a fitness room. The staff is great and each time I come I'm welcomed back as a returning guest. I like the Superior building which overlooks the outdoor pool. If you don't like noise, stay in a different building. There are 4 to choose from. We lucked out this time and had a 3rd floor room with a large balcony overlooking the outdoor pool. The pool was supposed to close at 10:00pm, but staff didn't kick the swimmers out until nearly 11:00pm. On Saturday nights in the summer there are fireworks overlooking the bay in St. Ignace. We could see the fireworks from the hallway balcony on the other side of the hotel - nice! I'll keep coming back for more of the same.", "title": "Best place to stay in St. Ignace or possibly the UP", "user": "MrsClean76", "date": "July 29, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 36180678}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "I'm a \"neatnick\" and the hotel was clean to my standards. The hotel was obviously renovated, but was done well. A good breakfast was provided (continental). An evening bonfire/marshmallow roast was a plus. Two heated pools - one inside and one outside were also a bonus.", "title": "Good value", "user": "michmom82", "date": "July 25, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 35776538}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "Recently returned from a mini vacation to Mackinac Island. We decided to stay in St. Ignace instead of the actual Island (way too pricey) . I scoured the internet for the best place to stay based on reviews from other travelers. I decided to go for the Best Western Harbour Pointe Lakefront based on reviews I read elsewhere. Glad I went for it. When we pulled up we were so surprised at how well kept the hotel looked from the outside. I was very impressed when I called at 11:30 in the morning (our ride up was actually quicker than we anticipated) and asked if we could check in early (check in is normally 3:00 p.m.) and was told they would send someone up to have a room ready upon our early arrival! Great desk front service! Nicest people working there. When we got into our room I was very happy. The room was spic and span clean! The mattresses looked new. The bathroom was sparkling! It was just really nice that we did get a great room for a great price. The pool outdoors was sparkling as was the indoor pool. The continental breakfast was so-so but I wasn't expecting a big meal anyway. Oh, and we did have a really nice view from our balcony (all rooms have their own private balcony). After seeing all the motels and hotels in Mackinaw City and St. Ignace I would say we did quite well for the money. A two night stay in a room with 2 queen beds with tax was around $200.00. If you are debating where to stay do not hesitate. It really is an immaculate place to stay!", "title": "Nicest place to stay for the money!", "user": "MichiganJewel777", "date": "July 25, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 35714698}, {"rating": 4.0, "title": "Great value near the ferries", "text": "Inspite of being on a property squeezed between other buildings on the busiest street in St. Ignace, this hotel really feels like a resort. Our room was large and lovely and the staff is helpful with getting ferry tickets and carriage tour tickets for Mackinac Island. The grounds are pretty and there's even a tiny sliver of beach at the edge of the lawn.", "user": "simonthecellar", "date": "July 21, 2009", "id": 35419832}, {"rating": 5.0, "title": "Very nice hotel, awesome staff", "text": "We stayed 3 nights in this hotel while visiting St. Ignace and Saulte Saint Marie. Our room was clean and very spacious and we had a patio door that overlooked Lake Huron, literally yards away. They have lots of little touches such as a laundry, WiFi, and a bonfire at night where you can roast marshmallows. But the biggest asset of this hotel is the staff. They went out of their way to make sure we were accomodated. The laundry usually closes at 10 PM, but we were running a little late and they gladly kept it open late for us. Anytime we made a request, it was answered with a smile and a \"can-do\" attitude.", "user": "JdubyaMO", "date": "July 2, 2009", "id": 33729830}, {"rating": 4.0, "stay_parameters": "Stayed September 2008, traveled solo", "text": "I went up to St. Ignace the weekend before Labor Day, 2008 to take in the sights of Mackinac Island as well as the Eastern U.P. When I arrived at the hotel, the desk clerk was quick to point out the different amenities that the hotel offered. She was also very friendly. The room that I stayed in was in the Ontario building near the lake, and the room was quite large for the price that I paid. Overall, I was highly impressed with the quality of the room. Then came Saturday, when I ran into car problems, and I ended up being stranded in Newberry, MI. I called the front desk of the Best Western back in St. Ignace, and told them I needed to check out since I wouldn't be back there until the following Monday. Though they were reluctant to do so at first for obvious reasons, they finally agreed to do so and had my suitcase packed at waiting for me when I showed up on Monday.", "title": "The staff was helpful, the room was very nice.", "helpfulness": 2, "user": "ronman_1969", "date": "January 19, 2009", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 23711971, "likes": {"liked": "— The staff's and management's willingness to help", "disliked": "— Nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2008", "text": "My wife and I booked a room for 2 nights based on reviews in TripAdvisor. We were more than satisfied and would not hesitate to return. The motel consists of several building, we stayed in 'Ontario' and it is 20 yards from the water with no obstructions. Excellent View, Clean, Friendly.", "title": "Love the place", "user": "keith_KK", "date": "October 23, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 21143615}], "location": {"country": "United States"}, "stars": 3.5, "variance": {"poor": 8, "average": 21, "very good": 128, "terrible": 3, "excellent": 363}, "aka": "Best Western Plus Harbour Pointe Lakefront Hotel Saint Ignace", "slim_ranking": 0.0384615384615, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 5.0}, "description": "An eleven acre resort-like property situated on the Straits of Mackinac shoreline overlooking Mackinac Island. Featuring two heated pools, indoor & outdoor with whirlpool spas, private balconies, fitness center & nightly shoreside bonfires and marshmallow roasts."}