{"user_rating": 4.0, "review_count": 469, "name": "BEST WESTERN PLUS Sonoma Valley Inn & Krug Event Center", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "Located just a couple of blocks from the Sonoma Plaza this BW is in a great location. They offer free parking, WiFi and breakfast.", "title": "A great place to stay in Sonoma.", "helpfulness": 1, "user": "kristad314", "date": "August 3, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 136177651}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "The rooms are nicely set, most having a fireplace and balcony. The rooms are quite comfortable as are the beds. Rooms have a little refrigerator, plenty of outlets and lots of space.", "title": "Good location", "user": "Daisybell56", "date": "August 3, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 136108570}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "The breakfast is located in the Krug center at the back of the property. Nice selection of yogurt, cereal, muffins, toast. There is also a waffle iron, but the waffles were so-so. There were also egg, sausage & cheese biscuits that you could cook up in a microwave.", "title": "Good location", "helpfulness": 1, "user": "Daisybell56", "date": "July 31, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 135937658}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "The staff is pleasant and the lobby offers coffee and ice tea all day long. My only gripe is that the room key cards tend to stop working. Both of our keys stopped working at different times and the same thing happened 2 years ago when we had stayed previously.", "title": "Perfect location, great amenities.", "helpfulness": 1, "user": "LoveAvila", "date": "July 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 135156826}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "While I have never had a chance to enjoy them, the pool and hot tub look lovely. All in all it's a great place to stay in Sonoma.", "title": "Great clean hotel in a great location", "user": "jskinner96", "date": "July 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 135108171}, {"rating": 3.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "Stayed two nights. Room is fairly large with a small sofa and table. Free wi-fi is good. Location is excellent and you can walk to the square in less time that it'll take to find a parking spot. Drugstore and Whole Foods market across the street are convenient. Good night lights for reading in bed, bathroom is clean and sufficient water in shower,", "title": "Good location, OK room.", "helpfulness": 1, "user": "65oski", "date": "August 14, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 4.0}, "id": 137186053}, {"rating": 4.0, "title": "Wow, stay here!", "text": "First floor rooms surround the pool which can be noisy in the afternoon. A/C is noisy and blows directly at one side of the bed...we ended up moving the couch to re-direct the flow but couldn't do anything about the noise.", "helpfulness": 2, "user": "Kristina B", "date": "August 11, 2012", "id": 136882156}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "There is a nice bike/walking trail about three blocks from the hotel. When I left for a morning walk at 7:00 two staff members were gossiping at the front desk; when I returned 40 minutes later they were still there. Not a problem but not a good sign. Free coffee and newspapers.", "title": "Good location & value", "helpfulness": 1, "user": "REALLYMR&MRSSMITH", "date": "August 8, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 136581114}, {"rating": 4.0, "title": "Nice location with predictability of the Best Western", "text": "Breakfast was in the meeting room at the back of the property. The usual cereal, muffins, and yogurt along with a waffle maker and some microwaveable breakfast sandwiches.", "helpfulness": 1, "user": "renatmin", "date": "August 6, 2012", "id": 136395495}, {"rating": 2.0, "stay_parameters": "Stayed August 2012", "text": "Excellent hotel, a block or two from town square. Clean, large room, continental breakfast (including make your own waffles) included with your stay. Our room had a fire place and i'm pretty sure they all had a minifridge. We are pretty picky hotel people and i would definitely stay here when returning to Sonoma.vthe only drawback is that The room could use a bit more lighting..however youre not really in Sonoma if you plan to spend much time in your room! Beautiful pool area with hot tub, fire pit, patio furniture and sauna. You can easily each lunch here and enjoy the pretty flowers and other foliage in Best Western's courtyard. Directly across the street there is a CVS and whole foods store.", "title": "Plate Up Hotel", "helpfulness": 3, "user": "Shepp22", "date": "August 4, 2012", "detail_rating": {"cleanliness": 4.0, "value": 1.0, "location": 3.0, "service": 1.0, "rooms": 2.0}, "id": 136233545}, {"rating": 4.0, "title": "Convenient", "text": "We recently spent 4 nights at Sonoma Valley Inn. Our room was very nice, even included a fireplace; no microwave although there was a small fridge. Comfortable sleeping, several courtyards, typical complimentary breakfast. Best thing was the location. Walking distance to the Plaza/downtown area--and Whole Food directly across the street. Extended our stay because we found it so convenient. About a 30 minute drive to Napa.", "helpfulness": 1, "user": "BaylorSheila", "date": "July 21, 2012", "id": 135021572}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "The rooms are nothing special. The breakfast is no big deal.", "title": "We always love this hotel", "user": "111patricia", "date": "July 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 134106587}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "BUT - the pool and hottub are spotless, the grounds are cute and well-maintained, the location is perfect, they have adjoining rooms (crucial when traveling with kids) and its within walking distance to the plaza.", "title": "Great location, nicely maintained property", "helpfulness": 1, "user": "Laura W", "date": "July 6, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 133610643}, {"rating": 3.0, "stay_parameters": "Stayed May 2012, traveled on business", "text": "we have stayed at this hotel 4 or 5 times now and they staff is always helpful, polite and cheerful, the rooms are always spotless. this is our sonoma vacation house.", "title": "Average Budget Hotel with Great Location", "helpfulness": 3, "user": "SMDTraveler", "date": "June 30, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 2.0, "location": 5.0}, "id": 133139081}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "This was a lovely, affordable option for the Sonoma Valley area. We really enjoyed the courtyard which included a heated pool, large hot tub, several tables with umbrellas, sauna, and firepit. The gardens surrounding the courtyard were beautiful, including hanging baskets around the hot tub. We ate at the tables with a newly purchased bottle of wine from our days of tastings and it was perfect. The rooms were decent and the overall experience was very good. We would recommend this property.", "title": "Excellent", "helpfulness": 2, "user": "HK12341234", "date": "June 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 132152661}, {"rating": 4.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "spent the day visiting wineries in sonoma valley and found this the perfect location to end the day. large size rooms with fireplace, beautiful outdoor area with firepit and hot tub. great place to enjoy a bottle of wine in the evening. the hotel is easy walking distance to shops and restaurants in sonoma. we did not partake in the morning continental breakfast delivered to the room. overall, we had a great stay.", "title": "perfect location at sonoma", "user": "soccerdeb", "date": "October 27, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 21294987, "likes": {"liked": "— location"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2008", "text": "We had a perfect stay at the Best Western in Sonoma, staying 3 nights in a Garden Fireplace King room that was very spacious with access from a small terrace out to the pool. The property is a short walk from the town square with restaurants and shops. Try to include a Tuesday night in your stay as there is a great farmers market in the square. A good spot for dinner is the Swiss Hotel – sit outside by the sidewalk and watch the world go by and chat to the locals. There are plenty of ‘Wineries’ to visit and the Benziger family estate does a good tour and tasting. Sonoma is a very lovely place with very friendly people.", "title": "Perfect stay in Sonoma", "helpfulness": 1, "user": "SmartMoney", "date": "October 20, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 21038316}, {"rating": 5.0, "title": "Fantastic suite", "text": "We stayed in room 321 for two nights. We had the nicest suite I remember ever staying in (including roms for three times this price of GBP£112 including tax - about US$180 I think).", "helpfulness": 2, "user": "BananaK", "date": "October 11, 2008", "id": 20799247}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "The suite was very spacious, clean and pleasantly decorated. The room had a good lounge area with coffee maker, fire place, tv, fridge and sink. The bed was huge and extremely comfortable and there was another TV which you could also watch from the (big jacuzzi) bath if you wanted! The shower room had two shower heads (very cosy) and there were two his 'n' hers sinks in front of a huge mirror.", "title": "Great little hotel - very centrally located", "helpfulness": 2, "user": "lorna1972", "date": "October 2, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 20574057, "likes": {"liked": "— location", "disliked": "— breakfast"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "There was an outdoor balcony with chair and sun lounger, although we didn't use this area as the view wasn't great and we don't smoke.", "title": "Great Stay!", "user": "RAIN2008", "date": "October 2, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 20548495, "likes": {"liked": "— Location"}}, {"rating": 3.0, "stay_parameters": "Stayed August 2012, traveled with friends", "text": "As noted by others, the location is fantastic and the rooms are a little dark and dated. However, our room and bathroom were not only meticulously clean, but the linens and bed were quite confortable (we sleep on a Tempurpedic at home), we had a room that opened onto the pool and we enjoyed pretty much all the hotel had to offer. The pool was refreshing (a little cold for me, but good for a quick dip), the hot tub was hot until 10 pm, the firepit was always a fun place to discuss the day's tastings and relax and I saw several people enjoy the small steam room. Towels were cheap but plentiful, and overall we had a nice stay.", "title": "Overall a very pleasant stay in Sonoma", "user": "jodi_123", "date": "August 27, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 138597741}, {"rating": 3.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "The only downers were some of the other guests. The Olympic wantabes in the room upstairs - really how many times can you leap and twirl in your room? And did the couple with the baby have to torture the poor thing in the pool? After making it scream for what seemed like hours - remove the baby from the pool! It does not like it! And the continental breakfast was mediocre.", "title": "Good location, nice hot tub and patio", "user": "summercruiser", "date": "August 27, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 138575459}, {"rating": 3.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "We would stay there again.", "title": "Big room, great location, a bit disappointing", "helpfulness": 1, "user": "Kelly B", "date": "August 21, 2012", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 137933829}, {"rating": 3.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "Hotel is close to the square and across from Whole Foods. There is a nice, large hot tub that was great. The pool area has both shade and sun and nice landscaping, although the pool is pretty small. There are large umbrella tables in the central pool area that are great for eating, laptops etc.", "title": "Good location. Comfortable room with fireplace.", "user": "Waterloonie", "date": "August 17, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 137458573}, {"rating": 1.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "Many of the rooms have a small patio that connects to the pool terrace.", "title": "Horrible!", "helpfulness": 1, "user": "shansmum", "date": "August 16, 2012", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 1.0, "sleep": 1.0, "rooms": 2.0, "location": 3.0}, "id": 137317922}, {"rating": 4.0, "stay_parameters": "Stayed May 2009, traveled with family", "text": "I spent one night here and paid, including tax, $255.17. I’ll start with the negatives and go from there. First, I have a pet peeve with hotels that charge extra for an in-room safe, especially when I didn’t use it. However, while this charge was broken out on my bill ($1.95/day) it was included in the total that was quoted to me when I reserved the room so no reason to complain.", "title": "Stay here for the location.", "helpfulness": 1, "user": "travelman1370", "date": "May 14, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 29949790}, {"rating": 5.0, "title": "Wonderful hotel with great location", "text": "The continental breakfast: I noticed that other reviewers loved it but I have to disagree, however that probably comes down to personal taste. There is an in-room coffee maker and frankly it made terrible coffee. The problem with the continental breakfast is that you have to decide what you want and when you want it the night before and call it in. And I’m just not someone who wants to eat a stone cold muffin in my room with bad coffee.", "user": "Muffy713", "date": "April 13, 2009", "id": 27894023}, {"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "The room itself: for a moderate hotel it’s a good enough room. Good size. I had asked for a quiet room so ended up with an upstairs room and heard very little outside noise. I was up and going relatively early the next morning, good thing as a couple of motorcycles cranked up a little later and then someone’s car alarm went off for a couple of minutes. Not the hotel’s fault. I will say that the air conditioner is one of those window unit types that has been built into the wall; if you’re a light sleeper you’re going to hear the compressor cutting in and out all night long.", "title": "Great hideaway hotel", "user": "Matju", "date": "February 16, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 24628511}, {"rating": 4.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "Those are the bad things, now the rest of the story. First, while I didn’t care for the continental breakfast, it was a quick five minute walk to the square and there are several places to choose from for breakfast. The key phrase here is: “five minute walk to the square”. The location is great, the square is great. We walked to breakfast, we walked to dinner, we walked around being tourists.", "title": "Great location and price!", "helpfulness": 1, "user": "OutlandoGirl", "date": "February 12, 2009", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 24514042, "likes": {"liked": "— Price and location.", "disliked": "— Lots of thumping from room above. Thin celiing??"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2008, traveled as a couple", "text": "The people at the front desk couldn’t have been nicer. The only coupons we got were the ones printed on our room keys for a couple of the wineries but that wasn’t important. They did offer brochures and maps, which was helpful.", "title": "Don't stay anywhere else in Sonoma!", "user": "rew01", "date": "February 4, 2009", "detail_rating": {"front_desk": 5.0, "service": 5.0, "business": 5.0, "cleanliness": 5.0, "rooms": 5.0, "location": 5.0}, "id": 24203662, "likes": {"liked": "— Mission style room decor with fireplace", "disliked": "— Nothing!"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2008, traveled as a couple", "text": "I stay here quite often and i love this place! Everytime i come visit my friends in Sonoma i stay here. The staff is wonderful and always very helpful with wine tips and COUPONS and of course since they are locals they know of the best places to eat. I love their garden rooms with the private patios, very fast access their courtyard with hot tub and pool!! They even offer a \"local's rate\" for those of us who are visiting our friends and family here! With in walking distance to the plaza too! What's not to love?", "title": "Loooove this place!", "user": "bananacrazi", "date": "January 16, 2009", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 23595754, "likes": {"liked": "— their friendly rates!", "disliked": "— nothing"}}, {"rating": 2.0, "stay_parameters": "Stayed December 2008, traveled as a couple", "text": "On the surface this place looked good, but after a closer inspection, Not. At check in, the front desk staff were buxom 20 somethings with their breasts pushed up to their chins. Typical \"valley girl\" speech and could not care less about being friendly for tourist questions. They acted as if we were interrupting thier local gossip. Not a good start.", "title": "Never Again", "user": "Kerityan", "date": "January 8, 2009", "detail_rating": {"cleanliness": 2.0, "front_desk": 1.0, "location": 4.0, "value": 2.0, "rooms": 1.0}, "id": 23390316, "likes": {"liked": "— Location", "disliked": "— roller coaster mattresses and crappy carpet."}}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "The rooms looked good at first, but the carpet was something out of a sticky coke infested old movie theater. Terrible. The mattresses were Terrible! And both hubby and I came out with very sore backs. The fireplace? What a joke. The smoke filled the room. The hot tub was nice though, until some kids broke a glass in it and they had to empty it.", "title": "Cool hideaway in the middle of town!", "user": "billk40", "date": "December 3, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 22423477, "likes": {"liked": "— The pool/courtyard area.", "disliked": "— Nothing really but if I had to pick I'd say the bathroom was freezing and the tile job was pitiful."}}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "As for location, Very good. A short 2 block walk to the Sonoma plaza.", "title": "Excellent for a Best Western!", "user": "sgh0814", "date": "November 21, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 22062046, "likes": {"liked": "— The value and location.", "disliked": "— The breakfast."}}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "The Black Bear restaurant across the street was lousy. Both in service and food.", "title": "loved it", "user": "Bedhog", "date": "November 1, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 21466650, "likes": {"liked": "— convenient to wine country, and really nice room", "disliked": "— loved everything"}}, {"rating": 3.0, "stay_parameters": "Stayed September 2008, traveled with friends", "text": "This place is nicer than one would expect for a Best Western - it's still a motor hotel type accommodation, but you can tell they've tried to upgrade here and there.", "title": "Decent Option", "helpfulness": 1, "user": "tonyk", "date": "September 28, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 2.0, "rooms": 3.0, "location": 4.0}, "id": 20434635, "likes": {"liked": "— Location", "disliked": "— Too Expensive"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "Probably one of the nicest features is it's location. It's right across the not very busy street to a shopping center with a Whole Foods and other convenient type stores. Also, the town square is just a block or so away. So you can walk to both convenient and necessary shopping, and also the restaurants and nice shops in the square area. Also, several tasting rooms are around the square. Sonoma is pretty low key, so it's not like you're in an urban setting. Also, it felt pretty safe. You can also rent bikes right at the hotel and head out for a ride on quiet streets, bike trails and go wine tasting. The bike riding in the Sonoma town area seems like it was way safer than out in the country with the busy, narrow and twisting roads.", "title": "Great Value", "user": "tali28", "date": "September 25, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 20365692, "likes": {"liked": "— Location", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "The rooms would be a bit cramped for a family - not alot of dresser or closet space. First floor rooms have direct walkout access to the very nice courtyard area - nicely land and hard-scaped with a small pool. But if you're more of a late sleeper, you run the risk of all the stomping around on the second floor - so request which floor you want based on these issues.", "title": "Would stay there again in a heartbeat!", "user": "ebnyc", "date": "August 26, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 19376834, "likes": {"liked": "— Location", "disliked": "— Nothing"}}, {"rating": 4.0, "title": "Nice digs for a family in Wine Country", "text": "The price was obscene - we paid $300 for a Friday and Saturday night - should have paid more like $150. The morning \"breakfast\" is free, and appropriately priced.", "user": "bostonpies", "date": "August 24, 2008", "id": 19317899}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "If you go wine tasting, don't forget to stop by the front desk for promotions - they'll set you up with discounts or 2-4-1 tastings.", "title": "Great Stay", "helpfulness": 1, "user": "monkeyfinger", "date": "August 7, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 18726914, "likes": {"liked": "— Location", "disliked": "— No in-house bar"}}], "location": {"country": "United States"}, "stars": 2.5, "variance": {"poor": 27, "average": 66, "very good": 194, "terrible": 18, "excellent": 164}, "aka": "Best Western Plus Sonoma Valley Inn & Krug Event Hotel", "slim_ranking": 0.545454545455, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}}