{"user_rating": 4.0, "review_count": 218, "name": "BEST WESTERN PLUS Saddleback Inn & Conference Center", "reviews": [{"rating": 5.0, "title": "A-1 Place to stay!", "text": "It is so nice to find a hotel that is clean and well managed. Our room was large, modern and clean. The restaurant is very nice. We had pie and coffee there and also breakfast buffet (comes with room $5.95 value each person). It had biscuits, eggs, pancakes, oatmeal, potatoes, gravy, fruit, danish and donuts, several juices, milk. It was great! We did not go into the saloon but it looked nice. We plan to use this hotel every time we go to Oklahoma City. We had a little traffic noise from I-40 but that is true of every hotel along that strip. Nothing that kept us from sleeping. We highly recommend this hotel!", "helpfulness": 3, "user": "lovetotravel064", "date": "March 4, 2007", "id": 6911303}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled with family", "text": "My family recently held a birthday reunion for our Mother at the Saddle Back Inn. The hotel staff handled all of the arragements.", "title": "Family Reunion/Birthday Party", "helpfulness": 2, "user": "SeaSchell-1", "date": "November 14, 2006", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 6127873}, {"rating": 4.0, "title": "Not Bad At All", "text": "Blocking rooms, setting up a buffet, ordering flowers and a birthday cake. The staff is very friendly and proffesional. The rooms are clean and comforable. We decended from NM, AZ, TX, and IL.", "helpfulness": 16, "user": "glbtrttr", "date": "June 4, 2006", "id": 5296980}, {"rating": 4.0, "stay_parameters": "Stayed July 2005", "text": "There is a shuttle available for the airport and a trolly to take you downtown.", "title": "Excellent Family lodging, great staff, we recommend!", "helpfulness": 14, "user": "antique_lover", "date": "July 21, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 4.0}, "id": 3690833}, {"rating": 5.0, "stay_parameters": "Stayed June 2005", "text": "Also if you want an excellent desert, or order a cake for a party try the \"Raspberries 'n' Cream Bakery. That is who provided our cake. It was terrific.", "title": "One of the best!", "helpfulness": 12, "user": "Sergeant", "date": "June 20, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3576464}, {"rating": 4.0, "title": "Not bad", "text": "Not a bad place to stay. Friendly staff. Manager's reception M-TH nights. Free draft beer (Bud Lite only). Outback Steakhouse within walking distance. Would recommend.", "helpfulness": 17, "user": "A TripAdvisor user", "date": "March 23, 2002", "id": 472910}, {"rating": 2.0, "stay_parameters": "Stayed June 2007, traveled with family", "text": "I checked into this hotel based on reviews. Once we got to the hotel, we checked into our rooms. We had to go back outside and walk to the end if the hotel and get to our rooms. Once we arrived, we went into the first room, which was on the first of two rooms on the first floor. They were supposedly non-smoking, but once we got in, it reaked of cigarette smoke. The senond of the two rooms wasn't as smoky but was very moldy smelling and musty. We called the front desk and asked for two different rooms. They situated us with two rooms on the second floor. The first room was fine and smelled fine. The second was a little moldy smelling, but not too terrible. The bathroom doors stick and my ten-year-old son got trapped inside. Some lightbulbs are burnt out and you cannot buy movies or play games on the televisions. There was a dead junebug under the bed. Frankly, I don't see what all the hoopla was all about. Of the four hotels we stayed in during this vacation, this one has been by far the worst.", "title": "Smelly, Beds not very comfortable.", "helpfulness": 3, "user": "Cyberdaddy", "date": "June 19, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 2.0, "value": 1.0, "location": 1.0, "rooms": 1.0}, "id": 7939486, "likes": {"liked": "— Nothing", "disliked": "— The smell and cleanliness of the rooms."}}, {"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled on business", "text": "Stayed here for a few days during the week. Meridian (main n/s road near hotel) was under construction at the time, but the hotel is still convenient to the freeway and Reno Ave (which go downtown.) Price was right ($79...\"corporate\" rate.) The south side of the hotel is near the freeway so avoid that side if you want it quiet.", "title": "Not bad and good location", "helpfulness": 2, "user": "mcstix", "date": "May 24, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 7684409, "likes": {"liked": "— Close to Ford Center (concerts and sporting events) Best bang for buck near airport.", "disliked": "— Maid talked loudly outside my door one morning and woke me up!"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled with family", "text": "Hotel is within walking distance of OKC's largest indoor gun range, so if you're into the shooting sports, it's very convenient. They rent guns there, too. You can't of course hear guns going off at the hotel at all, since it's an indoor range. I'd worry more about the freeway noise.", "title": "Very good Best Western - convenient for Stockyards City", "helpfulness": 1, "user": "anhinga", "date": "May 7, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 7555003, "likes": {"liked": "— Nothing", "disliked": "— Nothing"}}, {"rating": 3.0, "stay_parameters": "Stayed March 2007, traveled on business", "text": "There is also a friendly \"biker\" bar and restaurant near the hotel, but I had no problems from any bikers (except the noise at times...though not late at night.) I love bikes, but the loud ones are mostly appreciated only by the ones riding them! Loud pipes don't save lives, they only annoy other people when they go by!", "title": "Decent hotel for the price I paid.", "helpfulness": 5, "user": "Paul-SArlington", "date": "March 20, 2007", "detail_rating": {"front_desk": 3.0, "service": 2.0, "cleanliness": 3.0, "value": 3.0, "rooms": 2.0, "location": 4.0}, "id": 7195978, "likes": {"liked": "— location", "disliked": "— rooms could use some updating."}}, {"rating": 3.0, "title": "OK for an overnight", "text": "Near the hotel are several decent restaurants and your usual Denny's, Subway, Outback etc. The hotel food is not bad...and the hot breakfast buffet is pretty good for \"free\" actually. There is a bar on site, too, which is closed Sundays. The \"manager's reception\" at the bar during the weeknights claims \"free drinks.\" I think they only serve draft beer for free though, but am not sure. Lots of people hang out there just after work it seems, mostly oilfield I think. They are nice enough, but it just made the bar a little loud for me during \"happy hour.\"", "helpfulness": 4, "user": "2draw", "date": "March 16, 2007", "id": 7172408}], "location": {"country": "United States", "city": "Oklahoma City"}, "stars": 3, "variance": {"poor": 14, "average": 21, "very good": 75, "terrible": 7, "excellent": 101}, "aka": "Best Western Plus Saddleback Hotel", "slim_ranking": 0.153284671533, "description": "The BEST WESTERN PLUS Saddleback Inn and Conference Center is one of the best business and leisure hotels in Oklahoma City. We pride ourselves on offering professional hospitality within a comfortable setting while offering up to date amenities with personal service.The Saddleback Inn and Conference Center is located just one mile from the Oklahoma State Fairgrounds and only five minutes from the OKC Airport If you are on a family vacation you will appreciate the close proximity to the amusement parks at Whitewater Bay, Frontier City, and Celebration Station. Our hotel is also conveniently located close to to Bricktown, Downtown. The Saddleback features 220 stylish and newly furnished hotel rooms featuring an ergonomic work desk area, free high speed internet access and over 80 great cable channels including multiple HBO Movie channels. Our oversized guestrooms feature designer Southwestern décor and provide safes, microwaves, refrigerators, 42\" LCD Televisions and more. For additional space you may also choose Oklahoma City suites with two televisions with separate living and sleeping areas, which are some of the most luxuriously equipped rooms of any of the hotels in Oklahoma City. To ensure a great start to your day, our Oklahoma City hotel serves a complimentary deluxe breakfast buffet with over 50 items each morning."}