{"user_rating": 4.5, "review_count": 148, "name": "BEST WESTERN Devils Tower Inn", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "When touring the Devil's Tower area you can't go wrong staying here. The service was very good, accomodations very clean and comfy, and the price...unbeatable. There is a very good dinner just around the corner too! I suggest this place.", "title": "Great Tour Stay", "user": "Cap10K", "date": "July 24, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 72177324}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "Clean, nice pool and hotub. Everything you'd expect from Best Western.", "title": "In the Shadows of Devil's Tower...almost", "user": "TimeTraveler0123_10", "date": "July 21, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 71836474}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "This is your best place to stay for a visit to Devil's Tower. It appears to be very new. Our room was clean, spacious, and comfortable, and we appreciated the western decor. We were on the first floor, so the lack of an elevator was not an issue; if that would be a problem, be sure to request a room on the ground floor. We did not hear noise from other rooms, but there was noise from outside from some kind of event with music and voices. The breakfast offerings were sparse but acceptable. From our standpoint, we would stay here again for one night. As others have said, it is a very small town, so your eating options are minimal; the sandwich shop across the street does have excellent sandwiches.", "title": "Convenient Location for Devil's Tower", "user": "cliving", "date": "July 16, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 71134388}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "We had visited Devils Tower that day and only stayed in Hulett as it was nearby. However we were pleasantly surprised to find this nice hotel in such a small town. The room was clean and spacious and the pool was a good size and clean. There is no elevator so if you have a lot of luggage, request a room on the first floor like we did. Also there is a small downtown within walking distance with a sit down restaurant and a pizza place. I also siggest you go a 1/2 mile down the road and up the hill to visit the golf country club. You can eat there, but it is worth just driving around to see this amazing golf course dotted with some of the largest and fanciest log cabins I have ever seen.", "title": "Nice hotel in a very small town", "user": "TexasTraveller56", "date": "July 11, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 70519638}, {"rating": 1.0, "stay_parameters": "Stayed June 2010, traveled with family", "text": "No elevator. Ever traveled with children and the mountains of stuff they require, inc. strollers? We checked in and then walked into town for dinner. When we returned to the hotel an hour later, our youngest child was crazy tired and crying, ready to immediately hit the crib. The crib, which was discussed during check-in, was sitting all folded up in the lobby. We had the children, one of whom has to be carried, luggage, and the hotel expected us to carry the crib up ourselves. I asked the front desk to have someone help us with either the crib and / or our luggage. She made a disgusted face and ignored me. I was standing right in front of her and that was her response? I nearly went ballistic, dropping F-bombs, but instead decided to focus my energies elsewhere, like carrying everything up the slippery staircase. The Best Western chain should be both appalled and ashamed that the people who work in their Hulett hotel represent them and represent them so poorly. Would I recommend this hotel? Not a chance. Would I stay there again? Not on your life.", "title": "Customer Service -- HA! Rude & Unhelpful", "helpfulness": 1, "user": "June_Boys", "date": "June 14, 2010", "detail_rating": {"service": 1.0, "cleanliness": 5.0, "value": 2.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 67527040}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "Hulett was a last minute decision when the attractions of the Black Hills and Devil's Tower extended our travel day. And a good decision it was, for the Best Western motel was very nice, and no more pricey than the alternatives in remarkably expensive Gillette further west. The motel was attractive, clean, and convenient, and just a couple of blocks from an excellent supper at the Ponderosa Cafe. That restaurant is for sale, though, so dining might be chancier in the future.", "title": "Off the beaten path", "user": "shunpiker39", "date": "September 7, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 78596302}, {"rating": 2.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "I had started to stay at Sundance, but were scared off by some of the reviews and decided to stay here instead. What a mistake.", "title": "Stay somewhere else", "helpfulness": 1, "user": "HUSKERTRAVELER", "date": "August 21, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 76150195}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "The only good thing I can say about the place, besides the fact that it is very close to Devils Tower, is that I liked the decor. The western themed wood trim, moldings, and furniture were nice.", "title": "Nice hotel, quiet town.", "user": "Hogaholic29", "date": "August 16, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 75540420}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "The hotel appeared new, but nothing worked well. There were only about ten channels on the TV. It took several attempts to flush the toilet, and the water in the shower had very little pressure and was so soft it took a LONG time to rinse out your shampoo and rinse the soap off your body. The microwave burned up popcorn on the popcorn setting. After making one cup of tea the one cup coffeemaker would not turn on again for about five minutes. It took me two hours to make two bottles of tea. The clock kept making this strange morse code like sound totally at random and at different sound levels. ( It sounded like the aliens were trying to communicate or something.) Needless to say we were awakened by it a few times. The thermostat was IMPOSSIBLE to adjust. The air conditioner ran full blast and made the room too cold. There was no off switch. If you turned up the temperature the heater came on.", "title": "Shiny new hotel with comfortable room, but you may need ear plugs", "user": "Yerun", "date": "August 11, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 74796933}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "The front desk had a bell to ring for service that played the theme from Close Encounters. While cute, it was so loud that you could hear it in your room at the end of the hall, which wasn't so cute, especially at night.", "title": "Excellent stay and pretty close to Devils Tower.", "user": "stevesgirl", "date": "August 10, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 74600200}, {"rating": 3.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "You basic Best Western, very clean nice indoor pool area well kept common areas but the breakfast which is supposed to go until 9 AM was gone by 8:10. The Best Western Four Presidents in Mout Rushmore had omlettes, biscuits and gravy, waffles, fruit, yogurt, bacon and juice fully stocked until well past 9 AM.", "title": "good place no breakfast though", "user": "trotter88", "date": "June 20, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 2.0}, "id": 114531821}, {"rating": 3.0, "stay_parameters": "Stayed June 2011", "text": "Air conditioner didn't work. No compensation offered. Would not return.", "title": "Air conditioner didn't work.", "user": "ChromeAce", "date": "June 15, 2011", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 3.0, "service": 2.0, "rooms": 2.0}, "id": 113660016}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "I'm usually reluctant to stay at a Best Western because of prior experiences. We had limited options near Devil's Mountain so took a chance. We were pleasantly surprised. The rooms were spacious and clean. The bathroom a bit on the small side but not bad and better this most bathrooms in this price range motel. I did not try the breakfast. My husband did and thought it was “okay”-the typical breakfast at these type establishment. My sister and her husband ate breakfast at the nearby “Ponderosa”(no, not part of the chain)-they found it gross and felt that in light of that the motel breakfast was a treat.", "title": "A good place to stay", "user": "YRHips", "date": "June 11, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 3.0}, "id": 112808289}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "I recommend this motel as a clean, comfortable place to stay for a short stay.", "title": "Only choice in town; thank goodness it's very good", "user": "ClevelandJP", "date": "June 6, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 3.0, "value": 4.0, "service": 4.0}, "id": 111828079}, {"rating": 3.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "Seriously, I think this is the only hotel available in Hulett, WY. We choose it because of its proximity to Devil's Tower. The staff was nice and the room was clean.", "title": "OK for a stopover", "user": "Casualist", "date": "February 8, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 95888644}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "One of the better hotels we stayed at during our trip, shame it was only for a one night stopover. The hotel is a large log constructed building that offers a lot of charm...a far cry from your average bland kit chain hotels.", "title": "Lovely hotel 6 miles up the road from Devil's Tower", "helpfulness": 1, "user": "LVSaint", "date": "July 27, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 115828704}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "Great bed, great shower, spacious room, good wifi. Very clean, very well furnished and in great condition. Nice indoor pool.", "title": "Great Place to Stay", "helpfulness": 2, "user": "Jayman50", "date": "July 21, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115620762}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled with friends", "text": "Simple but adequate continental breakfast.", "title": "Pleasant surprise", "user": "Ojibwas", "date": "July 14, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 4.0}, "id": 115355175}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "Hotel corridors also accessible from a side entrance from the car park.", "title": "Great views and Great people!!", "user": "RobinMo74", "date": "July 12, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 4.0}, "id": 115299401}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "I'd have preferred a room that did not have the adjoining door to the next room as it made it easier to hear next door, but luckily they were considerate when it got late.", "title": "Wonderful", "user": "Phoebe729", "date": "July 10, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115213344}], "location": {"country": "United States", "city": "Hulett"}, "variance": {"poor": 1, "average": 11, "very good": 47, "terrible": 1, "excellent": 88}, "aka": "Best Western Devils Tower Hotel", "slim_ranking": 0.333333333333}