{"user_rating": 4.0, "review_count": 236, "name": "BEST WESTERN Old Colony Inn", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled solo", "text": "I stayed here for two weeks, so can report this is a consistently good place to stay. It's cozy (not too big), quiet, clean, and friendly. The free breakfast is good, and the free snacks really do make a difference. So nice when you just have to have something at night. The staff is friendly, helpful and pleasant. I really appreciated the shuttle bus, as it took me to the train station every day or into Old Town Alexandria, which was too far for me to walk. The location is excellent. There is a grocery about a block away which is another option for snacks or carry out food. There is plenty of free parking which appears to be rare around here. It's quiet, even though it's just off the main road, and it's a lovely residential area. Oh, and the beds are comfortable, with thick fluffy comforters, the towels are nice, and the tv's are new. Pretty much everything you could want.", "title": "A very comfortable place to stay", "helpfulness": 3, "user": "gail193", "date": "February 4, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124111124}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled with friends", "text": "The hotel room it's self was average, but with the extra amenities they offer I bumped my rating to 4 stars. The hotel is secluded in a residential area, however the shuttle service can get you to where you need to go... the airport, Old Town, and the metro station. The shuttle drivers were friendly and informative, it made using the service easy. It's a convenient subway ride in to D.C. and worth saving money spent on a hotel by staying in Alexandria. The snack bar was great as well, I was able to get bottled water whenever I wanted. The only real issue I noted with the hotel was the bathroom, it's outdated which made it look some what unclean. Other than that I had a nice stay, and would recommend staying in Alexandria if visiting Washington D.C. We were able to see and do everything we wanted in D.C., along with seeing OLD Town Alexandria which wasn't initially on our list of things to see.", "title": "Good place to stay if visiting the D.C. area.", "user": "Bratt3746", "date": "January 31, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 123918575}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled with family", "text": "I definitely recommend this hotel. The furniture in the room was really nice and the room was clean. We were surprised to see so many items stocked in the kitchen and all were free. The desk, breakfast and shuttle staff were friendly and helpful. The free breakfast had a combination of hot and cold items. They provided a good selection for a complimentary breakfast. Cons: The room doors are a little loud when closing and could be a problem late at night. We stayed during Thanksgiving week so everything was nice and quite. We will stay here again!", "title": "Great Value for Alexandria & Washington DC Area", "helpfulness": 1, "user": "John C", "date": "January 31, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 123912051}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled solo", "text": "I'm an Alexandria native. I stayed at this hotel for 6 days when there was a plumbing problem in my bathroom that required nearly a week's worth of repairs. I asked around, and this hotel had the best reputation for a middle-of-the-road priced hotel in the city. I have to say it earned its reputation.", "title": "Probably the best modestly priced hotel in Alexandria", "helpfulness": 2, "user": "SerendipitySari", "date": "January 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 123313437}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "On the plus side, the room was clean, the staff was exceedingly friendly and helpful, and the complimentary snack kitchen on the second floor with the microwave was really great for such a long stay. If you're a real tourist and want to get into DC, the have a complimentary shuttle bus that will take you to the metro so you can get into the city, which is pretty much the best way to do it. The shuttle can also take you to Old Town, which is the most fun part of Alexandria with the exception of maybe Del Ray.", "title": "Very, very good.", "helpfulness": 1, "user": "Xnient", "date": "January 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 122429085}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "We chose this hotel because it was close to family and within walking distance to Old Town. This hotel is your average hotel. You will find an average room with average bedding and towels. The beds were comfortable and the room was clean. The room was big enough that we had no trouble finding a spot to put the pack n play. There is no elevator, so keep this in mind if you have kids, and kids stuff to bring upstairs. The location is great,11 blocks to King Street, so a bit of a walk but where you will find lots of shops and restaurants. The hotel offers a shuttle, which we didn't use, so I can't comment on it. The hotel offered breakfast, which was good, we didn't have to leave hotel to find breakfast. The breakfast was average, typical continental things to choose from, including make your own waffle. The breakfast room had one high chair, we were fortunate not to have to wait to use it, but I could see it being a problem if there had been many toddlers or babies. The hotel also had a snack room which was great. Variety of snacks and juice or water or soda. I would stay here again. It was also close to the airport. It is set back from the street a little, so you might drive by it once. Also, there was a playground a couple blocks away, which was great for our toddler. Also close to walking path right along the Potomac which was really nice. The front desk clerk when we checked in was great and grabbed a map of the area and gave me an idea of what was close by, she even pointed out a coupon for a restaurant, we didn't end up using it, but it was great that she pointed it out.", "title": "Best Western Old Colony", "helpfulness": 2, "user": "lola72", "date": "April 24, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 128536083}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "I really hate to write too much of a glowing review for this charming hotel for fear I will soon not be able to get reservations or that the price will be moved up to other hotels in the area. Since our son and his family live in a little tiny house in the area (aren't all houses here tiny unless you are a billionaire?), we must stay in in a hotel that is close to their home. This one is perfect and when you compare the price to other hotels in the area, this one is an exceptional value. Throw in the free parking and the proximity to Reagan National (and the easy hotel shuttle to and from the airport) and you have a bargain. Oh, and the huge, delicious and FREE breakfast is another perk.", "title": "Our Home Away From Home!", "helpfulness": 4, "user": "lindypc", "date": "April 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 128355518}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "The hotel also has a shuttle into the site-seeing areas that we haven't used. We come to see our little granddaughters so we'll normally take the hotel's shuttle from the airport to the hotel and our son or his wife will pick us up and take us to their home. We call the hotel when we have our luggage and voila! they are here to pick us up in less than 10 minutes. We'll then take a car back with us so the free parking is an unusual bonus in this area. The hotel is close to a grocery store and to Trader Joe's so if you want some wine or goodies that you can't find in the Colony Inn's (free) snack room, this is another advantage. Oh, and did I mention the free wireless internet?", "title": "What a wonderful hotel", "helpfulness": 3, "user": "mitranee", "date": "April 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 128219569}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "The hotel has been remodeled and the rooms, although older, are outfitted with everything you need--they are also very clean.", "title": "Excellent stay!!", "helpfulness": 2, "user": "Bassetlove", "date": "April 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 128028107}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "Prior to our first visit to visit our family after they moved, I looked for many, many hours for a hotel room that would be affordable for retired teachers and this one was the only one that had everything we needed including:", "title": "March 27, - April 3, 2012 7 night stay", "helpfulness": 2, "user": "huntwildturkey8254", "date": "April 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127997731}, {"rating": 3.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "I was driving home and needed a place in the DC area for the night. The reviews were good and the price was very reasonable and the parking was free. This hotel is very hard to find, even with a GPS. You cannot see it from the road. The lady who checked us in was very nice and explained that there was a kitchen upstairs with snacks and that breakfast was served downstairs in the morning. The hotel has no lobby to speak of. We were on the second floor and there is no elevator so we had to lug our luggage up a flight of stairs. Our room was slightly on the small side. The beds were comfy and the furniture was in good shape. The walls were very old fashioned with textured paint. I was unhappy with the bathroom. I can accept an old bathroom but the floor was dirty with hair all over it. The kitchen was very nice. There were all kinds of snacks available and sodas, water and ice cream too. We all appreciated this nice touch. I was amazed when I saw a departing guest fill up his cooler with sodas, water, etc for the road. There is a note that clearly requests that guests not be greedy. Breakfast is included and served downstairs and it was very nice - eggs, meat, bagels, cereals, waffles, etc. The hotel was Ok for a night but I probably wouldn't return.", "title": "OK", "user": "JLW05", "date": "December 31, 2011", "detail_rating": {"service": 5.0, "cleanliness": 2.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 122329386}, {"rating": 2.0, "stay_parameters": "Stayed December 2011, traveled on business", "text": "I arrived at the hotel, in the night. My Garmin, and Google maps on my phone, could not find this place. It is located on a road that is parallel to it's address. And, it is not easy to get to that road. The hotel itself is fine. The help is friendly and they take care of their guests. The room was clean, the bedding okay, and they have free internet. There are no restaurants that are close by.", "title": "Nice Hotel, If You Can Find It", "user": "Harvlis", "date": "December 30, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 1.0}, "id": 122263640}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "Very satisfied with the hotel, staff, location and price. Only two complaints. One of the reasons we chose this hotel was for the \"hot\" breakfast included in the price. Unfortunately, the breakfast was room temp, the \"sausage\" was what appeared to be hot dogs and there was no coffee!! There was, however, a free snack room which we took full advantage of and there was a pot of coffee there. Hopefully this is not a daily occurrance. The other complaint was that all the rooms on our floor were non-smoking, but there was definitely smoking going on somewhere on the floor - very overpowering. The front desk clerk was exceedingly nice and the bed was very comfy. We'd go again.", "title": "Quick Weekend Getaway", "user": "Lori M", "date": "December 19, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121903451}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "This could have been a 5 star because of its reasonable price. I gave it 4 only because it is getting a little old but nothing to detract in a big way. The most important thing was the good staff at all levels. The room is large and the beds very comfy. The bathroom is fine but the fixtures are old now. There's a desk in the large room with wifi and ethernet. Both worked fine. The usual flat screen TV. They have a fitness center and biz center if you need printouts. Breakfast is generous and has everything you might want. There's a shuttle service to get to the metro line to DC and local Alexandria attractions, which are not far away. The Best Western chain has been dependable and a good value for us in various locations including Europe. This was no exception. wouldn't hesitate to return and look forward to the minor renovation I believe they will eventually do.", "title": "Great Value", "helpfulness": 1, "user": "getgs", "date": "December 6, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 121474268}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled on business", "text": "My husband and I stayed at this Best Western because he had business in Old Town Alexandria. The price--137 dollars--for this area--was terrific, and the hotel served a free breakfast. Also, because I was along to keep him company, they let me stay in the room until one o'clock. This is the first Best Western that I've stayed at that has had a free snack room! Free water bottles, pretzels, trail mix, etc. The room was clean, if old, as was the bathroom, and the bedding was terrific.", "title": "Excellent for the price!", "user": "Eleanor W", "date": "November 27, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 121097639}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "We stayed at the BW Old Colony Inn while visiting Washington D.C. The hotel was clean, comfortable and quiet. The breakfast area was large, clean and well stocked. The hostesses were very attentive to refill items and clean as needed. The breakfast was good....scrambled eggs, sausage, potatoes, cereals, muffins, etc. The \"snack room\" was a complete and wonderful suprise. I have never heard of a hotel having one, much less free. It was so handy to us heading out to DC every day and stocking up on water (We were there in late July, we went through LOTS of water). It was well stocked daily and offered assorted juices, chips, crackers, granola bars, etc. The hotel shuttle took us to and from the airport and metro station, which came in very handy. In one quick call, they were always there. My only complaint about this hotel would be the lack of an elevator. Trying to haul luggage (and 2 children) up stairs is quite cumbersome. I loved this hotel and I would definetly stay here again.", "title": "Would stay here again", "helpfulness": 1, "user": "LK4Bama", "date": "April 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127566171}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "We stayed at the Old Colony inn for 3 days and it was wonderful. The staff was so friendly and accomodating. They had a full breakfast which was very good. The amazing thing they had was a snack room that was free. It was well stocked with all kind of goodies. The rooms were very clean and nicely furnished. There is no elevator. The breakfast is in the basement and snack room is on 2nd floor. If you are not able to do stairs then this is not the place you need to stay. They have a shuttle that takes you to about anywhere you need to go. We would differently stay here again.", "title": "Wonderful Experience", "helpfulness": 1, "user": "wonderSouthCarolina", "date": "April 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 127335420}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "My wife and I stayed at the BW Old Colony Inn for 5 nights, starting on March 19th. We chose this hotel based on reviews and the value it offered. The hotel itself is located on North Washington Street in Alexandria and, as some reviewers have stated, it can be tricky to find the entrance. Our gps had no problem getting us there but you do need to being going northbound on North Washington to get into the property. Parking at the hotel is free and we had no problem getting a space in the covered garage. There’s outside parking as well. The neighbourhood around the hotel is pleasant and has a residential feel to it. Within a short walk, there is a Giant supermarket where, along with food, you can purchase wine, beer and Smartrip cards for the Metro. There were a couple of restaurants nearby but we didn’t try them, preferring to eat in Alexandria or Crystal City if we weren’t in DC.", "title": "A pleasant and convenient stay in Alexandria", "helpfulness": 4, "user": "D&MUpnorth", "date": "April 2, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 127126214}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "Hotel. The hotel itself is older, but it was clean and tidy. Our room on the second floor was generally quiet. However, as stated in other reviews, there is no elevator so be prepared to carry luggage up the stairs if you are on the second floor. Also, our room, 227, was located close to the well publicized snack room on the second floor. It’s open 24 hours, which is great if you need a snack at 2 a.m., but not so great if you are trying to sleep and there are people using the room who don’t understand the concept of speaking quietly or not letting kids run around at that hour. If I could suggest one thing to the owners, it would be to close the room at 11 p.m. to avoid the problem. All of the staff that we dealt with from the front desk, to service staff to the shuttle drivers were more than pleasant. There is no wireless internet in the rooms but there is a wired connection if you have a laptop. I was able to access open wireless connections most nights using my tablet but the signals were coming from outside the hotel and were fairly weak. The room itself wasn’t fancy or updated but we found it clean and comfortable. The bathroom was fairly small but everything worked and the water pressure was good. The flatscreen tv worked well and there was a good selection of channels.", "title": "Outstanding hotel and staff", "helpfulness": 2, "user": "patricia2", "date": "March 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 125681425}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "Transportation. We had our car with us and used it whenever we went into Old Town Alexandria or Crystal City. We had dinner in Alexandria on a couple of nights and had no trouble parking at meters on the street. Alexandria is a very pleasant town in which you can stroll, shop and eat. Crystal City is a short, but circuitous drive away but it has a great selection of restaurants and shops. Parking there is in lots under the office buildings and was free after 4 p.m. Each morning, we made use of the hotel’s free shuttle to take us to the Braddock Metro station. From there it was a convenient ride into downtown DC. We purchased Smartrip cards which are very convenient as you can add money at machines in the Metro stops. The cards aren’t time limited and you can add as little or as much money as you like using cash or credit cards. You tap the card as you enter the station and then again as you leave and the amount for the trip is deducted. We also used our car to go on a day trip to Leesburg to see the Air and Space Museum and then drove back into DC to tour around a bit. This was a mistake as we experienced some major traffic jams. It wasn’t a big deal as we are from a large city with similar traffic, but it was a waste of a couple of hours. Take the Metro! There has been mention of not so nice areas around the Braddock Metro stop and warnings about not walking back to the hotel. We did walk back, up Madison Ave., on a few occasions during the day. It took 20 minutes from the Metro to the hotel. The area in question is a low income housing area and was similar to what you’d find in any large city. The area was clean and not threatening as far as we were concerned. There is also a lot of construction going on and we were told that the low income housing is gradually being replaced by more expensive condos.", "title": "Very Nice and Clean great place to stay, but watch the room rate", "helpfulness": 2, "user": "Sonshyn", "date": "February 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124733966}], "location": {"country": "United States", "city": "Alexandria"}, "stars": 2.5, "variance": {"poor": 9, "average": 26, "very good": 89, "terrible": 9, "excellent": 103}, "aka": "Best Western Old Colony Hotel Alexandria", "slim_ranking": 0.48, "detail_rating": {"service": 4.5, "cleanliness": 4.0, "value": 4.5, "sleep": 4.5, "rooms": 4.0, "location": 4.5}}