{"user_rating": 4.0, "review_count": 310, "name": "BEST WESTERN PLUS Humboldt House Inn", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "Good location just off the highway and close to main street. Room comfortable, clean and quite large. Not too noisy either. Check in was very busy with only one effective staff member on duty- disappointing as they knew they were fully booked. Not much choice in town for dining which became a problem with so many visitors. Breakfast included but not inspiring. Happy hour with wine and snacks was a nice welcoming touch. Would recommend for short stay. Reasonable price for this location.", "title": "OK for short stay", "user": "happytravellersdandh", "date": "September 15, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 177318938}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "We are so glad we stayed here after seeing what else is available in town. There is a wonderful evening wine reception with seating inside or in atrium type setting. We sat in the atrium area and struck up conversations with other fellow travelers. The hostess kept our wine glasses full without us having to leave the table. The room was spacious and nice and there was a balcony with table and chairs overlooking the pool. On a warm night there is nothing better. Breakfast was good, too, with waffles, eggs, sausage, bacon, biscuits and gravy, cereal, and yogurt. No complaints here!", "title": "Best Place to Stay in Town", "user": "lam77s", "date": "September 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 177068934}, {"rating": 2.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "Pros: The room was spacious and comfortably furnished. There is an extra sink outside of the bathroom which was convenient. We had a lovely balcony overlooking the pool; it was fairly quiet at night.", "title": "Very surprised at a BW Plus property", "user": "HappytrailsTucsonAZ", "date": "September 13, 2013", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 177059148}, {"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "Cons: We arrived at 4:30 p.m. and our room wasn't ready; didn't get off to a great start. The lighting in the room was horrible; you literally couldn't see in the bathroom, and the florescent bulb was flickering. The wifi access was truly awful. We travel with both a pc and an ipad, and the ipad kept insisting that we re-login. The access was so slow on the PC that we literally were being timed out of applications; could NOT blog at all; very disappointing. They have a laundry room for the use of guests, but it appears that the floor in the laundry room has NEVER been washed; it was disgusting.", "title": "Nice rooms", "user": "Kim R", "date": "September 11, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 176777014}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "This is a nice hotel in the area, the rooms are well decorated. We had an end room on the 2nd floor, perfect location as it was quite.", "title": "Spectactular views", "user": "Lori W", "date": "September 10, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "location": 5.0, "service": 5.0}, "id": 176702722}, {"rating": 3.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "There aren't many choices in Garberville and I can't imagine any of the other properties being better that this one. The hotel is decent, but, check-in was very slow. We arrived after 4 PM and there were still some rooms that had not been cleaned. Our was ready. The room was large with the usual amenities e.g. large TV, fridge, wi-fi etc. The front of the property is near a busy and sometimes noisy road. We enjoyed the wine/cheese reception. We didn't use the pool or spa as they appeared to no be too clean. The air conditioning worked well and was needed because of the noisy road and the super duper heavy comforter on the bed. The things must have weighed 10 lbs. Don't know why it was necessary. Breakfast was OK, but with a full hotel seating could be difficult. If you are going to stay in Garberville this may be your only choice. It's OK but not great.", "title": "Good Best Western With A Few Issues", "user": "highdesertbadger", "date": "October 7, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 3.0}, "id": 180115400}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "Our room was very clean , the bed was comfortable, great pillows& bedding . Bath nice with two sinks . Free wine & cheese was a treat . The breakfast had everything you needed , very good , everyone who worked there treated you kindly , I would stay there again", "title": "Best motel out of 5 on our trip", "user": "VGA2013", "date": "October 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 180109158}, {"rating": 2.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "This hotel is located in a sketchy area with too few parking spaces and poor lighting in the parking lot. We arrived around 9 pm and wanted to grab a bite to eat preferably someplace close within walking distance. The desk clerk suggested a place a block away but after walking there, we found that every restaurant in this part of town was closed already. Along the short walk from the hotel, we were approached by no less than 6 or 8 (presumably) homeless folks sacked out in the doorways of closed businesses. Most were 20-somethings with backpacks, hanging out with others. There was no aggression, but it was a bit intimidating for my wife and I to run into this in a tiny town as we walked along the poorly-lit street.", "title": "More of a motel than a hotel", "user": "rolandws", "date": "October 7, 2013", "detail_rating": {"service": 3.0, "cleanliness": 1.0, "value": 2.0, "sleep": 2.0, "rooms": 2.0, "location": 1.0}, "id": 180080858}, {"rating": 4.0, "title": "Good Value and Location", "text": "Back at the hotel, we settled into our room. It was furnished nicely, but not particularly clean. There was hair in the ice bucket - ugh! The hotel appears to be a 'home away from home' for many contractors. There were many contractor vans and pickup trucks in the parking lot. In turn, very early the next day the noise of diesel trucks starting at sunrise woke us up much earlier than we would have preferred.", "user": "Chowa-Rides-Again", "date": "October 6, 2013", "id": 179875270}, {"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "One further note... after a stressful 8 hr drive through torrential rain we were looking forward to using the hot tub at this hotel. Unfortunately, it was closed. In summary, if you are looking just for a bed and shower, this place will do. However, if you want a clean hotel room in a nice, walkable town followed by a lazy morning wake-up, look elsewhere.", "title": "Pleasant stay", "user": "CVlasflores", "date": "October 2, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 179503080}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "This was a great home base for us as we spent a day hiking in the redwoods. The rooms were large enough for our family to spread out and the beds were comfortable. They didn't tell us they change the wifi password every day, and we also had some trouble with our keys not working, but other than that everything was great. The pool and the happy hour was the perfect way to end a long hot day of hiking, and the breakfast was just what we needed to get going.", "title": "A perfect home base for hiking in Humbolt Redwoods Park", "user": "AKTR2013", "date": "September 6, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 176066609}, {"rating": 4.0, "stay_parameters": "Stayed September 2013", "text": "Coming out of a backpacking trip on the Lost Coast we wanted a comfortable and clean hotel to decompress that wasn't going to break the bank. This hotel hits the mark and then some. While not \"cheap\" it does come with a wine and cheese happy hour and a breakfast. The bed was wonderful. We splurged on dinner at the Benbow. Stay there if it's a special occasion. Otherwise the Best Western is fine.", "title": "A much needed option.", "user": "ccrider55", "date": "September 3, 2013", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 3.0, "service": 4.0, "rooms": 4.0}, "id": 175598910}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "The Hotel was very nice and clean. The rooms were large with a king bed. The bedspread/comforter was horrible and heavy. Feel sorry for the housekeeping people that have to make up the beds everyday. The Evening Wine and Cheese was delightful and the continental breakfast was good as expected. The staff were very helpful and polite. We stayed two nights as we visited the Redwood State parks. The Hotel fit our needs, We would not hesitate to stay again.", "title": "Very nice Hotel in a small town of Garberville", "user": "Carlos R", "date": "September 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 175476583}, {"rating": 1.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "Very unhappy with our customer service from Manager, Jeanie. She left us a not so nice message stating that somehow we made two reservations and only cancelled one so they are charging us $151 for a \"No Show\". We are on vacation in another area and now have to call our bank to file a charge back while we are supposed to be having fun. What a pain. Could have made a simple credit and we would have left a stellar review of quality customer service.", "title": "POOR CUSTOMER SERVICE", "helpfulness": 1, "user": "baker7493", "date": "September 3, 2013", "detail_rating": {"value": 1.0, "service": 1.0}, "id": 175649630}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "The PLUS really was a plus. The price includes \"Wine and Cheese\" from 5:30 to 7:30 PM in the Garden Room and breakfast from 6 to 10 AM. The \"Wine and Cheese\" includes up to 3 glasses per person of a pleasant chardonnay or merlot. There was a choice of about 4 kinds of cheese including brie and grapes. Breakfast is listed as \"continental,\" but in my opinion is a full self-service breakfast. The choices include amazingly good \"industrial\" omelets, sausage, sausage gravy, and biscuits. I'm not a big gravy person, but I liked the sausage gravy. You had a choice of whole grain or regular batter to make yourself a waffle, cereal, oatmeal, toast, juice and so on. Overall, both the breakfast and the wine and cheese exceeded our expectations.", "title": "Overall a very nice place to stay", "user": "EveSp", "date": "September 1, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 175180306}, {"rating": 1.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "After a beautiful day driving through the Redwoods along the Avenue of the Giants, we came to Garberville, CA and the BW Humboldt House. Our experience was nasty and we were very anxious to leave. Ants and flies in the cheese holder on the wine and cheese display, ants climbing on the inside window next to our table, ants in our bathroom on the floor, sink and counter, filthy carpet.", "title": "Dirty Hotel", "helpfulness": 1, "user": "Barb528", "date": "September 30, 2013", "detail_rating": {"service": 2.0, "cleanliness": 1.0, "value": 1.0, "sleep": 3.0, "rooms": 1.0, "location": 2.0}, "id": 179415208}, {"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled solo", "text": "I visited 10/21/2013 I am staying 3 nights while on a photography journey and considering the area of Garberville this is by far your best bet for lodging on the middle tier scale. The rates are acceptable and the room nicely appointed as evidenced by the upgrades including Flat Screen TV...great wireless connection and exceptionally clean as well as the grounds and pool area being maintained.", "title": "Good value", "user": "DesertSmile", "date": "September 23, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 178291707}, {"rating": 3.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "I encountered no problems with check-in or the hotel staff.", "title": "Adequate", "user": "bevchris", "date": "September 21, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 178083514}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "The breakfast is the bonus so take advantage of the offerings. Both hot and cold foods that cover all the breakfast wants and of course excellent sausage gravy. The Garden Room is clean and inviting. The cheese/wine reception late afternoon is a great way to meet fellow travelers.", "title": "Outstanding, as usual", "user": "SeniorCPO", "date": "September 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 177842261}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "The only thing I should warn folks about is more about the area than the hotel. If you are planning on eating dinner in Garberville I would suggest eating before you arrive or heading north to Eureka, another hour north. There are simply no acceptable places to have a nice dinner and I don't want you going to bed hungry.", "title": "Easy to see why they are numver one.", "user": "mebtfs", "date": "September 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 177604315}], "location": {"country": "United States", "city": "Garberville"}, "variance": {"poor": 17, "average": 42, "very good": 134, "terrible": 13, "excellent": 104}, "aka": "Best Western Humboldt House Hotel", "slim_ranking": 0.25}