{"user_rating": 3.0, "review_count": 436, "name": "BEST WESTERN Hotel Hungaria", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed June 2005", "text": "We spent a three night break in the Grand Hotel Hungaria at the beginning of June. Many of the reviews of the hotel which had been posted on various internet sites (and a somewhat jaundiced description of the hotel's surroundings in the 'Rough Guide to Budapest') made us wonder whether we had made a major mistake in visiting both the city and hotel. In fact, we had one of the most enjoyable breaks we have ever had. The hotel is very large and busy but is lively rather than frantic. The reception and information staff were friendly, welcoming and extremely helpful. We were accommodated in a small suite on the first floor; it was very comfortable, well equipped and clean. The air conditioning was effective and although the room faced the busy main road we slept well (although that may have been helped by the excellence of Hungarian fruit brandies!)", "title": "Not What We eWere Led to Believe", "helpfulness": 26, "user": "110JOhnR", "date": "June 4, 2005", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 3528429}, {"rating": 4.0, "stay_parameters": "Stayed February 2005", "text": "The hotel restaurant was of a good standard both for evening meals and breakfast - the latter was always busy but never crowded and was efficiently run. As mentioned before, the service in the hotel was of a very high standard, epitomised by the fact that when we requested extra pillows at 10.30 at night, they were delivered to the room within five minutes; we've stayed in other hotels where a similar request has had to be repeated several times before any response is made.", "title": "don't listen to the bad reviews, it really is very good", "helpfulness": 18, "user": "CHEESETEETH", "date": "March 30, 2005", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "rooms": 4.0, "service": 3.0}, "id": 3312713}, {"rating": 4.0, "title": "Good, but noisy", "text": "The hotel is not in the most attractive area of the city but we never felt threatened when walking the remarkably rubbish-free streets around the railway station and, anyway, the public transport by bus and metro is of an excellent standard and connects easily to the centre of the city. The minibus transfer from and to the airport was also extremely efficient and the tour to the Danube bend run by Cityrama and organised through the hotel was well worth the money.", "helpfulness": 9, "user": "pingu", "date": "March 28, 2005", "id": 3307045}, {"rating": 4.0, "stay_parameters": "Stayed January 2005", "text": "Overall, we would fully recommend staying in this hotel and would happily use it again on a return visit.", "title": "Excellent value, spacious accommodation.", "helpfulness": 13, "user": "Grazie", "date": "March 11, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 3266352}, {"rating": 4.0, "stay_parameters": "Stayed February 2005", "text": "We stayed in the Grand Hungaria in Feb 05, after reading the reviews from previous guests, we were a bit worried that it was going to be a horrible hole. Quite the contrary in fact, the hotel was impeccably clean and operated in a very proffesional manner. The reception area was large and roomy, and not as 70's as it seems in the photographs you might have seen (it looks like a scene from columbo). The public areas were clean and didn't smell at all like dead bodies as you also may have read. The hotel is in the process of being refurbished so where possbible ask for a higher floor as these have just been finished and had that lovely new carpet smell. The rooms do suffer a bit from road noise from the flyover next to the hotel, this may have just been more noticeable to us as there was a protest by farmers so hundreds of tractors blasting their horns constantly was the order on the day. You soon forget about that though when you take in the size of the rooms.", "title": "Had a great timr", "helpfulness": 9, "user": "psigley", "date": "February 21, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 3.0, "service": 4.0}, "id": 3213507}, {"rating": 1.0, "stay_parameters": "Stayed March 2006", "text": "This badly located \"2\" star hotel sits about a half hour walk from the nice bits of the town on a busy main road. On entry you are faced with a large waiting lobby that is very much like an airport lounge, truly ugly and unpleasant. To the rear is a tiny bar, flanking are two tacky and pointless gift shops. The bar is extortionate price wise so best avoided. The quality of the rooms are poor, they stink of cigarette smoke and are very jaded. The decor is woodchip and dark veneer, the curtains are plastic. The breakfast rooms are windowless affairs and quite depressing, the food is poor compared to most buffets I've had. The rooms have very little in the way of provisions i.e. tea making, razor, comb etc. The light switch on the bed back board is a great touch; fall asleep and you turn all the lights on, waking you up (probably some torture device left from the cold war).", "title": "This is not 4 star by a long shot.", "helpfulness": 13, "user": "Monkey_Nutz", "date": "March 8, 2006", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "rooms": 1.0, "service": 2.0}, "id": 4594867}, {"rating": 2.0, "stay_parameters": "Stayed December 2005", "text": "The hotel has a restaurant and a fitness suite. Neither of which impressed enough to bother with. Room service is a menu from the restaurant and quite frankly I have never seen a sandwich made so small for £3. A truly disappointing hotel in many ways I wouldn't recommend it or wish to return to it. It has absolutely no saving graces whatsoever apart from it kept me warm and dry for a few evenings.", "title": "4 stars?????!!!!!", "helpfulness": 14, "user": "Gastropunk", "date": "January 3, 2006", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "rooms": 2.0, "service": 1.0}, "id": 4319432}, {"rating": 2.0, "title": "Loved the Food, one complaint", "text": "Checked in on the 26th December with 2 friends, not the friendliest of places. Claims to be 4 star, but really not more then a 2. Furnitures in the room badly needed refurbishing, and for a Best Western brand I would have expected at least a pretty spotless bathroom, the corners were covered with dust and they were not even hidden.", "helpfulness": 14, "user": "Conor", "date": "November 13, 2005", "id": 4109239}, {"rating": 2.0, "title": "Forget It", "text": "Hot and cold breakfast - which we enjoyed - no complaints there. An effort was made to change some items at the buffet table daily and on the last morning (30th Dec), we even had some good quality smoked salmon.", "helpfulness": 16, "user": "Lordy", "date": "September 30, 2005", "id": 3979918}, {"rating": 1.0, "title": "4 Star claim 2 star quality", "text": "Location wise - we were a wee bit disappointed. Yes, the major railway station nearby was handy, coz we made a day trip to Vienna and a day return only cost us each around £20!! Getting about Budapest from the hotel is not the easiest- finding fine Hungarian fayre in the vicinity was impossible, there was the usual KFC, Pizza Hut and a chinese cafe (always empty though).", "helpfulness": 12, "user": "A TripAdvisor user", "date": "September 28, 2005", "id": 3944401}], "location": {"country": "Hungary", "region": "Central Hungary", "continent": "Europe", "city": "Budapest"}, "stars": 4, "variance": {"poor": 69, "average": 133, "very good": 161, "terrible": 33, "excellent": 40}, "aka": "Best Western Hungaria", "slim_ranking": 0.473053892216}