{"user_rating": 3.5, "review_count": 210, "name": "BEST WESTERN Cavalieri Della Corona", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "Overall, we thought this hotel provided good, quality service - quite comparable to a three and one-half or even a four star hotel in the U.S. Certainly, the staff (frond desk especially) made a world of difference as they were friendly, polite and helpful - and spoke both English and Italian. For American visitors (which we were), we found that even an attempt at the language - simply saying good morning, good day, good evening, thank you in Italian - made for even warmer relations. This was true not only of the hotel staff but in general throughout our travel in northern Italy. You may even receive compliments, as we did, on your pronunciation. Another plus was the free shuttle to/from the Malpensa Airport. This service was available throughout our stay. We made several trips into Milan using the shuttle to drop us off at the airport then calling them to pick us up when we returned to the airport. Be sure to reserve the shuttle the day before you leave for the airport. We also thought the free, full breakfast was filling - a good way to start a long day of sightseeing. We would rate the breakfast B-. On the other hand, we found the hotel's restaurant expensive. Unfortunately, given the location, choices are rather limited. One night we dined at the nearby Microtel and found the food (if not the prices) better in quality.", "title": "Good value- friendly staff, quality room, free airport (Malpensa) shuttle", "user": "wgsMissouri", "date": "November 14, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 4.0, "rooms": 5.0}, "id": 49187555}, {"rating": 3.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "The best thing about the hotel was the efficiency of the airport bus connections; we were collected when we asked and returned to the airport in the morning at exactly the time we asked. The staff were generally pleasant but we found the breakfast disappointing and certainly the poorest we have had in the area. Bar prices are the highest we have experienced in Northern Italy although I suppose city centre prices may be higher Eight euros for a small whisky! The bedroom was adequate and appropriately fitted.", "title": "Avoid the very expensive bar!", "user": "donniegee", "date": "July 21, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 3.0, "service": 3.0, "rooms": 4.0}, "id": 35393995}, {"rating": 3.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "There are other small restaurants around if people are prepared to walk up to 300 metres. We had a very nice relatively inexpensive dinner in one in the middle of a small forest nearby.", "title": "Stay at the Novotel across the street!", "user": "EUROPEEXPERT", "date": "July 17, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 3.0, "service": 2.0, "rooms": 3.0}, "id": 35033311}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled with friends", "text": "As a user of Malpensa usually three times a year and using airport hotels always on the night before the return journey I would not consider repeating the experience.", "title": "Great for an overnight before early morning flight", "user": "merlinandme", "date": "June 26, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 33206667}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled with family", "text": "We stayed one night at the hotel and arrived late. The front desk people were not very pleasant, but I don't believe they were Italian either. We had dinner at the restaurant and the previous reviewer was correct concerning the food and staff in the restaurant. We ordered 2 plates of different pasta and the pasta certainly wasn't made fresh and I would think it had to be made at least 1-2 hours before. It was not good at all, but at 8:30 we were hungry. Management's response to another traveler talking about the buffet is another problem. The food had to be sitting out since the restaurant opened for dinner-a health inspector would not have been happy seeing all that food without refrigeration for such a long period of time sitting out. There were only two other tables in the restuarant occupied and one of the staff sandwiched us in between the other two tables, I guess he didn't want to strain himself walking. As far as management's response to the gas station-I turned left out of the hotel, then left again onto the highway and then followed the signs to terminal one. I had previously read these posts and really appreciated the comments of management and believed that there indeed was a gas station as was mentioned. He is dead wrong and the reviewer is correct. I actually had to get back on the highway going back to the hotel and gas up at the station on the other side of the highway. If there is a gas station going the way I did and how I was told to go by the shuttle driver of the hotel and there is a gas station before terminal 1, management please respond, as I can't wait to hear where you believe there is one going the way the hotel driver said to go. The room was small, but clean and the beds hard, as would be in the Novotel. In closing, next time we will stay at the Novotel as even though a French chain, this Best Western is in no way an \"Italian\" hotel based on the staff and food!", "title": "The best way to get to Malpensa early morning", "user": "barbaraGeneva", "date": "June 25, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 33124532}, {"rating": 5.0, "stay_parameters": "Stayed July 2008", "text": "We were just looking for an inexpensive place to stay near the airport before flying home the next day, so we weren't expecting much. However, this place turned out to be great! A free shuttle will take you to and from the airport. The staff was very friendly, and the hotel bar was great. The rooms were very nice, comfortable, and spacious. The A/C and the hot water worked great. A great way to end a trip to Italy before flying home.", "title": "Great way to end Italy trip before flying home", "helpfulness": 1, "user": "chrisabe", "date": "August 3, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 4.0}, "id": 18578526}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled on business", "text": "We were leaving the Best Western outside of Milan, Italy, for the airport and remembered we needed to fill our car with gasoline before turning it in. The only gas station we could find was a self-service station without an attendant. Because everything was in Italian, we had difficulty to determing how to get gas from the machine and we lost 20 euros, but fortunately got a credit receipt. Frustrated, we turned our car in, paid the high gas price and returned home. Once home we thought perhaps the Best Western could turn in our credit to the gas station when an atendant was there and use the gas in their hotel courtesy van. It was worth a try. We wrote them a letter saying what had happened and included the credit receipt, our hotel receipt to verify our stay, and a self-addressed envelope. About two weeks later we received 20 euros in the mail, saying they were able to redeem the credit. We were shocked and we wrote them a thank you e-mail. This gesture is a credit to their staff , to their hotel and to the Best Western brand.", "title": "Gasoline Rebate", "helpfulness": 1, "user": "WIUSA", "date": "July 23, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 18173378}, {"rating": 3.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "We had to travel back to Milan for our flight home, and unfortunately, had to be there for 2 nights. Due to an extremely early morning flight on the second day, we elected to stay out near the airport rather than in town.", "title": "Okay for one night", "helpfulness": 1, "user": "keylimejet", "date": "July 12, 2008", "detail_rating": {"front_desk": 4.0, "service": 2.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 3.0}, "id": 17808760, "likes": {"liked": "— Clean, modern, A/C, close to airport.", "disliked": "— Dining options."}}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "This hotel would have been fine for 1 night, but 2 was stretching it. There was nothing within walking distance, and the hotel only offers one dining room - no snack bar, etc. The dining room is expensive. The first night we tried to just order 2 plates of pasta at about 8 euros each. They won't bring you a glass of water, only a bottle, for which there was a 4 euro charge. Then they charge you for the tablecloth! I am not kidding - 3 euros per person. When all was said and done, the meal came to 40 euros, which is what it would have cost for the buffet (1 adult at 26 euros and a child at 14 euros).", "title": "Nice Hotel Near Airport with Free Shuttle", "helpfulness": 1, "user": "drgoodson", "date": "April 16, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 15081604, "likes": {"liked": "— Location near Airport and free shuttle service.", "disliked": "— I have no complaints about it."}}, {"rating": 3.0, "stay_parameters": "Stayed February 2008, traveled on business", "text": "The head waiter was rude. We got to chatting with an American couple at the next table, and he repeatedly walked between us in the middle of a sentence, and stood with his back to me, blocking our conversation.", "title": "Better than I thought", "helpfulness": 1, "user": "micahbree", "date": "February 6, 2008", "detail_rating": {"front_desk": 3.0, "business": 5.0, "service": 3.0, "cleanliness": 2.0, "value": 5.0, "location": 5.0, "rooms": 3.0}, "id": 13333718, "likes": {"liked": "— Free Internet", "disliked": "— stains on carpet"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "We had a very enjoyable stay at this hotel. The check-in staff were friendly and helpful, the room and the bathroom were great (and huge!) it was clean and the beds were comfortable. I think like quite a few of their guests, we stayed there as we had a morning flight out of Malpensa and for that purpose it was ideal. I was very pleased to discover we could return our rental car the night before and get a ride back to the hotel in their free shuttle service, having made sure we had seats reserved on the same shuttle back to the airport the following morning. The shuttle only seats 8 so it understandably fills up therefore it is very wise to make sure you have a reservation, though in the mornings it runs more frequently than the every half hour at other times. The breakfast was fine, the selection was on a par with most of the other hotels where we had breakfast included. We didn't eat at their restaurtant so we have no review for that. I feel this is more of a passing through hotel than a vacation stay place but as that was our intention it met our expectations.", "title": "Suited our needs perfectly", "user": "atwied", "date": "July 15, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 70979238}, {"rating": 2.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "At the end of an 8 week vacation in Europe we stayed the night because of location near Malpensa airport. For this purpose hotel was fine -- rooms very clean, if not overly large --staff courteous --- but don't ask too many questions. Restaurant was shocking -- food almost inedible and service was deplorable -- rude, arrogant and slow -- and pricing is not cheap. Airport shuttle bus was very convenient and always on-time.", "title": "Sleep but don't eat", "user": "rayandcheryle", "date": "June 18, 2010", "detail_rating": {"service": 2.0, "cleanliness": 5.0, "value": 2.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 67850347}, {"rating": 2.0, "stay_parameters": "Stayed January 2010, traveled with family", "text": "The hotel is close to Milan AIrport. There is a free shuttle and the driver is very nice. Te hall and front desk are very nice, but the room is not good at all. Very dark, the bathtub was clogged and I had to take a shower with water up to my ankle. It definetly needs renovation urgently! The coffee/tea maker was very dirt and I didn't use it. This did not happen in any other Best western hotel I stayed during this trip. E$ 94.00 was too much for that: just cross the street and get a room at Novotel (eighty euros and much better rooms). It also has a fre shuttle to malpensa airport. Don't think twice.", "title": "Cross the street and go to Novotel", "helpfulness": 1, "user": "going-around-10", "date": "January 22, 2010", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "location": 2.0, "service": 2.0, "rooms": 2.0}, "id": 54135794}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled with family", "text": "We chose this hotel because we were flying into and out of Malpensa, and it is near the airport. All the staff were helpful and friendly, and most spoke good English. The rooms were pleasant and the shuttle to and from the airport was very convenient. The breakfast was very nice.", "title": "Very convenient, good value", "user": "Ysolde_voyages", "date": "January 2, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 52399414}, {"rating": 4.0, "stay_parameters": "Stayed June 2006, traveled as a couple", "text": "This was our last night in Italy and stayed here for location to airport and the shuttle. I would stay again. Went to the bar hung out at happy hour and really enjoyed the bartender, he was very friendly and funny! Good dinner and breakfast buffets with a large choice of foods, important for a vegetarian. Even had a good wine selection.Good stay good location for what we needed.", "title": "Great stay for one night, airport shuttle!!", "user": "Idontwannagohome", "date": "November 27, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 50164912}, {"rating": 2.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "We were so impressed with Hotel Canada (Best Western) in Rome, but was not impressed with this property. Their rooms were small, it was clean and beds were very comfortable. We were very disappointed with their restaurant service. They were very disorganized and understaffed. Two servers, but one who took orders and cashier.", "title": "Disappointment", "user": "bento2744", "date": "June 15, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 3.0, "service": 1.0, "rooms": 3.0}, "id": 32409112}, {"rating": 3.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "We sat there for good 15\", before they took our orders, waited another 20\" for the food and when it came, one plate for my wife and nothing else, but the grilled vegitable which was a side dish. I didn't get my entree, until my wife had completely finished her dish. All i got was \"Oh, so sorry\" for $70 meal which consisted of 2 plates of pasta, bottle of water and 2 beer. Front counter staff was OK.", "title": "Useful for a one night stay.", "user": "Octavious", "date": "June 15, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 3.0, "rooms": 3.0}, "id": 32388552}, {"rating": 3.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "First of all I want to thank Tripadvisor posters for the very useful tips regarding staying at this hotel. Without your help we would have been caught by the expensive restaurant food and would not have been able to get seats on the shuttle.", "title": "Okay hotel - dining room expensive", "helpfulness": 1, "user": "patrema", "date": "April 7, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 3.0, "service": 3.0, "rooms": 3.0}, "id": 27575939}, {"rating": 4.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "As per one tip here, we filled up with gas at the last filling station before the hotel and also stocked up with water and food for the evening. We arrived before 6pm and were able to book seats for the following morning on the 8am shuttle.", "title": "Perfect for Airport Getaway", "helpfulness": 2, "user": "BOSTRKKR33", "date": "February 24, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 3.0, "rooms": 3.0}, "id": 25105867}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "Here are our notes which you may find useful:-", "title": "Great for families: pool + big quad room", "helpfulness": 1, "user": "WeGoMama", "date": "August 5, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 18655769, "likes": {"liked": "— Convenience to Malpensa Airport", "disliked": "— Meal prices"}}], "location": {"country": "Italy", "region": "Lombardy", "continent": "Europe"}, "stars": 4, "variance": {"poor": 24, "average": 52, "very good": 79, "terrible": 8, "excellent": 47}, "aka": "Best Western Cavalieri Della Corona Hotel Cardano Al Campo", "slim_ranking": 1.0}