{"user_rating": 4.0, "review_count": 341, "name": "BEST WESTERN Hotel River", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled on business", "text": "Wonderful hotel with friendly staff, scrumptous breakfast and clean rooms! Stayed here for 2 weeks and it was a pleasure the entire time.", "title": "Charming Hotel", "helpfulness": 3, "user": "hellokit25", "date": "May 8, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7566571}, {"rating": 4.0, "title": "friendly staff, easy to find location", "text": "The hotel is located near Santa Croce away from the crowds. It is easy to walk to museums and attractions. I have stayed there three times, it is a delightful hotel. Free internet service in the lobby too.", "helpfulness": 1, "user": "Weezie3", "date": "April 23, 2007", "id": 7417882}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "We have just returned from a 3 night stay at this hotel and what a pleasant experience it was. The reception staff were extremely helpful and friendly, our room was nicely decorated with a very comfortable bed, the bathroom was immaculate. Breakfast, which could be taken in the breakfast room or conservatory, was standard continental fare and was constantly replenished. There is a small balcony on the top floor which all guests are free to use.", "title": "Excellent hotel", "helpfulness": 1, "user": "annesh1rley", "date": "April 2, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7269507, "likes": {"liked": "— Comfortable room", "disliked": "— Nothing"}}, {"rating": 4.0, "title": "Worth it for the view from the balcony", "text": "The hotel is situated on the banks of the Arno, a little way from the historic centre of Florence but that was a plus as it meant being able to escape from all the crowds.", "helpfulness": 1, "user": "GelatoJunkie", "date": "February 4, 2007", "id": 6744180}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled with family", "text": "Would stay here again.", "title": "Great little hotel!", "user": "jlynnnyc", "date": "January 9, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 6569570, "likes": {"liked": "— the staff", "disliked": "— n/a"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "A charming clean and comfortable hotel. Polite and helpful staff.", "title": "Small but perfectly formed", "helpfulness": 4, "user": "Carrier", "date": "August 30, 2006", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 5728133, "likes": {"liked": "— The old world charm of the hotel mixed with the modern bathroom facilities.", "disliked": "— The big urn of coffee - I prefer a pot at the table."}}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled with family", "text": "A short walk (or inexpensive bus ride) to the historic attractions.", "title": "Florence gem situated on the side of the Arno", "helpfulness": 8, "user": "indilicious", "date": "August 10, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 3.0, "rooms": 5.0}, "id": 5594591, "likes": {"liked": "— The staff and well thought-out decor", "disliked": "— The lack of sunlight in the room"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "The knowledgeable manager will tell you which buses go where as well as sell you the tickets. He also directed us to the shop selling the gorgeous room fragrance that was in our room.", "title": "Best Hotel of our Italy trip!!!", "helpfulness": 9, "user": "pkmgolf", "date": "July 23, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 5500307, "likes": {"liked": "— The staff", "disliked": "— small shower"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2006, traveled solo", "text": "Standard breakfast in an enclosed terrace or in the elegant lower breakfast room. My only crticiscm is of the coffee, because I just prefer a pot at the table.", "title": "Perfect Hotel, Good Memory", "helpfulness": 13, "user": "isatam", "date": "July 22, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 3.0}, "id": 5496329, "likes": {"liked": "— Cleanliness and the thoughtfulness of the service", "disliked": "— location"}}, {"rating": 4.0, "title": "Great location...", "text": "We thoroughly enjoyed our stay at the Hotel River during our six-night sojourn in Florence. The staff were eager to please and extremely friendly and amicable. The rooms were decorated very thoughtfully and we were much impressed by how quiet the room was at night. The only (very very minor) complaint we have about the room is the lack of natural light.", "helpfulness": 5, "user": "aqualiz", "date": "July 10, 2006", "id": 5448755}, {"rating": 4.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "My husband and I stayed at this hotel this past September and it was lovely. We liked that it was by the river. Eventhough, we did not have a river view, it was nice to walk out and see the other side of Florence. Breakfast was simple but definitely fine. It was also very easy to walk to all the spots. Staff was also very helpful and there was free internet use at the computer right off the concierge desk. I recommend this hotel and I would go back again.", "title": "Very nice", "helpfulness": 1, "user": "brookenyc", "date": "January 5, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 3.0}, "id": 6556016}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "We always thought we would only be staying in Hotel David for our trips to Firenze, until we found this little gem. I am not saying that Hotel David is not good. When it comes to a 30-euro difference per night, I am afraid I have to choose Hotel River.", "title": "Love it!", "helpfulness": 1, "user": "JJB", "date": "December 6, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 6341298, "likes": {"liked": "— Everything", "disliked": "— Nil"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "We stayed in Room 200, which is in fact right behind the reception counter. We were there for 3 nights and experienced no noise at all. Location is gerat, walkable from all major attractions. The room is of decent size, modern and spotlessly clean bathroom, and a simple but more than sufficient breakfast.", "title": "The charming River", "helpfulness": 2, "user": "sparklysparky", "date": "November 25, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 4.0}, "id": 6174025, "likes": {"liked": "— The view from the rooftop and the larger rooms.", "disliked": "— Walking distance to Ponte Vecchio, though not too far...it was still a long walk after a long day of sightseeing."}}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled with family", "text": "Bus 13 takes you right in front of the door from train station (but remember it's sort of going the opposite direction with River Arno on your left and the Hotel on your right. Sit on the right side of the bus if you are a first-timer to Firenze. You will pass the hotel before the bus-stop.) Opposite teh Hotel, you can take No.12 to both train stations. We left from Campo di Marte (a smaller one vs main SMN) for Roma and it is very convenient indeed.", "title": "Excellent staff, cleanliness, location!", "helpfulness": 3, "user": "Cherpig", "date": "October 20, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 5979661, "likes": {"liked": "— Location, cleanliness, room decor/size, breakfast", "disliked": "— DO NOT pay a premium to reserve tickets for Ufizzi Museum if traveling in the off season! Lines are short."}}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled with friends", "text": "Have fun in Firenze.", "title": "Nice hotel - great location", "helpfulness": 3, "user": "2lilmonkeys", "date": "October 16, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 5961403, "likes": {"liked": "— Helpful front desk, location, large bathroom, A/C that worked"}}, {"rating": 1.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "The Hotel was average in terms of bed comfort, cleanliness, and amenities but well below average in terms of staff. The staff valet parked my Mini Cooper S and put 15 anonymous kilometers on it. We also reserved a wine tour, which is run by one of the receptionists, for 4 people at 300 euro for the day. We were told that it would include a light lunch, wine tasting and a guide. Unfortunately we only received a driver who had very limited knowledge of the region and wine making process and we had to pay an additional 20 euro per person for the wine tasting/lunch. Bottom-line, we paid 300 euro for a drive to take us to Sienna and back. In every case the staff was defensive and argumentative. BEWARE!!!!", "title": "Beware!!!", "helpfulness": 4, "user": "ben_unt", "date": "July 11, 2007", "detail_rating": {"front_desk": 1.0, "business": 4.0, "service": 1.0, "cleanliness": 4.0, "value": 2.0, "location": 4.0, "rooms": 3.0}, "id": 8102670, "likes": {"liked": "— The Room", "disliked": "— The Staff and the way we were treated"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled with family", "text": "Incredible little hotel away from the noise of Florence, but walking distance of only 10 minutes to city center. Great sized rooms and beautifully decorated. Very clean with decently sized bathrooms for Europe. Beds were very hard. Breakfast served beautifully and elegantly with many choices, based on basic Italian breakfast of pastries, cold cuts, cheese, hard boiled eggs (with cute little cups and spoons), fruit and real coffee! Very small staff works hard to meet every need. Great place to have a drink before dinner in the lobby or on the rooftop balcony with view of the Arno.", "title": "Nice and quiet", "helpfulness": 1, "user": "EKKColorado", "date": "June 14, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 7848875, "likes": {"liked": "— Peaceful and quiet", "disliked": "— The beds were very hard"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled with friends", "text": "We were thrilled with our stay at the Hotel River! It's a charming hotel located right across from the Arno River. What I loved about it was the location. It wasn't right in the center of the city where all the tourists are. It was quiet and had a nice ambiance. Although, it was still in walking distance to most things. We did take a cab to the train station though. It's in walking distance to the Santa Croce and Ponte Vecchio and other major sites like the Doumo.", "title": "A perfect, little gem!", "helpfulness": 1, "user": "Suzy2007", "date": "May 21, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 7669256, "likes": {"liked": "— Friendliness of staff, location, charm"}}, {"rating": 4.0, "title": "Hotel River Experience", "text": "The rooms were spacious enough and had a nice bathroom. Great shower and good towels (which is important). Beds were comfortable too. The room had a small flat screen TV. It was a very nice stay - not a super fancy place, but perfect for a city where you won't be really around your hotel much. They offer a nice continental breakfast and free internet access in the lobby. The hotel only has three or four stories, so I liked that it was small. There's a nice terrace too upstairs. The hotel has a home away from home feel to it.", "helpfulness": 2, "user": "Shuckins", "date": "May 20, 2007", "id": 7656132}, {"rating": 4.0, "title": "Nice and quiet but far from everything", "text": "The best part of our stay were two of the concierages. Abbas and Salvatore! They were extremely helpful, kind and knowledgeable. They didn't steer us wrong especially in the restaurant department. I felt like we didn't go to typical tourist type eateries. They recommended two restaurants we loved - Ristorante di fagioli and Il Barrino. They were wonderful. Ask for Rita at Il Barrino and she'll hook you up with an amazing tasting of all different stuff. Get the Florentine steak and ask for the pasta with truffle oil (which wasn't on the menu, but she gave it to us anyway). Abbas and Salvatore did add to our experience with their hospitality and friendliness. Abbas in particular was very helpful and so wonderful! He also has a car service and took us on a day tour in Chianti. He knew so many charming little towns in Tuscany to visit and took us to a great winery for wine tasting including a homemade lasagna lunch. He truly made our trip extra special since we saw so many things we would've never had a chance to if we just went by a guide book.", "helpfulness": 3, "user": "luv2travelSanDiego", "date": "May 11, 2007", "id": 7588806}, {"rating": 5.0, "title": "An Excellent Hotel", "text": "Large, clean, updated rooms, helpful & friendly staff, free internet access, central location in Florence, easy parking. Highly recommend this great property! We will be back.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "November 13, 2005", "id": 4108717}, {"rating": 2.0, "title": "Does not live up to the brochure blurb", "text": "This hotel is pretty poor when it comes to service, we arrived late saturday and because we where in a group it took nearly 30 mins to book us all in , my wife and myself where at the back of the que and had to stand in the street because of insufficient in reception, no tea or coffee makink facilities in room asked for room service as in their current brochure was told too busy you will have to come down and collect it yourself , staff have bad attitude when it comes to service , breakfast was very poor fruit juices had been watered down coffe was like sump oil and the poor selection of cheese and cold meet left a lot to be desired , the waitresses could not be bothered to clean tables so we had to remove crocks ourselves.We only found one pleasant and very helpful man on the desk the others where lazy and unhelpfull.we could not wait for our stay to come to an end , i would not reccomend this so called hotel to anybody.", "helpfulness": 1, "user": "tonyleighton45", "date": "February 23, 2008", "id": 13781902}, {"rating": 2.0, "stay_parameters": "Stayed April 2007, traveled with family", "text": "As several travelers have already mentioned, we were extremely unpleased with the staff with the exception of one man, Gabriel Vaccaro. Particularly, there were two older men on the evening/night staff that were just downright rude. Our father is diabetic and needs to store his insulin in a cool place. The rooms don't have refrigerators, which is fine, so we asked if we could use their kitchen refrigerator. Well you would've thought we were asking for all the gold in Fort Knox. Those two men were very lazy and didn't like to leave their chairs or talk to anyone, grunting at us whenever we'd ask for help. In fact, we went out late one night and came back to find one of them asleep at the desk. When we woke him to ask for the insulin, he was clearly irritated that we dared to wake him up. Our train was leaving early the morning we checked out and let the night guy know the night before to call a taxi and have it ready for us. No surprise, he hadn't done it so we nearly missed our train. Not only did he forget to do this one small thing, he was completely rude about finally getting to it.", "title": "SERVICE WAS ATROCIOUS", "helpfulness": 2, "user": "mojovirginia", "date": "October 18, 2007", "detail_rating": {"front_desk": 1.0, "business": 2.0, "service": 1.0, "cleanliness": 3.0, "value": 2.0, "location": 3.0, "rooms": 3.0}, "id": 10123174, "likes": {"liked": "— The view of the River Arno", "disliked": "— The horrendous staff"}}, {"rating": 3.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "I would NOT recommend anyone stay here unless you don't plan to ever interact with the staff, which is impossible because you still have to check in and out, requiring some level of interaction. Breakfast was below average. The only two good things about Hotel River is the rooms were nice and the view of the river was gorgeous (hence they got 2 stars instead of just 1). There's a rooftop overlooking the river that is open to all guests, however, there are guest rooms beside them so you have to be courteous of when you go and how loud you plan to be.", "title": "Nice Place, bad service", "helpfulness": 1, "user": "birdie09", "date": "September 25, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 2.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 10004145, "likes": {"liked": "— The view and the location", "disliked": "— The front desk staff"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "If your trip at all involves a stay in Rome, I highly recommend staying at Les Chambres D'Or Hotel. Delicious breakfast, best cappucino in Rome, wonderful location less than 10 minutes from the Vatican, and most importantly of all, their staff was impeccable. Hotel River needs to take a few lessons from them and I hope their management reads these reviews and does something about the staff.", "title": "Fabulous service, great location", "helpfulness": 1, "user": "Anonymous46", "date": "August 29, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 8536692, "likes": {"liked": "— Cheerful, polite staff", "disliked": "— Room was a bit small"}}, {"rating": 2.0, "stay_parameters": "Stayed August 2007", "text": "The location of Hotel River was perfect, in walking distance to everything but out of the way to relax. The room was nice and we had a view of the river. The only issue was the concierge. I can't remember his name, but he was the most unhelpful man I ever met. We asked him to make reservations at a reccomended restaurant. He replied \"you don't want to go there it's touristy\". We asked him than to reccomend another restuarant. He said to give him a half hour. We cam back down only for him to inform us that they were all closed. He didn't reccomend any others and it was too late to go to our original choice. Another issue that I had with him was we booked the \"florence in a Day tour\". He only took cash and when we went to the tour they said our concierge booked us for the lesser priced tour, yet we paid him full price. Thankfully the tour people trusted us and let us do the whole tour, in which we paid for. Upon checkout he gave me a bill, which I was sure I pre-paid through expedia. When I told him this he became extrmely defensive. I went to go on line so I could figure out the problem and he literally was harassing me to pay him and wait till I got back to the states to work out any issues with expedia. he literally came into the internet booth with me. Very wierd. All in all Hotel River is fine as long as you do not deal too much with reception", "title": "Clean decorated room, out of the way location, lazy staff", "helpfulness": 1, "user": "beyondvoid", "date": "August 13, 2007", "detail_rating": {"front_desk": 2.0, "business": 5.0, "service": 2.0, "cleanliness": 5.0, "value": 2.0, "rooms": 3.0}, "id": 8405322, "likes": {"liked": "— Clean room, nice area", "disliked": "— Small room, unhelpful staff, unfair pricing, far from center of town"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2006", "text": "Just returned from a 3-night stay at the hotel. Loved it! The entire staff was very welcoming, friendly, and informative (they helped me with everything from bus tickets & taxis to booking tours). The breakfast area was lovely - you could take your meal in the sunroom or large breakfast room. Don't miss the glazed croissants (they are better than those I've had in France!). And I was quite excited about the room, it was much larger than I had expected given past stays in Pisa and Rome.", "title": "Wonderful Hotel!", "helpfulness": 7, "user": "exitrowseating", "date": "June 30, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 5414117}, {"rating": 4.0, "title": "Great find and good value", "text": "The hotel is situated beautifully along the Arno. A stroll along the river is a great way to start/finish the day in Florence. The route seemed safe as there are several small hotels along the same road, I had no concerns traveling it alone. The Santa Croce area is only minutes away where I found great glass/pottery shops and restaurants.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "June 11, 2006", "id": 5333039}], "location": {"country": "Italy", "region": "Tuscany", "continent": "Europe"}, "stars": 4, "variance": {"poor": 18, "average": 48, "very good": 158, "terrible": 6, "excellent": 111}, "aka": "River Hotel Florence", "slim_ranking": 0.384782608696}