{"user_rating": 4.0, "review_count": 669, "name": "BEST WESTERN PLUS Cedar Court Hotel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "Stayed for 2 nights at this hotel and could hardly find any faults. Bit hard to find and like many others approached the hotel by the rear car park! Parking was one of our main reasons for choosing this hotel and there were loads of spaces.Reception very friendly as were dining room staff and breakfast staff.Room nice and clean.Large flat screen t.v on wall.Plug sockets in all the right places.Bathroom clean and spacious.The location of the hotel is great,10 mins (max) walk into centre of Harrogate.We would like to go back to the hotel in summer as there are lovely open green parks to the front.", "title": "Lovely hotel with plenty of parking.", "helpfulness": 2, "user": "leeroy", "date": "October 6, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 82318989}, {"rating": 3.0, "stay_parameters": "Stayed September 2010, traveled with friends", "text": "Just had one night here to attend the Harrogate flower show which is just 15mins walk to show ground. Excellent location and hotel has ample free parking which is a bonus! The building is lovely from the outside but very typical of an average hotel on the inside. Adequate but nothing special. Reception staff seemed to have had a personality bypass and as usual were eastern european wich I have nothing against but to have a language barrier problem as soon as you arrive at a hotel in your own counrty can't be good! can it? The room was clean and the beds extremely comfortable. Sound from ajoining rooms was particularly annoying at times but didn't last. Didn't eat there except for breakfast which was in the large room to the left of reception. Unfortunately it seemed they simply couldn't cope with the amount of people wanting breakfast, maybe due to the wedding party that were in. Tables were left dirty, requests for tea/coffee politely answered and then ignored, food simply wasn't replenished quick enough and overall cleanliness of the dinning room was poor with the ceiling peeling in large areas as well. The breakfast itself was just fine with lovely sausages/bacon and big wedges of black pudding, certainly set me up for the day. Overall a brief stay so can't really say much more but I think on the whole I would return if I had to. One last point is that this hotel is no stranger to the 'milk every last penny from the guest' with beer coming in at nearer £4 than £3, why do they do that! didn't bother me though cause simply went out to dine and drink in one of the many places available within 10min walk!", "title": "Average hotel but couldn't cope at breakfast!", "user": "needawee", "date": "October 2, 2010", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 81853076}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "My wife and sons and family stayed here for 2 nights and had lovely ensuite rooms and good meals. On the second day we were joined by other family members and friends for a Sunday Lunch party of 19 persons. We were given a private dining room overlooking the Stray and a team provided us with prelunch drinks and then a really excellent meal. I cannot speak too highly of this and the excellent chef who we later met and thanked. Later a number of us stayed for an evening snack meal (lots of choice) in the delightful lounge. It was all very good value and we are really grateful for the excellent service that we received from all the staff who dealt with us.", "title": "EXCELLENT VENUE FOR 80TH BIRTHDAY PARTY", "helpfulness": 1, "user": "FRANKALAN", "date": "September 10, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 78985967}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "Very nice hotel, welcoming, friendly staff. No complaints whatsoever!! Nice room overlooking the stray, well decorated, nice furnishings. Very clean. Breakfast very good both days, no waiting for tables or coffee! Found all the staff to be most pleasant and helpful. Very good location for Harrogate town centre, nice easy stroll!", "title": "Nice Friendly Hotel", "helpfulness": 2, "user": "insight59", "date": "September 5, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 78360184}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "We stayed three nights and had an enjoyable stay. We were three to a room, and had plenty of space, and got a good nights sleep. Breakfasts were very good - a large buffet meant no need for lunch, but we went down just after 9 on the third day and had to wait to get in. Service was friendly and helpful, and there was plenty of parking. the hotel is well placed overlooking The Stray but just a few minutes form the town centre.", "title": "pleasant hotel in walking distance of Harrogate centre", "helpfulness": 1, "user": "FamilyManHerts", "date": "September 3, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 78151789}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled on business", "text": "This was my second visit to this hotel, the first was two/three years ago and memory says that it was a good stay then and now I was happy with my night here.", "title": "Good location for Harrogate not in town but a walk away.", "helpfulness": 1, "user": "B-homeexchange50plus", "date": "September 3, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 78076009}, {"rating": 3.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "The bedroom, as mentioned by others, is a bit dated needing redecoration but size was ok, it served my purpose. Bathroom a tad small but ok and the shower was fine.", "title": "Not up to Expectations", "user": "Morseymoomoo", "date": "August 26, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 76920140}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "I did not have dinner here as it is a walk into the town centre so decided to eat in town instead. Breakfast was okay with self service cooked stuff which was hot unlike some hotels. A good thing for me was no loud background music to annoy me, which if you read my other recent posts, you will know that I do not like inane chatter and horrible background radio 1 stuff...", "title": "quality weekend stay", "user": "Mitch025", "date": "August 23, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 76482123}, {"rating": 1.0, "title": "Poor Quality and Uncaring", "text": "The staff here were very pleasant and attentive and I would certainly stay here again when in the area.", "helpfulness": 1, "user": "VincentsLondon", "date": "August 20, 2010", "id": 76092156}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "Finally I would say that the location of this hotel is good and suits the tourists that seem to stay here, not as many business people as with other hotels I stay at.", "title": "Faultless!", "user": "Oldbrookie", "date": "August 15, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 75340407}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled on business", "text": "I stayed at the Cedar Court on a business trip as a solo traveller. The hotel is in a good location although I arrived right on rush hour and the traffic was really busy. The postcode does not give you a very accurate location on sat nav and I had to drive around a bit until I found the hotel. Reception was friendly and efficient and I was allocated a ground floor room with an unimpressive view to the rear of the hotel. The room appeared well appointed on first impression but closer inspection revealed peeling wallpaper behind the flat screen tv and general wear and tear. I was only staying the one night however and the room was more than adequate. I needed internet access and a quick call to reception gave me the security code for the hotel wi-fi which worked perfectly. I had booked a table in the hotel's Brasserie Restaurant and found the food and service to be excellent which is more than I can say for the breakfast the next morning. I was on a fairly tight schedule and although the breakfast is buffet style I waited an age for someone to bring me a pot of coffee to the point where I nearly got up and left without. That said I would say that the pros outweighed the cons with this hotel and I would probably stay there again if I had business in Harrogate.", "title": "Pleasant stay central location", "helpfulness": 1, "user": "nefwm01", "date": "August 13, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 75098955}, {"rating": 5.0, "stay_parameters": "Stayed August 2010", "text": "This is not a residential revenue, but a thank you for the presentation service and standard that the Cedar Court Hotel provided for our Social Event. Nothing was to much bother to them, the hotel give us an excellent day by way of the meal and the venue. And at a hard to believe cost considering that this is in Harrogate. The feed back from the 90 friends who attended has been amazing. Well done cedar Court, well done Chef and all the staff, Our Organisation will definitely use you again.", "title": "Briliant food, excelant staff, 5 star event planning", "user": "satman12", "date": "August 11, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 74762707}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "I recently stayed at the Cedar Court Hotel for a weekend break with my partner. We had never visited the hotel before and had only been to Harrogate a few times before for day trips. On our way we got lost and rang the hotel for directions, they were so helpful and soon had us on the right road, so we arrived calm and in plenty of time.", "title": "Most enjoyable stay with helpful and friendly staff. Will be booking again", "helpfulness": 2, "user": "weave86", "date": "August 4, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 73775742}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled on business", "text": "The service continued to be excellent with friendly staff and although the hotel was busy with a wedding the staff continued to be attentive and we felt very welcomed.", "title": "Great service, great location, great everything!", "user": "emmabarrett", "date": "August 4, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 73722816}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled on business", "text": "All in all it was a most enjoyable stay and we have already made plans to come again to Harrogate and stay at the Cedar Court.", "title": "Fantastic stay at this hotel", "helpfulness": 2, "user": "jen0508", "date": "August 4, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 73703498}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "Have just spent two nights here on their special deal which included evening meal on the first night. Room was good and quiet despite being on first floor close to lift and stairs. Dinner was good with a reasonable choice of dishes for all 3 courses. Breakfast generous with enough variety although quality only adequate. Excellent location within easy walking distance of town centre where there are many good restaurants. Would stay again.", "title": "Very good weekend", "helpfulness": 1, "user": "disleksik", "date": "October 27, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 85036284}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "We have just stayed at Cedar Court for the weekend courtesy of Tesco Clubcard rewards and we couldn't have asked for more.", "title": "Superb weekend", "helpfulness": 1, "user": "JuddyManchester", "date": "October 24, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 84653399}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "The hotel is in a fairly quiet part of Harrogate and is just a 5 min walk from the town centre and overlooks The Stray.", "title": "What a welcome change!", "helpfulness": 1, "user": "DanceDrama", "date": "October 14, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 83474240}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled on business", "text": "The staff are very friendly and the breakfasts are really good. The rooms are clean and spacious and bathrooms very modern.", "title": "Nice hotel with everything you need", "helpfulness": 1, "user": "Splodgeness68", "date": "October 13, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 83370916}, {"rating": 3.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "We didn't eat an evening meal here, but the food I did see looked very nice indeed. There was a big party on at the hotel in the bar and a function room but this seemed to give the hotel a buzz to be honest.", "title": "Needs to improve", "user": "The_Paying_Punter", "date": "October 11, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 2.0, "sleep": 5.0, "rooms": 3.0, "location": 4.0}, "id": 82954138}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "stars": 4, "variance": {"poor": 44, "average": 93, "very good": 231, "terrible": 21, "excellent": 280}, "aka": "Best Western Harrogate", "slim_ranking": 0.241379310345, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.0, "rooms": 4.0, "location": 4.5}}