{"user_rating": 4.0, "review_count": 794, "name": "BEST WESTERN Hotel Spring House", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed July 2009, traveled solo", "text": "I spent nine nights at the SpringHouse to attend the 2009 Fina World Aquatic Championships. The hotel was a great choice for me. Very very clean, and an excellent selection at breakfast which was nice as it was good to have variety for 9 days! My single room was very small with a load bearing pillar in the middle (you'll never see this room in their advertisements) but it was comfortable and my balcony was gorgeous (almost as big as the room). The internet is free for only the first four days (thought that was a bit odd) but the front desk staff arranged for me to have it for my whole stay - much appreciated. Great location to the vatican and the subway. If you are coming by subway, ignore the reference on their website to get off at the Vatican Museum stop now called Ottavanio. That is one stop too soon - you should get off at Cipro which is closer. Apparently the stops have been renamed. Ottavanio is more in the core of activity and shopping but if you are lugging a large suitecase you want the shortest distance! All in all a good stay.", "title": "Safe, clean and good location!", "helpfulness": 1, "user": "mmccormi", "date": "July 31, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 3.0}, "id": 36372268}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled with family", "text": "My husband and two teenage children stayed in a family room in this hotel a few weeks ago. The room was clean and well maintained. The airconditioning worked very well, and the beds were firm but great. The room was certainly on the small side (as are most european hotels), but we really only slept there. The bathroom was the only down side, as there was no way to fit more than one person in there at the same time...exceedingly small even by european standards.", "title": "Good Value Good Location", "helpfulness": 1, "user": "XPatsTravL", "date": "July 25, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 3.0}, "id": 35748357}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "The location was great...right behind Vatican city, and about a 8 min. walk to the metro! I would absolutely stay here again!", "title": "nice hotel", "helpfulness": 1, "user": "Matt J", "date": "July 23, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 35609951}, {"rating": 4.0, "title": "Good stay", "text": "We stayed here for 2 nights as part of a rome/florence trip. It's in a perfect location for visiting the vatican which we did both days. The city center is a short metro ride away. The rooms are small but have nice clean bathrooms. The TV was worthless but you don't go all the way to rome to sit in your room and watch TV. Breakfast was good (breads, meats, fruit, cereal, juice, coffee etc). If you take a cab make sure you have the address of the hotel with you because none of them know where this place is.", "helpfulness": 1, "user": "Tingeling", "date": "July 21, 2009", "id": 35403319}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "On this stay it was important to me to choose \"the right hotel\", so I did some research in advance. Travelling with relatives, I wanted to find a quiet, safe and resonably priced hotel.", "title": "Lovely stay", "helpfulness": 1, "user": "debmacc52", "date": "July 11, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 34495314}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled with family", "text": "Stayed for 3 days and hotel staff were very helpful from directions to recommending places to eat, was not dissappointed once. If you get the chance ask for Rey one of the porters, very helpful as with all the staff. Rooms are tight but its Europe, Metro a short 5-8 mins walk and a short ride to all the sites. Vatican museum is next door and St. Peter's square 12-15 mins walk. Neighborhood is always alive and we felt safe walking around at night to & from Metro, but as with any city just be aware of your surroundings. This is not a 5 star hotel & location, but well worth the money. Very accomadating.", "title": "Convenient Location", "user": "vondarkmoor", "date": "July 6, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 34087922}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "I've just returned from my first break in Rome. On arrival we found that due to it being our anniversary we had been upgraded to a room with a balcony. We had also been given a fruit platter! this was a lovely gesture and made for a warm welcome.", "title": "not bad at all!", "user": "summerDoncaster", "date": "July 4, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 2.0, "service": 4.0, "rooms": 3.0}, "id": 33893446}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled with family", "text": "The breakfast was nice and plentiful, serving all the usual such as eggs, bacon, sausage etc.", "title": "Good value for money", "user": "HansTraveller", "date": "July 1, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 33626340}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled with friends", "text": "A few times we asked the front desk for recommendations/advice and they were always happy to help.", "title": "Great", "user": "Nana35", "date": "June 25, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 33172506}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "Unfortunetly i wasn't as impressed with Rome itself ,this was a HUGE dissapointment as i have been to other parts of italy and loved it.", "title": "Lovely Hotel", "user": "DublincoupleDublin", "date": "June 25, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 33123826}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled with family", "text": "We just returned from a 5 night stay. The front desk staff was very helpful. Rooms were clean. We had stayed here 12 years ago and the hotel was very good then....is much nicer now. If we ever make another return trip to Rome, we will stay here agan.", "title": "Great Hotel", "user": "Gotsatravel", "date": "June 20, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 32742639}, {"rating": 4.0, "stay_parameters": "Stayed May 2009, traveled with family", "text": "Great hotel with a friendly staff that is conveniently located within walking distance of all the major sites. Extremely close to the Vatican and St. Peter's. Room was spotlessly clean! Would highly recommend", "title": "Great hotel in perfect location!", "user": "redsamp11", "date": "June 12, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 32196344}, {"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "I stayed in a four-people-room and we have a good value of price. The hotel is next to the Vatican and very close to metro station Cipro. The service is very good and the front desk is helpful. We had a good stay in Hotel Spring house.", "title": "Good Roma Hotel", "user": "bari_ttc", "date": "June 10, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 32070640}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "p.s. The is a very nice gelato ice-cream shop in the main street next to the hotel, it is worth to try it, it is just so nice.", "title": "Lovely Hotel, Fantastic Location ......", "helpfulness": 1, "user": "Jules094", "date": "June 7, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 31764947}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled with friends", "text": "We stayed here for 5 nights to see the Champions League football and also to sight see, it was a last minute choice as our original trip had been cancelled by the company we booked through... We are so glad it was because this hotel was brilliant .. It is in a fantastic location for anyone who wants to be near the vatican... It is also close to the Metro so that makes getting everywhere in Rome easy. Hotel arranged our transport to and from the airport. We arrived very late in the evening but this was no trouble for the hotel. Breakfast had a great selection, Bennie was always happy to help. Sergio too was always really friendly in the bar and glad to help... We styayed in Romm 105 a double superior and it was great. Great kebab shop across the road for a late night snack... Rome was a amazing place and all the people were really friendly.", "title": "Wonderful place", "user": "travel1188", "date": "June 4, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 31542721}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "I loved this hotel! The folks working at the front desk were so friendly and courteous. They helped us with directions and good food spots - always very nice. The rooms were modern and very comfortable and clean. The morning breakfast was out of this world! They had delicious items to choose from and very friendly service.", "title": "Wonderful staff and sooooo close to the Vatican!!! - A Catholics dream!", "user": "ConradsHelper", "date": "June 2, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 31411751}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "The best part was the location for my wife and me. It is extremely close to the back wall of the Vatican - by the way that is where the entrance to the Vatican Museum is. It is an easy 10 minute walk to the front of the Vatican. My wife and I were mostly interested to going to the Vatican every day - so for us it was perfect! Close to nice food places and the metro.", "title": "Great stay near the Vatican & Metro", "user": "handriv", "date": "June 1, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 31271281}, {"rating": 4.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "I would stay there every time I went to Rome!", "title": "Close to Vatican Museum", "user": "travel4value", "date": "May 29, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 3.0, "rooms": 4.0}, "id": 31079945}, {"rating": 4.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "We arrived 10AM on a Friday too early for check in, the hotel staff was very helpful they held our bags and gave us a map & directions and we set out on our own to see rome. The breakfast is excelent and plentiful the staff is wonderful. We were amazed at how close we were to the Vatican Museum 1 block and up the stairs a 5 min walk. the Metro is equally convenient, The area surrounding the Hotel is safe we often came back after site seeing on our own at midnight. Mass at the Vatican with the Pope was amazing we walked over at 8:30 with no ticket and waited in line which moved amazingly fast we walked right in. I will warn you the mass is 2 hours long. St Peters was breath taking all lit up. I would recommend this hotel to anyone interested in touring rome on their own, the staff, location and the Value exceeded our expectations.", "title": "Small but very nice...", "user": "Nzaar", "date": "May 23, 2009", "detail_rating": {"cleanliness": 5.0, "value": 2.0, "location": 3.0, "service": 5.0, "rooms": 2.0}, "id": 30583757}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled on business", "text": "The Hotel was what they said it was. It met all of our needs as far as price, cleanliness, and location. It is a 2 minute walk to the Vatican Museum, about 5 minutes from the Cisco Metro station. We enjoyed the free American Style Breakfast. The room ample size, Bathroom was a little small but workable.", "title": "I took pictures of my room and my balcony, to always remember them.", "helpfulness": 2, "user": "troutt", "date": "May 20, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 30382902}], "location": {"country": "Italy", "region": "Lazio", "continent": "Europe", "city": "Rome"}, "stars": 3, "variance": {"poor": 30, "average": 78, "very good": 338, "terrible": 21, "excellent": 327}, "aka": "Best Western Hotel Spring", "slim_ranking": 0.190213101815, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.0, "rooms": 4.0, "location": 4.5}, "description": "Our location in the center of Rome, walking distance to the Vatican, Saint Peter's Basilica, Sistine Chapel and much more of historical Rome,international standard of quality and Italian hospitality are what make up an unforgettable stay in Rome. The Best Western Spring House's recently renewed and renovated style give you the ultimate \"home away from home\" experience, whether visiting for business or leisure."}