{"user_rating": 4.5, "review_count": 250, "name": "BEST WESTERN PLUS Black Oak", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "Loved the hotel, very nice for the price, just be sure to book through Expedia to get the best rate.", "title": "GREAT!!", "user": "rollergirlusa", "date": "January 18, 2010", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 53807799}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled with family", "text": "Really nice room, COMFY bed, great front desk. Wasn't crazy about the breakfast ($5 coupon from hotel instead of continental breakfast) at the diner connected to the motel though.", "title": "great value and location in wine country!", "user": "nickydee_Long_Beach", "date": "January 14, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 53486033}, {"rating": 4.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "Otherwise absolutely no complaints. Ask for coupons on wine tastings at front desk.", "title": "surprisingly comfortable", "user": "pusskin", "date": "January 11, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 3.0, "service": 5.0, "rooms": 4.0}, "id": 53160354}, {"rating": 3.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "I hate to write great reviews because the next time I go to book it will not be available but... We had a great time, the hotel was recently updated and it looks great. The rooms were spacious and clean and the staff were pleasant. We had small children who would have loved the playground if it was not raining but did use the hot tub. Margie's diner had great large breakfast which need to be split and with the 5dollar vouchers breakfast is almost free. You can not beat the location. We will be using this as our hotel of choice in Paso.", "title": "Decent accomodations-value", "user": "imontheroadagain", "date": "January 4, 2010", "detail_rating": {"cleanliness": 4.0, "location": 5.0, "value": 4.0, "rooms": 4.0}, "id": 52593160}, {"rating": 5.0, "title": "Clean and comfy. Great value.", "text": "After having stayed in Hyatts and Marriot Courtyard's, we didn't expect this Best Western to be as comfortable but it was. Great amenities (coffee, microwave, jacuzzi, heated pool), very friendly and helpful staff and the computer in the lobby was an added bonus as we needed to confirm our flights back for the next day. The staff even emailed us to say we'd left a couple of books and a pair of jeans in the room - we'd runout of space in our suitcases and didn't know where to find a thrift store so the lady who emailed us said she'd sort it out for us. Great service.", "user": "Swifty911", "date": "December 1, 2009", "id": 50426263}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "We attended the Zinfandel Festival and stayed four nights here. The staff went out of their way to be helpful and friendly. The hotel is older but the rooms have been upgraded and the bed was comfortable with plenty of fluffy pillows. The pool area was clean and welcoming. The staff had great recommendations for wineries and gave us a lot of complimentary tasting coupons for area wineries.", "title": "Great friendly service and good value.", "user": "santafe2", "date": "March 27, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 59658247}, {"rating": 4.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "After driving for 5 hours, we arrived at this hotel close to 10 pm. The warm lobby was a welcome sight, and was small and cozy with coffee pots set up. The receptionist was friendly and genuine, and very helpful. The rooms were accessible from the parking lot, and we stayed on a ground floor one. There was a diner on the other side of the parking lot that offered breakfast vouchers for a discounted price. The rooms were a little outdated, but very clean. The television was also small and old, but being late at night, that was not an issue for us. The highlight of the entire hotel were the luxuriously soft beds. It was the best nights sleep I have had at a hotel. Early the next morning we checked out, and had breakfast at Starbucks which was a few buildings down.", "title": "Wonderful value!", "user": "parikab16", "date": "March 19, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 58998847}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "Overall, a very good price for the value. It was really the only \"middle\" class hotel in Paso Robles, the others were dives or very expensive.", "title": "12 weeks of US travel - great place to stay", "user": "rlynd", "date": "February 9, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 55592694}, {"rating": 4.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "Our stay was extremely comfortable. We were travelling by train and the staff were happy to pick up and return us to the train station. The room was spacious, quiet and comfortable and very clean. There were many choices of food next door and within 2 minutes walk. Our 3 night stay was not long enough. We would love to have stayed longer.", "title": "Great stay for weekend of wine tasting", "user": "MontereyGirl47", "date": "February 8, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 55512424}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled with family", "text": "The area is just beautiful and our tour to Hearst Castle with Wine Wrangler was First class, with special treatment for a birthday celebration.", "title": "Great place to stay in Paso Robles.", "user": "onoman", "date": "February 8, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 55436500}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "Stayed two nights over the 4th of July weekend. The hotel is located just off the freeway and not far from the center of town. Surprisingly, there was no road noise to disturb our sleep. The room was very large and exceptionally clean. We had a microwave and fridge in the room as well as basic amenities. Our room was on the second level at the top of the stairs. The first morning some peope congregated here early and woke us. This is not the fault of the motel, but I would suggest a room on the second level away from the stairs. A nice motel for a getaway in the Paso Robles wine country.", "title": "Nice Room for the Money", "user": "DFHS", "date": "July 5, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 69773790}, {"rating": 4.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "This is a very well maintained motel with interesting plantings about 10 blocks from the center of Paso Robles, conveniently located at the intersection of 101 and 46 East. The rooms are large, comfortable, and quiet, and there is a $5 coupon per person for breakfast at the adjacent diner. A good value.", "title": "Pleasant motel with lovely landscaping", "user": "JuliaLaJolla", "date": "July 3, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 69505447}, {"rating": 4.0, "stay_parameters": "Stayed June 2010, traveled with friends", "text": "I had a fabulous time at this Best Western. I must say, the front desk service was exceptional and they made me feel welcome from the minute I stepped foot in the lobby to check in.", "title": "Fabulous customer service and nice hotel", "user": "LilMissTraveler", "date": "June 9, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 67001069}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "Sharon and her crew were so kind and inviting. They even looked up a few auto parts stores in the area for me as I needed to get some engine oil.", "title": "Superior cleanliness excellent service.", "user": "DesertCowboy60750", "date": "May 27, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 65481285}, {"rating": 4.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "Location: this is just off the freeway (101) but you do NOT hear any traffic. It is right next to gas stations, convenience stores, a Denny's, some good fast food places, a hilarious BBQ joint with a mechanical bull, and the awesome Margi's Diner (and they give you $5 off coupons for it). So location-wise, this is great. I was going to an event at the event center and it was literally around the block.", "title": "Good Break From Being On the Road", "user": "casadedale", "date": "April 15, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 61626293}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled with friends", "text": "We booked a double queen non-smoking room for $100 a few days before our trip. The room is enormous and spotless with a large over bath shower. Even though I was a bit skeptical about staying at a Best Western I am glad I stayed there, and will do so again!", "title": "Spacious and Clean with Comfortable Beds", "user": "dimitra11", "date": "November 30, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 50364102}, {"rating": 4.0, "stay_parameters": "Stayed November 2009, traveled with friends", "text": "I stayed here for a recent wine weekend with my wife and another couple. Yes it is \"just a Best Western\" and not a luxury hotel. However I was extremely impressed with the friendly service and quality of accommodations. The front desk staff was very helpful, made sure that everything was perfect, even giving us passes for complimentary wine tasting at 4 different wineries. The room was not only spotless but was much larger than I had expected. The hotel is located less than one mile from the center of town which makes it within easy walking distance and a good thing after a day of wine tasting. We will definitely make this our \"go to\" hotel in Paso.", "title": "Terrific value with great service", "user": "Redlands_CAFoodie", "date": "November 24, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 50006223}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "My wife and I stayed here for three nights. We booked online and got AAA rates at $89 per night. King bed was comfortable. The room was good sized and clean. Looked like it had been remodeled recently. Had a small fridge and microwave which is good if you have leftovers from local dinners or have beers to chill. Pretty easy check in and check out. Exactly one mile from downtown square. Probably a little far to walk there but Paso has cabs. As it is a older property redone, you can hear people a little bit if they are walking / talking on the outside walkways. For the money, it was a great value. We also like newer Hampton Inn south of town but overall the Black Oak is a better deal.", "title": "Great value and very clean and comfortable rooms", "user": "Louis1ma", "date": "November 20, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 49709257}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "We were upgraded to a larger king room. It was very nice, very roomy. The bed was firm but comfortable and the linens were nice. The hotel gave us each a $5 off coupon for breakfast at the onsite restaurant. Beware--their breakfasts are enormous! (and good, too). We were on a road trip from Wa to S Ca for a wedding, so we stayed just one night. We drove around the country side and visited Wild Horse Winery--fun things to do if you have the time. We didn't use the pool or spa, but they looked very inviting.", "title": "A great value", "user": "WAGAL9", "date": "October 25, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 47749675}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "Spent 3 nights here mid week 15 - 17 sept. The room was spotlessly clean and fresh. The big plus of this place was the pool. My bug bear is often hotel pools are too shallow ( below 4ft) but this one had depths upto 6-7ft. That and the sauna and jacuzzi made it a winner after a day sightseeing.", "title": "great value and excellent service", "user": "dhhtaylor", "date": "October 4, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 45785408}], "location": {"country": "United States", "city": "Paso Robles"}, "variance": {"poor": 0, "average": 26, "very good": 110, "terrible": 4, "excellent": 110}, "aka": "Best Western Plus Black Oak Hotel", "slim_ranking": 0.388888888889, "description": "Stay at this Paso Robles, California hotel situated in the beautiful coastal valley of wine country! The Best Western Black Oak Motor Lodge is conveniently located with easy access to key area attractions including over 200 nearby wineries, Lake Nacimiento and Lake San Antonio, Hearst Castle and numerous local festivals. Hotel guests will appreciate the variety of nearby dining and shopping options in the historic downtown of Paso Robles.Each year, Best Western recognizes hotels that have provided superior experiences for our guests. Awards are given to properties that represent the highest levels of service, quality, value and commitment to the brand. BEST WESTERN PLUS Black Oak is proud to be the winner of Best Western's Champion in Customer Care award for the past three years."}