{"user_rating": 4.5, "review_count": 235, "name": "BEST WESTERN PLUS Revelstoke", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "Best Western Plus in Revelstoke hits all the high marks. From the easy-to-catch signage off the Trans Canada Highway to beautiful chocolate and amber decor, luxury pillows, beds that reach that sweet spot between supportive and soft, professional and friendly staff, solid construction so that the rooms are whisper-quiet, beautiful outdoor pool and spa, this hotel ranks a 10 out of 10.", "title": "Perfection on every count", "user": "Qoj", "date": "September 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 176053871}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "As in all things, the true measure of hotel staff lies in how well they handle a surprise and ours came in the form of a large dog. We had booked through booking.com, but somehow our note that we were travelling a la canine was lost. When we announced our pup, the staff were momentarily perplexed over how to manage the problem because the hotel was completely booked, giving them little room to manuveur.", "title": "Very nice stop-over hotel", "user": "kallie93", "date": "September 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 176137293}, {"rating": 5.0, "stay_parameters": "Stayed August 2013", "text": "Nonetheless, they calmly managed it by searching for a non-pet guest who had inadvertently been booked into a pet-room, and switched our room bookings (Important note: The other guest hadn't arrived yet, so no one was physically moved from their room).", "title": "Great Surprise!", "user": "JN403", "date": "September 5, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 175891318}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "It would have been easy for the BW staff to blame the communication drop about the dog on booking.com, but they didn't. Instead, they said it could have been their error as easily as it could be booking.com's gaff. It was refreshing to see someone so honest.", "title": "What A Pleasure Was This Treasure!", "user": "solostar25", "date": "September 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 175805598}, {"rating": 5.0, "stay_parameters": "Stayed September 2013", "text": "This hotel costs a little more than some, but the extra $20-$40 is easily worth it for the great night's sleep. We did an online search and found the best rate through booking.com.", "title": "Lovely, just lovely", "user": "JorgenSandy", "date": "September 3, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 175474290}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled solo", "text": "excellent accommodation , very quiet, and clean, helpful staff, lots of parking, wi-fi worked well in room, excellent breakfast provided, had a good sleep, I will be back to stay on my return trip home.", "title": "Stay in Revelstoke", "user": "Heinz S", "date": "September 30, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 179415259}, {"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled with family", "text": "To be honest, they ran out of pet rooms, so I slept in the car with three dogs, because it is against the law or something for dogs to sleep in cars alone. The rest of the family took the room. I felt entiltled to the free breakfast, anyway, which was good. The rooms were nicer than 90% of the places I have stayed. I guess that is why it is called Best Western \"Plus.\" It is a hotel off the TransCanada highway and was much nicer than we would have settled for. Pool and hot tubs were being used by many people. It was pricier than I am used to, but it was also the only place to stay without driving another 4 hours because it was a long weekend. Now that I remember, I think the AC was noisy according to the people that got to sleep in the room.", "title": "Only place we could find that night within 100 miles - but turned out good", "user": "PMahdis", "date": "September 27, 2013", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 3.0, "service": 4.0, "rooms": 5.0}, "id": 178834613}, {"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled with family", "text": "There is nothing better than having a snooze in a comfortable bed in a room that more than meets expectations in cleanliness, space and appointments. The only downside was a system crash that meant no electronic communication or utilization of the business center. The staff was outstanding! The gentleman we first dealt with advised us about the hotel and its connection with an off site upscale dining room and deals. When we opted for more casual he directed us to a lovely restaurant nearby. Later as a result of not being able to use our IPAD to book hotels in Calgary the reception clerk Mallory went above and beyond expectation attempting to book us into suitable accommodation. The staff certainly promoted their own first, but also advised on others when all Best Western's were booked. They worked swiftly and efficiently and knew when to disengage to deal with their own customers and then return to the task at hand. Very commendable.", "title": "Please promote your staff recruiter and trainer", "user": "Carole O", "date": "September 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 178455250}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "Service was really good and friendly. The room was really nice and clean and comfortable. The location was good and easy to find. The complimentary breakfast was great and saved us money and time. The pool and hot tubs were clean and nice. Great experience.", "title": "Nice Hotel in a beatiful Town", "user": "Karen U", "date": "September 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 178037820}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "The Best Western in Revelstoke is definitely a place I'd stay again. Rooms are very nicely equipped, and the beds are - what else - dreamy! The hotels has a small business center with good computers that were welcome when I needed to send a long email but only had my tablet with me. The free breakfast is excellent - many choices, hot food, and with adequate seating for a large number of people.", "title": "A very nice place in a very nice town", "user": "littlegirlblue", "date": "September 20, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 177952269}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled with family", "text": "Checked into this hotel for a break on a drive from Calgary to Kelowna. The location is perfect- about a block off of the Trans-Canada (Hwy 1) and located away from the railroad track. Hotel looks and feels brand new. Room was in perfect shape, good sized, and beds/pillows were comfortable. We asked for a crib for my son and it was set up in the room and ready to go when we arrived- they even had a little blanket available for him.", "title": "Brand new but pricey", "user": "HMTY", "date": "October 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 181638504}, {"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled on business", "text": "Breakfast was the standard continental-plus fare with make-your-own waffles (albeit only one waffle-maker so we had to wait a bit), and eggs and sausage for hot items. Decent-sized dining area for breakfast.", "title": "pricey, but worth it", "user": "Harri H", "date": "October 18, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 3.0}, "id": 181491918}, {"rating": 4.0, "title": "Comfortable Hotel", "text": "We didn't try the pool or hot tubs- they were outside and we arrived at night in October so it was a bit chilly for my little ones. Looked like there was only one hot tub open as the others had mats over them.", "user": "Cayennekt", "date": "October 11, 2013", "id": 180629472}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "The room was pretty pricey for a \"small town\" but judging from the other reviews it looked like s sure win especially since I was traveling with three small children. Would highly recommend if you are willing to pay the price!", "title": "Great welcome and comfort for a ski weekend", "user": "Robert E", "date": "October 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 179471708}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "A short overnight stay where reservations had been made by a local Revelstoke contact.", "title": "Good Place to stay", "user": "cateHi", "date": "September 30, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 179280107}, {"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled with family", "text": "Liked the hotel, didn't like that they lowered the price just after I booked the online price that couldn't be changed at all. I booked the hotel online with the online best price knowing that we couldn't cancel or change our reservation. About a week after I did this, they lowered the online price by over $30 for the same room.", "title": "Nice Hotel", "user": "Troy B", "date": "September 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 177474097}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled solo", "text": "Great hotel for the price paid. It can get up there, especially if you eat supper at the hotel restaurant. However I found the rooms very clean and quiet. Excellent service at the front desk and from the morning breakfast attendant.", "title": "Best Place to stay in Revelstoke", "helpfulness": 1, "user": "534DouglasM", "date": "September 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 177085779}, {"rating": 3.0, "stay_parameters": "Stayed September 2013, traveled on business", "text": "As it is a new hotel I was excited to stay here. Unfortunately the craftmanship of the construction meant a lot of shortcuts were visible; peeling carpet, trim falling off. Breakfast was good but they need more space to fill your plates. Room cleaning was obviously not too detailed as I stepped on someone's lost earing. I stopped in the week before to check for availability and the front desk person was abrupt and not overly friendly. But on my check in this time the front desk man was very nice. Overall, I found it expensive for what you get.", "title": "Nice but overpriced", "helpfulness": 1, "user": "Carla G", "date": "September 9, 2013", "detail_rating": {"service": 4.0, "cleanliness": 2.0, "value": 2.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 176558892}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "We were on the highway and needed an overnight stay. We saw the best western and what a find. The hotel is about 2 years old and done out to a good standard thoughout. The room had 2 comfy queen beds,safe,microwave and fridge. A wet room. The hotel has an outdoor heated pool and hobtubs. The breakfast was great with a waffle station. The staff were really helpful and knowing our next stop would be kamloops there arranged the room for our next stay. Excellent .", "title": "Great find", "user": "Turtleonavespa", "date": "September 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 176240788}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "We started here in August 2013. The kids loved the place, thanks to the great pool (a heated pool and two hot tubs with different temperatures) and breakfast. The parents also liked it. The whole area is beautiful.", "title": "Beautiful place, kids loved it", "user": "Yaniv R", "date": "September 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 176136184}], "location": {"country": "Canada"}, "variance": {"poor": 1, "average": 10, "very good": 81, "terrible": 0, "excellent": 143}, "aka": "Best Western Plus Revelstoke Hotel Revelstoke", "slim_ranking": 0.125, "description": "Boasting brilliant views of the Monashee Mountains. Conveniently located minutes from world renowned skiing, snowmobiling and the Revelstoke Golf Course. 100% non-smoking property with free continental breakfast, free Internet, business center, fitness area, steam room, outdoor pool and 2 hot tubs; all the comforts for our business and leisure guests."}