{"user_rating": 3.5, "review_count": 176, "name": "BEST WESTERN Opera Grands Boulevards", "reviews": [{"rating": 2.0, "title": "Not for us", "text": "The hotel was welcoming and the beds comfortable but carpet dirty.. Good breakfast and helpful staff. The run down area however was NOT comfortable for a group of middle aged women travelling alone and this could have been made clear when booking. There were no other women visible as we walked back from the Metro station in an all male atmosphere.", "user": "Misticaber", "date": "October 2, 2006", "id": 5901066}, {"rating": 2.0, "title": "Needs some repairs and maintenance", "text": "The staff at this hotel are helpful and speak good english and the location is ideal if you want real Parisien culture with plenty of good eateries and bars nearby. However, the hotel itself needs some care and attention. We booked a smoking room and were not allocated one which, as we were only staying for two nights, we could live with. The decor is poor, with torn and dirty wallpaper and the carpets need ripping up and replacing. The room itself was a good size for Paris standards but a constant humming noise on our first night interrupted our sleep. On reporting this to reception, they gladly allocated us another room and explained that the noise was due to the WIFI equipment. I cannot believe they offer free wireless WIFI when considering the decor and condition of everything else. Best Western need to get their priorities right. The cleanliness was not good. The bath plug hole had a mass of hair in it and on opening the bathroom window, I discovered that they also had a pidgeon issue. The area around the bathroom window was full of feathers and excrement.", "user": "Iandevon", "date": "October 1, 2006", "id": 5897440}, {"rating": 2.0, "title": "Basic hotel in a rough neighbourhood", "text": "Now work this one out too. Our non smoking room was on the second floor (room 201) the second room, ie the smoking room, was on the first floor. Therefore if there was a fire, where would it spread from? I rest my case.", "user": "Magic_Carpet_Ride", "date": "May 2, 2006", "id": 5029247}, {"rating": 3.0, "title": "Opera Grands Boulevard Hotel....", "text": "We were supposed to stay at the Best Western Celte La Fayette. When we reached there, we were told that some rooms were in a mess and were moved to this hotel. This is definitely more run down and in a rougher neighbourhood; accepting the change was a mistake.", "user": "MrBIreland", "date": "October 27, 2005", "id": 4055209}], "location": {"country": "France", "region": "Ile-de-France", "continent": "Europe", "city": "Paris"}, "stars": 3, "variance": {"poor": 21, "average": 45, "very good": 68, "terrible": 17, "excellent": 25}, "aka": "Best Western Opera Grands Boulevards Hotel", "slim_ranking": 0.533742331288}