{"user_rating": 4.0, "review_count": 326, "name": "BEST WESTERN Airport Albuquerque InnSuites Hotel & Suites", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled solo", "text": "Just spent two nights here flying in and out of the area and was impressed. Very near the airport but quiet--I slept great. My room was quite large with a nice desk and chair,fridge and microwave and coffee. Climate control worked well. Breakfast does not start until 6:30 am and I had to leave early so missed that, but enjoyed the nachos and salsa in the evening on my second night. Shuttle to the airport was prompt and drivers very helpful. I would definitely stay here again; Tim was especially helpful", "title": "Great location and service", "user": "TCTraveler_10", "date": "December 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 147160391}, {"rating": 1.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "Hotel makes a big deal about suites. My room (called a suite) was not big enough to easily fit in two beds - although two were squeezed in. There was no chair in the room to sit in to watch the television (no room for one). There was only warm water for a shower in the morning. The adjustable shower head did not work. Breakfast had cold, dry prepackaged scrambled eggs; cold uncooked prepackaged hash \"white\" potatoes; cold, \"white\", uncooked prepackaged sausages; NO bread (not even one slice); one muffin; no butter (just margarine); no coffee cream (just powdered plastic coffee whitener); and watered down juice and coffee.There was no employee attending to any of these things the whole time I was there - two days. The breakfast area was crammed into the lobby area. There were only six tables and 2 were under the open back stairwells were the traffic dirt fell through. There was absolutely no sign of a manager anywhere during my stay except for sending text messages from home or some external location to the employees. Employees are not supposed to have their cell phones out and visible while working, but they must get them out to receive and reply to the text messages sent to them by their manager while customers (me) must just wait. I carefully wrote all of this back to the hotel management and got a Best Western unanswerable \"sorry\" form message not even from the General Manager, but from a Sales Manager! All of these problems are management problems - not working employee problems, and there was no management available or interested. There was no attention to detail or no care about detail. I say do not spend money here.", "title": "Poor facility in my opinion", "user": "EdmondNeuberger", "date": "December 8, 2012", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 1.0, "sleep": 3.0, "rooms": 1.0, "location": 4.0}, "id": 147015951}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled on business", "text": "This hotel is close to the airport, several restaurants (including a waffle house and pancake house very close), and is far enough off the main street to be quiet. A Very helpful staff and nice amenities!", "title": "A great place", "user": "BRIAN K", "date": "December 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 146918802}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled solo", "text": "Checked in late, missed evening drink and snacks. Bed was very comfortable, room was clean. Breakfast was not quite warm enough. I spilled some salsa on the floor at breakfast, told the young lady at desk. She just handed me a box of kleenex! Ride to the airport was fast and efficient, he helped me with my bags. Overall, an excellent value for the money!", "title": "Great price, comfortable", "user": "LoreneRS", "date": "December 5, 2012", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 146853360}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled with family", "text": "We recently stayed here while flying into and out of Albuquerque. Location is great, actually within walking distance of the airport. By the time we had arrived in the late evening the last shuttle was finished but the very kind shuttle driver from the Sheraton drove us to our hotel. The next morning the shuttle driver from the Best Western made a special trip to the car rental place for us which was really appreciated. All in all we stayed 3 nights and probably had some of the best sleeps on the whole trip. No outside noise was heard which we found amazing considering how close we were to the airport. I'd definitely stay here again.", "title": "Helpful staff", "user": "westcoasthiker1", "date": "November 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 146505224}, {"rating": 3.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "While this is a better-than-some hotel in some aspects, in others it is lacking. As mention previously, there is no elevator to the second floor which can be difficult when carrying luggage, Christmas gifts, etc. Room was well appointed when we first got there, but sometimes they seemed to forget to replace the items used or dirty. If I have to pay full price per day for a multi day stay, then I expect each day's presentation to be the same as if it were my first day there. I would gladly pay a bit less each extra day and not have everything renewed or replaced - except for the coffee, I need the coffee.", "title": "Big hotel, few breakfast spots", "user": "Tenormary", "date": "January 12, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 149535406}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "The biggest problem here is the very small size of the breakfast area. There are not nearly enought seats for the clientele at any one time. Also, they were very slow in replacing food. What they had was good, but they would run out of everything at the same time.", "title": "Worth the money", "user": "Mine-Aggies", "date": "January 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 149273796}, {"rating": 3.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "While it is conveniently located, the parking can be a bit dicey.", "title": "Adequate, and they are not suites", "helpfulness": 1, "user": "Mark B", "date": "January 7, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 149078918}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "A fancy name does not a fancy hotel make.", "title": "Great, Bang for Buck, I'll go back", "user": "bandit004", "date": "January 7, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 149062890}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled solo", "text": "My experience was Lovely. I especially liked the breakfast.", "title": "Dec. 2012", "user": "LARRY-W-S454", "date": "January 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 148841971}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "I did hear a little noise at night from crying children but not for long. The location was the best I could ask for as I didn't need the shuttle to get to the airport.", "title": "Convienent", "helpfulness": 1, "user": "martiflores", "date": "January 1, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 148549912}, {"rating": 3.0, "stay_parameters": "Stayed December 2012, traveled solo", "text": "This is definately near the airport and car rental center. Room was clean and comfortable. I enjoyed having a Village Inn Resurant close by. If you are not going to visit the city, then just take a taxi or shuttle to the airport. The hotel is located behind the Village Inn so keep an eye out. Buffet breakfast is included which is good.", "title": "first time here", "helpfulness": 1, "user": "Don R", "date": "January 1, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 148518860}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "The room was fairly clean. The door handle worked backwards so you have to raise it up to open it. The staff acted like that was normal. A lazy maintenance man used a piece of trim in the wall corner to plug a hole. The tv's were nice, but the picture was very fuzzy. Bed was comfy as were the pillows. I liked the shower heads.", "title": "This was the BEST hotel we had stayed in many a year.", "user": "Edward V", "date": "January 1, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 148515044}, {"rating": 3.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "Refrigerator door was broken and would not close. There was NO map of the hotel grounds in my room.. That's a direct fire code violation.", "title": "Not very nice for a suite", "user": "BRYAN S", "date": "December 31, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 1.0, "sleep": 1.0, "rooms": 2.0, "location": 4.0}, "id": 148460346}, {"rating": 3.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "This is the hotel that you use to make an early morning flight out of the Albuquerque Sunport. The shuttle from the hotel to the departure lane takes less than five minutes. Travel light, however, as the hotel has no elevators and if your room is on the second floor you have to carry your luggage up the staircase. It was Christmas Eve and I was only concerned about making the flight home and not making family members in Albuquerque feel obligated to get me to the airport on Christmas morning with the threat of snow coming in overnight.", "title": "Christmas Eve Convenience", "user": "WILLIAM C", "date": "December 30, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 148359223}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "Stayed here for one night, chose it due to proximity to the airport, and is a short drive away from the car rental center.", "title": "Good hotel", "user": "Conjured", "date": "December 14, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 147412891}, {"rating": 3.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "The hotel was quiet and comfortable,the room was well maintained, and everything looks pretty new.", "title": "So so hotel, good quiet location", "user": "kyms9", "date": "December 11, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 147204460}], "location": {"country": "United States", "city": "Albuquerque"}, "stars": 2.5, "variance": {"poor": 16, "average": 46, "very good": 103, "terrible": 10, "excellent": 151}, "aka": "Best Western Albuquerque", "slim_ranking": 0.158620689655, "description": "The BEST WESTERN Airport Albuquerque InnSuites Hotel & Suites is located just a few blocks from the Albuquerque International Airport -- ABQ. Hotel guests looking for a great location will find themselves near Kirtland Air Force Base, Sandia National Labs and the University of New Mexico. Popular events near the hotel include the Albuquerque International Balloon Fiesta and Gathering of Nations Pow-Wow. Other popular attractions near the hotel include The Rio Grande Zoological Park, Albuquerque Aquarium, and Rio Grande Botanic Garden in Albuquerque. The Sandia Peak Ariel Tramway & Ski is just a short drive away."}