{"user_rating": 4.5, "review_count": 353, "name": "BEST WESTERN Hotel Orion", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled solo", "text": "I stayed in Orion hotel last week.It is located in Buda side.Walk distance from city centre.Very clean hotel.Breakfast is above average.Reception staff is very friendly.I would stay here again.", "title": "Nice Hotel", "helpfulness": 2, "user": "chanee", "date": "November 12, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 21767395, "likes": {"liked": "— receprion", "disliked": "— location"}}, {"rating": 5.0, "title": "Our Favorite Hotel Anywhere", "text": "p.s Try the 3 restaurants near the hotel.Ask the reception for the locations of them", "helpfulness": 1, "user": "fadopoet", "date": "October 25, 2008", "id": 21208335}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "We stayed in this hotel for over a week and would go back in a minute if we could. The staff was wonderful, the room comfortable and quiet, and the breakfast excellent. The location was perfect for us, as we like to walk, and crossing the Elisabeth Bridge every day was a pleasure. We were able to see the Danube in its various shades, and we found two restaurants nearby that we enjoyed--Tabani Terasz and Marvelosa. Walks to Castle Hill and Citadella are just across the street, and on past the Chain Bridge is Angelika, one of the loveliest restaurants I've seen. Can't praise this hotel enough!", "title": "Wonderful Buda Hotel", "user": "Klinepa", "date": "October 22, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 21095223, "likes": {"liked": "— Staff and location", "disliked": "— location"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2008, traveled with family", "text": "We stayed at this hotel for our first trip to Budapest. We took the bus/metro from the airport and emerged from the metro on the Pest side of the Danube. It was an easy walk over the Elizabeth Bridge to our hotel located near the base of the bridge on the Buda side. We were welcomed so warmly by the manager and told we had a room with a view of the Danube. The breakfast buffet was great. They even prepare eggs made-to-order. The location is right outside the castel area and at the base to cross the river to visit the Pest side. We walked everywhere but the tram stop is less than a block away. The staff is warm, courteous, and helpful.", "title": "Lovely Little Place", "user": "lalalatracy", "date": "October 21, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 3.0, "location": 3.0}, "id": 21077953, "likes": {"liked": "— Its clean & quaint", "disliked": "— Bed Linen was too used!"}}, {"rating": 3.0, "stay_parameters": "Stayed October 2008, traveled with friends", "text": "I choose this hotel after reading the reviews by all the other Tripadvisors & I was not disappointed.", "title": "good choice", "helpfulness": 1, "user": "ukboy102", "date": "October 18, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 20985074, "likes": {"liked": "— bar", "disliked": "— nothin"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2009, traveled with friends", "text": "The hotel is nice and in a pretty good location. The beds are small but comfy. The bathroom is super small but has everything you need. The water pressure at the hotel is awesome and something I didn't expect. There is no alarm clock and I don't know if they have a wake up call service. We really didn't need it.", "title": "Good Location. Great Breakfast.", "user": "shasha0777", "date": "May 2, 2009", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 3.0}, "id": 29195004}, {"rating": 4.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "They have a morning breakfast which was included in the price. There's a lot of breads and meats. They will also scramble eggs or fry eggs for you if you ask.", "title": "Surprisingly Good", "user": "Balikat", "date": "May 2, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 29177276}, {"rating": 4.0, "title": "Best Western Orion", "text": "The only bad thing is that there are no little cafe's around to grab a cheap quick bite to eat. Most of the markets, cafes and restaurants are across the river. But it's right next to a bus and rail stop. Also, walking across the bridge isn't that far either.", "user": "DavidNdakota", "date": "April 10, 2009", "id": 27762281}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled with family", "text": "There was a lot of construction going on around the hotel but nothing that was disrupting, however there was a stench that lingered outside but never got into the room.", "title": "Great place to stay excellent service", "helpfulness": 1, "user": "47_COOPS", "date": "March 31, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 27176198}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled with friends", "text": "We stayed 3 nights after river cruise.", "title": "Unbeatable service!", "helpfulness": 1, "user": "travelinfull", "date": "March 20, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 26518426}, {"rating": 4.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "The hotel is in a good location for Buda Castle and is about a 20 minute walk from Pest over the Elisabeth Bridge.", "title": "Very nice but not budaful", "helpfulness": 1, "user": "TravellingBernards", "date": "February 14, 2009", "detail_rating": {"front_desk": 2.0, "service": 3.0, "cleanliness": 3.0, "value": 5.0, "rooms": 4.0, "location": 4.0}, "id": 24562027, "likes": {"liked": "— The room"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2009, traveled as a couple", "text": "Our room was a good size and very cosy. Most of the staff were good. Breakfast was OK - not a very big spread, but eggs are cooked to order. The scrambled is more like an omlette. All good though.", "title": "Good value, pleasant Hotel", "helpfulness": 1, "user": "tbeard24", "date": "January 26, 2009", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 3.0}, "id": 23917772, "likes": {"liked": "— Staff and location", "disliked": "— small rooms"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2008, traveled with friends", "text": "No bar or restaurant, but there are two excellent restaurants VERY close to the hotel - Tabani Terasz and Aranyszarvas. We particularly enjoyed the Aranyszarvas.", "title": "Value and Location.", "helpfulness": 4, "user": "Lanerrossi", "date": "December 12, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 22669682, "likes": {"liked": "— Position and location Spotlessly clean", "disliked": "— Small bathrooms."}}, {"rating": 4.0, "stay_parameters": "Stayed November 2008, traveled with family", "text": "All in all a good quiet choice tucked away in Buda.", "title": "Great Place to Stay", "helpfulness": 2, "user": "annketz", "date": "December 2, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 22368683, "likes": {"liked": "— Location - friendly staff", "disliked": "— Small rooms - tight squeeze with baby cot"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled solo", "text": "We stayed in a double room (33) for a few nights in January 2009. The hotel is on the Buda side (West) of the Danube in between Castle Hill and the Citadella. It is a few yards from the river and so it's a short walk into the main town of Pest across the Elizabeth or Chain bridge. The nearest metro station is further than just walking across the river but there are trams that run nearby the hotel which go across the river into Pest.", "title": "Great Buda Hotel", "helpfulness": 3, "user": "mbechard", "date": "November 13, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 21818104, "likes": {"liked": "— The helpfulness of the hotel staff", "disliked": "— Nothing. A wonderful little gem of a hotel"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "I wont repeat everything other reviewers have already said as its all true. Free wifi was useful. If you don't like walking, you are probably better off staying on the Pest side as you will probably spend more time there. Although it doesnt matter where you stay really, you will be doing some walking as Budapest is so spread out. You must visit Rudas baths which are very close to the hotel and for food, we ate twice at Aranyszarvas (behind hotel across the road) and it was the best food we had in Budapest, excellent wine too, try the Takler Bikavér Reserve 2006, absolutely superb. 2 courses with wine for 2 is about 12000-15000 ft. Soul Cafe on raday utca was also good, their house red was great value. Only suggested improvement would be to add a room safe.", "title": "Excellent all round", "user": "bellmeister", "date": "May 28, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 30990777}, {"rating": 3.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "Stayed here for 6 nites with my wife for holiday. Our room was in very good condition with a comfortable and large king size bed. Although small, the room had a good layout, fridge, and good shelf space for storage. I found breakfast (served 7-10) to be just okay, with a small number of items. The omlette was very good. We only made it to breakfast twice b/c of the early hours. I bought my laptop and the free internet worked very well and was useful for keeping track of the weather each day.", "title": "Decent place, but perhaps a bit overrated...", "helpfulness": 1, "user": "Paul-SArlington", "date": "May 27, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 2.0, "service": 4.0, "rooms": 3.0}, "id": 30932829}, {"rating": 4.0, "stay_parameters": "Stayed May 2009, traveled with friends", "text": "Service at the front desk depended on who was there. The folks during the day are generally very good and friendly. As another reviewer noted, the large man who works nights is not very friendly. The heat did not work in our room and when I went down and nicely asked about this he told me very flatly he knew nothing about the heat, with a look of no concern at all, end of conversation. The shower was also very narrow and the showerhead incredibly difficult to use and control, although that may have just been a problem in our room. The area where the hotel is located, although convenient to transportation, has no charm at all. Also there is no place to go for a late nite meal; even the small convenience store across the street closes early, around 7 or 8pm. I did however discover that you can get Pizza Hut to deliver. In response to other reviews, I would say the hotel is a good 30-45 minute uphill walk to the top of Castle Hill and 20-30 minutes to cross the Erzabet bridge and get to Vaci utca. (The Central market is at the far east end of Vaci utca, maybe 6-7 blocks east of the Erzabet bridge). It is about a 15 minute walk to the Buda side of the Chain bridge and the adjacent funicular that takes you up to the Buda castle. Castle Hill is a few blocks away from the castle. Another way to get to Castle Hill is to take the bus from the foot of the Chain bridge. I believe it is the #16; there are signs at all bus stops telling you where the buses go.", "title": "Great location, ideal for long weekend", "helpfulness": 1, "user": "LoveTravelMustTravel", "date": "May 19, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 30318000}, {"rating": 4.0, "stay_parameters": "Stayed April 2009, traveled solo", "text": "One of the main reason I selected this hotel was b/c I had read the location was excellent and that you could walk to many attractions. We did not find that to be the case at all, and in fact, we used the excellent public transportation system just about every time we went out after we discovered how far things were. As I see it, location is not one of the advantages of this hotel. In fact, it really doesn’t matter where you stay in Budapest b/c the transportation system in Budapest is so good. The only shortcoming is if you are out after about 10pm. That’s when service becomes extremely spotty. We were out late several nites and were frustrated b/c the signs at bus and tram stops do not say when service stops. So you have no idea whether another bus or tram is coming. Once we got lucky after a long wait, but a couple of other times we had to walk and/or take cabs. We did not get ripped off by cabbies but were always careful to ask “how much” before getting in, and in general found cabs to be very cheap.", "title": "Good value hotel near river Danube", "user": "daniel19", "date": "May 5, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 29389203}, {"rating": 3.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "As for the hotel, based on the low price we paid (about $110US/nite), I would say we got our money's worth. However if I were going back, I would pay more and stay at the Hilton in Castle Hill, an incredibly charming and romantic area. Or perhaps the Art’otel at Bethany terrace. Bethany terrace is a nice area on the Buda side that faces directly towards Parliament. There is a nice restaurant (for lunch) behind the church on the square at Bethany terrace called Angelica. (This is a short public bus ride away). For dinner, there is a beautiful pedestrian-only street called Raday utca near the Kalvin ter metro with plenty of restaurants. We ate at the Pink Cadillac there; although the name makes it sound like a tacky tourist trap it is not, and the food (mostly Italian) was terrific. We also enjoyed both restaurants near the hotel; they are slightly more upscale, at least at dinner time. Whatever you do, if you’re there for pleasure, make sure you devote a day to Castle Hill and Fisherman’s Bastion. We also enjoyed shopping upstairs at the Central Market. The selection of items and prices here were the best we saw. You can take the 41 tram to the 6 tram and get there in 10-15 minutes. I believe it is at the Boraros stop, but confirm this with the front desk.", "title": "Clean, comfortable , great location", "user": "krnll5", "date": "May 4, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 29312372}], "location": {"country": "Hungary", "region": "Central Hungary", "continent": "Europe", "city": "Budapest"}, "stars": 3, "variance": {"poor": 4, "average": 37, "very good": 148, "terrible": 2, "excellent": 162}, "aka": "Best Western Orion", "slim_ranking": 0.140718562874}