{"user_rating": 4.5, "review_count": 637, "name": "BEST WESTERN PLUS Pioneer Square Hotel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled solo", "text": "Trust me, you will not be disappointed if you stay at this hotel.", "title": "One night was not enough", "helpfulness": 2, "user": "Mardie", "date": "July 6, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8069557, "likes": {"liked": "— the location", "disliked": "— No dislikes"}}, {"rating": 2.0, "stay_parameters": "Stayed May 2007, traveled on business", "text": "What can I say about the Best Western Pioneer Square Hotel that hasn't already been said? From the \"Welcome to Seattle\" from the girls at reception to the \"Have a good trip\" from the Bell Captain, this hotel gets my vote for being the best.", "title": "Great Location but Noisy", "helpfulness": 4, "user": "OberonSacramento", "date": "May 15, 2007", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 5.0, "value": 1.0, "location": 4.0, "rooms": 4.0}, "id": 7626327, "likes": {"liked": "— It was Clean", "disliked": "— The Staff Attitudes"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled on business", "text": "At the end of a long tiring day having travelled by plane and boat to reach Seattle, all my cares disappeared as soon as I opened the door to my hotel room.", "title": "Lots of charm", "helpfulness": 6, "user": "SeekWa", "date": "April 23, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 7419517}, {"rating": 3.0, "stay_parameters": "Stayed April 2007, traveled on business", "text": "The large room was beautifully decorated with the king size bed taking pride of place. It looked so peaceful and welcoming with the period furniture and matching appointments that I couldn't wait to unpack and relax with a cup of tea. The lighting was excellent with not a 40 watt bulb evident. The towels were plentiful and fluffy and there was loads of room in the bathroom to lay out my toiletries. I thought the framed picture on the wall was a nice homey touch. The room was quiet and there was no noise to disturb a dreamless sleep that night. In fact, I was glad the next morning I had set my alarm the night before.", "title": "Great customer service but lacking in other areas...", "helpfulness": 4, "user": "Sailoranne79", "date": "April 16, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 3.0, "value": 3.0, "location": 2.0, "rooms": 3.0}, "id": 7375345, "likes": {"liked": "— The shower!!", "disliked": "— Parking and the bed...."}}, {"rating": 3.0, "stay_parameters": "Stayed March 2007, traveled on business", "text": "I enjoyed my Continental breakfast the next morning of toast, jam, yoghurt, fruit and coffee. There was also cold cereals, Danish and muffins on offer.", "title": "Great for Games or Access to Pioneer Squares \"Culture\"", "helpfulness": 8, "user": "Traveling4BiznFun", "date": "March 3, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 3.0, "location": 3.0, "rooms": 4.0}, "id": 6907647}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "We spent the first night of our Pacific Northwest/Northern CA trip at the Pioneer Square and were very happy. The first room we were shown had a slightly odd arrangement where the TV was to the side of the bed and not easily viewable. Being from Boston and on the road for the first night of the World Series, being able to view the TV was important to us. At the front desk my request was easily and politely accomodated and we were given a more \"TV viewable\" room.", "title": "Very Good Stay", "helpfulness": 5, "user": "mmob100", "date": "November 6, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "location": 3.0}, "id": 10654730, "likes": {"liked": "— Great Staff", "disliked": "— Mediocre breakfast"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "We found the location of the hotel, particularly with the free public transport offered by Seattle to be great. The staff was very professional and helpful. The only slight negative was the breakfast which we found to be pretty mediocre. Overall, we were very happy with our hotel selection.", "title": "Location, Location, Location... Hospitality....Your hotel has it all!", "helpfulness": 3, "user": "patclatts", "date": "October 30, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 10441624, "likes": {"liked": "— Comfortable, clean rooms, hospitality, good breakfast, geat visitor recommendations for what to see and do", "disliked": "— It would be nice to have hot tub or pool"}}, {"rating": 4.0, "title": "We'd stay again", "text": "Dear Jo,", "helpfulness": 3, "user": "eebm", "date": "October 24, 2007", "id": 10287611}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "We wanted to thank you and let you now how much we enjoyed our stay at your beautiful hotel. Your rooms are very nicely decorated and extremely comfortable.", "title": "Good hotel", "helpfulness": 3, "user": "cjt9t9", "date": "September 27, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 10011872, "likes": {"liked": "— Big bedroom", "disliked": "— Small bathroom"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "We traveled with Russ and Rosemarie Regn. Thank you for also including us a bottle of champagne and basket of goodies. They shared", "title": "Very convenient location; highly recommend.", "helpfulness": 3, "user": "BDM22", "date": "September 2, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 8607866, "likes": {"liked": "— Convenience to nightlife/food", "disliked": "— Slightly weird smell in room"}}, {"rating": 3.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "My family of 4 stayed here before boarding a cruise the next day. The hotel staff recommended we take the light rail from the airport. This was a bargain, but drops you in a pretty sketchy neighborhood for you to walk with your luggage in two a few blocks. Once arriving to the hotel, our room was ready for an early check-in which we appreciated. Our room was nice. The hotel is a older building, somewhat quaint, but with a narrow lobby and common space. Included breakfast was sub-par, just a small step-up from a continental breakfast. Waterfront and Pikes Place is within walking distance, but I wouldn't recommend for mobility challenged folks (about a 20-30min walk).", "title": "Nice hotel, but be aware not the 4-5stars as rated", "user": "Bknsf", "date": "August 14, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 3.0, "location": 2.0}, "id": 172293002}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "If we visit Seattle again, we'll probably stay somewhere else.", "title": "Very Happy, Wonderful Staff", "helpfulness": 1, "user": "Stephanie M", "date": "August 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 172118558}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "We had an AMAZING stay at this hotel. The historic building was lovely, the rooms were perfectly clean and VERY comfortable (if a bit small and oddly shaped), but the best part of the trip was the staff. From dining recommendations to suggestions of things to do, they were always friendly, helpful, and did so much to enhance our stay. Mark, Collin, and Trapp stood out as the stars of the establishment and we really enjoyed the personalized service and friendly attitudes. Yes, there are a lot of homeless people in the area, but we never felt threatened or anything, and the location was wonderful - just a few minutes to walk to the Waterfront, the trolley tour, and lots of good dining (and a fun little dive bar offering all kinds of local craft beers right next door.) Thanks for an awesome vacation...we will be back!", "title": "Boutique-Style Hotel in Historic District", "user": "Susan B", "date": "August 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 172155885}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "The Best Western is located in the Seattle District called Pioneer Square. This is a great neighborhood for restaurants and shops, is walking distance from the Pike Place Market, International District, waterfront and the NFL and MLB stadiums. The rooms are not large but very good use has been made of the space and the decor is charming. The \"continental\" breakfast is much more generous in its selections than the name suggests, and there are both healthy and fun options. We really didn't have much interaction with the staff, but that was because we had no issues or problems. We would definitely stay there again.", "title": "Very Satisfied", "user": "Andrea P", "date": "August 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 171805066}, {"rating": 2.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "My travel agent booked my grand daughter and I into this hotel. I had asked for a location in the historic district. I was more than pleased. The location was in walking distance of the waterfront and easily accessible. Every member of the staff was extremely helpful, courteous, pleasant and eager to please. I felt it was totally safe to allow my 16 year old companion to be in the lobby alone. The continental breakfast was more than adequate.", "title": "Good for location only", "helpfulness": 1, "user": "Brenda C", "date": "August 10, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 4.0, "rooms": 2.0, "location": 5.0}, "id": 171684334}, {"rating": 1.0, "stay_parameters": "Stayed June 2007, traveled on business", "text": "My first time to the west coast and I had to pick this property? Very average all the way the way! the noise level at night from my neighbors was way too loud. The service was slow and the room had a funny smell. The staff made me feel like an unwelcome visitor not a special guest. No wifi service although they advertise there is?", "title": "Very Disapointed", "helpfulness": 1, "user": "Teresa_Bennet", "date": "July 2, 2008", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 2.0, "location": 1.0, "rooms": 1.0}, "id": 17461917, "likes": {"liked": "— The location", "disliked": "— The Staff and Service were almost rude!"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled with family", "text": "This not a good Best Western - To bad Seatle is very nice.", "title": "Perfect Location, Great Hotel", "helpfulness": 2, "user": "jltpeke", "date": "June 16, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 16974884, "likes": {"liked": "— location and price, plus cleanliness of hotel", "disliked": "— rooms were a bit small for more than 2 people"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "AB", "title": "Great Hotel", "helpfulness": 2, "user": "over1861", "date": "May 16, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 16088519, "likes": {"liked": "— Rooms", "disliked": "— None"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled with friends", "text": "We stayed at the Best Western Pioneer Square for 2 nights prior to our Alaskan cruise. This was a family reunion of sorts, and the hotel was wonderful in working with us to get 6 rooms with the set up needed for each family and all together on one floor of the hotel. Hotel staff VERY nice to work with.", "title": "Great Location", "helpfulness": 2, "user": "pamnfam", "date": "March 29, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 2.0, "location": 5.0}, "id": 14633401, "likes": {"liked": "— location to waterfront", "disliked": "— noisey children in small spaces"}}, {"rating": 5.0, "title": "This is definitely not a \"Skid Row\" hotel!!!", "text": "This is a perfect location for walking around downtown Seattle and the waterfront. Very easy walking to Pike Street Market, the waterfront, etc. Hotel very kindly arranged taxi van service for all of us on the morning we needed to get to the pier with all of our luggage.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "March 9, 2008", "id": 14151478}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "The hotel was perfect for our trip to Seattle. We took the light rail from the airport and walked 2 blocks to the hotel. Although we were quite early, the staff checked us in right away and offered us coffee. The staff made our stay especially nice, as they were consistently friendly, helpful, and informative. We were able to walk everywhere.. from Pikes Market, to the Space Needle, EMP Museum, Chihuly Garden, waterfront... Breakfast was fine... good beds... good bathroom. Overall, a great stay!", "title": "Great Stay in Seattle!", "user": "TeachinCa", "date": "August 22, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 173432694}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "I had called ahead about early check in and mentioned that we were celebrating our anniversary. A bottle of champagne was delivered to our room along with two flutes. The building was built in 1914 and has been very nicely maintained. It was located closed to lots of things - just a few blocks from Pike Place Market and about the same distance from the King Street Train Station.", "title": "Very good", "user": "welshcobdrivinggrams", "date": "August 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 173428938}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "Don't be fooled by the exterior or parts of the neighborhood. This is a great place to stay in the heart of an exciting ever changing city. The room lacked a view but was none the less and interesting urban perspective and the nice accomodations, comfortable bed, effecient bath and good breakfast more than compensated.", "title": "Surprising excellence in Seattle", "user": "Andre L", "date": "August 20, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 173284795}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "The hotel was very comfortable, the staff was friendly and accommodating and the location was great. The hotel was within walking distance of everything we wanted to see: Pike's Market, the Aquarium, the Art Museum, the Ferry, both stadiums, the Underground Tour and more. Great historic hotel, wonderful service.", "title": "Great staff", "user": "Lizz P", "date": "August 18, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 172759054}, {"rating": 4.0, "title": "great location", "text": "Located very near waterfront and therefore close to many attractions. We walked everywhere. The room was clean and comfortable. Had free Wireless in room which was very convenient. Good value for the money.", "user": "A TripAdvisor user", "date": "August 18, 2013", "id": 172912814}, {"rating": 5.0, "title": "A Very Pleasant Surprise", "text": "This hotel is located in a very old section of Seattle that has a great deal of history, but also a reputation for having a lot of homeless and not being the cleanest neighborhood. The front of the hotel sort of blends in with the surrounding old brick fronts on both sides of the street. However, once inside, I found a remarkably clean, well appointed lobby with a very helpful, knowledgeable staff. The building itself is nearly 100 years old and previously served as a simple rooming house for loggers, sailors, and others working on or near the waterfront.... The efforts that went in to refurbishing this hotel are wonderful. The woodwork alone is remarkable and gives a look and feel of old yet elegant. The rooms were a little on the small side, owing to the original design of the structure, but very comfortable and clean. This hotel is a short walk to the waterfront and all of the shops and activities there, as well as being just steps from Pioneer Square with some great little restaurants, bars and shops. A pleasant stay and would definitely stay there again.", "user": "A TripAdvisor user", "date": "August 17, 2013", "id": 172752644}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled solo", "text": "This lovely old hotel has a lot of history and is part of this historical part of Seattle. It is within walking distance of most of the more popular sites in Seattle and an easy bus ride to Seattle Center and shopping. The restaurants in the area are not as busy at the drinking spots, but the ones I tried were excellent.", "title": "Pioneer Square at its best.", "user": "Patrick H", "date": "August 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 172752621}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "The hotel staff were very helpful and accommodating as we arrived early. The room was very clean and comfortable. The price was very reasonable for the position of the hotel near the markets, sporting stadiums and centre of the city. The breakfast was very nice and there was plenty of variety.", "title": "Very comfortable stay", "user": "SallyJane62", "date": "August 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 172618028}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled on business", "text": "Lots to love about this hotel. It's been wonderfully renovated in the original style, it's historical and centrally located in the historical district of Seattle. It's so central and the metro is a block and a half away, we didn't need to mess with a car rental and did great. The staff are very friendly and helpful.", "title": "Need to be a small person to stay in our room", "user": "Conda D", "date": "August 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 172575266}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "Only one major caveat: it is an old, now gorgeous, hotel. The room we stayed in was tiny. The bed was, at best, a small double, maybe even a full. Everything was very clean and the room was well laid out to maximize the space, but if we hadn't been small people (I'm 5'2\" and my partner 5'6\" and we're both skinny) the bed would have been, um, crowded. I have several friends whose feet would hang off the end, mine almost did!", "title": "Following the Brewers", "user": "Sandra H", "date": "August 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 172299394}, {"rating": 2.0, "stay_parameters": "Stayed January 2008", "text": "Great location, though as already mentioned, pioneer square attracts some dodgy looking characters, although I must say they never intimidated us. A gentle 'sorry, can't help' to any beggars was enough. Our first room smelt fusty and unclean, the second room smelt like a brewery! Needless to say we had the windows open constantly. Bed lumpy and uncomfortable. Bathroom nice and clean but small. Staff friendly and helpful. Good complimentary, continental breakfast. Quaint with lots of character, but not the best Best Western i've stayed in.", "title": "A bitter sweet experience!", "helpfulness": 4, "user": "UKAdventureGirl", "date": "January 7, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 2.0, "location": 3.0, "rooms": 2.0}, "id": 12417966}, {"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled on business", "text": "One of the more affordable and better hotels in the city of seattle. I had a great time during my stay because of great service and friendly employees. The location is convenient and parking is cheap. I give this hotel an A+", "title": "Its the best of the best for a reason", "helpfulness": 5, "user": "yondaime1845", "date": "January 2, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 12277141, "likes": {"liked": "— The Friendly hotel Staff", "disliked": "— The elevator"}}, {"rating": 4.0, "title": "Great hotel, wonderful experience", "text": "Spent 4 wonderful nights in Seattle. Caught a Seahawks game, and did some sightseeing. The hotel staff was professional. The free continental breakfast was nice, and the room was comfortable for a family of four. The only flaw I found. Our high speed internet connection did not work in the room. But, they have a computer in the conference room downstairs for guests so not a big issue. The area in Pioneer Square was nice and to all of the shops we hit on 1st Ave. Despite some older reviews concerning the homeless people we never encountered any aggressive homeless person nor did we ever feel threatened. The restaurant next to the hotel (Julies Garden) was good with big portions. But, our spot was the Pho restaurant across the street from the hotel. We cant wait to come back to Seattle for another Seahawk/Mariner game. We will definitely stay at the Best Western Pioneer Square. John Phillips", "helpfulness": 6, "user": "Johnphil29", "date": "December 17, 2007", "id": 11630625}, {"rating": 2.0, "stay_parameters": "Stayed August 2007, traveled on business", "text": "The hotel is not terrible in itself, but the looming and noisy I-5 viaduct is nearby. Also, the King Co. courthouse is not far, and there are a lot of people who hang out around there and around this whole area who are not the greatest. There are some nice tourist destinations near this hotel, but you're much better off staying nearer the convention center and only visiting the Pioneer Square area in daylight if there are specific things there you want to see. Near the convention center puts you closer to other places in the downtown area like the Pike St. Market.", "title": "Ok hotel in a bad location", "helpfulness": 4, "user": "Quantum1", "date": "December 8, 2007", "detail_rating": {"front_desk": 2.0, "business": 2.0, "service": 2.0, "cleanliness": 3.0, "value": 2.0, "location": 1.0, "rooms": 2.0}, "id": 11326617, "likes": {"liked": "— price was not bad", "disliked": "— location"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "My husband and I stayed 2 nights at this small, and historic hotel before our South Pacific cruise. Every thing was fine for us, excellent quality-price:", "title": "Excellent location to visit Seattle", "helpfulness": 8, "user": "MoniqueMontreal", "date": "November 8, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 10697853, "likes": {"liked": "— Location, free wireless Internet in the room, and the price", "disliked": "— Small hotel"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled with friends", "text": "The cozy lobby and room character gave me the impression of a boutique although I wouldn't normally associate that with a chain such as this. Nonetheless, the room was nicely furnished and pleasant. The breakfast was unremarkable, but adequate. Lobby staff was helpful and efficient.", "title": "Boutique hotel", "helpfulness": 1, "user": "J E", "date": "August 8, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 171352061}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "We were on the third floor facing the elevated causeway. It is noisy. But the windows are good and it was not a problem. The highway is being replaced with a tunnel, and when that is complete, this hotel will be more desireable. We would have appreciated an outdoor patio for happy hour, but they have nothing of that sort", "title": "Fantastic service, good location", "user": "patk353", "date": "August 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 171323960}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "The staff was extremely helpful. They arranged for our transportation to the airport (at 5 am), answered all our questions patiently, and offered helpful suggestions. Unlike some of the reviewers, we did not experience any problems with noise. The hotel is centrally located, and we could walk to major attractions. I thought it was a very good deal.", "title": "Great staff and service", "helpfulness": 1, "user": "Paul154992", "date": "August 7, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 171229073}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "In Seattle for five days to catch a Mariners home series against the Red Sox in July 2013. Would definitely recommend this place. Staff are helpful and knowledgeable, the breakfast buffet was tasty and well staffed, it's in a great location, and the rooms and common areas were clean.", "title": "A pleasant stay", "user": "mkrause3", "date": "August 6, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 171135238}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "The rooms are small, but they are clean and the beds are comfortable.", "title": "Great quality in a quaint hotel", "user": "obiwan69", "date": "August 6, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 171135512}], "location": {"country": "United States", "city": "Seattle"}, "stars": 3.5, "variance": {"poor": 25, "average": 46, "very good": 233, "terrible": 14, "excellent": 319}, "aka": "Best Western Seattle", "slim_ranking": 0.268817204301, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.0, "location": 4.5}}