{"user_rating": 4.5, "review_count": 402, "name": "BEST WESTERN PLUS Hotel Das Tigra", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "This hotel has been adviced by my friend who live in Vienna. We spent 4 nights in this hotel , the 4th was offered via our travel operator so the price/quality were excellent.", "title": "Spacious , confortable and well located in the centre", "user": "cecilou70", "date": "June 23, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 68399449}, {"rating": 4.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "The building looks not so good outside but our room were spacious and decor were new. Staff is very helpful . location is also very good. I recommend this hotel .", "title": "Nice, good rooms and location.", "user": "Marina021", "date": "June 12, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 67285609}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled on business", "text": "Staff are friendly, room is very spacious for Vienna city centre, good breakfast. Close to shops and restaurants. There is good spot for evening fun and drinks in 5 minutes walking distance. Parking is close but hard to handle. It takes 10-15 minutes every time you need your car...", "title": "So glad we chose this hotel", "user": "Funkyhustlin", "date": "April 29, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 62743760}, {"rating": 4.0, "stay_parameters": "Stayed March 2010, traveled solo", "text": "This was our final hotel stay during our Austrian Adventure and it was fabulous. Best room of the trip...it was gigantic and allowed us to finally sprawl out, which was very much welcomed at the end of the road trip. Great staff, excellent location down a quiet street, wonderful proximity to Stephansplatz and U station. Excellent value for the money. Great breakfast buffet.", "title": "Spacious and ultra-modern", "helpfulness": 1, "user": "glendale-member", "date": "April 11, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 61036481}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "Outstanding ultra-modern room in what at first appears to be a dated hotel. The street entrance, lobby and hallways look worn and third-rate. But my superior double room was among the largest I have seen in Europe. It had a feeling of spaciousness as you walk through its various rooms. There was a large entry foyer, a guest coat closet and a separate walk-in dressing area that contains a clothes bar, shelves and five-drawer built-in bureau. There also was a very large bedroom, a toilet room with frosted glass door and a sink-shower room with a basin-type sink. The bedroom had a flat-panel TV. Going from room to room, it felt like a suite. The decor appears to be newly done in a very modern style with dark woods and modern lamps. The various rooms were lit by halogen ceiling lights throughout. The ones in the dressing area go on by motion detectors.", "title": "Excellent location for Vienna sightseeing, high-class hotel", "user": "Veronika_BH", "date": "February 2, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 54983713}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "Beautiful, central location. Adorable room, nice staff. Good parking (not free of charge). Good breakfast. Everything was excellent.", "title": "Just amazing!", "user": "Zhannuka", "date": "January 31, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 54868105}, {"rating": 4.0, "stay_parameters": "Stayed December 2009, traveled with family", "text": "I would recommend this hotel to others.", "title": "Nice, clean, basic accomodation in the heart of the city", "user": "DCPiacere", "date": "December 29, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 3.0, "rooms": 2.0}, "id": 52062643}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "We spent a long weekend at Das Tigra the week before Christmas as a part of British Airways flight/hotel package. Though the hotel had our booking, at check-in, the receptionist did not seem to have any information about our preferences (early check-in, room type, etc.), nor did she seem to understand that we had pre-paid the room. It is possible this was a communication problem from British Airways, but it is also possible that it was simply inconvenient for the clerk to acknowledge our requests. Nevertheless, we did ultimately receive what we had requested. (If booking indirectly, I might suggest phoning the hotel direclty to check that your booking is acknowledged).", "title": "Excellent Hotel.", "user": "Ducati50", "date": "December 17, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 51404389}, {"rating": 4.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "The hotel is typical Best Western - basic, but scrupulously clean. Besides the desk clerk, there was one other employee in evidence who served as bellboy, snow shoveller, linen changer (we requested extra sheets), and coffee barista in the small (4-seat) bar area off reception. All staff, including the morning breakfast staff, were very pleasant and accomodating. The breakfast buffett was large and varied.", "title": "Perfect location and breakfast that surpasses expectations", "user": "froeken_snork", "date": "December 11, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 51062901}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled with friends", "text": "The rooms are nice-sized. Furnishings are 'modern' but dated. Internet access is free by ethernet cable. Room temperature was possible to regulate and the windows opened to allow fresh air.", "title": "Value for money hotel", "user": "bertha007", "date": "September 24, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 44122395}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled on business", "text": "The title says the main characteristics. The hotel is conveniently located in Vienna centre, but still in a quiet street. It was probably recently renovated, because everything looks new and clean. A double room was large and comfortable. Free Internet is available. Breakfast is lavish with a large assortment of food at buffet table.", "title": "Great location, clean, friendly staff, good breakfast", "user": "SU2", "date": "September 22, 2009", "detail_rating": {"cleanliness": 5.0, "location": 5.0, "value": 5.0, "rooms": 5.0}, "id": 43674838}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "Stayed here for 3 nights (3 nights for the price of 2) . Enjoyed our stay very clean and friendly hotel. The breakfast buffet was great, plenty to eat. Would stay here again.", "title": "Great Location", "user": "Soukass", "date": "September 6, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 39903563}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "Liked the hotel - didn't knock my socks off, but it was clean and comfortable and loaction is central. Rooms were a nice size.", "title": "Good value and nice", "user": "LondonComfortseeker", "date": "September 3, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 39682410}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled with friends", "text": "This hotel exceeded my expectations. The staff was excellent - very kind, extremely helpful.", "title": "Great service, really helpful staff!", "user": "alo6", "date": "July 20, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 35290189}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled with friends", "text": "The hotel is situated on a quiet street. The Hofburg Palace and subway is close. To Stephansdom it's a 10 minute walk.", "title": "Perfect for city visit", "user": "WestMidlandsDreamer", "date": "June 10, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 32031357}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "The Tigra would seem a great choice for mid-budget travellers in Vienna, a very expensive city. The location is great-- just off the Herrengasse, maybe 5-10 minutes from the Graben, which is always hopping and filled with interesting things to do. It's also within walking dfistance of the Hofburg and all the chief sights in the old city. The street on which it's located (Tiefer Graben) is not the best, hardly glamorous or scenic, but it's so close to the main drag, that if you avoid staying out too, too late, you should be fine. The rooms are compact but just fine; nicely decorated, very clean, with air conditioning and cable television and every convenience you could want. The front desk staff is very helpful and efficienct, if not effusive in their friendliness. We found the breakfast more than ample as well: a full German affair, with cheese, cold cuts, wonderful dark bread & rolls, etc-- and scrambled eggs and bacon for international visitors! The coffee, alas, was pretty bad--ironic, given that Vienna prides itserlf on its coffee shops! But that was small enough challenge to put up with during what was a very pleasant (and reasonably priced) four night stay. i had only one complaint: there is a small business center, where one has free access to a wireless laptop. But there is no printer-- which makes it impossible to print boarding passes, etc. If they could buy a cheap printer and fix that problem, they'd be on the road to excellence!", "title": "A Real Vienna Bargain", "user": "revjeff", "date": "August 17, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 75661469}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "I can't speak highly enough of this hotel.It's bright, very clean, well furnished and in a wonderful location in the city . The staff were polite, pleasant and very helpful to us from the minute we arrived.We requested the tea and coffee making facility for our room and it was brought up straight away. The breakfast was more than adequate, with selections of meat, cheese, fruit, yogurt, juices, eggs and cakes.The lift was pretty efficient as well!!!", "title": "Hidden Gem in the Herrengasse Area of Vienna - an absolute must !", "helpfulness": 1, "user": "NUIOrla", "date": "August 16, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 75507845}, {"rating": 2.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "We encountered a porter who brought our luggage to the room on arrival and as described by the couple above, felt he lingered for a while, looking for a tip, but left again without any verbal aggression.We also used the downstairs toilets on departure from the hotel (spotless, I may add) but never had the experiences described by the couple above. There is a bar/club across the road and if we were to stay again, we would probably request a room to the back of the hotel, as it can get a little noisy on the street at the weekend.But on the whole, it's mild in comparison to other countries and not something to worry about !!! There is a very well stocked BILLA ( supermarket) located on a corner nearby, left of the hotel to the end of the street, then right! We also booked a Mozart evening through the hotel with the Tour Company Cityrama, it was very good value ( pick up,concert ticket,dinner, free CD) when compared with the ticket offerings of the Mozart touts on the streets!!!!Overall, a hidden gem and certainly to be highly recommended.", "title": "bad experience never again bullied and harrassed by porter", "helpfulness": 4, "user": "mitzi123466789", "date": "August 5, 2010", "detail_rating": {"service": 1.0, "cleanliness": 2.0, "value": 2.0, "sleep": 2.0, "rooms": 2.0, "location": 2.0}, "id": 73854491}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "We arrived at the hotel on 3/08/2010 around 3 PM where we had a quick check in and told that our luggage would be taken to our room by a man. Even that I told him that I will take my case alone he took it from my hand. As he arrived at my room I wanted to take my case but he pushed himself in with my case. I told him 'Thank you' but he just was not moving asking me in German if I am OK", "title": "Super location, super value for money", "user": "awolkiwis", "date": "August 2, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 73426790}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "I told him that I am but he held his palm open to me to me to ask me for money. As I did not have coins as I just came by taxi from the airport I opened the door to him and her left cursing me in a foreign language as he did not have the German Austrian accent. This was my first incident with this horrible man.", "title": "Great hotel", "user": "rmmlopes", "date": "July 10, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 70370834}], "location": {"country": "Austria", "continent": "Europe"}, "stars": 4, "variance": {"poor": 9, "average": 28, "very good": 163, "terrible": 2, "excellent": 200}, "aka": "Best Western Das Tigra", "slim_ranking": 0.114441416894}