{"user_rating": 4.5, "review_count": 649, "name": "BEST WESTERN PLUS Beach Resort", "reviews": [{"rating": 5.0, "title": "Perfect", "text": "Had a great time at this resort.", "user": "stevebrass", "date": "May 1, 2010", "id": 62939659}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "The location is perfect - right on the beach, and the sunsets!", "title": "It lived up to its rave reviews", "user": "luvchatham", "date": "April 29, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 62763443}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "Handily placed for Times Square and a little further afield Sanibel/Captiva. There is a 7/11 within walking distance, and a publix 10 minutes by car.", "title": "Loved our Stay at the Best Western!", "user": "Bunnyrabbit115", "date": "April 29, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 62752781}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "There is a handy trolley service that links to local buses - $3 a day unlimited use.", "title": "Wonderful stay", "user": "whispering21", "date": "April 29, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 62709895}, {"rating": 5.0, "title": "it really is the \"Best\" Western!", "text": "The breakfast in good; there is something about making your own waffles.", "user": "A TripAdvisor user", "date": "April 26, 2010", "id": 62501540}, {"rating": 4.0, "title": "A great hotel", "text": "Third time here and another good stay. The location is truly excellent - the best on the beach as far as I can see. Only negative is that we had requested 3 rooms on the fifth floor (agreed with the owner 9 months ago). On arrival 2 of the rooms were on the fourth floor. Being a family we wished to stay on the one floor. The response from reception was four words \"rooms are request only\". I would have thought 9 months was enough notice to sort things for us.", "user": "stevebrass", "date": "May 4, 2013", "id": 159625487}, {"rating": 5.0, "stay_parameters": "Stayed May 2013", "text": "What à gem this is..... From the moment of checking in until checking out, it is all just right.... Rooms are right space with comfy beds , nice balcony overlooking the beautiful beach and swimming pool ... What a location ... Further more a newspaper at your doorstep in the morning and a very good breakfast in the morning... Free tea and coffee during the day... I don't know why I put this all on tripadvisor because I should keep this hidden gem to myself, but it is good to share ...", "title": "Wow!!!", "helpfulness": 1, "user": "all4dutchy", "date": "May 1, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 159396546}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with friends", "text": "It wasn't a fluke. This place was as great as when I reviewed it this time last year. Still clean, comfortable, friendly, nice breakfast, great beach access and clean pool. Clean is still the word here. You hardly know so many people are in and out with sandy wet feet all day long.", "title": "Hey guys, back again!", "helpfulness": 3, "user": "WM-Roadrunner", "date": "April 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 158985488}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "Location is also perfect. So close to everything, but enough distance from the noise.", "title": "Wonderful Holiday!", "helpfulness": 4, "user": "mrshoule", "date": "April 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 158874381}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "Stayed here over the Easter weekend, and it was beautiful. We were suprised by the full kitchen (small stove, sink, full sized refridge, microwave, cups, bowls, plates, and silverware....). The breakfast was good, and all of the hotel staff were excellent. We did not know how busy the public beach got, so it was great to have all of the hotels beach frontage to just the hotels guests. Holiday Water Sports operates with the hotel, and they are more than excellent at providing anything you could want at the beach( The staff are the best at what they do!!). The location is close to the pier, times square, and numerous stores. Also there is a outdoor grill available to guests. Would stay again in a heatbeat!!", "title": "Not going to get much better!!!", "helpfulness": 1, "user": "Sandy E", "date": "April 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127615860}, {"rating": 5.0, "stay_parameters": "Stayed March 2012", "text": "We were looking to stay at the beach, problem was we had our dog. I found this Best Western ocean front on Estero. What a beautiful place. The rooms were great, full view of the ocean..with no screens. I prefer that. Granite kitchen fully stocked,just bring the food,very nice room. They also had breakfast items in the morning. Great pool and yard. Our dog Bella loved the beach. Think we found a winner,only con a little high, but it was Spring break.", "title": "Small dogs allowed at this Beach front hotel.", "helpfulness": 5, "user": "Janelle W", "date": "April 4, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 127235268}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "We just finished a 6 day stay here and it was wonderful! The grounds were well groomed and attractive with lots of seating area for those of us who always want to be outside enjoying the wonderful weather. The rooms were clean and well equipped with refrigerator, stove, microwave as well as plates, knives, etc. Had a beautiful private beach and we were so close to the ocean that at night we would leave our patio door open to hear the sound of the waves. It was on a quiet side of the island but a mere 5 minutes away in walking distance were restaurants, bars and activities. We will definitely be coming back again!", "title": "Great place to stay!!!", "helpfulness": 2, "user": "swopie", "date": "March 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 126995480}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "I have always researched on Tripadvisor before vacations, spring break 2012 was no exception. The only thing we knew is that we wanted to visit someplace different in FL close to Sanibel. We have vacationed on Sanibel for many years and were ready for a change. I found the Best Western and the reviews were pretty good so we chose them for our mother daughter get away.", "title": "Excellent Spring Break Stay!!!", "helpfulness": 2, "user": "Karri K", "date": "March 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 126610567}, {"rating": 3.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "Upon our arrival to Fort Myers Beach, I could not have been happier! Our flight came in early so we were actually able to check in early which was wonderful because that gave us extra time on the beach. All of the staff were friendly and one of them had the resident Macall on his shoulder most of the time. We had a single room with two double beds which had a pretty good sized kitchen. The room was a bit small but it was ok for two people, my daughter and I. Besides, we were never there except to sleep. The great thing is that the Best Western has several different room styles for your family.", "title": "Best Western", "helpfulness": 1, "user": "ryleejewel", "date": "March 24, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 1.0, "sleep": 4.0, "rooms": 2.0, "location": 5.0}, "id": 126606361}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "The hotel is nice but the location is the best part. Nice, wide, white sand beach with a few shells even. The breakfast is really super. Hot sandwiches, fruit, donuts, cereal, yogurt, etc. We enjoyed eating outside at the provided tables. We also had a bbq one night on the beach. You just have to tell the front desk staff when you would like to eat and they will turn the bbq on. It was very clean. The rooms have dishes and utensils. The price was a little steep, but we realize you are playing for the great location - just a few miles from Sanibel Island.", "title": "Absolutely beautiful location", "helpfulness": 2, "user": "ripley5531", "date": "April 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 156997488}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "My wife and I thoroughly enjoyed the Best Western on Ft.Myers. The suite had an amazing view and amenities that made our stay extremely comfortable and enjoyable. We brought food with us for our long and arduous road trip. We had packed so much that we heartily filled our full size fridge. What a pleasant experience it was to forage off of these groceries during breaks from the ultimate beach. This was my first time in Ft. Myers and we spent most of our days on the beach soaking up sun and ocean. We brought our own lounge chairs for the beach use and rented an umbrella from the neighboring beach activities rental company. This company also provided chairs and umbrellas for 20 bucks. 10 just for the umbrella. This money is well spent and I didn't find it to be too much of a monetary hassle. We were spending 6 to 7 hours on the beach each day. The hotel staff kept the beach and surrounding grounds in impeccable shape. This applies to the hotel as well. Not one single corner or edge had a crack or any dirt. I would like to personally thank Herminia for her dedication to keeping our room in order. She was prompt, courteous, and so very thorough. The pool was a bit crowded with children, but what can you expect from spring break week. However this may be, it did not alter our plans to take a dip or two. We found poolside lounge chairs available when needed. The ocean took precedence for us, and you may find the same experience once you realize how refreshing and delightful it is. As for breakfast, it was perfect for us. A Danish, donut, breakfast sandwich, and fresh coffee delighted us every morning. I did not sample the waffles, but my wife had cereal, fruit and bagels. I would also like to thank the staff who coordinated this for keeping it fresh and in plentiful quantity. The hotel also is within nice walking distance of the pier and surrounding shops and restaurant. Overall I give this hotel and the accompanying experience a 9.8 out of 10. Please take advantage of this hotel because of its fantastic service, beach, location and accommodations.", "title": "Great Spring Break", "helpfulness": 2, "user": "676LK", "date": "April 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 156787568}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "This was a fantastic hotel to stay at. Rooms are spotless the fully stocked kitchenette", "title": "Perfect Stay", "helpfulness": 2, "user": "Kevin L", "date": "March 29, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 156001109}, {"rating": 5.0, "stay_parameters": "Stayed April 2013", "text": "We were lucky enough to stay in the ground level two bedroom suite (room 106) that my young family of four shared with my parents. It was PERFECT access to the pool, the beach, and the laziness of the adirondack chairs in the shaded grassy area. We especially liked having our bathroom so close to the outdoor activities for our young (and old :) ) people. At first glance, the suite seemed under-furnished, but after spending four nights, we realized we didn't need much more than our beds to sleep in. The weather was so nice to be out in the rest of the day. The hotel was within walking distance of the Fort Myers Pier eateries. We loved walking back to the hotel after dinner along the beach. I felt very safe and loved every moment of our stay. Say hi to Coco, the hotel's live-in parrot, for us!", "title": "A hit for our young family", "user": "running_behind", "date": "April 24, 2013", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 158640380}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "When we wrote our review last year we titled it \"not going to get much better\" well, we were wrong! We returned again this April (just a week later than we did last year) and it was everything we enjoyed and more! From the minute we arrived until we left, it exceeded our vacation dreams. When we booked, we requested a room higher than the 2nd floor and WOW...we got a 5th floor corner room. It was no surprise how clean, bright and welcoming it was. We spent a lot of time soaking up the sun with the chairs/umbrella rentals (Holiday Water Sports) that are available. We always felt safe and comfortable on the grounds and walking the beach and town area. If you enjoy relaxing, sunshine, shell laden beaches, ocean breezes, sunsets, and great sleeping.. topped off by a exceptionally clean, accomodating hotel with a friendly staff, put the Best Western Resort Fort Myers at the top of list! Don't forget to look for Coco the parrot!", "title": "We were wrong!", "helpfulness": 2, "user": "Sandy E", "date": "April 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 157867849}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "Great hotel for families or couples. Very clean and recently remodeled. Close walking distance to all the Fort Myers Beach Restaurants, bars etc. The staff helped us out recently when we were not able to secure transportation to an event nearby and went above and beyond to make sure we got to our destination in time. Every room has a beach front private balcony overlooking the white sandy gulf beach. I would Highly recommend this hotel", "title": "Best Western Beach Resort Fort Myers", "helpfulness": 3, "user": "GerryV447", "date": "April 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 157413653}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "This hotel has a fantastic location right on Fort Myers beach, about a half a mile walk to the pier. It is not inexpensive, and some of the clientele smoked out on the balconies and in the garden area. There was also a noise problem. All of the rooms have amazing beach views and nice amenities. The continental breakfast is very so-so, unless you are a fan of Jimmy Dean microwave breakfast sandwiches.", "title": "Nice but noisy", "helpfulness": 3, "user": "dargano", "date": "March 23, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 155454180}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "This was a great location for a hotel. Not too close to the action of times square. Not too far from the action either. I was amazed at how quiet the rooms were, When our doors were closed we heard nothing outside but we slept with our balcony door open so we could hear the waves gently lapping the beach. The amenities were plentiful. The breakfast was more than adequate. The only thing I didn't care for was the salty pool. I'd definitely stay here again.", "title": "Clean and Quiet", "helpfulness": 2, "user": "Kevin F", "date": "March 21, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 155290479}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "Older hotel but kept very clean. On beach, nice pool great people. Walking distance to Times Square food, fun great sunsets. Trolley to State Parks running all day. Don't know what else to say it was perfect.", "title": "Sun Fun and Views", "helpfulness": 1, "user": "Eric M", "date": "March 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 155100044}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with friends", "text": "We got home yesterday from a week stay at the Best Western Plus. Not only was our entire vacation great, Best Western Plus was amazing! The rooms were perfect, customer service was excellent and the views to the beach were breathtaking. Staying here gives you great access to not only the beach, but its also within walking to distance to restaurants, shops and nightlife. We had to check out at 5 am, and the staff had a breakfast bag made up for each of us. Overall we would highly recommend staying at this hotel! We will be staying here again next year on our annual trip to Fort Myers.", "title": "Simply the Best", "helpfulness": 2, "user": "Michael L", "date": "March 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 154846674}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "Loved the Parrot in the Lobby! Great tropical decor throughout. The room we had on the 4th floor had a great view of the Gulf, beach and pool. It was lovely. The pool was great, heated with plenty of lounge chairs, Breakfast was well done, clean and did not lack for anything. The staff was great. We needed some help with the stove and within minutes someone was at our door to help us. The front desk was helpful giving us great information regarding local fare.I wish they had a fitness center however, you can't have everything. I would definitely come back!!!!", "title": "beautiful hotel, great view, accommodating staff!!!", "user": "stan-roe", "date": "March 11, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 58339875}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "After staying at several hotels on Fort Myers Beach, we stayed at the Best Western. We are rarely imppressed upon walking into a hotel room, but these rooms are beautiful. The rooms overlook the beach, they are spacious and everything you could possibly need is provided. The prices are reasonable, the location is quiet and within walking distance of all of the shops and restaurants. We never moved our car. Can't wait to stay there again. I've been telling all of our friends:-)", "title": "Wonderful Hotel...you have to try it!", "helpfulness": 1, "user": "Chewers", "date": "March 6, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 57880032}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled with family", "text": "I can't say enough good things about this hotel. My husband, who is more of a Marriott resort kind of guy, was a little skeptical when I made this reservation because of a previous bad experience at a Best Western in Maine. In fact, our original reservation was at a big resort on Marco Island. But what we really wanted was a laid back vacation on the beach and within walking distance to shops and restaurants. The Best Western Beach Resort on Fort Myers Beach filled all those requirements. Our room was clean and spacious with a good sized balcony overlooking the beach. We left the sliding doors open at night and fell asleep and woke up to the sound of the surf. This hotel is on the quiet end of the beach, yet still a very short walk to Times Square and all of the hustle and bustle. We drove a short distance to the Publix market and stocked up on drinks and groceries in order to make full use of the room's kitchen. I was especially pleased with the full size refrigerator. Whenever we encountered staff, they were friendly and helpful. We took numerous walks on the beach and always came to the same conclusion- we were staying at the best hotel on the beach. The only thing that could be better, as another reviewer mentioned, would be the availabilty of recycling and perhaps something more enviromentally friendly than styrofoam plates. I felt a little guilty everyday when I threw out my free newspaper and ate my very nice, included in the price, breakfast. We are already planning a return trip to the Best Western Beach Resort.", "title": "Best Hotel on Fort Myers Beach", "helpfulness": 1, "user": "ADLG", "date": "March 4, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 57723220}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "Loved this place. Hotel is right on the beach. It's a short walk south to the fishing pier, bars, dining, shops, etc. If you walk north there is a nature preserve.", "title": "Great Hotel.....great location", "helpfulness": 3, "user": "Phylo82", "date": "February 25, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 57125304}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "Clean rooms, excellent service. Free breakfast buffet with awesome waffles.", "title": "Serenity and Comfort with hot spots all around", "helpfulness": 2, "user": "Neenahite", "date": "February 24, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 56991422}, {"rating": 3.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "The room was too small. OK, it did face the Gulf, bit you could barely walk around the bed. I have stayed at many Best Westerns, and this is the highest price. Too me, it should have been about half of the amount paid. Breakfast in the morning was ok, but there is only seating for about 14 people. Really too small. But if you want to walk out to the back door to the beach, this is your hotel.", "title": "Rooms Too Small, Overpriced", "helpfulness": 2, "user": "FloodPro", "date": "March 11, 2012", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 1.0, "sleep": 2.0, "rooms": 2.0, "location": 5.0}, "id": 125963637}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "Large, clean rooms and bathrooms, very nice breakfasts, free Wi-fi, free airport shuttle service, very affordable and a very friendly staff. What more could you ask for? Oh, and a great location....close to the Red Sox's brand new stadium, near the Twins' stadium, close to a great outlet mall for shopping and tons of restaurants! The only criticism we had was that the A/C unit is a bit noisy. All in all, this was one of our better hotel choices!", "title": "A good deal all the way around...", "user": "Pastrychef_10", "date": "March 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 125869952}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled with family", "text": "We stayed at the Best Western Plus in Fort Myers Beach February 21-26, 2012. It was the perfect escape from Michigan winter, though I must say this winter hasn't been so bad! The hotel doesn't look like much from the outside, but the rooms were lovely. We would definitely stay there again, but I would like to share some information that might be helpful. The beach was glorious, and the back of the hotel is just 30 feet from the beach -- and that 30 feet is made up of a lush lawn, palm trees and tropical plants. Very little seaweed on the beach, and lots of shells. The breakfast was terrific, including breakfast sandwiches, bagels, Dunkin Donuts, pastries, fresh fruit, cereal, boiled eggs, yogurt, bagels, etc. More than your average free hotel breakfast. The hotel has a parrot that they put outside during the day -- very cute! The room included a kitchenette but had table seating only for 2. That was a drawback for a family of 4. Also, there was a pool but no hot-tub. Alas. The bathroom was pretty standard, but the ventilation was not good. Finally, there was no screen on the sliding door. We did not have bugs until our last of 5 nights, when we were inundated by tiny bugs that would have gotten through the screen, even if there had been one. These same tiny bugs were on the beach, too, so this had nothing to do with the hotel. Note that this is on a small island with an overpass, and, getting onto the island can take a while if it is \"prime time.\" We went off the island about 10 a.m. on a Wednesday to go to the grocery store, and though we only drove maybe 2 miles, it took a good half hour to get back on the island.", "title": "Just what we needed", "helpfulness": 3, "user": "MichiganMelissa04", "date": "March 8, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 125826263}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "Fantastic location right on the beach. Great room with kitchen, free breakfast and all within walking distance of the \"Times Square\" cafe and shopping area. Have stayed many times and can't wait to get back!", "title": "Great room; great location", "user": "HarryH48", "date": "March 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 125746479}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "Great location. Very Clean. Friendly Staff. Awesome sunset view right on our own balcony. Nicest Best Western I've ever stayed in. Great getaway!!!", "title": "Fantastic", "user": "SuperBowlChamps", "date": "March 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 125660339}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "This is a beautiful spot on the beach, and the staff went so far out of the way to help with a family emergency while staying there it is almost unbelievable! I have never seen this level of customer service, and would recommend this hotel to anyone.", "title": "Best Staff in the World!", "user": "Don J", "date": "March 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 126206734}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "Just got back from Ft Myers beach and i stayed at the Best Western Resort with my family. Amazing location on the ocean and the view from your room balcony is breathtaking. The continental breakfast every morning was delicous and full of variety. Only thing i didnt like was the slow elevators. Other then that minor flaw i will 100% stay at this resort again! I HIGHLY recommend this resort to anyone! Beach is right off the resort and away from spring breakers. Within walking distant of tons of restaurants and shopping! WONDERFUL resort!", "title": "AMAZING RESORT!", "user": "Danielle R", "date": "March 16, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 126186504}, {"rating": 3.0, "stay_parameters": "Stayed March 2012", "text": "My wife and two teen children stayed only one night after getting a ground floor room with ripped furniture, nail polish dried on dining room table, and candy wrappers in chairs. I assume this was worst room and other rooms are nicer based on generally positive reviews. Great location is only positive. The pool is relatively small. It has few resort amenities like restaurant, bar, whirlpool, store, spa and ATM. We have stayed at other Ft Myers Beach places and don't understand the rave reviews particularly in light of steep price. Staff was kind enough to let us cancel remainder of reservation without penalty.", "title": "Not Really a Resort.", "helpfulness": 1, "user": "Mwtray", "date": "March 15, 2012", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 4.0, "service": 3.0, "rooms": 2.0}, "id": 126162756}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "This is the second time we have visited this hotel since it's re-furbishment in the last two years and this time the property was just as crisp and new as the last time. Sited right on the beach you could not wish for a better location. The price is higher end for the resort but worth it as long as they keep it in tip top condition. Service is OK and reasonably friendly. Breakfast buffet is good with plenty of choice and the addition this year of hot breakfast rolls. Free internet and wi-fi is a bonus. Close to the bars and eateries but far enough away to be quiet at night. All rooms face the sea.", "title": "Tip top location", "user": "Roger-marston", "date": "March 13, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 126054341}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "We stayed at this hotel when our children were small and loved it. Recently we stayed again for two nights. The rooms have been remodeled since we stayed there last and while they are more modern and up to date, the space felt alot smaller to us. Still nice to have a kitchenette but with luggage for 3 adults and one child, it felt crowded to us. Love that the ocean is right outside the lobby door and the pool, while not huge, was heated perfectly so you weren't chilled at all in the water. Loved our stay but wish for the price of $266.00 per night, the rooms would have been bigger.", "title": "Repeat Customer", "helpfulness": 1, "user": "c_shelby", "date": "March 12, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 125983246}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "This place had a beautiful view of the ocean, which you could see from the outdoor balcony or through the sliding glass doors that led to it. We left the doors open at night time so that we could hear the ocean. The kitchen was clean and very convenient, with a full size fridge and stovetop. My only complaints were the price and the hotel's committment to \"going green.\" Although the residents on the street recycle, the hotel had no bins for guests to do the same. Also, the hotel supplied only styrofoam for the continental breakfast. Styrofoam was necessary for hot beverages, but not for juice, donuts, etc.", "title": "Room with a View", "user": "pelicanMassachusetts", "date": "February 21, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 56672059}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled with friends", "text": "Right on the beach, all rooms with gulf view, magnificent sunsets! When we entered our 2nd floor room, we were impressed by the fully equipped kitchen, cleanliness, nicely decorated, great bedding and spaceous room! (Soon discovered the extra large room was because we were given a handicapped room). Stepping onto the balcony we discovered we were right over the pool area (no privacy and noise from kids). Asked at front desk about a change, but hotel was fully booked. As the days went on, the kids weren't too bad and we got used to the lack of privacy on the balcony. Well worth it for all the pluses of this hotel. Very good continental breakfast. Fun parrot who lives at hotel.", "title": "Great choice!", "helpfulness": 1, "user": "jazzgal24", "date": "February 10, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 55633841}, {"rating": 4.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "Only thing missing at the hotel for me was a workout room. Tried to make up for it by early morning walks on the beach ~ not bad!!", "title": "Will only go back, Whenever we get a chance", "helpfulness": 1, "user": "Ramsfan14", "date": "February 9, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 55573755}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "Great Location, Well Run, Close to everything on the Southwest coast. Estero Blvd and getting over the causeway can be bothersome, but trust me, it's worth the wait. Great Sunsets from every room. Walk to SOB (Smokin Oyster Bar) and the Beached Whale good food, good people. Sit upstairs at the BW. If you truly want to kick back you can do it here.", "title": "Pleasant surprise!", "helpfulness": 2, "user": "ewatts74", "date": "February 5, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 55285108}, {"rating": 5.0, "title": "They put the \"Best\" in Best Western to good use!!", "text": "We stayed at the Best Western at the end of our 1 1/2 week trip to Florida and we didn't want to leave!! We were skeptical since we weren't familiar with the area but the hotel and town won us over. It is a pet friendly property and pets are allowed on the beach too which was a plus for us since we travel with our pet. The rooms had kitchenettes in them and were newly renovated. We also had a nice balcony too. My husband enjoyed playing shuffleboard and the complimentary breakfast was great also. The property is well maintained and close to town (2/10th of a mile). Internet was also free in the room. The only thing missing was a fitness center. I can't wait to plan a return trip!!", "helpfulness": 2, "user": "A TripAdvisor user", "date": "February 2, 2010", "id": 54980054}, {"rating": 4.0, "stay_parameters": "Stayed April 2010, traveled with family", "text": "Stayed here with my family (10 yr old and 8 yr old). The view was beautiful. Front desk staff was courteous and efficient, and housekeeping was very considerate and friendly.", "title": "Kids want to return next year", "user": "tkas", "date": "April 11, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 2.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 61025561}, {"rating": 4.0, "stay_parameters": "Stayed March 2010, traveled with family", "text": "I was concerned about the pets welcome policy, but we only saw one animal at the hotel - Coco, the hotel pet yellow nape Amazon parrot, whose amusing conversation entertained my children and me on more than one occasion.", "title": "great place, beautiful beach", "user": "vanaba", "date": "April 8, 2010", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 60780437}, {"rating": 3.0, "stay_parameters": "Stayed March 2010, traveled with family", "text": "The beach area was more crowded than I had anticipated, but this might have been due to spring break activity. I highly recommend a trip to the end of the island, where it's more desolate and the wildlife was abundant.", "title": "Nice hotel on the Beach", "user": "dkmr", "date": "April 4, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 60359374}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "Our day trip to Sanibel Island was a bit disappointing. We sat in lots of traffic only to find that there was no parking available at three different locations. After a great lunch at the Island Cow, we had more success parking, and enjoyed a very nice afternoon on the beach.", "title": "Awesome place to stay and play!", "helpfulness": 1, "user": "MILKMAN", "date": "March 24, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 59439426}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled solo", "text": "We enjoyed our dinner at Smokin' Oyster Brewery, but the culinary highlight of the area must be Yabo on MacGregor Blvd in Fort Myers. The experience was worth the ten minute drive away from our beautiful hotel. Ryan and his staff greeted us as if we were old friends, and delighted us with their amazing food. Ryan's mom, Grace, spoke with us at the table for a few minutes to be sure we were happy, and her pride was evident and certainly well deserved.", "title": "Wonderful, safe place to relax and take it the glorious beach!", "helpfulness": 1, "user": "FlanFam", "date": "March 12, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 58369881}, {"rating": 2.0, "stay_parameters": "Stayed August 2009, traveled on business", "text": "What my fiancee and I wanted was a quiet somewhat out of the way place that we could rejuvenate our spirits and still have the opportunity to shop, dine and enjoy the people part of our trip.", "title": "nightmare...", "user": "cream63", "date": "February 1, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 1.0, "sleep": 1.0, "rooms": 2.0, "location": 3.0}, "id": 54960278}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "If you are looking for hotel based restaurants, Tiki bars and a \"HOT\" nightlife experience than don't stay here. If you want to relax, enjoy the beach, sun and friendly staff than this is the place to be. The other stuff is only a short walk or free trolley ride away.", "title": "best free breakfast and beautiful grounds", "helpfulness": 1, "user": "bjlettre", "date": "January 31, 2010", "detail_rating": {"cleanliness": 1.0, "location": 1.0, "service": 1.0, "rooms": 1.0}, "id": 54834778}, {"rating": 4.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "Typically, I would not think of a Best Western when it comes to Beach Resorts, but if all you need is a modern, spacious and super clean hotel suite (with mini kitchen) and a FABULOUS view of the sunset, then this is a great destination. There are no tennis courts, golf course, or spa, but it does offer a good value for a room on a very quiet spot on a beautiful stretch of white sand (north end of Ft. Myers Beach). All rooms overlook the gulf and all have little balconies...perfect for taking in the sunset with a glass of wine. The grounds are immaculately kept and there are plenty of adirondack chairs and thatched huts with benchs for people watching, reading, relaxing. The pool is heated and in January, we found it very pleasant to swim even though the air temp was cool. There is even a shuffleboard court and beach service is available with umbrellas and lounge chairs if you want to sit directly on the beach. The complimentary breatkfast is standard fare but the staff is friendly and helpful. Coco- the resident parrot in the lobby is fun, too.", "title": "If you don't need a full RESORT amenity package, this is a great option.", "helpfulness": 2, "user": "ready2gogirl", "date": "January 25, 2010", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 3.0}, "id": 54349188}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled with family", "text": "You are within walking distance to the Times Square and Pier - which features lots of casual dining choices (affordable, casual, & lively). This area is NOT run down or seedy as some beach retail districts can be. Some street artists provide entertainment without being obtrusive.", "title": "Wonderful vacation experience!", "helpfulness": 2, "user": "nanceray", "date": "January 25, 2010", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 54331995}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "A perfect evening: Call SURF PIE- a great pizzaria that will deliver to your hotel. Dine on the balcony of your hotel room as you watch the sun set on the Gulf and then, before the last light of day fades away, walk down the beach towards the pier and finish the evening with some great ice cream from Wilfen's.....they also have great chocolate candies.", "title": "you wont get better ..trust me", "helpfulness": 1, "user": "agnesmax", "date": "January 21, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 54013200}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled with family", "text": "Fort Myers Beach is an affordable option to the trendier and more expensive Sanibel and Captiva if all you need is a great BEACH and good eats.", "title": "Excellent value and service", "helpfulness": 1, "user": "Racermus", "date": "January 9, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 53039139}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled with family", "text": "The hotel has wonderful accomodations. Decorations are modern and have a rich feel to them. The private balconies were much appreciated. The staff was very friendly and helpful. We really enjoyed Cocco the resident parrot. Dick was so friendly and helpful and graciously let us take a photo of Cocco on his shoulder. The grounds are beautiful! - well maintained and we loved the adirondack chairs. We walked the beach and this resort was the perfect location and had the best landscape. It is walking distance to the town and the boardwalk, where we spent a lot of time. The boardwalk has nice restaurants, local artists, and wonderful icecream. There is a nice lobby area where families played games at night or watched the football games on a nice flatscreen tv. They provide a nice breakfast provided each morning. It impressed me the amount of staff available to help and keep the the resort clean and manicured. Can't wait to return!", "title": "Stop Looking and STAY HERE! The BW Beach Resort is #1!", "user": "PTVBasketball", "date": "January 4, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 52510947}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "Another wonderful 11 nights at this resort. Well maintained and kept constantly clean and tidy. The continental breakfast now features a hot breakfast sandwich, which together with the other items on offer provides an excellent start to the day.", "title": "Perfect Again", "user": "stevebrass", "date": "May 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 129314969}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "The location is excellent - gorgeous beach front location, and handily placed for the amenities of Fort Myers beach.", "title": "Great Place, Great Staff,Great Time", "helpfulness": 1, "user": "daltjb", "date": "May 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 129192686}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "Spent 6 days there in mid April and we could not have found a better place if we tried. Although they do not have a restaurant or bar on premises, they do have outside grill, full room refrigerators, picnic tables, ice is available for coolers and a free b'fast is served every day. That alone saved us hundreds of dollars on eating out and/or paying $6 for cocktail or beer at a local bar.", "title": "Great hotel", "user": "tom k", "date": "April 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 128517793}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "Right in the ocean, romantic views, extra clean and they cleaned constantly and staff was very friendly. All within a 5 minute walk to stores and, restaurants and attractions. Hope to return with whole family and cousins in the future.", "title": "The place to be", "helpfulness": 2, "user": "Birdy66", "date": "April 16, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 128015970}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "Also, only a 25 minute drive from RSW so all in all a huge value.", "title": "Perfect spot in Fort Myers Beach!", "helpfulness": 2, "user": "HappyTrails2go", "date": "April 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127954130}], "location": {"country": "United States"}, "stars": 3.5, "variance": {"poor": 7, "average": 28, "very good": 142, "terrible": 3, "excellent": 469}, "aka": "Best Western Plus Beach Hotel Fort Myers Beach", "slim_ranking": 0.0434782608696, "detail_rating": {"service": 4.5, "cleanliness": 5.0, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 5.0}, "description": "Come discover the BEST WESTERN PLUS Fort Myers Beach Resort Hotel, located in the City of Fort Myers Beach, Florida. Our resort is located directly on a secluded beach at the north end of Estero Island overlooking the Gulf of Mexico where fiery sunsets will leave you spellbound"}