{"user_rating": 3.5, "review_count": 109, "name": "BEST WESTERN PLUS Chicago Hillside", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled with friends", "text": "Normally I don't stay at Best Western properties, but I needed a inexpensive room close to a bar where a concert was taking place. The room was on the smallish side, but was clean and the bed was comfortable. Fairly modern decor, but needs a bit of freshening up (tube TV and outdated bathroom). Close to 290 and several restaurants. They provide a free shuttle within 5 miles of the property. Overall, not bad for a Best Western, but then again, I was just there to get a few hours of sleep.", "title": "Decent hotel property", "user": "Karch72", "date": "November 26, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 146220556}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled with family", "text": "We stayed here to visit friends in Oak Park. It was close to the freeway, had some decent restaurants nearby, and was easy access to downtown Chicago and to the airport. The room was clean, with very comfortable beds. We were four in the room so the bathroom was a little small, but the room had a fridge and a microwave. Also, the staff was very friendly and helpful. I made my original reservation for just 2 people with a king bed, then had to change it when my daughter and her friend decided to join us. It was no problem at all.", "title": "Great value!", "helpfulness": 1, "user": "travelduo623", "date": "November 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 145925062}, {"rating": 3.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "We had booked this hotel because it was close to local attractions (Frank Lloyd Wright House) and also because of the good deal we got online. Staff was friendly and room was clean. We ate in the restaurant for breakfast and it was above average for hotel food. They had a nice buffet though we did not take advantage of it.", "title": "Nice Hotel", "user": "AngieG507", "date": "November 8, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 144919239}, {"rating": 5.0, "stay_parameters": "Stayed October 2012", "text": "Three of us recently stayed at this hotel for two weeks while we attended some classes nearby. The staff was very helpful and friendly, the rooms were clean, and the lounge had great food. I would highly recommend this hotel to anyone.", "title": "Very nice hotel", "user": "Jimedic", "date": "November 4, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 144510411}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "We stayed at this hotel because it was cheaper than staying in downtown Chicago. It is right off the freeway -- and about 15-20 minutes from downtown. We hardly ever saw the staff...but it is evident they are very active!!!! The hotel was extremely clean and well maintained. We had no problems at all. We didn't eat here but did peak into their restaurant....it was very clean and what I would expect in a full service Hilton or Marriott!!!", "title": "A Perfect Hotel", "helpfulness": 1, "user": "pcthikes", "date": "October 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 143356431}, {"rating": 4.0, "title": "Not bad", "text": "The only complaint I had regarding the hotel was the shuttle service. We waited for 1 hour at the train station for a pick up. We finally gave up as the train station wasn't in the BEST neighborhood & it was dark (2 women alone). We ended up getting a taxi back to the hotel. Granted, it wasn't very expensive, but COME ON! I called the hotel 4 times about the shuttle & kept being told they are on their way.", "user": "Bridget C", "date": "July 31, 2012", "id": 135925307}, {"rating": 3.0, "title": "Ok Stay for the price", "text": "OH & when we did take the shuttle to the train station.. the guy driving was listening to Christian radio. NO, don't play ANYTHING... it offended me!", "user": "brillo86", "date": "July 23, 2012", "id": 135209037}, {"rating": 4.0, "title": "\"Loved the pool\"", "text": "Made reservations for cot to be in our room-finally came at 11:40 at night after having to call on it a couple of times, room for the most part was clean, did find some type of pill on the floor and a bottle of aquaphor behind the curtain- but bathroom was clean and so was fridge and microwave that comes in room. I was asked at check out how are stay was and I did tell the manager about what we found in our room and his response was \" Oh we must have missed that\"", "user": "Bridget C", "date": "July 12, 2012", "id": 134187094}, {"rating": 2.0, "title": "Not the place for good sleep before an early flight", "text": "Air condtioning was very loud and did not cool very well. Cot was very comfortable actually. Metal frames around window were old and if you looked under the valance of the curtain it was old there too.", "user": "Robin B", "date": "June 19, 2012", "id": 132327103}, {"rating": 5.0, "title": "Looks can be deceiving", "text": "They do have a restaurant attached to the hotel, breakfast buffet was 10 per person- no coupons or anything off for the restaurant. I guess if I had to stay here again for the price I guess I would but maybe would look into things a little more or pay more next time.", "user": "Shannon D", "date": "June 14, 2012", "id": 131961771}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "This hotel is located right at the interstate and very close to downtown Chicago. The shuttle runs to O'hare every hour and also takes you around the area. The staff was friendly and the entire trip was a great experience.", "title": "Clean, Neat, and Convenient", "user": "booboo-kitty22079", "date": "September 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 140485905}, {"rating": 3.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "This property was very busy during a two-day stay by my wife and me in September 2012, and the impression we had was that the busy-ness we observed was the norm. The facility had the appearance of getting a lot of use. Carpeting was clearly worn in our room, the equipment in the fittness room had not been maintained - one of two treadmills did not function, the elliptical trainer squeeked continuously in use, and for the two mornings we used the equipment, the dispenser of sanitizing wipes was empty and had the appearance of having been so for a while. On the plus side, the beds gave a good night's sleep and the management provided around the clock shuttle service to the CTA train and other locations every half hour as pickup/delivery allowed. The shuttle service plus the reasonable cost balanced the shortcomings of this facility for us and we would consider staying on a return visit to Chicagoland.", "title": "Worn but convenient facility", "user": "GeezersOnTheGo-123", "date": "September 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 2.0, "location": 3.0}, "id": 140370865}, {"rating": 3.0, "stay_parameters": "Stayed November 2011, traveled with friends", "text": "I stayed here with a few other friends. We were looking for something reasonably priced but not too far from downtown Chicago. The location was not too bad. It wasn't off of I 90 or I94, so the traffic was never horrid. The staff were friendly and the room was decent. We had a fridge in our room so that was nice.", "title": "Fast Getaway", "user": "Kobe11", "date": "September 5, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 139504463}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "We went to the bar at the hotel and it wasn't as nice as we'd hoped it to be. There wasn't many drink options and it was quite dead. There was a wedding or reception going on at the hotel when we stayed there, so it was really loud with people coming in and out a lot.", "title": "Outstanding Service - Shuttle Driver Denise", "user": "Andria A", "date": "August 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 138728047}, {"rating": 4.0, "title": "VERY NICE HOTEL", "text": "Overall the hotel was decent for the money.", "user": "Mike M", "date": "August 9, 2012", "id": 136773874}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled on business", "text": "......or let it \"Wonder\". I was here for one night with a Church group. I stayed in the room just inside the fire doors to the right. A HUGE reception was going that nite with several hundred visitors was there. I did not hear one peep from the party. The beds are soft and \"Bug\" free....I always check! The only complaint is the \"Breakfast Buffet\" $9.00 for what I call a \"Adavnce Continital\". ( ..and they expect a \"Tip\") Other Hotels I have stayed at, this is...free. I was given a $.50 discount for representing the group....(By the way...NO GROUP discount for large groups for breakfast) The food was good. This morning was a \"FISH SWAP MEET\" ....DO NOT STAY HERE DURING THIS TIME!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! Dont know what it is...but hotel staff cater to these folks once a month. They charge \"Admission\" to \"Swap\" their \"Fish\" and ignore their hotel guest. I slept good but, breakfast and the Fish Swap was too much!! If you call ahead to reserve a room, find out if the \"Fish Swap\" is going on, ...and stay somewhere else. (Brought my concern to the management about the hotel guests being ignored, and he said \"It's only once a month\")", "title": "Let your mind wander.....", "user": "Greydog98", "date": "October 20, 2012", "detail_rating": {"service": 2.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 143279858}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with friends", "text": "Very easy check-in, rooms are clean and the bed was very comfortable. The bar was sparsely populated, but I enjoyed the $3.50 Shocktop draft! Free airport shuttle runs on the hour. I only chose this because my daughter had already booked a room for herself here. Admittedly, I was a little hesitant, as I haven't stayed at a Best Western recently, but it was great. The breakfast buffet is $9.95 and was just what I needed after two days at the Ryder Cup. I would stay here again.", "title": "Clean, comfy and free airport shuttle.", "user": "MimiK1964", "date": "September 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 141660932}, {"rating": 1.0, "stay_parameters": "Stayed September 2012, traveled on business", "text": "This hotel has been by far the worst place I have ever stayed! for one I'm a well traveled individual who is in the hospitality and food service industry and understands that it will not always be perfect however, the customer service is horrible from the begining! to the end! starting by my check in , the agents were nothing but rude and unwelcoming, when I walked in the bellman/ driver would not even offer to help with my luggage but just sat there like a homeless person. lets not mentioned the restaurant servers absolutely ignored me and my guest and we sat there for @ 20 minutes to be served. the shuttle drivers were rude and took them @45 to 1hr. to pick us up and not to mentioned liers since they claimed they picked me up at a location and claimed I was not there!!false!! , I also asked them to take me to Giordanos and he dropped me off at Home Run Inn only because he felt like it!and \"it was the same thing\" the drivers are Jimmy and James (worst), the front desk manager was the most useless human being of them all who was rude and careless about his guests requests. Beware of the housekeeping staff or other departments since money was stolen from my room!", "title": "Worst of the Worst!!! do not stay here", "helpfulness": 3, "user": "alex V", "date": "September 25, 2012", "detail_rating": {"service": 1.0, "cleanliness": 2.0, "value": 1.0, "sleep": 2.0, "rooms": 3.0, "location": 2.0}, "id": 141256845}, {"rating": 4.0, "stay_parameters": "Stayed September 2012", "text": "Good value, location near interstate, very good $9 breakfast. Evening smorgasbord well prepared chicken, catfish, whitefish, beef, side dishes and several desserts $14.15 - good value. Very well maintained & clean. Frig & microwave. CRT TV good; however, less picture quality versus flat screen.", "title": "Comfortable Bed - clean - near busy interstate - good windows dampen sound. would stay again", "helpfulness": 1, "user": "aestimare", "date": "September 21, 2012", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 140886226}, {"rating": 1.0, "stay_parameters": "Stayed September 2012, traveled on business", "text": "I stayed at this hotel because it was one of the only available at the time. I usually like Best Western hotels but this one is an exception. The first problem was when I arrived at the hotel and had to wait about 40 minutes for the shuttle. Then later in the evening, I was left standing at the airport again for two and a half hours after being told that the shuttle would be there in 25 minutes. The staff at the hotel was officious and not very friendly. When I got to the room, it was clean but quite noisy from the highway next to the hotel.", "title": "Noisy, Late Shuttle, Rude", "helpfulness": 2, "user": "Kondan", "date": "September 19, 2012", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 1.0, "sleep": 1.0, "rooms": 2.0, "location": 2.0}, "id": 140685171}], "location": {"country": "United States", "city": "Hillside"}, "stars": 3, "variance": {"poor": 9, "average": 25, "very good": 40, "terrible": 9, "excellent": 26}, "aka": "Best Western Plus Chicago Hillside Hotel Hillside", "slim_ranking": 0.666666666667}