{"user_rating": 4.5, "review_count": 874, "name": "BEST WESTERN Hotel Olimpia", "reviews": [{"rating": 1.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "We haven't stayed at this hotel, our booking did not get that far.", "title": "Poor Customer Service", "user": "poet123", "date": "May 1, 2013", "detail_rating": {"service": 1.0}, "id": 159371005}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "I wanted two nights pre/post cruise so dates which were separated by 2 weeks. I looked on their website and could not get the search facility to work, and also I knew that using it (assuming it ever does work) would mean I would have to make two separate bookings due to the nature of the requests.", "title": "convenient location and beware of pickpocket in the supermarket", "user": "esigui", "date": "April 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 159008152}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "So, I emailed them directly, explaining the situation, after a time I got a terse message back directing me to use the website booking facility. I emailed back to explain the situation, eventually the quote came back the pre cruise price was double the post cruise price.", "title": "Good stay and friendly support in Hotel Olimpia", "helpfulness": 1, "user": "Martin H", "date": "April 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 158698214}, {"rating": 3.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "We decided to book just the post cruise date, I emailed back and made the reservation. In that email I asked for confirmation of the room type (I had asked earlier but it had been ignored) Back came an email stating Double Classic, as there were 3 of us I decided to check that it would accommodate the three of us as per the original request. Thank goodness I did, they came back saying that an extra bed would be an additional 50E, as it had been clear in my original email that I had requested a triple room I naturally assumed that the quote reflected that. I emailed the hotel again, and they came back to me apologizing for the mistake but sticking to their additional charge. At this point I decided to cancel.", "title": "Somewhat good stay in Venice, good location!", "user": "Nicolas M", "date": "April 23, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 158604839}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "I am unimpressed by the way they treat customers, and thankful that an instinct told me to check, other wise we would have arrived to a room with no extra bed for our son. On principle I would not pay the extra at this point and will return to the American where they know how to treat their customers properly.", "title": "Fantastic hotel - very helpful staff", "helpfulness": 2, "user": "jsrBrackley", "date": "April 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 158337187}, {"rating": 4.0, "title": "Travel with children", "text": "We booked this hotel because it was close to the cruise line tram. My husband and me were traveling with are four children age 10 to 16. It was nice to not have far to walk after we got off the bus from the airport, considering we had eight suitcases with us. There are two bridges you most cross, so plan on this,it took a lot of team work to get the suitcases across. The locals were very kind and helped my children with there luggage.We had two rooms, a canal view and a garden view. Both were nice, however, the canal view was much larger. Breakfast was OK, not kid friendly but was not a problem due to we were getting on the cruise ship that day. Price was very expensive for the rooms, probably due to the cruise ship was in port. I would highly recommend this hotel if you are taking a cruise due its location. Closest hotel to the tram that takes you to port. We would return to hotel.", "user": "my2birds", "date": "April 20, 2013", "id": 158331356}, {"rating": 3.0, "title": "Book for its location near the train station, nothing else", "text": "Having visited Venice before, I knew I wanted a hotel walking distance of the train station so that I do not need to haul my luggage on the water taxi. This hotel is just a 10 -15 mins walk with your luggage to the train station. Also it is a short distance to the water taxi stop.", "helpfulness": 1, "user": "graciepapa", "date": "April 19, 2013", "id": 158234416}, {"rating": 5.0, "title": "Best hotel in Venice", "text": "My main grouse was that we were put in a building that was not connected to the main lobby and it had no elevators. At least they had a hotel porter to help us with the luggage but we choose to bring our own luggage down during check out as we didn't want to wait. I think we stayed on the 3rd floor. The corridor was pretty dark and we had to look for switches. I would maybe expect this for a B&B but not a hotel.", "user": "Scottmackenzie7", "date": "April 19, 2013", "id": 158216339}, {"rating": 5.0, "stay_parameters": "Stayed September 2012", "text": "Room was clean though you could see a bit of mould here and there. The sliding door of the toilet had a missing door knob. Will not complain for a one night stay but not more.", "title": "Wonderful Hotel, excellent location and delightful staff.", "helpfulness": 1, "user": "Gee1745", "date": "April 15, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 157820765}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "That aside, the staff were friendly and able to help us with most queries. Breakfast spread was alright but space is a tight squeeze. The lady who sat behind me gave up halfway during breakfast and moved.", "title": "Best Western Honestly", "helpfulness": 4, "user": "neal1", "date": "April 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 157329938}, {"rating": 5.0, "title": "Amazing trip", "text": "We stayed for a few a amazing days in Venice. This hotel was in the most perfect location, staff very friendly and helpful. Room very clean and comfortable, breakfast was included in the price and just what was needed to start your day.", "helpfulness": 2, "user": "kathryn A", "date": "April 6, 2013", "id": 156776242}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "My family and I stayed here during our trip to Venice and it was lovely.The staff was friendly and helpful and the rooms were clean with lovely views of the garden or canals. The free breakfast was quite tasty with a decent spread and it was the largest bathroom we had on our whole trip to Italy.", "title": "Charming Hotel", "helpfulness": 2, "user": "Laura A", "date": "April 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 156590571}, {"rating": 5.0, "stay_parameters": "Stayed March 2013", "text": "Our first visit to Venice, we found this hotel on Trip Advisor and are very glad we did. Not knowing how Venice \"works\" we travelled in as far as we could by car then asked Trip Advisor for local hotels. This was rated amongst the best so a quick phone call to a most helpful receptionist confirmed we could stay for a fair price (Easter was fast approaching) . We were able to park close by for free for 30 minutes which was sufficient to unload the bags, get them into the hotel and then move the car to the car park with which the hotel have an arrangement. All worked very smoothly and we had it much easier than the hundreds of people we saw wheeling their cases across the uneven, crowded streets and bridges of Venice. The bedroom and bathroom we had were beautifully fitted , exceptionally clean and our canal facing windows had a nice view. Breakfast was very good being the usual continental fare. We were extremely happy with our choice and would be very happy to recommend this hotel without hesitation.", "title": "Great hotel in most convenient location", "helpfulness": 3, "user": "Patrick S", "date": "April 2, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 156391451}, {"rating": 5.0, "stay_parameters": "Stayed March 2013", "text": "We stayed here 3 nights on the last leg of our Italian tour. When we arrived by bus early afternoon you always have that dread that now somehow you have to find your hotel! For the first time ever though this was not the case, I looked across the road & it was right in front of me! The outside is a little run down but so is 90% of the buildings in Venice. When we arrived the room was not ready but by the time we had got our coats on & were ready to brave the chilly weather it was ready.", "title": "A very good hotel, so much better than I ever expected", "helpfulness": 2, "user": "amz988", "date": "March 30, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 156043123}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "The room was very typical Venetian but the bathroom looked to have been renovated & still had the same feel but with a modern twist. A good sized room and big flat screen tv on the wall, bed was also comfy & there was no noise what so ever from outside or other guests.", "title": "Room with a view", "helpfulness": 1, "user": "jackie225", "date": "March 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 156021173}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "The best western Olimpia was probably one of the nicest places I have ever stayed at. The hotel staff was very friendly and helpful. The hotel is a block away from the main bus station and about a 5 minute walk to the train station. We walked from the hotel to the main attractions such as San Marco square (25 minute walk) and to the Rialto bridge (15 minute walk). Next the hotel were some great cafes and real beautiful scenery. For the price we paid, the hotel was a absolutely a gem!", "title": "Great hotel in the heart of Venezia", "helpfulness": 3, "user": "Babita A", "date": "April 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 157318309}, {"rating": 5.0, "stay_parameters": "Stayed March 2013", "text": "We stayed in this hotel for 4 nights. The hotel staff were helpful and friendly. Our room was clean and the bathroom was beautiful and very new. Breakfast was good. Great location near the train station and very close to the bus stop. Lots of good restaurants nearby as well.", "title": "Best Service", "helpfulness": 3, "user": "Stella B", "date": "April 10, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 157309265}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "Highly recommended :)", "title": "Tiny but handy!", "helpfulness": 1, "user": "Arb_1978", "date": "April 8, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 157095687}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "I' ve stayed for two nights at this hotel and was travelling with my baby. It was quite challenging to get the baby car in the elevator or to walk all the stairs to get to the hotel, but acommodation was a very nice surprise. Spacious and comfortable rooms and very satisfactory breakfast. I have stayed in four stars hotels in rome and florence but this three stars was the best. Venice is a beautiful location but definitely not suited for babies! You can get there by car and park in one of the many parking lots (a bit expensive however). If you are considering a visit, Olympia is a safe choice!", "title": "Great location if you have lots of luggages or have a car", "helpfulness": 1, "user": "hk_asiaperal", "date": "April 8, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 156964740}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with friends", "text": "The hotel is pretty much right at the entrance of Venice. If you have a car, it is highly recommend that you rent this place. There is a parking lot just 4 - 5 mins. walk away. The hotel is clean, the staff is good, the breakfast is good also.", "title": "great hotel", "helpfulness": 1, "user": "mick_nick13", "date": "April 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 156963016}], "location": {"country": "Italy", "region": "Veneto", "continent": "Europe"}, "stars": 3, "variance": {"poor": 17, "average": 51, "very good": 342, "terrible": 9, "excellent": 455}, "aka": "Best Western Olimpia", "slim_ranking": 0.11811023622, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.0, "location": 4.5}, "description": "OLIMPIA HOTELThe hotel is located in the most convenient area of the historical centre of Venice.Facing a typical canal, close to the Basilica dei Frari, the School of San Rocco, a few minutes walking from the Grand Canal and the famous Rialto Bridge.The location of the Best Western Hotel Olimpia allows you to easily reach the Bus Terminal of Piazzale Roma ( 100 meters ), from where you can get public or private transportations to the Airport ( shuttle bus or taxi ), Cruise Terminal ( the monorail fast train People Mover ), train station ( 10 minutes walking or just 1 stop by waterbus )The Hotel has been recently and totally renewed, making our services more inviting: Reading Room, Bar, free WI-FI, internet point and a charming garden. A real bonus for the venetian standard.The breakfast room windows face a small romantic typical venetian canal.The bedrooms are all decorated in a typical venetian style, dating back to the early 18th century, equipped with private bath/shower room, hairdryer, air conditioning, telephone, satellite tv and minibar."}