{"user_rating": 4.0, "review_count": 501, "name": "BEST WESTERN PLUS Bayside Inn", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled with friends", "text": "My two girlfriends and I stayed here for four nights. During this period we went to sea world, the wild animal park, tijuana and the san diego zoo. We found that the staff at the front desk were very helpful in giving us directions and information about public transport. They also confirmed our flight out of LAX for us. We found the rooms were a little bit small for the three of us. Too small that a roll-away bed couldn't have been put into the room. The microwave and the fridge came in really handy in storing food for dinner as we didn't feel safe to walk around the area at night. The shower was really weird to use, but once you get the hang of it, it was pretty good.", "title": "Good Hotel", "helpfulness": 5, "user": "EzzaEm", "date": "February 1, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 13183101, "likes": {"liked": "— Free internet and complimentry shuttle and breakfast", "disliked": "— Small rooms and we didn't feel safe outside after dark"}}, {"rating": 2.0, "stay_parameters": "Stayed December 2007, traveled with friends", "text": "The complimentry breakfast at the hotels restaurant next door was very good. It contained some hot and cold items as well as fruit. The hotels complimentry shuttle service took us to the Amtrak station. The driver was really nice and helpful. The train station isn't that far away from the hotel, but it was easier than lugging our stuff for two blocks. There is free internet access on one computer located in the lobby. We found that hardly anyone was using it. This was a very good feature to have. The hotel is pretty close to a large shopping mall, a supermarket, trolley and bus stations, train station and the local prison. The area at night had quite a few homeless people around. Im sure that they are quite harmless, however as a group of three girls at the age of 21, we felt safer to stay inside after dark.", "title": "Draft from around sliding window, gas leak smell, construction ...", "helpfulness": 2, "user": "Forevermemories", "date": "December 26, 2007", "detail_rating": {"front_desk": 2.0, "service": 2.0, "cleanliness": 2.0, "value": 2.0, "rooms": 2.0, "location": 4.0}, "id": 11971844, "likes": {"liked": "— location", "disliked": "— drafts, smelly pillows, smell of gas leak"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "All in all, we quite liked this hotel. It was fairly close to everything and the free internet access and the complimentry breakfast was excellent.", "title": "great surprise", "helpfulness": 1, "user": "Va4luvrs", "date": "December 12, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 11503161}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "We chose this hotel because of the free shuttle from the airport and to the cruise terminal. The shuttle driver was excellent. The front desk staff indifferent, non-informative, less than friendly.", "title": "Planes boats and trains!", "user": "Newcomerl", "date": "November 27, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 11090517, "likes": {"liked": "— Position of hotel", "disliked": "— Nothing"}}, {"rating": 3.0, "title": "A Great Base To Explore The City", "text": "It was mid-December so there was a cold wind from the bay. The sliding window had extreme drafts and wind from all around its perimeter. There is major construction going on and is probably much needed. I wouldn't have put any pressure on this window because It would probably fall out of the structure. We put pillow along the floor edge to try to block the wind.", "helpfulness": 1, "user": "igm", "date": "October 23, 2007", "id": 10268324}, {"rating": 2.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "Our travel agent booked this room as part of our Park and Sail for a cruise. The room itself was very nice, and the location was good as far as getting around. It was also great that it offered a free shuttle to the cruise ship terminal, as well as parking for our vehicle while we were on the cruise. The continental breakfast buffet was average - had eggs, potatoes, biscuits and gravy, fresh fruit and cereal, with a variety of drinks to go with it.", "title": "Nice room - but way too much noise at night", "user": "Aerochik", "date": "June 16, 2008", "detail_rating": {"cleanliness": 4.0, "front_desk": 4.0, "location": 4.0, "value": 2.0, "rooms": 4.0}, "id": 16954908, "likes": {"liked": "— Nice room, friendly staff", "disliked": "— too much outside noise at night from the trainstation and police sirens"}}, {"rating": 3.0, "stay_parameters": "Stayed June 2008, traveled on business", "text": "The downsides to this hotel were that there were a lot of transients around the area - as a female, I didn't feel safe leaving the room and going to my vehicle in the parking lot alone. Also, it is located one block from the train station......so, we heard the trains coming in and blowing their whistles ALL NIGHT LONG!!!!!!!!!! Also heard several sirens throughout the night. Despite the room being nice and the staff being friendly, we did not get much sleep because of the trains and sirens!!!", "title": "Excellent in Some Respects; Mediocre to Downright Bad in Others!", "helpfulness": 2, "user": "MizKitty007", "date": "June 10, 2008", "detail_rating": {"value": 3.0}, "id": 16811004, "likes": {"liked": "— Evening front desk team, overall room cleanliness", "disliked": "— Bathtub drain, breakfast buffet, parking"}}, {"rating": 1.0, "title": "the worst", "text": "After some of the mixed reviews here, I still took a chance on the Best Western Bayside Inn because of the price and its proximity to the American Society for Training & Development's International Convention & Expo. Some items were good, whereas others could stand moderate to major improvement.", "helpfulness": 2, "user": "bobhobard", "date": "May 17, 2008", "id": 16123015}, {"rating": 4.0, "title": "Best Western - Good Value", "text": "The front desk crew on the evening of June 1 provided excellent service. One of the ladies even cheerfully changed my dollar bills into quarters for the soda machine, which wouldn't accept bills from anyone that night. Room 509, to which I was assigned, was immaculate and reflected the facility's recent refurbishment.", "user": "africanviolet69", "date": "April 22, 2008", "id": 15223476}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled with friends", "text": "Now for my issues:", "title": "Really liked this hotel", "helpfulness": 3, "user": "insomniac06", "date": "February 10, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 3.0}, "id": 13430426}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled on business", "text": "Overall the stay at the hotel was absolutely fine. I'd stay there again and I would have no problem in recommending it to friends and family. On the positive side the room was clean, tidy and well maintained. It was a 6th floor room so had an interesting view of various big buildings from the balcony. My son also enjoyed watching the planes flying quite low as they approached the airport. The pool and hot tub were welcome entertainment too. Staff were pleasant, helpful and knowledgeable (at least in answering the question of how to get to the zoo).", "title": "No problem. I'd stay there again.", "helpfulness": 1, "user": "whelks", "date": "September 10, 2007", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 8687381, "likes": {"liked": "— decent views of low flying planes from the balcony", "disliked": "— plastic breakfast plates and cutlery"}}, {"rating": 2.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "Parking was $7 per night.", "title": "somewhat disappointing", "helpfulness": 1, "user": "sammy0623", "date": "September 7, 2007", "detail_rating": {"cleanliness": 1.0, "front_desk": 5.0, "location": 5.0, "value": 1.0, "rooms": 3.0}, "id": 8669220, "likes": {"liked": "— the location", "disliked": "— smell of the room"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled with friends", "text": "On the negative side the complimentary breakfast was ok, but not great. Cereals: cornflakes, raisin (sugared) bran, fruit loops (I missed my Shredded Wheat and porridge), bread for toasting (though I missed my Marmite), muffins, pastries (a little stale at times), scrambled egg, orange juice and coffee (typical American - i.e. not good). That all sounds fine and I suppose it was really, but the polysyrene plates and cups along with the plastic cutlery took it all down a couple of levels. The only other negative point was a very unpleasant smell (like stale sweat) in our corridor at certain times of the day. It wasn't present in the lift, the lobby or the bedroom, just the corridor. As I said at the outset though, I would have no problem staying here again and would be happy to recommend it to others.", "title": "Good hotel, good location", "helpfulness": 1, "user": "Soundwave", "date": "August 2, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 4.0}, "id": 8279670, "likes": {"liked": "— Very comfortable beds, amazing location"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "The room had a funny smell to it. Fridge was kept off \"to preserve our natural resources\" which was annoying to have to wait for it to get cold. Elevators and hallway had no AC, and room AC was one extreme or the other-freezing or way too warm. Bathroom was nice sized. and our view wasnt too bad, looking out to the city. Receive free continental breakfast, which goes til 11/12 weekdays/weekends. However, that was about the only good part of it. Food didn't even look all that appetizing, and is served in hotel restaurant, although we didn't receive any service from the staff. Signs are up saying \"no food to-go,\" along with a jar for \"TISP\" (not a typo lol). If you're eating the food, stick with teh fruit an cereal. The hotel only charges $7/'night parking, but it's probably because of the tight spaces in the weird garage. All of the spaces are very tight, even with our compact car. Also, garage has a weird layout, requiring you to take the drive ramps to get to the stairs.", "title": "good location friendly staff", "helpfulness": 2, "user": "davos", "date": "July 28, 2007", "detail_rating": {"front_desk": 5.0, "service": 3.0, "business": 3.0, "cleanliness": 3.0, "rooms": 4.0, "location": 4.0}, "id": 8248917, "likes": {"liked": "— cosy", "disliked": "— leaving"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled on business", "text": "Staff was friendly and helpful, but they couldn't makeup for the crappy room. TV was fuzzy, with bad sound quality. Location is good, close to Little Italy, near Gaslamp Quarter, zoo, museums, and Coronado Island.", "title": "Great Bargain, Great Location", "helpfulness": 1, "user": "caligirl111", "date": "July 20, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 8206051, "likes": {"liked": "— Location", "disliked": "— Pool area"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled with family", "text": "This was a very nice hotel. Got a large room with a lovely view of the bay. Very reasonably priced and good buffet breakfast included in the restaurant. From the Bayside Inn you can walk to the Gaslamp Quarter, Trolley Terminal, Little Italy and for a good walk down to the Fishing Village.", "title": "Very nice hotel in a great location", "helpfulness": 1, "user": "tarynsmum", "date": "October 16, 2008", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 20927852}, {"rating": 3.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "Also, they were voted by our family \"comfiest beds\" that we slept in our 3 weeks in the U.S.!!", "title": "We liked it!", "user": "comlab", "date": "August 12, 2008", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 3.0, "rooms": 3.0}, "id": 18866925}, {"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled solo", "text": "We liked the Best Western Bayside in becaus of the great location near Gaslamp Quarter. It was the first time we were in San Diege and for that the Byside in was okay. The price is was a bit high. We stayed 2 nights at the Best Western under Week. The room was Best Western standard, clean and normal in size. We got a king bed room in 9th floor, and the view to bay was fantastic. For short visiting of San Diege we can recommend this Hotel. Parking was 10$ a day.", "title": "Bayside Inn is a good base for San Diego", "helpfulness": 4, "user": "wanderer", "date": "July 15, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 17925878, "likes": {"liked": "— Location"}}, {"rating": 2.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "The Bayside was a good, relatively affordable ($134/nt. AAA) place to stay in Downtown San Diego on a summer weekend--high season. It's located at the border between the financial district of downtown and the lively residential/restaurant area of Little Italy. As previous reviewers have pointed out, the hotel is within blocks of the Amtrak/Coaster station and the Trolley, as well as the main bus spine on Broadway. Since I was staying without a car access to all this transit--as well as the many places I could walk to--was important.", "title": "not worth the price paid", "user": "VacationAccount", "date": "July 10, 2008", "detail_rating": {"front_desk": 2.0, "business": 1.0, "service": 2.0, "cleanliness": 1.0, "value": 2.0, "location": 1.0, "rooms": 2.0}, "id": 17765368, "likes": {"liked": "— the bed", "disliked": "— the manager and the cleanliness"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "Some previous reviewers commented that there were a lot of homeless people around. Maybe I'm just habituated to it, but it didn't seem like a lot to me--maybe a couple on each walk near the hotel. There were areas of the Downtown, particularly around City College, that seemed to me to have a much stronger presence of street people. I disliked the fact that in the downtown direction there weren't many people of any kind around on the weekend, and that there were an awful lot of parking lots to walk by (hopefully a few more highrise condos will get built and get rid of some parking lots!).", "title": "Decent Hotel in a Fantastic City", "helpfulness": 4, "user": "SHFT54", "date": "June 18, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 17011539, "likes": {"liked": "— Beds"}}], "location": {"country": "United States"}, "stars": 3, "variance": {"poor": 13, "average": 78, "very good": 261, "terrible": 13, "excellent": 136}, "aka": "Best Western Plus Bayside Hotel San Diego", "slim_ranking": 0.248148148148, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.5}, "description": "Located in Downtown San Diego, at the south end of the Little Italy the Best Western Plus Bayside Inn is a convenient location for leisure or business travel. We have 122 rooms, all with Balconies and many with views of the San Diego Big Bay or Downtown Skyline. Amenities include a Restaurant serving complimentary breakfast daily and dinner Monday thru Friday. Our Lounge is open daily, Monday to Friday from 4:00pm to 9:00pm. Room Service is available. We have an outdoor heated pook and whirlpool, FREE WI-FI in rooms, pool area, lobby and restaurant for you to stay connected."}