{"user_rating": 4.0, "review_count": 196, "name": "Bethesda Court Hotel", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed October 2011, traveled on business", "text": "The major comment I have is that this was just an adequate hotel with high costs. It is close to NIH, clean and quiet. However, you cannot adequately control the heat & the breakfast was in a former closet where there was never enough room. I hope to never have to stay there again. It was not bad; it just wanted good enough for $200 per night. I stayed in better hotels at a third of the cost.", "title": "Beer hotel with champaign cost", "helpfulness": 1, "user": "maimutzacelmare", "date": "October 31, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 1.0, "sleep": 2.0, "rooms": 3.0, "location": 4.0}, "id": 119939844}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled solo", "text": "I stayed here for 5 days in October over the Columbus Day weekend. Since I was driving to the area, I was concerned that I would have difficulties finding it off the beltway. My fears wre unfounded. The BCH was very easy to find off the 270 Beltway and centrally located in Bethesda. Bethesda MD is a short 15-20 minute ride on the Red Line to the middle of Washington DC (to the Metro Station, a 10 minute walk to the White House) and a much better and cheaper alternative to staying inside DC itself. The hotel is a short walk to the Bethesda Metro Station and also very close by to restaraunts & shops in the area. The people who run the hotel and work there were very pleasant & polite who work hard to ensure their customers are comfortable. My room was near the parking lot and I had no issues at all with noise from there or the street. The $14/day parking fee there is pretty reasonable compared to other places who charge $20 and up. Since I live close enough to the DC area, I drive there rather than fly and would personally prefer to pay this fee and not have to drive everywhere (and pay MORE parking fees) while leaving the car in their parking lot while I take the Metro everywhere.", "title": "Convenient, affordable and well located", "helpfulness": 1, "user": "stick007", "date": "October 24, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119686838}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "This was my first trip to DC and this hotel exceeded my expectations in all aspects. From now on, when I come to DC I will only stay at the Bethesda Court Hotel and recommend others to stay here when they too come to DC.", "title": "Convenient and affordable", "helpfulness": 1, "user": "tamis3angels", "date": "October 18, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 119460205}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled with friends", "text": "The pros: We chose this hotel because it was affordable (compared to the hotels in DC), and it was conveniently located near the Metro line. We purchased a day pass for the Metro and were able to easily vist all the DC sites. The room was clean and comfortable. The complimentary breakfast was standard.", "title": "Convenience, comfort, and SERVICE!", "helpfulness": 1, "user": "GayleYakima_WA", "date": "October 6, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 119009243}, {"rating": 3.0, "stay_parameters": "Stayed October 2011", "text": "The cons: Our room faced the parking lot. It was pretty noisy far into the late hours of the night. The coffee maker in our room didn't work, but was replaced upon request. We didn't have a microwave in our room and had to walk quite a distance to use the one located next to the ice dispenser. Also, there was a $14 a day charge to park our car in the hotel parking lot. This charge seemed to be standard among hotels in the area.", "title": "Average", "user": "LuisaColorado", "date": "October 5, 2011", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 3.0, "rooms": 3.0}, "id": 118981693}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled on business", "text": "The price and the location were terrific. The hotel is very clean and well kept. Very good value for the price.", "title": "Great Location; Good Value; A Bit Dated in Decor", "user": "TrottinDaGlobe", "date": "August 26, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 5.0, "service": 5.0}, "id": 117286393}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "The rooms are compact with only a shower (at least in my room). The location of my room did not have much sunlight exposure. That with the heavy drapes and color scheme made the room dark.", "title": "Excellent for family staying near 4H Center in Chevy Chase", "helpfulness": 3, "user": "Travelsmartindc", "date": "August 4, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116276741}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled with family", "text": "The staff is friendly and if my stay was for 1-2 nights, I would stay again, For longer stays, I would find other options.", "title": "Great location and comfortable stay!", "helpfulness": 3, "user": "NW1988", "date": "August 3, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116214385}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "Do not shop online and go to the wrong hotel. The neighborhood is great and the staff is very polite and knowlegable about the area.", "title": "Great location, comfortable everything!", "user": "retrospecht", "date": "July 26, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 5.0, "value": 4.0, "service": 4.0}, "id": 115809000}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled on business", "text": "Pros", "title": "Stayed for a month. Customer service was excellent! Highly recommend for extended stays!", "helpfulness": 1, "user": "GeneDNA", "date": "July 7, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 115125312}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "The Bethesda Court Hotel in Bethesda, MD is a great place to stay. It is one of the cleanest hotels we have ever stayed in. Ed, the manager, and his staff are great. They go above and beyond to make sure our stay there is comfortable. They have a very nice continental breakfast and a great courtyard and lobby to gather in for relaxation and conversation. They also have a microwave, refrigerator and keurig coffeepots in each room and a nice workout room. This hotel is close to lots of good restaurants, theater, drug store, grocery store and a variety of fun shopping. It is also close to the Metro. We have been staying there quite frequently since May and it feels like home away from home and safe when we are there. If you are staying in Bethesda try the Bethesda Court Hotel. You will be glad you did. Enjoy!", "title": "Bethesda Court Hotel - Great Place to Stay", "user": "L F", "date": "October 3, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 118870630}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled with friends", "text": "This was my first visit to the DC area and Bethesda Court Hotel was a great place to stay. The rooms were clean and comfortable, the staff was great, and the Metro was only a couple of blocks away.", "title": "Clean, Comfortable, Friendly", "user": "Duckling60", "date": "October 1, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 118812713}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled on business", "text": "A group of coworkers stayed at the Bethesda Court Hotel to attend a conference in DC. My room was clean and comfortable and the breakfast selection (included in the stay) was very good. But what struck me the most was the consistent friendliness and helpfulness of the staff. Having noted this already, I was even more impressed (and grateful) when a staff person contacted the taxi driver they had called for us, asking if one in our party had left his or her laptop in the lobby. I had. The staff member promptly took my information and I received my laptop the very next day at work. Thank goodness for honest and responsive customer service oriented businesses!", "title": "Staff is excellent", "helpfulness": 1, "user": "Monica R", "date": "September 29, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 118736024}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "We spent 2 nights and were pleasantly surprised by our overall experience. Our room was clean and comfortable, Wi-Fi reception good, hotel staff very friendly and helpful. Basic breakfast items & coffee included starting at 6:00am. Plenty of restaurants, coffee shops & CVS store within easy walking distance too. Metro to downtown DC a short walk away. Safe parking for a reasonable fee. Good value for the price. We will definitely stay there again the next time we want to visit Washington, DC.", "title": "Good hotel in a Great Location", "user": "RosieFlorida", "date": "September 2, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117579452}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "In July we made our second trip to the DC area and stayed at Bethesda Court again and so glad we did. Once again I can say that this staff is kind, courteous, very attentive and friendly. Breakfast didn't change from our last stay in October. Excellent variety. There was plenty of fruit, cereal, oatmeal, yogurt, bagels, bialys, danish, fruit cups, coffee, tea, juice! The patio is a beautiful place to sit and relax. We had breakfast out there one morning. Metro is 1 1/2 blocks away and only a 15-20 min. ride into DC. Bethesda itself is a happening little town. Right around the corner from this hotel is a plethora of restaurants. There's everything from healthy fast food to all sorts of restaurants and a couple of ice cream parlors and Georgetown Cupcakes!. The streets in the evening are just lovely to stroll around and in some spots there's live entertainment. Really a great little town and Bethesda Court is really a great hotel in the perfect location. When we stopped in the hotel after a day in the heat there was a welcoming glass dispenser filled with fresh lemonade that hit the spot. The rooms are very nice. It's not a modern upscale hotel but it's extremely nice and has a lot of class and style to it. The beds are comfy and each room has a fridge and microwave which is important for us. Housekeeping did a great job everyday. Plenty of room to hang clothes and lots of drawer space. They have a small fitness room that I used in the early morning to work off some of our meals. It was nice to turn on the TV, catch up on the news and spend some time on the tread mill. I would highly recommend this hotel to anyone and everyone. It's really not far from DC if that's your destination and it's like having 2 little mini vacations if you explore Bethesda as well. Forget something or want/need something quick? 7-11 is about 2 blocks away and CVS is across the street from them.", "title": "Second time was just as fabulous as the first", "user": "ChesmoRR", "date": "September 1, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117548216}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled on business", "text": "The BCH is an excellent choice for anyone going to the National Institutes of Health. There is a free shuttle to and from the NIH. The hotel rooms are clean and comfortable. Each room has a mini frig, iron and ironing board, coffee machine, and safe. Included in the rate is a continental breakfast. The hotel is located 2 blocks from the Bethesda Metro Station (Red Line).. It is convenient to get to DC without the hassle of fighting traffic.", "title": "Like a European Hotel", "helpfulness": 1, "user": "Fred924", "date": "December 15, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121779946}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled solo", "text": "That's their tagline and it is accurate. Locals think of this hotel from its former seedy reputation but it has come a long way from that history. I arrived thinking I had a reservation, only to realize that I had never received any confirmation for the phoned-in reservation I made months ago. The front desk employee couldn't have been more accommodating. She was gracious and quickly found me a room at the package rate that I had expected. As others have noted, the location is incredibly convenient, just a block away from a Metro stop. Half a block away is a 7-Eleven and a CVS. Around the corner are Bethesda's many outstanding restaurants. My package included free parking (a rarity), two bottles of water, and two pay-per-view movies. The free breakfast included the kind of food I usually eat, but this is not for the \"eggs, bacon, and pancake\" crowd. Like others, I appreciated the refrigerator, microwave, and Keurig coffeemaker. I also found the heating/cooling unit to be very loud, but effective. Finally, the bed was super comfortable and the room was surprisingly quiet. I was alone on this trip and always felt safe. I would definitely stay here again.", "title": "Indeed \"Bethesda's best kept secret\"", "helpfulness": 1, "user": "AnnArborMichigan", "date": "December 6, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121474524}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled with family", "text": "Great Hotel, the staff is very accomodating. The location is close to restaurants, etc.., but the heating/AC unit is very noisy...the only negative.", "title": "Great hotel, but the HVAC is noisy.", "user": "AroundAgain", "date": "November 15, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 2.0, "rooms": 4.0, "location": 5.0}, "id": 120628257}, {"rating": 5.0, "stay_parameters": "Stayed November 2011", "text": "If you travel at all you know that all hotels are basically the same. The rooms at Bethesda Court Hotel are standard and comfortable. Just like everywhere. What sets this place apart is the little things. Theres a big fridge (not a minibar) and microwave and free Wifi in every room. The staff are friendly, competent and, unlike at the mega hotels, have the time to really take care of you. Their complimentary towncar is a great service, the garden is lovely and there's a computer in the lobby where you can print boarding passes. Overall a lovely place.", "title": "It's the little things", "helpfulness": 1, "user": "jenwanders_notlost", "date": "November 9, 2011", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 120397311}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled with friends", "text": "Nice looking hotel. Excellent location in walking distance to many bars, restaurants, and the metro. They will give you a free car ride within 2 miles (the Bethesda area primarily). Friendly staff. It's an older hotel but it was remodeled not long ago. It has an elegant feel to it. Parking is $14 extra per day.", "title": "Great value for the location", "user": "SleeplessinSTL", "date": "October 31, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119985621}], "location": {"country": "United States", "city": "Bethesda"}, "stars": 3, "variance": {"poor": 11, "average": 21, "very good": 71, "terrible": 10, "excellent": 83}, "aka": "Golden Tulip Bethesda", "slim_ranking": 0.25}