{"user_rating": 3.5, "review_count": 1252, "name": "Bewley's Hotel Dublin Airport", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed September 2012", "text": "Stayed here for €67 per room whilst waiting to pick up friends from abroad coming in on an early morning flight.", "title": "Great value hotel close to the airport", "user": "RoryMc", "date": "September 16, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 140441860}, {"rating": 5.0, "stay_parameters": "Stayed September 2012", "text": "Have stayed here and this is an excellent, modern large hotel, ideal if flying the next day.", "title": "Great location with good parking", "user": "David134", "date": "September 15, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 140355005}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "Dinner was 8/10, really quite good for a big hotel, and 3 courses only €25. Huge foyer with dozens of sofas and a bar..a real hive of activity!", "title": "A great place to stay", "user": "paddyGeelong", "date": "September 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 140224176}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "Underground parking and a free shuttle to the airport and good value long stay car park rates.", "title": "Surprisingly great!", "user": "Denise0B", "date": "September 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 140154010}, {"rating": 3.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "An airport factory hotel. Impersonal but did the job.", "title": "Convenient for an overnight stay.", "user": "garylevy", "date": "September 4, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 139363998}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "If you want a hotel near the airport and this is the cheapest then gp for it.", "title": "Pretty good for the price", "user": "trevlac", "date": "September 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 5.0, "location": 4.0}, "id": 139215528}, {"rating": 3.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "Carpet in room was dirty. Why do hotels insist on using carpet ??", "title": "A Mixed Bag", "user": "NCcatpeople", "date": "September 2, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 2.0, "sleep": 2.0, "rooms": 3.0, "location": 4.0}, "id": 139204264}, {"rating": 4.0, "title": "Decent hotel", "text": "The bar area seemed understaffed and was untidy and messy.", "user": "lksium19", "date": "September 1, 2012", "id": 139081772}, {"rating": 3.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "Good place to if you want to be close to the airport.", "title": "Mixed Review", "user": "clara2020", "date": "September 1, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 139040147}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "Stayed one night before early morning flight to Venice - room was very comfortable, clean and quiet at front of the hotel on the top floor with a nice view - had the most enjoyable evening meal in the Bistro with excellent service - free shuttle to terminal the following morning, fast and efficient - park and fly for 8 nights plus overnight stay is very reasonable - use it without any hesitation and enjoy!", "title": "Very pleasant stay", "user": "Wanderer024", "date": "August 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 138590545}, {"rating": 2.0, "stay_parameters": "Stayed August 2012", "text": "This is a huge airport hotel so there were soccer teams, and tour buses galore. The lobby and dining rooms were huge and VERY noisy. It's not near restaurants so you have to either take a rather long cab ride into town or eat at the hotel. I would recommend a different hotel. Again in air conditioned", "title": "Very basic airport hotel.", "helpfulness": 1, "user": "Onboard12", "date": "August 27, 2012", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "location": 2.0, "service": 3.0, "rooms": 2.0}, "id": 138537865}, {"rating": 2.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "Stayed here just for the night as we had an early flight the following morning, wouldnt recommend this hotel at all the rooms where dated and beds where not comfortable also the rooms are very old fashioned compared to its competitors around, on the upside the staff on reception where friendly and nice.", "title": "Poor", "helpfulness": 1, "user": "allyk19", "date": "August 27, 2012", "detail_rating": {"cleanliness": 3.0, "sleep": 2.0, "location": 3.0, "value": 2.0, "rooms": 2.0}, "id": 138528920}, {"rating": 3.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "I probably would stay here if I was flying out from Dublin Airport, its just too far from city centre- €20 in a taxi. we stayed in room 661 and it stunk of smoke. we ate a few times from the bar food menu and I must say it pretty good, we had sat to a table in the restaurant but left after looking at the menu. there were tv's in the bar area but the sound was turned down to zero which was a little annoying. comfortable seating. the shuttle bus is great, runs every 20mins (free) there could have been more towels int he bedroom, only 2towels for 3 people!. the staff seemed to be friendly enough- Wazzem I think his name is was very good. this hotel does not do room service, when i rang to ask about it i was told if i wanted to order food I would have to come down and collect it. not much in the way of athmosphere in this hotel.", "title": "Would i stay here again?", "user": "paulconnolly", "date": "August 26, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 138454837}, {"rating": 3.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "The cleaning staff were banging in the room next door to us at 8.15 am which I thought was a little early considering you cant get a check in before 2 unless you are part of a tour group!", "title": "will try to find somewhere else if we return to Dublin", "user": "Jean G", "date": "August 26, 2012", "detail_rating": {"service": 2.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 138434239}, {"rating": 1.0, "title": "Disgraceful!!", "text": "We turned up at this hotel after flying into Dublin airport to join a queue of people to be informed that despite having confirmed bookings there were no rooms. A member of staff gave a variety of reasons for this, none of which seemed plausible. While he did his best this place is shambolic and if you think you have a confirmed booking with a reference number and everything else don't turn up here and be sure you will get a room! We were left with no room (he said he had used up all local hotels with the overflow) and was trying to get us somewhere in south Dublin but couldn't confirm this. He said that some people were checking out at 3.00 am and if we wanted to wait we could have room by 3.45 am! Families were left in dire straits and while staff were apologetic I don't know how this happened. I had taken the time 2 weeks prior to arriving to confirm I would be checking in quite late and was told this was fine and had been noted. The staff blamed the website I booked with, hotels.com but this makes no sense. Many others were turned away in the same circumstances. Shabby and unreliable. Online customers beware of this place!", "helpfulness": 1, "user": "Maggie O", "date": "August 26, 2012", "id": 138369559}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "Bewleys Hotel was an unexpected surprise! Rooms were very clean and modern. The bathroom was spotless with very modern fixtures. The shower was amazing with the perfect water temperature and pressure. Beds were extremely comfortable with super soft duvets and pillows. Shuttle to Dublin airport was also very convenient, stopping right in the front of the hotel in the morning. The only downside to the hotel was the cafe downstairs (not the brasserie) which had pretty horrible food that was overpriced. Would recommend trying the brasserie if you're willing to spend a little more or taking the shuttle to the airport to get food instead. Would recommend staying here if you need to catch an early flight the next morning. Location of hotel itself is quite far from Dublin city center, so would not stay here if you want to do some sightseeing.", "title": "Clean and modern rooms", "user": "ihearteurope09", "date": "August 25, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 138354932}, {"rating": 3.0, "stay_parameters": "Stayed July 2012, traveled solo", "text": "Be sure to read the fine print when you book Bewleys at the Dublin Airport. I made a reservation and accidentally entered the wrong month. I realized my mistake the next day and tried to cancel the reservation which was for a month and half later. They would not cancel. I never did stay at the hotel but ended up paying for the night .", "title": "Beware Bewley's cancellation policy!", "helpfulness": 1, "user": "Louise S", "date": "August 25, 2012", "detail_rating": {"value": 3.0, "location": 3.0, "service": 2.0}, "id": 138334277}, {"rating": 3.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "This is a perfectly good hotel for one or two nights. If you are flying, its great to be able to leave the car and take the excellent shuttle to the airport. The staff are friendly and helpful. But there is more athmosphere on the moon than in this hotel.", "title": "Always stay here", "user": "martingk", "date": "August 24, 2012", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 2.0, "location": 5.0}, "id": 138254061}, {"rating": 1.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "This has to be one of the worst airport hotels in the world. The room was dirty, the food was lousy, and the staff was rude. There is no air conditioning and it was a hot, noisy night. There are better choices around the airport. I certainly won't be coming back.", "title": "Overnight pre-flight stay", "helpfulness": 1, "user": "DocB28", "date": "August 24, 2012", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 138225810}, {"rating": 2.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "We stayed for one night on 26 August as we had an early flight and we used the underground car parking facility to park the car", "title": "One night only", "helpfulness": 1, "user": "HollydogIslandmagee", "date": "September 9, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 1.0, "rooms": 2.0, "location": 3.0}, "id": 139843678}, {"rating": 1.0, "title": "\"overbooked by system glitch\" - yeah right", "text": "Receptionist not very friendly room on first floor very hot no air con so window had to be open", "helpfulness": 2, "user": "A TripAdvisor user", "date": "September 8, 2012", "id": 139772129}, {"rating": 4.0, "title": "As Airport Hotels Go It's Very Good", "text": "The traffic noise was unbearable and there were two spotlights beaming into the room", "user": "rftu", "date": "September 7, 2012", "id": 139662517}, {"rating": 3.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "the tv sound was so low on ITV that we could not hear it and there was only a soap dispenser in the bathroom no other toileteries were provided", "title": "Ireland Vacation", "user": "jbuscher", "date": "September 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 3.0}, "id": 139649768}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "Stayed at Bewleys last weekend 17th - 19th August. This is the third time in recent months my two young children and I have stayed at the hotel and yet again the hotel was excellent. Staff are friendly, helpful and ready to answer any question. The food is excellent with a wide choice at breakfast, snack bar menu(particularly the cheese cake) and lovely food in the restaurant. The lounge area is relaxing and welcoming with large cosy chairs and it is always beautifully clean. Rooms are spacious and inviting. Shuttle bus to the airport is also fantastic for links into Dublin town center.", "title": "Another Fantastic stay!!!", "user": "sarah t", "date": "August 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 138137790}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "Thanks again to all Bewleys staff for another great weekend!!!!", "title": "Great value family rooms", "user": "NoodleNoo", "date": "August 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 137743461}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled on business", "text": "We have stayed here a few times on stopovers in Dublin, even though we haven't been using the airport because it is great value (approx. £55/family room), with great quality, quiet rooms and near the ring road for a quick exit out of Dublin the next day. The hotel is great: large, clean, comfy rooms with a choice of 2 large restaurants and parking available. The staff are polite too. I would highly recommend this hotel to other families.", "title": "Good option for night before flight", "user": "TrevD", "date": "August 18, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 137588445}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "Good option for holiday or business traveller if you have an early flight next day from Dublin Airport or if you have arrived in Dublin Airport and need to get some sleep. Rooms are clean and comfortable and come with tea and coffee making facilities and also have free wifi. Bathroom is of a reasonable size but lacks typical bathroom accessories (see comment below).", "title": "Brilliant as usual.", "user": "PABO", "date": "August 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 137552666}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled on business", "text": "The bar area is large and is a good place to relax, eat or even do a little bit of work on the laptop. The food is 20% overpriced for what you get I feel and they could do with a bigger range of lighter options on the menu. A heavy main course is not the best thing to eat if you want to get to sleep quickly if you have an early flight next day.", "title": "spotless ,handy and very good value", "helpfulness": 1, "user": "joey s", "date": "August 13, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 137105732}, {"rating": 2.0, "stay_parameters": "Stayed September 2012, traveled solo", "text": "I really don't like giving bad reviews and usually I don't but ... usually stay at the Radisson Dublin Airport but because this was 59 euro I decided to give it a shot. Check in was fine - got the room - it was clean but so HOT. Opened window and went to bar to have something to eat. Was debating whether to go to the Brasserie but as I was by myself I decided to choose the bar. Ordered a burger - not a great choice on the menu. It arrived literally 3 minutes later - I was expecting a nice homemade beef burger. Not so, I live in Belgium and we have Mora burgers here which my kids love but yeuk I hate them - frozen burger - kinda springy if you know what I mean. Took one bite and called the waitress over to complain. She took it away and her superior came over to me. He said \"I sold 50 burgers today and got no complaints ....\" Nice that the customer can have an opinion. He offered to get me something else but I said I would eat in the Brasserie instead. Had steak - it was OK but only oK. Chips and a bit of salad for 22 euro but then again Ireland is a bit of a rip off. Went back to my room which was still too hot. Think I will be back to the Radisson next time I need an airport hotel", "title": "Don't like giving bad reviews", "helpfulness": 1, "user": "Irish1965", "date": "September 11, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 1.0, "rooms": 3.0, "location": 3.0}, "id": 140009509}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "Stayed here one night prior to flight from Dublin Airport.", "title": "Ideal for Airport", "user": "BogtrotterBelfast", "date": "September 10, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 139907394}, {"rating": 3.0, "stay_parameters": "Stayed September 2012, traveled with friends", "text": "Its about 10 mins on free shuttle bus to airport so ideal.", "title": "Good - not great!", "user": "CountryGirlWexford", "date": "September 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 2.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 139878783}, {"rating": 4.0, "stay_parameters": "Stayed August 2012", "text": "Good reception, well appointed large room, comfortable bed. Finding it driving from north can be quite tricky - follow N32 signs to Malahide and you will see it. Car parking feels secure and shuttle bus service was ok. We had a bit of a wait on the way back and finding the new stop is a challenge when you are tired. We had a meal in the restaurant and the main course was excellent - pity about the tasteless cheesecake. Would definitely use Bewleys again.", "title": "Much better than expected!", "user": "fionnualag", "date": "August 29, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 3.0, "service": 4.0, "rooms": 4.0}, "id": 138750344}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "stayed here on the last night of our holiday before flying out! a very nice place,,food was great,,tho the rooms are a little dated and the windows were filthy! bedding and room was very clean tho! close to the airport so handy! could do with a make over as a very very busy place!but on the whole we would stay here again!", "title": "not a bad stay! needs a touch of love tho!", "user": "david l", "date": "August 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 138719557}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled solo", "text": "I have stayed in this hotel a few times now, if I have an early flight from dublin Ill always stay here. Im glad to say its every bit as good as I remember.", "title": "As good as I remember!", "user": "CaceeB", "date": "August 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 138701926}, {"rating": 3.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "It was a Saturday when I stayed this time and when I got there it was very busy , the bar area and restaurant were packed. There was a bit of a wait for check in but it was very very busy there. As always the staff were very friendly and very efficent. I had asked for a room on a high floor away from the lift and I was delighted to be given that.", "title": "Just ok!", "user": "shadara", "date": "August 28, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 138679267}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "The room had a double bed and a single and a great view from of the sea from the windows. It was spotlessly clean. The only grip I have is the bathroom didnt have seperate shampoo, conditioner etc only a wall dispenser. That is a very minor concern though.", "title": "Convenient great hotel", "user": "JoanneMcDUsa", "date": "August 28, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 138657654}], "location": {"country": "Ireland", "continent": "Europe"}, "stars": 3, "variance": {"poor": 97, "average": 262, "very good": 481, "terrible": 72, "excellent": 340}, "aka": "Bewleys Hotel Swords", "slim_ranking": 0.474860335196, "detail_rating": {"service": 3.5, "cleanliness": 4.0, "value": 3.5, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "description": "This contemporary hotel provides the ideal choice for a pre or post flight stay, ideally located jsut 7minutes from Dublin Airport by shuttle service. The hotels accessible location at the M1/M50 junction also makes it a convenient meeting point for conferences, meetings and events. Quality service is a must from the hotel."}