{"user_rating": 4.0, "review_count": 120, "name": "Big Milly's Backyard", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled with friends", "text": "I spent two weeks in Ghana in October intending to use Big Millys backyard as a base and do some sight seeing.", "title": "\"Another day in Paradice\"", "helpfulness": 1, "user": "Nigel R", "date": "December 28, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 122195281}, {"rating": 2.0, "stay_parameters": "Stayed December 2011, traveled with friends", "text": ", but i ended up spending my two weeks there as it catered for all my needs.", "title": "If you have more time, you can do better", "helpfulness": 2, "user": "Linear U", "date": "December 22, 2011", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 1.0, "location": 1.0}, "id": 121996770}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "I arrived on a Saturday and it took about an hour by taxi to get there (i would urge anyone coming from accra airport arrange a taxi via Millys ). I got there at around 9pm and the place was buzzing to the sound of a band and was directed to my apartment. I chose a mid priced apartment with no air con but frankly I did not miss that at all.When I say mid priced i could not believe how reasonable it was.", "title": "What a great, fun place to stay!", "helpfulness": 1, "user": "kalter", "date": "December 8, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 121510891}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled with friends", "text": "There are various apartments available and even tents . My room had a bathroom and toilet and was clean without being luxury but frankly the total experience of the place outways anyy petty quibbles.", "title": "backpacker's getaway", "user": "Wen278", "date": "November 30, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 121265675}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled solo", "text": "The staff are wonderful, no request is too much for them , and the owner is around for a chat and will offer any advice if required.", "title": "Stunning Holiday!", "helpfulness": 2, "user": "Annemarie569", "date": "November 21, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120857300}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "The room was very nice, thou I think we went for the most esxpensive one about 100 cd, but it had ac private bathroom with hot water :) The first night they had African music and dance, the show was very very nice! The next night they had a reggae night wich was good. Food is sooooo nice we had lobster and veggie lasagña and both were delicious and good price. We were advised of the unsafe beach so we were carefull so didnt have any issues nor heard of anyone who has... There is a veggetarian restaurant at the beach were I took cooking lessons with its owner Ras TT, it was sooo much fun and now I can cook jollof rice and veggie keb abs! There is also lots of little markets were you can buy cool stuff... The stuff was very nice too, and breakfast yuuummmmmy! Totally recommend it!", "title": "The great place to relax and have fun!", "user": "Caro R", "date": "June 7, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 131480583}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled with friends", "text": "best spent last night in Ghana, nice cottage like rooms best for back packers, good food and access to the beach", "title": "danced to the African beats n Drumming", "user": "Terikukis", "date": "February 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124536015}, {"rating": 3.0, "stay_parameters": "Stayed January 2012, traveled with friends", "text": "Had always been put off Miss Millys by the bad roads in and out although had visited the beach in 2010.In many ways its great as reflected in the reviews here...a safe haven on the beach [ clean except for the rubbish swamp] where everything is at hand and one can watch busy timeless fishing activity while eating 10pes oranges. However Milly is a clever lady...bar prices are 50% up on village adjacent,food was very dissapointing afro/euro ,mains 15ghc and NO fresh fish [saw tonnes every day on beach] except dry tuna.Eat in village one night far better authentic food 1/3 price.Sign on gate =No food or drink to be brought in!! Great if you been volunteering up country and want to chill with 'whites' and dont feel the need to get out and about.Also the friday cultural show and saturday live music brings in a good crowd from other local hotels.", "title": "Backpacker CenterParc !", "helpfulness": 1, "user": "turbofarmer", "date": "February 11, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 124429019}, {"rating": 3.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "My Tip ?? Go out into the village up to the corner with the main line ....better taxis here,or take the Trotro to Kaneshie for 40pes.P.S.Village is proper Ghana ,Miss Millys a holiday bubble but perfect for families and first timers", "title": "Nice complex, shame about the unsafe beach", "helpfulness": 1, "user": "The2explorers28", "date": "January 19, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 2.0}, "id": 123295508}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled solo", "text": "We stayed at Big Milly's for a few nights in December 2011. We had pre-booked the Sahara Suite for the first 2 nights of our stay and a similar room (slightly less money-wise) for the last night of our stay. When we arrived on our first morning after the 2hr journey through the Accra traffic from the airport our room wasnt ready so they gave us a small room to rest in which was much appreciated. We then moved into the Sahara Suite at midday, which was spacious, air conditioned (MUCH needed!) and had its own bathroom. The room we had on the last night was also spacious, air-conditioned and big (not quite as big as the Sahara Suite but perfectly suitable for 2 people).", "title": "perfectly relaxing way to lose yourself for a few days...", "user": "londonmammal", "date": "January 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 122716283}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "We spent 1 night at Big Millie's during our recent trip to Ghana and really wished we had the time to spend longer there.", "title": "Fantastic Spot Just outside of Accra", "user": "ash4985", "date": "October 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 143122046}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled on business", "text": "We stayed in a budget room with a double bed, fan and ensuite (bu open air) shower/toilet and it was absolutely perfect for our needs, although using the washroom during the evening's tropical thunderstorm wasn't ideal.", "title": "A Haven away from the City", "user": "Instep", "date": "October 12, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 142640287}, {"rating": 5.0, "stay_parameters": "Stayed September 2012", "text": "The staff are so friendly, the Friday BBQ was awesome, the drumming show fantastic and the beach great fun. I loved playing in the waves and watching the fishermen bringing in their catch. Despite all the warnings I didn't feel threatened on the beach, maybe because I had bought nothing with me.", "title": "Big Milly's heightened my experience in Ghana...", "user": "Fb14UK", "date": "September 27, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 141455355}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with friends", "text": "It is a short drive from Accra (depending on traffic) and we managed to get a taxi from Kaneshie for 15 cedis so didn't bother with the tro tro.", "title": "Awesome escape!", "user": "gypsy_traveller2012", "date": "September 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 140712932}, {"rating": 1.0, "title": "Mugged at Knifepoint on the beach at 10:30am.", "text": "Will definitely be returning during my next trip to Ghana, hopefully for the Saturday night reggae party.", "helpfulness": 3, "user": "MrBTraveller", "date": "August 27, 2012", "id": 138478244}, {"rating": 2.0, "stay_parameters": "Stayed September 2011, traveled with friends", "text": "I dwel at Big Milly's almost 2 years ago. The stuff is friendly but they have not \"service mind\". If you want dinner at the restaurant of the resort you must decide your meal at 3-4 pm because they buy only the food strictly necessary for the orders of customer (it means that you cannot change mind about the food you order previously). So i ate often at restaurant front of BM. The beach is full of garbage (walking there i also found a syringe!!!) and unsafe: the beach is also full of annoying people try to sell you items (some of them try also to menace me if i don't buy something!).", "title": "Dirty and unsafe beach!", "helpfulness": 2, "user": "MrLik", "date": "August 22, 2012", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 1.0}, "id": 137981106}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled with friends", "text": "The only good thing: the shower above the stars... unique experience by night!", "title": "Favourite memories come from here!", "user": "Elleenelle", "date": "August 16, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 137387021}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with friends", "text": "I stayed here with some friends for a chill out weekend after a month of volunteering in the Volta region and it was one of the best places we stayed. Completely chilled out, safe, friendly plus the feeling that you are in a little corner of paradise - Big Milly's Backyard was exactly what we needed. The staff are incredibly friendly and helpful and become your new best friends pretty quickly. Noah was brilliant in arranging for us to stay for an extra night when we decided we weren't quite ready to leave. The beach is beautiful - and a world away from the beaches in nearby Accra. The Saturday night party/entertainment is a great way of letting off steam. Favourite place in Ghana by far!", "title": "Magic at Big Milly's", "helpfulness": 1, "user": "BPJH", "date": "July 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 134967610}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with friends", "text": "Big Milly's Backyard is a unique and special place, unlike anywhere I have ever stayed in any part of the world. It's listed accurately on Tripadvisor as being in its village of Kokrobite, but the most helpful location-tag would be Accra, for though the City is a good hour's drive away, Accra is likely to be most travellers' starting point, and few would know to search under the name of the village.", "title": "Great chill out place for a few days", "user": "Cabz1986", "date": "July 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 3.0}, "id": 134177089}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with friends", "text": "The establishment presents itself almost like a small African village compound, on the sand at the edge of the roaring Atlantic. The buildings are roofed with grass - some round huts, other square or rectangular - set amongst tall palms and a variety of deciduous trees. The bar is an open, grass-roofed feature in the centre of the public area, and the restaurant is an elevated timber structure with a sandy floor and its grass roof too. The accommodation ranges from a roofed dormitory with beds and mosquito nets for a few dollars a night, through mid-sized rooms to the Sahara Suite, a sizable two-roomed affair with balcony, air-con and en suite bathroom for about fifty dollars a night. Communal, open-air showers are provided for the majority of guests, also used by staff members.", "title": "Your second home away from home", "helpfulness": 1, "user": "Babysiss", "date": "July 4, 2012", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 133420268}], "location": {"country": "Ghana", "continent": "Africa", "city": "Kokrobite"}, "variance": {"poor": 10, "average": 11, "very good": 35, "terrible": 3, "excellent": 61}, "aka": "Big Milly`s Backyard Hotel Kokrobite", "slim_ranking": 1.0}