{"user_rating": 4.5, "review_count": 77, "name": "Bigfork Mountain Lake Lodge", "reviews": [{"rating": 5.0, "title": "Wonderful, Clean, New, Beautiful scenery", "text": "We were extremely pleased with the accommodations as the rooms were built so the balconies do not directly face each other giving greater privacy. The Lodge also boasts two restaurants, fine dinning and a sports bar. When looking out the balcony, Flathead Lake is visible.", "user": "woogandbg", "date": "October 10, 2008", "id": 20787635}, {"rating": 3.0, "title": "Business Conference at the lodge", "text": "All in all this was a very nice stay and we recommend Mountain Lake Lodge to any and all who want an excellent place to reside.", "user": "scottdBillingsMt", "date": "September 30, 2008", "id": 20515432}, {"rating": 5.0, "title": "Mountain Lake Lodge is Fantastic", "text": "An Added feature that made us extremely happy was the pet friendly atmosphere at Mountain Lake Lodge. Pets are allowed for a nominal fee.", "user": "rrogersla", "date": "September 5, 2008", "id": 19805369}, {"rating": 4.0, "title": "Great View", "text": "Stay at this one!!!!!!!!!!!!!!!!!!!", "user": "doctor69", "date": "August 7, 2008", "id": 18733372}, {"rating": 4.0, "title": "Good but not great", "text": "We stayed at the lodge for a conference my wife was attending. The rooms were ok, bathrooms nice all were clean. Our biggest complaint is for the price, and the style of resort, the beds were extremely uncomfortable. I have stayed in business hotels with better quality beds. The work out room, which is an important feature with our lifestyle had out dated and broken down equipment. All in all I'd say it was Ok...", "user": "honestyfromMt", "date": "July 31, 2008", "id": 18478140}, {"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "This is a great property with well kept grounds and clean, modern rooms. This property seems to be in a class of its own in the region, an unknown gem of sorts.", "title": "Fantastic Staff", "user": "JMGL", "date": "July 6, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 17577019, "likes": {"liked": "— The view", "disliked": "— Needs much better fitness equipment"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "Although the website is a bit confusing with all the different room configurations a quick call to the hotel brings clarity.", "title": "June Wedding", "user": "MT_Travelers", "date": "June 22, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 17123584, "likes": {"liked": "— Rooms, Views, Service, and Food (in no particular order)"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "Food in the two on-site restaurants is very good and service is friendly and eager (although a bit wanting in experience \\ training).", "title": "Nice Place, Great Courtyard with Lake Views", "helpfulness": 1, "user": "pshajh", "date": "June 16, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 2.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 16977617, "likes": {"liked": "— Comfortable Room/Views", "disliked": "— Service at Terras"}}, {"rating": 5.0, "title": "Great romantic getaway", "text": "This place has been advertising in our area a package of one night and dinner at their \"Terra Steakhouse\" for $145.00. We had never stayed there before and decided to give it a try. We were very pleased and impressed. Our room was spotless, had a fireplace and a jacuzzi and a beautiful view. The dinner was excellent. Their steaks are as good as I've ever had and the resturant has a fabulous view great wine and equally great atmosphere. There is also a fun sports bar and pub on the ground level. The view is over the beautiful Flathead Lake. The lodge doesn't own lake frontage aparently, which in the winter doesn't matter of course, but in the summer you would probably want to identify whatever Woods Bay had to offer and how you could also enjoy the lake. I'm quite sure the lodge could help with that too. Once we figured in that we got about $70.00 worth of dinner included in the price it really makes for a bargain at a top notch place.", "user": "mtoutdoorsman", "date": "March 6, 2009", "id": 25691266}, {"rating": 3.0, "title": "Really, the maintenance truck!", "text": "We were satisfied with the room. Love the jacuzzi for two. Our view was impeded by a maintenance truck the entire time. It was our first time to this location and we probably will not be back. The room was homey and with the dining package was great.", "user": "zootowngal", "date": "February 11, 2009", "id": 24485215}, {"rating": 5.0, "title": "great getaway evening", "text": "Disappointed to see the 17% gratuity added to the bill, even though we did select the dining package would have liked to make our own tip. The wait staff in the Terra steakhouse was very eager too help, took some of our food away before we were finished.", "user": "my97offroad", "date": "February 8, 2009", "id": 24374175}, {"rating": 5.0, "title": "Great Weekend", "text": "We decided to go to Riley's after dinner. Sat for 10 minutes the staff looked at us but never approached us. Very disappointing! My boyfriend will not take me to this location again because of these issues! sad!", "user": "logbuyer", "date": "January 12, 2009", "id": 23506506}, {"rating": 5.0, "title": "Great Little Getaway", "text": "Absolutely great night for me and my wife. We stayed on a saturday night as a getaway from the kids for an evening and had a great time!", "user": "jodiecoston", "date": "November 11, 2008", "id": 21721457}], "location": {}, "variance": {"poor": 0, "average": 7, "very good": 22, "terrible": 1, "excellent": 47}, "aka": "Bigfork Mountain Lake Hotel", "slim_ranking": 0.222222222222, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "Mountain Lake Lodge offers 30 fireplace suites with spectacular views of Flathead Lake. Located 5 miles south of Bigfork, MT. Outdoor infinity pool and hot tub. Terra Steakhouse for breakfast, dinner, and Sunday prime rib brunch. Riley's Pub and Sports Bar - wood-fired pizza, burgers, sandwiches and microbrews. Group Events - function space available! Special winter getaway packages - available October 1st - May 31st."}