{"user_rating": 2.5, "review_count": 185, "name": "Billings Hotel & Convention Center", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "This evening during our tour of the town, My wife and I watched your courtesy driver (Van bhcc 3) MT plate cross three lanes to cut off a couple that were in the far lane on old laurel hwy in billings Montana as we left the hotel. No Hotel should be in that big of a hurry to disregard the public's safety. During such a wonderful stay that was very sad to see. I hope that a great establishment will take steps to not have this happen again.", "title": "Your Courtesy Drivers need training!", "helpfulness": 3, "user": "BigBlue1975", "date": "June 12, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 4.0}, "id": 112983140}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "Thanks to the employees for helping with everything we asked about with a smile! We had a varied group of people in three rooms, lengthened our stay twice and they extended the discount rate we had booked with. They let us use the computer/printer late at night when we needed it, were helpful in every way! We also rented a parlor room at the last minute for a large group get together and everything was perfect.", "title": "The employees were so nice & helpful! The hotel cozy and accomodating.", "user": "likeitcozy", "date": "May 25, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 109872089}, {"rating": 3.0, "stay_parameters": "Stayed May 2011, traveled on business", "text": "It is a cozy hotel and the beds are comfy, clean, nice hot tub and water slide indoor pool. Hope you like it as much as we did!", "title": "It was okay", "user": "kcwoods2", "date": "May 19, 2011", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 3.0, "sleep": 2.0, "rooms": 2.0, "location": 3.0}, "id": 109012887}, {"rating": 4.0, "stay_parameters": "Stayed April 2011", "text": "I stayed 2 nights at this hotel because it was booked with a high school athletic group. It would not be my first choice, but I've stayed in worse. The beds were comfortable. The staff was not real friendly, and did not go out of their way. theres no free coffee in the lobby. The wi-fi was slow and lost connection alot.", "title": "Fun stay", "user": "Monteycrew", "date": "April 27, 2011", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 105817510}, {"rating": 1.0, "stay_parameters": "Stayed April 2011, traveled on business", "text": "We chose this hotel for the great location and the pool and slides. We enjoyed the ducks in the common area. We enjoyed the spacious rooms and the coffee maker and refrigerator. The staff was very friendly.", "title": "Not Impressed", "helpfulness": 5, "user": "kaylasstuf", "date": "April 26, 2011", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 1.0, "rooms": 1.0, "location": 4.0}, "id": 105685577}, {"rating": 3.0, "stay_parameters": "Stayed April 2011, traveled on business", "text": "Our room was clean and neat. Just two annoyances--the shower water went from very hot to very cold unexpectedly--could be dangerous.", "title": "Good experience; a few small issues", "user": "farawayplaces", "date": "April 11, 2011", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 103564237}, {"rating": 3.0, "stay_parameters": "Stayed April 2011, traveled on business", "text": "Also, a staff issue. When I arrived, the young dark-haired woman was on the phone, then held a long conversation with another employee--all the while ignoring me. She needs training to see she should glance up and tell a waiting customer she'll be with her in a moment.", "title": "Great Customer Service!", "user": "RC_Librarian", "date": "April 9, 2011", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 103421933}, {"rating": 1.0, "stay_parameters": "Stayed March 2011, traveled with family", "text": "This was my first time to Billings MT - came for a business conference. The lady working at the front desk the three nights I stayed there was extremely helpful in making my stay an enjoyable one. Her genuine concern, friendly personality, and ability to resolve my concerns during a packed conference was instrumental in making my experience here positive. Thank you Lindsay!", "title": "Absoultly Horrible!!!", "helpfulness": 5, "user": "Traveler11040", "date": "March 30, 2011", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 3.0}, "id": 102190482}, {"rating": 2.0, "stay_parameters": "Stayed March 2011, traveled with family", "text": "Where to start... first of all found it much cheaper on Price Line, and they were really weren't wanting to give it to me. We checked in at 9 pm. Then once we got to our room our bathroom was very dirty. Something black in the corner by the tub...was afraid to touch it. Along with some actual dirt/sand type stuff along the entire tub where it is grouted. The carpet looked like it hadn't been vacuumed in years! There was a big gross white spot on it, that I hope was milk.. but who knows! It really looked like it would have been very easy to get wet and it would be gone. That night was a very noisy night. I called to complain to the front desk and nothing was done. We left bright and early at 7 am on Saturday, hoping that the room would be clean when we returned later that evening. Well when we got back the beds were made but the bathroom was still very gross. We rushed to the overly croweded pool area, not to be able to get on the slide and they were broken, and there were atleast 10 people in the hot tub so could never get in. We left the pool headed up to our room, only to find that the entire hall was poluted with marajuana smoke, like a you would see in a room. There were all sorts of kids running around, in the smoke I might add. So I called the front desk to come and see the situation and all they could say was \"that yes it reaked of weed\" but could not find who did it! I would have been knocking door to door! So the next am I pulled back the sheets to drag my son out of bed, only to find blood on his sheets! Not cool with me!!! I explained all this to the front desk person, and it went in one ear and out the other! Very GROSS!!!! Never will stay again!!! NEVER!!!!", "title": "Should have been better.", "helpfulness": 3, "user": "rjbs4", "date": "March 28, 2011", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 2.0, "sleep": 2.0, "rooms": 2.0, "location": 3.0}, "id": 101816118}, {"rating": 1.0, "stay_parameters": "Stayed March 2011, traveled on business", "text": "When we arrived at the hotel around 7:30pm, we started the check in process and the front desk lady received a call from a guest and asked that the male worker to get a coffee pot and take it to the room. He said he didnt know where the coffee pots were and told her to ask the lady eating food in the office where they kept the coffee pots and the lady said \"F*** Y**\" Very unprofessional!!! My young children were standing right there.", "title": "THE ROOMS ARE INFESTED WITH BED BUGS", "helpfulness": 3, "user": "MontanaH202", "date": "March 15, 2011", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 2.0, "sleep": 1.0, "rooms": 1.0, "location": 4.0}, "id": 100248149}, {"rating": 2.0, "stay_parameters": "Stayed February 2011, traveled on business", "text": "Customers on the phone are more important than one standing at the desk with a problem. Waited forever and was interrupted frequently when the person kept answering the phone. No towels in pool area. They told us they were coming twice over two hours and they never showed up. They shorted us a room, and messed up our booking. Breakfast staff was rude and mean.", "title": "Horrible Customer Service", "helpfulness": 2, "user": "antelope47", "date": "March 2, 2011", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 1.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 98724780}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "We had checked into a hotel near the Billing Hotel and found the first hotel very dirty and the staff was very rude. We checked out immediately and drove to the Billings Hotel and found it to be very clean, had a good staff, and all the amenities of a restarant, bar, pool, good parking and easy access to shoppijg. We highly recommend it and will return on our next trip to Billings", "title": "Excellent place to stay with alll amenities at great price,", "user": "CLZG", "date": "March 1, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 98503261}, {"rating": 2.0, "stay_parameters": "Stayed February 2011, traveled on business", "text": "I stayed for a week and as soon as I checked in I realized I wasnt staying at the same hotel they were advertising on their website. The lobby was nice but there was no elevator and the layout is terribly confusing so I had to drag all my stuff up a flight of stairs! For $50 a night I do that but not for what they are charging or the level of class they are advertising. The room was OK but not at all what they advertised, the beds are hard and the restaurant was not very good. This is what I would expect from a cheaper hotel, stay at the Holiday Inn instead.", "title": "Not what I expected based on the pictures", "helpfulness": 2, "user": "Angie R", "date": "February 12, 2011", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 1.0, "sleep": 2.0, "rooms": 2.0, "location": 1.0}, "id": 96351465}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled on business", "text": "The Billings Hotel and Convention Center hosted one of the largest conventions in Billings, providing lodging and food for a week-long convention with over 1600 rangeland management professionals. As part of the organizing committee planning this event for the past year, I observed the hotel staff to be outstanding professionals with accommodating and positive attitudes. The facilities were well maintained and clean and I thoroughly enjoyed my stay there.", "title": "Professional, accommodating, and friendly staff.", "user": "kreid13", "date": "February 11, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 96278666}, {"rating": 4.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "We booked this hotel on a last minute whim to get away for a night. It was a top secret hotel on Travelocity and we got a great deal. The room is nice and clean and you can tell they have recently put some work into the rooms.. but everything is not new. Our bathroom threshold was broken (not a big deal), the toilet seat needs replaced (worn out) and the tub needs some bleaching But other than that it was fine! The pool was great fun (we ended up being the only ones in it at the time) and the hot tub is nice but needed cleaning when we were there (but there had been a birthday party in the room earlier with a ton of kids so they may have reeked havoc on it!) Our check in wasn't great - although we did receive an upgrade to a king - the front desk girl gave us no information we had to look up check out time in the guest services directory and we seemed to be interrupting her (I manage a front desk so this was very annoying to me...) All in all it was a nice hotel for the money - clean and well appointed.", "title": "Pretty Good for the price", "user": "CinMT", "date": "January 17, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 93370668}, {"rating": 1.0, "stay_parameters": "Stayed July 2011", "text": "The pits. The wife was persuaded by the sign on the highway promising a waterside and the AAA guide. As soon as we walked in the front entrance and saw the casino, we knew it was a mistake. Then we saw the room. Yuck. You CAN do better.", "title": "Yuck.", "helpfulness": 4, "user": "MikeyBikey", "date": "July 21, 2011", "detail_rating": {"cleanliness": 1.0, "value": 2.0, "location": 2.0, "service": 2.0, "rooms": 1.0}, "id": 115632981}, {"rating": 1.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "If the hidden costs do not get you,the rudeness of the staff will.", "title": "WARNING, WARNING, WARNING!!!!!", "helpfulness": 5, "user": "jmklbourn", "date": "July 17, 2011", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "service": 1.0}, "id": 115467225}, {"rating": 1.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "Upon checking out I was made aware of a $5.95 \"electrical charge\" for each day of our stay. This cost was not made know to us upon checking in.", "title": "GROSS! This Hotel has potential but it was filthy!", "helpfulness": 5, "user": "shellyneff", "date": "July 17, 2011", "detail_rating": {"sleep": 1.0, "value": 1.0, "service": 1.0}, "id": 115458663}, {"rating": 4.0, "stay_parameters": "Stayed July 2011", "text": "Water slides into the pool, don't count on in, unless you pay a $3 usage fee, per person per day, even with only 45 mins left in the day. A staff member yelled at my 3 year old (who doesn't understand a fee) for trying to go up with his cousin that had already paid. This caused fear in both the children.", "title": "Fairly nice hotel but with quirks....", "user": "GilesTraveler", "date": "July 7, 2011", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 115123441}, {"rating": 2.0, "stay_parameters": "Stayed June 2011, traveled solo", "text": "Have you ever been to a hotel with a FREE continental breakfast? Not at this place, $7.95 for their contenintal breakfast!!!", "title": "It was okay but wouldn't stay again", "helpfulness": 3, "user": "dougers79", "date": "June 22, 2011", "detail_rating": {"cleanliness": 1.0, "sleep": 3.0, "value": 1.0, "service": 3.0}, "id": 114642931}], "location": {"country": "United States", "city": "Billings"}, "stars": 3, "variance": {"poor": 41, "average": 23, "very good": 33, "terrible": 64, "excellent": 24}, "aka": "Billings Hotel And Convention Center", "slim_ranking": 0.711111111111}