{"user_rating": 4.5, "review_count": 735, "name": "Biltmore Hotel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled on business", "text": "We stayed at the Biltmore for four nights and found it to be wonderful. We were upgraded to a lovely room with a nice view of the pool and golf course. Being September,and hurricane season, the hotel was not crowded, so it was wonderfully relaxing. We found everyone on the staff to be exceptionally courteous and helpful without being overbearing. We had breakfast and lunch and I thought it was fairly priced for a hotel ,and the food was quite good. The pool is huge and and pleasant. The lobby is dark, but it is the decorating syle of the 1920's, I thought it was very interesting. Our room was bright and kept exceptionally clean. Overall it was great and we would love to go back.", "title": "Enjoyed this hotel", "user": "kyamin", "date": "September 12, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 20014553, "likes": {"liked": "— Pool and room", "disliked": "— nothing"}}, {"rating": 1.0, "stay_parameters": "Stayed April 2008", "text": "This hotel is an absolute nightmare. The rooms are cramped and not maintained. The hotel has a musty moldy odor both in the rooms and in the common areas.The staff is rude and quite inexperienced in customer service. The \"famous\" brunch was a total ripoff with a decent presentation and very substandard quality of food. they use the lowest quality of sparkling wine and call it \"champagne\"", "title": "no class whatsoever", "helpfulness": 1, "user": "DublinAmanda", "date": "September 8, 2008", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "location": 1.0, "rooms": 1.0}, "id": 19891533, "likes": {"liked": "— nothing", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "the hotel was closed for many years and has gone through many hardships and ownerships. they should have demolished this one ages ago! the lobby has a dismal dark and depressing aura . It also wreaks of mold and mildew.", "title": "Great Place!", "helpfulness": 2, "user": "aygen", "date": "August 19, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 3.0, "rooms": 5.0}, "id": 19114891, "likes": {"liked": "— Swimming Pool & Service", "disliked": "— Everything was good."}}, {"rating": 5.0, "title": "Our new \"home away from home\" in Miami", "text": "I suppose they are trying to live off of the hotel's history in its heyday but it doesnt work at all now. Its passe and outmoded and very offensive , especially the rude staff. i suppose if you speak cuban spanish you will be treated in a kinder way. hey, Thats miami", "helpfulness": 4, "user": "A TripAdvisor user", "date": "August 14, 2008", "id": 18962290}, {"rating": 2.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "We stayed at Biltmore just for one night as we returned from Grand Cayman to Frankfurt as stop-over in Miami. It was fantastic. Very beautiful room, great swimming-pool, very special atmosphere and fantastic service. We are looking for our next stay.", "title": "Disapionting", "helpfulness": 5, "user": "JoannLichfield", "date": "July 21, 2008", "detail_rating": {"front_desk": 2.0, "service": 4.0, "cleanliness": 3.0, "value": 2.0, "rooms": 4.0, "location": 4.0}, "id": 18093981, "likes": {"liked": "— Staircase and lift for this wing right into the reception area", "disliked": "— Having to walk through reception to get to pool"}}, {"rating": 5.0, "title": "Biltmore- a wonderful find", "text": "We recently visited South Florida on vacation and stayed at the Breakers in Palm Beach. It was a terrible experience so we checked out and went to the Biltmore in Coral Gables. Service was wonderful and the hotel is beautiful. Food and service were great. Nearby restaurants are great and we plan to return again and again.", "helpfulness": 1, "user": "Twofertheroad", "date": "May 4, 2008", "id": 15630505}, {"rating": 1.0, "stay_parameters": "Stayed February 2008, traveled on business", "text": "Staying here was very relaxing. The Staff was all freindly, unlike the Breakers where they were mostly rude.", "title": "Overrated and Poor Service", "helpfulness": 4, "user": "krmik", "date": "April 15, 2008", "detail_rating": {"front_desk": 3.0, "service": 1.0, "cleanliness": 2.0, "value": 1.0, "rooms": 1.0, "location": 1.0}, "id": 15069749, "likes": {"liked": "— Nothing", "disliked": "— Rude Employees"}}, {"rating": 4.0, "title": "Beautiful but wish .....", "text": "The only downside was the amount of pool chairs seems to be limited due to space. But, they really hustle and try to help.", "helpfulness": 1, "user": "ordnancehill", "date": "April 10, 2008", "id": 14942590}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "The room was very nice and configured with a separate room with a sofa and TV and a bedroom. Very nice.", "title": "Wonderful Property", "user": "ssource", "date": "April 6, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 4.0}, "id": 14829941}, {"rating": 5.0, "title": "Absolutely Beautiful", "text": "The gym is very nice.", "helpfulness": 1, "user": "maximizinglife", "date": "March 28, 2008", "id": 14592188}, {"rating": 2.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "My wife and I just finished a wonderful cruise an had booked a further 5 days at the Biltmore. The first problem was trying to get a cup of coffee. We went to the general restaurant and was told that it was being set for the evening we were directed by a rather offish hostess to \"the coffee shop\". This is only a shop to get coffee in a cardboeard cup to take away. when we asked where we could sit down and be served with coffee in a real cup , she was very rude and told us we could not get it. This is a 5 star hotel - one of the leading hotels in the world group. We then asked at front desk and again was told to go back to the Coffee Shop. when we said that we wanted just a cup of coffee. we were brushed off. We ended up in our room having to have room service. we booked dinner in the restaurant for the next night and was not asked whether we wanted to sit inside or on the terrace. When we arrived the next day, the hostess immediateley told us that outside was not available. when we queried why we were not given the opportuniity when we booked she just ignored our comment. Eventually a manager sympathised and offered us a complimentary brunch. When we went to check out- this Complimentary meal was charged at $165. I had to argue the point to ge it removed from the account. The bellmen, concierge and waiting staff were excellent but the other did not know how to communicate or look after their guests. The Swimming Pool is reknown to be the biggest in the USA - it is also the coldest. I wondered why it was so empty!!!.", "title": "living on a reputation", "helpfulness": 1, "user": "JONBAX", "date": "February 23, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 5.0, "value": 2.0, "rooms": 4.0, "location": 3.0}, "id": 13792371, "likes": {"liked": "— clean and spacious", "disliked": "— no safery rails in bathroom"}}, {"rating": 1.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "I've traveled the world and stayed at a number of 3,4, and 5 star hotels, and I've never had such a poor experience as I've had at the Biltmore.", "title": "5 Star Dump", "helpfulness": 2, "user": "apmfree", "date": "February 17, 2008", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 2.0, "value": 1.0, "location": 4.0, "rooms": 2.0}, "id": 13625702, "likes": {"liked": "— The architecture and the view", "disliked": "— The complete and utter lack of service and professionalism"}}, {"rating": 4.0, "title": "lovely hotel, beuatifully restored", "text": "When my wife and I first arrived at the hotel there was no bellman to take our luggage to our room + we had to wait 15 minutes on line (only 2 people ahead of us) just to check in.", "user": "efghij", "date": "February 15, 2008", "id": 13577396}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "We had the buffet breakfast the next morning and it was $25 per person for a very average buffet. The first was not fresh at all.", "title": "Excellant Hotel", "user": "Edward62", "date": "January 21, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 12856780, "likes": {"liked": "— Best of accomafdations", "disliked": "— everythig is expensive and extra"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "We had to call room service twice to request that they clean and service our room that day. In every other 5 star hotel I've been to they cleaned our room 2-3 times a day, and we never had to ask them to do it.", "title": "Gorgeous Property", "helpfulness": 2, "user": "H00fhearted", "date": "January 11, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 12536947, "likes": {"liked": "— Food and Beverage", "disliked": "— n/a"}}, {"rating": 5.0, "title": "Great place for a wedding", "text": "We stayed here for a wedding and had a great weekend. The service was excellent and we had a junior suite with plenty of room. The gym is a full service that is also used by locals with memberships. It is very big and has plenty of room to accommodate. There were numerous machines and also a free weight room. The pool looks great in pictures but even more spectacular in person. I also played the golf course and it was better than I expected.", "helpfulness": 1, "user": "fly23", "date": "July 20, 2008", "id": 18082218}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled on business", "text": "The Miracle Mile is only 5 minutes away so make sure and check out the restaurants and shops over there...There are a few really good bookstores to find something to read by the pool. Enjoy", "title": "The Best", "helpfulness": 5, "user": "tai", "date": "July 9, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 17706224, "likes": {"liked": "— Everything", "disliked": "— Can't really think of anything"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled on business", "text": "I stayed at the Biltmore from July 6-8. I am going to break down the review by categories.", "title": "Beautiful and classy hotel", "helpfulness": 1, "user": "CarolNYC74", "date": "June 30, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 17380665, "likes": {"liked": "— the room", "disliked": "— not very close to the beach"}}, {"rating": 3.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "Service- The service here is impeccable. Everyone from the bellmen, front desk, concierge, room attendants’ and pool staff. They delivered the best. I was a bit apprehensive at first but, these people are highly trained and can just pick up on stuff. For example, if you are a more laid back, down to earth person, they are very personable and joke around. I also, saw them deliver on the other end of the spectrum and were very professional in etiquette and demeanor.", "title": "Disappointing", "helpfulness": 4, "user": "Wobross", "date": "June 17, 2008", "detail_rating": {"cleanliness": 2.0, "front_desk": 3.0, "location": 4.0, "value": 2.0, "rooms": 5.0}, "id": 17006779, "likes": {"liked": "— The experience of staying in a historic architectural masterpiece", "disliked": "— The Junior Maitre'd in the restaurant"}}, {"rating": 4.0, "title": "Charming old hotel", "text": "I was out strolling the grounds one night with my one year old and we got caught in a rain shower. Magically, someone appeared with a towel for the little guy! It really was just a few sprinkles but, they were right there. They also brought up milk for him one evening. All of this without even being asked!", "user": "FrmNJ", "date": "May 10, 2008", "id": 15874814}], "location": {"country": "United States", "city": "Coral Gables"}, "stars": 4, "variance": {"poor": 39, "average": 66, "very good": 169, "terrible": 19, "excellent": 442}, "aka": "Biltmore Hotel Coral Gables", "slim_ranking": 0.0833333333333, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "The AAA Four Diamond Awarded hotel features 275 guest rooms including 130 spacious Mediterranean styled suites and two famed Presidential Suites, a Donald Ross 18 hole golf course, 10 lighted tennis courts, the signature Palme d’Or restaurant, Biltmore Spa, The Culinary Academy, 75,000 square feet of meeting and function space and is a preferred venue for notable high society events and weddings.The legendary Biltmore Hotel in Coral Gables has been a favorite of world leaders, celebrities, and sports stars since its opening in the 1920s. Offering much more than exceptional accommodations, the Biltmore Hotel showcases championship golf, cosmopolitan dining, a luxury spa and premier conference facilities, all while exceeding our refined guests’ expectations. Perhaps this is why we’ve remained Miami’s only four-star, four-diamond hotel for six consecutive years. Graced with natural elegance and sophistication, the Biltmore Hotel offers a stunning location in the exclusive Coral Gables area, minutes from South Beach, downtown Miami, Coconut Grove and the Coral Gables business district. Surround yourself by old world charm and beauty at the Biltmore Hotel."}