{"user_rating": 4.5, "review_count": 85, "name": "Biniarroca Hotel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "Just returned from a long weekend stay at Hotel Biniarroca and it has to be the best hotel stay we have ever experienced. The hotel was within 15 minutes transfer from the airport but we didn't see or hear an aircraft during the entire stay. The staff were thoughtful, friendly, helpful and cheerful and we would rate the whole service as 11/10. The food was excellent and well worth the cost. We read a few negitive comments before we went and we honestly don't know where they came from. If you are looking for a discreet, quiet, friendly, chill out place to stay to unwind and relax, this is the place to go. Know that it will be more expensive that your usual hotel and budget accordingly and you will enjoy the whole stay. Thank You Sheila, Lindsay, Alicia, Mati, John and all the staff at Biniarroca, we look forward to seeing you again very soon. Jon and Vicky - Room 8. PS. Try and get there for a Fiesta Weekend, it was truly a fantasic atmosphere in the Town.", "title": "A Truly Unforgettable Weekend", "user": "JonLaw3", "date": "July 26, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 72427945}, {"rating": 4.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "From front of house to restaurant staff , everyone was kind, thoughtful and friendly. They were all very efficient. The hotel is well appointed and the pool area and gardens are beautiful. Very tranquil and peaceful.", "title": "Gorgeous!!!! Capital G!!!", "user": "sunlover21London", "date": "July 6, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 69860120}, {"rating": 3.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "We will return as soon as we can", "title": "Clearly overated", "helpfulness": 2, "user": "benaro", "date": "June 30, 2010", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 3.0, "sleep": 1.0, "rooms": 2.0, "location": 3.0}, "id": 69166375}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "The best 3 things about this hotel : the pool, the garden and the friendliness of the restaurant staff.", "title": "Wow Fantastic would go back tomorrow !!", "user": "woody4london", "date": "June 19, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 67999718}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "The negative : total lack of experience and service at the front desk, quite far from the hidden beaches of the island ( especially valid in mid to high season ). Count on 30 to 40mn drive + 15 to 30mn walking to reach a beautiful beach without too much crowd. The restaurant of the hotel which they present as one of the best option of the island is just average and pretty expensive. You'll need to take the car and drive 10mn to find another option. Room decoration is really old school ( pastels, flowers ).", "title": "A relaxing hotel with wonderful staff and gorgeous food", "user": "ZoomLensNorfolkUK", "date": "August 5, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 36818308}, {"rating": 3.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "Excellent staff, lovely pools,first class meals and breakfast.", "title": "Lovely but overpriced", "helpfulness": 2, "user": "bigmacdonald", "date": "July 13, 2009", "detail_rating": {"cleanliness": 5.0, "value": 2.0, "location": 4.0, "service": 4.0, "rooms": 3.0}, "id": 34639646}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "Rooms spoil everything else as they are rather dark,not well appointed and our room smelt musty. Air conditioned but no fan, we had an outside terrace, but considering it was euros. 220 per night, b & b, very overpriced.Also quite a way to the beach.", "title": "A charming mix of nationalies", "helpfulness": 1, "user": "nicolalondon91", "date": "July 12, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 17807701, "likes": {"liked": "— the staff , gardens, and restaurant", "disliked": "— nothing"}}, {"rating": 4.0, "title": "Good Choice in Menorca", "text": "recommend the following restaurant.....", "helpfulness": 1, "user": "islandboi", "date": "July 10, 2008", "id": 17761978}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "1.Pan y Vino.near to hotel, 5 minutes drive. first class food, lovely terraces. French chef.", "title": "Peaceful Haven", "user": "RedlynchSunseeker", "date": "July 10, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 4.0}, "id": 17739481, "likes": {"liked": "— Peacefullness", "disliked": "— Room furnishings rather basic"}}, {"rating": 3.0, "title": "Nice place, but a better option is nearby", "text": "Also ate at Villa Madrid, an italian restaurant, but did not enjoy the food and overpriced except for the pizzas.", "helpfulness": 5, "user": "Peter&Gail", "date": "May 13, 2008", "id": 16004080}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "Lovely country house with attractive interiors and super garden and pool. We stayed two nights in a pretty room with a comfortable bed.situated on the ground floor; we also had an almost private terrace. Breakfast was good and all the staff we met very friendly and helpful. The restaurant was only open to residents, with a restricted menu which seemed aimed at the British palate. The lamb cultets were dry through being overcooked and covered in some sort of breadcrumbs - there was no jus , our nice head waiter did find some when asked. The boeuf bourguignonne (why in Spain?) was missing baby onions, bacon lardons and garlic! At over 30 euros for two courses, seriously overpriced and a disappointment. On our second night we went to the Sa Pedrera d'Pujol in the little village of Torrett, just outside Sant Lluis. Excellent 30 Euro menu with fine Minorcan cooking.", "title": "The hotel ticked all the boxes but the restaurant was disappointing.", "helpfulness": 1, "user": "Maisie33", "date": "October 19, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 84108598}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "We would return as the Biniarroca makes a fine B&B, and this we would be happy to recommend.", "title": "Great Relaxation", "helpfulness": 1, "user": "shuttleworth_10", "date": "October 11, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 83005733}, {"rating": 2.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "Stayed here for four nights at the end of September and really enjoyed the experience. Simple but very comfortable bedroom totally in keeping with the country style of Biniarroca. Ate dinner the first night, good food and wine with excellent service. Lovely breakfast with great service. The gardens are really beautiful and lots of cosy corners to relax in. A great stay and will certainly return.", "title": "Truly excellent staff but that's about it", "helpfulness": 3, "user": "Roaming1Rosie", "date": "October 9, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 2.0, "sleep": 1.0, "rooms": 1.0, "location": 3.0}, "id": 82696656}, {"rating": 3.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "The whole team at the Bianirroca are wonderful and genuine and could not do enough for us which really made our stay. (I wanted to leave after the second night)", "title": "Over rated", "helpfulness": 2, "user": "jlh201084", "date": "September 26, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 2.0}, "id": 81101755}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "Breakfast was mediocre at best. Freshly cooked eggs, Menorcan cheese and meats and some cake was really about it.", "title": "A Perfect Minorcan Rural Escape", "user": "TiggyWalker", "date": "September 17, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 79891201}, {"rating": 3.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "Writing a review like this is challenging because the Biniarroca is truly a charming, beautiful hotel, the staff are lovely, etc etc. so I'm hesitant to be too harsh. But suffice it to say, this hotel was just not for us, at least not at the prices we were paying (bear in mind the current euro to dollar difference...).", "title": "Not our cup of tea", "helpfulness": 9, "user": "LJWNYC2008", "date": "July 19, 2011", "detail_rating": {"cleanliness": 2.0, "sleep": 2.0, "value": 2.0, "service": 3.0}, "id": 115548358}, {"rating": 5.0, "stay_parameters": "Stayed July 2011", "text": "In a nutshell, per the other reviews, this is a romantic country inn - beautiful carved wood furniture and artwork all around, a lovely pool and gardens filled with amazing flowers, a great restaurant, overall a very relaxing environment.", "title": "Complete relaxation and amazing restaurant for dinner.", "user": "TravelChica101", "date": "July 12, 2011", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 115293511}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled with friends", "text": "However, with that came a variety of things that bothered us. For starters, the air conditioning in our room didn't work - we were told the first day someone was coming to fix it, but it appeared that the \"fix\" was unsuccessful because our room was hot. The staff ended up loaning us a fan, which was nice, but we would have preferred air conditioning, as promised (no one ever addressed this either, by the way). The room was also a little rickety - not spic and span, but really that of a country inn. So if that's your thing, it might not be an issue. For us, it was kind of an issue, particularly the um.... stained sheets that appeared on our bed the third night we were there (which I ended up changing myself, with the help of one of the waiters because the cleaning staff had left for the day. The waiter was very nice about it, but the fact I had to even raise the point that the sheets were stained and then change them myself was kind of adding insult to injury - especially for the price we were paying. And no one ever said a word to me about it afterwards, which I would have appreciated). Little country bugs abound, towels were a bit threadbare and we actually had to pay extra for beach towels (the sand created an issue with the washing machines or something).", "title": "Rural hotel oozing with charm", "helpfulness": 1, "user": "TerenceS", "date": "May 4, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 106837165}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "So, all in all, although this was a nice experience, that's about all it was to US. However, I suspect that other people would overlook much of this and really enjoy the place. My husband and I are city people and like clean, efficient, and \"minimalistically luxurious\" (if that makes any sense!). This was one hotel that did not provide us with that kind of experience.", "title": "This small hotel is simply inspirational", "helpfulness": 3, "user": "jaycee022", "date": "October 30, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 85333378}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "This hotel is a converted farmhouse and is set in a very quiet location. You would need to hire a car to expire, although we hired mountain bikes instead which was a great way to explore the island and it's beaches!", "title": "If this is not perfection, it resembles it to an uncanny degree.", "helpfulness": 1, "user": "Antipasto", "date": "October 29, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 85289804}], "location": {"country": "Spain", "continent": "Europe"}, "stars": 3.5, "variance": {"poor": 3, "average": 8, "very good": 10, "terrible": 2, "excellent": 62}, "aka": "Biniarroca Hotel Sant Lluis Es", "slim_ranking": 0.25, "description": "Biniarroca is a small stylish boutique hotel, just outside the village of Sant LLuis on the island of Menorca. An oasis of calm, wellbeing and rejuvenation. Extensive gardens, 2 swimming pools and lime stone terraces encourage a relaxing environment to chill out, meditate, paint, write or to simply indulge in delicious cuisine and fine wines in beautiful surroundings. This hotel promotes an adults only environment."}