{"user_rating": 3.5, "review_count": 168, "name": "Birnam Hotel", "reviews": [{"rating": 5.0, "title": "Delicious food and laughter!!", "text": "After visiting the Explorers Gardens in Pitlochry our bus trip ended here at the Birnham Hotel for high tea, which was served in the magnificent Baronial Hall. The food was delicious and the selection of home made cake, scones and shortbread to finish off was mouthwatering.", "user": "megatom", "date": "June 20, 2012", "id": 132395481}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled with friends", "text": "A big thank you to our waitress Margaret and Robin who provided the best laughs of the evening with their ongoing banter.at our table. A very enjoyable evening .", "title": "High tea at Birnam", "helpfulness": 1, "user": "DrSmart", "date": "June 17, 2012", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0}, "id": 132180980}, {"rating": 3.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "We called in there for a booked high tea as a bus group after a day at Pitlochry The hotel and surroundings are magnificent after a refurbishment The staff very friendly, efficient and service good Everyone in the group enjoyed the experience. I will be returning with my wife", "title": "Not a peaceful night", "user": "Lexma90", "date": "June 12, 2012", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 3.0, "sleep": 1.0, "rooms": 3.0, "location": 4.0}, "id": 131858650}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "We (family of 4) ended up with a one-night stay because the hotel that we originally booked sent me an email one week before our arrival date, saying that our reserved rooms would not be completely renovated, and so they had booked us at the Birnam Hotel, 1/2 mile away from the original hotel.", "title": "Very traditional", "helpfulness": 2, "user": "wendy1777", "date": "June 6, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 131418940}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "We checked in to the Birnam Hotel and were given two rooms on the second floor, one facing the front of the hotel, and one in the wing to the side.", "title": "Great value hotel in a great location", "user": "David H", "date": "May 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130914997}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "Stayed here for a night on our way north . Staff were friendly and helpful. We had a superior room( upgraded by a very friendly guy who booked us in) which was roomy and comfortable with wonderful views. Breakfast was freshly prepared and served piping hot by a lovely lady. Overall a very enjoyable stay an would certainly visit again", "title": "friendly staff and a great breakfast", "user": "fridgetravels", "date": "April 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 127545033}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled with friends", "text": "Our party of 4 enjoyed a great weekend at Birnam Hotel a mixture of traditional scottish accommodation and modern decor. The stay was enhanced by the relaxed friendly staff could not do enough for us. Especially Margaret who served professionally with a smile, unique sense of humour which entertained us as we dined.", "title": "Geat weekend", "user": "amb100000", "date": "March 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 125937696}, {"rating": 2.0, "title": "Birnham Hotel", "text": "We spent £80 on a double room and breakfast for two last Friday (February 18th). It was cold outside and the room was underheated and the carpet rather mangy. While the accommodation was fairly acceptable for a hotel of this standard the cooked breakfast was one of the worst I have ever tasted. Only a Caledonian McBrayne ferry cooked breakfast was worse than this!! The eggs were like greasy bits of rubber, the black puddings flavourless and inedible, the \"grilled\" tomato was simply half a raw tomato and what they had done with the mushrooms I have no idea but they were dire. We left most of it.. At £80 an underheated room and a lousy breakfast is very poor value compared with the average B&B. We won't be back.", "helpfulness": 2, "user": "drumminor", "date": "February 20, 2012", "id": 124925657}, {"rating": 2.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "I spent a night with my partner in this hotel which was lovely unil we went for dinner in the italian which to say was a disgrace was an understatement .. We ordered half pizza and half pasta and the waiter didn't no what that meant ? We ordered king prawn pasta whilst starting to eat all the prawns were still in the shells this was not made clear on the menu and was an instant put off .. The staff on that evening were not equipped to dealing with good customer service. We did complain and the manager wrote me an email of apology the next day !!!", "title": "Food and service in the Italian restaurant", "user": "SMCrosby21", "date": "February 20, 2012", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 124861601}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled with family", "text": "We had a short break with family for two nights dinner bed and breakfast.Two of the family were in their nineties.Duty manager and all staff were very helpful both at the hotel and in making arrangements prior to booking. Very comfortable stay food was excelllent Nothing seemed to be a bother to anyone would recommend and would return again if opportunity arose.", "title": "Nice Break", "helpfulness": 1, "user": "mary c", "date": "February 20, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 124855033}, {"rating": 4.0, "title": "Very nice traditional hotel. Great staff", "text": "Location: perfect. Opposite station and less than 10 mins walk to Dunkeld", "helpfulness": 1, "user": "AllanBLondon", "date": "July 8, 2012", "id": 133758168}, {"rating": 3.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "Decor: traditional and pleasant. Lovely big sofas in lobby. Nice bar.", "title": "A pleasant Hotel", "user": "DeeMarshian", "date": "July 4, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 133440170}, {"rating": 2.0, "title": "Set in the dark ages", "text": "Rooms: spacious. Not gorgeous but traditional and comfy. Bathroom was a bit basic and they did not supply toiletries.", "user": "DrP_DrJ", "date": "June 30, 2012", "id": 133084836}, {"rating": 5.0, "stay_parameters": "Stayed June 2012", "text": "Staff: fantastic, especially the lady who serves breakfast. She was hilarious. I want her to be my Scotish Mum.", "title": "Perfect weekend", "user": "Pudz15", "date": "June 29, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 133062561}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "Food: breakfast hearty, plenty of choice of hot breakfasts to order. Had one evening meal which was lovely.", "title": "nothing much to moan about", "helpfulness": 1, "user": "folkie40", "date": "June 24, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 132648089}, {"rating": 2.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "We stayed at the Birnam Hotel after attending a wedding at the Hilton Dunkeld, the HIlton were fully booked and so had to book elsewhere. The Birnam had decent photos on their website of bedrooms and thought this would be a good/comfortable place to stay...they must have been well taken photographs as what we experienced was the complete opposite!! The room we were checked into was tiny with an extremely creaky and noisy door, the bathroom had a toilet and a bath with a shower attached to the taps and no shower holder, therefore, having a shower meant you had to hold the shower head and there was also no shower curtain. I placed a towel on the floor to dry up the water and when picked it up off the floor saw that it was covered in dirt from the floor. It was nothing short of disgusting, the floor obviously hadn't been washed in quite a while! The sink was in the bedroom which was a bit strange and the fan didn't work in the bathroom, there was also no window. The only amenities in the bathroom was a half full bottle of shower gel.", "title": "Much less than acceptable!", "helpfulness": 1, "user": "Sarah-Jane S", "date": "May 28, 2012", "detail_rating": {"service": 2.0, "cleanliness": 1.0, "value": 1.0, "sleep": 3.0, "rooms": 1.0, "location": 4.0}, "id": 130799622}, {"rating": 1.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "The magazines in the bedside drawer were from 2010 and 2011, not sure the last time it was checked..??!", "title": "OMG! WHAT A DUMP! MY POOR ELDERLY MOTHER!", "user": "CHRISTINE J", "date": "May 25, 2012", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 1.0}, "id": 130605812}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "The cost of the room was £89BB which for what we experienced was ridiculously over priced, there was also an additional supplement of £2.75 for ordering scrambled eggs and smoked salmon for breakfast, we couldn't help feeling at this point that we were being totally ripped off.", "title": "Mostly good!", "user": "kaybee210", "date": "May 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 130415070}, {"rating": 4.0, "title": "Good food in pleasant hotel", "text": "Whilst we were at the wedding we spoke to another guest who said she had checked into the Birnam and checked out again straight away as the room was like a box room and very out of date. We at this point, had not checked into the hotel and thought it was an exaggeration, we soon realised it wasn't far from the truth!!", "user": "Mark G", "date": "May 11, 2012", "id": 129782747}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "Don't go to this hotel unless you want to feel totally degraded, they charged around £85 for a dump of a small room with woodchip paper, damp walls , dirty toilet, old painted over furniture that is scratched and damaged, beds that do Not have mattress covers on and sheets that are for a single bed rather than a double bed , my poor mother was so tired at 83 years old having travelled to this hotel to be told a lot of [--] lies regards the rooms we were given, we asked for a sheet that fitted the mattress as my mother could not sleep on a bare mattress , it was disgusting, the mirror on the dressing table was all full of brown stains, not sure what that was, the room was depressing and drab and needed totally refurbished, both rooms actually, an old sink was in the room with a cupboard underneath, annie oatcake days in there, i'd say!, the curtains next to the sink were all stained from someone brushing teeth perhaps or washing in the little sink, near electrical appliances too, mmmmhhh?!!, one for the safety books, no food in the evening to eat in hotel and we were told that dunkeld doesn't have any food shops open there either on the main drag, what a dead town we saw, the carpets were mangy, and beware the tiny old lift with the old fashioned double cage doors, you just might go through the ceiling when it stops, what a joke, it could have been a lovely hotel too, very deceiving from the outside, i must say, we had to drive all the way back home, only to dundee i am glad to say but with an 83 year old who was supposed to have her special weekend there ,i wouldn't let my dogs stay there and will be passing this on to health and safety etc. etc. they even had a cheek to keep my £50 deposit and to ask me for money for the room when i said i was leaving as we hadn't actually occupied it , the duty manager had to keep phoning the general manger at his home at 11.00pm at night , yesterday the 25th may, he couldn't deal with it properly either, what a nightmare, please give this one a skip!, you'll be glad you did!", "title": "Great Scottish Breakfasts!", "user": "Diane S", "date": "April 29, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 129059571}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "variance": {"poor": 20, "average": 26, "very good": 54, "terrible": 21, "excellent": 47}, "aka": "Birnam Hotel Scotland", "slim_ranking": 0.8, "description": "Style,elegance and good old-fashioned Scottish hospitality is what the newly upgraded Birnam Hotel is all about. Located in the stunning Perthshire countryside in the heart of Scotland, the Birnam Hotel is the ideal location. It is well renowned for hosting weddings and large functions in the magnificent Baronial Hall and smaller functions in its many other suites - the Birnam Hotel has it all. A truly warm welcome awaits you at the Birnam Hotel."}