{"review_count": 56, "slim_ranking": 5.0, "name": "Bistro at Mansfield Hotel", "reviews": [{"rating": 2.0, "title": "Poor Service", "text": "The service and attitude of staff was deplorable. Food was great but some staff were obviously not into serving customers. One in particular was off with the fairies making mistakes which duly led to rudeness", "user": "chris c", "date": "September 25, 2012", "id": 141287614}, {"rating": 5.0, "title": "Wow Great food and service", "text": "Came here exhausted after a day at Mansfield zoo. Staff could see that my kids were tired and went out of their way to see that they had their meals quickly. Great meals and big serves. Love being able to get vegies with kids meals.", "user": "wokzeds", "date": "September 24, 2012", "detail_rating": {"value": 5.0, "service": 5.0}, "id": 141074387}, {"rating": 4.0, "title": "Good pub meal", "text": "Kids on the table next to us had the kuds steak on hot stone. Great idea for older kids.", "helpfulness": 1, "user": "garoni5", "date": "September 23, 2012", "id": 140987800}, {"rating": 4.0, "title": "Good Pub Bistro", "text": "Unfortunately on other night we made the mistake of going to the Delatite Hotel. Rookie mistake. This was hands down the better pub for families.", "user": "alanloy", "date": "August 20, 2012", "id": 137830816}, {"rating": 3.0, "stay_parameters": "Visited July 2012", "text": "We sat outside and enjoyed the sunshine. Meals were very nice but did take there time for fish and chips and salad, and not very many customers either. But a good pub meal.", "title": "Early Dinner with the Family.... they weren't ready for us...", "user": "Heath71Hampton", "date": "August 3, 2012", "detail_rating": {"value": 2.0, "service": 3.0}, "id": 136108435}, {"rating": 5.0, "title": "Best Steak I have ever eaten", "text": "Been to this hotel for dinner twice now and both times one year apart and both times neer failed to please. Fantastic back garden area under the shady trees. Terrific on a hot night in Mansfield's summer. Well done.", "user": "wanderlustLangwarrin", "date": "February 7, 2013", "id": 151632167}, {"rating": 5.0, "title": "Great Tucker", "text": "Good Menu selection. Meals were a good size and reasonably priced. Large Dining area with comfortable seating. Wine selection is small but good quality.", "user": "Tony and Denise G", "date": "January 30, 2013", "id": 151058299}, {"rating": 5.0, "title": "great food", "text": "service was awesome, food was awesome, great menu for adults and children. we will certainly go back there!!!", "user": "Bronwyn B", "date": "January 29, 2013", "id": 150903431}, {"rating": 4.0, "title": "Great food, average service, good atmosphere!", "text": "The food was served within 20 min for our group of 10. The food was excellent and the portions generous. Great family restaurant.", "user": "DrKeith888", "date": "January 24, 2013", "detail_rating": {"value": 3.0, "service": 3.0}, "id": 150469861}, {"rating": 4.0, "stay_parameters": "Visited December 2012", "text": "This is a little find in a country town. You have to brave the bar to get through to the lovely and spacious bistro out the back, but go out to the courtyard - it is just lovely. Service is very good, food of a very high quality and prices are average / reasonable. A nice place to while away an evening.", "title": "Excellent Courtyard Dining.", "user": "AALtravelbuddy", "date": "December 11, 2012", "detail_rating": {"value": 4.0, "service": 4.0}, "id": 147263391}, {"rating": 5.0, "title": "Best steak experience", "text": "The stone cooking steak is impossible to beat. This experience is where the raw steak arrives in front of you on an extremely hot granite stone and you then slice it up and cook it on the stone in front of you. Just a great experience overall", "user": "Matt E", "date": "November 26, 2012", "id": 146189349}, {"rating": 4.0, "title": "Fantastic food and relaxing atmosphere :)", "text": "Food and atmosphere was FANTASTIC, but the service needs to be improved. Waitresses could do with some better training.", "user": "Kelly R", "date": "November 19, 2012", "id": 145778087}, {"rating": 4.0, "title": "Good food", "text": "The food was nice. It was delivered promptly. The seating area was nice and there was a fire as well.", "user": "D8andS7", "date": "October 28, 2012", "id": 143888558}, {"rating": 5.0, "stay_parameters": "Visited October 2012", "text": "So we just recently came back from a day at the mountain and had some ripper cob loaf. It was a good environment too, the hot waitress was just letting the g-banger hang out, at lot of staring was had by all. We would go back for her xox", "title": "Good bread, good women", "user": "Sam C", "date": "October 1, 2012", "detail_rating": {"value": 5.0, "service": 5.0}, "id": 141796443}, {"rating": 5.0, "stay_parameters": "Visited September 2012", "text": "We ate here as a family of four and were blown away by the terrific food and service. The food was fantastic and reasonably priced, if we had of been in Mansfield another night we would have returned.", "title": "Fantastic", "user": "DenEli", "date": "September 29, 2012", "detail_rating": {"value": 5.0, "service": 5.0}, "id": 141561398}, {"rating": 2.0, "title": "Pretty good food, poor service", "text": "I had dinner on a week night. It was prompt to be seated. Modern deco with a big fireplace that makes you feel comfy.", "user": "kyingl", "date": "July 10, 2012", "detail_rating": {"value": 3.0, "service": 1.0}, "id": 134003540}, {"rating": 4.0, "title": "A hearty meal...", "text": "Food was pretty good but my companions and I waited for 40 minutes upon ordering for our meals. So we asked a waitress to check. She said it will be a few minutes away. As we waited for about one hour, we spoke to the supervisor / manager, she firstly walked off, then went back to the counter again and said \"we are busy\" without any indication of how much longer we needed to wait or apology.", "user": "Michael2810", "date": "May 28, 2012", "detail_rating": {"value": 4.0, "service": 4.0}, "id": 130762859}, {"rating": 4.0, "title": "Lovely meal", "text": "I think that you will agree that waiting for 1 hour for simple pasta dishes and pizzas is NOT acceptable. The pub across the road has better service and food is not bad.", "user": "Terry B", "date": "April 30, 2012", "id": 129079528}, {"rating": 5.0, "title": "Good food", "text": "I ate dinner here twice whilst in the area on a business trip. The Bistro area is large and I imagine during winter it gets quite busy but when I was there it was reasonably quiet. The menu caters for all tastes, has a good range of kids meals and it's own wood fired pizza oven. The servings are generous and the taste, whilst nothing to get too excited about, was palatable. A hearty country pub meal.", "user": "PammyNelson", "date": "March 25, 2012", "id": 126651931}, {"rating": 1.0, "title": "Mansfield Hotel", "text": "They organised a table for 12 with out any problems and not a complaint from any on the table as far as our meals went", "user": "Chris L", "date": "March 25, 2012", "id": 126619204}], "location": {"country": "Australia", "continent": "South Pacific"}, "variance": {"poor": 2, "average": 7, "very good": 24, "terrible": 4, "excellent": 19}}