{"review_count": 91, "slim_ranking": 59.0, "name": "Bistro La Grenouille - Hotel L'Absinthe", "reviews": [{"rating": 1.0, "title": "Your basic tourist trap", "text": "Too many customers, too few staff, mediocre food. But what do you expect when you have a view of a French chip truck, and 200 tourists crammed in the restaiurant? It is a step above McDonalds, and shame on the local that recommended we visit it. Ok for a 15 Euro mussels and frites lunch, but do not even consider going here for dinner unless you prefer the wail of young children to music.", "helpfulness": 1, "user": "traveltoomuchToronto", "date": "August 20, 2011", "id": 117002242}, {"rating": 3.0, "stay_parameters": "Visited May 2011", "text": "Skip it, go to L'Endroit...", "title": "Wonderful service - OK food", "user": "aejgvancouver", "date": "May 26, 2011", "detail_rating": {"value": 3.0, "service": 5.0}, "id": 109955648}, {"rating": 3.0, "stay_parameters": "Visited May 2011", "text": "We had a very memorable meal at la Grenouille because our waiter was so wonderful that we hardly noticed the food! He was attentive, engaging and chatty with us even though our French is not great - we really felt like we got to experience a bit of authentic Norman culture. The food was just OK - not bad, not great.", "title": "Not as good as you would hope for in France", "user": "Malbear", "date": "May 26, 2011", "detail_rating": {"value": 3.0, "service": 4.0}, "id": 109917068}, {"rating": 5.0, "title": "A wonderful evening, fantastic food beautifully presented.", "text": "This is a very pleasant room in a wonderful waterside location. The staff are friendly and helpful and the prices were reasonable. However the food was variable - excellent soupe de poissons but maigret de canard was tough though the sauce was great. My companion had cod which he thought was tasteless. We had a side order of French fries and they were the best I have had anywhere. I ended with a very good cheese plate.", "user": "gerryshut", "date": "September 16, 2010", "id": 79798303}, {"rating": 2.0, "title": "We were very dissapointed with this place.", "text": "Fantastic food, reasonably priced and beautifully presented. Very helpful to meet the needs of a member of our party on a strict regime for a medical condition.", "helpfulness": 1, "user": "ERLNewYorkandtheUK", "date": "January 25, 2010", "detail_rating": {"value": 2.0, "service": 1.0}, "id": 54310023}], "location": {"country": "France", "region": "Normandy", "continent": "Europe"}, "variance": {"poor": 11, "average": 22, "very good": 40, "terrible": 7, "excellent": 11}}