{"user_rating": 5.0, "review_count": 89, "name": "Blackberry Glen Bed & Breakfast", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed August 2011", "text": "Beautiful property, friendly and helpful hosts, well appointed rooms, and great breakfasts. This B&B has the advantage of being outside of the main town (Ganges), but no more than than 5 minutes away by car. It's on a beautiful tract of land with a pond, geese, ducks, and deer, equipped with multiple outdoor decks with comfortable furniture and places to enjoy the view, sun and stars. The rooms are well conceived and the bedding is high quality and extremely comfortable. Jason and John are gems as hosts.", "title": "Wonderful B&B", "user": "Coolcoops", "date": "August 10, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 116503258}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "My wife, girls aged 14 & 13 and I had a thoroughly enjoyable 2 night stay at Blackberry Glen. Jason gave us a very warm welcome and thorough recommendations for places to eat and things to do, all of which were really helpful and accurate. We had two adjacent rooms (Vesuvius and the Long Harbour Suite) which were beautifully finished and decorated and very spacious. We enjoyed playing chess using the glass set outside and using the hot tub. Breakfast was superb. We had to leave early on our last morning and John and Jason kindly prepared the most delicious breakfast for us to take away. We very strongly recommend this B&B.", "title": "This is a first class B&B", "helpfulness": 1, "user": "Andrew M", "date": "July 30, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116028305}, {"rating": 5.0, "stay_parameters": "Stayed July 2011", "text": "My wife and I stayed at Blackberry Glen this last weekend and had the best time for our first trip to Saltspring Island.", "title": "Its #1 for a reason.", "helpfulness": 1, "user": "scoobydooby11", "date": "July 28, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 115941612}, {"rating": 5.0, "title": "convenient and loveley", "text": "The property was just beautiful. nice grass and flowers, tucked away amidst the trees with a couple lovely ponds complete with ducks and geese. You can really tell that a lot of work goes into keeping it all looking neat and tidy.", "helpfulness": 1, "user": "mturnock", "date": "July 7, 2011", "id": 115129541}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "The house is so charming.. a great mix of old and new from the decor and furniture. just walking through the door gives you this eeling like youre at home. Every last detail was looked into to make it pretty and comfortable and unique all at the same time.", "title": "THE best breakfast I have ever eaten in a B & B", "helpfulness": 1, "user": "Setab_E", "date": "July 5, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115034909}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled on business", "text": "Jason and John were welcoming hosts and provided a relaxed atmosphere for our stay. Our suite was absolutely lovely, with nice attention to detail, such as a terrific coffee nook with delicious baked snacks and a huge selection of DVD's for those misty winter evenings on the Gulf Islands. En-suite washroom and tub were much appreciated and hut tubbing under the stars is a must! The Blackberry Glen property was very extensive, with a pond and the odd deer running about. Breakfast was delicious, and we especially enjoyed the baked oatmeal and waffles!", "title": "Spoiled on Salt Spring Island", "user": "JossRhinestone", "date": "March 14, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 100171685}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "Blackberry Glen offers a quiet and private getaway destination in the woods, complete with comfortable beds/rooms, refreshment area, generous breakfast and of course gracious hospitality. Hosts Jason and John made us feel very welcome in their home. We especially enjoyed the freshly-made apple juice!", "title": "Relax in comfort and privacy at Blackberry Glen!", "user": "greenever", "date": "December 1, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 88798780}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "This was our second trip to Jason and John's place after a one night visit in August and decided we had to come back. Their house is charming and beautifully furnished, with nice rooms and a great deck and hot tub. Our hosts were friendly and from the freshly baked cookies and tea on arrival to the fantastic breakfasts to their recommendations for dinner and sightseeing, there is no better place to stay on the island.", "title": "Consistently Fantastic, second to none!", "user": "FreoCanuck", "date": "October 31, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 85501635}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "We chose to stay at Blackberry Glen after finding it here on TripAdvisor. It's ideally located near the Long Harbour ferry and downtown Ganges. The home is charming from top to bottom, with tasteful decor and thoughtful touches. Our hosts provided excellent guidance regarding things to do and see on Salt Spring Island. Breakfasts were fantastic-- with local, fresh fruit daily and dishes ranging from pancakes, to baked oatmeal, to homemade quiche. Thanks, Jason and John, for a great bed and breakfast experience! We'll be back.", "title": "Charming home. Fantastic hosts. Great breakfasts.", "helpfulness": 1, "user": "Aaron_and_Diana", "date": "October 17, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 83881521}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "This place is AMAZING! John and Jason are fantastic hosts! The trip was for my partners birthday and they did anything and everything to make it special. They even went and bought a cake for him and brought it out a breakfast! We came without a car and they gave us several rides to the city and golf course. I would go back there in a heartbeat! Great food (24hr cookies and coffee too), great rooms/hot tub, and one of the cleanest B&B I have ever seen! Thanks guys!", "title": "Favorite B&B!!!", "user": "kingstonsqueen", "date": "October 14, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 83491223}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "We really enjoyed our stay here. Jason and John are great hosts, and know a lot about what's happening in the arts scene on the island. We stayed in the Long Harbour Suite -- huge room, with comfy couch and table, and its own private balcony. Breakfasts are great -- fruit, coffee, juice, and then something cooked, often using produce of the garden or duck eggs laid by the ducks kept on the property. Frogs and owls at night, deer during the day, and Albert the goose is always on the prowl. The B&B is very clean, and five minutes from the Long Harbour ferry. Highly recommended.", "title": "Home Away From Home", "user": "Philip6262", "date": "May 29, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 110371912}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "The wife and I cannot stop raving about the enthusiastic hospitality during our stay a couple of weekends back. It was our first time on Saltspring, and Jason and John's tips really saved us a lot of time and made our trip so much better.", "title": "A Truly Remarkable Experience", "helpfulness": 1, "user": "DigitalGrit", "date": "May 17, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 108676609}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "We've travelled much of the world, and rarely does one find accommodations where not only are the facilities well-appointed and immaculate, but the hosts are gracious, warm, and so extremely helpful. It doesn't hurt that they are amazing cooks! Breakfast was a delight every morning. Fresh goose eggs, rich/decadent fruit crumbles, incredible quiche, and great conversation. The special touch of fresh-baked cookies when we arrived made us feel all warm inside (try getting that at a Hilton!).", "title": "Wonderful Stay!", "user": "travellingchick3", "date": "May 16, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 108512633}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled on business", "text": "Snuggled in a quiet little valley only a few minutes out of Ganges (the main town and cultural center on the island), and only about 2min from the ferry back to the Mainland/Tsawassen, this place is a real experience. Not bearing the commercial brashness of some facilities, it is unique, immaculately cared for, clean, and very comfy. The gardens catch your eye, and the pet geese and ducks keep you entertained - when there isn't anything else going on.", "title": "A beautiful spot to relax.", "user": "eastvanbob", "date": "March 21, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 101008592}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "Jason and John are amazing hosts. Friendly and helpful, but beyond that, making you welcome in their home. The wife and I are expecting our first child, and we thought a little quiet get-away would be ideal just a couple of months before our little one is due. We left Blackberry Glen completely regenerated, revived, and relaxed.", "title": "A piece of heaven on beautiful Salt Spring", "user": "Wuzzo1", "date": "March 17, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 100553921}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "My wife and I spent a pleasant two nights at the Blackberry hosted by John and Jason. We found the hospitality just great and the place was quiet and comfortable. We chose the Fulford Room which was spacious and airy with an excellent bed. Our hosts provided insights into places to visit and hike and we enjoyed our birding interest in a number of parks around the island. The property contains a couple of ponds and was an interesting place to walk with binoculars in the morning yielding quite a variety of species including Wilson's Warbler, Red-breasted Sapsucker and Violet-green Swallow. Breakfasts were filling and the company was interesting each morning. All in all, a great place to visit. Take advantage of the hot tub!", "title": "Birding Saltspring Island", "helpfulness": 1, "user": "SueAlberta", "date": "June 26, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 114775617}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "My partner and I have had some patchy B&B stays in the past so I get a little nervous whenever I book one for us, but Blackberry Glen was great. The hosts are super friendly and gracious, the house and grounds are gorgeous and the amenities are outstanding! Little details like fresh cookies, makeup remover in the bathroom, and extremely entertaining ducks wandering around the pond made it the experience that much more special. Thank you, Jason and John.", "title": "A perfect B&B experience", "helpfulness": 1, "user": "NoMoreSnuggles", "date": "June 26, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 5.0, "service": 5.0}, "id": 114761247}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "I hate to rave too much as guests will come here with unreal expectations, however John and Jason's B&B did deliver. We thoroughly enjoyed the gourmet breakfasts, the scenic views, the fresh baking, coffee and teas available in the lounge, the cozy living room where we could visit with fellow guests, the duck/geese family, and the comfy beds. Our hosts' knowledge of local hikes, restaurants, and activities was impressive.", "title": "Truly Excellent", "helpfulness": 1, "user": "cahill303", "date": "June 21, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 114609404}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "Thank you both very much!", "title": "Perfect", "user": "Fireweed_Crocus", "date": "June 3, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 111211725}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled on business", "text": "Homemade baking, chocolates, hot tub, gorgeous yard, impeccable breakfast, clean and beautiful rooms, comfortable beds, and of course, friendly and gracious hosts. This place has everything you need to enjoy Salt Spring Island to its fullest.", "title": "We echo the experiences of other happy guests", "user": "Norman F", "date": "May 30, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 110454652}], "location": {"country": "Canada"}, "variance": {"poor": 0, "average": 0, "very good": 2, "terrible": 1, "excellent": 86}, "slim_ranking": 0.0576923076923, "description": "An enchanting getaway! Charm & service abound at this traditional Bed & Breakfast on private country acreage with ponds, orchard gardens and meadows that echo a simpler time. Our inviting rooms feature King/Queen beds, luxurious linens & towels, TV/DVD, private baths and complimentary Wi-Fi. Large sundeck with Jacuzzi hot tub. Treat yourself to coffee, tea & goodies anytime from our lounge. A bountiful breakfast will keep you energized all day! 5 minutes from town."}