{"user_rating": 3.5, "review_count": 782, "name": "Blakemore Hyde Park", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed March 2012", "text": "A good quality hotel within walking distance of the underground. Our room club room was spacious and clean and was nice and quiet. An ideal location for visiting London", "title": "Good quality and value", "user": "squeaky1963", "date": "March 17, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 126219209}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "To be fair, I got a bargain deal for this hotel off Laterooms at £70 for one night including continental breakfast however the hotel was well worth that and more. The room was lovely, comfy twin beds, modern, clean bathroom, all mod cons. The only slight negative was that the room was very warm and we had to open the windows to get some air in.", "title": "Lovely modern room, excellent value, good breakfast", "user": "star_bizarre", "date": "March 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 126110369}, {"rating": 5.0, "stay_parameters": "Stayed March 2012", "text": "Breakfast in the morning was good, with a selection of bread, cheese, meats, cereal, yoghurt, toast and croissants. Could have done with some fresh fruit though as there were only some prunes.", "title": "Very Nice Hotel", "helpfulness": 1, "user": "deeeb", "date": "March 7, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 3.0, "service": 4.0, "rooms": 4.0}, "id": 125772178}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled with friends", "text": "Travelled to London and Blakemore hotel with the main goal; to go shopping. The hotel is on a beautiful street, nice and quiet.", "title": "Classy and comfy", "user": "lassh", "date": "April 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 127585519}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "We were, as they said, upgraded to a club room. Which I think means it's refurbished. We were on the 5th floor. The room was very spacious! Lots of storagespace (for a hotel), bathroom with extra make-up mirror, proper shower, good lightning and a very comfy bed. We had only the included intercontinental breakfast, and that suited us just well. Cereal, fruit, bred, ham, cheese, jam is the basic breakfast.", "title": "Comfortable and friendly", "user": "DocDavid", "date": "April 4, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 127245659}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled on business", "text": "The staff was helpful when ordering taxi and for directions.", "title": "Lovely hotel", "user": "matrix1000", "date": "April 4, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 127233085}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "The hotel's location is a 7-10 min busdrive from Marble Arch, we used a day travel card and that worked out really well. A 7-10 min walk from the hotel you will find Queensway street, were the underground stops and threre are several good restaurants suitable for dinner.", "title": "Very good stay", "user": "Emelyne N", "date": "April 4, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127223309}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled with family", "text": "We booked this hotel at the last minute while trying to get a flight back to Australia. We only had one in London so our main aim was to have a good value hotel in a good location. The Blakemore met our expectations.We were upgraded to a newly refurbished room. It was clean, quiet and comfy. Would certainly recommend this hotel for a short stay in London. Only one negative comment, we tried to book direct with the hotel and the staff were not overly helpful and the level of English spoken by the staff was very, very poor. The staff in the hotel were certainly professional just not friendly but dont let this stop you staying at this hotel. It is a good mid level hotel in a very good location.", "title": "Good value for money and good location", "helpfulness": 1, "user": "ianandalli", "date": "March 24, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 126576355}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled with friends", "text": "This hotel has benefitted from a substantial refurbishment in recent years and now provides a degree of quality at a reasonable cost.", "title": "IDEAL FOR A VISIT TO THE WEST END", "user": "Bennettonbeer", "date": "March 18, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 126267523}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "We stayed in this hotel this march. The check- in was very easy, and I was permitted an early check-in with no extra costs. Even stioring our luggage on the day of departure was no problem and very secure even. We stayed in a club room onm the sixth floor and it was very good. There were tea and coffe facilities which were supplied every day anew and without any costs.", "title": "London March 2012", "helpfulness": 1, "user": "Ann C", "date": "April 2, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 127115588}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "Down on the reception you can get every info you like to have. Evenbreakfast was nice, they even had soya milk!", "title": "The Blakemore hotel is well worth a stay!", "user": "Michelle S", "date": "April 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127109243}, {"rating": 1.0, "stay_parameters": "Stayed March 2012, traveled with friends", "text": "One thing is, that there is just one lift going to the reception, this can be frustrating in rush hour times.", "title": "Unpleasant stuff", "helpfulness": 3, "user": "bona-fides", "date": "April 1, 2012", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 2.0, "sleep": 1.0, "rooms": 2.0, "location": 2.0}, "id": 127065044}, {"rating": 3.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "However all together it was a perfect hotel to stay. And i am normally very critical :-)", "title": "Standard Hotel....", "helpfulness": 1, "user": "Mo-Oxford", "date": "March 29, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 126909391}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "The Blakemore hotel was referred to us by friends of ours who had stayed in the hotel earlier in the month. On arrival we were upgraded to a suite which was just wonderful. The hotel suite was extremely comfortable and spacious. The bed was simply divine! My partner and I had decided to treat ourselves to a few nights in a nice hotel before we travelled the 32 hour flight back to Australia after a month of travelling in the UK and parts of Europe. I could not fault the Blakemore hotel. The staff were very friendly and accommodating. The continental breakfast was sufficient and the option of upgrading to full buffet breakfast was there at a small added cost. It is located close to Hyde park and is a 5 minute walk to Queensway tube station.", "title": "Overnight visit", "helpfulness": 1, "user": "Judith D", "date": "March 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 126689246}], "location": {"country": "United Kingdom (UK)", "continent": "Europe", "city": "London"}, "stars": 4, "variance": {"poor": 83, "average": 134, "very good": 334, "terrible": 81, "excellent": 150}, "aka": "Blakemore Hyde Park Hotel London", "slim_ranking": 0.333643122677, "detail_rating": {"service": 3.5, "cleanliness": 4.0, "value": 3.5, "sleep": 4.0, "rooms": 3.5, "location": 4.0}, "description": "Residing in one of London’s most sought after locations; Blakemore Hyde Park is a beautifully appointed 4 star hotel, ideally situated amongst some of the City’s major tourist attractions. A stone’s throw from London’s Hyde Park and Kensington Gardens, Blakemore Hyde Park is the perfect destination for both the business and leisure guest – with every available amenity and comfort that your stay requires. Recently refurbished, this West London hotel boasts 138 en-suite bedrooms offering all the modern luxuries one can expect from a contemporary hotel along with a selection of restaurants and bars and an exclusive outdoor terrace lounge bar from which to enjoy a specially shaken cocktail. Served by all of London’s major transport systems, including London’s Underground, buses, taxis and trains - a high-speed direct link by train from Heathrow Airport to Paddington Station average journey time 15 minutes."}