{"user_rating": 4.5, "review_count": 302, "name": "Blenheim Hotel", "reviews": [{"rating": 5.0, "title": "100% recommended", "text": "Beautiful hotel! Very clean and tidy! Lovely breakfast with excellent service!! Family run business that welcomes you in as if you are one of them. Martin has some great stories which he openly tells to make people laugh.", "user": "Newlywedsuk", "date": "September 26, 2008", "id": 20396703}, {"rating": 5.0, "title": "mrs. twopotsoftea", "text": "Deffinately lives up to their motto \"Arrive as a Guest and leave as a Friend\"", "user": "twopots", "date": "September 19, 2008", "id": 20194143}, {"rating": 5.0, "title": "we.ll be back", "text": "Overall a great experience. We will definatly be back next year.", "user": "holidayhippies", "date": "September 18, 2008", "id": 20177756}, {"rating": 5.0, "title": "Excellent service", "text": "Recomended to all, couples and Families alike.", "user": "MagnaHuntly", "date": "September 8, 2008", "id": 19870141}, {"rating": 5.0, "title": "fantastic place to stay", "text": "from the \"Newlyweds\"", "user": "judLoughborough", "date": "September 6, 2008", "id": 19819364}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "my and my boyfriend stayed in this hotel and thought it was very clean and we were made to feel very welcome would definitely stay here again you are close to everything you needed. just want to say thanks denise and martin! Karla and Ade Leicester", "title": "great hotel, great owners", "user": "karlaalbus", "date": "June 9, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 31931944}, {"rating": 4.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "Had a really good stay here, the owners were very friendly and made you feel very welcome, the hotel is lovely and tidy and the breakfast was great.", "title": "great place to stay, friendly owners, just off the seafront.", "user": "vicky_and_scott", "date": "June 7, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 31800804}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "The hotel is just one street back from the seafront so if you want to be close to everything but away from the noise then it's perfect, there's a car park at the back of the hotel where you can park for free.", "title": "Found by chance, friends for life", "user": "poached", "date": "May 29, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 31089986}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled with family", "text": "Went this time for a break wihout the kids, but would definately go back with them later in the summer, would highly reccomend this hotel to others.", "title": "very nice and very well run hotel", "user": "ASHLEY088", "date": "May 27, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 30884705}, {"rating": 4.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "scott and vicky.", "title": "Very friendly, Clean & Tidy, Great Hotel", "user": "JasonAmy", "date": "May 16, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 30094419}, {"rating": 5.0, "title": "blonde sets off fire alarm.", "text": "early morning shower caused us major embarressment.we oversteamed our room when the dumb blonde decided to let the shower run without getting in.we opened the door to our on suite room, and the steam ran into our bedroom causing the fire alarm to set off.we didnt realise till going down to breakfast that the fire alarms were connected in all rooms and subsequantly all the hotel got up at 7.00am.SORRY to all guests.However, such were the hosts Denice and Martin, and the other guests in the hotel that we all had a laugh over breakfast...... a great stay, made to feel comfortable and welcome... and when things go wrong, they do all they can to make it ok. thank you.we will be back.", "user": "shirgor", "date": "May 5, 2009", "id": 29390917}, {"rating": 5.0, "title": "wonderfull hotel would reccomend", "text": "Had a great stay this weekend , great location great food great hosts .. Really made us feel welcome would go again and again .... infact all ready booked our next visit and we have told friends who are coming too ;) Cheers martin and denise for being great hosts.. lynsey and carl ;)", "user": "lynseylou77", "date": "May 3, 2009", "id": 29245211}, {"rating": 4.0, "title": "made to feel very welcome", "text": "first time we have stopped here and we will definitely go back. the hotel was very clean ,the breakfast was excellent and the hosts were very warm and friendly. great location for the beach and town centre, have told my family and frinds this is the place to stay. my family had a great weekend and will go back for a week next time.", "user": "clowesey", "date": "April 20, 2009", "id": 28372463}, {"rating": 5.0, "title": "Great Place, Great People!", "text": "Love This Hotel, Have Been Before With My Sister, Came Back This Year With My Boyfriend.", "user": "Rachael_09London", "date": "April 19, 2009", "id": 28327937}, {"rating": 5.0, "title": "Superb Little Hotel", "text": "The Service Is Great, The Owners Are Very Friendly And Easy To Approach. In Fact We Stayed Up All Night Talking To Them - Had A Great Laugh! Breakfast In The Morning Was Also Fantastic, Full English, Beautifully Cooked.", "user": "GeoffTHertfordshire", "date": "January 26, 2009", "id": 23922008}, {"rating": 1.0, "stay_parameters": "Stayed July 2009, traveled solo", "text": "I stayed room only for 4 nights and didn't have an en suite as this is all I needed. My room had a faint smell of fish about it that could be smelled when a draft brought it to my nose (as I needed the window open). The communal toilet had a wet carpet all of the time - even when there had ben no rain and on the first night no toilet paper meaning a trip down stairs to another toilet. I had a basin in my room (source of the fish smell I suspect) but no power points anywhere near the mirror. The room was VERY basic and small - even for a single and had a faulty power socket and missing the remote for the 14\" tv. I even had to boil the kettle on the floor as the lead was too short to reach the low sockets. I booked through late rooms for £30pn but due to my experience there, I would have felt short changed even at half the price.", "title": "Number 1? Don't make me laugh", "user": "millso42", "date": "July 17, 2009", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "location": 5.0, "service": 1.0, "rooms": 1.0}, "id": 35002550}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "I should have guessed what I was in for from my \"welcome\" at the hotel - a 14 year old(?) popping in the back then coming back with a key and an apology from his mother for not coming to meet me. He gave no info about the hotel and I had to ask him where the room was and find the shared facilities myself. On the second night (Tues) I asked if the bar was open (for me and my family who where staying elsewhere - lucky them) and was told no as it was late (22:00 - not even closing time on a Sunday) but the way they told me that they would serve ME \"if I wanted a drink\" didn't make me feel exactly welcome - I passed on their offer.", "title": "We left as Friends", "user": "hardina", "date": "July 5, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 33913948}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "I had an early rising neighbour who used the facilities early which in the process created a loud knocking from pipes that woke me 2 out of the 4 mornings.", "title": "A great place to stay close to everything you need", "user": "ejjsboutique", "date": "July 3, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 33820994}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled with friends", "text": "I was using this hotel as somewhere to lay my head only and was using showers and having breakfast with my family elsewhere so couldn't be bothered to complain. So no idea what their problem resolution is like.", "title": "Excellant hotel, couldn't ask for more!", "user": "Danielle70", "date": "June 16, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 32455034}, {"rating": 4.0, "title": "Great owners, great breakfast, bar open late.", "text": "If thinking of booking this hotel i would advise a visit if possible and avoid room 11 (single). Also a couple of rooms are next to toilets so may want to check that too.", "user": "IwanttogohomeStaffs", "date": "June 12, 2009", "id": 32183060}], "location": {}, "variance": {"poor": 9, "average": 14, "very good": 46, "terrible": 8, "excellent": 225}, "aka": "Blenheim Hotel Great Yarmouth", "slim_ranking": 0.202127659574, "detail_rating": {"service": 5.0, "cleanliness": 4.5, "value": 5.0, "sleep": 4.5, "rooms": 4.5, "location": 5.0}, "description": "The Blenheim Hotel,is a victorian terraced establishment,and is located in a prime location for those[ visiting great yarmouth],and wish to be in the heart of it all.We are located 50yds from the sea front,restaurants,arcades,shops,and our golden mile beach is just across the road.We are a family run establishment and have successfully been running the Blenheim for the past 12 years, and was one of the first Hotels to be on tripadvisor ,before they became so well known like they are today.Now there has been so many more b&bs and Hotels for Great Yarmouth added to the sight .But we was one of the first and our genuine reviews go back a long time ,and the Blenheim has only got better over the years.As you can see by our apdated photos.We have been overall winner for the Great Yarmouth & Gorleston flower displays on many occassions ,and became Best hotelonce again and won the cup for 2012 .And look forward to the competition again this year.Our aim is to make our guests stay with us an enjoyable experience and our motto is arrive a guest depart a friend And there is many friends we have who keep returning year after year"}