{"user_rating": 4.0, "review_count": 243, "name": "Bloomsbury Park - A Thistle Associate Hotel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled on business", "text": "I am a regular at the hotel - and that is for a reason - I never experience anything less than great service. It is in a great location, but, for me, most importantly, it is as much like home as a hotel can be and you get the feeling that nothing is too much trouble.", "title": "Bloomsbury Park experience", "user": "Adrian H", "date": "March 8, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 154009550}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "We stayed here for a city trip to London and I choose this hotel for the location .", "title": "top marks on all fronts", "user": "vets17", "date": "March 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 153978608}, {"rating": 4.0, "stay_parameters": "Stayed March 2013", "text": "We were pleasantly surprised on all fronts.", "title": "Good central London hotel", "user": "Arnoldkeith", "date": "March 6, 2013", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 153889292}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled on business", "text": "Location:", "title": "Comfortable, clean and modern", "user": "Sionel", "date": "February 28, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 153363942}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "Hotel is located in a nice street with good restaurants and shops.", "title": "Friendly, Central Hotel", "user": "travelmum1", "date": "February 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 153054492}, {"rating": 4.0, "stay_parameters": "Stayed March 2013", "text": "We arrived to check in very impressed with location but to our disappointment the double room we had booked was not available and we had to accept a twin room. The room was on the 4th floor tucked away at the end of the corridor, immaculate but small, no bath only a shower. It was only for 1 night so not much of a problem but we were disappointed as we had booked well in advance. Very friendly staff and the location is great just a shame about the room mix up.", "title": "Perfect location but a little disappointed on arrival", "user": "Tillyanneb", "date": "March 31, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 156175913}, {"rating": 5.0, "title": "A fine old building with modern comforts", "text": "Despite the sub-zero temperatures and arctic winds outside, my room at this central London hotel was warm and comfortable.", "helpfulness": 1, "user": "ianwatson100", "date": "March 13, 2013", "id": 154466261}, {"rating": 3.0, "stay_parameters": "Stayed March 2013", "text": "Very helpful, friendly and welcoming staff and an excellent breakfast. Free wi-fi too. The beautiful stained glass windows on the staircases are a fine feature of this handsome building. Recommended.", "title": "Good staff average room", "user": "gvann14", "date": "March 12, 2013", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 4.0, "service": 4.0, "rooms": 3.0}, "id": 154393963}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "This hotel is ideally located for the Neurology Hospital, but is nothing special. The staff are very polite and helpful, and whilst the room was clean and had what was required it was very clostrophobic. Expensive standard room.", "title": "Great place to stay", "user": "Barbara J", "date": "March 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 154180635}, {"rating": 4.0, "stay_parameters": "Stayed March 2013", "text": "We stayed for 2 nights in this hotel and found it excellent. The staff are very polite and friendly. The room was very clean and well appointed with a nice bathroom. We ate in the restaurant and the food was lovely - a little odd being the only ones in there but we were looked after well : ) The location of the hotel is really good, easy walking to the station and places like Covent Garden and the theatre for War Horse. I would highly recommend and will stay again when we return to London in the future.", "title": "Good value Central London hotel", "user": "MKRC", "date": "March 8, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 154048046}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "We had 2 rooms here. A twin at the front and a double at the back. The service was excellent and the rooms were fine. They are small and very cheaply fitted out, carved out of an old building so the partition walls are relatively thin. So if you have noisy neighbours it could be a pain. The biggest downside was the inability to adjust the room temperature other than by opening the window. This was OK at the back of the hotel but if you have a room overlooking the very busy Southampton Row it is not really an option. Breakfast was good in a pleasant restaurant, and the hotel is handy for Covent Garden, Soho and the British Museum. The real reason for coming here is the price - if you can pick up a room for £100 its a decent option.", "title": "Perfectly fine if you get a good deal", "user": "Kingmaker", "date": "April 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 157691538}, {"rating": 5.0, "stay_parameters": "Stayed March 2013", "text": "My husband and I spent 8 nights here. The room was small but had everything we could want - king sized bed, safe, nice toiletries. Excellent breakfast, friendly and helpful staff. All \"must see\" attractions within a 30 minute walk. We had a wonderful trip and will definitely be staying here again - thank you!!! :)", "title": "Fabulous. Will definitely revisit!", "helpfulness": 1, "user": "KaterinaDp", "date": "April 13, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 157627947}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled with friends", "text": "Stayed here for 2 nights in early April and it was perfect for our trip.", "title": "Nice Hotel, Good Location", "user": "Claire B", "date": "April 12, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 157507546}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "Check-in was painless, we were given the option to add breakfast and given vouchers to use in the dining room. Found our twin room at the front of the hotel with no problem. Road noise was noticeable but I didn't find it annoying and got used to it very quickly. Beds were clean and comfortable, could do with better pillows though! The bathroom was small but very functional and the shower was amazing! Best water pressure I've found in a hotel. Although make sure the shower curtain is properly tucked into the shower base otherwise the floor does get very wet.", "title": "great base but room problem", "user": "madsquad", "date": "April 12, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 157500720}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled on business", "text": "My only complaint was there was no mini-fridge. I didn't mind not having a mini-bar, but I bought some milk to put in my cups of tea and had to keep it on the window ledge, not a major complaint though.", "title": "Very Friendly Staff .. Hotel a lot better than expected.", "user": "mykonrunner", "date": "April 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 157205135}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "Found this on a website when looking for hotel deals in London. Read Trip Advisor reviews which appeared to be mixed. It is what it is - a basic hotel with a very reasonable rate if booked as a special deal. We paid £130.00 for a family room sleeping 3, this included breakfast. Yes the rooms are smalll and the bathroom was bijoux to say the least, however the place was spotless and the staff helpful and friendly. We were located on the 2nd floor 2 rooms in from the front - yes you can hear traffic and the odd siren but no more than any major city. We live in a village so are used to peace and quiet however we all managed to get a good nights sleep. I would say for a 1-2 night weekend stay the rooms are fine, any longer than that and you would need a larger room. The area it's located in seems very safe and is surrounded by restaurants and shops. There is a Tesco Express a couple of doors away, several coffee shops and a 24 hour Sainsbury's near Holborn tube which is about a 10 min walk. The hotel has a small lift. The hotel is a good base for the west end theatres (the reason for our visit) and shopping. The breakfast is good value with a self-serve buffet including fruit, toast, jam, juices, tea and coffee and full english with sausages, bacon, fried bread, hashbrowns, beans, aggs etc. When we checked out the staff offered to look after our luggage to enable us to do some sightseeing - this was great as we were going to Madam Tussauds and had planned on paying to leave it at Paddington. We will be using this hotel again the next time we visit London - a real gem.", "title": "Fantastic little find", "user": "hayleys", "date": "April 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 157180824}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled on business", "text": "very good location, Clean and Comfortable room, very friendly and helpful staffs specially the Persian guy at the reception who made me feel like a VIP guest at 5 stars hotel. the building is quite old and lift was slow however rooms are very comfortable and clean. my room was a bit noisy during the day that's just because of the amazing location so if you want to stay somewhere quiet then you should go to countryside. this hotel is located between to underground station , 5 minutes from each and there are plenty of the international and fantasy restaurant around. i would definitely stay at the same hotel on my next trip in London, i felt i m at home.", "title": "3stars hotel but 5 stars service", "helpfulness": 1, "user": "Johny80", "date": "April 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 156739560}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled on business", "text": "Well I wasn't sure, hadn't stayed here before and austerity means we are cutting costs but I must admit I was pleasantly surprised....not far from Euston, extremely helpful reception staff...I,was booked into a single and upgraded to a twin (just as well, No possibility of even a bit of light cat-twirling if the room had been any smaller!)", "title": "Ahhh, the comfort of a fish finger butty!", "user": "Mandi V", "date": "April 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 156621744}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled on business", "text": "I had a terrible cold but a Tesco down the road had lemsip, I was not up to going out but room service came up trumps with a fish finger butty, perfect.", "title": "A lovely stay in London", "user": "Southernredhead", "date": "April 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 156543242}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled on business", "text": "Downside - tray had to go onto one of the beds as table not big enough, room snug for 1 would have been very cramped for 2.", "title": "A great stay in London", "user": "Puddycats", "date": "April 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 156385735}], "location": {"country": "United Kingdom (UK)", "continent": "Europe", "city": "London"}, "stars": 3, "variance": {"poor": 12, "average": 38, "very good": 106, "terrible": 3, "excellent": 84}, "aka": "Thistle Bloomsbury Park London", "slim_ranking": 0.272304832714, "description": "Thistle Bloomsbury Park is the perfect base from which to explore this vibrant area of Central London, Within walking distance of The British Museum, Covent Garden and West End Theatres. Several famous formal squares and gardens are on our doorstep, with great transport links provided by Russell Square or Holborn Tube stations. Bloomsbury Park makes it home in a beautiful Edwardian building, and our comfortable rooms and friendly service will ensure a great stay in London."}