{"user_rating": 5.0, "review_count": 182, "name": "Blue Door on Baltimore", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "My husband and I were thoroughly impressed with the \"Blue Door on Baltimore\" during our May visit. We were in the enormous Washburn room, which faces the street and has a large bathroom attached. The room itself was lovely. “Casual elegance” is the perfect description for this Inn. Since it just opened a few months ago, everything felt very new. The king-size bed was fabulous. I especially loved taking advantage of the new claw-foot soaking tub in the bathroom. Our room had a small flat-screen television. Bottled waters and sodas were provided, which was nice.", "title": "An Oasis in the City!", "user": "mcb1979", "date": "May 16, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 16084498, "likes": {"liked": "— The rooms were top notch. So modern and clean and luxurious."}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "We walked to dinner at the nearby “Salt” restaurant on Saturday night. I highly recommend making a reservation. The food was phenomenal.", "title": "The Blue Door Bed and Breakfast is the place to stay in Baltimore", "user": "macypetty", "date": "March 27, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 14578067, "likes": {"liked": "— location, cleanliness, home like atmosphere"}}], "location": {"country": "United States", "city": "Baltimore"}, "stars": 3.5, "variance": {"poor": 0, "average": 1, "very good": 10, "terrible": 0, "excellent": 171}, "slim_ranking": 0.166666666667, "description": "Experience Casual Elegance by the Harbor from a neighborhood row house setting and times gone by at Blue Door on Baltimore. Located in the historic area of Butcher's Hill, and steps and a few short minutes away from all of Baltimore's business and entertainment venues.Trendy neighborhood restaurants, entertainment venues, Orioles and Ravens games, and strolls in Patterson Park and along the waterfront await you. Day-trip to explore more of Maryland or Washington D.C. by auto or train."}