{"user_rating": 4.0, "review_count": 246, "name": "Blue Parrot Inn", "reviews": [{"rating": 1.0, "title": "Surprised this B&B is still in business.", "text": "I happened to be reading through a few of these reviews and saw that the Blue Parrot is still operating with hostile and rude management/owners. My husband and I stayed here as we were planning our wedding and this was a good location with a reasonable price tag. We stayed in the Sunset room as it was inexpensive. First off it was so tiny, 2 people couldn't get ready in the room at the same time. The double bed was pushed up against the wall so it made it very difficult for one of us to get up. There was a chair at the end of the bed but you couldn't open the door to leave the room if you were sitting in the chair. The room doesn't even have a closet. But the worst thing was the reception I got from the management/owners. The dresser was infested with ants. Thus the ants were all through my clothes. I went to complain but they did nothing. No rooms available. So I went out, bought a can of ant spray and proceeded to spray the dresser and my suitcase since the ants were also in there and I didn't want to bring them home. The management saw me spraying my suitcase on the porch but did nothing to help, or even apologize. I will never stay there again and will make sure this is conveyed to any friends who visit Key West. The management should be ashamed.", "helpfulness": 5, "user": "L1", "date": "August 18, 2004", "id": 2459732}, {"rating": 5.0, "stay_parameters": "Stayed June 2004", "text": "A friend and myself spent five nights at the Blue Parrot in the beginning of June and we loved it there. I own a bed and breakfast myself and tend to be a bit pickier than most. My room was very comfortable and clean, the pool was an oasis in the afternoon, the location was perfect for walking everywhere, and the staff were very friendly. I need no more for a perfect place to stay. Two thumbs up. SD", "title": "I love the Blue Parrot!", "helpfulness": 1, "user": "sjfromABQ", "date": "August 16, 2004", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 2453671}], "location": {"country": "United States"}, "stars": 2.5, "variance": {"poor": 17, "average": 25, "very good": 98, "terrible": 14, "excellent": 92}, "aka": "Blue Parrot Hotel Key West", "slim_ranking": 0.59793814433, "description": "Bahamian style in 1884 residence; modern comforts, porch and tropical gardens; located in the historic district near attractions."}