{"user_rating": 4.5, "review_count": 79, "name": "Blue Jay Motel", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled solo", "text": "Pretty basic beach town motel. Rooms have knotty pine paneling which makes them a little dark. Friendly efficient check-in, clean room - not large but not New York tiny either; it looked better than the photos on their website. Comfortable bed, plenty of hot water and a shower head high enough on the wall to wash my hair. All in all a great deal at around $75/night.", "title": "Clean, comfortable and Seventy Five Bucks", "user": "JohnAndTheresa", "date": "September 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 3.0, "location": 4.0}, "id": 179046800}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "You are made very welcome by the hosts and the cleanliness is second to none, with a nice big comfy bed, the shower was the best I have ever used, it was like having a massage, but the crowning glory for me was a bottle opener on the wall by the front door, this just bowled me over, such a simple gesture open the fridge crack a bottle and sit on the veranda, other hoteliers please note this! Yes it is dated but so are a lot of other properties in the area so for me that was not a problem. A great stay and a great host.", "title": "I would go back again", "user": "Robert3236", "date": "September 20, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 177915088}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with friends", "text": "Owners & Staff are all very friendly. Nice atmosphere --a lot of guests interact with other guests leading to a truly friendly place to stay. Mary & Rose go out of their way to ensure everyone has a pleasant stay & gets the most out of their vacation.", "title": "A Great Stay @ the Bluejay", "user": "Kathy S", "date": "September 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 176081866}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with friends", "text": "We stayed at the Blu Jay with another couple due to the excellent reviews we read on this site. We were not disappointed. Such a quaint 50's motel, clean ,well equipped, with Kerig coffee makers, a large institutional barbecue grill with all the accoutrements available on the grill at all times, a very convenient walk to the beach and it seemed to us the best part of the breach wide expanses of flat sandy beach. Of course we stopped each day at the ice cream parlor and had 2 dogs chips soda for $5 then enjoyed a great sunday. Mary the motel owner was a kick! So friendly and helpful, felt like family by the fifth day! We walked everywhere it was great! Music at the shell evey nite, ate at a different restaurant each nite and the fireworks on Wednesday at the beach were great! A great motel, a great owner and and a great vaca! Thanks Mary!", "title": "Vaca at the Blu Jay", "user": "debigiftos", "date": "September 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 175608215}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with friends", "text": "10 minutes from beach and great ice cream stand- no getting into car for night entertainment. easy access to everything.enjoy", "title": "the best experience ever!", "user": "Patricia U", "date": "August 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 174309625}], "location": {"country": "United States", "city": "Hampton"}, "variance": {"poor": 0, "average": 3, "very good": 20, "terrible": 1, "excellent": 55}, "aka": "Blue Jay Hotel Hampton", "slim_ranking": 0.046511627907}