{"user_rating": 4.5, "review_count": 24, "name": "Bluff House Inn", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "My husband and I and our teenagers spent a long weekend at the Bluff House Inn, which was located near a family gathering we were attending. Steve, the innkeeper, is a quiet, yet warm host, and his entire family, including the dogs, made us feel welcome. The inn consists of a beautiful great room downstairs and 8 guestrooms upstairs. From both floors you can experience breathtaking views of Frenchman's Bay and its many islands. Our rooms were simply and tastefully decorated, and were extremely clean. The continental breakfast was good, especially the blueberry muffins. We would also recommend Fisherman's Inn in Winter Harbor for an excellent dinner. Bluff House is a really good value, especially when you consider the beautiful coastal views. We will definitely be back.", "title": "Friendly Inn with Some of the Best Views on the East Coast", "helpfulness": 2, "user": "Bandlady", "date": "July 12, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 34576649}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "If you're looking for a quiet and breathtaking spot at Schoodic, this is it! Great innkeepers, comfortable rooms and no better spot to view the spectacular sunsets on Frenchman Bay. We'll keep coming back!", "title": "A quiet and beautiful getaway!", "helpfulness": 2, "user": "VTLaura", "date": "June 19, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 32703807}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled with friends", "text": "My spinning/knitting group stayed at the Bluff House Inn in February and we had an awesome stay. The hosts were very nice and accommodating . The price was exceptional and the meals were fabulous! A huge thank you to the Bluff House Inn for their accommodations and relaxing atmosphere.I can't wait to go back. They also have the most beautiful white Standard Poodle :).", "title": "Great Get a Way", "helpfulness": 1, "user": "Mainebelle", "date": "May 20, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 16251807, "likes": {"liked": "— the relaxing with friends and the food was fabulous", "disliked": "— everything was wonderful"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2008", "text": "Our stay was an exceptionally relaxing experience. After seeing the views, we brought dinner back to enjoy on the deck overlooking the Maine ocean. A short walk brought us to the shore for beach combing. Hosts are a warm and marvelous couple. Our dog loved playing in the yard with their pup! Highly recommended. Jim, Patti, & Bear.", "title": "Maine Coast Oasis", "helpfulness": 2, "user": "RideMaine", "date": "April 24, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 15303655, "likes": {"liked": "— Views"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "We stayed in this nice little inn near the Schoodic penisula of Acadia national park. The price was great and included breakfast. The view was awesome, especially at sunset. The managers were very friendly and helpful and made our stay very enjoyable.", "title": "great view, great price", "helpfulness": 3, "user": "southsidegirl", "date": "August 10, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 8392099, "likes": {"liked": "— the price, the view, the property managers"}}], "location": {"country": "United States"}, "variance": {"poor": 1, "average": 1, "very good": 7, "terrible": 0, "excellent": 15}, "slim_ranking": 0.666666666667}