{"user_rating": 4.5, "review_count": 336, "name": "Boardwalk Plaza Hotel", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "Our family of 4 spent 3 nights and you can't beat the location - right on the boardwalk and you can walk to the beach and shops and restaurants. Also, the property is well maintained and the rooms very clean and comfortable (as long as you don't mind the Victorian theme at the beach which takes some getting used to and the parrots screeching in the lobby.) But where they really lost me was the service. Examples: The front desk check out experience was terrible with me having to go over the bill twice and they still over-charged me. And even when they fixed the charge later (which they did promptly) they never bothered to apologize. Also, when I wanted a small dessert so we could celebrate a birthday in the room, all the kitchen would sell me were the elaborate desserts from the formal main dining room. I went to a restaurant next door which gladly sold me a slice of pie. And finally The maid didn't keep the room fully stocked with replacement towels or K-cups for the coffee machines. They really need to work on the service.", "title": "Great Property & Location But Service Lacking", "helpfulness": 2, "user": "4ontheroadMD", "date": "July 9, 2013", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 166986330}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "The Boardwalk Plaza is a wonderfully unexpected treat. It is right on the beach. The staff is wonderful and welcoming. The ambiance is quaint. Would definitely return. If you can, stay on the fourth floor!!! The amenities are worth every penny!!!", "title": "Lovely!!", "helpfulness": 2, "user": "TheBirthdayGirl56", "date": "July 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 166979714}, {"rating": 4.0, "stay_parameters": "Stayed July 2013", "text": "We visited the hotel from June 29 to July 6. We got an Ocean View Suite on the 3rd floor. It was nice to have a sitting room and balcony because we felt like we had more space. Although our balcony wasn't the biggest it was still decent. On 4th Of July they opened the roof to everyone at the hotel (because usually it's only open to people staying on the 4th floor) we got a pretty nice view of the fireworks and even saw some of Cape May's and Dewey's. Also the parrots their our kids entertained. The one rainbow one named Emro was very sweet and the kids even said goodbye to him. Now on the other hand the pool was very warm. I know it wasn't supposed to be a swimming pool that kids can play in, but it was nice enough to let kids in. Although we had some bad weather in the beginning (which made the pool feel good) we had some hot days too which was bad for our kids who wanted to swim, but were too hot to swim in the (hotub) pool. One morning we ordered breakfast at Victoria's Restaraunt. It was good but overpriced. On one of our last days we ordered lunch by the pool. When we got the food the waitress set down the food and expected us to serve ourselves. (Really!?) I got a \"Beach Burger\" which cost $20. When I bit into it was burned. Completely. I was not happy. Overall it's a pretty good hotel but does have a few adjustments that need to made. That is why it is a 4/5 rating.", "title": "Some Highs and Some Lows", "helpfulness": 2, "user": "Mockingjaytraveler", "date": "July 6, 2013", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 3.0, "rooms": 5.0}, "id": 166560344}, {"rating": 3.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "These prices are comparable to a stay in NY. The hotel needs a bit updating as it seems very dark and morbid. Parking is somewhat of a hazard and in desperate need. The food does not appear to be more appetizing than the restaurants on Coastal Highway. If the price is high to keep out \"undesirables\" then that is understandable, however, for $500 + per night you would expect more space. The rooms are extremely crammed. They offer turn down service for an additional fee. Spending $500+ to sleep on the same sheets each night is an insult.", "title": "Overpriced for the Area", "helpfulness": 5, "user": "gbiggz", "date": "June 23, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 2.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 164963952}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "We are not Delaware Shore regulars so this was a bit of a shot in the dark. The views are great, the service was friendly, the room was comfortable, and the location is perfect. It is a little pricey and the Victorian may not be for everyone, but we loved it. The main strip of Rehoboth is a short walk southwest, and you can take a short run or walk to a state park to the north. The boardwalk and a nice cafe is right outside the door. Overall just very pleasant.", "title": "Very pleasant experience", "helpfulness": 2, "user": "TrustworthyTravelers", "date": "June 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 164196710}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "Second time for us at the Boardwalk Plaza for the cozy winter get away weekend. We were very pleased. The room was ocean front with a seperate sitting room facing the ocean. The package deal for the weekend was great and worth every penny. They changed some of the gifts that they gave us from last year. This year was a boardwalk plaza bag with frest coffee ( just delicious). Travel mugs that I did not realize till we came home but they are electric. What an added touch on the way to work to have hot coffee for the hour commute. We had delivered a plate of dessert and hot cocoa in the late afternoon after a long rather cold walk. And last the included breakfast we did not do the buffet just not our style. I had lobster scrambled eggs what a treat and to die for!", "title": "Another Great Weekend Away!", "helpfulness": 2, "user": "CMW106", "date": "June 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 164047092}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "Staff is excellent and the same server in the restaurant waited on us again this year and she remembered us from last year as we did her. She started with the Boardwalk when it opened 20 years ago. What a statment about the Boardwalk as a great place to work. Suggestion the Boardwalk should place the pictures of their employees with the years of service.", "title": "Great Place", "helpfulness": 2, "user": "Darlene H", "date": "June 15, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 164039691}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "We will back next year. Thanks for another great weekend away!", "title": "Elegant and Charming", "user": "Alberto P", "date": "June 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 163791517}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "My husband and myself always stay at the Boardwalk Plaza when we are in Rehoboth. Everyone working at the hotel is very friendly. Rooms are always very clean and comfortable. The only thing is the cost of the room. The hotel is first class,but not sure if it needs to charge so much in season.", "title": "Family Vacay", "helpfulness": 1, "user": "Josie Mae R", "date": "June 9, 2013", "detail_rating": {"service": 2.0, "cleanliness": 5.0, "value": 2.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 163498876}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "I was very happy with my stay at the Boardwalk plaza. The front desk staff was friendly and helpful, the room was nice, parking was convenient, and the property is beautiful. Fair warning though, it is a bit pricey for the Delaware shore...more of a Nantucket/Newport price point. I also highly recommend the restaurant. The service was very professional and the food was excellent. You must order the crab bruschetta appetizer: perfectly grilled bread, mouth-watering marinated cherry tomatoes, and a ton of lump crabmeat heaped on top. I am going to order this for lunch and dinner next time I go back.", "title": "Comfy beds and helpful staff", "helpfulness": 2, "user": "Debbie S", "date": "June 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 163059420}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "There are so many wonderful reasons to go to Rehoboth - great expanse of beach, fun boardwalk, great food options - but if you are looking for a romantic weekend escape, this is the hotel to choose. It is right on the beach/boardwalk and it has an elegance and quietness that many beach hotels simply do not have. It is a hotel with a history and the Victorian feel and decor begins right at the front desk and carries through the restaurant, the halls and the rooms. The service is excellent and the rooms are clean, comfortable and beautifully furnished with period pieces. Breakfast al fresco on the boardwalk is a spectacular way to start the day! We stayed in an oceanfront room with jacuzzi for two on the fourth floor which gave us access to the sundeck on the roof. There is on site free parking, a free beach umbrella, a pool and hot tub on the property (and one also on the roof available if you have a fourth floor room)- and if you want to stay on the beach after checkout, you have access to a shower and changing room before you head on home - a wonderful perk! It is a bit upscale - and I'm not sure I would recommend it for families - but for a couple looking for a sweet beach escape, this is the place.", "title": "Romance in Rehoboth", "helpfulness": 2, "user": "FlowerladyVirginia", "date": "August 1, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 170291814}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "We stayed here three nights on the fourth floor concierge level for adults only. The floor was quiet and the room was fine. The beds were comfy and the service was quiet.", "title": "Excellent choice right on the Beach", "helpfulness": 4, "user": "Scotty65Md", "date": "July 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 168740724}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with friends", "text": "Great location right on the beach and for people watching while eating in the outdoor eating area. The food was good and plentiful. Ate breakfast and one lunch there.", "title": "Best Hotel In Rehoboth , Guaranteed.", "helpfulness": 3, "user": "DaveMD", "date": "July 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 167727778}, {"rating": 5.0, "stay_parameters": "Stayed August 2012", "text": "The view from the roof was gorgeous and towels and umbrellas were available without charge if you wanted to go to the beach.", "title": "Best Hotel on the Boardwalk!", "helpfulness": 3, "user": "NancyLCarpenter", "date": "July 15, 2013", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 167628538}, {"rating": 5.0, "title": "I love this hotel!", "text": "All and all it was a very good choice and would stay here again.", "helpfulness": 2, "user": "MillersChild", "date": "July 12, 2013", "id": 167327614}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "My family and I came here for a reunion last spring - this included tons of kids, including some very little babies. It worked perfectly for all of us. My parents, husband, toddler and I were in an apartment-style unit - it was exactly what we needed (included a kitchen, washer/dryer, etc) and more. We loved the balcony and the location was absolutely perfect (near the action, but not IN the action). The pool was also a hit with our son - had an inside and an outside area, which he loved floating between. They were VERY accommodating, as well - so nice and welcoming to us as a family. Really went the extra mile. My only complaint was that the crib they gave us was very small and a bit uncomfortable - our son was very unhappy in it until we piled some towels over the mattress so it softened it up. Other than that, it was fantastic!", "title": "Great spot", "user": "LJWNYC2008", "date": "August 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 173673817}, {"rating": 5.0, "stay_parameters": "Stayed August 2013", "text": "We were extremely pleased with everything at the hotel. It was clean and the people were all accomodating. The location is great and we could walk almost everywhere. What made our stay there fantastic was the service we received from Tom, their concierge. His requests made our trip in Rehoboth both enjoyable and delicious!! He went above and beyond; without Tom, our experience would not have been the same.", "title": "Tom....the best concierge ever!!", "helpfulness": 1, "user": "Steve M", "date": "August 17, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 172723336}, {"rating": 5.0, "stay_parameters": "Stayed August 2013", "text": "Great location right on boardwalk. We stopped on way to Bethany and got lucky that they had one room left. We arrived at 1230am and they helped with bags and checked us in quickly so we could get our 3 and 5 yr olds to bed. The room smelled nice and was clean. We slept and woke to a gift bag for our kids outside our door. Could not be happier! Thank you!!!", "title": "Couldn't have been more perfect!", "helpfulness": 1, "user": "anna l", "date": "August 17, 2013", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 172642078}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "Great experience at the Boardwalk Plaza Hotel. Very clean and comfortable. They took good care of us from the time we pulled in! Great food at the hotel and room service. Would stay there again. I would love to stay of the 4th floor next time so that we can have access to the roof! Very nice!", "title": "We had a wonderful stay! Would stay again!", "helpfulness": 1, "user": "Kathy092603", "date": "August 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 170864813}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with friends", "text": "After leaving a nasty hotel at 10 pm, we had to find anther hotel. Went to the Boardwalk Plaza Hotel to see if they had any vacancies. The staff there was very sympathetic and nice. The rooms are clean and nice. It is right on the beach at the end of the boardwalk. The hotel is quiet with not a lot of children running around. I would recommend this to any one looking for a great place to vacation!! You will not be disappointed. Its a little on the expensive side, but you get what you pay for. Love the birds in the lobby. We wanted to stay another night there, but they were booked solid...even though they tried to find a way for us to stay. Totally awesome hotel!!", "title": "Awesome place to stay!!", "user": "Luvmyiggys", "date": "August 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 170633787}], "location": {"country": "United States", "city": "Rehoboth Beach"}, "variance": {"poor": 12, "average": 33, "very good": 72, "terrible": 11, "excellent": 208}, "aka": "Boardwalk Plaza Rehoboth Beach", "slim_ranking": 0.172413793103, "description": "The Boardwalk Plaza Hotel – think of us as a beach house – with 84 bedrooms!At the Boardwalk Plaza, we are fortunate to call the ocean’s edge our home, and happy to offer you a unique and comfortable respite from the world where you can truly get away from it all. From the moment you step under our antique wrought-iron canopy and enter the lobby, our staff stands ready to offer you exceptional service. Whether you choose a suite with a private balcony, a deluxe accommodation that adds a whirlpool-for-two – or something in between – you’ll find an artful combination of freshly updated, Victorian-reproduction furnishings and can’t-do-without amenities like free Wi-Fi and flat-screen TVs. From heavenly bedding to downy-soft bath towels and robes to remarkable room service with a smile, we do everything possible – and then some – to make you feel pampered. All of our guests can enjoy all-day dining in our oceanfront restaurant and relax in our heated indoor soaking pool. For adults traveling without children, our keyed-access concierge level offers accommodations enhanced with genteel extras and use of the private rooftop sundeck and spa.Like the ocean, we never close! Both the Boardwalk Plaza Hotel and Victoria’s Restaurant are open year-round. Join us for a weeklong vacation or a romantic escape – from a summer beach holiday to a cozy winter getaway. You pick the season that suits you best and we’ll take care of the rest."}