{"user_rating": 4.5, "review_count": 529, "name": "Bodhi Serene Hotel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled with family", "text": "We stayed in the 2-bedrm suite in bodhi serene chiangmai from 28-31 Oct 08. As mentioned in the reviews here, the walkway leading to the hotel rooms is rather close to the living quarters of the old city and not very pretty. But I think that was just a small minus and the both rooms and living quarters face the courtyard of the hotel, which is nice and quiet.", "title": "Nice boutique hotel", "user": "eileengoh", "date": "November 19, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "rooms": 5.0, "location": 4.0}, "id": 22000238, "likes": {"liked": "— Nice room"}}, {"rating": 2.0, "stay_parameters": "Stayed November 2008, traveled with family", "text": "Service style is rather free and easy.. eg. our booking package came with free breakfast, one set dinner and massage, so we were expecting vouchers for each of these activities at checkin.. but there were no vouchers or anything for it.. the check in staff says just turn up and say our room number. But again no problems with that.. they did honour all the entitlements we had in the package.. I guess the set up is rather small, hence the staff can recognise its guest by face and hence no need for meal vouchers etc.", "title": "Functional and basic - lower your expectations", "helpfulness": 2, "user": "daydreamz", "date": "November 14, 2008", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 2.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 21849359, "likes": {"liked": "— Location", "disliked": "— Service standards"}}, {"rating": 2.0, "title": "New name should be Bodhi Zoo", "text": "Location is not too bad, though not walkable to night bazaar. But there's quite a few eateries around and the food in hotel restaurant was nice and affordable too.", "helpfulness": 1, "user": "DATDATUSandAU", "date": "October 24, 2008", "id": 21166460}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled with family", "text": "Baby cot was provided for my 8mth old son upon our request. The cot is a little old, but passable. The kitchen in the 2 bedroom suite was very useful for preparation of baby's meal. And the 2 bedroom suite gave my husband and I, as well as my parents our own privacy, with common living space.", "title": "Excellent", "user": "salemsmoke", "date": "October 21, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 21084148, "likes": {"liked": "— local botique", "disliked": "— food"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "A very pleasant boutique hotel. Would certainly consider going back if they have the same or better promotion.", "title": "relaxing Bodhi", "user": "ab7882", "date": "July 11, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 17785896, "likes": {"liked": "— high quality of room and service", "disliked": "— none"}}, {"rating": 3.0, "stay_parameters": "Stayed May 2008, traveled with family", "text": "I just returned from my trip to Thailand. We stayed in 2BR Suites room and 1 Superior room. The 2BR Suite was amazing, nice size, good size kitchen and dining table. The two bedrooms were nice and the bathrooms amazing (especially the circular bathtub, no jacuzzi though!). The superior room was OK, nothing special and a little small. Breakfast was included and it was OK. Regular eggs, bacon, sausages, breads, plus fruits and rice with two thai dishes. Now the real observation.. the property is very close to 'local houses'. You can see your neighbors even their living rooms and private quarters while you are walking to your room with laundries hanging from windows as welcoming flags. The shops were loud during daytime (i think it's a motor shop), but luckily quiet down in evening. Talking about evening, please beware of mosquitos (close all windows and doors immediately). It must be a problem everything in CM during rainy season. And talking about rainy season, frogs.. and OMG frogs..you will not see them, but you will HEAR them! It is a choir at night. One or two frogs would be beautiful, back to nature kinda thing.. but if you have twenty, thirty.. fifty frogs .. man, it's too much! We complain but seems like nothing they can do. (Should they catch and release them during the day time, these frogs must be hiding in the shady bushy in the garden during the hot day?)", "title": "Nice hotel, but ...", "helpfulness": 1, "user": "riverstone313", "date": "June 16, 2008", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 16964658}, {"rating": 3.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "We ate at the restaurant one night (as part of the package). It was raining so we asked them to send it to our room. It was horrible! I'd suggest to spend your money elsewhere.. unless you stuck with the package! We also got massages, this is another disaster. This hotel has no spa, they assign one regular room as a 'day spa room'. They outsource the service to local spa. Again, save your money. I got a girl who was text messaging while giving me a massage and got to restroom twice in 2 hours.", "title": "Nice boutique hotel", "user": "Feistylion", "date": "June 4, 2008", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 3.0, "location": 3.0, "rooms": 4.0}, "id": 16683650, "likes": {"liked": "— Lovely new rooms", "disliked": "— Noisy alleyway"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled with family", "text": "I like the option to use the hotel service to visit handicraft and umbrella villages. This is a plus and free of charge. They also provide a drop-in to Night Market (but no pick up). Tuk-tuk will cost you about 50 Baht.", "title": "Amazing Hotel in the old city of Chiangmai", "user": "M.Y.Wong", "date": "May 26, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 16399472, "likes": {"liked": "— clean room and huge bathroom", "disliked": "— nil"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled on business", "text": "Overall my experience is OK (you may want to judge it yourself based on my review). BTW, the pool is nice and usually quiet. My kids loved it.", "title": "Warm, Cozy Boutique Hotel", "user": "Chocolatte", "date": "January 19, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 12781036, "likes": {"liked": "— Great service, lovely, spacious room, huge bathtub, peaceful, resort feel.", "disliked": "— Breakfast selection is limited. No 24-hour room service as indicated."}}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "I think CM is a little bit overrated. I have travelled around the world and (I believe) i know good places and good hotel. The property itself is new, the staff is so-so, the service is hit or miss. The frog is bad. The food and spa are also not nice.", "title": "Best Place to Stay in the Center of Chiang Mai", "helpfulness": 1, "user": "OlisaBelgium", "date": "December 31, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 12136765, "likes": {"liked": "— Situation / Rooms / Swimming Pool / Breakfast", "disliked": "— DVD Player in room but no DVD Library"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "This is a beautiful little botique hotel located in the middle of the walled, old city of Chiang Mai. It is brand new, so you probably won't find reviews of it, but take it from me. It is incredible. The rooms are huge, the bathroom has a giant size bathtub. There is an infinity swimming pool. It is really luxurious. You should know that the old, most interesting part of Chiang Mai is within the walled city. That's where this hotel is located. It is very small, one of the nicest hotels I've ever visited. Very romantic, very quiet. The room rate was 2000 Baht after a little negotiation. Like most places in Thailand, the room rate is negotiable, especially if you're staying a week or more.", "title": "Incredibly beautiful huge rooms. Infinity pool. Serenity in Chiang Mai", "user": "puedeba2004", "date": "November 9, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "rooms": 5.0, "location": 5.0}, "id": 10719893, "likes": {"liked": "— Big rooms, great beds, big bathtub, very, very quiet hotel"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2008, traveled with family", "text": "Stayed at Bodhi Serene right after the X'mas holidays, for two nights. Used their airport transfer service. For 500 baht per trip (group of 9), it is very good value for money.", "title": "Pretty Comfy at Bodhi Serene", "user": "islandhopper67", "date": "January 5, 2009", "detail_rating": {"front_desk": 3.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 23276374, "likes": {"liked": "— Well appointed decor in rooms and courtyard", "disliked": "— somewhat unprofessional service and lack of in-house spa"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2008, traveled solo", "text": "Rooms, bathrooms, courtyard all very clean, tasteful and large. Breakfast was alright; nothing fancy but by all means NOT disappointing in any way. Staff nice and helpful, although they did not give an air of being well-trained in giving advice/suggestions. The attitude was good though, and that matters more. Location is great in the middle of the City and easy walking distance to the Sunday Walking Street Market. However, it is one of only 2 nice looking hotels on the block, the area seems to have been a backpacker den until recently. Many massages and little knickknack shops available.", "title": "Nice resort in the middle of the old town", "helpfulness": 1, "user": "tc2", "date": "December 20, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 3.0}, "id": 22863055, "likes": {"liked": "— The room, the library and the pool", "disliked": "— Not being able to get the TV fixed"}}, {"rating": 2.0, "stay_parameters": "Stayed November 2008, traveled solo", "text": "Overall, a nice and comfortable stay as is often the case in Thai boutique hotels but does not stand out spectacularly.", "title": "NICE HOTEL BUT,,,", "user": "khashbeh", "date": "December 11, 2008", "detail_rating": {"cleanliness": 3.0, "front_desk": 1.0, "location": 2.0, "value": 2.0, "rooms": 3.0}, "id": 22627986, "likes": {"liked": "— cosy", "disliked": "— staff"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2008", "text": "I also stayed at the Bodhi Serene during Loy Kratong. I booked the 6 night package (includes 1 meal, transfers and 4 hours of Thai massage) and was lucky enough to be upgraded to a 1 bedroom room.", "title": "Great Hotel", "user": "Paulafromwhittlesey", "date": "November 27, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 22243218, "likes": {"liked": "— Everything", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "The room was fantastic - large, loved having the separate living area, and a huge bathroom. Unfortunately the TV didn't show any of the cable channels during my stay (I had a hard time trying to get it fixed - the English skills of the staff are passable for normal enquiries, but not too good for anything out of the ordinary). Not having the TV wasn't so bad as they have free DVD's to borrow, a library, and with the night markets and the Loy Kratong festival, you don't really spend too much time in your room in the evenings.", "title": "Genuinely serene oasis", "user": "johnandginny", "date": "November 27, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 22235244, "likes": {"liked": "— The spacious room and bathroom", "disliked": "— Lack of Thai choices at breakfast"}}], "location": {"country": "Thailand", "continent": "Asia", "city": "Chiang Mai"}, "stars": 4, "variance": {"poor": 12, "average": 29, "very good": 216, "terrible": 1, "excellent": 271}, "aka": "Bodhi Serene Chiang Mai", "slim_ranking": 0.103975535168, "description": "The Bodhi Serene is located within the old city walls of down town Chiang Mai surrounded by many ancient temples and is a mere 20 minutes from the airport, train station as well as the bus terminal. It is also visually and architecturally stunning with exotic Lanna style influenced by Chinese designs. There are only 38 rooms to offer most of which overlooks our central courtyard area with a tropical garden and waterfall."}