{"user_rating": 4.0, "review_count": 1468, "name": "Bologna Hotel Pisa", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed July 2005", "text": "We stayed at the Minotel Bologna in Pisa for three nights at the beginning of July 2005. The bedrooms and communal areas were spotlessly clean unlike the rest of Pisa which we found to be very dirty even by European city standards! There is a very tranquil terrace at the rear of the hotel which is served by the bar in the main hotel, both of which we found by chance. The hotel is ten minutes walk from the Leaning Tower and the excellent train service to many interesting destinations. We would advise a short stay of two or three nights at this very reasonably priced hotel.", "title": "Spotlessly clean hotel in an otherwise dirty city.", "helpfulness": 5, "user": "flubadub", "date": "July 24, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 3697203}, {"rating": 3.0, "title": "OK Hotel", "text": "The hotel is centally located in Pisa and about a 10 minute walk to the tower. It is easy enough to find from the airport providing you follow the hotel's own road signs. Parking is a problem 15 euros per night off road (but there are only about 10 cramped spaces - damage to vehicles does occur) and 4 euros for an on-road permit it you can find a space. The rooms were clean but were quite small and painted a dark green colour which made them very claustrophobic. Breakfast is very good. There is no restaurant for evening meals but there are plently of excellent restaurants within a short walk so this is not a problem.", "helpfulness": 5, "user": "4-go-travelling", "date": "July 24, 2005", "id": 3696325}, {"rating": 5.0, "stay_parameters": "Stayed July 2005", "text": "There is little to do in Pisa apart for visit the tower so we found one night to be quite enough.", "title": "A wonderful hotel in a great location.", "helpfulness": 5, "user": "Bootle45", "date": "July 18, 2005", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 3679077}, {"rating": 4.0, "stay_parameters": "Stayed July 2005", "text": "We have just returned after spending three nights at this hotel, I agree with everything that has been said by previous guests an excellent hotel and very conveniently located. It is within easy walking distance of all amenities and transport which makes it very convenient for visiting other towns and cities in the region. We took the train to Viareggio and it was very easy and hassle free.", "title": "Superb hidden gem!", "helpfulness": 6, "user": "vickireilly", "date": "July 18, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 3677925}, {"rating": 2.0, "stay_parameters": "Stayed July 2005", "text": "We booked direct with the hotel which was very efficient and were allocated a very pleasant room, which overlooked the car park and was very quiet. The bathroom was very good and Sky Tv was readily available. There was a good choice at breakfast and we considered that the hotel offered very good value for money and would certainly recommend it. The staff were very courteous and helpful, we arrived at 10.30 am and told our room would be ready in 15 minutes a real bonus on a baking hot day!", "title": "not very happy", "user": "biancatovey", "date": "July 17, 2005", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "rooms": 1.0, "service": 2.0}, "id": 3676485}, {"rating": 5.0, "stay_parameters": "Stayed June 2005", "text": "Just back from the Bologna today. Really liked it!", "title": "Great hotel!", "helpfulness": 6, "user": "Smokey-Smudge", "date": "June 16, 2005", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "service": 5.0}, "id": 3564145}, {"rating": 3.0, "stay_parameters": "Stayed May 2005", "text": "- good location (although the road is a little narrow)", "title": "Basic clean hotel at reasonable price", "helpfulness": 5, "user": "alfredman63", "date": "June 12, 2005", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "service": 3.0}, "id": 3544983}, {"rating": 4.0, "title": "Good location, good value, good housekeeping", "text": "Pisa has the leaning tower but very little else to recommend it - can all be \"done\" in a morning. Pisa airport is however small enough to be quick and efficient and there are lots of cheap flight deals so it's worth considering as a base town to explore this area of Tuscany, particlarly Lucca, Siena and Florence (an hour's train ride away). The Hotel Bologna is well situated - a short cab ride from the airport, only twenty minutes level stroll to the Tower, very near the bus and train stations with the main shopping street just around the corner. Rooms are well appointed and appear to be relatively recently refurbished- ask for a quieter rear room- and the whole Hotel was decidedly cleaner than average. Reception staff very friendly, multi-lingual and knowledgable. Breakfast nothing special but rarely is in Italy and there are no real public room areas. Booking on the net we had a \"three nights for two\" deal but the tarrif seems generally to be good value. You could do an awful lot worse than the Bologna in the centre of Pisa.", "helpfulness": 4, "user": "Clarissa_Firebucket", "date": "August 25, 2005", "id": 3806982}, {"rating": 3.0, "stay_parameters": "Stayed August 2005", "text": "This hotel was ok. The rooms were average - very odd decor! Each one had a bathroom, TV and all the other regular features. The hotel was ideally located for the tower (15 min walk), and also for the station. There was also a charged shuttle service to the airport. The staff were ok, - not overly welcoming. Breakfast is average. This is a fair family hotel.", "title": "fair hotel...", "helpfulness": 3, "user": "GVR", "date": "August 18, 2005", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "service": 2.0}, "id": 3785705}, {"rating": 5.0, "title": "Lovely hotel!", "text": "We came here after a 4 night stay in Florence. Interestingly, people say that Florence is the place to stay and Pisa is really just worth visiting to see the tower & cathedral. If you are planning a quick stopover to see the tower, Hotel Bologna is the place to go. If however you wish to stay longer, don't stay in Pisa (!) - stay in Florence and take the train (45 mins) to Pisa to the tower.", "helpfulness": 12, "user": "A TripAdvisor user", "date": "August 9, 2005", "id": 3749885}, {"rating": 3.0, "stay_parameters": "Stayed June 2007, traveled with friends", "text": "Upon arrival at 11AM on a 90 degree day, the air conditioning was broken in most of the rooms. The hotel staff apologized and said they called a repairman but he would not be in until 5 PM because italians do not work from 1-4PM. This of course made the room very hot and the hotel had only a couple of fans. We left the room and returned at 6PM with the air still broken. Finally after dinner at 7:30PM the air came on.", "title": "Not the best value", "helpfulness": 3, "user": "FatherKnowsBest1", "date": "June 23, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 3.0, "location": 3.0, "rooms": 3.0}, "id": 7969730, "likes": {"liked": "— Cleanliness", "disliked": "— Hotel shuttle charges"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "If you get a room facing the street you will not get any sleep. It is VERY busy and VERY noisy. The city buses and motor scooters use this road all night and even with the windows closed, you will hear every noise. We requested to change rooms our second night. If you have luggage to pull, then get a cab to the hotel because it is NOT convenient from/to the train station. They claim 400 yards, but only if you are in shorts and in good shape.", "title": "All you need in Pisa", "helpfulness": 2, "user": "zippymonkey", "date": "June 19, 2007", "detail_rating": {"cleanliness": 4.0, "front_desk": 5.0, "location": 4.0, "value": 4.0, "rooms": 3.0}, "id": 7938226, "likes": {"liked": "— value for money, proximity to sights", "disliked": "— dodgy shower"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2007", "text": "The staff was friendly however they take advantage of you be charging you 8 Euros per person for their hotel shuttle. The train station and airport are only about a mile and they want to bill you for using the hotel van? What a rip off! You just paid $200+/night to stay in the hotel and they insist on billing you for a 3 minute ride! (4 persons X 8 Euros = 32 Euros).", "title": "Great hotel and location", "user": "TAAC", "date": "June 19, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 4.0, "rooms": 3.0, "location": 3.0}, "id": 7938216}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "The hotel was clean and we recommend you take the city red bus tour. It was only an hour and very nice.", "title": "A really pleasant stay", "helpfulness": 2, "user": "travellertrue", "date": "June 17, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 7867989, "likes": {"liked": "— The cleanliness", "disliked": "— Lack of natural light in our room but not all rooms like this"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "We stayed here for one night, as most people seem to do, in preparation for a trip to Florence. The hotel is a 5 minute taxi ride from Pisa airport, and should cost in the region of €10.", "title": "Lovely hotel and staff", "helpfulness": 2, "user": "Siany46", "date": "June 12, 2007", "detail_rating": {"cleanliness": 5.0, "front_desk": 5.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 7838681, "likes": {"liked": "— cleanliness and staff", "disliked": "— slightly noisy due to tiled floors"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "Stayed in this hotel for one night in August 2007 and found it to be lovely. We walked from the train station with our cases in tow and found the hotel 5 mins away. As other reviewers have said it is centrally located between the tower and train station so is ideal if you have caught the train from the airport or vice-versa. The room was a good size and was perfectly clean. Breakfast in the morning was just ok but we found this with all hotels in Italy. The murals on the walls were beautiful which somewhat compensated. I would have no hesitation in staying her again.", "title": "Lovely hotel", "helpfulness": 1, "user": "CrazyWombat", "date": "August 20, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 19176251}, {"rating": 3.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "We arrived in Pisa for a two night stopover on our way to our farmhouse in the North. We are a family of 5 and had a larger room on the 3rd floor. The first night was very noisy with other people in the hotel shouting and talking all night long hence we then all overslept and missed breakfast. We dreaded the second night but it was blissfully quiet. Air con was very good! We had breakfast on our next morning and there was plenty for us all to choose from and all fresh. The position was great easily accessible for the tower and shops and out in the evening. Yes it is a 4* star hotel and in other countries you would get more for 4* but this is Italy! We enjoyed our stay.", "title": "Good Position", "user": "WARBENN", "date": "August 19, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 4.0, "rooms": 3.0, "location": 4.0}, "id": 19111400, "likes": {"liked": "— Position", "disliked": "— Noise travelled"}}, {"rating": 3.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "My wife & I stayed for one night at the Hotel Bologna. It's an older hotel which still presents reasonably well. The staff on the front desk all spoke English and were quite helpful throughout our stay. A nice 10 minute stroll will take you through some nice shop filled streets as you head you way to the river and where the bulk of the restaurants are located.", "title": "Nice little Hotel", "user": "JLMelbourne", "date": "August 12, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 3.0, "rooms": 3.0}, "id": 18893182, "likes": {"liked": "— Bathroom", "disliked": "— Decor"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2008", "text": "The room itself was a little on the dark side. The rooms are probably getting in need of a facelift - bed was comfortable - bathroom was in good condition, large and clean. The busy breakfast room provided a quality large buffet breakfast.", "title": "Good location, good value for a 4star if you get the quad room", "user": "ferrettfish", "date": "August 10, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "business": 3.0, "cleanliness": 4.0, "rooms": 4.0, "location": 4.0}, "id": 18815087, "likes": {"liked": "— room size, location, breakfast", "disliked": "— walk to station is hard on narrow streets."}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "All in all, hard to get overly excited by the hotel, but we felt that it did the job it was meant to do,", "title": "Beautiful hotel", "helpfulness": 1, "user": "ChucksPride", "date": "August 9, 2008", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 18777892}, {"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "Stayed in the Hotel for two nights. The room was very good with very large double bed, flat screen LCD TV with various channels including BBC News 24 and Sky News. Great selection of toiletries provided in the bathroom.", "title": "Great Hotel - Recommended", "helpfulness": 4, "user": "GrahamUnitedKingdom", "date": "May 21, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 7667696, "likes": {"liked": "— Large clean room with very comfy bed."}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "No tea/coffee making facilities provided so take a travel kettle. Plenty of electric sockets available in room.", "title": "Great Hotel", "helpfulness": 1, "user": "Lucii", "date": "May 20, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "rooms": 5.0, "location": 5.0}, "id": 7654732}, {"rating": 4.0, "title": "Very helpful staff/comfortable stay", "text": "If you want to buy food, beer or wine go to Pams Supermarket. This a reasonble sized shop selling everything. Gets very busy in the evenings. To get there come out of hotel and turn right. Take the first right down a narrow road which brings you to the main shopping street. This is pedestrainised. Go to the other side and Pams is up one of the roads opposite on the left hand side.", "helpfulness": 2, "user": "Shestu", "date": "May 15, 2007", "id": 7627784}, {"rating": 3.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "Great black out curtains with double glazed window and traditional shutters. Previous reports have complained about noise, we were on the third floor at the front and heard very little.", "title": "okay stay, felt ripped off about the area map", "user": "suny2225", "date": "May 13, 2007", "detail_rating": {"front_desk": 2.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "location": 4.0}, "id": 7595162, "likes": {"liked": "— The central location", "disliked": "— rather than provide a tourist map, they flog their own guide book for 3 euros"}}, {"rating": 3.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "The Hotel provides a great internet service with two computers available. One is just off the lounge area and the other tucked away just off the reception area. This one even has SKYPE facility with web cam and headphone/microphone provided. Very reasonble cost at two euros for one hour.", "title": "Good location but needs interior sound proofing", "helpfulness": 1, "user": "JimmyandHeather", "date": "May 9, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 3.0, "rooms": 3.0}, "id": 7568942, "likes": {"liked": "— Good location", "disliked": "— Noise echos"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "We stayed at The Bologna for 4 days, only about 10 mins from the airport, we used the hotel shuttle bus service to collect us for only 10 euros. The Hotel staff are helpful & all speak very good English. Our room was very nice, huge bed, plenty of wardrobe space, towels & linen changed daily, mini bar (not that we took advantage, as usual very pricey, get yourself round the corner to the 'Pam' supermarket for your supplies, don't forget to pack your corkscrew!) also free safety deposit box. The only thing we would have liked in our room was tea/coffee making facilities for that early morning cuppa. Continental style breakfast.", "title": "Great base", "helpfulness": 1, "user": "GPMDorset", "date": "May 7, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 7554143, "likes": {"liked": "— Quiet side street, central location", "disliked": "— No coffee making facilities in room, would had liked a bath as well as a shower."}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled with family", "text": "Ideally situated in a quiet side street not far from the River Arno & only about 15-20mins walk from the Leaning Tower.", "title": "Excellent family room", "helpfulness": 1, "user": "MrsBLeicester", "date": "April 23, 2007", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 7420072, "likes": {"liked": "— The really big clean family room", "disliked": "— It could be noisy if you had the windows open"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "Florence well worth a visit for the day, we took the train (again only about 10-15mins walk from the hotel in the opposite direction from the river). Overall we would recommend this hotel, clean & comfortable & a good base to explore the city.", "title": "Great hotel, good location", "helpfulness": 1, "user": "Monk-san", "date": "April 21, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 4.0}, "id": 7406721, "likes": {"liked": "— Good quality all round city hotel", "disliked": "— There was nothing I didn't like"}}, {"rating": 3.0, "title": "Hotel Bologna not half bad", "text": "Word of warning, DON'T go the 'Ristorante Il Nuraghe' opposite, we had a meal there & when the bill arrived (written on a scrap of paper & not itemised) they had tried to charge us for items that we hadn't ordered, when we queried this the chef became very abusive & aggresive. Another couple that were dining there at the same time (also guests at the Bologna) thought they had been over charged but didn't say anything & had already paid, though their bill was on a proper invoice.", "helpfulness": 2, "user": "rokeby", "date": "April 17, 2007", "id": 7380527}, {"rating": 3.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "We stayed here for one night (April 2nd) on our way back to England. Our room was perfect. It was huge and the king size bed was wonderful and very comfortable as were the single and roll-a-way for our children ages 11 and 9. Everything was very clean and the bathroom was big too except there was no bath in it. However, the shower was excellent. Great toiletries. The breakfast was o.k. - the usual pastries, fruit, cereals etc. All you really need - great pot of tea! Quite a popular hotel as the restaurant was full. Staff very helpful and excellent English. We parked our car all day for 20 Euros in the hotel carpark and left our luggage in it after checkout so we could further explore Pisa before our early evening flight back to Nottingham. Our room was on the main street at the front of the hotel. Would have been quite noisy however if we hadn't had the windows closed, but we were o.k. with the temperature for the time of year. There is airconditioning for the summer months. 2 days was enough to see mostly everything in Pisa. Hotel a short 15 minute walk over the bridge to the main sights. One word of advice, don't eat at the restaurants on the street leading up to the Tower. The food was terrible and the service was worse. They try to hound you in, there is a competition thing going on between them all. We would definitely stay at the Bologna again and certainly recommend it for the price.", "title": "Great Location", "helpfulness": 2, "user": "MaltaOzzie", "date": "March 31, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 3.0, "rooms": 4.0, "location": 5.0}, "id": 7259061, "likes": {"liked": "— The staff at the Front Desk & The cleanliness of the room", "disliked": "— Noises in the corridor"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2008, traveled with friends", "text": "Hotel Bologna is perfectly situated in Pisa; close to the railway and bus stations (both approx 10 minute walk); 5 minutes to the river and about a 20 minute stroll across to the Leaning Tower area.", "title": "Great City Break Hotel", "user": "BerylP", "date": "September 27, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 20414493, "likes": {"liked": "— Cleanliness; comfort; central location", "disliked": "— noise from the street"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled with family", "text": "We have just come back from a 3 night stay at Hotel Bologna. We found the hotel staff to be polite and friendly, and very helpful; the hotel decor restful and well furnished; and the rooms to be extremely clean and comfortable, and of a good size. Towels were plentiful changed every day; the bathroom (with shower and bidet) stocked with shampoo; bath foam; vanity kit, etc., and the mini-bar was well stocked.", "title": "Great Location", "user": "rainraingoaway", "date": "September 26, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 20389256, "likes": {"liked": "— Location", "disliked": "— Price"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "Breakfast in the beautifully decorated dining room was excellent; a good selection of fresh breads, cakes, biscuits; along with the usual continental fare; also hot bacon and scrambled eggs. All the food was replenished frequently and the wide choice was still available towards the end of the breakfast time. The staff were efficient and tables cleared quickly. It was very nice to have linen napkins at breakfast.", "title": "Good city centre location", "helpfulness": 2, "user": "AvidHolidaymaker", "date": "September 18, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 20167247, "likes": {"liked": "— Convenient city centre location", "disliked": "— No outdoor space"}}, {"rating": 3.0, "stay_parameters": "Stayed July 2008, traveled solo", "text": "All in all I would thoroughly recommend Hotel Bologna. Only one negative comment: we had a room on the 2nd floor overlooking the street. It is very noisy - there is a small cafe/club opposite which never seemed to have more than 4 people inside but they seemed to make enough noise for 20 people! Also, the traffic starts up around 4.00am, with buses, large vans, thundering down the road. However, the charm of the hotel more than made up for this short-stay inconvenience, and after a long day sight-seeing and a few glasses of the local wines, we were so tired that nothing could keep us awake too long!", "title": "Good Location", "helpfulness": 1, "user": "Min2008", "date": "August 27, 2008", "detail_rating": {"front_desk": 4.0, "business": 1.0, "service": 4.0, "cleanliness": 5.0, "value": 2.0, "location": 4.0, "rooms": 2.0}, "id": 19445923, "likes": {"liked": "— location", "disliked": "— Really really small room size."}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "Apart from the Leaning Tower, there is not much to see in Pisa, but if you are intending to buy souvenirs get them there rather than in Florence, which is very expensive. I bought a medium sized leather bag in Pisa for 38 Euros from one of the stalls near the Tower; the same bag was 59 Euros in Florence.", "title": "Excellent Hotel Highly recommended", "helpfulness": 1, "user": "lakesman44", "date": "August 27, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 19435052, "likes": {"liked": "— Great customer service", "disliked": "— n/a"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "Good location (about 15mins walk from leaning tower). Nice rooms (mini bar, air con, LCD TV).", "title": "Good hotel", "helpfulness": 1, "user": "cathybr", "date": "June 10, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 7828481, "likes": {"liked": "— Location", "disliked": "— 20 Euros charge for car park"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2007", "text": "Buffet breakfast. Would stay again next time we are in Pisa.", "title": "Great location, comfortable stay, helpful staff.", "helpfulness": 2, "user": "AlWilbury", "date": "June 7, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 7803057}, {"rating": 2.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "Booked this hotel for one night in May, before early flight back to the UK, based on location and positive review here and didn’t regret the decision.", "title": "good location", "helpfulness": 1, "user": "holidaymakerstirling", "date": "June 3, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 4.0}, "id": 7750745, "likes": {"liked": "— big clean room", "disliked": "— noisy staff at 5am"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "Very good location – just a short 5-10 minute walk from the train station, a 10-15 minute walk to the commercial centre and Tower attractions and hotel offers reasonably priced, efficient and very convenient shuttle service to the nearby airport.", "title": "Very Comfortable!!", "helpfulness": 1, "user": "Goneagain", "date": "May 30, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 3.0, "location": 4.0}, "id": 7715571, "likes": {"liked": "— The quiet comfortable room", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "Room and bathroom not huge, but very clean and comfortable with convenience of minibar and LCD TV. We were glad we had a quiet room overlooking the very nice courtyard, rather than overlooking the street, which seemed quite busy.", "title": "great hotel", "helpfulness": 2, "user": "ensoul3", "date": "May 23, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 3.0, "location": 4.0, "rooms": 5.0}, "id": 7681856, "likes": {"liked": "— wonderful rooms"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "Stayed there for one night after flying in to Pisa airport late.", "title": "Immaculate and very helpful", "user": "dunedin_al", "date": "November 13, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 21828372, "likes": {"liked": "— Condition, location"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "Hotel was refurbished earlier this year and room was very clean and in perfect condition.", "title": "Comfortable hotel", "helpfulness": 1, "user": "cv-one", "date": "November 8, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 3.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 21655860, "likes": {"liked": "— Excellent service", "disliked": "— Breakfast room too small."}}, {"rating": 5.0, "stay_parameters": "Stayed October 2008", "text": "Great location - short taxi ride from airport (under €10) and just 15 mins from the Tower (I know as I forgot to take my online booking with me and had to go back!)", "title": "Lovely and clean", "helpfulness": 1, "user": "LoveTea", "date": "November 2, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 21470444}, {"rating": 4.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "Staff very helpful and pretty good breakfast.", "title": "Charming", "helpfulness": 1, "user": "FyingKiwi", "date": "October 27, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 21320856, "likes": {"liked": "— Historical Character", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled with friends", "text": "Not necessarily cheap but fair value from my perspective, at least out of season", "title": "loved the bologna", "helpfulness": 1, "user": "stella016", "date": "October 25, 2008", "detail_rating": {"cleanliness": 5.0, "front_desk": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 21191440, "likes": {"liked": "— lovely bathroom clean and nice clean bedding", "disliked": "— nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2005", "text": "This isn't a typical Hilton-style hotel. It's very European, and that means accepting certain inevitabilities - the bathroom will be small, the furnishings are spartan and the meals are basic.", "title": "Above average European hotel", "helpfulness": 2, "user": "Tendons", "date": "July 15, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 3669058}, {"rating": 4.0, "stay_parameters": "Stayed July 2005", "text": "Having said that, this hotel has a real style and charm which makes it well worth the money. It's set on a quiet street, close to the main shopping areas, station and main attractions. It's in the heart of the city, so you get a real impression of what it's like to be a resident of Pisa.", "title": "good base", "helpfulness": 10, "user": "TerryPheasant", "date": "July 11, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "service": 5.0}, "id": 3657168}, {"rating": 4.0, "stay_parameters": "Stayed June 2005", "text": "My only complaints are: the wooden floors and thin walls made it noisy last thing at night, and early in the morning (maybe we just had inconsiderate neighbours?); and there was no outside area/bar to sit and relax after a day's sight seeing, although the cafe just round the corner made us more than welcome.", "title": "Central Location", "helpfulness": 3, "user": "bombshell", "date": "June 29, 2005", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 3620578}, {"rating": 4.0, "title": "Enjoyable stay", "text": "We'd probably stay here again, but only for one or two nights.", "helpfulness": 2, "user": "alison.mather", "date": "June 20, 2005", "id": 3576770}, {"rating": 4.0, "title": "A good place to stay", "text": "I booked the hotel on the strength of its reviews here on tripadvisor.com and it being the best rated hotel in Pisa.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "June 20, 2005", "id": 3576695}, {"rating": 3.0, "stay_parameters": "Stayed September 2008, traveled with friends", "text": "Finding the hotel was relatively easy. I arrived at Pisa station and asked a shopkeeper for directions and it was about a 10 min walk.", "title": "ok hotel for a short stay", "user": "Balluli", "date": "October 24, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 2.0, "rooms": 2.0, "location": 3.0}, "id": 21182431, "likes": {"liked": "— clean room", "disliked": "— noise and hot room"}}, {"rating": 3.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "I only stayed at this hotel for one night (arriving at approx 6pm and leaving at 5am the next morning). During the night, the room was very hot even though the air conditioning was on. It was also very noisy and originally I thought the noise was coming from a room upstairs, but later on in the night after opening the window, I realised that the noise was coming from outside as there was some sort of all night kitchen there (this seemed to be the reason the room was also very hot).", "title": "OK for a short stay", "user": "severus", "date": "October 21, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "location": 4.0}, "id": 21067906}, {"rating": 4.0, "stay_parameters": "Stayed October 2008", "text": "The room itself was very clean and spacious, and the bathroom was also very clean. A kettle is provided in the room, but seemed to be a bit dangerous as once it started to boil, it didn't cut off and I had to turn the switch off myself. Milk hadn't been provided, so I had to request this from the bar/reception.", "title": "Friendly staff, excellent value", "user": "JayEmAitch", "date": "October 16, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 4.0}, "id": 20939390}, {"rating": 4.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "On check-in, I had mentioned to the receptionist that I would be checking out at 5am and she said that doggy bags with breakfast would be provided, however, on checking-out, it was a different receptionist and I forgot to ask for the doggy bags and he didn't mention anything. He did ask if the stay was comfortable and I mentioned the air conditioning and noise and his only comment was that if I'd mentioned the noise in the night, he would have looked into it. The hotel's taxi cost 15 euros to the airport (it is a short journey away - approx 3 minutes).", "title": "Overpriced", "helpfulness": 1, "user": "joanna070768", "date": "October 14, 2008", "detail_rating": {"cleanliness": 5.0, "front_desk": 5.0, "location": 3.0, "service": 5.0, "rooms": 3.0}, "id": 20862607, "likes": {"liked": "— Cleanliness and helpfuilstaff", "disliked": "— Cramped room and busy street. Lack of sleep."}}, {"rating": 2.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "The staff were friendly and all of them spoke good English. The leaning tower is approximately a 20 min walk from the hotel. The area the hotel is in ok and I would stay here again, but not on the same floor near the kitchen!", "title": "be warned", "user": "nickold", "date": "October 8, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "cleanliness": 5.0, "value": 1.0, "rooms": 1.0, "location": 1.0}, "id": 20732521}], "location": {"country": "Italy", "region": "Tuscany", "continent": "Europe"}, "stars": 4, "variance": {"poor": 56, "average": 164, "very good": 617, "terrible": 27, "excellent": 604}, "aka": "Pisa Bologna Hotel", "slim_ranking": 0.0459770114943, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.5}, "description": "Staying at Hotel Bologna puts you right in the heart of a city that combines the natural beauty of its setting with an atmosphere that remains highly evocative of its medieval heritage. In every room: sat-tv in 4 languages, WiFi internet connection (1 hour free), safety deposit box, mini-bar with free water, hair-drier, adjustable heating, 24/7 room service."}