{"user_rating": 4.0, "review_count": 641, "name": "Bonvecchiati Hotel", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed October 2010, traveled solo", "text": "I must admit after reading the harsh previous reviews about their terrible experiences I did attempt to cancel my reservations prior to my trip. Since the hotel had already booked the first night on my credit card I decided to stay at least one night and make my own opinions.", "title": "High 3 Stars - an objectively, optimist review! (albeit long)", "helpfulness": 7, "user": "ILuv2trvl_7", "date": "November 3, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 85909183}, {"rating": 2.0, "stay_parameters": "Stayed October 2010, traveled with friends", "text": "Luckily I listened to my sixth sense and upon my arrival at the hotel I was glad that I kept my reservation for my entire trip. Below is a very honest and objective opinion of my recent stay (10/29 – 11/2) at the Hotel Bonvechiatti in Venice, Italy.", "title": "Nice hotel, unhelpful and snobby front desk staff.", "helpfulness": 3, "user": "bkwelch", "date": "October 31, 2010", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 2.0, "sleep": 2.0, "rooms": 4.0, "location": 5.0}, "id": 85444711}, {"rating": 1.0, "stay_parameters": "Stayed April 2010, traveled with family", "text": "LOCATION, LOCATION, LOCATION: The best asset of this hotel is its’ location. I decided to splurge and take a private boat from VCE airport to the hotel ($110Euro but well worth it). I didn’t want to worry about finding the location on my own schlepping luggage in a new, foreign city with no cab service!. I arrived @ 11:30am and my room was not ready – no harm since check in was not for hours (@2pm). I had the bellhops take my luggage and decided to walk around St. Marc’s Square and stop for lunch at a restaurant on the Grand Canal until I returned to the hotel at @ 2:30pm. The 2 major sites – Rialto Bridge and St. Marc’s Square are within EASY walking distances from the hotel. Again, the location of the hotel made it an \"excellent choice\" for my first visit to Venice", "title": "Moldly, Sad, and Poorly Maintained", "helpfulness": 2, "user": "bailliejk", "date": "October 24, 2010", "detail_rating": {"service": 2.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 4.0}, "id": 84660200}, {"rating": 3.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": ".", "title": "good location, only 3 star room at best", "helpfulness": 2, "user": "luuvtotravel", "date": "October 24, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 2.0, "sleep": 2.0, "rooms": 1.0, "location": 5.0}, "id": 84648113}, {"rating": 3.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "ROOM: My hotel room was #404 and I took the “smallest elevator on earth” with the very professional bellhop who carried my bags to my room. Upon entry I was astonished at the small size of the room. I have never stayed in a hotel room so small but again I had read the previous posts about the small rooms so I said “When in Venice…” and put it in the back of my mind. The room was CLEAN, well attended, mini-bar stacked; closet space and hangers sufficient for the amount of clothing I packed, and the bathroom amenities were plentiful and appropriate. The bathroom (also small yet functional) had a heating rack for the towels, hair dryer on the wall, windows that fully opened, magnifying mirror for make-up, SMALL bathtub (which I did not use), free standing shower head (took a day to get used to it without wetting the floor), a body weight scale (also did not use – WHY would I on vacation?!), extra toilet paper, plunger, and plenty of lighting. Again, also the smallest bathroom I’ve ever used but no complaints.", "title": "Worst room we've ever been allocated in 24 years of extensive travel!", "user": "HoberieAberdeenshire", "date": "October 20, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 84192633}, {"rating": 2.0, "stay_parameters": "Stayed August 2010, traveled with friends", "text": "The lobby and restaurant were nice, but the room was quite old and out-dated, and very small. The staff was a mixed bag, the reception staff were very helpful, but the restaurant staff were quite rude. I would not recommend this hotel though, because after we left, they charged us for breaking a mirror in the room. There was a crack in the mirror which was definitely there when we arrived, and they charged us 70 euros for it. They charged us without even sending an email to let us know why. When I tried reason with management, they insisted that we must have caused the damage without realising it (how you could cause a mirror to crack without realising it is beyond me). I would certainly not stay there again.", "title": "Hotel was ok, but worn down, and they tried to charge us for damages we didn't cause", "helpfulness": 1, "user": "helbell52", "date": "September 19, 2010", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 5.0}, "id": 80193541}, {"rating": 3.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "The lobby is impressive, but the rooms are small and worn. Our room, 106, had a wood floor, and throw rugs that were thin, worn and shabby. The bathroom was small, and the shower stall had a curtain that was 6\" short, hence, the water flooded the floor. The tiled floor in the bathroom is slippery, and hazardous. Our room overlooked the alleyway alongside the hotel, and was across and overhead from the bar next door. Nights were loud. My sister's room, 303, was almost a closet. THere was barely room to walk around the two twin beds.", "title": "A mixed bag--common areas are nice, but rooms old, worn, shabby", "helpfulness": 2, "user": "ylbuckwheat", "date": "August 18, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 2.0, "rooms": 2.0, "location": 3.0}, "id": 75833938}, {"rating": 2.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "The dining room was elegant, with a superb breakfast offering. The hotel does have it's own landing, so travel by water taxi is very convenient. The desk staff speak English, but are not very helpful. Tours to Murano are offered, with travel to the island complimentary, but you must arrange with the island water taxi for your return at your own expense. For the price, I think there are better values elsewhere.", "title": "Very disappointing - a complete let down", "helpfulness": 2, "user": "MRMLondon", "date": "August 16, 2010", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 1.0, "sleep": 2.0, "rooms": 1.0, "location": 4.0}, "id": 75434528}, {"rating": 4.0, "stay_parameters": "Stayed May 2010, traveled on business", "text": "Whilst the location of this hotel is fantastic, right between the Rialto Bridge and St Mark's Square, that just doesn't justify the exorbitant price. €400 a night when there is no way we should have been paying anymore than €100 for it in any other city.", "title": "Classic Hotel in Great Location with Small Clean Rooms: Value", "user": "Great_Expectations84", "date": "July 4, 2010", "detail_rating": {"service": 2.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 69700606}, {"rating": 3.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "Hoping for a really special hotel (with planned proposal in mind), hugely disappointed by the service and, in particular, the room. Despite paying for the upgrade, we were put in probably the smallest (and darkest) double bedroom I have ever seen - when queried at the front desk, they argued that it was a \"superior\" room because the window overlooked the back of a canal. Whilst they did change us for the 2nd night into a bigger and brighter room, the damage had already been done.", "title": "Pricey but had advantages", "user": "New Orleans gal", "date": "June 24, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 68600847}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "Great location, good service and good sized room. Everything in good working order. Staff could not be more friendly. Breakfast choice excellent. But please Venice get your act together. We want tea making facilities in our rooms. If you want an international clientel then cater for them. An half board option would also go down well.", "title": "Good hotel, great location, But!", "helpfulness": 3, "user": "georgieboy63", "date": "October 7, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 82490086}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "You should not have to drag a kettle half way round the world in this day and age.", "title": "Wonderful experience", "helpfulness": 1, "user": "JoniAbel", "date": "September 27, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 81209917}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "We planned our trip through AAA who selected the hotels. I did a careful check of reviews before the trip and am glad we got this hotel. We took a water bus from the airport & to the train station, was enjoyable. The front desk was so nice & helpful, Carmen spent some time showing us where we were on the map & places to go around us. We felt very safe in the area. The room was fine, small but most all the rooms we stayed in Italy were small. The bathroom was very tiny but we just felt it's all part of the experience. Slept great, no street noise at all. We didn't go to the restaurant so I have nothing to review there. Would stay again & again.", "title": "Excellent location, good hotel", "helpfulness": 1, "user": "Doodlepidge", "date": "September 24, 2010", "detail_rating": {"service": 2.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 80858801}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "On arrival we were upgraded to a deluxe room in the annexe about 50 yards down the canal. The upside was that we had a corner room with views of the gondoliers parking bay and plenty of entertainment from the window. The downside was that we got very wet one morning during a storm on our way to breakfast. The room was large, lovely bathroom, comfortable bed, plenty of storage space. Breakfast was average for a European hotel - the cooked bacon & scrambled eggs were not very edible but the rest was very good. This hotel is billed as being by Rialto as this is the best stop on the waterbus from the airport or railway station, but it is actually closer to St Marks Square. We were able to walk everywhere and saved money on transport.", "title": "excellent location", "helpfulness": 2, "user": "lovestotravelNorfolk", "date": "September 22, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 80634689}, {"rating": 2.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "We were upgraded by Citalia to a Superior Room with a Canal View. The Canal View was a minor canal but it was lovely to see the gondaliers going by, when we were in the room. The room was the size that they stated on their web site, so size was ok but Room 227 was worn and shabby. The writing table was badly chipped. However, we could not fault the Staff at the Reception and the Restaurant. We did not eat there too expensive but they provided us with hot water and milk every evening as my husband only drinks decaffeinated tea. Breakfast was very good and from another review I learnt to always order cappucinno from the waitress,as the coffee on the breakfast table was not nice. We travelled by a budget airline into Treviso Airport and there is a brilliant coach service to Venice Bus Station Pizzale Roma at a cost of 9 euros return and then we took the waterbus to Hotel. We would never use a water taxi they are too much money. If mobility is an issue then the waterbus tickets that can be purchased for longer times are very good. You can use them to other places including islands. Something that I wish had been on the site, near the Boat Stations at Pizzale Roma (No 42) is a Co-op. We collected our bottles of water when we were down there and got biscuits to take home as gifts. Buy pasta at Treviso Airport when leaving so much cheaper. We do not believe that this Hotel should have a 4Star rating. However, the maid and porter service was excellent. The toiletries supplied, bathrobes, slippers etc were what we would have expected of 4 Star and the location was fantastic.", "title": "Great Location but very average hotel", "helpfulness": 1, "user": "paddy1mac", "date": "September 22, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 2.0, "location": 5.0}, "id": 80623748}, {"rating": 4.0, "stay_parameters": "Stayed May 2010, traveled on business", "text": "Super central, between St Marks Square and Rialto Bridge. Beds were very comfortable, never slept so good. Breakfast was normal hotel standard, coffee not so good.", "title": "Good 4 Star Hotel - fantastic location", "user": "annietue", "date": "June 1, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 66031456}, {"rating": 4.0, "stay_parameters": "Stayed May 2010, traveled solo", "text": "Friendly staff at the reception.", "title": "Turned out really good!!!", "user": "Aerotrip", "date": "May 28, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 65619755}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled with friends", "text": "We originally booked through Octopus Travel two rooms at the Palace Bonvecchiati but on checking in we were taken to the adjoining sister hotel the Bonvecchiati. Our rooms were 501 and 507 on the 6th floor and required an additional walk up two flights of stairs to reach them. Room 507 had a view of the Campanil, the Basilica and Doges Palace. These were twin rooms and for a single person adequate in size. The rooms were so quiet at night to sleep in and excellent airconditioning. Room 501 shower screen was 'interesting' in it's operation!!", "title": "Excellent hotel & location", "user": "Petru55", "date": "May 23, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 65057053}, {"rating": 5.0, "stay_parameters": "Stayed December 2008, traveled as a couple", "text": "A great breakfast and hotel in a perfect location only a 3 minute walk to the Rialto Alilaguna dock.", "title": "Memorable stay", "helpfulness": 1, "user": "Nomanslander", "date": "April 13, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 61174334}, {"rating": 3.0, "title": "Great location, but very very noisy", "text": "Although a little disappointed not to be in the Palace Bonvecchiati again, the sister hotel was very good and rooms 501 and 507 certainly seemed to be to the same standard. We would stay here again.", "helpfulness": 2, "user": "lisa222", "date": "April 12, 2010", "id": 61102835}], "location": {"country": "Italy", "region": "Veneto", "continent": "Europe"}, "stars": 4, "variance": {"poor": 70, "average": 100, "very good": 236, "terrible": 35, "excellent": 200}, "aka": "Bonvecchiati Hotel Venice", "slim_ranking": 0.40157480315}