{"user_rating": 5.0, "review_count": 9, "name": "Boothe House Bed & Breakfast", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "We had an excellent overnight stay at the Boothe House B&B last weekend in Gonzales. We were in town for a party that was taking place a few blocks away so the location was perfect. We had been by the house when it was up for sale a few years ago and the transformation is amazing. The inside is just beautiful with gorgeous furniture that is still comfortable to relax on.", "title": "Great Stay - Lovely B&B and Innkeeper", "user": "jodi_123", "date": "July 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 134920984}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "The innkeeper, Michelle, certainly knows how to make you feel at home. Even faced with AC problems she ensured we were comfortable during our hot July stay. The pool was clear and our quick late night swim cooled us down after being in the heat all day at the party.", "title": "\"Southern Comfort\"", "user": "jodi_123", "date": "July 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 134235960}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "We stayed in the Texas Star room and my only comment is that the bed mattress leaned a bit to the side, since the room was so romantic we kind of liked it, I think the mattress was fairly new so they may want to check it out. The linens were obviously of high quality and I was so glad that Michelle provided turn down service; I wasn’t sure where to put all the fluffy pillows on our bed. The bathroom was huge! Big spa tub (no time to use it), walk in shower, two sinks and great towels.", "title": "Charming, Relaxing Elegance", "user": "KHA_12", "date": "June 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 132782528}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "Breakfast the following morning was “the cherry” on our visit. A nice egg soufflé with great flavor, the freshest blueberry muffin I’ve ever tasted, fresh strawberries and plenty of juice, milk, coffee. It really hit the spot before the drive back to Austin. And again, Michelle provided outstanding service in letting us pick a reasonable (9 am) breakfast time and eat at our leisure.", "title": "So lovely", "user": "Wooferella", "date": "May 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130864814}], "location": {"country": "United States", "city": "Gonzales"}, "variance": {"poor": 0, "average": 0, "very good": 0, "terrible": 0, "excellent": 9}, "slim_ranking": 0.5}