{"user_rating": 4.0, "review_count": 39, "name": "Boothbay Resort", "reviews": [{"rating": 1.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "We went out for a wedding and we arrived to have to wait 45 minutes because there was no one to check us in. The cottage was cute and had enough room, but paint was peeling everywhere and the furniture seem to come from a collage dorm. Supposedly it has wifi, but I never picked up a signal and when we asked about it we were treated rudely as if we were stupid. House keeping seemed to be non-existent. The whole place is on gravel, so you have to where sandals to the pool which was falling apart as well as the Jacuzzi which had green water and broken jets. There were some form of RED ANTS everywhere and I was bitten on the neck and had to take Benadryl and ice it for 3 hours to reduce the swelling. I brought it to the owners attention that these were all over the patio in front of the cottage and was told we have ants here in ME and they refused to do anything about it. Every time we engaged the staff at this place we were treated rudely and dismissed as pests. I would not stay here again if it were free. Oh look out for the 10% hospitality fee they tack on your bill.", "title": "Stay Away, Beyond Rude, Run Down and Starting to Fall Apart.", "helpfulness": 1, "user": "bob_the_snob_2009", "date": "August 26, 2009", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "location": 2.0, "service": 1.0, "rooms": 2.0}, "id": 38859762}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "my family and i, along with my sister and her family, had the pleasure of staying with lori and win at the boothbay resort.", "title": "a great trip to maine, thanks to boothbay resort!", "user": "plovestotravel", "date": "August 11, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 37417758}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "our cottage was adorable. clean, enough room for 4 and comfortable. we took advantage of the picnic table and grill right outside our door. the kids were able to swim, ride their bikes around safely and we even got a great game of kickball going on the green in the middle of the resort. we also took advantage of the firepit to make s'mores!", "title": "Comfortable Getaway", "helpfulness": 1, "user": "RideMaine", "date": "July 5, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 33918813}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "we loved going to the pool deck for breakfast and lori gave some great advice on things to do in the area.", "title": "What an enjoyable place to stay at.", "helpfulness": 2, "user": "HikerRochester_NY", "date": "June 19, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 4.0, "rooms": 3.0}, "id": 32708402}, {"rating": 4.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "we were totally relaxed and very happy on our vacation, and alot of it had to do with staying at this resort. anyone traveling to boothbay, and i recommend it, should give the boothbay resort a try.", "title": "Maine Hospitality at it's Finest", "helpfulness": 1, "user": "travelswithdogs8", "date": "May 26, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 30794682}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "Since I didn’t find very many recent reviews on TA, I wasn’t sure what to expect. We were all pleasantly surprised and would recommend Boothbay Resort to families with children and/or canines.", "title": "Quiet and Relaxing Family Vacation", "helpfulness": 1, "user": "Daphne418", "date": "July 8, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 3.0, "value": 5.0, "service": 3.0}, "id": 115161911}, {"rating": 3.0, "stay_parameters": "Stayed July 2011", "text": "The resort is set off the main road and a very quiet property. We had a 2 bedroom cottage with ample parking for 2 cars. All the cottages are spread out enough so you couldn’t hear the guests next to you. (Hopefully no one heard our crying baby at 3am!) The cottage was modern, updated, and very clean. I liked the faux wood floors versus carpet – you never know what’s been on those carpets at the chain motels. There were good quality bed linens and towels, not the cheapo thin towels and sheets that you can see through. We had all the cooking utensils and plates needed. The bedrooms were a little snug but we were able to fit our travel crib in a corner. You could not tell that our cottage was a dog friendly as it was in good condition, smelled clean, and no hair from previous canine guest. Only downsides were...it got a little warm and muggy over the 4th – while there was a good AC in the living area, the bedrooms got warm and stuffy. But there was also a floor fan provided that alleviated some of the discomfort. Also the free wifi was weak and slow but at least there was wifi.", "title": "Small, basic cabins - good for families + pets.", "helpfulness": 2, "user": "neige8", "date": "July 7, 2011", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 3.0, "service": 3.0, "rooms": 3.0}, "id": 115123464}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with friends", "text": "We enjoyed the wine tasting at the wine/beer shop attached to the office. The pool was clean and surprisingly warm and good towels provided. Wish we had more time for the pool...next time! The resort was close to Boothbay Harbor and was easy to get in and out of town.", "title": "This is a great place!", "user": "leebick56", "date": "June 25, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 3.0, "value": 5.0, "service": 4.0}, "id": 114744627}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "You can tell that the owners take good care and are proud of their property and I hope they continue to do so…what a nice little gem of a place. Great value too.", "title": "such a clean resort.....", "user": "HobokenPeg", "date": "September 7, 2010", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "location": 4.0, "service": 5.0}, "id": 78702494}, {"rating": 3.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "Basic accomidations. Cabins are small- but we were able to fit 5 adults per unit. Good for families and big groups. 10 min drive to BoothBay harbor. Dog friendly. Fire pit, picnic tables, lots of grass and a nice pool. The also have a wine, micro-brew and cheese store.", "title": "Overall good, but wouldn't recommend the three-bedroom cottage.", "user": "TripMurray", "date": "August 24, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 1.0, "rooms": 2.0, "location": 4.0}, "id": 76691958}, {"rating": 2.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "The room/cabin we had (a \"cedars\") was very small. The owners/inkeepers were not overly friendly nor accommodating, and any help they gave had the air of a favor as opposed to an included service. The \"kitchenette\" was actually a dorm room fridge, a microwave, and a hotplate stacked atop one another next to a folding table which featured a tray of mismatched and crusty utensils. And to top it all off, some lunkhead in an RV parked right behind our location, disrupting any view we had. Boothbay Harbor is a great town...highly recommend a visit, but stay somewhere else.", "title": "Not so hot", "user": "jc2238", "date": "August 9, 2010", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 2.0, "sleep": 2.0, "rooms": 1.0, "location": 3.0}, "id": 74505981}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled on business", "text": "Every year we come to Boothbay on business, last year we tried somewhere else to stay but we came straight back this year! The cabins are clean,relaxing and private. Microwave,fridge,hot plate, t.v and for those of us who have to work, clear and fast wi-fi. The lovely little, wine/cheese and beer shop. Well behaved dogs,happy to be with their people. I felt as if I had a mini holiday! Thankyou Lori,Win and family.", "title": "we keep returning", "helpfulness": 1, "user": "tiquer", "date": "August 2, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 73397631}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "Recently traveled with husband, dog, best friend, her niece and their 3 dogs. Loved the cottages and hospitality! Cedar cottages were quaint, clean and well-equipped. Dog friendly atmosphere and plenty of area to walk dogs. Especially loved the wine and cheese shop...how can you beat that??? Cute cottages, just a mile from gorgeous Booth Bay Harbor..and a wine and cheese shop on premises! Fantastic!!!", "title": "Dog friendly and fun!", "helpfulness": 1, "user": "harvey_tracey", "date": "September 11, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 40857691}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "We loved staying here! Spending time with the Mitchells and their families at this resort only magnified the amount of fun that we experienced in Maine. It was a great cottage, and we loved the hot tub after the locally suggested day trips. My husband and I especially enjoyed our 'breakfast with Bruce' every morning. He came up with great stories and great ideas for activities for us to get a look at the real Maine.", "title": "Boothbay Breakfast with Bruce!", "user": "oknett", "date": "September 2, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 39631956}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "We could not have asked for better lodging!!! Just stay here!", "title": "Beautiful, Relaxing, Kid friendly resort in Maine", "user": "tklements", "date": "August 29, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 39173910}, {"rating": 2.0, "stay_parameters": "Stayed September 2008, traveled with family", "text": "We found the owner rude and inflexible.", "title": "Very Inflexible", "user": "my3sonsboston", "date": "October 9, 2008", "detail_rating": {"cleanliness": 3.0, "front_desk": 1.0, "location": 3.0, "service": 1.0, "rooms": 3.0}, "id": 20767098}, {"rating": 2.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "This place is nice enough. The good: very clean, awesome pool, nice jacuzzi, cute little cottages. Also, it is very clear that the owners truly care about their business and are working very hard.", "title": "Gay and lesbian families, give it a pass", "helpfulness": 3, "user": "Scoutsmama", "date": "August 14, 2008", "detail_rating": {"front_desk": 2.0, "business": 2.0, "service": 2.0, "cleanliness": 4.0, "value": 4.0, "location": 3.0, "rooms": 4.0}, "id": 18964454}, {"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "The not so good: smaller cottages don't really have \"kitchenettes\", they have microwave + tiny fridge; breakfast isn't really a continental breakfast, but is waffles, coffee and fruit punch made with artificial sweeteners. Every. Day. The wireless signal wasn't all that strong. Also, fyi, the \"Cedars\" cottages are right by the pool, so can be loud. This wasn't a problem for us, but just so you know...", "title": "Lovely cottages close to many attractions", "user": "chinawells", "date": "July 23, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 3.0, "rooms": 5.0}, "id": 18179452, "likes": {"liked": "— Dog friendly. Immaculate rooms. Lovely grounds.", "disliked": "— Road noise."}}, {"rating": 3.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "None of these little things really bothered us. What made this place sort of a drag was its low-level homophobic vibe. Our family = two women and a baby and this was clearly an issue, not with everyone but with several of the family-owners, especially the woman who owns the little shop on the premises who was quite cold to all of us. It was more of a cool shoulder from the others, but given that they were falling down nice to everybody BUT us, it was hard not to notice the *lack* of friendliness to us.", "title": "Nice stay in Boothbay", "user": "jamhog", "date": "July 22, 2008", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 3.0, "rooms": 2.0}, "id": 18153363}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "We have friends who were going to go there this fall, now they've found other arrangements. It didn't ruin our vacation, but it did leave us with a bad feeling, not something that you want to deal with on vacation. So, I suggest that gay. lesbian, otherwise alternative families and the people who love us steer clear of this place.", "title": "What a Fantastic Place!", "user": "veetha", "date": "August 27, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 8518254}], "location": {"country": "United States"}, "variance": {"poor": 3, "average": 5, "very good": 11, "terrible": 2, "excellent": 18}, "aka": "Boothbay Hotel", "slim_ranking": 0.5, "description": "“Where else can you stay and have Boothbay’s only Micro Brewery and Vintage House Wine & Cheese Shop at your cottage door!” A cottage resort located just 1 mile from Boothbay Harbor and many coastal attractions. All the comforts of home including outdoor heated pool, hot tub, Bocce court, Golf putting greens, outdoor grills. Pets are welcome in certain cabins or cottages."}