{"user_rating": 5.0, "review_count": 391, "name": "Borgo Argenina Bed and Breakfast", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled with family", "text": "Our first trip to Borgo was several years ago,when I called Elena for a reservation for an impromptu stop between Rome and Florence. She asked how many nights, I said one, she said no, it was not worh my time or hers. I then made the best decision of my traveling life and rearranged my entire schedule and stayed booked three nights. I am sorry that it wasnt' more. An ideal location for seeing Tuscany and the Chianti. Plus calm beauty of bringing home a few bottles form the nearby vineyards and spending each afternoon on the patio overlooking the fields and vines with a glass of wine and usually some cheese and cold cuts purchase in Gaiole. Elane and her daughter the best consierges with great info on where to eat, wineries and nearby sights. Can't wait to get back in 2012. We always schedule our trip around this stop.", "title": "Worth the trip to Italy especially for wine lovers", "user": "TackH", "date": "November 18, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 87514080}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "Borgo Argenina is a warm, friendly, most beautiful restored hamlet. Elena Nappa owns, runs and lives at the B & B. Our five nights there were the hi-light of our first visit to Italy. It is off the beaten path, yet closer enough to explore the surrounding area. We wish that we would have had another five days. Thank you Elena for a most memorable time.", "title": "The Borgo Argenina was a little piece of heaven in the Chiante Classico Area.", "user": "ItalyOct2010", "date": "October 28, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 85218277}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "Ron and Susan", "title": "Food for your soul", "helpfulness": 2, "user": "gsinha", "date": "October 28, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 85178702}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "After an exciting 3 days in Rome my husband, Chris, and I were looking forward to the countryside of Tuscany. Neither of us could have anticipated how wonderful our time would be there. Borgo Argenina is not your typical B&B. Elena Nappa, the owner and hostess, is an artist and has created a very charming, authentic haven. Every detail was decided by her. The paintings on the walls, the furniture, quilts, plates, glasses were all picked for their connection to the area. When we arrived,she greeted us as if we were family. She then brought us up to her beautifully authentic Tuscan kitchen, poured us a glass of wine and gave us ’the talk’ we had read so much about. Elena has drawn out a map of the area for all her guests to use, with pictures of the places she recommends visiting. She wants visitors to experience the real Tuscany and if you follow her direction, you will not be disappointed. We drove all through the Chianti region, and also more south through the Crete areas to see frescos in churches, small hamlets, wineries, and unbelievable views. Rolling hills, deep colors, morning mist, evening sunsets took our breath away. Every morning we awoke to open our window and see such brilliance. Down in the breakfast room we were always greeted by the two canine hostesses, Pasqualina and Giuseppina, who are just as much a part of this B&B as Elena. New on the scene is little Liugi, the cat...who cuddles on your lap and drives the two dogs crazy with jealousy! Guest at the Borgo somehow instantly become your friends and soon you are going out to dinner, or visiting a winery with them. Emails are exchanged, invitations are issued, and friendships begin. This is the atmosphere that is the Borgo Argenina. While there, nothing is al la carte. Each day your small room refrigerator is refilled with water and juice, etc., wine is poured, and food abounds. If you are lucky enough to stay there when Elena cooks dinner, this is extra, but so worth it! When we left we continued our journey to the Amalfi Coast, beautiful as it was, it just wasn’t Tuscany. If you have the opportunity to stay at the Borgo Argenina you would surely consider yourselves fortunate.", "title": "Heaven on Earth ...", "user": "Carri B", "date": "October 17, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 83852235}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "Wow, we are back about a week from our wonderful trip to Italy and France and I can say that hands down, Borgo Argenina and our wonderful host Elena, were the highlight of our trip! It is hard to believe that such raw beauty still exists on this planet, but I can assure you that the only thing you will experience in this part of Tuscany is just that! Upon arrival, we were greeted by Giusippina and Pascqualina, the resident dogs, as well as Elena and a wonderful glass of local Chianti wine; dinner for that evening was being prepared by her and a few guests in her typical Tuscan cuisine; my boyfriend and I could only dream of what the end result would be and it was definitely worth every calorie!", "title": "Quintessential Tuscan Experience", "user": "mikaddy", "date": "October 16, 2010", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 83744006}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "I had been to Borgo Argenina some years before and sometimes in the cold northern winter would go to the website and dream about returning. Such a desire can be dangerous, as many things are better in memory than reality.", "title": "Paradise: Charm, Beauty Sophisticated and Casual, Devine Hostess", "user": "newyorkscreen", "date": "April 14, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 104040893}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "Borgo Argenina and the spectacular Elena did not disappoint. in fact the experience was even more satisfying than the memory.", "title": "Heaven on Earth", "user": "detailsbybp", "date": "April 11, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 103656952}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "I love to explore every inch of Italy, not miss a site, but here one has the feeling of never needing to leave the beautiful stone porch. One could simply read and gaze at the view endlessly. Actually this becomes impossible, if you love dogs. They will gently invite you to explore the wonderful dirt road.", "title": "The most picturesque and enchanting place I've ever stayed.", "user": "ZLcreative", "date": "December 2, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 88809386}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "Elena, who restored this place, has a sophisticated eye that is obvious in both large and small details, so your room is one you wish you could dream up if you had the talent. At the same time, she like the earth and sun is abundant in her warmth and scrumptiousness.", "title": "Birgo Argenina was the highlight of our Italy trip.", "user": "Nava1", "date": "November 28, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 88454544}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "If you call with worries, she says \"just come\". I say just go, but prepare to loose your heart .", "title": "We could not have chosen a more idyllic setting....", "user": "ethan008", "date": "November 23, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 88053131}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled with family", "text": "About 20 minutes north of Sienna, down a half-mile dirt road, on a hilltop above vineyards lies the wonderful retreat of Borgo Argenina. We spent 3 wonderful days and nights in this very charming B&B with fantastic Chianti Classico views. We arrived at dusk after a very long exhausting drive touring around Tuscany, the owner Elena Nappa greeted us, and after we exchanged hugs, immediately took our 14 year daughter around the waist and said she'd take her for a walk to show her around the property. I was struck by the genuine warmth and it indicated what we could expect for the next few days.", "title": "The Real Tuscany, and the Best part of our trip", "user": "RJD22", "date": "August 12, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 74955959}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "The Inn and grounds are rustic beauty with a view that is simply heaven. Elena is passionate about preserving an \"auththentic chianti\" experience. If you want a Marriott or Hyatt on a hillside, this is not your place, but if you want to be away from it all, stay in a wonderfully restored farmhouse and grounds, sit on a patio overlooking vineyards, where it is so quiet at night you hear nothing, and yet are only minutes from world-class wineries and wonderful Sienna, this is the place. Breakfasts are excellent, and we did the group dinner/cooking lesson with Elena one night and had a blast. Picture 3-4 kids with big wicker baskets hiking to the garden to pick zuchini which they then chopped up for a huge dish of zuchini papardelle, topped off by a pork roast Elena prepared, while all enjoyed wine and listened to Elenas stories.", "title": "Tour and relax amongst the beauty of Chianti Classico!", "user": "smate1", "date": "August 7, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 74170700}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "Our room was a suite on the second floor at the far end with a very nice bedroom, large bathroom with the tub in front of the window that you could look over the vineyards if you cared to, and a sitting room with a single bed for our daughter. It worked perfectly for our needs. Little quirks like one low original doorway, barn door locks on the rooms, a family of barn swallows building a next inside the entry hall and flying in and out, and a wysteria draped arbor with a table looking at the fields just added to the charm. There is no air conditioning or pool but it was cool at night (~low 60's) and warm and dry by day (~80's). If you are coming during a hot spell, I would imagine it could be warm, but the masonry of the buildings seems to smooth it out. We didn't miss either AC or the pool.", "title": "Classic Tuscany Villa - the Real Deal", "user": "BinkyC", "date": "August 6, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 74093460}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled with friends", "text": "I read a few of the poor reviews (mind you very few of these as you can see) and they seemed to center on two things I'll address. The first common theme was problems with cancellations. When we reserved, the cancellation policy was clearly spelled out and if we changed our itinerary for some reason, I would not expect a host of a little bed and breakfast like this to refund our money. Elena honored our reservation and discount as she promised. She can seem disorganized at times which I think comes from having a lot going on, and you may need to reconfirm some things with her, but we had no problems. The second common theme was Elena's attitude. As I said, she is passionate about trying to give her guests an authentic experience of a way of life that is dwindling and being homogenized out of existence. She is an energetic person, definitely has opinions, and tries to steer you the best things she believes in, but is more than happy to help you, gives you an artistic & accurate roadmap & describes places not to miss, best eateries, castles, etc.. She gave us her Tuscan recipe book (written in English) and by the end of our stay, she felt like family.", "title": "Amazing, beautiful and serene.", "user": "alrsparker", "date": "July 31, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 73179907}, {"rating": 5.0, "title": "Bellisimo", "text": "We are not usually given to romanticizing events, but we fell in love with Tuscany and staying at Borgo Argenina was a big part of that. Wish we could have stayed longer....but we'll be back.", "user": "Laura4_58", "date": "July 29, 2010", "id": 72877799}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "The beauty of Chianti only matched by the beauty of Borgo Argenina and the gracious Elena. What a way to make our honeymoon seem to spring out of a novel. You had to pinch me as we drove up to this wonderful home to make sure it was real. Elena is a beautiful person who made our stay a perfect memory. The meal she cooked for us was out of this world and certainly made for a highlight. I cook a meal out of the cook book she gave us as soon as we got home to accompany the wonderful wine we brought home from the region. The friends we invited to share in the meal said it was the best Italian meal they ever tasted! We will return one day to the beauty of Tuscany and the beauty of Borgo Argenia.", "title": "Pinch me for I can't believe my eyes", "user": "SandyandDave364", "date": "October 13, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 83359128}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled with friends", "text": "My husband and I traveled to this little piece of heaven with two long time friends. We were excited from looking at the photos on line, but once there, found out the photos did not do Borgo Argenina justice. It is breathtaking! We were greeted by \"Pascualina & Gessiuppina\" our four-legged receptionists and their hostess/owner Elena Nappa. Elena immediately made you feel like family. She was warm, welcoming, energetic and most of all passionate about this region and all it has to offer and went out of her way to share information to make your stay the best. She succeeded. The staff was very hospitable, kind, and always smiling. Our stay in the Villa Oliviera was unbelievable. The rooms were large, comfortable and every night after a day of touring we looked forward to arriving at \"cassa dolce cassa\" (home sweet home.) Drinking wine out on the patio overlooking the Tuscan hills and vineyards while watching the sunset was paradise. For me, the best part was cooking with Elena, which is something that should not be missed. If you are looking for \"the perfect Tuscan getaway\"...this is it.", "title": "This B & B is heaven on earth...a hidden jewel of Italy.", "user": "Marylou14", "date": "October 12, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 83247115}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "We traveled to this picture perfect \"hamlet\" turned B&B with long time friends who were new to Italy. We chose the perfect spot. From the 2 dogs who lead us to the reception area, to the olive groves and vineyards that surround Borgo Argenina, we felt we had been dropped into the middle of a Tuscan paradise. The staff was kind and hospitable, the hostess/owner, Elena, was warm and energetic and full of passion for her home , her guests and worked tirelessly to ensure that we had the most memorable trip... she was successful. We had to pinch ourselves in order to believe we were actually there!!", "title": "This is a small piece of heaven.. you never want to go home.", "user": "pat492010", "date": "October 7, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 82527540}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "The rooms are very large, extremely comfortable and beautifully appointed. We stayed in the Villa Oliviera and it took our breath away when we entered. The on-line photos did not do it justice.. after a long day touring we hurried \"home\" to spend some of the best part of our day relaxing on the grounds, drinking wine and watching the sun set.", "title": "This is a little piece of heaven on earth!!!!", "user": "ljnee", "date": "September 19, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 80131090}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "If you have only one place on your \"bucket list\".. this is the one. Buon Viaggio.", "title": "Borgo Argenina e Bellissima", "user": "JaneandJJ", "date": "September 13, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 79386964}], "location": {"country": "Italy", "region": "Tuscany", "continent": "Europe"}, "variance": {"poor": 7, "average": 5, "very good": 21, "terrible": 8, "excellent": 350}, "aka": "Borgo Argenina Hotel Gaiole In Chianti", "slim_ranking": 0.25, "description": "\"Borgo Argenina has all the elements of a \"bestseller\" bed and breakfast: the perfect location in the heart of Chianti surrounded by vineyards, very comfortable accommodation in an ancient stone farmhouse, glorious countryside views, and, above all, Elena, the Borgo Argenina's gregarious hostess.\" - Karen Brown's Italy B&B"}