{"user_rating": 4.0, "review_count": 1895, "name": "Borgata Hotel Casino & Spa", "reviews": [{"rating": 5.0, "title": "A great getaway", "text": "Atlantic City is not what you would call a family resort. There is absolutely nothing for children to do, except go to the beach, or to the few family-themed restaurants like the Hard Rock Cafe or the Rainforest Cafe. They do let children walk through the casinos, and on a recent Sunday, I lost count of the children sitting bored on the edge of the carpet leading to the gaming area waiting for their parents to gamble away their vacation money.", "helpfulness": 11, "user": "vekkeo", "date": "August 16, 2006", "id": 5617165}, {"rating": 2.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "That said, we left for the Borgata, where we had booked a room for the night and made massage appts. for the next day at the resort's Spa Toccare. Be warned, if you want to bring the children and eat at a restaurant here, the Borgata does not allow children under the age of 18 in the premises unless they are staying there. A wise rule, in my opinion - casinos are not places for children.", "title": "Hated the employees attitude but loved the rooms!", "helpfulness": 23, "user": "Tamjr", "date": "August 9, 2006", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 2.0, "value": 1.0, "rooms": 4.0, "location": 1.0}, "id": 5592097, "likes": {"liked": "— The rooms", "disliked": "— The employees"}}, {"rating": 3.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "The Borgata is a relatively new addition to the Atlantic City scene and is certainly top notch. Everything is clean and new in appearance, and the rooms are no exception. We stayed in a Classic Room, but it is a large cut above the normal basic hotel room. Floor to ceiling windows allow a sweeping view (they will ask you at the front desk if you want bay views or city views. We requested city views and, from the 12th floor, the city certainly looked lovely at night.) Egyptian linens on the bed are crisp and clean and the bathroom boasts marble walls and an oversized two person shower with a marble seat. No normal hotel style bath towels here, either - instead there are enormous bath sheets that will provide modesty on even the most ample body.", "title": "learn the art of customer service", "helpfulness": 9, "user": "tinarose", "date": "August 8, 2006", "detail_rating": {"front_desk": 2.0, "service": 1.0, "cleanliness": 5.0, "value": 1.0, "rooms": 5.0, "location": 3.0}, "id": 5577790, "likes": {"liked": "— clean big bathroom", "disliked": "— confirm dinner reservations twice!"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "Our room package included breakfast at the buffet in the mornng. We were a little concerned because the dinner line at the buffet the night before snaked back and forth and out into the casino, disney style. Our concerns were alleviated when we came down for breakfast at 8:30 and found the buffet had no line. The food was delicious and prepared hot and fresh.", "title": "Luxury at its Best", "helpfulness": 6, "user": "noxscape", "date": "August 6, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5561351, "likes": {"liked": "— Everything, they really make you feel important.", "disliked": "— Hmm...that i have to drive to the boardwalk"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2006", "text": "The spa is worth a visit unto itself. It is pampering with a capital \"P\". As a spa patron, you are their guest until it closes at 8 pm that day, so it is a great way to unwind and continue your stay. Fresh fruits, juices and waters are provided free for spa guests, and you have use of all spa facilities, plus the pool, and the outside garden which has ample chaise lounges for soaking up the sun. The pool is indoors, but an outdoor pool would be a welcome addition. Spa guests are encouraged to come and go - you can leave the spa, do a little gambling and get something to eat and then return. I would certainly return again.", "title": "Loved The Borgata-Beats the Boardwalk Hotels Hands Down!", "helpfulness": 10, "user": "CenPennTraveler", "date": "July 16, 2006", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 5.0, "service": 5.0}, "id": 5472306}, {"rating": 4.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "This short trip was my present to my husband for his birthday. He LOVES Santana (I do too) who happened to be playing on his birthday in Atlantic City (1 hour 1/2 drive from where we live). My husband had been to Atlantic City before, I had never been.", "title": "Nice Hotel", "helpfulness": 3, "user": "MrsTraveler", "date": "April 20, 2008", "detail_rating": {"cleanliness": 4.0, "front_desk": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 15167752}, {"rating": 4.0, "stay_parameters": "Stayed April 2008, traveled with friends", "text": "HOTEL: After looking at the different hotels (frankly, many reviews scared me), I ended up booking a room at the Borgata . It appeared to the best hotel in AC and that's where Santana was playing anyway. But YIKES on that Saturday night room rate! Anyway, the Borgata turned out to be a really nice hotel (although I didn't think it was worth the rate I paid). I would recommend the hotel to anyone going to AC. The line to check in was LONG (I did read that in some reviews). Our room was on the 31st floor with a nice view of the city. The room was spacious and clean. The indoor pool area is really nice, although we found the pool to be small for such a big hotel.", "title": "Nice upgrade", "helpfulness": 1, "user": "sandpiper313", "date": "April 17, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 3.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 15106490, "likes": {"liked": "— The variety of food and entertainment choices on-site.", "disliked": "— Poor service in the Old Homestead."}}, {"rating": 2.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "DINNER: We had dinner at OLD HOMESTEAD STEAK HOUSE, one of the fine restaurants at the resort. Our food was FANTASTIC. The portions are HUGE. Both my husband and I felt a little ill after dinner from eating so much! Seriously. If we had to do it again, we would pass on the appetizer.", "title": "Eat Here - Stay Somewhere Else", "helpfulness": 1, "user": "mintEfresh", "date": "April 15, 2008", "detail_rating": {"front_desk": 1.0, "business": 3.0, "service": 2.0, "cleanliness": 5.0, "value": 2.0, "location": 2.0, "rooms": 1.0}, "id": 15063880, "likes": {"liked": "— Super clean and the Food was great!", "disliked": "— Rude Staff, Horrible Beds, Over Priced, Not a great selection of slot machines"}}, {"rating": 3.0, "stay_parameters": "Stayed September 2007, traveled with friends", "text": "We both had the classic caesar salad for appetizers.", "title": "Liked it", "helpfulness": 1, "user": "ShoeiBR", "date": "April 13, 2008", "detail_rating": {"front_desk": 5.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "location": 5.0}, "id": 15000687, "likes": {"liked": "— Night Life", "disliked": "— Rooms"}}, {"rating": 4.0, "title": "Overall Very Nice", "text": "For entrees, my husband had the empire cut of prime rib 32 oz, on the bone. I had the petit filet mignon 10 oz, hash brown, demi glaze. We shared an order of steak fries. Have I mentioned how HUGE the portions are??", "helpfulness": 1, "user": "tatabob", "date": "March 31, 2008", "id": 14673509}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled with family", "text": "Stood at the Borgata for 2 nights, Aug 1-3, in their premium Piatto Suite. This is Borgata's most luxurious suite aside from the 3 Penthouse suites, which they never rent out.", "title": "Beautiful Borgata Suite", "helpfulness": 3, "user": "absolutv1", "date": "September 1, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 3.0, "value": 4.0, "rooms": 4.0, "location": 3.0}, "id": 8603882, "likes": {"liked": "— Most modern and up to date amenities", "disliked": "— Cleanliness and Maintenance of rooms/suites"}}, {"rating": 2.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "To start off I arrived around 1PM and the line was pretty long. However, it only took about 25 mins. The check in agent was very pleasant and accommodating and even let me choose the exact floor of my suite. I also checked in with a family member and again the agent got a second room 2 doors down from mine. Used Bell services and everything arrived in the room within 20mins.", "title": "Wilding at the Borgata", "helpfulness": 25, "user": "StinkinRich", "date": "August 27, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "rooms": 4.0, "location": 3.0}, "id": 8512918, "likes": {"liked": "— Quiet Suites; Roomy; BathTub; Flat Screen TV", "disliked": "— Dirt and Dust on the Furniture"}}, {"rating": 5.0, "title": "Great Room if Comped", "text": "Room Details: My room as previously stated was the Piatto Suite:", "helpfulness": 3, "user": "bigc325is", "date": "August 24, 2007", "id": 8493766}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "1,500sq ft. which felt like a Manhattan apartment.", "title": "We'll Be Back, No Question", "helpfulness": 6, "user": "LDV24", "date": "August 22, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 8474324, "likes": {"liked": "— The gorgeous view from our 40th floor room!", "disliked": "— Getting to the Borgata was a bit confusing - once we got off the Atlantic City Expwy, signage directing us was unclear and we drove in circles a bit before arriving."}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "Electronic Drapes in Bedroom(not sure why the living room drapes were not electronic)", "title": "Beautiful", "helpfulness": 5, "user": "pisces219", "date": "August 22, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 8472455, "likes": {"liked": "— everything!", "disliked": "— nothing!"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "We stayed one night at the Borgata for a last minute get away. Check in took forever because of the security requirements that involve a photo ID (my 88 year old mother doesn't have one) but we did get the view we requested - ocean and city lights. We had 2 rooms - one with 2 queens and one with a king. The room with 2 beds was larger and slightly more comfortable. The bathrooms are wonderful, clean and with large towels. Overall the room was clean and up to date.", "title": "Great rooms, staff & food - not great beds", "helpfulness": 7, "user": "lbillies", "date": "September 13, 2006", "detail_rating": {"front_desk": 2.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 5797784, "likes": {"liked": "— Large clean room, great bathroom", "disliked": "— The beds"}}, {"rating": 5.0, "title": "Always love this place", "text": "We had dinner at the Homestead which was expensive ($300 for four with only a glass of wine each) but oddly worth it.", "helpfulness": 3, "user": "JLESTO", "date": "September 13, 2006", "id": 5797720}, {"rating": 2.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "The only thing that could have better was the beds. They were made so tightly that it took real effort to loosen them up enough to get into.", "title": "Borgata used to be good but is deteriorating rapidly", "helpfulness": 9, "user": "pmahood", "date": "September 13, 2006", "detail_rating": {"front_desk": 2.0, "business": 2.0, "service": 1.0, "cleanliness": 3.0, "value": 2.0, "location": 2.0, "rooms": 4.0}, "id": 5797710, "likes": {"liked": "— Nice walk-in shower", "disliked": "— Staff are rude and the service is slow."}}, {"rating": 1.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "Of all the casinos we've stayed at it is the nicest by far. We'll go back - but we'll bring our own pillows!", "title": "Worst hotel stay. Ever", "helpfulness": 21, "user": "dollyhaze", "date": "September 12, 2006", "detail_rating": {"cleanliness": 1.0, "front_desk": 1.0, "location": 2.0, "value": 1.0, "rooms": 2.0}, "id": 5794590, "likes": {"liked": "— It was in the same building as the concert we attended.", "disliked": "— The outrageous price for a below average room, no extras and nickle-and-dime treatment for everthing else."}}, {"rating": 4.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "We stay at the Borgata at least one night per month and have done so since December 2003. I can't believe the reviews that stated the staff was bad. I have always found everyone who works there, from front desk to casino floor, to be congenial and helpful. In almost three years, there has not been even one incident where staff was not great.", "title": "Enjoyed the Borgata !", "helpfulness": 6, "user": "IslandGirl21", "date": "September 9, 2006", "detail_rating": {"front_desk": 4.0, "service": 2.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 5783652, "likes": {"liked": "— clean, new", "disliked": "— restaurant service"}}, {"rating": 1.0, "stay_parameters": "Stayed March 2008, traveled on business", "text": "Just returned from staying at the Borgata for a four day conference and will not return. I found their customer service unacceptable at the front desk on two different occasions during my stay. The first was when I tried to upgrade a room to a suite and was told that it would cost me an additional $20 more than a person off the street because I came in with a group and \"groups don't gamble as much\". My next experience was the following morning after a sleepless night due to noise all night (don't stay on a Monday night - some special with a dance club draws a young noisy crowd). I went to the front desk to see about changing my room and the desk clerk said \" You are the woman who gave us a hard time yesterday\" - no kidding, this was my greeting. I was told - there are no rooms available. Yes, the rooms are clean, but the noise levels of slamming door will cause you to have sleepless nights. One last note - plan to wait at check-in for an hour - a line of 100+ is the norm per their staff. I work in retail and understand customer service, I would recommend you keep looking at your other choices.", "title": "Reconsider your choices", "helpfulness": 5, "user": "Simplythinking", "date": "March 28, 2008", "detail_rating": {"front_desk": 1.0, "business": 3.0, "service": 1.0, "cleanliness": 3.0, "value": 2.0, "location": 3.0, "rooms": 1.0}, "id": 14618716, "likes": {"liked": "— Clean room", "disliked": "— Customer service, noise,"}}, {"rating": 5.0, "title": "the closest thing to a five-star Vegas resort on the East Coast", "text": "Borgata Hotel and Casino Review Atlantic City NJ", "helpfulness": 3, "user": "atthecon", "date": "March 28, 2008", "id": 14610780}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "We stayed Monday through Wednesday. Our room was comped via the Red Card.", "title": "Definitely Hot...for NJ!", "helpfulness": 2, "user": "rhaarsga2000", "date": "March 27, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 14584100}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "Don’t bother with valet parking here. They are slow and rude. Knowing this from previous visits we parked in the garage and went straight to the check-in. The line was long, but it moved along at a good pace.", "title": "Great Time at the Borgata !!", "helpfulness": 2, "user": "eruptive", "date": "March 26, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 14565659, "likes": {"liked": "— Great Rooms and very High-Class venue", "disliked": "— Long Lines at Check-In / Check-Out"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "When we got to the desk I asked if they had a suite for us. Now note, I only reserved a regular room and this was free. The clerk asked to see our Ids and asked if there were any special occasions. I mentioned an anniversary and he upgraded us to a Fiore Suite at no charge! The room was great! Great view. Lots of room. Nice deep tub and a large shower.", "title": "I have been to Borgata many times and love it more with each visit", "helpfulness": 1, "user": "ANDYH428", "date": "March 25, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 3.0, "rooms": 5.0}, "id": 14537737, "likes": {"liked": "— The rooms are spotless and the casino floor is full of games and places to stuff your face", "disliked": "— Checking out...because that meant I had to leave and go home."}}, {"rating": 1.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "From what was once the best game in town, the Borgata has now lost their game. This visit stayed at the Water Tower. With all the success of the first tower, you would think the Water Club would be even better. Not so. The suite we reserved was actually a small room and way over priced. DON'T TOUCH ANYTHING ON THE AMENITY TRAY. You pick it up, its billed to your room via a magnetic tray underneath. Even if you don't open it, your billed. Credits can only be done via a supervisor, I'm still waiting for mine and I checked out today.", "title": "They Lost Their Game", "user": "SteveBusch", "date": "July 11, 2010", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 3.0}, "id": 70540359}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "The saddest part about the Borgata is that the vibe is gone. From what was once the most hospitable staff in AC, now poor service is accompanied by attitudes. Something as simple as having a toothbrush delivered is a huge issue. While dinner at the Homestead was good, there is nothing else remarkable any longer at the Borgota", "title": "Beautiful hotel and casino, no major problems. A good time was had.", "user": "Goneja", "date": "July 11, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 70527358}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled with friends", "text": "We recently finished our first stay at the Borgata. We were very happy and intend on visiting them exclusively in the future. The roads, parking lots, casino, hotel and restaurants were all more appealing and beautiful than any other casino we have been to in AC. Check-in was simple, however an overly zealous security guard manning the hotel entrance rudely questioned me and my girlfriend in regards to a tiny cooler we brought. We were not a large group of drunken hooligans, and only brought it after hearing the Water Club only had a mini-bar fridge, so we were unsure of the amenities of the Borgata tower. Of course, the cooler had nothing in it except a loaf of bread, so, feeling somewhat stupid, he said \"You can go in but don't bring it back next time.\" Of course, we spotted at least SIX coolers larger than ours over the course of only two days with no one hassling them. We had no other altercations with bad staff besides this, so I count that as a blessing, but the guard should have just shut up or explicitly told us the exact rules of the place. Other than that, security never bothered us the rest of our stay.", "title": "The Best Hotel and Casino in Atlantic City", "user": "sixflags2001", "date": "July 10, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 70442681}, {"rating": 1.0, "stay_parameters": "Stayed July 2010, traveled with friends", "text": "As for the room itself, I was satisfied. It was a basic room, and although lacking free internet and a flat screen TV, everything else was perfect, with a comfortable bed, beautiful view of the salt marsh islands / Harrah's LCD screen tower / the marina. The bathroom was large with a marble shower with a marble bench to sit on. Room service did not replace the coffee the second day, so I would suggest leaving the cupboard containing the coffee supplies to be left open. No major harm done. The halls are only as loud as any other hotel but the rooms were quiet. We have had some insane noise issues at places like the Showboat with exterior equipment making loud noises in the wind and such, none of that here on the 31st floor of the Borgata. The hotel also had a nice hot tub/pool but obviously it was a little crowded and we did not use it.", "title": "BORGATA SUCKS", "user": "dxray15", "date": "July 3, 2010", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 2.0, "location": 1.0}, "id": 69559434}, {"rating": 2.0, "title": "BORGATA IS NOT PEOPLE FRIENDLY", "text": "The casino was incredibly large. I am not a table player, but poker seemed to be set off in its own room absolutely jam packed with people - you couldn't tell if it was a tournament or just their poker tables. I did not see any blackjack tables but perhaps I wasn't looking hard enough. As for slots, we had a good time and some considerable rushes, but we ended up losing $300+ with nary a single comp or slot dollar posted to our membership cards. I can't blame bad luck on the Borgata, but I'm wondering how much I have to actually spend to earn any kind of comp or slot dollars. I cannot honestly support the statement \"loosest slots in town\" as they drained us faster than anytime we have gone previously. That's the way of things - I can't hold that against the establishment as it's called gambling for a reason.", "user": "FISHEOB", "date": "July 1, 2010", "id": 69333159}, {"rating": 5.0, "title": "Borgata Opinion", "text": "It's funny, it looks like a lot of wives are writing about complaints on this thing. So I decided to give you a man's point of view:", "helpfulness": 2, "user": "dd4444", "date": "March 24, 2008", "id": 14495911}, {"rating": 2.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "- The rooms kick serious butt.", "title": "Left feeling really dissatisfied...", "helpfulness": 2, "user": "NYC313", "date": "March 22, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 1.0, "rooms": 4.0, "location": 3.0}, "id": 14455094, "likes": {"liked": "— Beautiful hotel, Rich Decor, Clean room with great city view.", "disliked": "— Terrible Value; you don't get what you pay for. The Event Center venue is terrible for a concert."}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "- When I stayed there, I got to meet celebrities because a boxing match took place that weekend (got to meet Lennox Lewis, Mayweather Sr., Larry Merchant, and more!)", "title": "Surprisingly FABULOUS", "helpfulness": 1, "user": "marciofoz", "date": "March 21, 2008", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 5.0, "rooms": 4.0, "location": 3.0}, "id": 14433874, "likes": {"liked": "— the spa, retaurants, security", "disliked": "— pool unimpressive"}}, {"rating": 1.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "- The women are unbelievably hot there!", "title": "Horrible Room & Service", "helpfulness": 1, "user": "wrldtrvlr25", "date": "March 21, 2008", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 2.0, "value": 1.0, "location": 2.0, "rooms": 1.0}, "id": 14431733, "likes": {"liked": "— Room is ugly and outdated and so is the bathroom. Had food poisoning and services is below par."}}, {"rating": 2.0, "title": "Aborted Stay", "text": "- The room is expensive because it's THE place to be...get a grip women!", "user": "slashu2", "date": "March 19, 2008", "id": 14383865}, {"rating": 2.0, "title": "Once you get beyond the pretty outside...", "text": "I received an offer for a free night at the Borgata from MGM (Borgata is a joint venture of MGM and Boyd Gaming), so I was anxious to take them up on it. Arriving at the hotel (which was a monster to find, I made a wrong turn and that was it. I’m a AC novice), aesthetically, it’s beautiful, every bit a match for the hotels in Las Vegas. However at check in, the problems began, the over-tanned, over-blonde person (named Janice) at the front desk was rude, cutting me off mid-sentence when I was trying to be friendly.", "helpfulness": 26, "user": "A TripAdvisor user", "date": "July 16, 2006", "id": 5469763}, {"rating": 5.0, "title": "Living life again at the Borgata!", "text": "It took an hour for me to get the non-smoking room (at 9:30pm!) I’d requested on the phone when I made the reservation. Once I got to the room I had to check out what all the hubbub I’d heard was really about; the full length windows, were so dirty I couldn’t see out of them; the bathroom, had a half used bar of soap sitting on a washcloth that was covered by hair in the shower; the sheets on the bed – had holes each night I stayed. Needless to say – I am disappointed.", "helpfulness": 8, "user": "A TripAdvisor user", "date": "July 14, 2006", "id": 5465653}, {"rating": 1.0, "title": "They Borgatabout Customer Service", "text": "The buffet was par with what I’d expected, however service there was lacking – I had to flag someone down to get refills on my drink both times (lunch once, dinner once) I was there. The best meal I had was at the Metropolitan, the lines were too long anywhere elsewhere to merit my waiting, even with reservations I passed on the Old Homestead as there was a line to get to the hostess stand! I would of liked to go to one of the bars, but the band at the Gypsy Bar was borderline offensive, and the B-Bar was way too loud for such a small area.", "helpfulness": 33, "user": "KTMachine", "date": "July 7, 2006", "id": 5436604}, {"rating": 4.0, "stay_parameters": "Stayed July 2005", "text": "I doubt I’ll return to the Borgata, from the non-existent customer service to the dirty rooms. I’ll save my money and go to Las Vegas in the future.", "title": "What is everyone talking about? This place is great!", "helpfulness": 12, "user": "alohamariss", "date": "July 7, 2006", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 5.0, "service": 3.0}, "id": 5436154}, {"rating": 2.0, "stay_parameters": "Stayed July 2006", "text": "This place gave me a breath of fresh air again. With a family now I had put the gambling and partying behind me; my friend/poker buddy kept calling me telling me about this place called the Borgata! Finally, I had a business trip in NJ and met him at the Borgata, which was ez to find and parking was great. I walked in and felt alive again. Immediately sat in on a poker table in a packed poker room. Stop gambling for awhile and went to Club Mixx, which was a blast! Played a late nite poker satellite tournament....I talked to management which was nice and polite to go a long with the first class atmosphere. They make everyone feel like VIP not just the high rollers! Its one stop shopping you dont have to leave the building. I wont say the best place because thats too broad, but definitely the best building I have ever visited!", "title": "Didn't keep their word", "helpfulness": 15, "user": "toddtravels", "date": "July 7, 2006", "detail_rating": {"cleanliness": 2.0, "value": 3.0, "rooms": 4.0, "service": 2.0}, "id": 5435338}, {"rating": 2.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "I am a well traveled individual and I have been frequenting The Borgata twice a year since its inception in 2003. I returned this weekend and was extremely disappointed with the facilities. The room was dirty and there were clusters of hair balls under the sink. I found that the room was not cleaned before I arrived. The most glaring filthy was in the pool/hot tub area. The hot tub had green mold on the pool deck, steps and inside the hot tub. It was clear to me that the hot tub had not been cleaned for months. I felt like the hot tub was filthy and that I was going to get sick from the mold. If you go to The Borgata, make sure you wear a mask to the pool area or better yet, wear a wetsuit so you don't get sick. Happy travels.", "title": "DIRTY FACILITIES", "helpfulness": 5, "user": "DAVID G", "date": "March 18, 2013", "detail_rating": {"service": 2.0, "cleanliness": 1.0, "value": 2.0, "sleep": 3.0, "rooms": 1.0, "location": 1.0}, "id": 154995285}, {"rating": 1.0, "stay_parameters": "Stayed February 2013, traveled with friends", "text": "a few weeks ago my brother, my uncle and i stayed at the borgata for a poker tournament, we arrived late friday night. saturday we played in the tourny, we got back to our room late and noticed a used condom under the night stand, and a stickey substance on the desk. sunday we woke up ate breakfast and went to play in another tourny, my brother had a medical emergancy so we ended up spending the day at the hospital, my uncle and i got back to room around midnight, to still find used condom and sticky desk, i guess housekeeping doesn't have to clean everywhere. monday morning we went right to the hospital, got some good news and decided to go back to hotel to get some things for my brother, we went to room to check if housecleaning finaly did their job, no they didn't, so we went down to talk to a manager, and this is the part that pisses me off the most, she says well why didn't you tell us sooner. thats it no apollogy nothing. my advise to anyone thinking of paying that kind of money go somewhere else.", "title": "a waste of money for terribale tratment", "helpfulness": 8, "user": "VinceL_20_", "date": "March 18, 2013", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 5.0}, "id": 154987504}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "Hadn’t stayed at Borgata for a couple of years and was pleasantly surprised by the updates inside and outside the bedroom. Check-in is always a long wait, especiallly on Saturday; luckily, they had knowledgeable people at the counter, and our attendant, despite being new, did the best to get us up to our room promptly.", "title": "Arguably, the best hotel in AC right now", "helpfulness": 1, "user": "L M", "date": "March 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 154960693}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "The décor aspires to a more swanky NY style, but there were obvious omissions to cleanliness, like stained carpet, leftover debris inside the drawers, and torn towels. Linens and shower area were impeccable, though.", "title": "Back at the Borgata", "user": "pjevin", "date": "March 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 154959464}, {"rating": 5.0, "title": "Wonderful stay in a Fiore Suite", "text": "Request for extra towels was met in a matter of minutes, even during rush hour, and was extremely pleased with that. Room service took a bit longer than expected, but was equally worth waiting for.", "helpfulness": 1, "user": "CasinoGirl32", "date": "March 18, 2013", "id": 154954480}, {"rating": 3.0, "stay_parameters": "Stayed December 2012, traveled with friends", "text": "I stayed here on the weekend right before Christmas and I really hate the room. The room was gray and that color made it uninvited and sad looking. I had never see such an ugly and sad looking room in my life. They should change the color of the room. But like my friend told me, they don't want you in the room, they want you at the casino or spending money at the hotel many bars or restaurants. My friend and I ended up doing just that since I could not stay one second in that horrible room :( The lobby is grand and beautiful as well as the swimming pool. I'll stay there again but I'll never step in one of those grey rooms!", "title": "NICE HOTEL...UGLY ROOMS", "user": "Liliana C", "date": "March 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 1.0, "location": 3.0}, "id": 154892779}, {"rating": 3.0, "stay_parameters": "Stayed March 2013, traveled with friends", "text": "The room was comfortable, but not sure if it is worth the cost. Not all that convenient to the boardwalk and it costs $5 to park (not sure if they only charge once if you go in/out multiple times). The lobby is very smoky as you walk through it to the front desk.", "title": "Nice but a bit overpriced", "user": "blondebass1622", "date": "March 15, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 154705345}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "Quite simply, I loved everything about this hotel. No surprise there. Was thrilled by my view from the 37th floor. The room was exceptionally clean and quiet. Every member of staff I encountered was polite and professional. Most of all...I had fun. Will definitely stay again.", "title": "high expectations were met", "helpfulness": 1, "user": "jackie o", "date": "March 15, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 154696570}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "My husband & I was celebrating our 24th anniversary & wanted to do something other than another trip to the city.He was at the Borgata a few weeks ago & stayed overnight at the Water Club & he enjoyed his stay.We don't gamble & have only been to AC once to see a concert many years ago so when I suggested going there for an overnight stay to celebrate, we thought about it for a few minutes & agreed it would be something fun to try!We got a king bedroom suite & since it was a Monday night it was only $189 ($215 with tax & fees).The food options were really nice, drinks were great & we had some fun gambling.The hotel is beautiful & my favorite thing is all of the Dale Chihuly glass sculptures.We are definitely considering another trip back to the Borgata in the future.", "title": "Good Time!", "helpfulness": 1, "user": "Robyn S", "date": "March 15, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 154631498}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with friends", "text": "Excellent customer service from check in to dining. The eateries are all great, but very pricey. They have a very good selection of slot machines and table games. The tables get crowded in the evening, but finding an open slot machine is not a problem.", "title": "Borgata Hotel in Atlantic City", "helpfulness": 1, "user": "Blade926", "date": "March 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 154611509}, {"rating": 2.0, "stay_parameters": "Stayed October 2007, traveled solo", "text": "I stay at the Borgata about 4x a year around biz trips in the area; usually just one night stays. I have always loved the hotel and casino and do not even consider any other AC properties. Borgata is the best. But this most recent time, while great on the gambling side of things, still requires that I note two shockingly surprising negatives. First, I reserved a complimentary king room which was verified when I checked in. I ended up in a double room that was also a handicapped accessible room. Not terribly inconevenient, but I was surprised to see that the bathroom had peeling paint on the ceiling and was less than luxurious compared to other rooms I have stayed in there. Also, and this was most distressing, I found that I was sharing my room with insects as I killed what appeared to be two cockroaches ( also in the bathroom). Secondly, I made a dinner reservation at Bobby Flay's. I have eaten there before and was not that pleased, but I thought I would give it another shot. I ordered a ny strip medium which came out medium well and so blackened on parts of the outside as to be nearly burnt. Bobby's chef(s) stuck it to me again with a medicore meal at an astronomic price. If you are eating dinner at the borgata, the best bang for the buck will be at Wolfgang Puck's in my opinion. Or Fatburger in the lower grill area.", "title": "Frequent Guest a little disappointed this time", "helpfulness": 1, "user": "Farmerica", "date": "October 16, 2007", "detail_rating": {"front_desk": 5.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "rooms": 2.0, "location": 5.0}, "id": 10088392, "likes": {"liked": "— casino", "disliked": "— roaches in room"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled with family", "text": "I'm a regular at Harrahs , but this year I have stayed several times at the Borgata, either with my husband or my mother, and we have never had a bad experience here. Since I'm a Diamond card holder with Harrah's I was upgraded to a Black Label card with Borgata a couple of months ago, but even before I was upgraded the service was wonderful.", "title": "Borgata Hotel - Always a good stay", "helpfulness": 5, "user": "dkgram", "date": "October 5, 2007", "detail_rating": {"cleanliness": 5.0, "front_desk": 5.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 10043474}, {"rating": 1.0, "title": "the borgata fire-no alarms! no evac procedure ! lets pretnd nothing happened", "text": "This last time my mother and I were there was 2 days after the fire happened in the new tower construction. The valet parking was temporarily closed due to the fire (and we always use valet parking and valet baggage service) so we had to use self parking. They had valet service set up in the self parking garage and went out of their way to help us - they even went in to get us a wheelchair, which my mother uses in the casino. We weren't even asked what tier card I had.", "helpfulness": 16, "user": "thesecretary", "date": "October 1, 2007", "id": 10026197}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "We arrived before 1pm and we got our room immediately. Our room was on the 18th floor in a non smoking room with 2 queen beds. The beds are very comfortable. The room was spotless as well as the bathroom. The towels are the best (very large and soft). Some of the furniture and carpet is showing age, but with the amount of people staying at the hotel it's not surprising. Our luggage arrived a couple of minutes after we did. Beverage service while we were at the slots was quick and frequent. The food in the Metropolitan has been good, but the service there could be faster. We usually have dinner in the Amphora Lounge and it's always excellent. Breakfast is usually a cup of coffee and a danish from Starbucks.", "title": "Borgata Review", "helpfulness": 2, "user": "slw95756", "date": "September 24, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 3.0}, "id": 8885211, "likes": {"liked": "— class, clean", "disliked": "— price"}}, {"rating": 1.0, "title": "We could not wait to leave", "text": "In all, I have never had any complaints either with the service, the politeness of the employees or the accommodations.", "helpfulness": 23, "user": "foodfight", "date": "September 22, 2007", "id": 8853112}, {"rating": 5.0, "title": "Great Stay!", "text": "I was there for Labor day, 2 night stay, $149 a night. I was very impressed. Great service, clean, modern room, food at the restaurants was outstanding. I won a little on the slots, but not much. Overall, it was just perfect for my boyfriend and I.", "helpfulness": 1, "user": "DAA65", "date": "September 19, 2007", "id": 8823012}, {"rating": 1.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "My husband and I booked two weeks prior to our One Year Anniversary, we booked a classic room because all other rooms were sold out. The hotel asked that we call if we were ariving after 9pm which I did I called at 8:30pm and was assured that we would have a great stay. When reaching the hotel after a 4 hour drive we walked in to major major booking issues. The hotel over booked for over 70 guests. We arrived at 11pm and had to stand on line until 2:30 am until we reached the front desk. People were being sent to other hotels, black card members got rooms.... we stood and waited with out anyone from Borgata explaining what was going on. Which left us really upset. We finally were lucky ones and were put in a room at 3am which was dirty and not up to the standards they should be for the price you pay. Not to mention it was a hotel filled with 20 year olds everywhere. We paid to stay the one night and then left in the AM I would not suggest this hotel to anyone!! I would never go back!!!! Not 5 stars to me , not even 1 star!!!", "title": "Don't expect a room !!!", "helpfulness": 15, "user": "mingles17", "date": "September 15, 2007", "detail_rating": {"cleanliness": 1.0, "front_desk": 1.0, "value": 1.0, "rooms": 1.0, "service": 1.0}, "id": 8721234}, {"rating": 2.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "I went to the Borgata due to the fact I saw all the ads, that it was to be luxurious and one of the better hotels in Atlantic City. I had been to Atlantic City before, but stayed at Caesars, but this time I decided to try the Borgata, which is off the boardwalk and away from all the other hotels.", "title": "Not as Luxurious as Claimed, Over-rated", "helpfulness": 15, "user": "benjaminlevi", "date": "September 13, 2007", "detail_rating": {"front_desk": 3.0, "service": 2.0, "cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "location": 2.0}, "id": 8707524, "likes": {"liked": "— Restaurants were good at the Resort", "disliked": "— Dirty Room and Poor Service & No Customer Apprecitation"}}, {"rating": 1.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "The hotel was nice, but service is lagging. It seems there is no customer appreciation, and they feel you owe them gratitude for staying at their resort. Though I have to say I did use the spa, and there spa was very good.", "title": "Phila Magazine recommends, but it was not what we expected.", "helpfulness": 14, "user": "DrMom1970", "date": "September 7, 2007", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "location": 3.0, "rooms": 1.0}, "id": 8671399, "likes": {"liked": "— Front foyer/entrance, nice restaurants", "disliked": "— Overall bad quality: Very dirty, no care in upkeep, terrible/ broken furniture"}}, {"rating": 5.0, "title": "Dinner at Specchio", "text": "Though my problem was with my room, and service. After checking in and going to explore the hotel, spa, restaurants etc we left the room without really checking it out. At night when we came back, noticed the moldings/cocking in the shower was coming off, and also that there was mold/mildew all over the shower. That was just the beginning.", "helpfulness": 3, "user": "ratso", "date": "September 2, 2007", "id": 8606933}, {"rating": 3.0, "stay_parameters": "Stayed August 2007, traveled solo", "text": "If you have been reading the various reviews here for the Borgata and have been trying to decide if you want to stay here or not, I can completely understand where you are coming from. Such conflicting comments from review to review, and also some things that are very hard to believe. Now that I have stayed here, I believe the people who wrote reviews on this site are really telling the truth about their individual experiences.", "title": "Staying at this Marble Palace with Glass Sculptures is a Mixed Bag", "helpfulness": 13, "user": "FairtoEveryone", "date": "August 21, 2007", "detail_rating": {"front_desk": 4.0, "business": 1.0, "service": 2.0, "cleanliness": 2.0, "value": 3.0, "location": 3.0, "rooms": 3.0}, "id": 8464101, "likes": {"liked": "— The floor to cieling windows covered an entire wll of my suite.", "disliked": "— Unacceptable housekeeing in the first suite for even a Holiday Inn, much less the famous Borgata"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled with friends", "text": "I orignally had booked a four night reservation, but after what I read here I canecelled and rebooked for two nights. That was a good decision.", "title": "Best Restaurants", "helpfulness": 1, "user": "JudyPRENDE", "date": "August 20, 2007", "detail_rating": {"cleanliness": 5.0, "front_desk": 5.0, "value": 4.0, "location": 3.0, "service": 5.0}, "id": 8460727, "likes": {"liked": "— Food & Restauarnts", "disliked": "— Nothing. Very nice."}}, {"rating": 1.0, "stay_parameters": "Stayed August 2007, traveled with friends", "text": "First, the public areas of the Borgata are very beautiful with marble everywhere and contemporary glass sculptures in the lobby and hall cielings. It is very enjoyable to walk around and see. The living room area besides the elevators glassed off from one of the smoking areas of the casino is very pleasant as you would expect it to be for a place such as this. Yes, it is escapism. Isn't that part of the reason people come to hotels such as this?", "title": "Don't believe anything they tell you", "helpfulness": 6, "user": "yin_n_yang", "date": "August 19, 2007", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 5.0, "value": 1.0, "rooms": 5.0}, "id": 8454969, "likes": {"liked": "— Our suite was nice but not sure for the price.", "disliked": "— The entire customer services team."}}, {"rating": 3.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "Second, I was fortunate to always have respectful staff waiting on me during the check in, then room change (see below),and then check out. The people working at the reception, ( most of them looked late twenties and thirties) were all pleasant and professional towards me without exception. I am just a regular looking 50 year old guy, not some hot high roller. The wait in the reception lines was never more than 10 minutes at regular check in and check out times , but this was a mid week stay, Tuesday August 7 to Thursday August 9. I have heard this is not the case on the weekends.", "title": "needs some attention", "helpfulness": 9, "user": "packabag", "date": "August 14, 2007", "detail_rating": {"cleanliness": 2.0, "front_desk": 3.0, "location": 4.0, "value": 3.0, "rooms": 4.0}, "id": 8419253}, {"rating": 3.0, "stay_parameters": "Stayed August 2007, traveled with friends", "text": "Third, I had decided to splurge and reserve a Fiore Suite. And here is where the problems began. When I entered my suite, I began immediately to notice housekeeping issues I have never experienced before at any hotel. For example, the used soap of the previous occupants was still on both the bathtub ledge and in the shower. There was very noticeable dust on all wood furniture table surfaces and on the T. V. When I pulled the TV out of the cabinet I could not believe all the dust on the top. It was not what I was expecting. The glass on some of the table tops was well, gunky. A couple minutes with a glass cleaner would have made it fine. The beds had been changed and there were fresh linens on them. They were also comfortable to sleep on. The furniture was somewhat beat up from use and looked kind of cheap to me. I thought fiore suites were an upgrade. They are bigger in size than the Clasic rooms and located at the ends of the hallways at either end. So, it was very quiet which was great.. Anyway, then I found food crumbs on the floor near the furniture, not under the furniture. My point is it was in plain sight. There were some hairs in one of the two sinks in the bathroom. I was not looking for these things I mention, I just discovered all this as I got settled into the room.", "title": "Not Worth the Money", "helpfulness": 10, "user": "uwsgirl", "date": "August 13, 2007", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 2.0, "value": 2.0, "rooms": 3.0, "location": 4.0}, "id": 8405839}, {"rating": 3.0, "stay_parameters": "Stayed June 2010, traveled with family", "text": "My stay at the Borgata was just ok, nothing special, and it certainly wasn't on par with the upscale Vegas hotels, in my opinion. I thought the Tropicana had more of a Vegas style hotel, big casino feel to it than the Borgata, but customer service at the Trop is terrible to non-existent. If the Trop had the same wonderful customer service as the Borgata, I would rather stay there. I also prefer Harrah's to the Borgata because their indoor adult pool with retractable roof is totally awesome, and it includes a restaurant with tables serving food and beverage, and beverage service at the pool.", "title": "Just ok, not the Vegas style casino I expected.....", "user": "jacal", "date": "August 8, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 74356889}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "Pros: Speedy/early check-in, good customer service, nice room and shower, nice room views of Atlantic City skyline, good security at elevator banks, comedy club.", "title": "102 stays and counting", "user": "JLESTO", "date": "August 6, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 74035956}, {"rating": 1.0, "stay_parameters": "Stayed July 2010, traveled with friends", "text": "Cons: Small indoor pool full of kids, no snack bar or drinks at outdoor lounge area next to indoor pool, small casino.", "title": "Why I will never stay at your 5-Star Hotel AGAIN!!!", "user": "jlopezNY", "date": "August 1, 2010", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 3.0}, "id": 73303233}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "I cannot believe the bad reviews for this place. I am a regular visitor but not a high roller. It does seem that the slots have gotten tighter but I still have a good time here. I have never had any complaints about the rooms, and I have stayed in both the regular rooms and the suites. The food is a mixed bag but I have been very happy with the room service. The only problems I have ever had were with other guests being loud and inconsiderate. Also, too many people bring their kids.", "title": "Super Service", "user": "dreamingofvegasbaby", "date": "July 27, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 72576905}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled with friends", "text": "Dear Mr. Andrea Marcato (DOFO),", "title": "Beautiful hotel, a few quirks- no outdoor pool", "user": "LynneyM25", "date": "July 26, 2010", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 72453482}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled solo", "text": "I haven't been in a casino for years as I find them bizarre at the best of times, but I visited the Borgata for an event in their \"Music Box\" venue which is a nice, intimate little theater. Great place to see your favorite act, although they could be more flexible about fans who like to get up and dance!", "title": "Entertainment Galore!", "user": "ladytez", "date": "March 24, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 155548197}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with friends", "text": "I found the rooms to be chic and luxurious. They have a cool, modern feel to them. Super mega comfortable bed, which I appreciated after a very long day/night.", "title": "lovely mini vacation", "helpfulness": 1, "user": "LazyShore", "date": "March 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 155491537}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with friends", "text": "It was Saturday night, and the place was buzzing. Even if you don't hit the casino, there are loads of restaurants and plenty of live entertainment. It was amazing how many events were taking place that one evening.", "title": "Fly Borgata", "helpfulness": 1, "user": "PuggieHead", "date": "March 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 155462121}, {"rating": 5.0, "title": "reservations", "text": "We visited the Long Bar late in the evening. Noisy and vibrant. Just the stuff!", "helpfulness": 1, "user": "jgulden1527", "date": "March 22, 2013", "id": 155355870}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "This stay was better that last year, and that one was great. The only problem I had was the check-in person told me the buffet (I had free tickets) was closed on Tuesday and Wednesday. When I questioned this as I received the offer and there was no fine print mentioning this, she said nothing--didn't even apologize. After checking into a lovely, clean room on the 7th floor, we made our way down to the casino. As we passed the closed buffet I noticed in small print on the closed sign that buffet tickets are being honored at the Metropolitan. Why was I not informed of this at check-in? Yes, the were honored there and the service and food was good.", "title": "Top rate digs!!!", "helpfulness": 1, "user": "Scottishchef", "date": "March 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 155066381}, {"rating": 3.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "The room was very nice; clean and comfortable. Staff was polite. We arrived very late at night and weren't up for much, and they had a reasonable pizza and beer room service option which was very nice. Hotel is far off the strip, so we took the jitney down to the boardwalk, the worst of which was seeing the contrast between new construction and dilapidated old AC (the distance didn't really bother us, approximately 10-15 minute ride). Value-wise, I was not overly impressed; we forgot our toothpaste, and they didn't have any complimentary, or even ones you could order. Had to go down to gift shop and buy an overpriced toothpaste there. Considering the cost of a weekend stay, I thought that was kind of silly. Also disappointed that it was also an additional $15 to use the gym. Pool area is only indoors and underwhelming ( since it's so far from the beach it would be nice to have an outdoor pool ) and the hot tub area could do with being torn out & redone (missing tiles, very worn). Had a great dinner at the Italian restaurant in the hotel ( Fornelletto ). Book reservations at restaurants early, as most were booked up when we booked the morning of (on a Friday). Didn't have a chance to try the club there, so not sure about it. We parked in the garage for 2 nights and it was $5 so very reasonable as far as that goes. Overall an enjoyable stay, but wouldn't describe it as the height of luxury.", "title": "Nicer than most in AC", "user": "ktrixie", "date": "July 20, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 71654850}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "My girlfriend and I took a spontaneous trip to AC for one night. I was debating between the Borgata and the Taj because it was on the boardwalk but I decided to go with the Borgata and i'm happy with that decision. We had an awesome view on the 39th floor. The room was really nice and clean. We loved the bathroom. The only thing I didn't like was that there wasn't a flat screen tv. I'm a total tv snob and if a hotel room that i'm paying top dollar for doesn't have a tv, then somethign is not right. But i looked past the throwback generation tv and had a good time anyway.", "title": "Nicest Hotel in Atlantic CIty", "user": "starski07", "date": "July 20, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 71631638}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "I love that the hotel is secluded and away from the hustle and bustle and grimeyness of the boardwalk. You definitely feel a little better about yourself when you stay at the Borgata. We stayed on a Thursday night so a lot of the lounges and bars weren't open. But we did have a couple of drinks at Bbar. The drinks there were lame and expensive. The bartender definitely needs to go back to bartending school. I asked for a stoli-O and pineapple...and it tasted like I opened up a can of dole pineapple juice. My gf had some crazy fruity cocktail but it tasted like rubbing alcohol without any of the fruity ingredients. We still managed to have a great time regardless and decided to just drink beer instead.", "title": "C'mon up ya'll", "user": "parhamh", "date": "July 19, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 71500317}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled with friends", "text": "The hotel and casino is huge but the layout can make it a bit confusing.", "title": "One of the Greats in Atlantic City!", "user": "Dapper_NJ_82", "date": "July 14, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 70909451}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "The buffet for dinner is not to be missed. EAT THERE! it's the best buffet i've ever had. The food is actually delicious and so much better than the ones at the other hotels.", "title": "Very nice stay", "user": "GimmeTradeWinds", "date": "July 13, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 70785208}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled with friends", "text": "i can't ever say that all the times i've visited the resort was a disappointment and for a change of venue there is always the water club which adjoins the two hotels for a change with of coursed some of the prettiests poos in atlantic city. No need to ever leave the property the service in every ammenity is top shelve and the staff is always accommodating and courteous never had a negative experience and shall always be my casino of choice.", "title": "bost review", "helpfulness": 1, "user": "sbost22", "date": "March 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 154556188}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "We stayed one night with a Winter Stay package that included Comedy Club Show tickets and a dinner voucher. Access to the hotel is easy and direct from major highways. The room was clean and as pictured. The inside jacuzzis and pool is beautiful and has it's own elevator stop to avoid walking through the hotel areas. It made for the perfect get-a-way. The Customer Service on the phone and at the hotel was extremely friendly and helpful with my reservations and during our stay. It is a quick drive or Jitney ride to the boardwalk/beach/casinos in AC.", "title": "Get a Way and Play...", "helpfulness": 3, "user": "jems1999", "date": "March 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 154535873}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "Everything went smoothly and as planned.", "title": "Best Hotel/Casino in AC", "user": "Ztrem", "date": "March 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 154525751}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "The casino floor is the best in town. The restaurants are all great...two weeks ago we ate at Bobby Flay's and the next night The Old Homestead...not inexpensive by any means but really great...both of them. On a previous trip we had eaten at NOW and that was excellent too.", "title": "Could really be excellent", "helpfulness": 1, "user": "Snoopydogsnoopy", "date": "March 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 154514958}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "Rooms are really nice and so are the bathrooms.", "title": "Nice Casino Hotel", "helpfulness": 1, "user": "kristilee74", "date": "March 14, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 154513570}, {"rating": 1.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "Decided to stay at the Borgata as my father had been admitted to a nearby hospital and I thought this place would be a nice place to stay between hospital visiting hours. The staff is willing to say hello, but is not very friendly. Little problems began almost immediately. Room keys did not work repeatedly and the front desk was not willing to send someone up, we had to go down every time. The phone and internet in the room did not work and had to be replaced. My sister joined us and developed food poisoning from the room service. They assured her the room service would be deducted from the bill. While my sister was recovering, a hotel employee came banging on the door at midnight. Not to check on her well-being, but to file an incident report in order to avoid a lawsuit. The next morning, the room service charge appeared on the bill.", "title": "NOT a four star hotel", "helpfulness": 3, "user": "SouthFloridaJohnny", "date": "March 19, 2008", "detail_rating": {"front_desk": 2.0, "business": 1.0, "service": 1.0, "cleanliness": 2.0, "value": 1.0, "location": 3.0, "rooms": 3.0}, "id": 14382852, "likes": {"liked": "— Nice looking casino. Some good restaurants.", "disliked": "— Terrible service."}}, {"rating": 4.0, "stay_parameters": "Stayed January 2008, traveled solo", "text": "Guests must pay a $10 fee to use the gym, which is ridiculous. They yelled at my girlfriend as she was unaware of the fee upon entering the gym. These are only the highlights of the problems we experienced. The rooms were modern, but average. Showers only, no bathtub in my room. The casino is nice enough and there are some good restaurants in this hotel. But the staff and management of this hotel have no understanding of the meaning of hospitality. This is the least accommodating hotel I have ever stayed in. I have had better service at Motel 6. I have read some rave reviews of this hotel on this site. I would urge the reader to take these with a grain of salt. If you are only concerned about seeing a nice looking casino with some good restaurants you may not care. However, if you expect any level of hospitality or service do not stay here. This is a modern day clip joint.", "title": "The Borgata is Great", "helpfulness": 4, "user": "queenices", "date": "March 10, 2008", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 14191838, "likes": {"liked": "— The Spa and restaurants"}}, {"rating": 3.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "I went to the Borgata for an overnight getaway on New Year's Day 2008. This was my first time at the hotel, although I'd meant to go there for some time, as I'd heard wonderful things about it.", "title": "Hope they are not riding solely on their reputation ...", "helpfulness": 4, "user": "traveling_esquire", "date": "March 5, 2008", "detail_rating": {"cleanliness": 2.0, "front_desk": 3.0, "location": 4.0, "value": 3.0, "rooms": 2.0}, "id": 14071551, "likes": {"liked": "— price of rooms", "disliked": "— lack of maintenance and/or cleanliness of the rooms"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled on business", "text": "This place is simply wonderful, and in my opinion the best hotels in AC. Although the hotel is a ways away from the Boardwalk, I didn't care as I didn't even want to leave the place. The self parking is only $5, and the elevator from the garage to the casino is one of the nicests I've seen.", "title": "The best that AC offers, but still overpriced", "helpfulness": 1, "user": "mccarthys5", "date": "March 2, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 5.0, "value": 3.0, "rooms": 2.0, "location": 4.0}, "id": 13995117, "likes": {"liked": "— Nice array of restaurants for an AC casino", "disliked": "— The tube TV's in the $500/night rooms need to go!!!"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2008, traveled with family", "text": "The hotel states that check-in isn't until 4 PM, but I showed up at 11 AM, and within 5 minutes, I was given a key to my room. One had to show a room key or be escorted by a bell hop to get past the security guard who guards the entrance to the hotel room tower . I liked this aspect, as it made me feel a bit safer.", "title": "Ok, but overpriced.", "helpfulness": 1, "user": "aabelik", "date": "February 23, 2008", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 2.0, "rooms": 5.0}, "id": 13795568, "likes": {"liked": "— Beds and Linens are Amazing!!!", "disliked": "— Location and Price"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "I stayed at the Borgata a few times over the past couple of years and I have always had a decent room, not to mention complimentary. The bed is comfortable and are covered with nice linens. The shower is made of marble and is a big walk in with a seat. I am a stickler about a clean room and I have never been disappointed. I always get great bonus slot dollars from them too. I play at other casinos but don't seem to get as many free offers. I have attended the Comedy show a few times for free and usually two of the three comedians are worth seeing. The only minus is its not on the boardwalk so you have to drive there. You can get a parking transfer when you leave the garage so you won't have to pay at the other casino. It is good at all casinos", "title": "A great time again", "user": "coupclip", "date": "June 30, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 69246761}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled with friends", "text": "Stayed at the Borgata for a girls' weekend trip. We stayed on the sixth floor in a room with two queen beds. Very nice room, though nothing outstanding or special about it. For the price, you would expect a sitting area or something, but the nice part of staying at the Borgata is the convenience of enjoying everything the hotel has to offer. There are many restaurants on site, and even a fast food/cafeteria place if you dont want to spend too much money. There are two nightclubs and many casino games and tables to play. We never got bored. Self-parking was only $5. Checking in was a breeze. I would recommend this hotel for a really fun weekend getaway.", "title": "GREAT stay but pricey", "user": "DCgirl520", "date": "June 28, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 68949231}, {"rating": 2.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "My wife treated me to a night for fathers day I should have gone fishing. The rooms were small but nicely furnished. The bathroom where the sink and shower was nicely tiled but the toilet area was wallpaper like tile. The lighting was bad and my wife had a hard time putting her makeup on. The tv was broken but maintenance repaired it quickly. Two of the lights were broken one would occasionally work and the other had to be turned on with a pliers lucky I carry one of those multi purpose knifes with me. The room had a odor when you first enter but seem to dissipate quickly. They charge you for everything 15 dollar charge for health club another charge for Internet and another 15 for the steam room. The 10 dollars for valet parking. The pool music was extremely loud with everyone smoking even the living room ( a room where you can sit down and read the newspaper) was loud. The service thought was extremely efficient but not knowledgeable.", "title": "reputation is overblown I should have gone fishing", "user": "jsandler", "date": "June 21, 2010", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 1.0, "sleep": 3.0, "rooms": 2.0, "location": 1.0}, "id": 68224470}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "Went here June 18th with my hubby and I had a great time. Check in was fast and trouble free.", "title": "Had a great time", "user": "anitabeach", "date": "June 21, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 68182062}, {"rating": 4.0, "stay_parameters": "Stayed June 2010, traveled on business", "text": "Played video poker and the slots were loose. Heard many jackpots being hit. We used to stay at Bally's but no longer after staying here. At Bally's the slots just took your money and never really gave you any play time.", "title": "Good meeting facility", "user": "PhilQ3", "date": "June 15, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 67635770}, {"rating": 3.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "This was my third stay at Borgata. The first trip I was impressed with rooms, hotel decor, comedy club, etc. The second trip was nice but the staff behind the front desk was rude. The third trip the staff was still rude and the hotel is starting to show its age. The carpet in the room was stained. The marble in the bathroom looked dingy and cracked. I was not impressed but since it is the only kind of classy hotel in the area I'll be back, especially if I can get a cheep deal. One more thing, the quality of the people that stay there is changing too. There were a lot of trashy looking smokers. I would expect more from a so-called upscale hotel.", "title": "Starting to Turn Cheesy", "helpfulness": 7, "user": "kathjolie", "date": "September 8, 2006", "detail_rating": {"front_desk": 2.0, "service": 3.0, "cleanliness": 3.0, "value": 2.0, "rooms": 4.0, "location": 5.0}, "id": 5782528}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled with friends", "text": "My initial reason for going to the Borgata was to see Carlos Mencia. I knew nothing about the hotel. The website was cute, but aren't they all?", "title": "Holy (---)!!", "helpfulness": 18, "user": "aaron6576", "date": "September 4, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 5769230, "likes": {"liked": "— The asthetics", "disliked": "— go as high as you can with a city view"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "We pulled up to the front door and the parking attendant practically ran to our van to help us with our bags and seemed a little disappointed when I told him I could carry my one bag. Walking through the front door is when I realized this place is special. A red/orange glass sculpture shooting roughly twenty feet into the air like lava from a volcano stands just inside the front door. As you run your eyes to the top of this sculpture you the see another burst of fiery red/orange glass coming at you from the ceiling in the form of a chandelier.", "title": "Borgata Nice but...", "helpfulness": 12, "user": "pandy44", "date": "August 26, 2006", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 3.0, "cleanliness": 3.0, "value": 4.0, "location": 3.0, "rooms": 4.0}, "id": 5712412}, {"rating": 4.0, "stay_parameters": "Stayed August 2006, traveled with friends", "text": "As I made my way past the entrance I get in line to check into my room. I notice a statue of a roman soldier up on a pedestal made of plaster. I turned away from the statue for a second, and to my surprise when I looked back over at it, it had changed positions! It was a real freakin' person dressed up to look like a statue!!!!! There are three of them scattered about the casino floor. That totally blew me away.", "title": "Happy Birthday to Me!!", "helpfulness": 18, "user": "WorldTour'79", "date": "August 22, 2006", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 3.0}, "id": 5699925}, {"rating": 3.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "Our room wasn't ready yet so we wandered around the casino playing a machine here and there. The payouts were pretty desent when I won, and the machines were nice and slow to take my money when I didn't do very well. While I didn't play any of the tables, the employees working the tables seemed very nice and very professional.", "title": "NICE BUT, EMPLOYEES AND MANAGEMENT HAVE BAD ATTITUDES", "helpfulness": 16, "user": "m16inc", "date": "August 22, 2006", "detail_rating": {"front_desk": 3.0, "business": 5.0, "service": 1.0, "cleanliness": 5.0, "value": 3.0, "location": 4.0, "rooms": 5.0}, "id": 5698964}], "location": {"country": "United States"}, "stars": 4, "variance": {"poor": 125, "average": 209, "very good": 598, "terrible": 158, "excellent": 805}, "aka": "Borgata Hotel Casino And Spa", "slim_ranking": 0.016393442623, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.5, "rooms": 4.0, "location": 4.0}}