{"user_rating": 4.0, "review_count": 639, "name": "Boscolo Venezia, Autograph Collection", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed October 2005", "text": "We stayed at this hotel for a long weekend in a junior suite. The room was lovely with a welcoming bottle of champagne and biscuits, lovely toiletries in the bathroom, but the view was of the kitchen!!! The hotel is very ornate and has a lovely garden and jetty area which overlooks the water. We dined in the hotel restuarant on our first night and the food was passable but the breakfast the following morning was truly awful. There was an extra charge of 30 euros for a plain omlette. Staff, with the exception of reception, were inexperienced and not particularly helpful and the service in the bar was very slow. Would return to Venice in the future but would stay elsewhere.", "title": "Average for a 5 Star", "helpfulness": 11, "user": "beaubrummie", "date": "October 21, 2005", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "rooms": 5.0, "service": 1.0}, "id": 4041418}, {"rating": 5.0, "stay_parameters": "Stayed September 2005", "text": "My husband and I were sent to the Dei Dogi when the Boscolo Bellini had an unexpected overbooking. They could have put us in any room, but we were so fortunate with excellent accommodations.", "title": "Tranquil and sumptuous", "helpfulness": 5, "user": "Unforgettable", "date": "October 8, 2005", "detail_rating": {"cleanliness": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4001878}, {"rating": 3.0, "stay_parameters": "Stayed August 2005", "text": "This 16th century monastery also served as the French embassy. This hotel is located in a peaceful area of Venice. We had a luxurious rose garden room with private patio just off the Venice lagoon. The location was gorgeous with views of the water and boats. The garden is amazingly beautiful. The room was sumptuous with marble floors, vaulted beam ceiling, murano glass chandeliers and rich fabrics. The hotel was very elegant. Desiring something more casual for dinner, the concierge recommended 40 Ladroni, a small local cafe on a canal which was popular with locals. The dinner was inexpensive and fantasic. We loved this restaurant so much we returned two nights later. In our thick, soft Boscolo robes, we enjoyed evening wine on the garden patio. We enjoyed our morning breakfast on the patio as well.", "title": "Excellent service but tiny room!", "helpfulness": 6, "user": "uksweets", "date": "August 30, 2005", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 2.0, "service": 5.0}, "id": 3815991}, {"rating": 1.0, "stay_parameters": "Stayed July 2005", "text": "We would have stayed more nights, but had already booked the Boscolo Bellini. Hotel Bellini was very nice, but in a much energetic location on the Grand Canal.", "title": "Three star luxury at five star rates", "helpfulness": 3, "user": "chasmo75", "date": "July 27, 2005", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "rooms": 1.0, "service": 2.0}, "id": 3704773}, {"rating": 5.0, "title": "Gorgeous hotel, wonderful stay", "text": "Just came back from a long weekend in Venice over the August Bank Holiday.. Arrived at the Dei Dogi expecting a 5* hotel.. The service of the receptionist certainly appeared to support this, as when they ascertained that this was our first time in Venice, there was an in depth explanation of how Venice works, and how to get about on the vaparetto service.. The lobby was also pretty impressive, with the garden restaurant visible through the lobby.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "June 18, 2005", "id": 3574706}, {"rating": 5.0, "title": "Wonderful!", "text": "My husband and I booked this hotel to hold our wedding reception and we also stayed in the hotel for 4 nights. The wedding reception that they organised for us was fantastic. The food and wedding cake they prepared was beautiful. All the staff were very helpful and kind. The hotel rooms are great as well. They also have a complementary boat service to take guests to St Mark's Square, very useful for the older guests!", "helpfulness": 3, "user": "A TripAdvisor user", "date": "December 13, 2004", "id": 2877701}, {"rating": 1.0, "title": "Over priced, out the way and needs a refurb", "text": "The common parts of the hotel are badly in need of a refurb - really scuffed and dirty (the lift has ripped cloth and grafitti). Our first bedroom we were shown had a broken air con unit that banged really noisily continuously. After the hotel begrudgingly showed us another room, we discovered our new room was in the process of a bathroom extension (through our closed bathroom window you could see where they were extending it) and smelt heavily of building works. We had the worst view in Venice overlooking a kitchen that was filled with paint cans. The staff were unhelpful, despite offering assistance with outings etc. they never called back. The rooms could be charming and you might be luckier than us in getting a better room - but I imagine that there are much safer and nicer options then this hotel. Definitely not worth the 5 stars or the price that we paid!", "helpfulness": 4, "user": "HollersB", "date": "September 1, 2004", "id": 2506992}, {"rating": 4.0, "stay_parameters": "Stayed July 2004", "text": "Just returned from a two night stay. Had a special $210 night rate with breakfast. Lovely room and bath ... view of the quiet canal. Breakfast was extensive and plenty to get you well past lunch. The coffee happened to be the best that I had in Rome, Florence anywhere .... yum!", "title": "Too bad it was only Two nights", "helpfulness": 3, "user": "674", "date": "July 14, 2004", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "service": 4.0}, "id": 2298841}, {"rating": 2.0, "stay_parameters": "Stayed February 2005", "text": "We booked a long weekend in the Dei Dogi in February 2005, having stayed in a Boscolo hotel in Lyon, where the accommodation was first class and the rate reasonable. We were attracted by the description of the hotel - in a converted palace with period decoration. Essentially, this is true. The Dei Dogi is indeed an impressive canal-side building with relatively large public spaces. It is also very convenient when arriving by water taxi from the airport. I agree with your other reviewers, that this hotel is a little distant from the centre of Venice, but this could be seen as an attraction. In any case, the canal-side walk to San Marco is no longer than fifteen minutes.", "title": ".. the good, the bad and the indifferent ..", "helpfulness": 7, "user": "Paul71043", "date": "May 29, 2005", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "rooms": 2.0, "service": 4.0}, "id": 3508020}, {"rating": 5.0, "stay_parameters": "Stayed May 2005", "text": "The rooms were adequate but certainly not generous for the rate charged. The view from the windows was a blank wall. Despite comments from other reviewers, the air-conditioning did work, although this was in winter.", "title": "A Concierge problem", "helpfulness": 1, "user": "Cleveland_OhioKons", "date": "May 22, 2005", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 5.0, "service": 2.0}, "id": 3492864}, {"rating": 4.0, "title": "Laid back style in a quiet backwater", "text": "Although the food was interesting and the service attentive, the restaurant lacks atmosphere and is massively over-priced There are cheaper and better restaurants locally.", "helpfulness": 1, "user": "ashleypair", "date": "May 12, 2005", "id": 3467939}, {"rating": 1.0, "stay_parameters": "Stayed January 2005", "text": "A major complaint is the internet booking system, operated by the Boscolo chain, when cheaper deals can be negotiated locally. It is galling to find that you have spent considerably more than your other guests when the website asured you that this was the 'lowest rate'. Despite the local staff being excellent, you will find that courteous but enquiring letters to managers and then to directors, about misleading advertising and charging, remain unanswered.", "title": "No, no, a thousand times no.", "helpfulness": 5, "user": "chefdiane", "date": "January 29, 2005", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "rooms": 4.0, "service": 1.0}, "id": 3097876}, {"rating": 2.0, "stay_parameters": "Stayed December 2004", "text": "And, do not take the trip organised by the hotel to the glassworks in Murano. It is a scam of which the hotel should be ashamed.", "title": "ROOM 106 Totally over priced", "helpfulness": 5, "user": "axltope", "date": "January 2, 2005", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "rooms": 2.0, "service": 3.0}, "id": 2970622}], "location": {"country": "Italy", "region": "Veneto", "continent": "Europe"}, "stars": 5, "variance": {"poor": 45, "average": 74, "very good": 177, "terrible": 39, "excellent": 304}, "aka": "Boscolo Venezia, Autograph Collection Hotel Venice", "slim_ranking": 0.246719160105, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}}