{"user_rating": 3.5, "review_count": 583, "name": "Boston Hotel Buckminster", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "We were on a baseball weekend, and you couldn't get closer to Fenway park unless someone dropped you off in front. It was very close to the subway, and just a few stops from historical places. There were also great sports bars within walking distance.", "title": "Buckminster and Fenway", "helpfulness": 2, "user": "treestump", "date": "June 20, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 17088423, "likes": {"liked": "— Location", "disliked": "— Road construction nearby"}}, {"rating": 2.0, "title": "Roaches", "text": "The facility was roomy, clean, and full of character. We arrived about midnight, and the staff was both cheerful and helpful.", "user": "JudithV", "date": "April 3, 2008", "id": 14775349}, {"rating": 1.0, "stay_parameters": "Stayed November 2007, traveled with family", "text": "I know this sounds like a complete contradiction.....the hotel was very clean....but we had a roach in our bathroom. Go figure.", "title": "Fleabag Hotel", "helpfulness": 2, "user": "kgilligan", "date": "January 21, 2008", "detail_rating": {"value": 1.0}, "id": 12859258, "likes": {"liked": "— Nothing", "disliked": "— Everything"}}, {"rating": 3.0, "stay_parameters": "Stayed November 2007, traveled on business", "text": "This hotel is directly opposite Boston University. It claims to be \"restored to its prior grandeur\". I was looking for a nice, inexpensive hotel for my family to attend a seminar at Boston U. I assumed since it was across the street that it would be nice. $150.00 for the night. The parking for the hotel was below street level and there were burned out cars, trash and very unsecured parking. That should have been my first indication of what we would find. The lobby was ok. Old, but ok. The upstairs was horrible. The rooms looked like old dorm rooms from the 1970s. They had a small kitechenette in each room. The furnishings were old, the linens were old, the walls were cracked and dirty. The place was just awful. We stayed and slept and got right out. Please do not stay- I cant imagine anyone being comfortable there.", "title": "No issues.", "helpfulness": 2, "user": "Melissaif", "date": "December 27, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 2.0, "cleanliness": 4.0, "value": 3.0, "location": 5.0, "rooms": 2.0}, "id": 11989782, "likes": {"liked": "— Great location!", "disliked": "— Not much of a bathroom counter."}}, {"rating": 3.0, "stay_parameters": "Stayed October 2006, traveled on business", "text": "No issues. Based on their service I would say they were about a 1 star, but everything was clean and entirely unobjectionable. I stayed in a suite with 4 other people and it was the lowest rate we could get in the area. The night I arrived there was a Sox game visible from the window which I found exciting. If you wanted to go to sleep early it might be loud, bright, and distracting, though. The location in Kenmore square was also nice. There are some cool restaurants/bars nearby as well as the T, bagel places to get a good breakfast, and of course BU. If you squinted really hard from my window (not the same window as the Sox game) you could actually see the Charles River. I would stay there again.", "title": "It was just fine", "helpfulness": 4, "user": "NC_tar_heel_64", "date": "November 5, 2007", "detail_rating": {"cleanliness": 3.0, "front_desk": 3.0, "location": 4.0, "value": 4.0, "rooms": 4.0}, "id": 10621700}, {"rating": 1.0, "stay_parameters": "Stayed September 2007, traveled with friends", "text": "Thie staff is horribly rude parking is first come first serve the bed are uncomfortable. They allow scalpers to conduct business in the lobby. All in all it was the worst hotel I have ever been to I would prefer motel 6. I strongly urge you not to ruin your vacation stay else where.", "title": "Horrible", "helpfulness": 2, "user": "nmcjtc", "date": "September 17, 2007", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "location": 3.0}, "id": 8736990, "likes": {"liked": "— can't pick just one"}}, {"rating": 1.0, "stay_parameters": "Stayed September 2007, traveled with friends", "text": "My wife and I had tickets to see the Sox play the Yankees with another couple we are friends with. Our friends booked a room with the hotel thinking it would be a great place to stay, especially with the proximity to Fenway.", "title": "Horrible Beds, Awful Service, Much Better Values Available!", "helpfulness": 4, "user": "NHJay", "date": "September 16, 2007", "detail_rating": {"front_desk": 2.0, "business": 1.0, "service": 1.0, "cleanliness": 2.0, "value": 1.0, "location": 4.0, "rooms": 2.0}, "id": 8724627, "likes": {"liked": "— The location", "disliked": "— The rudeness of the staff, the lack of parking, the uncomfortable beds."}}, {"rating": 3.0, "stay_parameters": "Stayed August 2007, traveled with friends", "text": "To start with, my wife called the night we were to arrive with a question regarding parking, right off the bat the guy she was on the phone with told her that if she had a problem with their parking policies that he would just cancel her reservation. My wife hadn't even started to complain yet or give her name, she just mentioned she had a question.", "title": "Great Location", "helpfulness": 2, "user": "StandingRoom", "date": "August 27, 2007", "detail_rating": {"cleanliness": 2.0, "front_desk": 3.0, "location": 5.0, "value": 3.0, "rooms": 2.0}, "id": 8515660, "likes": {"liked": "— Proximity to Fenway Park and Subway station", "disliked": "— Rooms need to be renovated"}}, {"rating": 1.0, "title": "Only plus is proximity to Fenway", "text": "Once we arrived, we discovered that the hotel doesn't have it's own parking, they rent spaces from a tiny garage which is next to the hotel. Parking is first come, first serve and if the Sox are playing you more than likely won't get a space. Thankfully we managed to squeeze in but this is a fact we should have been made aware of ahead of time.", "helpfulness": 3, "user": "jnjgotaas", "date": "July 30, 2007", "id": 8260580}, {"rating": 1.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "We had two nights booked, the first was so/so, the beds are very hard and uncomfortable and the pillows might as well not be there, they provide no support at all. As for the second night, we were on our way back from Fenway after seeing the Sox smash the Yanks and as we were about to walk into the building, some fool from the 3rd floor decided he was going to throw things out the window. He had already thrown a pillow out, then proceeded to dump a cup of water on my wife.", "title": "Don't Stay Here!!", "helpfulness": 2, "user": "cyn0002", "date": "July 24, 2007", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "location": 4.0, "rooms": 1.0}, "id": 8226786, "likes": {"liked": "— cheap rates", "disliked": "— the entire experience especially how filthy it was."}}, {"rating": 2.0, "stay_parameters": "Stayed November 2004, traveled with family", "text": "We stayed at the Buckminster in 2004 (I know it's been a while, but I was just thinking about the trip today) and we were not all that impressed. The hotel is promoted as being Victorian and full of antiques... and the pictures online are decently nice. However, we just found it was just plain old. I suppose Victorian is just a nice way of saying old. Yes, true, Boston is an old city ...with a tremendous amount of charm. I actually loved Boston. However, for the price you pay at Buckminster, old hard beds with musty smelling sheets and a stand alone sink with NO counter space at all in the bathroom leaves something to be desired. I do have to say that the breakfast at the teeny little restaurant (and I do mean teeny) downstairs was actually quite tasty. To their credit, they were renovating the lobby at the time, but still that seem to have no bearing on the old hard beds and must sheets. However, our next trip to Boston was exactly one year later in 2005, and we stayed at the Radisson which is just across the river...and loved it. It is a far better deal with comfy beds, clean, non-musty accommodations and a japanese steakhouse, lounge/bar to boot. It is just across the river from the Buckminster, about a 5 minute cab ride, in the Boston University area.", "title": "Better Deals than the Buckminster", "helpfulness": 2, "user": "survivorfan", "date": "July 10, 2007", "detail_rating": {"front_desk": 3.0, "service": 2.0, "cleanliness": 2.0, "value": 1.0, "rooms": 2.0, "location": 5.0}, "id": 8090964, "likes": {"liked": "— it's prime location", "disliked": "— the smell, the lack of updating the rooms, the beds"}}, {"rating": 4.0, "title": "Good Value, Great Location", "text": "We planned a college reunion to coincide with the Head of the Charles regetta, in which we were also competing. After pricing several hotels in Boston and factoring the cost of cabs, we choose the Buckminster for its location. It's central (i.e. walking distance) to our guest boathouse, shops, downtown, food and Fenway (although it was after post-season). It met all of our needs (4 women and 2 spouses, all in our mid to late 30s). Would I be happy if this was my honeymoon hotel? No. For a college reunion weekend and/or visiting local colleges, hitting up a Sox game, or otherwise paying for it on my own dime, it was great. It reminded me of an off-campus apartment in Boston, which was the perfect atomsphere for us.", "helpfulness": 2, "user": "LolaAnsel", "date": "July 4, 2007", "id": 8057317}, {"rating": 2.0, "stay_parameters": "Stayed July 2007, traveled solo", "text": "I have stayed at The Buckminster five times when I was in grad school in Boston. The first couple of times were okay, but the last three stays were awful. \"The Bucky's\" location in Kenmore Square is super convenient to Fenway (across the street) and to the subway stop. It's relatively cheap and the rooms are okay. The hotel staff is courteous but refused to upgrade me... no perks for frequent stays. I asked for a quiet room and they gave me the noisiest room in the hotel (facing Fenway Park) with night game lights, noisy Boston Red Sox fans, seriously loud street noise and the commuter rail. If you stay there ask for a room that does not face Fenway! The air conditioning was on the fritz during two summer stays. Rooms are hot and stuffy, and with all the noise you can't really open the windows. Winter stays were more pleasant. This hotel is good for students and Red Sox Fans, not good for families, the eldery.", "title": "Great Location,run-down hotel", "helpfulness": 1, "user": "janeknows", "date": "July 3, 2007", "detail_rating": {"front_desk": 2.0, "service": 4.0, "cleanliness": 2.0, "value": 2.0, "rooms": 2.0, "location": 5.0}, "id": 8050657, "likes": {"liked": "— The location and the price", "disliked": "— Noisy, poor cleanilness, run-down"}}, {"rating": 2.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "The hotel was old, but clean, and our suite was quite large. However, the continental breakfast is a joke, and for what we paid for a one nights stay, I was very disappointed and would not recommend this hotel to others. BU has taken it off of their \"recommended hotels\" list.", "title": "Overpriced Hotel Buckminster", "user": "llama", "date": "June 24, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 1.0, "location": 3.0, "rooms": 3.0}, "id": 7976403}, {"rating": 1.0, "stay_parameters": "Stayed June 2007, traveled with friends", "text": "I was in Boston for EBay live and ended up in this stinky place. I can only say smells like urine & cigarette mix . The first night Boston was really cold staff would not turn heat on ... the hallway was warmer than the room. I was itchy all night -I guess fleas .Really dirty carpet and dirty rooms .", "title": "Horrible , stinky, Fleas and all ....", "user": "ebaytraveller", "date": "June 18, 2007", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "location": 2.0, "rooms": 1.0}, "id": 7873434}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "While we were hesitant to book here due to some sketchy reviews, we decided give it a try , especially since it was only for one night. Things we loved were that the hotel was literally across the Turnpike from Fenway Park and right on Commonwealth Ave, the low rate (159.00) for a king suite within city limits and the proximity to the subway. All those things are as advertised and the hotel is a great spot to have as a home base. We stayed on the 5th floor of the 6 floor hotel. The elevator although a little small was clean and not slow. The king bed was newer, firm and very comfortable to sleep in. The living room was nice to have as we like to spread out and that's nearly impossible if you just have a single room with a bed. The hotel (what we observed) itself was NOT dirty and dingy or smelly. The room was clean with only some dust on the high dresser in the bedroom. Behind the bed was clean(always a sign of lazy cleaning when dirty) and vacuumed. The double windows and shutters did dampen some of the inner city noise but not all( hey, it's a BIG city). We expected some traffic noise considering it's location and were not bothered by what did come through. The room (all of them ) had a working refridgerator and microwave and there was a clean, large cooking area with sinks and a stove on each floor. When we had to deal with the staff they were all courteous and helpful. The weather temperature was perfect so we needed no heat or air conditioning so I can't rate how they worked. Self parking was readily available for 18.00 a day right next door and the attendant there was courteous. There were some slight spotting on the room carpet but nothing drastic at all. My biggest and probably only complaint was the bathroom towels. They were not up to snuff as they were thin, old, and although cleaned and hopefully bleached, were spotted, as were the replacements that were given to us without a problem. I would suggest bringing a couple of your own towels or do as we did, dry off with some clean, extra tee shirts. The continental breakfast is nothing but some tupperwares filles with bread, bagels,muffins, etc served inside the attached Japanese restuarant and we passed on it. McDonalds and Dunkin Donuts are both right next door and will fill the gap for you. We live just 90 miles away in W. Massachusetts, so we know the area well and I can tell you from experiance that this is a good location to have as homebase for a few days, especially if you don't like driving alot. As stated earlier , the subway (Green Line/Kenmore Station) is just a couple blocks from The Buckminster and can take right to most attractions in the city including North Station where you can get a commuter train and will take you to just about any cities that are around Boston from Plymouth to Glouchester/Newberryport to Providence, RI.. The place isn't the Ritz but for the price I know that I'll be giving them another try at some point. But I'll bring some towels.", "title": "1st experience with the Buck was good overall", "helpfulness": 2, "user": "MassMick", "date": "June 16, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 7858825, "likes": {"liked": "— Price/Location", "disliked": "— Towels"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled with friends", "text": "We went to a Red Sox game for my bachelorrette party and stayed at the Buckminster. There were 12 of us girls and not 1 single complaint. It was within a 3 min walk to Fenway. The building is old, but in very good shape and they were doing some renovating while we were there. The rooms were clean and staff was very nice. It was perfect for us!!", "title": "Perfect Place for after the Sox Game!!", "user": "10E_Girl", "date": "June 13, 2007", "detail_rating": {"front_desk": 5.0, "service": 3.0, "cleanliness": 3.0, "value": 5.0, "rooms": 3.0, "location": 5.0}, "id": 7844912, "likes": {"liked": "— So Close To Feway!", "disliked": "— Nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled with family", "text": "The Buckminster has had it's entire lobby remodeled and is much improved. Rooms were clean and acceptable. Bathroom was small, but I haven't found a hotel room with an acceptable size bathroom yet (especially shower). Room was PLENTY big enough. We had a great experience at the Buckminster. Staff was very friendly to us. If you're looking for a Ritz Carlton room, it's not here, but it's not as bad as other reviews make it out to be. Some people just are never", "title": "Great place to stay after a ballgame", "helpfulness": 1, "user": "mainahh", "date": "April 29, 2007", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 7480904, "likes": {"liked": "— location", "disliked": "— very slow elevators"}}, {"rating": 1.0, "stay_parameters": "Stayed May 2006, traveled with family", "text": "happy.", "title": "Filthy, Disgusting, Way Overpriced", "helpfulness": 2, "user": "shanamaidl", "date": "April 21, 2007", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "location": 1.0}, "id": 7405710, "likes": {"liked": "— leaving it", "disliked": "— staying there"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2006, traveled with family", "text": "We stayed at the Buckminster over Patriot's Day weekend and was an ideal spot for staying after a Sox game, or taking in the Marathon.", "title": "LOVED the Buckminster!", "helpfulness": 1, "user": "anna10582", "date": "April 19, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 7393414, "likes": {"liked": "— flexiblity of check-in / check-out times; rates; ability to check/hold bags before and after checkin/out", "disliked": "— the room was kinda smelly; mother-in-law..."}}], "location": {"country": "United States", "city": "Boston"}, "stars": 3, "variance": {"poor": 50, "average": 106, "very good": 259, "terrible": 59, "excellent": 109}, "aka": "Buckminster Hotel", "slim_ranking": 0.753246753247, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.5, "location": 4.5}}