{"user_rating": 4.5, "review_count": 1167, "name": "Bougainvillea Beach Resort", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "Booked this for 10 days on the new year, never been to barbados before and it was just perfect for the rest we needed to start the new year. E booked a suite and we were not disappointed it was big. If you didn't want to cook in the well equipped kitchen the lanterns restaurant offered a good breakfast, for the evening we ate there once, but had been recommended so many others e ate out a lot. Waterside restaurant is adults only and it was ok ! The hotel always have taxis outside to take you where you want to go and will pick you up also. Good service all around.", "title": "Great place", "helpfulness": 1, "user": "richards61", "date": "January 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 150685266}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "Having been here 7 times before, I thought it time to review what we consider the best value resort on Barbados, but don't just take our view, look at all the previous reviews, speak to the locals and taxi drivers, they all say the same thing. Is it Sandy Lane? No, does it have the Cliff resteraunt? No, is there a helicopter pad? No, so what does make it the best?", "title": "Been here 7 times before writing this review, 5 stars all the way", "helpfulness": 1, "user": "keystonePreston", "date": "January 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 150663036}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "Very, very friendly staff and a strong management team", "title": "Feminine Touches make this Hotel rock", "helpfulness": 3, "user": "SunkistTwo", "date": "January 25, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 150606740}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled with friends", "text": "Well kept and lush gardens", "title": "Great with a Few Exceptions..", "helpfulness": 7, "user": "bspnvt", "date": "January 25, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 150606473}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "Access straight onto the beach", "title": "Lovely hotel", "helpfulness": 2, "user": "5* traveller", "date": "January 23, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 150347516}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "My fiance and I stayed here the first week in December and had a wonderful time. We stayed in a studio and were very happy with the room. It had a large balcony, view of the beach/ocean, a separate bedroom area, nice sized living room area, and a fully equipped kitchen. Everything was nice, modern and clean. The kitchen had all kinds of pots, pans, a colander, silverware, dishes, cups, microwave, toaster, oven, stove, freezer and fridge. The only real complaint I had with the room was the AC, as it was extremely weak. There are also no paper towels in the kitchen.", "title": "Awesome resort!", "helpfulness": 4, "user": "heathergreg", "date": "December 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 147163523}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled with family", "text": "The beach was gorgeous- decent sized waves, soft sand, clear water. Be careful of the crabs that crawl out of the large rocks at either end of the beach! We also saw a large monkey near the pool bar one afternoon- very cool. They supposedly come out at about 6am and run free around the premises when no one is out there yet. There were always plenty of beach chairs and the guy at the sports activities stand will put an umbrella up for you if you ask. Make sure to catch a good sunset on a night it's not cloudy- we got amazing pictures of one of them!", "title": "Best holiday ever", "helpfulness": 2, "user": "adrian h", "date": "December 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 146825155}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "We did some souvenir shopping in Bridgetown, which wasn't that impressive a town. We wish we had known that Oistins Fish Fry not only has fish, but also chicken and pork, so it's worth checking it out even if you don't like fish. The hotel offers free shuttles to both Bridgetown and Oistins on certain days and times.", "title": "Wonderful place to stay", "helpfulness": 5, "user": "John L", "date": "November 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 146283332}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "The food was extremely expensive at the resort and the quality of the food depended upon which time you ordered it. Same with drinks- some seemed to have no alcohol, others were very strong. Denis at the pool bar makes very strong drinks so I highly recommend him:) My fiance loved Leroy's van that came to the front of the hotel for lunch every day selling sandwiches. Very good value.", "title": "great place, not too big, not too small", "helpfulness": 4, "user": "mupsi212", "date": "November 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 146242246}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "Overall, we received excellent service and accommodations. The entire staff was friendly, knowledgeable, and eager to help. They never made us feel like we were a burden and always had a smile for us. I would highly recommend this resort.", "title": "Family trip to barbados", "helpfulness": 5, "user": "Selwyn C", "date": "November 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 146034684}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "We stayed in this complex from the 28th December. Checked in very promptly and we stayed in 3102 which is on the older side but was lovely, very spacious with a double balcony and very quiet. At night you could only hear the ocean, perfect. Staff at reception were very helpful and sorted things out quickly. They have happy hour at 1530 until 1630 but to be honest this was far to early and the service was incredibly slow!!!! We only bothered twice and then gave up. We ate at both restaurants and had no problem at all with the food but the service in Lanterns leaves a lot to be desired, on our last day we ordered lunch to be told there was no chicken, not normally a problem except 75% of the menu is chicken!!! We all spoke to the restaurants manager (he is exceptionally helpful) and this was eventually sorted out. Great resort and would definately recommend and would certainly go back. Please be aware though that if you are used to all inclusive, staying in a self catering resort is a bit of an eye opener, everything is so expensive and the supermaket shop was eye watering.... however the food vans that come to hotel are great, loads of food good quality for a decent price, but be aware he was not there over christmas and did not turn up until 3rd January (i think) All in all a great resort for families and couples. St Lawrence gap during the day is a very easy walk BUT i would not do this at night. We went to Oistens but this was a real let down as a lady was mugged and it put a dampner on the evening so I would not go back there - also where we ate the food was extremely average but not an average price. We ate at Champers, fantastic, Tapas average, Cafe Sol, loved, Cafe Luna had a disaster but they were very good at sorting it out and did not charge for the mens meals. We went to TGI's on New Years Eve and waited 40 minutes for a drink and 2 hours for food - the place was at best 50% full absolutely terrible service, but food was great. Great holiday, great weather and cant wait to go back next year!!!!", "title": "Great Holiday", "helpfulness": 3, "user": "julie-torre", "date": "January 22, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 3.0}, "id": 150277792}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "My husband and I have recently returned from our 7th visit in 8yrs to the Bougainvillea.", "title": "Our favourite holiday destination", "helpfulness": 2, "user": "C_2014", "date": "January 22, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 150262959}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "One of the main reasons we return to this resort is the fantastic customer service and friendless of the staff. When we arrived we received a very warm welcome from the hotel manager and from then on throughout our stay all the staff remembered us and were so friendly and helpful. We were also given a room upgrade on arrival, which was much appreciated!", "title": "Great Holiday Stay", "helpfulness": 2, "user": "R K", "date": "January 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 3.0}, "id": 150139823}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "Some of the rooms had been reclassified since our last stay and this time we were allocated a junior suite with queen bed and lounge area (previously a deluxe studio). The rooms are always spotlessly clean (with daily maid service), good size, brightly decorated and a very well equipped kitchens for self catering needs. We had a fantastic view of the sea and main pool area.", "title": "Clean and cosy", "helpfulness": 6, "user": "zzatara", "date": "January 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 149700087}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "The hotel has three pools, two in the newer part of the hotel. One of the pools encloses the pool bar and is adult only. The other pool includes a smaller children's pool so something for everyone. The pool bar always has a good atmosphere and service. Happy hour is 3:30-4:30pm. There is another nice quieter pool in the older part of the hotel aswell.", "title": "our favourite place", "helpfulness": 7, "user": "Ann B", "date": "January 13, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 149599194}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "We just came back from Barbados, having stayed at the Bougainvilla Beach Resort. The place is so clean and well-kept. All staff were helpful, friendly and gracious. The suite was quiet and offered everything we could possibly need or want. We ate dinner on the resort several times, and all meals were excellent.", "title": "Fabulous!", "helpfulness": 1, "user": "Anne P", "date": "January 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 149590824}, {"rating": 3.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "We would come back again and again....", "title": "Overall okay hotel, nothing special, nothing particularly bad", "helpfulness": 3, "user": "bryanblaw", "date": "January 9, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 2.0}, "id": 149270396}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "The hotel experience was fine. Some minor problems with room, but overall okay. In general, the people who worked there were friendly, though the staff at the main restaurant were truly terrible (Latern), while the food wasn't good. Would avoid it if you can. The biggest disappointment has more to do with the location. Where it sits on the island means that it still gets a pretty strong current from the Atlantic with the ocean having a relatively strong current going West in addition to coming in. I would recommend finding something further north on the West cost.", "title": "We love this place!", "user": "CarolM392", "date": "January 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 149213064}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "Back for a second time. We brought our adult children back with us to experience Barbados at the Bougainvillea Resort. This is a great resort on a great beach. The rooms are fabulous and the staff are very nice. We had so many great times at the pool bar during happy hour. The BBQ buffet party is a must. Great food! They arranged surfing lessons for us and a great time was had by all. The beach was beautiful and clean every morning and set up with umbrellas and chairs. The Christmas show was so much fun, especially for all the young children who received gifts from the resort. We received Christmas gifts from the resort also. They just think of everything to make your vacation wonderful.", "title": "amazing anniversary", "helpfulness": 1, "user": "RG21166172", "date": "January 8, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 149201998}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "The resort is close to St Lawrence Gap and to Oistins where you must go on a Friday night. Also, go outside the resort at about 12 noon for street vendor food. The best food ever. We will definitely be back.", "title": "Excellent Family Resort in Beautiful Location", "helpfulness": 3, "user": "Andie H", "date": "January 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 149127862}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "We really enjoyed our 3-night stay at the Bougainvillea Hotel. Our 1-bedroom suite was clean and quiet, and the kitchen was well-equipped. The hotel amenities were excellent and the beach was beautiful. The waves were not too big and I didn't worry about any undertows. The hotel staff were quite helpful and service was prompt. They helped us rent a car for the day and when a vendor from the manager's cocktail party failed to deliver a bracelet i bought, the hotel manager refunded my money without any hassle. They handled it very well, I thought. We would definitely stay again in Bougainvillea when we have another chance to visit Barbados.", "title": "Very pleased with our stay", "user": "LizardBang", "date": "January 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 150868630}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "I stayed at Bougainvillea for 1 week starting with January 19th till January 26th. The location is great, as it is close to the airport and you can easily get from here wherever you want to get in Barbados - Lawrence Gap, Oistins, East Coast, West Coast, Bridgetown, you name it... The beach in front of the hotel is also nice. We had a junior suite, which had a fully equipped kitchen and overall was pretty large. The hotel, in general, and the room itself are not the most modern, if you know what I mean, so if you are looking for something modern and slick, this is not the place to choose. Also, for the price paid, the overall decor (furniture I mean) could be better... The place is relatively well maintained and the staff is extremely friendly. The restaurants on premises are ok, but I found them to be overpriced.", "title": "Great location, very friendly staff, somewhat old fashion", "helpfulness": 2, "user": "SabinaDC", "date": "January 27, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 150776942}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "Overall I had a good experience at Bougainvillea.", "title": "A Paradise Island and a Paradise Resort", "helpfulness": 4, "user": "LizziB2004", "date": "January 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 150762830}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "We stayed at the Bourganvillea resort in Oct 2012, my husband, myself and our 8 yr old daughter. From the moment we arrived we felt so welcome and fell in love with the resort. Our room was on the ground floor and was impeccably clean. We had our own breakfast area that over looked the pools and beautiful beach view.", "title": "Christmas Bougainvillea style!!", "helpfulness": 1, "user": "sandy66London", "date": "January 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 150751386}, {"rating": 5.0, "stay_parameters": "Stayed January 2013", "text": "The staff were so friendly and ever helpful, especially Roxanne and Sonia who looked after us throughout our stay. The food in The Lanterns Beach side restaurant was reasonably priced and breakfast and the Burger was gorgeous!!! Highly recommend! We always felt very safe and this was important to me, especially for my daughter, as she was able to wander around the resort from beach to pool on her own - within reason!", "title": "Wonderful honeymoon destination", "user": "Kittiekiller", "date": "January 27, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 150742029}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "Just got back from Barbados for our first time, wow great beaches and good weather, this small hotel is good for people wanting a central and small hotel, good for families and ok for couples as not too many families really go. Good facilities on site, nice Jr Suites (we got a free upgrade).", "title": "Great Central Location", "helpfulness": 4, "user": "ajmit1", "date": "November 22, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 145941436}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled with friends", "text": "Staff are generally great and really make you welcome however some of the restaurant staff are just on the edge of being rude.", "title": "Our 12th year at Bougainvillea", "helpfulness": 3, "user": "AngelawBarbados", "date": "November 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 145654502}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "Shame the waterside restaurant was not open and some building work was going on at the beach edge which was a little annoying.", "title": "Fantastic stay, great hotel and beach, would happily return", "helpfulness": 7, "user": "Lindsey120", "date": "November 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 145632227}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "The weekly entertainment was good but the lunchtime menu needs more choice.", "title": "Loved it, loved it, loved it!!!!", "helpfulness": 4, "user": "PrettyEastSussex", "date": "November 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 145443127}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "Apart from those niggles its a nice place.", "title": "Short stay, but made an impression", "helpfulness": 1, "user": "kalijinn", "date": "November 12, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 145199892}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "Traveled here in October with my family and we had a few issues upon arrival that were quickly rectified as mentioned by my mum on a review below.", "title": "Nice stay", "helpfulness": 3, "user": "Shonelle", "date": "November 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 145028971}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "The location is fantastic, right on the beach as well as a good base to get around to Bridgetown and to oistins. Transport is also great whether you want to use taxis or the buses.", "title": "Fabulous holiday", "helpfulness": 3, "user": "hillyone", "date": "November 9, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 145003163}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled with family", "text": "The only drawback during my stay was having the room cleaned after 2pm nearly everyday! It kind of disrupts your relaxing time if you're in the room and you have to move to get your room cleaned!", "title": "Beautiful Barbados", "helpfulness": 5, "user": "Patricia D", "date": "November 8, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 144943787}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "The staff and people of Barbados are extremely friendly and made my first trip to the country a great experience. I would definitely return to this hotel.", "title": "Revery Friendly Staff", "helpfulness": 4, "user": "gbelleville", "date": "November 6, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 144764551}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "We have just returned from a 2 weeks stay at the Bougainvillea Beach Resort from 22nd October to 5th November .On first impressions the room appeared to be a bit disappointing , the grouting in the shower was grubby and even though we were told that the room had been updated it still looked a bit tired but when we went onto our balcony we had a sea view which was fairly amazing especially at sunrise. We opted to go self catering and were pleased that we had a full sized cooker in the kitchenette area of our accomodation, microwave, kettle and a large fridge with a freezer compartment and various cooking utensils.", "title": "Really relaxing holiday", "helpfulness": 4, "user": "RobJackie55", "date": "November 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 144668282}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled solo", "text": "I spent a 3 day stay-cation at Bougainvillea and it was great. Great location, beautiful rooms with awesome views of ocean. Staff was helpful and genuinely friendly! Would definitely return and recommend it to friends!", "title": "Awesome staycation", "helpfulness": 2, "user": "Lici J", "date": "November 4, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 144481911}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "My Daughters and I were planning on spending the day at Bougainvella for their half term holiday and we decided to spend the night. We are from Barbados. This hotel is \"A HOME, AWAY FROM HOME\". Our Room was lovely,huge bedroom,kithcen and livng room with a lovely plonge pool that over looked the main pool and bar area with a view of the ocean. The girls and I had a fabulous time in the plonge pool, the main pool and of course the kids LOVED THE GAMES ROOMS!!! They have two games rooms for kids one for toddlers and one for older kids. Across the street is the petting area(Rabbitts and Turtles) and also has a lovely swing set and Trampoliene. The girls and I are very familiar with the hotel as My inlaws have time share and we spend alot of time at Bougainvillea.It is like a SECOND HOME!! From the Bell Boy, to the the staff at the pool Bar, Everyone is very polite,friendly and helpful. Bougainvillea is a BEAITIFUL HOTEL!!! You will definanltey enjoy it! THE BEST!!!!!", "title": "Half Term Holiday with my GIRLS!", "helpfulness": 1, "user": "Natasha W", "date": "October 31, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 144187013}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "My husband and I recently stayed at Bougainvillea for a couple of weeks of much needed relaxation. Our room was perfectly located with a beautiful picturesque view of the beachscape from our patio. This resort was rather isolated from the main road, but had planned events and entertainment throughout our stay as well as on-site restaurants and bars, although we did not always utilize them as we are native-born Barbadians andso usually met up with family and friends. The free wi-fi was also a plus. One small downside was the $10.50 per half hour we had to pay to print our airline boarding passes in the business center, which is a complimentary amenity at hotels here in the U.S. We would definitely stay here again.", "title": "Great Resort, located on the beach", "helpfulness": 2, "user": "Annette C", "date": "October 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 144113506}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled solo", "text": "I have free accomodations at a very large fully equiped home two miles from this resort, but frequently choose to stay here instead. In my three trips this year [total of 14 days], not once was I disturbed by any noise either in the evening or morning. I wouldn't recommend this for any singles looking for a party place, but if you want a great beach and some peace and quiet it's great. And as per the other reviews the pool bar as with the rest of the hotel, has great staff. The only fault I found was with the laundry room. Don't try and to laundry on a Sunday unless you have lots of time and your own soap. They don't have a soap dispenser or soap on the premises. [But you can empty the soap dispenser in the shower if you need to] ;-] Mangement?", "title": "Three stays in 8 months", "helpfulness": 1, "user": "solocanucktraveler", "date": "October 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 143809297}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "Great place for a family with young kids or couples.", "title": "Special visit, great beach", "helpfulness": 4, "user": "31Anniversary", "date": "October 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 143734679}], "location": {"country": "Caribbean"}, "stars": 4, "variance": {"poor": 22, "average": 78, "very good": 392, "terrible": 16, "excellent": 659}, "aka": "Bougainvillea Beach Hotel Christ Church", "slim_ranking": 0.130434782609, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "Bougainvillea is the one that offers it all. Edged by two beautiful beaches, the resort, well known for its personal-touch and service, has 138 spacious suites which are just footsteps from the sand. Mediterranean style architecture surrounded by tropical gardens and the namesake Bougainvillea flowers create a tranquil setting, yet the location is merely minutes from south coast hotspots, making it an ideal base for exploring Barbados. Recommended for couples or families, the roomy suites all have ocean-facing balconies with breathtaking views and conveniences including kitchens, free Wi-Fi, IPAD/IPOD docking stations and flat screen TVs. Junior suites, one and two bedrooms have dining/living areas with sofa bed. As a full service leisure resort, Bougainvillea has three swimming pools, a swim-up bar with daily happy hour, two beachfront restaurants, well-equipped fitness centre, luxurious Spa services, watersports, tennis court, Kids Club, Teen games room and outdoor play park. Entertainment is also offered several nights per week. Bougainvillea is a green hotel and has been awarded the Travelife GOLD award and the EarthCheck PLATINUM award for its commitment to the environment."}