{"user_rating": 4.5, "review_count": 471, "name": "Boutique Hotel View", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled with friends", "text": "A wonderful hotel, perfectly situated close to the centre but tucked away from the noise. A beautiful hotel with lots of character, friendly staff, lovely clean rooms, and excellent breakfasts! The pancakes are recommended, they set you up for the day! Whats more, they have a lovely small dog and two wonderful kittens which we were allowed to play with. Cant wait to book another trip to Amsterdam!", "title": "A brilliant hotel in Amsterdam", "helpfulness": 1, "user": "Amanda W", "date": "March 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 126675654}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "The staff were great! Breakfast was very good. The rooms are small, but clean. We are a family of five and needed two rooms. Both rooms were small, but had nice views and the window opened. The beds were comfortable and the washrooms were updated. The staff were very friendly and helpful with recommendations, printing boarding passes, and helping with luggage.", "title": "excellent location, friendly staff", "helpfulness": 5, "user": "CMKMJ", "date": "March 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 126609338}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "The Boutique Hotel View is a lovely little place overlooking a canal just far enough away from the hub-bub of the square, and close enough to be a short walk away from everything you want in Amsterdam. The place is clean, warm, friendly and they make you a wonderful Dutch breakfast with the best pancake I have ever had! (One will last you through most of the day.) They have two adorable house kitties who guard the stairs and a house doggie named Snowy. Don't be surprised if you get a visit from one of the kitties who will come into your room, stay a while to be petted and look through your things, and then politely go to the door and wait to be let out. Beds were incredibly comfortable and the atmosphere was homey and friendly. Wouldn't think twice about where we stay next time we are lucky enough to venture to Amsterdam.", "title": "Beautiful Little Jewel of a Hotel", "user": "Randi M", "date": "March 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 126544199}, {"rating": 5.0, "stay_parameters": "Stayed February 2012", "text": "My partner and I stayed at the hotel for 4 nights in February. This was the first stop of our 3week trip and we weren't disappointed. I did a lot of research in booking our accommodation and reading the reviews of this place I had high expectations.", "title": "Boutique - friendly service and CLEAN", "helpfulness": 1, "user": "AAfemaletravellerAUS", "date": "March 17, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 126249013}, {"rating": 5.0, "stay_parameters": "Stayed March 2012", "text": "We met Natalie when we arrived she was really friendly and accommodating. I did warn my partner that I booked the top floor and their would be lots of steps and being Amsterdam the we're narrow and steep. It might seem daughting but at the boutique they were only to happy to help us lifting out luggage. It was amazing how Natalie seemed to lift our luggage above her head with ease(although she did tell us she was a roadie for many years). So as long as you ok walking up and down stair their shouldn't be an issue.", "title": "Can't wait to go back", "helpfulness": 2, "user": "Smallks73", "date": "March 12, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 126006129}, {"rating": 1.0, "stay_parameters": "Stayed April 2012, traveled with friends", "text": "Be very careful, we went to this hotel as part of a large group, I was supposed to be staying in a deluxe triple room at a cost of 652EUR for 3 nights, which I considered to be quite a lot for a 2/3 star hotel. We arrived at the hotel and were taken to a room in the adjacent Boutique hotel view Bed and Breakfast which meant that we only had 1 large key between 3 men, not great as we all wanted to come and go at different times. When we got to the room I can only say that it was not a triple, it would have been a nice double but once the 3 beds were made up there was virtually zero floor space. We then saw another of the rooms that some of the rest of our group were staying in and were amazed that we were being charged the same price for a far inferior room. Our room was not a deluxe triple but that is what they charged for, I know this as on their website it says all deluxe rooms have a safe, ours did not. We requested a room like the one our friends had and was met with \"sorry there are no more rooms\". When we got into the room it was made up with one double bed, we decided to move the beds and unfortunately broke a bedside lamp whilst doing this (this wouldn't have happened if the room was set up as we had requested). When I went to reception to tell them of the accident it seems they thought that this was another way to make more money off us and proceeded to charge me 150 eur for a new lamp (it was supposedly an antique), I found this hard to take as the other pair to this lamp already had a broken top and I couldn't understand why you would have 300EUR of bedside lamps in a 2/3 star hotel. In the end I just paid the money and moved on but I would advise people against staying here as if they can they will try and rip you off.", "title": "Be careful here", "helpfulness": 8, "user": "Ianbeej", "date": "April 27, 2012", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 1.0, "sleep": 3.0, "rooms": 1.0, "location": 4.0}, "id": 128771221}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled solo", "text": "This hotel is a must to stay in - friendly reception on arrival, helpful for information. Homely setting for breakfast with relaxed atmosphere for eating. Room was great, comfy bed and clean and well tended. Stayed 4 nights and well situated to plenty of eateries and trams and canal boats. Decor of room was neutral and not overpowering - well appointed. Thought the two cats and the dog were great and very friendly but not a nuisance. Breakfast was 0800-1100 hours and nothing was any trouble - pancakes are a must have!!! Definitely would book into this hotel again if I return to Amsterdam. Top marks to the owner and the staff - well done and keep up the good work as I thoroughly enjoyed my time in Amsterdam and to have somewhere friendly to return to at the end of the day was most encouraging.", "title": "Friendly, homely and great atmosphere", "user": "LMK53", "date": "April 26, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 128653604}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "We enjoyed staying 3 nights at this cozy and family-run hotel. Our room was beautifully decorated and very big with a lovely view to the canal. The owner was very helpful especially by climbing 2 flights of stairs (very narrow) to take our luggage to the room (there's no elevator).", "title": "Stylish decor, friendly owners and well located.", "helpfulness": 1, "user": "Tulipinha81", "date": "April 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 128195531}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "The hotel smelled pancakes! Unfortunately we didn't try its breakfast.", "title": "Clean and tidy room, friendly service, lovely breakfast and cute cats!", "helpfulness": 1, "user": "AlexandraH1985", "date": "April 17, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 128057747}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "Liked the hotel's location which is close to the museums and restos, the friendly service, and the selection of English-speaking tv channel options that are not available at many hotels.", "title": "Cosy and in town", "user": "S F", "date": "April 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127906320}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "We found the Hotel Boutique View after hours of searching for a reasonably priced hotel in Amsterdam. We stayed for 2 days in the 1st floor luxury suite which had a beautiful view of one of the canals for a bargain price and would recommend it.", "title": "Gem of a hotel for a wonderful price", "user": "southerntlc", "date": "July 6, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 34074087}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with friends", "text": "I travelled with a group of ladies and stayed for one night at this hotel. We choose this location as we didn't want to be too far out of the night life and we didn't want to be wandering around a city which was unknown to us at night. We arrived early and took our suitcases straight to the hotel and these were immediately put in a room for us. The welcome was very friendly (considering we arrived when breakfast was being served and the staff were very busy). I had a canal view on the top floor, the room was spotless, this is by far the best 2 star hotel I have ever stayed in and I really don't understand why the rating isn't higher. The location is brilliant and it is as the website says a 2 minute walk from the bus stop. The staff are very friendly and couldn't do enough for us - it really is a lovely place to stay. One of our party was slightly the worse for wear the next day and a room was offered to her for the day (free of charge) not many place (if any) would offer that. Considering it is so close to Leidspleine it is very quiet around this neighbour hood and is in a lovely setting of the canal. Breakfast was plentiful and very tasty, the pancakes are a must if you stay here. I have already tried to re-book this hotel for later in the year but unfortunately it is book. My advice would be book early and stay as long as you can", "title": "Excellent", "helpfulness": 1, "user": "S.S.S.M.L.A", "date": "May 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 130319330}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "Although we did not stay in this hotel, my husband and I were lucky enough to be given great help by a very kind lady on reception in this hotel called Dragana after we had checked out of the terrible Hotel de Paris. Although the Boutique Hotel View itself was booked out, Dragana let us use the hotels internet facilities and made a lot of calls for us to help us find alternative accommodation. She did not have to help us but we really appreciated it, and she did help us find an alternative place to stay.", "title": "Will be back!", "user": "catmarie", "date": "May 18, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0}, "id": 130166644}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "The Boutique Hotel View looks like a modern clean hotel, and there were many happy guests to be seen there. We would definitely recommend it!!", "title": "Highly Recommend this hotel!", "helpfulness": 1, "user": "Ang S", "date": "May 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130136297}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled solo", "text": "We stayed at the Boutique Hotel View Hotel in early April 2012 and it was a wonderful experience. The room we stayed in had a beautiful view of the canal and the staff were so friendly and outgoing. The location was great and the breakfast was perfect. A little gem in Amsterdam.", "title": "Wonderful hotel - will definitely stay here again!", "helpfulness": 1, "user": "MoniqueBeatty", "date": "May 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 129725707}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "I stayed at Boutique Hotel View for four nights in early May. The location was great - less than five minute walk from tram and bus stops. Centrally located but on a quiet, canal-side street. Natalie and the rest of the staff were so friendly and helpful, and they made delicious pancakes and omelets for breakfast!", "title": "The perfect stay!", "helpfulness": 1, "user": "voyage42", "date": "May 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 129279988}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "We picked the Hotel View via Tripadvisor for an overnight stop in Amsterdam. We had a great time. The hotel was clean and recently refurbished. We were offered a free upgrade to a larger room at the top of the hotel. It was tucked under the eaves, with quirky and interesting spaces, modern ensuite bathroom and an excellent canal view. The staff were welcoming and helpful. Their restaurant suggestion was exactly what we wanted. Breakfast was good enough to make my wife, a breakfast connoisseur, very happy indeed,", "title": "Wonderful hotel", "user": "dg74", "date": "November 7, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 48682030}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "Me and my girlfriend had a nice stay at this hotel. In general we were very satisfied with our stay. The room we had was very small but we did not stay there a lot so it was not a problem for us. The breakfast was fine and the location is great right next to the Leidseplein. The hotel is generally very clean although we found it a bit unappetizing that the hotel's two kitttens were playing around in the breakfast area and sometimes on the plates.", "title": "Nice and clean hotel", "user": "TheGold", "date": "October 16, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 47011970}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "This is still a new hotel and it was a great stay. Rooms are very nice with canal views in the front. The staff were brilliant, really helpful and friendly. Perfect location for centre, bars and food. Well worth it", "title": "Great stay", "user": "Georgie83", "date": "September 28, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 45238283}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "My partner and myself have just returned from a Bank Holiday trip to Amsterdam. Whilst not wanting to be too far away from nightlife, restaurants and travel routes we were struggling to find somewhere that had all this but was fairly quiet, away from stag/hen parties and just not so 'in your face' as the area around Dam Square and also value for money with breakfast included, didn't want much did we!!!. I had trawled the internet for around 3 days trying to find somewhere when by accident I came across this hotel. We were very pleasantly surprised, a bus goes straight from Schipol Airport to the top of road the hotel is in, 5 minutes walk and you're there, it's right on the canal and we got a free upgrade to a canal view room, the double room we had was small but it had en-suite was very well decorated, very clean and the bed looked straight over the canal, beautiful to wake up to. It's right on the major tram routes and only 10 minutes to Dam Square. There were plenty of bars, restaurants and shops 5 mins walk away around the Leidersplein. And last but not least the young man who checked us in couldn't have been more helpful and recommended a great night club for our first night out!! We would definately go back.", "title": "Fantastic Hotel, Great Location, Friendly People", "helpfulness": 1, "user": "Dancinbird_9", "date": "September 2, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 39551471}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled with friends", "text": "My friend and I traveled all over Europe and had originally booked a hostel in Amsterdam. We were not fond of it when we got there so we only stayed one night and then found this beautiful hotel. We had a beautiful room with two huge windows on the first floor looking out onto a canal. The view was to die for. The stairs are really steep and we needed to have guys from the hotel bring our luggage up, but they had no problems with it and were very accommodating.", "title": "Great stay in Amsterdam", "user": "DRBKLYN", "date": "July 23, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 35588452}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled with friends", "text": "We stayed at this little gem of a hotel for 3 nights. Natalie was so welcoming and friendly as was her brother who cooked us eggs for breakfast every morning, and was so helpful! i would highly recommend this hotel to anyone great location, trendy, clean ,good breakfast, lots of nice places to eat just round the corner. The only down side would be that two of our group were on the top floor and collapsed on the bed exhausted when they got there, but it did make us laugh. The staff carried our bags to our rooms as the stairs are quite an effort, but so worth it. Definitely would stay here again.", "title": "BOUTIQUE VIEW", "helpfulness": 1, "user": "MOSIE40", "date": "March 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 125743831}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled with friends", "text": "I have just returned from a 2 night stay at this hotel and i must say how delighted i was with it. After a very easy flight from Luton with Easyjet we made our way to the hotel alot earlier than the check in time - they were happy to watch our bags for us while we went off and did some exploring.", "title": "A little gem!", "helpfulness": 1, "user": "HONEYPOTS10", "date": "March 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 125435832}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "We had 2 rooms in our party - one was a small double with canal view the other was a small double with no view. I must say the rooms are very similar - the canal views are slightly larger but as we werent in the hotel that much it didnt really matter to us. The hotel was super clean and so close to local amenities that getting around was easy. The staff were exceptionally helpful and friendly and oh my goodness the most comfortable bed i have ever slept in! The stairs are a little steep but we came to discover that this is the case everywhere in amsterdam and the gentleman on reception was more than happy to carry the case up the three flights of stairs for us.", "title": "now know exactly why the hotel consistently scores 5/5!", "helpfulness": 3, "user": "PK85", "date": "February 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 125309128}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled with friends", "text": "I would 100% return to this hotel - although it is only classed as a 2 * i have stayed in 5* hotels that are not as nice as this. Beautiful. Thank you for having us.", "title": "Will be back", "helpfulness": 1, "user": "Traveler S", "date": "February 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 125113789}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "stayed here for three nights with my girlfriend in february. i've always stayed in the leidseplein area as it is in my opinion the best spot, so the hotel's location was always going to be ideal.", "title": "Good location", "helpfulness": 1, "user": "MarieKehoe", "date": "February 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 125034145}], "location": {"country": "The Netherlands", "continent": "Europe", "city": "Amsterdam"}, "stars": 2, "variance": {"poor": 15, "average": 29, "very good": 122, "terrible": 6, "excellent": 299}, "slim_ranking": 0.0852941176471, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.0, "location": 5.0}, "description": "The Boutique Hotel View is a boutique hotel with contemporary styling that is wonderfully nestled within an historic Amsterdam canal house. From the hotel you have a stunning view of the beautiful canals of Amsterdam. The Boutique Hotel View is designed around our guests. It is in the cultural heart of the city, on the Leidsekade."}