{"user_rating": 2.0, "review_count": 161, "name": "Bradford Inn & Suites", "reviews": [{"rating": 3.0, "title": "Poor Handicap Parking", "text": "We go there yearly for a family reunion in Plymouth. My mother loved being there on the water. She had health concerns (hip replacement - lung problems - visual etc). There was only one handicap parking spot for the whole hotel and it wasn't even adjacent to the hotel. They have improved a little now. I think they had two spots last year. WOW whoopity doo. If you don't come in for the night at 5pm - don't get them! Tough Luck. One summer I called ahead and asked to try and reserve a handicap parking spot for her. They said yes on the phone but when we got there - they said no. It would have been so easy for them to have put an extra Handicap Sign on a Spot for patrons. THEY DON'T CARE. We returned for sentimental reasons. Now that my mother has passed away handicap parking is no longer an issue for me.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "August 18, 2004", "id": 2458598}, {"rating": 5.0, "title": "The Governor would be proud!!", "text": "We love the view - we have a nice weekend but nice ? Not the owners or the management of the Gov. Bradford. RMB.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "August 4, 2004", "id": 2381685}, {"rating": 2.0, "title": "Neutral on accomodations, but location was excellent", "text": "I just got home from one of the BEST vacations I have ever had. I spent 4 nights at the Governor Bradford Inn, I have to say that NEVER have I been treated with such friendliness.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "July 28, 2004", "id": 2329103}, {"rating": 3.0, "title": "Good value, great location- NO LATE NIGHT FOOD IN TOWN", "text": "The location is beautiful!!! The staff wonderfull, and the breakfast (complimentary) delicious!!", "helpfulness": 4, "user": "ButimeTraveler", "date": "July 19, 2004", "id": 2306609}, {"rating": 1.0, "title": "Don't count on your guaranteed reservation", "text": "Housekeeping did a wonderful job with our room, and when I went down to the desk to ask for information, I was pleasently suprised that the General Manager herself took the time to sit with me and explain all the areas attractions!!!!", "helpfulness": 7, "user": "A TripAdvisor user", "date": "June 30, 2004", "id": 2230916}, {"rating": 1.0, "stay_parameters": "Stayed June 2006, traveled as a couple", "text": "We chose to stay at the Governor Bradford because of its location, which is perfect.", "title": "Great location, but . . .", "helpfulness": 1, "user": "Jennidcap", "date": "August 10, 2006", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "location": 5.0}, "id": 5594413}, {"rating": 3.0, "stay_parameters": "Stayed July 2006", "text": "Unfortunately nothing about the motel matches up to this fundamental and it is overpriced considering the quality (or lack of it) provided.", "title": "Perfect location, needs updates", "helpfulness": 1, "user": "bird2967", "date": "August 8, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 2.0, "value": 3.0, "rooms": 2.0, "location": 5.0}, "id": 5577633, "likes": {"liked": "— Location", "disliked": "— Dated / Needs TLC"}}, {"rating": 1.0, "title": "A disgusting hotel property...", "text": "As others have written, the rooms are in a very poor state of repair and well overdue for refurbishment. Cleanliness is questionable and the plumbing leaves much to be desired.", "helpfulness": 1, "user": "goldenpineapple", "date": "July 29, 2006", "id": 5525027}, {"rating": 2.0, "title": "Excellent location but needs a little .", "text": "The included breakfast is an insult - a couple of varieties of pastry and a cup of coffee with powdered milk are available to carry back to your room, by which time the coffee's cold.", "helpfulness": 1, "user": "LucyMassachusetts", "date": "May 31, 2006", "id": 5287650}, {"rating": 4.0, "stay_parameters": "Stayed May 2006", "text": "Thankfully we were only staying for one night.", "title": "Very clean, great value", "user": "mbartel", "date": "May 23, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 3.0}, "id": 5205234}, {"rating": 3.0, "title": "Great Stay", "text": "My wife and I just got back from Plymouth. We enjoyed the Governor Bradford. We were close to everything and the staff was more than helpful in directing us to things to do in the area. We will be going back.", "helpfulness": 12, "user": "A TripAdvisor user", "date": "April 30, 2004", "id": 1850563}, {"rating": 2.0, "title": "Bad 'rep'", "text": "I have recently stayed at Bradford Inn, and in all fairness I must agree that the rooms do need to be updated, but I have stayed there on several occasions (I have family in the area) and NEVER has my room not been immaculately clean! What they lack in ammentities they more than make up for in friendliness and great rates! I also am aware that they are currently under new ownership and management and some exciting new changes are developing.", "helpfulness": 10, "user": "A TripAdvisor user", "date": "January 26, 2004", "id": 1614522}, {"rating": 2.0, "title": "Couldn't wait to leave", "text": "I had business in Plymouth and stayed one night at the Governor Bradford. The location and the place seemed nice from the limited information on their website. In the end, only the location was nice.", "helpfulness": 15, "user": "A TripAdvisor user", "date": "July 23, 2003", "id": 1143600}, {"rating": 1.0, "title": "Cancelled second night", "text": "The motel is in desperate need of being refurbished. The room smelled musty, the pillowcases were dirty (luckily I found one pillow that was clean), and the place felt about as comfortable as an institution. It wasn't dirty, however, so if the price is right and you're not looking for a cozy hotel, this could be the place for you. I know there's a pool there but I didn't pass it so can't say what its condition was.", "helpfulness": 11, "user": "Linda K", "date": "June 29, 2003", "id": 1118622}, {"rating": 4.0, "stay_parameters": "Stayed May 2006", "text": "My daughter and I stayed at this hotel the first week of May for 1 night as a get away. This hotel is older, but the rooms were very clean and set up really well. They include a small refrigerator and even a dressing area outside the bathroom with a curtain. This is great for early birds who want to shower/make coffee, etc. but not wake the other person. We originally reserved a room without a view, but when we arrived we couldn't resist. The view is outstanding! You look to the right and see the Mayflower and look to the left to see the fishing boats and excursion boats. The staff was very friendly and welcoming both when we arrived and when we checked out. They offered suggestions of places to visit and eat. The rate of $76.50 for no view then went to $114 for a direct view. It was worth every penny. A continental breakfast is offered from early a.m. to at least 11. We checked in around noon and they still had hot coffee and breakfast treats they offered us upon arrival.", "title": "Great View and a Great Location too.", "helpfulness": 1, "user": "pahhobbs", "date": "May 9, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "service": 5.0}, "id": 5044418}, {"rating": 4.0, "title": "Great location", "text": "The entire area was a lot of fun. There are shops and restaurants everywhere. The Mayflower, Plymouth Rock and the Pier are all a short walking distance from this hotel. This is the only hotel I saw directly on the waterfront. There are inns and B&B's on the water.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "July 27, 2005", "id": 3703617}, {"rating": 3.0, "title": "The Governor was great", "text": "I would recommend giving this hotel a try if you're planning to stay in the area. The pool is rather small but also right on the water. There's a refreshment stand right inside the pool area with the friendliest man you've ever met. He knew everyone and everything about the area. It wasn't noisy at night being right on a main road. Keep in mind this isn't a 4 star hotel. It is very comfortable and within walking distance to everything.", "helpfulness": 3, "user": "KingstonMama", "date": "June 14, 2005", "id": 3554940}, {"rating": 4.0, "title": "Great Value", "text": "My family and I just returned from a four night stay and we had a blast.", "helpfulness": 7, "user": "Vt_folks", "date": "May 27, 2005", "id": 3504144}, {"rating": 4.0, "title": "Enjoyed our stay", "text": "The staff was always helpful and friendly.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "March 17, 2005", "id": 3282771}], "location": {"country": "United States", "city": "Plymouth"}, "stars": 2, "variance": {"poor": 28, "average": 30, "very good": 23, "terrible": 71, "excellent": 9}, "aka": "Bradford Hotel Plymouth", "slim_ranking": 0.894736842105, "description": "Bradford Inn & Suites is set on Historic Plymouth Harbor, surrounded by breathtaking views looking across the waters, over the Mayflower II and Plymouth Beach. Selected the Best of Cape Cod and Islands in 2008, The Inn is located within walking distance to restaurants, downtown shopping and many of Plymouth's historical museums and monuments. Although we are one of the oldest inns in Plymouth, we have recently gone through the first phase of our major renovations; including a new lobby, breakfast area and remodeling of guest rooms and suites."}