{"user_rating": 4.5, "review_count": 339, "name": "Brentwood Bay Resort & Spa", "reviews": [{"rating": 5.0, "title": "A perfect experience", "text": "my hubby took me to brentwood bay lodge for our one year wedding anniversary. this place is breathtaking. the landscape, the decor, the service, all were exceptional. the whole experience was so luxurious. we felt very pampered, and now that we're home, we want to decorate our home just like the hotel!! the rooms were so sexy! not snobby at all. the food in the arbutus restaurant was eye candy to look at, and tasted even better. breakfast in the cafe was the best we had ever had. i recommend the hazelnut crusted french toast with cinnimon marscapone cheese. oh my goodness. luxuriously delicious. even the breakfast sausage was well above average! take the water shuttle to the buchart gardens; a great, peaceful, and scenic way to get there!! try to go in the morning to the gardens; it gets VERY crowded in the afternoon!! we got the couples massage in the spa, and we were in heaven!!! afterwards, they served us wine and truffles. we also took the celebration cruise offered by the hotel. a 2 hour cruise with cheese and wine. we saw harbor seals, eagles, and the captiain took us to remote tranquil areas where there was not another singel soul. we couldn't have asked for more. definitly the best, most wonderful and relaxing trip, and worth every penny!! **OH, and when you're in the room, remember to place the \"privacy please\" door hanger on the door. the staff comes by very often to offer water/tea, turn down servie, etc. once time, a service woman just came right on in (around 8:00pm) and almost saw my hubby's booty!!", "user": "A TripAdvisor user", "date": "May 29, 2006", "id": 5231735}, {"rating": 2.0, "title": "Horrible service in cafe", "text": "We had a family gathering here for Mother's Day. After settling into a table in the pub, we were told that we would have to leave because our 8 year old granddaughter was with us. We understood and the staff were very polite. They told us we could go to the cafe.", "user": "mario7769", "date": "May 23, 2006", "id": 5203734}, {"rating": 5.0, "title": "WONDERFUL EXPERIENCE", "text": "After dragging chairs around ourselves and borrowing them from the other patio table, we sat down. It took about 15 minutes before we even saw a waitress. Another 10 for coffee. Finally got menus. Over 20 minutes for a second coffee and even then we had to go inside and ask for it. Took about 50 minutes for food to arrive. Another 5 for cutlery.To say the food was mediocre is a complement.", "user": "Jeanij", "date": "April 7, 2006", "id": 4949887}, {"rating": 5.0, "title": "Reinvigorate the soul (and the sex life:)", "text": "I sent an email to the hotel describing the service and to date have had no response. So thought I would write something here so at least I know my comments will be noted and hopefully improvements will be made. Will say the premises are gorgeous.", "user": "A TripAdvisor user", "date": "November 22, 2005", "id": 4137854}, {"rating": 5.0, "title": "Just do it!", "text": "This was a wonderful hotel. The staff was as friendly, helpful and hospitable as they could be. This was my favorite hotel room I have ever stayed in. I loved the decor, how the jacuzzi tub opened to the bedroom with a row of candles, the slight Oriental feel of the room was relaxing. It was peaceful sitting on the balcony overlooking the bay and swimming pool. I wish it was closer to home so I could go there again and again. They did everything right. Jeani Redwood City, CA", "user": "A TripAdvisor user", "date": "November 11, 2005", "id": 4106814}, {"rating": 5.0, "title": "Great Lodge!", "text": "Stayed at Brentwood Bay Lodge for 3 nights and loved the place. Rooms are some of the most comfortable and stylish we've ever stayed in. Fireplace was romantic and useful - even in July! Great service from all staff encountered. Comfortable bed, wireless internet access, large hot tub, candles throughout, good wine, good food, relaxing view - what a place...", "user": "rcmjr", "date": "July 20, 2006", "id": 5492300}, {"rating": 5.0, "title": "Romantic and stylish", "text": "Location is removed from Victoria and remote from most island attractions, so a car is useful. There is a local ferry landing near by, but we were never distrubed by car or boat noise. Not sure the deluxe rooms are worth the upgrade, but they are slightly larger.", "user": "yorks_nameless", "date": "July 9, 2006", "id": 5442414}, {"rating": 5.0, "title": "5 Stars!", "text": "If you're looking for a relaxing get away with your significant other, this would be a great choice!", "user": "adventuregrrl", "date": "July 8, 2006", "id": 5440229}, {"rating": 4.0, "title": "Very nice but a bit disappointed", "text": "We stayed at Brentwood Bay Spa & Lodge in June 2006 and were absolutely delighted with the place. Our room was huge and decorated to a very high standard with nice features such as fresh flowers, full size windows with a private balcony overlooking the bay. The bathroom was fantastic, it came with a jacuzzi bath, separate shower and toilet. Overall, the room was well set up for romance so would be great for honeymooners. The hotel was also beautifully presented and we ate in the bar area one evening and enjoyed the meal. The staff were all very pleasant and helpful.", "user": "ShutterGo", "date": "July 7, 2006", "id": 5438034}, {"rating": 5.0, "title": "Wonderful Spa experience", "text": "The hotel looks a little like a motel from the parking area but don't let this put you off and it is in a residential area but once inside, the atmosphere is so tranquill that these sort of things are soon forgotten. We only stayed at Brentwood Bay for one night and really wish we had booked in for longer, we would definitely like to go back one day!", "user": "A TripAdvisor user", "date": "June 22, 2006", "id": 5373347}, {"rating": 5.0, "title": "Must-stay", "text": "We stayed here as part of our honeymoon and it was AMAZING. The rooms are gorgeous. The architecture is relaxing. The extras are superb. The food was to die for. The scenery was breathtaking. I wish I could stay forever. If this is an option for you, don't look any further!", "user": "A TripAdvisor user", "date": "October 12, 2005", "id": 4018341}, {"rating": 5.0, "title": "Great value and beautiful setting", "text": "We loved this hotel and thought that the setting was beautiful. Just big enough to be anonymous if you wanted to but small enough to add very personal touches. Food was great and the service was good. Rooms were modern and tastefully decorated. Will definitely go back!", "user": "evnycgal", "date": "September 19, 2005", "id": 3916030}], "location": {}, "stars": 4.5, "variance": {"poor": 8, "average": 9, "very good": 62, "terrible": 8, "excellent": 252}, "aka": "Brentwood Bay Resort And Spa", "slim_ranking": 0.25, "detail_rating": {"service": 4.5, "cleanliness": 5.0, "value": 4.5, "sleep": 5.0, "rooms": 5.0, "location": 4.5}, "description": "Located on pristine Brentwood Bay, in the heart of Victoria's wine country, minutes from Butchart Gardens and with easy access to Downtown Victoria and the Airport, this boutique hotel is a 5-star luxury resort with contemporary west coast flair. Each elegant Ocean Suite features king beds, spa-like bathrooms, romantic fireplaces and stunning ocean views. Simple, intimate and relaxing… indulge in a true state of bliss at Vancouver Island’s finest spa & culinary resort destination. We’re not a million miles away, it just feels like it!"}