{"user_rating": 4.5, "review_count": 62, "name": "Brera Apartments", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "We recently stayed four nights in this apartment and it really made our trip great. The location is very convenient with about a 5-10 min walk to two different metro lines. From the apt you can walk about 20 min or less and be standing in front of the Duomo. It is very well located to a number of nice restaurants and two small supermarkets. The apartment itself was very clean with more than enough room for you to spread out and relax. It has a small fridge and even a washer if you've been on a long trip or packed lightly. During our stay they even cleaned the unit and changed the linens one day which I was not expecting. It does require a bit of coordination with the company but the apt. representative was waiting for us at the unit when our cab arrived. You cant beat the location, price and comfort in the center of Milan.", "title": "Far better than a hotel", "user": "badwaiter", "date": "October 10, 2012", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "location": 5.0, "value": 5.0, "rooms": 5.0}, "id": 142445369}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "We stayed in the Garibaldi Apartment, which is in a quiet street off the Corso Garibaldi which is a great shopping and eating street, really close to all the places you want to go in Milan. We went on a number of tours with Zani Viaggi and this apartment was in walking dstance of the Foro Bonaparte where Zani Viaggi is located.", "title": "Great Garibaldi", "helpfulness": 3, "user": "westernsydney", "date": "September 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 141555208}, {"rating": 5.0, "title": "The perfect apartment for a weekend in Milan", "text": "The apartment had a loft bedroom which was charming, but the spiral staircase would be an issue if you had difficulty with stairs. There was a fully equipped kitchen and a washing machine (we dried the clothes on the spiral staircase railings for which there were helpfully provided pegs!). The apartment was bright and modern with an air conditioner in the living room and one in the loft bedroom, we were there in summer and very much appreciated these. There is an elevator from the ground floor to the apartment.", "user": "Zoe_Ipswich", "date": "September 20, 2012", "id": 140780335}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "We arrived in Milan early in the day and could leave our bags in the office, which is some way from the apartment. The staff were very friendly and took our bags to the apartment for us. They also walked with us and explained all the workings of the apartment. Just around the corner in Corso Garibaldi was a great restaurant \"Tastari\" which we would very much recommend.", "title": "Apartment for the price of a hotel room!", "user": "averybear", "date": "September 16, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 140448567}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "We loved Brera apartments. If you are staying in Milan we would highly recommend it. What better than to stay in a local neighbourhood with great living space just a few stops on the metro from the city centre. The staff are brilliant and very helpful, showing us around when we got there, providing a city map, giving us tips and a tour of the apartment. The kitchen facilities are great - loved the nespresso machine in the morning as we made coffee and popped to a local bakery for pastries. It really is a home from home and very stylish. Wi-fi is a must for us and the wi-fi was brilliant - never had a problem and very fast connection. It was a shame we only stayed the one night - we would come back again and stay longer!", "title": "more than fantastic!", "user": "Leo638", "date": "August 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 138113416}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "Good central location, within walking distance from Duomo, Pinacoteca di Brear and other sights. Metro station 5 minute walk, supermarket around the corner.", "title": "Nice, tidy, excellent location", "helpfulness": 1, "user": "Brank0", "date": "August 24, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 4.0, "service": 4.0}, "id": 117163106}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "The apartment was brand new, clean, well equipped.", "title": "Absolutely terrific - beautiful apartment, and lovely staff", "helpfulness": 1, "user": "CantankerousDrB", "date": "July 7, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 115134001}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "We stayed here for the last 2 nights of our honeymoon. They had laid on a bottle of prosecco for us - which was a lovely touch.", "title": "Nice renovated apartment", "user": "Gat16", "date": "June 18, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 4.0, "service": 4.0}, "id": 114153079}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "The apartment was so tastefully decorated with a white colour scheme, with designer lights and furniture - we felt comfortable and immediately at home.", "title": "Stylish accommodation at an excellent price for a city centre", "user": "Europeanculturelover", "date": "February 4, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 55168501}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "It's a short walk (15 mins) from here to the duomo, and is above a terrific Sicilian restaurant.", "title": "Great place!", "helpfulness": 1, "user": "PvanDam", "date": "January 4, 2010", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 52585842}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "I have to commend the location. This was the first time my girlfriend and I had been to Milan and like many we presumed the heart of the city (Duemo etc.) would be where to stay. Wrong, the area of Brera is perfect. It's a little 'bo'ho' but you have plenty of nice bars, restaurantsand cafes near by and it's so peaceful.There's a park not far behind it and you're only 10 minutes walk from the hub of Milan.", "title": "Amazing location and home from home", "helpfulness": 1, "user": "mr_p_rayment", "date": "December 8, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121518221}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "So room was spot on too. Entertainment wise the TV came with a wide selection of Sky channels and free WIFI (why more hotels don't do this I find rude). There was also an iPod dock and radio which we didn't use. The kitchen was well stocked and the handle Nespresso coffee maker was a nice addition.", "title": "recent weekend break to milan - brera apartments were great", "user": "Jeffrey S", "date": "November 27, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 121083898}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "We stayed in the room on the picture and it is 100% accurate. The bedroom area upstairs is a nice hideaway although if you're a bit big you may find the narrow stairs a bit of an issue. Also, since the roof stoops towards where the pillows are you may want to move them to the foot of the bed to prevent bashing your head.", "title": "Good apartment", "user": "jolin_poon", "date": "November 1, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 120000229}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "It's also very quiet, helped by the calm area.", "title": "perfect!", "user": "susanpradja", "date": "October 16, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 119365164}, {"rating": 3.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "Also the guy we had meet us and let us in was very polite. It's hard to fault the whole thing. Compare this to the price of a hotel in Milan and it's a great deal. Only two of us stayed here but it could take four with the sofa bed.", "title": "Good apartment, rude building caretaker", "helpfulness": 1, "user": "flipavocat", "date": "September 28, 2011", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 118683046}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "The hotel located in a quite street and neighborhood. The room is spacious and enough for me, my wife and my two children. The design is minimalist and simple. It has complete facility for family except clothes washing machine. The white color of all interior ensure us the cleanliness. It is only 3 minutes walk from subway station and to mini market. There area also some restaurant and shop surrounding this apartment. Make sure you contact the management first to arrange the key before you come.", "title": "Quite, clean and good location", "user": "Samuelpas", "date": "August 19, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 137595970}, {"rating": 5.0, "stay_parameters": "Stayed July 2012", "text": "Stayed at apartment garibaldi near corso como a few weeks ago and could not have asked for a nicer and more modern apartment. Newly renovated with stylish kitchen, large bathroom and new plasma tvs, this split level apartment is perfect for 4 people. Location is amazing, with great restaraunts and shops surrounding this apartment. Brera is a great neighborhood and would definitely stay here again next time in Milan.", "title": "Classy with a great location", "user": "Jdtraveller1", "date": "July 26, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 3.0, "rooms": 5.0}, "id": 135444603}, {"rating": 5.0, "title": "great example of \"less is more\" design.", "text": "You will get in love with this posh-white minimalistic loft equipped with all the functionalities you will think off: wifi, white led with free cable, blu-ray, dvd, Yamaha micro station for your ipod, nespresso with free coffe, free tea and a fully equipped kitchenette.", "user": "A TripAdvisor user", "date": "July 25, 2012", "id": 135315358}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "And all that near Brera street, the place-to-be at after dark. A fashionable street with tiny bars and pubs where everybody drink inside, but most of them outside, creating a great buzz until 1-2.00 am.", "title": "boutique chic in fashionable area", "user": "lucy E", "date": "July 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 135234779}, {"rating": 2.0, "stay_parameters": "Stayed July 2012, traveled on business", "text": "We stayed at brera apartments Moscova for 1 night in july and found it perfect for our needs. We are a mid thirties couple working in fashion and film and wanted to stay in an area with nightlife, convenient transport links and nearby boutique restaurants. The staff were helpful taking our bags to the apartment which we found clean with chic decorations, ipod docks, modern wetroom and very comfortable bed. It is perfect for a weekly sty with kitchen facilities and private dining room and a fold out sofa bed. We would stay there again with friends or alone for a weekend in milan. the parks are across the road and the streets around buzzing with people come 8 oclock. Highly recommended esp for the price. i think we ended up pay 80euros a night through booking.com", "title": "Nice apartment, good price, extremely noisy", "helpfulness": 2, "user": "paris6688987", "date": "July 5, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 2.0, "sleep": 1.0, "rooms": 4.0, "location": 1.0}, "id": 133510065}], "location": {"country": "Italy", "region": "Lombardy", "continent": "Europe", "city": "Milan"}, "variance": {"poor": 1, "average": 5, "very good": 21, "terrible": 2, "excellent": 33}, "slim_ranking": 0.108910891089, "description": "Brera Apartments are located in beautiful areas in the heart of Milan: in the most peaceful part of the historic Brera district, which the artists of the Academy of Fine Arts, since the nineteenth century, have turned into one of the most characteristics of Milan, or in the most glamour part of the city, dotted with shops and showrooms of the most important names in fashion.Brera Apartments are particularly quiet and silent: located in elegant historic buildings, featuring a typical Milanese style. The atmosphere is welcoming and personalized, stylish with “collection design” furnishing, with parquet floors.Each apartment is divided into the large living room, the kitchen area and the bedroom. All Brera Apartments are equipped with Nespresso coffee machine, pods, teas and herbal teas, a 32-inch high-definition TV with free Sky channels, an extensive DVD collection, Hi-Fi stereo system compatible with iPhone and iPOD Apple, and complete with CDs to set the perfect mood. Free Internet WI-FI connection is also available."}