{"user_rating": 4.5, "review_count": 136, "name": "Bridgend Hotel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled on business", "text": "Lovely warm welcome. Comfortable rooms. Beautiful setting. Fabulous food. Really good situation if you are planning a holiday on the beautiful island of Islay this hotel is ideal. Can't wait to go back.", "title": "Exceptional", "helpfulness": 1, "user": "Jemima49", "date": "April 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 158149860}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "This is the second time my family has stayed here in the past 3 years. This time we booked 3 rooms to cater for our tribe and they were all well furnished and decorated. Recently refurbished by the look of it. The bathrooms were similarly well appointed........", "title": "What a fantastic place......Again!", "helpfulness": 1, "user": "Oooh-er-missus", "date": "April 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 157840379}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "The bar area I very pleasant as is the dining area. All the staff are very attentive as is Lorna, the manager, and they will do what they can to ensure your stay is a delight.", "title": "Awesome", "helpfulness": 1, "user": "Ashi_Harra", "date": "April 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 157241628}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "The restaurant menu offers a range of quality dining choices and there is also a bar menu that offers slightly less formal food but still very good quality.", "title": "Our Holiday", "user": "DerekB295", "date": "April 7, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 156854218}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "The hotel location is also ideal for accessing both sides of the island and has the added bonus of a small but amazingly well stocked \"Spar\" supermarket very close by.", "title": "Delicious meal and great hospitality!", "user": "andyhEdinburgh", "date": "April 5, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0}, "id": 156661570}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "The hotel is well appointed. Our room was a little small (particularly the bed, for two tall adults), but well maintained and the bathroom seems to have been replaced recently. The staff were extremely friendly and helpful, which is the overwhelming impression left with us. They got to know our name on the first night, so no need to quote a room number, and gave lots of useful advice on where to go. Even when Scottish Power decided to flicker the electricity off constantly, and then cut it completely, in the middle of serving main courses, they handled the issue efficiently and with good humour. There is a nice garden in the back, again well maintained.", "title": "Friendly helpful staff", "user": "wine_searcher", "date": "July 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 168037951}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "The restaurant has an imaginative menu, well prepared and well presented and the bar a fine selection of Islay malts.", "title": "Taste of luxury!", "user": "Janis M", "date": "July 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 167217319}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled with friends", "text": "We stayed for 3 nights in July as part of a Highlands/Islands holiday and thoroughly enjoyed the hotel.", "title": "Great Food & Service", "user": "Scott S", "date": "July 9, 2013", "detail_rating": {"value": 3.0, "service": 4.0}, "id": 166955502}, {"rating": 3.0, "stay_parameters": "Stayed June 2013, traveled solo", "text": "First and foremost if you want a happy, high quality experience - book this hotel. Attentive, friendly, knowledgeable staff, top quality food and a beautiful, clean comfortable bedroom.", "title": "Hotel is fine, atmosphere is not as I would expect", "user": "LWBE", "date": "July 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 166435040}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "The choice of two eateries is absolutely great; Katie's Bar and the Restaurant. Katie's Bar is bright, welcoming and modern with interesting traditional quirks - and a mix of other hotel guests, tourists staying elsewhere on the island and locals. The menu is reassuringly specialised (i.e. fits on one chalk board) and is packed with fresh, local ingredients. The restaurant is a more formal room and has a still-specialised, wider ranging and even more luxurious menu. Food was served quickly and efficiently - though there was never any sense of it - or us - being rushed. While Katie's Bar is highly unlikely to disappoint, it is absolutely worth treating yourself to a meal in the Restaurant too. Check out the hotel website for example menu/prices and, if eating here more than once in a week (we happily ate between the two eateries every night we stayed) check with staff as to when the bar menu changes if you want different choices, especially if you are a veggie. However, if you love all foods (local meats, fresh fish...) then you'll be spoiled for choice anyway; pick up the phone and get booked in!", "title": "Wonderful Hotel !", "user": "Axel K", "date": "June 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 164725022}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "The Bridgend is almost like a mini-Broadmoor, five-star resort in Colorado Springs, CO, USA. There's only a few guests, and Lorna, the innkeeper, a sparkling lady who makes everyone seem like an invited guest, sat us at a table for two at the excellent, cozy hotel restaurant. About five minutes later she sat a group of about six very blasted Scots dressed in kilts next to us and proceeded to introduce us by name to them. They were all colleagues that make a special local whisky and were as friendly as a basket of puppies, even treating us to a dram of whisky. Lorna called the it the \"naughty table\", but for us, it was a highlight of our tour of Scotland that wouldn't have happened had Lorna and her staff not treated us as family rather than guests. And they treat everyone that way. You won't regret staying here, and you'll want to stay again when you return.", "title": "A Special Place to Stay in Islay", "user": "Larry S", "date": "June 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 164505938}, {"rating": 5.0, "title": "Wonderful place from which to explore Islay", "text": "We loved our stay at Bridgend. Lorna and her staff were so friendly and helpful. We were doing a combo family history quest and whisky-tasting adventure...and the Bridgend staff helped us with locations and schedules for everything. The rooms were very nice and very clean as well. The breakfasts were very good, and the dinners were excellent. The day we got in, they stayed open to feed us a marvelous dinner even though it was a little after their normal closing time. Highly recommended.", "user": "BHejtmanek", "date": "June 14, 2013", "id": 164009349}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "My husband (German) and I (Scottish) living in Germany are just back from our trip to Scotland and we stayed at the Bridgend hotel during the Islay whisky festival week (definitely worth a visit!). My husband was so impressed last year with his stay at the hotel that he booked again for this year! We were met with a very warm welcome, enjoyed excellent service, a brilliant breakfast every morning (mmm.. those kippers!) and the room was extremely comfortable. We've booked again for next year! Thank you so much Lorna and your staff (special greetings to Mary) for making the stay so special!", "title": "Very enjoyable stay!", "helpfulness": 1, "user": "Susan K", "date": "June 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 163251656}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "I cannot say enough about the Bridgend Hotel. The staff are wonderful. Everyone goes out of their way to make sure that you enjoy your stay. The food is fresh and tasty as well. It makes other hotels pale in comparison. If you are going to Islay, do yourself a favour and stay with Lorna and her staff! Janice M and Kathryn S, Nova Scotia, Canada", "title": "A delightful place to stay!", "helpfulness": 1, "user": "Janice M", "date": "June 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 163125010}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "Stayed for one night - great location. The room was very comfortable with added local extras - tablet with the coffee and local toiletries. Ate in the restaurant, where the food was lovely - including the breakfast. Staff were lovely and helpful Would definately stay here again.", "title": "lovely stay, customer service excellent", "helpfulness": 3, "user": "lesleyloolu", "date": "May 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 162032079}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "Very friendly team and the manager, Lorna McKechnie, must be The Heart of Islay that they advertise! Our room was upgraded and it was very clean, comfortable and somewhere we would definitely stay again. There was even a welcome gift of home made tablet in our spotless room.", "title": "A really warm welcome and a great base", "helpfulness": 1, "user": "steveandgerry", "date": "May 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 162001363}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "We were recommended to take a walk in the woods behind the hotel as it was a lovely day and they were filled with primroses and bluebells - and we even saw deer. I believe the Hotel is owned by Islay Estates and benefits from lots of game in the season. Should really go back for the venison! Mind you the seafood we had was super.", "title": "Wonderful hotel", "helpfulness": 4, "user": "SusanJG", "date": "May 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 161804528}, {"rating": 5.0, "stay_parameters": "Stayed May 2013", "text": "Our breakfast was great. Good selection of fruit, 3 juices, cereals and good thick porridge. We had salmon, scrambled eggs, haddock with poached egg, and there was also a good traditional Scottish breakfast on offer.", "title": "Beautiful hotel and great food. Customer service, some of the best ever.", "helpfulness": 2, "user": "PamelaW31", "date": "May 25, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 161796960}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with friends", "text": "I would have like oatcakes with my marmalade instead of toast, but that is being nit-picking. I doubt anyone could be disappointed with such a friendly, comfortable stay. We wished we had booked for longer.", "title": "Bridgend Hotel", "helpfulness": 1, "user": "Anne M", "date": "May 13, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0}, "id": 160564399}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "Dinner was very well cooked and presented and complemented by a good wine list.", "title": "Wild Weather, Warm Welcome & Whisky!", "helpfulness": 2, "user": "Marbio83", "date": "April 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 158980230}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "variance": {"poor": 4, "average": 6, "very good": 25, "terrible": 1, "excellent": 100}, "aka": "Bridgend Hotel Islay", "slim_ranking": 0.2}