{"user_rating": 4.0, "review_count": 819, "name": "Bristol Marriott Royal Hotel", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed June 2009, traveled on business", "text": "I have been staying at the Royal Marriott in Bristol for 5 nights. Upon arriving, I found dirt on the floor of the bedroom and hairs on the floor of the bathroom. Although I reported this to the front desk, the dirt remained in place for another day and a half, in the bathroom for the entire stay. Sink and mirror in the bathroom were never clean, the only window of the room was filthy, you could hardly see through. In my view, this is an unacceptable standard of cleanliness for a 4-star hotel. I will not stay there again.", "title": "Dirty room!", "user": "frome99", "date": "July 3, 2009", "detail_rating": {"cleanliness": 1.0, "value": 3.0, "location": 4.0, "service": 2.0, "rooms": 2.0}, "id": 33803343}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled on business", "text": "My husband and i have recently been married at Bristol Marriott. We had a fantastic time and the staff couldn't do enough for our special day. We had the honeymoon suite which was like a whole flat with a hugh four post king size bed. I stayed at the hotel the night before my wedding with my one of my bridesmaids and the hotel made it a very memorable time.", "title": "magical wedding", "user": "excited75", "date": "June 30, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 33579310}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "On the day of the wedding we had a few hiccups which were nothing to do with the hotel and yet they done all they could to help.", "title": "Weekend in Bristol", "user": "Happydutchman", "date": "June 30, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 3.0, "rooms": 4.0}, "id": 33545632}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled with friends", "text": "I just wanted to say that if you are concidering this hotel for a wedding it is beautiful", "title": "nice place, shame about car park fees", "user": "jeminibird", "date": "June 29, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 4.0, "service": 4.0, "rooms": 5.0}, "id": 33490040}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "Traditional grand hotel style, beautifully renovated. Be aware it is in the centre of the town, so there is a lot of heavy drinking in the area on the weekend.", "title": "Great Hotel", "user": "oggieoggie", "date": "June 13, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 32218887}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "Stayed on night before a friends wedding. The hotel is in a great location. It haas been recently refurbished and it has been done with style. It was better than I expected from a chain hotel. Our room was £95 for bed and breakfast which I thought was great value.", "title": "Great value hotel in great location much better than average chain hotel", "user": "gwyn4940", "date": "August 15, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 37728190}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled on business", "text": "My OH was most impressed by the breakfast which was served until 12 on a Saturday, great for making the most of your lie in!", "title": "Top End of Marriott's in UK. Most comfortable beds I've found in Bristol so far", "user": "Autobiography88", "date": "August 14, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 3.0, "rooms": 4.0}, "id": 37699904}, {"rating": 1.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "I have chosen this as my preffered hotel for Business stays in Bristol. As long as you avoid lower rooms facing the side of the building adjacant to Harbour Road (which have poor sound proofing and suffer traffic and nightclub noise) this hotel is as comfortable as it gets in Bristol. The beds knock me out like a light until the alarm. Food is of reasonably good quality and amenities meet the 4* billing. Staff always appear to put you first. Room service took 55 minutes this week and whilst I had to prompt them for the 'free if later than 45 mins promise', once reminded, I received a free meal!", "title": "Grand on the outside - tired and in need of refurb on the inside", "user": "LibraladyBristol", "date": "August 11, 2009", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "location": 5.0, "service": 3.0, "rooms": 1.0}, "id": 37409094}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "I do recommend the hotel.", "title": "Gorgeous, luxurious and great location.", "user": "familyofthree_8", "date": "August 11, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 37343036}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "Husband and I checked into this hotel in July 2009 for just one night. It was our first hotel stay without children in 14 years so we thought we would push the boat out and go for the very 'grand' looking Marriot Royal. Being regular visitors to Marriot hotels for many years with our children (mainly at Slough Windsor Marriot, Gatwick Marriot Renaissance and Portsmouth Marriot) we were expecting this one to be special... oh dear... special it certainly was not!!! Although we had asked for a room with a view over college green, we got a very dingy,scruffy room overlooking other sides of the hotel, the furniture was old and tatty with odd fittings. The decor was tired and the carpets were worn out. The room itself was quite dark and we found it to be a little depressing. As we had specifically asked for a room with a view, we politely asked reception if we could move and they obliged without fuss. That day we went down to the pool (which looks fabulous in photos) and were looking forward to a relaxing swim and sauna.Pool was ok, again a bit tired and shabby in places, but ok. The steam room on the other hand was absolutely disgusting...I sat down on the seat and put my hands behind me... the back of the seat was covered in filthy, green slime! The walls in the steam room reminded me of a public toilet and the stench of mould was overpowering. Needless to say, we got out of there pretty swiflty! Our 2nd room was more pleasant than the first, the bed was comfortable and we were not disturbed by other guests at the hotel. Air conditioning was not working, but this was not a problem as it was not hot that night! Breakfast (always our favourite bit) was terrible - certainly not worthy of circa £16.50 price tag! the food was cold and we had to wait ages for stock replenishment, staff were not particularly friendly or attentive. Again, the dining room was dingy and really is in desperate need of refurbishment. Overall, I would say that this was the shabbiest, most disappointing Marriot we have ever stayed at. What makes it even sadder is that I was born in Bristol, it is my home town and I would much rather be telling people that this is the best place to stay when you visit my great town... This Marriot really does need an overhaul and a reality check!", "title": "Lovely pool, lovely room, great location, friendly and helpful staff", "user": "Shmaggle", "date": "August 10, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 37298879}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled on business", "text": "I stayed at this Hotel in a very busy week and arrived late and feeling unwell. the service was fantastic, staff helpful and polite. My room comformatble, spacious and clean. Of coursde one expects this of such a Hotel but its great when it 'does what is says on the tin.'", "title": "great place", "user": "sharon3001", "date": "July 23, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 35538875}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "This stylish and rather grand hotel is in a tremendous location from which to explore Bristol’s great centre. The underground parking is convenient and the reception staff were very friendly and helpful. (Shame the lifts are not as efficient, they are painfully slow and given that the hotel was very well occupied it could take an eternity to get from one floor to another)", "title": "A very good hotel but with mixed standards of staff abilities.", "helpfulness": 1, "user": "gowerguy", "date": "July 21, 2009", "detail_rating": {"cleanliness": 3.0, "value": 5.0, "location": 5.0, "service": 3.0, "rooms": 4.0}, "id": 35379936}, {"rating": 1.0, "stay_parameters": "Stayed June 2009", "text": "Our spacious junior suite overlooking the Cathedral was on a dinner bed and breakfast basis which represented excellent value for money. The room is a interesting shape, almost hexagonal with several windows, such a pleasing change from staying in the usual ‘box’ type room. The décor is pleasant and the bed delightfully comfortable. Somehow though these days I would expect a decent coffee maker and flat screen TV in this type of room? Not quite too sure the set-up with the mini bar is what most clients want, but given Bristol’s magnetism for stag and hen functions, I can probably appreciate why they have such an ordering system utilised in the rooms.", "title": "Try midweek", "user": "casisol", "date": "July 21, 2009", "detail_rating": {"cleanliness": 4.0, "value": 1.0, "location": 4.0, "service": 1.0, "rooms": 1.0}, "id": 35341350}, {"rating": 4.0, "stay_parameters": "Stayed December 2008, traveled as a couple", "text": "The large bathroom has copious amounts of marble and glass, providing a luxurious ambience, though overall the lighting was rather dim and poorly designed for everyday use.", "title": "Great Location, excellant gym, good rooms. Shame about the noise.", "user": "Scot2009", "date": "July 16, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 3.0, "service": 4.0, "rooms": 4.0}, "id": 34924822}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "A complimentary bottle of some very nice wine was a thoughtful touch as were the various magazines.", "title": "excellent hotel in great location", "user": "awen_richards", "date": "July 12, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 34519327}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled solo", "text": "I spent two nights in this hotel before traveling to Salisbury. It has a great location to visit Bristol. I'd recommend to ask for a room in a high floor. Mine was in the fourth floor with a queen bed and was perfect. I got an amazing view of the Cathedral from my window and it was quiet despite of the fact that there were wedding receptions both the nights I spent there. I booked through the Marriott website and I paid 94K breakfast included per night. Unfortunately, I must make a complaint about the cleaning staff. The bathroom was not properly cleaned and neither was the room! Really poor for a hotel like this!!! Both breakfast buffet and the room service were good. Staff is extremely nice and gentle!", "title": "Great location...but...", "user": "YoSpanish", "date": "August 23, 2009", "detail_rating": {"cleanliness": 2.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 38516220}, {"rating": 4.0, "title": "Thoroughly enjoyable weekend", "text": "The staff were extremely helpful and pleasant, always smiling. Our room was very spacious, clean and quiet. Breakfast was very adequate in nice surroundings.", "user": "tiger004", "date": "August 20, 2009", "id": 38261136}, {"rating": 5.0, "title": "Well worth the drive to experience something so wonderful!", "text": "Location was fantastic, very central to everything. Have absolutely no complaints.", "user": "ChucknChick", "date": "August 17, 2009", "id": 37904103}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "Excellent welcome- staff very friendly and hospitable. Restaurants very good and food is beyond our expectations. Our rooms were very clean, spacious and had everything we could have needed or wanted. In the centre of Bristol City, well within walking distance of anything and everything we wanted to do. Thank you so much for a great weekend away- we will be back!", "title": "Made so welcome!", "user": "Holly25", "date": "August 16, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 37858671}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "Just returned from a two night break at The Royal Marriott in Bristol. Would thoroughly recommend this hotel - the staff were just delightful! Excellent breakfast choices - hot 'full English' and buffet spread. We had dinner on Saturday pm in the hotel - in a beautiful, elegant dining room - delicious food and attentive,discreet staff - what more could we want? Room was average-sized - but powerful shower - good-sized bath tub and well serviced. Did the 2 hr walk with a local guide on the Saturday morning (£3.50 each) - great value for money and v helpful and informative. A lovely weekend!", "title": "Great stay", "user": "Comfortluver", "date": "August 16, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 37831084}], "location": {"country": "United Kingdom (UK)", "continent": "Europe", "city": "Bristol"}, "stars": 4, "variance": {"poor": 51, "average": 90, "very good": 290, "terrible": 20, "excellent": 368}, "aka": "Marriott Bristol", "slim_ranking": 0.1, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.0, "rooms": 4.0, "location": 4.5}, "description": "With a fabulous location next to Bristol Cathedral and the historic waterfront, the Bristol Marriott Royal Hotel offers ideal accommodations for enjoying England's southwestern charm. From the moment you arrive, our Victorian-style hotel captivates you with polished marble, warm mahogany and gleaming brass. Spacious rooms offer comfortable furnishings, 24-hour room service, and large work areas with high-speed Internet. For an event, choose our ballroom for 260 guests or a smaller meeting room for intimate gatherings. Enjoy an afternoon tea or cocktail at the Club Bar after your stroll from Bristol's historic sites. For dinner and Sunday lunch, the newly refurbished Walters Restaurant, offering locally sourced regional flavours from the South West. Visit our Roman-style leisure club for the perfect retreat - enjoy a refreshing swim, soothing sauna or invigorating workout. When looking for a luxury hotel in southern England, choose the Bristol Marriott Royal Hotel for its friendly staff and modern amenities."}