{"user_rating": 4.5, "review_count": 354, "name": "Brisas Del Mar, Inn At The Beach", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed April 2011", "text": "My daughter and I stayed at the Brisas Del Mar when I came to visit her in LA from my home near Chicago. It was perfect for us. The hotel was spotless and the people very friendly. We loved the cookies & milk, wine & cheese and the breakfast. The bikes which were available when desired, were an added treat. It was great to get away for a mini vacation together. The hotel was exactly what we wanted.", "title": "Wonderful time at Brisas!", "user": "KAMB35805", "date": "May 3, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 106744926}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled with family", "text": "Despite the photos - this is set up like a motel - except you park underneath the units. We were fortunate to be in unit 29 - which has a view being on the top level (as would 28-30), but other units basically look at each other and over the central parking courtyard. The pool is small, but acceptable, with reasonable sun in the afternoon. The location is fine for people comfortable walking - as it is quite a few blocks (prob 20 min walk) to the main State Street district. The beach is closer, but still 10-15 mins to the pier walking. The wi-fi in the rooms is free but slow - much faster down in the lobby. The b'fast is adequate but simple, and free, and the afternoon wine/cheese is fine (cheap wine), and the evening milk/cookies is a nice touch. Free dvd rentals from the front desk - extensive list - just wish it was categorized by rating - or at least had a 'family' section as the ratings are not listed in the lists which can make it hard to pick age appropriate movies. For the price, location and amenities, a good place in SB. But it is not as fancy as their web site photos make it look. Room furniture is cheap and old, but beds are comfortable. Pillows could be better - who still has chopped foam pillows - really! No bath in our room - shower only. Not sure about all rooms.", "title": "A great hotel/motel - nice amenities - good value", "helpfulness": 1, "user": "LondonUnveiled", "date": "April 20, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 104848149}, {"rating": 3.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "I felt that the pictures on the website were very deceiving. Thought we were staying in a very nice Spainish style hotel. The pictures showed only the front of the hotel and not the hotel itself. My husband and I were very disappointed once we saw it was an ordinary motel. I will say t he staff was very helpful and friendly. We felt the room was very overpriced for what we got.", "title": "Not whate we expected.", "helpfulness": 3, "user": "Julie32580", "date": "March 28, 2011", "detail_rating": {"cleanliness": 5.0, "service": 5.0}, "id": 101935231}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled with friends", "text": "Thank you,", "title": "Adorable & charming hotel", "user": "bjc76", "date": "March 26, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 101594157}, {"rating": 4.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "Julie La Mirada, CA", "title": "Comfortable and homey stay", "user": "JimmehJim", "date": "March 13, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 100072090}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "We stayed for two night during Spanish Days in SB. The location is about 4 blocks from the water front and was an ideal location. We stayed in room 14, great location at the back of the complex. At first they gave us room #1 which was next to the front office, but that would have been way too noisy. Luckily they switched us to room 14 which was nice and quiet. Some rooms have beds near the front door, but our room had the bed in the back room. Much better option for a quiet sleep. The beds are very comfortable and the linens are good quality. The full sized kitchen is very nice and handy. There are two liquor stores within walking distance and state street is just a few blocks away. There is a shuttle service that runs up and down statestreet for 25 cents per person one way. That is very helpful. I would stay here again.", "title": "Nice, clean, comfortable and good location", "helpfulness": 1, "user": "ROSEOC", "date": "August 13, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 3.0, "service": 4.0}, "id": 116661828}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "I have stayed in some excellant hotels over the years but this is one of the cleanest, clearly the staff are focused on high standards, are friendly and keen to help you. Don't judge a book by its cover, yes they are motel type rooms (but most are in Santa Barbara) and fairly basic but the beds are comfortable and the rooms clean. You are a short walk from the harbor so good location. Didn't get chance to use the free bikes but great idea and a plus is also the breakfast in the mornings and wine and cheese in the evenings.", "title": "Surprisingly good and would go back again", "user": "Brennan1966", "date": "August 7, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 116392638}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "The wife and daughters were not sure about this place when we arrived but we all had a great time, the friendly staff are a credit to this hotel.", "title": "Would definitely stay here again!", "helpfulness": 1, "user": "ciao_tutti2", "date": "August 5, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 4.0}, "id": 116315893}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "This hotel is very quaint. I felt it was a good value for the money. Rooms vary in size but are very charming and clean. Continental breakfast was pretty good, wine and cheese and cookies in the evening, a bonus. Walking distance to water or restaurants and shopping. Would definitely stay again!", "title": "Quant and Comfortable", "user": "Califcoastlover", "date": "July 29, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 3.0, "value": 3.0, "service": 4.0}, "id": 115993820}, {"rating": 3.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "Quant and comfortable", "title": "Good stay. Read review!", "helpfulness": 2, "user": "pisces219", "date": "July 23, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 5.0, "value": 2.0, "service": 5.0}, "id": 115702725}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled with friends", "text": "We were very satisfied with our stay. We had a room with a kitcheonette (VERY small, but served our needs!), pull-out sleeper sofa, and bedroom. Bed was too soft for our liking--sore backs--but otherwise no complaints! Love the rental bikes and helmets, constant fruit bowl in the lounge, nice breakfast options, wine-and-cheese afternoons, and cookie evenings. Service exceptionally friendly, and common areas beautiful; pool is small but great, hot tub comfy, and nice, hot, fresh shower in the corner! Location is great for beach/wharf/pier access...longer walk to downtown/State, but totally doable (even with kids!).", "title": "Charming, friendly place!", "user": "YertleTurtle", "date": "July 18, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 3.0, "value": 5.0, "service": 5.0}, "id": 115498620}, {"rating": 4.0, "stay_parameters": "Stayed July 2011", "text": "Providing ur neighbours aren't too rowdy, this place is perfect for a stay in SB. Location is spot on, hire the bikes and venture up to the mission and ride along the beaches. Close to state street and easy find from the highway. Cool!", "title": "Perfect for a short stay in Santa B*", "user": "Shazzarinski", "date": "July 12, 2011", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 115292443}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "We loved our stay here! Location was convenient and we enjoyed the free beach cruisers to ride around town on. Loved the evening wine, cheese and fresh cookies! Place was quiet and everyone was very friendly and helpful. We look forward to staying here again!", "title": "Great place to stay!", "user": "Virginia216", "date": "July 6, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 5.0, "service": 5.0}, "id": 115105408}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with friends", "text": "Best (and also most expensive) hotel on our 3 weeks tour through western California. we didn't regret having paid the price. Rooms are big and very clean. Staff extremely friendly, perfect service. Hotel has a big pool and hot tub and nice area to sunbath. Breakfast was one of the best we had with fresh fruits, yoghutz, bagels, toast, juice, sweets, granola etc. I would defenitly stay here again. There's a discount if you're a AAA member (or ADAC).", "title": "perfect, clean, comfortable!", "helpfulness": 2, "user": "tiwi1978", "date": "June 9, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 112341079}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "We stayed at this hotel during our west coast road trip from LA to San Francisco. In short I cannot say enough about this hotel as everything was excellent and we actually extended our stay by two days because we were having such a good time. Santa Barbara is gorgeous and the hotel is 5 minutes walk from the sea front, turn right to go to the harbour and left to go to the pier (another 5 minutes to reach both and both are lovely). It's also only 5 - 10 minutes drive into State St. where all the shops, cafes, bars etc are, plenty of parking, most with the first 75 mins for free.", "title": "Absolutely excellent, perfect place to stay in Santa Barbara", "helpfulness": 6, "user": "jedzed", "date": "June 4, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 111505842}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "We stayed here for two nights in May 2011. Our room was very comfortable, being tastefully furnished and well equipped. The heated pool and hot tub were lovely and the area around them was good for relaxation. A decent continental breakfast was included and a free cheese and wine reception was held in the late afternoons. There was free wireless internet. The hotel is very well located in a quiet neighbourhood, being just a few minutes walk from the beach and about ten minutes walk from the bustling restaurants and bars of State Street. The staff were very friendly. We would definitely stay here again.", "title": "Lovely hotel. Very comfortable room, welcoming staff and nice pool", "helpfulness": 4, "user": "UKScientist", "date": "June 2, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 4.0, "service": 5.0}, "id": 111137835}, {"rating": 4.0, "title": "an \"upper style\" charming motel", "text": "ok, so yes, it is built quite like a motel. Therefore, we found our room, overlooking a stair on the gorund floor, to be a bit too dark for our taste (especially when oyu are coming for the sun!). However, the room was nice and clean and had good space (we booked a suite).", "helpfulness": 2, "user": "A TripAdvisor user", "date": "May 14, 2011", "id": 108228678}, {"rating": 4.0, "stay_parameters": "Stayed June 2010", "text": "The hotel is not far from the seaside (easily walkable) and it does have a lot of the hispanic charms of Santa-Barbara.", "title": "Quiet and comfortable, good pool", "helpfulness": 2, "user": "Michelle0708", "date": "May 10, 2011", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 107695285}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "The small pool was very pleasant and uncrowded", "title": "Excellent value", "helpfulness": 2, "user": "BarbaraH52", "date": "May 10, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 107603634}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "Service was great with free cheese and wine and a decent continental breakfast. good choice of free rental DVDs. Staff in general were quite nice and helpful.", "title": "Road trip down highway one, wish we could have stayed longer", "user": "Nicole76oz", "date": "May 6, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 107184934}], "location": {"country": "United States", "city": "Santa Barbara"}, "stars": 2.5, "variance": {"poor": 9, "average": 20, "very good": 127, "terrible": 6, "excellent": 192}, "aka": "Brisas Del Mar, Inn At The Beach Hotel Santa Barbara", "slim_ranking": 0.1, "description": "Intimate and elegant, the Brisas del Mar, Inn at the Beach is a romantic Mediterranean-style villa just two blocks from Santa Barbara’s glistening palm-lined beaches and scenic yacht harbor. Brisas del Mar beckons guests with its cascading fountain, sparkling pool, and refined old-world ambiance.A Santa Barbara classic, Brisas del Mar, Inn at the Beach offers spacious guest rooms, suites, and penthouses, some with full kitchens and fireplaces. The hotel serves a fresh continental breakfast each morning, hosts a wine and cheese reception each afternoon, and provides milk and cookies in the evening.Brisas del Mar, Inn at the Beach is within walking distance of beautiful West Beach and the oceanfront bike path, the Santa Barbara Yacht Harbor, Stearns Wharf, and the vibrant shops and restaurants lining State Street in downtown. Santa Barbara’s world-class golf courses and renowned wineries are just minutes away."}