{"user_rating": 3.5, "review_count": 2005, "name": "Brisas del Caribe Hotel", "reviews": [{"rating": 1.0, "stay_parameters": "Stayed January 2006", "text": "My wife and I (40's) arrived at the Brisas on the 6th January. It took an absolute age to check-in in what seemed like an eastern bloc airport terminal but is in fact the main hotel area with 2 atmosphereless bars and lots of people sitting around looking at a loose end.", "title": "Shame on you First Choice Holidays", "helpfulness": 14, "user": "Dicky54002", "date": "February 10, 2006", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "rooms": 1.0, "service": 3.0}, "id": 4451730}, {"rating": 5.0, "title": "loved it", "text": "After check in we were taken to our room about 300 yards from the main hotel and overlooking a car park. The porter couldnt open the door as the lock was broken. After a 20 minute wait he returned with a key to another room. After a quick call to the reception the maintenance guy visited and said that he couldnt fix the aircon. Not being able to stand staying in a room that smelled musty and moldy we requested a move to another room. Room 3 was a great improvement, large and with a TV that you could almost tune in. Unfortunately although having no light in the bathroom and a broken toilet seat we decided to give it a try and see if maintenance could sort it next day.", "helpfulness": 13, "user": "A TripAdvisor user", "date": "February 7, 2006", "id": 4443807}, {"rating": 4.0, "title": "What a soap opera", "text": "Breakfast was pretty ordinary, lunch wasnt as good. The buffet restaurant was just dire, it really was a joke, it reminded me of the sort of stuff you would expect to see at a 9 year olds birthday party. Overcooked chicken or a thin burger with some shredded cabbage, followed by fairy cakes and ice cream..mmmm...", "helpfulness": 19, "user": "A TripAdvisor user", "date": "February 2, 2006", "id": 4410027}, {"rating": 5.0, "title": "Just like Heaven........", "text": "We had a chat with the Rep, explained that we didnt pay to stay in a sub 2 star hotel and when she asked if we would pay to be upgraded we said definitely. She checked what we had paid and immediately offered us a free upgrade to the Bella Costa. The Bella Costa was a breath of fresh air, good food, very helpful staff, clean rooms and most importantly we felt comfortable and that it was a nice place to be.", "helpfulness": 18, "user": "A TripAdvisor user", "date": "February 1, 2006", "id": 4405411}, {"rating": 5.0, "stay_parameters": "Stayed January 2006", "text": "The good reviews about the Brisas hotel seem to concentrate on how nice Cuba is, or the beach, the dolphins or the helpful staff. These things apply in most hotels in Varadero I guess. My advice is to book elsewhere but if you are already committed to this hotel and you dont feel that it is up to your expectations go and talk to the rep. 3 couples were upgraded from our party and according to the reception staff at Bella Costa its a very regular thing with a number of people from each Brisas party complaining and being moved.", "title": "Loved it!!!!!!!!!!", "helpfulness": 18, "user": "sunone", "date": "January 29, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 4.0}, "id": 4395837}, {"rating": 5.0, "stay_parameters": "Stayed January 2006", "text": "My boyfriend and I (in our 40's)spent 1 week vacation at Brisas and had an absolutely amazing time. This was my second vacation to Cuba and I am already planning my trip for next year.", "title": "UNFORGETTABLE WEEK", "helpfulness": 21, "user": "smileyLondon_Ontario", "date": "January 17, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 4358688}, {"rating": 5.0, "title": "Fantastic Holiday", "text": "The staff at the resort were so friendly and helpful they went out of their way to make us feel comfortable and made sure we were enjoying ourselves at all times.", "helpfulness": 25, "user": "A TripAdvisor user", "date": "January 16, 2006", "id": 4355794}, {"rating": 3.0, "stay_parameters": "Stayed January 2006", "text": "Our room was in the old section and was kept very clean.", "title": "The Brisas - Not My First Choice", "helpfulness": 14, "user": "KayToronto", "date": "January 15, 2006", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "rooms": 2.0, "service": 2.0}, "id": 4355447}, {"rating": 5.0, "stay_parameters": "Stayed December 2005", "text": "The food was very good. Especially the 3 a la carte restaurants. The staff were continuously filling our wine glasses.", "title": "Excellent Christmas Vacation!", "helpfulness": 24, "user": "Travel47", "date": "January 2, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 4318773}, {"rating": 4.0, "stay_parameters": "Stayed December 2005", "text": "The beach was so beautiful - It was paradise.", "title": "Wonderful time", "helpfulness": 40, "user": "SunnyMontreal", "date": "January 2, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 3.0, "service": 4.0}, "id": 4318211}, {"rating": 5.0, "title": "We got married at Brisas", "text": "Me and my husband got married in at Brisas Del Caribe on January 19, 2001. The wedding was perfect thanks to Maida the wedding coordinator at Brisas...What an amazing lady, she is so thoughfull and would do anything to help you and she definately made sure are day was perfect. The hotel gave us a nice HUGE sweet for that week as a gift, it was the most beautiful room i've ever seen with jacuzzi and all. I would definately recommend this hotel to everyone as they go out of their way to wake your stay a memorable one. The a la carte restaurant are amazing. The cleaning service is great, they always leave your room spotless. The food is Ok. The beach is the most beautiful thing I've ever seen...Wow, that water is so clear, you won't believe your eyes. I would recommended this hotel to everyone without hesitation. Brisas Del Caribe made my wedding day one of the most amazing days of my life...Thanks Brisas!!!!Julie and Rock Canada", "helpfulness": 6, "user": "Julie-Marie b", "date": "July 20, 2003", "id": 1141098}, {"rating": 4.0, "title": "The food isn't that bad...", "text": "We had two different experiences at the hotel. We stayed from the 24th June for two weeks. The first week and a half were excellent. The hotel seemed very quiet, we were always able to get a space by the pool and at the beach and we were very well looked after by all the staff. Our room was in the new (South) part of the hotel and was very nice and clean. A short walk to the main building and the beach but it is much quieter. The buffet isnt brilliant (we had better in Havana) but it's not that bad either. Breakfast and lunch at the buffet are very good. Loads of choice and varied quite a lot from day to day. Evening meal in was a bit hit and miss, but the three times we went their, we found something that we liked. My only complaint would be that the food isnt labelled very well, not so much a problem for me, but some people might be fussy about eating something if they dont know what it is. I think I had frogs legs one night, but it could have been anything (tasted like chicken). The a la carte's are all ok too. Not a massive choice on the menu's, but it's enough. If all else fails, there are some good restaurants in Varadero town. For the last 4 days of our stay the hotel got a lot busier and things started to change. We had to put towels down before breakfast in order to get a space (something I hate doing). The service suffered a bit as well. The staff didnt seem as happy and more guests meant less attention for us. On the whole, we had a very good time and enjoyed Cuba. Our opinion might have been different if it had been as busy for the full stay as it was for the last few days.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "July 11, 2003", "id": 1134681}, {"rating": 5.0, "stay_parameters": "Stayed June 2003", "text": "got back about ten days now we went on the 11th june for 2 weeks and can honestly say we had the time of our lives ,on booking for cuba we did not know what to expect , what i mean is that we thought it was going to be like the greek islands or very third world like , but varadero is just like most resorts you have ever been to as there is plenty to keep you entertained , the beach is fantastic . the food well not being great there is always food to eat ,the bread they bake there own at this hotel is just superb ,and as for the animation team we got on great with most of them but some i may add tend to favour the ladies and dont really make the effort they should . but seriously go to cuba with an open mind ,and it will be rewarded with a great time ,and please book this hotel you will not be dissappointed...oh and one last thing my commanding wife she want to destroy my life ........", "title": "Get To This Hotel For FUN", "helpfulness": 6, "user": "woolly22", "date": "July 8, 2003", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "rooms": 3.0, "service": 4.0}, "id": 1131882}, {"rating": 5.0, "title": "Great holiday", "text": "My wife and I read the comments posted about the Brisas del Caribe, and we wondered if we had chosen the right hotel (regarding the food and the guests' attittude toward reserving their space on the beach). Well, we have just come back, and let us tell you that there are no such reasons to worry.", "helpfulness": 34, "user": "A TripAdvisor user", "date": "June 22, 2003", "id": 1104298}, {"rating": 4.0, "title": "Cuba and Brisas del Caribe", "text": "1st: the food is not as bad as some people would have you think. You have to remember that you are abroad, in a country with a different history, a different culture, and different food habits and tastes. So yes, it does not taste like mummy's food, but it tastes like Cuba. If you don't like the fried food, then there is usually some meat in sauce, and a selection of vegetables, crudites and salads. You can also have a simple plate of pasta from the cook - and all this in the main buffet hall without needing to reserve at the \"a la carte\" restaurant.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "June 18, 2003", "id": 1091586}, {"rating": 4.0, "title": "Bad weather good time", "text": "We arrived in Varadero October23,2005 on Cubana Air. When we arrived at the airport it did not take long to realize that my husbands luggage had not made the trip with us. We reported it at the airports lost & found.", "helpfulness": 9, "user": "A TripAdvisor user", "date": "January 28, 2006", "id": 4392896}, {"rating": 5.0, "title": "Love Rafael", "text": "To add to the suspense hurricane Katrina was hitting Cuba & moving on to Florida on the next day.", "helpfulness": 8, "user": "A TripAdvisor user", "date": "January 27, 2006", "id": 4390992}, {"rating": 5.0, "title": "Great Time", "text": "The next day we met with our Hola Sun representative Lucy & she said she would take care of everything.", "helpfulness": 10, "user": "A TripAdvisor user", "date": "January 25, 2006", "id": 4388581}, {"rating": 1.0, "title": "Dont Ever go to this hotel!...", "text": "By Tuesday she had found our luggage & also arranged for us to receive a 50 Cuban Pesos reimbursement for our trouble. Thanks to the wonderful service of Cubana Air.", "helpfulness": 6, "user": "Joanne M", "date": "January 24, 2006", "id": 4373479}, {"rating": 4.0, "stay_parameters": "Stayed January 2006", "text": "The staff at the Breezes Del Caribe were excellent. With the disappointing weather & the lost luggage We thought that the vacation was a lost cause. But we were surprised to find that if you made the most of it you could still have a good time.", "title": "Excellent Holiday!", "helpfulness": 12, "user": "winterpeg4", "date": "January 22, 2006", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 4370736}, {"rating": 5.0, "title": "Had a great time here", "text": "My wife and I have just returned after a weeks stay here. We thought the hotel was superb, very clean, very friendly staff and although the food was not top class you have to bear in mind this is Cuba. The a la carte restaurants were a lot better. The only fault we found was the 24 hour snack bar where some of the staff could be a little miserable at times. also one of the waiters on the night shift tended to sit with the guests and was reluctant to go behindd the bar to serve. He also appeared drunk on occasions. We went on a tour of Cuba on our first week and would recommend this rather than staying for two weeks at the hotel / beach. One other thing, beware of the Mosquitoes, there are lots of them.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "June 17, 2003", "id": 1090639}, {"rating": 3.0, "title": "Food Yummmyyyy - Not!!!!! Think again.", "text": "My husband and I have just returned from a 2 week break. Overall we thought the hotel facilities were very good and clean. We stayed in the old part and had no problems with it.On the whole the staff were very friendly in particular the entertainment team. However, the staff in the buffet were miserable and to top that up, the food was the worst we had ever tasted. OK so it's a poor country and they do their best with what they have but there is no excuse for serving raw meat and last nights leftovers for breakfast the next morning.The a la carte restaurants were a little better, especially the Fantasia but it was impossible to get reservations.We also found that as the hotel got busier, the staff found it difficult to cope and the hotel was less than half full. I would hate to imagine what it would be like at it's peak.A word of advise. Please please do not hire a car/moped etc. We hired a moped and the exhaust fell off. We refused to pay as this was clearly not our fault but they threatened to call the police and immigration so we were forced to pay up.On the whole we enjoyed our stay at the hotel and the beach was beautiful (infact on of the best we've seen) but by the end of 2 weeks we couldn't wait to leave, looking forward to a decent meal back home.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "June 9, 2003", "id": 1075102}, {"rating": 5.0, "title": "Weddings in Cuba", "text": ": We are now married.It was beautiful and the weather stayed nice the whole two weeks apart from a couple of torrential rain storms(all after 4pm). Our travel agent was thomas cook who were very helpful. We have had a few problems getting our wedding certificate(spelling errors,wrong d.o.b)please double check details if getting married. Would be glad to answer any questions.Hi there, We spent 10 glorious days in October 2002 in Brisas del Caribe (followed by 3 days in Havana). (Placed a review when we came back, is still there (Cathy and Richard) There were 2 weddings while we were there - we happened to meet one couple on the beach (in a darts contest with the dartboard hung up on a tree) the day after they married. Having already decided without doubt we will go back to Cuba - and stay at Brisas del Caribe again - it is only recently the idea of coming back married has really taken hold. Found one agent (Weddings of Wonder I think it was) who would arrange everything, at a cost of just Â£179 on top of your holiday! Have lost their details now. I would be so interested to hear the details of your wedding there and anyone else with the same experience. Please email.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "May 31, 2003", "id": 1032340}, {"rating": 5.0, "title": "Excellent", "text": "brisas was excellent me and my sister had our own room we had pizzas delivered nearlly every night.The food was ok but we had to get used to it,the beach was great lovely and hot and you could see the fishes swimming around our feet. The swimming pools were fab there was lots of games to play i was never bored, and the entertainment was good. but the best thing was my dad got married and it was excellent the ceromony was great and after when we went to the beach and had photos taken and a dolphin swam past!!", "helpfulness": 2, "user": "A TripAdvisor user", "date": "May 18, 2003", "id": 1020766}, {"rating": 5.0, "title": "the best hotel!", "text": "this hotel was amazing! It is possible to get sick because of the food. I do not agree with people who say that the food was terrible. I think that since it is a different country, they have diferent food. The beach is great! But you do have to get up as early as about 6 to get some seats. The entertanment is wonderfull. the rooms are clean and modern. the pool is nice. i highly recomend this hotel for family's with children and also for couples. If you are in between 20 and 30 and going with a group of friends, you might not enjoy it as much because there isint that much night life.", "helpfulness": 8, "user": "A TripAdvisor user", "date": "May 13, 2003", "id": 995056}, {"rating": 5.0, "stay_parameters": "Stayed November 2005", "text": "My partner and two children (age 8 and 4) have just come back from Cuba with First Choice. We have had the most fantastic time. Everything about this holiday was great. I was a bit worried about the hotel as I had read some bad reviews.", "title": "Fantastic Time", "helpfulness": 28, "user": "Beck01", "date": "December 16, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4245509}, {"rating": 4.0, "stay_parameters": "Stayed December 2005", "text": "Room - We stayed in the newer section of the hotel and the room was very clean and right next to the pool. The maid did a wonderful job of keeping our room clean and she really appreciated the gifts that we left her eg. toothpaste, shower gel etc.", "title": "What's the problem?", "helpfulness": 40, "user": "sunlovn_girl", "date": "December 12, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 4234699}, {"rating": 4.0, "title": "Excellent holiday!", "text": "It was very quite in this area, away from the main hotel which was great for the kids as it was quite during the evening.", "helpfulness": 33, "user": "A TripAdvisor user", "date": "December 8, 2005", "id": 4221837}, {"rating": 5.0, "title": "Don't listen to all those bad reviews", "text": "People - The people that work at the hotel are so friendly and make you very welcome. They made a huge fuss of the kids and we were really sad to leave them behind.", "helpfulness": 31, "user": "A TripAdvisor user", "date": "December 4, 2005", "id": 4161145}, {"rating": 4.0, "title": "A fantastic holiday again...", "text": "Food - I have to say that I was not expecting the food to be great and I was pleasantly surprised at the variety on offer. The whole family always found something to eat so we did not find the food a problem.", "helpfulness": 18, "user": "A TripAdvisor user", "date": "December 4, 2005", "id": 4160016}, {"rating": 4.0, "stay_parameters": "Stayed December 2005", "text": "Flew with Sunwing Dec 25 - Jan 1/06 - great airline!", "title": "Xmas at Brisas", "helpfulness": 10, "user": "thehotterthebest", "date": "January 22, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "service": 4.0}, "id": 4369768}, {"rating": 5.0, "stay_parameters": "Stayed January 2005", "text": "The resort was great. We stayed on the second floor facing the pool. Was not noisy as in previous reviews. It was close to the lobby, buffet and pool. There are two coffee bars in the lobby, one open 24 hours. The other 24 hour bar is located on the south end of the resort where food is available 24 hours. The walk is a short way, through a beautiful walkway of gardens. There is also a quieter pool.", "title": "Amazing time!!! Go to the Pirates Cave (nightclub)! ", "helpfulness": 16, "user": "addicted2travelling", "date": "January 22, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4369760}, {"rating": 4.0, "stay_parameters": "Stayed January 2006", "text": "We asked for a oceanfront room and the front desk gave us one at no extra charge. They were about $80.00 more per person when we booked. There are not oceanview rooms as the palm trees are big and they block the view. But from the balcony, you can hear the water.", "title": "Food decent and plentiful - stop complaining!!", "helpfulness": 12, "user": "StephC2006", "date": "January 21, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 4366857}, {"rating": 5.0, "title": "Hola", "text": "The staff are wonderful. Cuba is noted for its friendly people and our second time to the country, we were not disappointed.", "helpfulness": 12, "user": "A TripAdvisor user", "date": "January 18, 2006", "id": 4361901}, {"rating": 4.0, "title": "Welcome to Cuba!", "text": "The resort put on a fabulous New Year's Eve gala.", "helpfulness": 11, "user": "SUPERWOMAN_T.O.", "date": "January 17, 2006", "id": 4358933}, {"rating": 4.0, "title": "Loved it all", "text": "My husband and I just got back fom a seven day stay at your resort and we must say we loved it and are planning on going back. We chose this resort because of the wedding pkg. that was offered. Our daughter wanted to get married in Cuba. There was 12 of us and I don't think that anyone of us left unhappy.", "helpfulness": 23, "user": "A TripAdvisor user", "date": "November 29, 2005", "id": 4152383}, {"rating": 5.0, "stay_parameters": "Stayed November 2005", "text": "We will admitt that we were leary about going because of the reviews that we read from Sept till Nov. but we went with an open mind and had a blast. Yes the old part is exactly that OLD and yes does need some updates but it is very clean. The whole resort was quite well kept. The beach and pool area was fabulous.The dining buffet area was imaculate and there was always something good on the menu. Yes it was different than back home but just remember you were not at home but in another country were they cook different than us.The staff were wonderful. Our thanks goes out to the wedding consultant for putting on a wonderful wedding for our daughter. It was superb.And to William, we will remember you with a smile and I do hope that some day you get to visit us.Carlos thanks for being a friend to our daugther and her new husband.Just as a final note, if you are planning on staying at this resort try to end your evening with Showtime, they were great. Also try some of the day tours , Havana, jungle tour, and swimming with the dolphins were all excellent. Take a scooter and do a tour of Varadero, its all worth it.", "title": "Worth every penny and more", "helpfulness": 34, "user": "brapin", "date": "November 27, 2005", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 5.0, "service": 4.0}, "id": 4147170}, {"rating": 5.0, "stay_parameters": "Stayed November 2005", "text": "Will we go back...you bet we will. Thanks to all the staff.", "title": "Loved Brisas and will return... March/06", "helpfulness": 17, "user": "SandyManitoba", "date": "November 27, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 4146432}, {"rating": 3.0, "title": "First time to Cuba", "text": "I just came back from this resort Nov 26 and I thought it was wonderful. I went with my cousin we are both 22.", "helpfulness": 30, "user": "A TripAdvisor user", "date": "November 14, 2005", "id": 4111201}, {"rating": 3.0, "stay_parameters": "Stayed November 2005", "text": "Pools- there are 2 main pools next to eachother 1 pool is right next to the bar and it is like the party pool the entertainment is out there walking around and around 3pm they do some kind of event eg. Olympics (which was great. We jousted, Sumo wrestled, and they filled a bouncy jumper thing that kids play in at carnivals with soap and we tied our feet together and had to find straws in the soap), Volleyball, Dance Lessons all kinds of fun stuff for all ages. for quieter people there is a pool just over a little bridge. there is then a little kiddie pool that is about a foot deep. the 4th pool is over in the newer section and they teach the scuba lessons over there.", "title": "Not as bad as made out", "helpfulness": 26, "user": "JayneWiltshire", "date": "November 11, 2005", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "service": 3.0}, "id": 4105820}, {"rating": 4.0, "title": "Staff were so friendly", "text": "My wife and I and our two gilrs stayed at this hotel for two weeks from 9th to 23rd April 2003. It was just what we expected. Having read the reviews before leaving I e-mailed the hotel to request a room in the older part of the hotel. They replied promptly and we got exactly what we had requested when we arrived.O.K so there was'nt a great choice of food in the buffet restaurant but we all found something to eat. The a la carte restaurants were better. The biggest plus point for the hotel were the friendly staff, especially our chamber made Melba, she really took to our kids.The only real complaint I had about the hotel was the quantity and cleanliness of the sunbeds by the pool. A scrubbing brush and some detergent would not have gone a miss.Do not miss a visit to Havanah if you go to Cuba, an amazing experience.All in all we had a great holiday and would re-visit Cuba and this hotel.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "May 8, 2003", "id": 992378}, {"rating": 5.0, "title": "Awesome!", "text": "When I went to the Brisas del Caribe about 2 months ago I had the best time ever! I went with my mom(Im 19) not expecting to have such a good time but it turned out to be great! We had a room in the old section which I would recommend because it's close to everything unlike the new section which is on the other side of the resort. The best part of my trip was definately the staff especially the entertainment who always dragged me out to play volleyball or take dancing lessons. They even went with me and some girls I met there to the local disco in varadero called \"La Rada\" (I think thats what it was called) They came with us about 4 times and we had a blast together! Lee, Julio, Osmani, Coral and Jorge were just some of the entertainers who made my stay 100 times better!If anyone is plannign to go to Varadero, Brisas del Caribe is definately a good choice! Except for the food that was kind of gross:(If anyone is going to this hotel could you PLEASE tell Jorge, the tennis instructor, that Monica says Hello!!THANKS!!!and have a good trip!", "helpfulness": 1, "user": "Monika_Z", "date": "May 5, 2003", "id": 987889}, {"rating": 4.0, "title": "Little bit of heaven...", "text": "Brisas is every bit as nice as people have described it. I recommend it highly in almost all areas. Beach and Pools: This is the most important feature for this sun-lover, and the beach was amazing. For those who like a long walk, it never ends. For those who like to go out on the Hobie Cat, or kayak, peddle boat, there is lots to do. You have to go sign up, down on the beach, at around 9am to reserve your spot though...Rooms: I had asked for a room in the new section, based on the reviews here, and found, once I got there, that the new section was much too far away from \"everything\". If you want seclusion...go to the new section. If you want accessibility (to the beach, pool, restaurant, lobby and bars) book in the old. DO NOT accept a room in numbers 135-140 however as it is really close to the \"service room\" and that end of the hall smells... We had a room in the old section and loved it.Resort: The grounds are beautiful and are well kept. Beautiful gardens between the old and new sections...nice for pictures. Gym equipment is a bit old, but usable. Tours and Restaurants: As many have said before, book your free tours (Canimar River and Sunset Cruise) early. If they say it is already booked, be persistant. Get on a waiting list. It is definitely worth being nice to those who book these for you...they can pull strings. Olimpia and Maida are real sweethearts...Food: Ok, I went down determined to have a good attitude. And I did. However, even with all my determination, the food was definitely not their strong point. Much of their food is deep fried (to death), and what is \"healthy\" is swimming in butter... The meat (chicken, fish, beef, even shrimp) is cooked many hours too long. Being a chef myself, this was somewhat frustrating... The A la Carte restaurants are marginally better. Great atmosphere... OH, and amazing bread.Staff: Friendly. Some I tipped, many I didn't. They were all equally friendly and helpful. Hints: The travel mug i little plastic cups. And plan on giving it to your favourite staff as you leave. You can't get one in Cuba and you will make someone's day.The Cigar store on 64th street, is nice, air conditionned, state run...but will RIP YOU OFF if you don't know your prices. Individual Cohibas I bought for 12$ on 64th, I could get for 6$ at the airport...Don't bring plug in stuff for you room unless you have an adaptor. Every thing is 220. There are no alarm clocks, bring one. You have to get your towel on your beach chair by 7 or your out of luck.", "helpfulness": 7, "user": "Syl", "date": "May 1, 2003", "id": 986511}, {"rating": 5.0, "title": "Amazing", "text": "I stayed in Brisas in July 2002, and i must say that i had an INCREDIBLE time. There was lots to do, on and off the resort. The staff was very friendly and charming (and extremely good-looking) and always willing to extend themselves. In fact, members of the personel even accompanied my girlfriends and I to clubs. All in all, I had the time of my life.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "April 30, 2003", "id": 985736}, {"rating": 4.0, "title": "loved every minute of it", "text": "i just got back from the hotel brisas del caribe it was excellent the hotel was lovely and clean and the people are very friendly always there if u need help . around the main pool there was an entertainment team i loved them they were brilliant they really brought the place alive even though we went there for a wedding the rest of the holiday was fab and im only 15 i thought the entertainment team did a good job around the pool and also of a night time they are very hard workers and i would love to seem them all again . the food was quite poor but there is something for every one overall i enjoyed my holiday and will defenitley go back again", "helpfulness": 2, "user": "A TripAdvisor user", "date": "April 26, 2003", "id": 983266}, {"rating": 4.0, "stay_parameters": "Stayed August 2003", "text": "Brisas has a great location at the end of the Varedero peninsula. The gardens and beach are glorious and the small Caleta Grill restaurant has atmosphere day or night. The other restaurants lacked in atmosphere and intimacy and the food was OK but not great although there was always something worth eating. The pool and other facilities were fine and even finding sun beds was OK ( apart form the last two days when the August rush started) The evening entertainment left a lot to be desired, very cheesy! I guess we'd been spoilt by 7 days in Havana with all the fantastic bands there. If you're into dancing I'd recommend Club Mambo, a short taxi journey away with a great mix of Salsa and House dance music, an open bar and all for $10", "title": "Great Beach, shame about the cheese...", "helpfulness": 2, "user": "DarrellM77", "date": "August 8, 2003", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "service": 4.0}, "id": 1218976}, {"rating": 5.0, "title": "One Word- AMAZING", "text": "Varedero is pretty sterile after time Havana and you get no feel for the amazing Cuban people but for a rest on the beach after hectic Havana its great.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "August 5, 2003", "id": 1213369}, {"rating": 5.0, "title": "brisas was the best", "text": "I went on my first vacation out of North America at the beginning of May. A week at Brisas and every aspect of it was so great! I was there for my friends' wedding and I can't imagine a more beautiful place to be. The wedding coordinator was helpful, the staff were friendly, there was always something to do, the beach was great, even the food was pretty good.... But the animacion crew was definitely the highlight!", "helpfulness": 1, "user": "dancingjen", "date": "July 31, 2003", "id": 1155213}, {"rating": 5.0, "title": "Fantastic Wedding", "text": "They were amazing!! I can't wait to go back!", "helpfulness": 12, "user": "A TripAdvisor user", "date": "July 28, 2003", "id": 1150244}, {"rating": 5.0, "title": "Wow wow and WOW", "text": "the entertainment is the best thing there and danny is the best entertainer i miss the hotel sooo much", "helpfulness": 2, "user": "A TripAdvisor user", "date": "July 27, 2003", "id": 1149955}, {"rating": 4.0, "title": "Good Holiday", "text": "We had been to cuba before so we knew the food is not the main reason to go there.", "helpfulness": 27, "user": "A TripAdvisor user", "date": "January 2, 2006", "id": 4316862}, {"rating": 4.0, "title": "Good Value For the Money", "text": "Impressions:", "helpfulness": 25, "user": "A TripAdvisor user", "date": "January 1, 2006", "id": 4316151}, {"rating": 5.0, "stay_parameters": "Stayed December 2005", "text": "The first impression when we arrived at Brisas Del Caribe is this is an older hotel, but clean (There was always some one cleaning!). The check in was ok, but since we arrived at 12:30 (lunch) we had to wait until 3pm to get the room (official check-in time is at 4pm). Advice: pack some beach wear to change into if you are arriving before 4pm.", "title": "Don't Listen to the Complainers", "helpfulness": 29, "user": "BCPolarBear", "date": "December 27, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 5.0}, "id": 4301042}, {"rating": 4.0, "stay_parameters": "Stayed November 2005", "text": "Room:", "title": "Fantastic Wedding", "helpfulness": 19, "user": "Vickie31", "date": "December 19, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 3.0, "service": 3.0}, "id": 4251091}], "location": {"country": "Caribbean"}, "stars": 4, "variance": {"poor": 266, "average": 451, "very good": 705, "terrible": 205, "excellent": 378}, "aka": "Brisas Del Caribe Varadero", "slim_ranking": 0.576271186441, "detail_rating": {"service": 3.5, "cleanliness": 3.5, "value": 3.5, "sleep": 3.5, "rooms": 3.0, "location": 4.0}}