{"user_rating": 3.5, "review_count": 376, "name": "Brisas Sierra Mar", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed July 2011, traveled solo", "text": "I did go in july of 2012,so maybe this hotel is better on a more occupied month.First ,ride from airport to hotel is 1hr 30 very bumpy ride.Rooms are old ,mold on walls,they tried to patch up with paint,door and patio has a 2 inch gap,when it rains water gets in room and also insects.shingles on roof on hotel are broken and nevered maintained ,lots of water leeks to corridor and into rooms.(this is july,rainy season).Same food was repassed up to 4 days,buffet was setted at room temperature,full of flies.Beach very important to me and still can t figure out how people like it,its does compare to a lake beach in canada,more of a rough style beach sands not cleaned and floor of sea was slimy.Again internet in cuba is useless,do not buy time for net,you can retreive 1-2 emails in 1hr.I guess if you like roughing it ,its more for a camper ,lots of woods and mountains,beach resembles a camp ground.you are succlued area ,so workers come from the city ,if the bus driver calls in sick your stuck,taxi too will not come for 1hr drive unless you pay.i found excursions ,rentals and food offer by restos or locals are more expensive and not what you expect.", "title": "bad experience on my stay", "helpfulness": 16, "user": "ninefly", "date": "May 7, 2012", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 2.0, "sleep": 2.0, "rooms": 2.0, "location": 3.0}, "id": 129509501}, {"rating": 3.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "Overall my experince wasn t pleasant,i do travel to cuba often and yes,i didn t pay expensive,and i do see good comments,but i guess in high season it doesn t rain ,food gets consumed so no leftovers.I guess if you coming here between june and october ,take my review into account.", "title": "Watch out for the crabs...", "helpfulness": 11, "user": "harjinder_jeet", "date": "May 1, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 1.0, "rooms": 3.0, "location": 4.0}, "id": 129147264}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "Few pros and cons...", "title": "Awesone friends", "helpfulness": 10, "user": "penny899", "date": "April 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 128968668}, {"rating": 2.0, "stay_parameters": "Stayed April 2012, traveled with friends", "text": "Pros", "title": "so-so", "helpfulness": 7, "user": "phasolya", "date": "April 23, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 2.0}, "id": 128467062}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": ". Secluded", "title": "We have become repeaters!!!", "helpfulness": 15, "user": "bosslady65", "date": "April 9, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 127565002}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled with friends", "text": "Just returned from another great two weeks at Sierra Mar. Forget the road the resort is worth the rough ride. Food which has always been good has gotten better, the place is being cleaned up painting and fixing. The elevators although not operational are being worked on. Sunshine every day with temps in the high 20s to 30s. Staff as usual friendly and cooperative cleaning staff busy every day mopping and sweeping. Aways seemed to be 8-12 Cubans staying there but were not any problem. Resort was far from full mainly returnees but some new who mostly were very satisfied (Always a complainer or two) sometimes only about a dozen around the pool. Adofo's retaurant is a great addition and well worth a vist. Make no mistake this is not a five star resort but it is a great 3+ resort and a great bank for your buck.", "title": "Just keeps getting better", "helpfulness": 11, "user": "holberg", "date": "March 9, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 125847901}, {"rating": 3.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "We've been there for the past 5 years. The sand has still not come back under the water at the hotel's beach; best to walk about 100 yards on the public beach and go in there. Food continues to improve, staff are warm and friendly, most entertainment is good, but those poor dancers! The stage is now in a dangerous state - holes at the back, rotten floor that a tourist or dancer is going to fall through - - feel sorry for those dancers with years of training being subjected to such a dangerous situation.", "title": "Still needs attention to deficiencies", "helpfulness": 7, "user": "Meryl1234", "date": "February 27, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 125320306}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled with family", "text": "Work has begun on the road, but with the pope's visit, all equipment pulled away, so the improvements have stopped. They can't start again quickly enough!", "title": "Another unforgettable vacation!", "helpfulness": 14, "user": "Tonya K", "date": "February 26, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 125259428}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "Work is also going on (at a snail's pace) on the two main elevators. Going up and down the stairs helps to work off the wonderful ice-cream, but with luggage it's hell.", "title": "Wonderful", "helpfulness": 10, "user": "dan h", "date": "February 17, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 124720974}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "Food is good - Cuban tomatoes are wonderful! But running out of the main meat at dinner is a bad situation. Cuban speciality restaurant was better than the Italian one, this time.", "title": "wow !!!", "helpfulness": 12, "user": "ben s", "date": "February 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 124412008}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled on business", "text": "I travelled with Holasun from Toronto and the service from the check in and flight with Canjet was excellent. The staff that early in the morning were cheerful and made you forget you were in a line. At the Santiago airport, a package with room keys, resort bracelet and registration card made for a no fuss checkin. The safe keys were available at reception for 2 CUC per day (about $2,cad per day). The road was in good condition for about an hour of the one hour and forty minute journey. Some new culverts and crossings have been built and the rough spots are a combination of sand, gravel and asphalt. The hurricane helped dig some of those ruts a little deeper but the bus drivers do their best to keep the ride as smooth as possible. Reminds me of a couple of northern Ontario roads..The road equipment that had been working on the roads were moved to safety when Sandy came and has been needed elsewhere at the moment.", "title": "Hidden away treasure away from it all", "helpfulness": 23, "user": "wnethercott", "date": "November 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 146328166}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "The resort is built into the side of bluff. Done in levels with level five being the lobby, restaurants, pool, bank, shops, the stage show and 2 bars. We stayed on level three which put us two staircases of 20 steps each to get to most of the activities for the day. Elevators servicing the rooms has been replaced and they were just completing the facings with tiles. The service elevator behind the stage was working but you still needed to go down one level of stairs to use.", "title": "Subject: Brisas Sierra Mar Location:Guama Province, Cuba, Caribbean Title: We are 4 Times Repeaters and we LOVE it..!!", "helpfulness": 14, "user": "Roger S", "date": "November 12, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 145221304}, {"rating": 2.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "Our room, 329 was an oceanview which gave us a great shaded view in the morning to enjoy our coffee and a breathtaking view of the sunset every evening. Rooms were a little dated but were clean and comfortable. Beds were firm and ask right away for extra pillows because they were a little slim.There is a 110 outlet under the tv, but I did have a european converter that was helpful in the bathroom. Lots of towels for us and a courtesy basket with soap, body wash, shampoo, tissue.Even a couple of toothbrushes with paste for us forgetful travellers.Water was always the right temp for a shower and shower was perfect. The tv in our room was an older style but other guests had flatscreen. For being away from home, one of the stations was CTV Toronto, so we could keep up to date if we wanted to. There is no fridge or coffeemaker in the room, but the lobby bar is open 24 hours a day Air worked well and didn't make a lot of noise..A beach towel voucher is provided and it is up to you to keep track as it will cost you 25CUC if you misplace it. There are interconnecting rooms available for that family needing more space.", "title": "WOULD NOT GO BACK", "helpfulness": 19, "user": "Laszlo C", "date": "September 6, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 2.0, "sleep": 2.0, "rooms": 3.0, "location": 1.0}, "id": 139585973}, {"rating": 3.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "Restaurants had enough choices for even that fussy eater. We found the choices more varied at breakfast and lunch than supper for the buffet. There was a lunch counter at the bar that served hotdogs, hamburger, grilled cheese sandwiches, pizza and fries from 4pm until 1am. The eco restaurant at the beach was a secluded oasis with excellent burgers and salad. (bring your favorite salad dressing as there is very limited choice). The cuban restaurant was good and the mariposa was ok. There was always a good selection and everything was marked in english. If you were still in doubt, all the servers speak excellent english.", "title": "Expected more", "helpfulness": 7, "user": "Nikki M", "date": "August 21, 2012", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 137900860}, {"rating": 2.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "Pool was a good size with depths of one foot to about 3.5 feet. A volleyball net is set up most of the time.Lots of chairs were available but shade could be a challenge when the resort is full.", "title": "Not the place to be...", "helpfulness": 10, "user": "fanny c", "date": "August 1, 2012", "detail_rating": {"service": 1.0, "cleanliness": 5.0, "value": 3.0, "sleep": 2.0, "rooms": 2.0, "location": 5.0}, "id": 135995765}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "after we got through the road to the hotel all was well ...great hotel , service ,clean room ,smiling faces and a just all round nice atmosphere but grab this .....BEST FOOD I EVER TASTED IN CUBA AFTER SIX VISITS THERE.they never missed anything all was available . beach was not anything to brag about but a lovely pool , big hot tub . i would never advise anyone to arrive on night flight there ...road are terrible ...but apparently now starting work on them .did the scooter bit to nearby village , also horse and carriage ride to visit a cuban family", "title": "super hotel", "helpfulness": 9, "user": "yvonne481", "date": "April 7, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 127410840}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "always felt safe there .nice entertainment every night . special mention to etta and marylene in lobby bar two great waitresses who speak good english ,our sunwing rep was very present and pleasexercise ant .we would go back anytime . only neg. thing if you are one with walking problems ..this hotel has lots of stairs . there are elevators but we choose to walk ...our daily", "title": "Amazing place!!!", "helpfulness": 12, "user": "Howard B", "date": "April 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 127212255}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "exercise...must say the knees and elbows got a good workout ...awwwww the pina coladas were goooood. loved our trip thanks to their great staff for all the tlc.", "title": "First time visit amazing!", "helpfulness": 5, "user": "KenMcDonald171", "date": "April 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 127149961}, {"rating": 3.0, "stay_parameters": "Stayed April 2011", "text": "Hola!!! Just returned on March 28th from our first visit to Sierra Mar but certainly not our last!! This place is a gem as far as location, scenery, friendly staff etc. We have been to Varadaro before which the local Cuban's refer to as the \"Cancun\" of Cuba...how true! This place is authentic Cuba thru and thru. Certainly not the white sandy beaches (who cares anyways) but the location and scenery certainly make up for it. The hotel is clean with nice comfortable rooms all with amazing views of the mountains and ocean (one of the best scenic views ever!) Great showers, A/C, satellite TV.", "title": "Overall great resort. Very secluded, expensive fo Santiago excursion.", "helpfulness": 8, "user": "Manny7901", "date": "March 26, 2012", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 1.0, "service": 5.0, "rooms": 4.0}, "id": 126706720}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled with friends", "text": "Staff were very nice and very helpful. We really enjoyed the local Cuban music whether by the pool bar at happy hour or in the lobby during evening hours after dinner. Food was fine and no issues whatsoever with drinking water etc. An amazing place to chill out with a good book,while enjoying clean fresh air, clean ocean water and a sense of total peace and serenity.Totally safe to wander away from the resort....the local Cuban people were extremely friendly. Will definitely be back!!!!!!!! .", "title": "AWESOME!!!", "helpfulness": 13, "user": "Pierre H", "date": "March 20, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 126423693}], "location": {"country": "Caribbean"}, "stars": 3.5, "variance": {"poor": 37, "average": 79, "very good": 150, "terrible": 21, "excellent": 89}, "aka": "Brisas Sierra Mar Guama", "slim_ranking": 0.5}