{"user_rating": 2.5, "review_count": 1751, "name": "Britannia Manchester Hotel", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed December 2007, traveled with friends", "text": "We booked to stay at the brittania very last minute on Sat 1st Dec via the internet and due to nearly every city centre hotel in manchester being practically sold out of rooms did not get a bargain. I searched trip advisor for reviews of available hotels and they all pretty much said the same thing, very run down, poor, with the brittania rating poor but better than the other available options. So we decided to take a chance as we were only going to be staying one night. Check in was quick and hasstle free (we arrived just before 2pm) I had booked two executive doubles and how different were they ! We went to the first room which was extremely small very dreary and tired. It didnt say executve in any way to me. A maintenance guy called in to fix the tv remote so i asked him if all the rooms were like this, he replied \"no some are bigger\" so i expressed my disappointment to him. He then said he would get the duty manager for me and about five minutes later Duty Manager Cecile turned up. To cut a long story short she changed our room and moved us to another floor in a room next to the other room we had booked. Why these werent together in the first place i dont know but the second room was so much better. Big bright and airy and redecorated. It still wasnt extremely fancy but this is only a 3 star hotel so we were happy with our second selection. Now i think we were only accomodated because we checked in early if you turn up late you get whats left. Breakfast was average with a good self service selection ok if its in your room rate. The whole hotel is undergiong a refurb and this is going to take some time as there is a lot of work to be done. You can see how grand it use to be but how neglected it has become over the years. Once the refurb is complete all the rooms should be bright and airy instead of dull and drab. Overall i found the staff friendly from tv repair guy to duty manager cecile to receptionists and our stay was a pleasant one in the end. My advise book manchester city centre hotels well ahead if possible or get to the hotel early with time to complain if you end up in an un refurbed room :-)", "title": "Thankyou duty manager Cecile !", "helpfulness": 3, "user": "Derbyshire-MrsS", "date": "December 6, 2007", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 2.0, "rooms": 2.0, "location": 3.0}, "id": 11281348, "likes": {"liked": "— Central location walking distance from train station and into town centre", "disliked": "— Undergoing refurbishment but a long way to go before its complete"}}, {"rating": 1.0, "stay_parameters": "Stayed November 2007", "text": "Check in took 20 mins. They kept trying to force me to take a smoking room which I refused. Eventually, after much persuasion, they allocated me a bigger non-smoking room but it was really not great at all: There were dried on urine splashes on the toilet bowl, stains from faeces down the loo, and stains and mould on the tile grout by the shower. Two lamps by the bed did not work, TV buzzed constantly which made watching anything virtually impossible, socket by the TV did not work, smoke alarm was broken/cover missing, radiator/heating was not working so it was freezing, bed was uncomfortable with springs", "title": "In a nutshell, disgusting, disappointing & in desperate need of a refurb!", "helpfulness": 3, "user": "TheRealDeal4Hotels", "date": "December 5, 2007", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "location": 2.0, "rooms": 1.0}, "id": 11261571}, {"rating": 2.0, "stay_parameters": "Stayed November 2007, traveled with friends", "text": "poking through, pillows were flat, the loo roll holder was missing and", "title": "wouldnt go back!", "helpfulness": 2, "user": "Suzy656", "date": "December 4, 2007", "detail_rating": {"front_desk": 1.0, "business": 2.0, "service": 3.0, "cleanliness": 2.0, "value": 1.0, "location": 4.0, "rooms": 3.0}, "id": 11239180}, {"rating": 4.0, "stay_parameters": "Stayed November 2007, traveled with family", "text": "the icing on the cake in the morning...the shower was barely warm!", "title": "Better than expected!", "helpfulness": 2, "user": "calypso53", "date": "December 4, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 3.0, "value": 4.0, "rooms": 3.0, "location": 5.0}, "id": 11237266, "likes": {"liked": "— The exterior of the hotel was magnificent, especially when illuminated", "disliked": "— Not many lifts"}}, {"rating": 4.0, "title": "Would definitely stay again", "text": "My credit card was preauthorised for £50 for food & extras, but when I went to the restuarant I was told that there was no credit on my room (even though I had the credit card receipt to prove this!) and I would have to sort it out with reception!", "helpfulness": 2, "user": "PB2775", "date": "November 30, 2007", "id": 11166642}, {"rating": 1.0, "stay_parameters": "Stayed September 2010, traveled with family", "text": "This is one of the worst hotels that I have ever stayed in. If it wasn't for the fact that all other hotels were full on Saturday night we would have walked out. The room was circa 70s. It was meant to be an Exective Room which was laughable. I don't believe any executive has ever stayed there. There was no wifi or internet connections - in this day and age! The bathroom was grotty, mouldy and tiny. The bedroom was poorly equipped with the wardrobe (it is an insult to other wardrobes to even give it that title) had sliding doors which were off their runners and it was so shallow that clothes had to be hung facing you and overlapping. It was a joke. The windows were filthy inside and out with miserable secodary glazing that hadn't seen a duster in an awful long time. The walls were marked and the choice of pictures on the walls were just odd - they wouldn't have even been in fashion in the 1970s. The noise from the downstairs discos (weddings) prevented us sleeping and we were on the third floor. We were really glad that we weren't on the first or second floor. At £159 for a double room it was scandalous. I wasn't worth £59 never mind £159.", "title": "Do Not Waste Your Money At This Hotel", "helpfulness": 2, "user": "S_G_Taylor", "date": "September 20, 2010", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 3.0}, "id": 80239848}, {"rating": 2.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "We stayed in an superior room, which was very expensive, it had a double bed and a put me up bed for my 11 yr old son, rooms were spacious but badly needed decorating/updating, the tv was an old chunky thing which had 5 mixed up tv channels and the signal was rubbish. No wi fi unless you wanted to leave a 100 pound deposit for a lan card, the air con didnt work and got very warm and stuffy in the room we could only open the window slightly and they were filthy... looks very grand in the pics but not in real life. our 1st night we stayed and had dinner in 'jennys resturant' 3 courses for 9.95 (no seperate childrens price) the meat looked soooo dry so wasnt a good start, no atmosphere or background music apart from the nightclub next door, we did get a take away pizze from the pizzaria in the hotel which was very nice. we booked a taxi from the hotel to Man U stadium which cost 9 pounds... then after we toured old trafford we got a taxi to the Trafford Shopping centre (8 pound) the shopping centre is a great day out...fantastic huge building..lots of 'named shops' no little cheap sops for bargains though, it has cinema, bowling and laser quest (which was very fun)", "title": "No mod cons here...everything needs updating...3 course dinner awful", "helpfulness": 3, "user": "misstania28", "date": "September 6, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 1.0, "sleep": 3.0, "rooms": 1.0, "location": 2.0}, "id": 78551492}, {"rating": 2.0, "stay_parameters": "Stayed August 2010, traveled with friends", "text": "I will admit that the loaction is great but the hotel room itself was not good.", "title": "Cheap but not cheerful", "helpfulness": 2, "user": "Sarah-from-Newcastle", "date": "September 6, 2010", "detail_rating": {"service": 1.0, "cleanliness": 2.0, "value": 3.0, "sleep": 1.0, "rooms": 1.0, "location": 4.0}, "id": 78514594}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "OK, it was a bit old fashioned but we were suprised to find we were given a smoking room with no window which meant if you did smoke the smell lingered a bit. And it was boiling! We had the ventilation and the air con on full blast which was a bit noisy but made little difference.", "title": "With a bit of initiative we managed to have a great stay", "helpfulness": 2, "user": "roberthop", "date": "September 6, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 78451722}, {"rating": 1.0, "stay_parameters": "Stayed September 2010, traveled on business", "text": "And then there was the noise.We had just been to see a band and wanted a decent nights sleep as we were knackered. We were on the 1st floor I presume over a club because the music was pounding away until about 2.00 am. It got to the point where we had to put rolled up tissue in our ears to get some respite!", "title": "in dire need of renovation", "helpfulness": 2, "user": "yinkaade", "date": "September 2, 2010", "detail_rating": {"service": 2.0, "cleanliness": 1.0, "value": 2.0, "sleep": 1.0, "rooms": 1.0, "location": 3.0}, "id": 78045575}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "thought the hotel was very good value for money and liked how close it was to the city center will defo be stayin again very soon :)", "title": "very good value for money will defo be staying again next time im in manchester", "helpfulness": 1, "user": "kelz118", "date": "August 15, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 75312216}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "Booked our \"double executive\" room due to a friends birthday night out in Manchester. Checked in at 3pm with lovely staff at the Check In. We booked our room on Laterooms for £39, not expecting a window, however, when we got to our room, we were on the 5th floor with a huge window, looking at the Ramada and City Tower!", "title": "Nice atmosphere", "helpfulness": 1, "user": "ahilton", "date": "August 9, 2010", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 5.0, "sleep": 2.0, "rooms": 3.0, "location": 3.0}, "id": 74460955}, {"rating": 3.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "Lovely bathroom facilities too. Also a huge wardrobe which would have been put to very good use with a longer stay! Didn't eat at the hotel, as we are quite addicted to Pub lunches and there is a Yates just down the street!", "title": "As expected", "helpfulness": 1, "user": "Welbudj1", "date": "August 9, 2010", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 74453021}, {"rating": 2.0, "stay_parameters": "Stayed August 2010, traveled with friends", "text": "Came back to the hotel just before 11, and at 11pm, apparently security check ID as only guest sare permitted after this time - quite reassuring!", "title": "do not go,not even if you are desperate", "helpfulness": 1, "user": "mfilidoro", "date": "August 8, 2010", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 2.0, "sleep": 1.0, "rooms": 1.0, "location": 3.0}, "id": 74280861}, {"rating": 1.0, "stay_parameters": "Stayed August 2010", "text": "Back in the room, an incredible view of night-lit Manchester! Ridiculously comfy bed, only thing that woke us was the street traffic and the strange tapping on the door at 9am...", "title": "No customer service, noisy, dirty!", "helpfulness": 1, "user": "Mary0110", "date": "August 6, 2010", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 4.0}, "id": 74046517}, {"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled on business", "text": "I stay in Manchester a fair bit with work and have settled into staying at the Britannia - it's not the best hotel in town (not by a long way...!) but it's location in relation to everything - the best pubs are close by - make it ideal for me.", "title": "Be lucky and cultivate a love of buses", "helpfulness": 1, "user": "GazzatheGrumpy", "date": "July 7, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 4.0, "rooms": 2.0, "location": 5.0}, "id": 8072273, "likes": {"liked": "— Location", "disliked": "— Shabby rooms if you're unlucky"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2007, traveled with friends", "text": "The problems - they are undergoing a much needed refurb at the moment so various things are unavailable and/or being done up. The rooms vary a great deal from shabby, old, frankly iffy ones to fairly new and good quality ones, but it's pot luck what you get in my experience! The \"turret rooms\" sound good, as a previous reviewer said, but they're tiny and unrefurbished at present.", "title": "A nice setting for my 18th birthday", "helpfulness": 1, "user": "whambam8", "date": "July 1, 2007", "detail_rating": {"cleanliness": 3.0, "front_desk": 3.0, "location": 5.0, "value": 5.0, "rooms": 3.0}, "id": 8034573, "likes": {"liked": "— its location, its decor and its environment", "disliked": "— for what i paid and expected, nothing!"}}, {"rating": 2.0, "stay_parameters": "Stayed June 2007, traveled on business", "text": "Noise can be an issue particularly as most windows don't shut (or open) properly and if you get a low-floor room over Portland street you'd better like buses.", "title": "Boiling hot at Britannia", "helpfulness": 3, "user": "Muttley67", "date": "June 26, 2007", "detail_rating": {"front_desk": 3.0, "service": 2.0, "cleanliness": 2.0, "value": 1.0, "rooms": 1.0, "location": 1.0}, "id": 7999193, "likes": {"liked": "— Leaving it behind", "disliked": "— Room temperature"}}, {"rating": 2.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "Saying all that, my 10+ experiences have been good more than bad and as long as you don't expect something which isn't going to happen for the low rates then you'll (probably) be OK.", "title": "Britannia Hotel Manchester, So so", "helpfulness": 2, "user": "spfoto", "date": "June 22, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 5.0, "rooms": 2.0}, "id": 7960022, "likes": {"liked": "— Free room upgrade", "disliked": "— Tired look hotel"}}, {"rating": 2.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "Breakfast is a help-yourself and isn't bad at all with loads of choice, and the pizza restaurant in the basement stays open until around midnight and is reasonably cheap and not too bad... a bonus when most hotel food stops at 10:00 at the latest.", "title": "great location - train your people", "helpfulness": 3, "user": "Where to go nextt", "date": "June 8, 2007", "detail_rating": {"cleanliness": 4.0, "front_desk": 1.0, "location": 5.0, "value": 3.0, "rooms": 4.0}, "id": 7808168, "likes": {"liked": "— Location", "disliked": "— Some Incompetant staff"}}, {"rating": 1.0, "stay_parameters": "Stayed November 2007, traveled on business", "text": "I picked this hotel for convenience more than anything but I should of taken note of the reviews more.", "title": "Never be back", "helpfulness": 2, "user": "navigator", "date": "November 10, 2007", "detail_rating": {"front_desk": 2.0, "business": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "location": 5.0, "rooms": 1.0}, "id": 10727280, "likes": {"liked": "— Location", "disliked": "— Everything"}}, {"rating": 1.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "It was as everyone had said and I felt it was worse. From the outside it is a nice building spoiled by all the tacky signs for the bars. When you enter it looks quite elegent with its big staircase and chandeliers but on closer inspection, well!", "title": "Awful", "helpfulness": 2, "user": "GCLANNI", "date": "October 31, 2007", "detail_rating": {"front_desk": 2.0, "service": 2.0, "cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "location": 3.0}, "id": 10469458, "likes": {"liked": "— location", "disliked": "— everything else"}}, {"rating": 2.0, "stay_parameters": "Stayed October 2007, traveled solo", "text": "Checkin was ok but during the day when I needed info I was either passed form one person to another or just ignored to the point I walked off.", "title": "A 19th Century Experience", "helpfulness": 2, "user": "Sam146", "date": "October 29, 2007", "detail_rating": {"front_desk": 2.0, "service": 2.0, "cleanliness": 2.0, "value": 2.0, "rooms": 2.0, "location": 4.0}, "id": 10417803, "likes": {"liked": "— architecture and historic features", "disliked": "— overall aura of neglect"}}, {"rating": 1.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "When on the web site you see a standard room and a pic of a suite.", "title": "don't think your getting a bargin", "helpfulness": 2, "user": "boddies5", "date": "October 28, 2007", "detail_rating": {"front_desk": 1.0, "service": 2.0, "cleanliness": 2.0, "value": 1.0, "rooms": 1.0, "location": 3.0}, "id": 10392942, "likes": {"liked": "— nothing", "disliked": "— nothing"}}, {"rating": 1.0, "stay_parameters": "Stayed September 2007, traveled on business", "text": "I had what I believed a suite paid for but to my surprise, yes they call it the Lancashire suite but the room looked like a stantard and not the one in the picture. I would hate to think what the normal rooms wre like for size as this was very small., dark, tatty furniture, bathroom was small and needs an upgrade. It milldue around the tiles. Yuk.", "title": "A bit of a dump", "helpfulness": 3, "user": "Nick.Bubble", "date": "September 21, 2007", "detail_rating": {"business": 1.0, "service": 2.0, "cleanliness": 2.0, "value": 1.0, "rooms": 2.0, "location": 3.0}, "id": 8839668, "likes": {"liked": "— The fact I was only there for one night", "disliked": "— everything else"}}, {"rating": 3.0, "title": "not bad, not great", "text": "Me and my boyfriend booked a room at the Britannia as a stop-over on Valentine's day. It wasn't supposed to be a romantic luxury night, just somewhere to stay after a night out in Manchester. So therefore it totally fulfilled its purpose for us, as the location is fantastic, the room was clean and we got breakfast included. At the time I thought it was absolutely fine, but since then have stayed in better hotels in Manchester for a similar price! I recommend Great John Street for a stunning room in total luxury, because if you check out their last minute deals on their website their room prices are similar to Britannia anyway!", "helpfulness": 3, "user": "Crusoe_22", "date": "September 11, 2007", "id": 8693601}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "We stayed here for one night while on a theatre/shopping break.", "title": "Brilliant location!!!", "helpfulness": 2, "user": "ilovespain1", "date": "August 27, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 8517303, "likes": {"liked": "— The location", "disliked": "— A bit noisy"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007", "text": "The hotel had all the amenities we could have asked for, the staff were friendly and helpful but the best thing was the location. Yes it may have been noisy but was within walking distance of the shops, the theatre and lots of pubs!! What more could you ask for? Will definatly be going again!!", "title": "it was great staff were really helpful and the public bar is very cheap!!!!", "helpfulness": 2, "user": "daintydi", "date": "August 11, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 8394095, "likes": {"liked": "— the room had lots of space", "disliked": "— no sea view"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "I sayed here for my 50th birthday with 15 friends, and we had a great time. i had a suite ( £79 for room only)", "title": "Grand hotel for a quick stop", "helpfulness": 2, "user": "jameshayes", "date": "August 7, 2007", "detail_rating": {"front_desk": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 8366039, "likes": {"liked": "— Old building, very nice stairway", "disliked": "— Needs some work done"}}, {"rating": 1.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "It was lovely room the view wasnt great but we were in the centre of manchester! grey buildings........ as apposed to sea veiw??!! there isnt one in manchester city centre.", "title": "Never again", "helpfulness": 2, "user": "PatBelfast", "date": "July 27, 2007", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 2.0, "value": 1.0, "rooms": 1.0, "location": 3.0}, "id": 8241807, "likes": {"liked": "— Its location", "disliked": "— the whole experience"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "My boyfriend thought it was time to spring a surprise mini-last-minute break for us. We don't do the splash out spend a million pounds for 1 night options, we prefer, comfortable, nice with a chance to feel the buzz of the area. Manchester is only an hour away from our home town, so with the car packed we headed to the City Centre, not having a clue of where we were staying it was all the more exciting. As we headed into Piccadilly Gardens there in front of us was the huge Britannia Hotel, i mean huge, it spanned a good quarter of Portland Street. Built way back when when it was originally a cotton warehouse. The staircase and chandeliar is just mind blowing, and greets you as soon as you walk up the marble front steps. All the staff were lovely and helpful. My fella booked us a suite, it was a mini apartment, lovely size and plenty big enough for two, the spa bath was the bonus. Rooms could do with a bit of a lick of paint and maybe bringing upto date, then again, when you look at the building you realise that too modern would probably ruin it. Restuarant was nice too, eaten both in Jennys Bar and Overstuffed Pizza, would rather the pizza option as i found my Jennys bar meal, the chicken breast was too tough. Breakfast is a feast to enjoy", "title": "Lovely surprise break in city centre", "user": "Bear_1985", "date": "August 3, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 73603263}, {"rating": 4.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "I stayed here for 1 night with my husband on a child free escape, after getting a good b&b deal on line. Check in was fast with friendly staff.", "title": "Great location", "user": "atkibee", "date": "August 3, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 73567240}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "The location is spot on to enjoy Manchester city centre, and we had no problems with noise. We noticed people of all ages here, a good mix.", "title": "I cant wait until my next stay at this hotel!", "helpfulness": 1, "user": "montygoose", "date": "July 30, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 73055066}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "The hotel is old yes, but clean and nice stair cases. I thought it had a nice feel to it. Our room was perfectly adequate with a comfy bed but it was classed as an executive double, yet I'd say just average.", "title": "Great Getaway", "user": "bigbuckersUk", "date": "July 30, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 72955985}, {"rating": 3.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "The breakfast was great and plentiful, the usual hot buffet with lots of continental choices too including fruits, pastries and yoghurt. Quite a laid back affair hence the buffet but we were happy with this as all we were doing was escaping for the night!", "title": "very 'average' hotel!", "helpfulness": 1, "user": "steph7192", "date": "July 29, 2010", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 1.0, "sleep": 5.0, "rooms": 3.0, "location": 4.0}, "id": 72820562}, {"rating": 1.0, "stay_parameters": "Stayed August 2010, traveled with friends", "text": "Stayed for 6 nights. A camera and cash went missing from our room.", "title": "Nothing good about it, the rudest staff I've ever met", "helpfulness": 3, "user": "ant_manc", "date": "September 2, 2010", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 5.0}, "id": 77976819}, {"rating": 3.0, "stay_parameters": "Stayed August 2010", "text": "When I called to report it, had a crazy manager telling me I'm making it up, yelling at me that it was our fault (!) and hanging up on me. When I called again to get his name he refused to give me his name and so did the switchboard operator. The whole situation was so dodgy that I wrote a complaint to Head Office and now they said they'll investigate.", "title": "Ignore negative comments", "helpfulness": 1, "user": "AussiefanScotland", "date": "August 29, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 77317869}, {"rating": 3.0, "stay_parameters": "Stayed August 2010, traveled solo", "text": "Tired decor, old furniture (inc. beds), fan in bathroom and lights not working. Location is very central, hence extremely noisy from night clubs downstairs. If you hope to get some decent sleep you'll find it very hard.", "title": "Functionality in a central location", "helpfulness": 2, "user": "Gryphon1403", "date": "August 23, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 2.0, "rooms": 2.0, "location": 4.0}, "id": 76504998}, {"rating": 2.0, "stay_parameters": "Stayed August 2010, traveled on business", "text": "The building is amazing, but the staff couldn't be bothered more - don't waste your money on this one, there are so many other hotels around the area.", "title": "Extremely noisy", "helpfulness": 2, "user": "TheGastronaut", "date": "August 16, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 1.0, "rooms": 2.0, "location": 5.0}, "id": 75421924}, {"rating": 2.0, "stay_parameters": "Stayed August 2010, traveled with friends", "text": "Just returned from a 5 day break with David Urquhuart Travel and have to say I was pleasantly surprised with the Britannia Hotel. We were greeted on arrival by a very friendly member of staff. Our room was much bigger than we expected and very clean, if a little worn round the edges. Tea making facilities and toiletries were topped up every day as were clean towels. Food was of a good standard for a coach tour and staff were very friendly.Right in centre of Manchester, you are only a few minutes walk from Arndale Centre and lots of restaurants. Only downside was that Manchester have ceased to operate their \"Hop on Hop Off\" bus as as we were on limited time did not get chance to get all round sights we would have liked to see. Our tour with Urquhuart was excellent value for money and only downside was the driver!! He had no local knowledge at all and was late getting us everwhere. No people skills and when he introduced himself as Tim \"The Hun\" most of us were not amused!! But apart from that we had a great time,and if you ever go to Liverpool go the the Albert Docks. The museums are so interesting. We didn't even make it as far as the shops on this trip!! Trip to Bakewell was spoiled by very bad weather but looked a lovely little place to visit.", "title": "OK HOTEL IF YOU GET A DEAL!!", "helpfulness": 2, "user": "bob1323", "date": "August 15, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 1.0, "rooms": 2.0, "location": 5.0}, "id": 75321875}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "stars": 3, "variance": {"poor": 330, "average": 402, "very good": 360, "terrible": 547, "excellent": 112}, "aka": "Britannia Hotel Manchester", "slim_ranking": 0.745762711864, "detail_rating": {"service": 3.0, "cleanliness": 2.5, "value": 3.0, "sleep": 2.5, "rooms": 2.5, "location": 4.5}}