{"user_rating": 4.5, "review_count": 86, "name": "Britt Scripps Inn", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "This place was so much fun to stay at! The breakfast is incredible and the staff is so very accommodating. We would love to visit again!", "title": "Romantic and charming", "helpfulness": 1, "user": "SoTravelHappy", "date": "June 2, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 111034978}, {"rating": 5.0, "title": "\"Absolutely exquisite\" is how I would describe our stay at the beautiful Britt Scripps Inn.", "text": "This inn is lovely...in every way. The people working there were kind and helpful. The room we stayed in was beautiful. In fact, I got to see every other room, and they are all beautifully decorated. Breakfast time in the morning is inviting and relaxing...and delicious! Not only is the food delicious, the presentation of the food is thoughtful. The scone, for example, is presented on a plate with jam and clotted cream on the side, and fruit and dainty flowers embellish the plate. The other thing that I loved about this inn was that in the afternoon, they serve wine, cheese, crackers, and other goodies. These are served in the parlor (living room) where all the guests gather and enjoy an opportunity to talk and get to know eachother. In fact, this is how we were able to see every other room. We showed one another our rooms. All the other guests we met truly made an impression on us...they were funny and kind; really, a delight to meet them. In fact, we exchanged e-mail addresses with one couple. We really hope to go again, if we are able to get a deal again through Livingsocial.", "user": "A TripAdvisor user", "date": "May 31, 2011", "id": 110847928}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "We live in San Diego, but have always been intrigued by this inn. I decided to surprise my husband with a night's stay for his birthday. Everything was perfect! We stayed in the Aesthetic room which was gorgeous and the bed was very comfortable. The wine/cheese in the afternoon is such a nice perk and the breakfast was amazing. We hope to stay again!", "title": "What a wonderful local gem!", "helpfulness": 2, "user": "mere811", "date": "May 22, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 109395255}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "We were greeted at the door by Martin, who couldn't have been more accommodating. We arrived just in time for evening cheese and wine---delicious! Had beaucoup restaurants to choose from for dinner, as the inn is so convenient to whatever food your heart desires. Our room was absolutely grand and so true to the Queen Anne period. Our breakfast was superb, with Sarah as hospitality host with a capital H! A perfect B&B experience!", "title": "Details, details, details! This inn got it right! Every thing was perfection---highly recommend.", "helpfulness": 1, "user": "akmitchell48", "date": "May 9, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 107474639}, {"rating": 4.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "My spouse found this B&B/small hotel via Expedia when booking our plane tickets and it was a pleasant surprise as we did more research to learn that it was just a couple of blocks from the entrance to Balboa Park (a plus as my spouse is an avid runner). We stayed in the carriage house for a bit more than a week and as others have remarked, it is a little short on seating space. The only other issue with the carriage house, which I suspect isn't true in the main house, is that the wi-fi is a bit slow. The bed was fabulously comfortable, though.", "title": "Quiet, charming, great location", "helpfulness": 1, "user": "anne_dougherty", "date": "February 28, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 98422822}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "Stayed here for one night in March to celebrate our wedding anniversary and enjoyed it very much. Although we live in San Diego, we wanted to sleep somewhere else to celebrate our anniversary and this was the perfect place! The property is very unique and has undergone extensive restorations that make it lovely. We stayed in the Balboa room which was very large, elegantly appointed and distinctly victorian. It had a king sized bed that was very comfortable but it seems the mattress might need replacing soon, as I thought I sensed a bit of a sag in the middle. We had a private balcony off the room which was a great place to sit in the morning. I found the bathroom, while charming with its pedestal sink and clawfoot tub, to be a little small. With there being no counter to place toiletries, it was a little challenging to get ready for our evening out. And while I'm sure bathing in a claw foot tub would be quite a unique experience, showering was challenging because it's so compact. There was also an unpleasant odor in the bathroom but I didn't mention it to the innkeepers since we stayed only one night. The room was very quiet expect for the occasional plane flying over in the morning since this area is below the flight path for the airport. That being said, it's also in a great location because it's close to all of the great restaurants in Banker's Hill and downtown. The room was also very dark in the morning due to the blackout curtains, which I loved. I enjoyed the evening wine and cheese reception and it's touches like this that make staying in B&Bs so worth it! In addition to serving great wines, it was nice to chat with other guests staying at the B&B. There was a tray of freshly baked chocolate chip cookies always available in the parlor which was great as well.. The grounds are beautiful and taking breakfast on the front porch was absolutely lovely. My husband brought a bottle of champagne so that we could enjoy it with breakfast and the staff had no problem chilling it for us. We both enjoyed the breakfast that was served; a scone and fresh berries, fresh orange juice, an omelet for him and eggs for me. I wasn't offere tea but would've liked some because I start all of my days with a cup of it. I'm not sure if they don't offer it in general or just didn't offer it to me. Check in and check out went smoothly and they even extended our checkout time until 1:00 which allowed us to enjoy a leisurely morning. Overall, I would recommend the property for a unique getaway, though it is a bit pricey.", "title": "Romantic Getaway", "user": "LuvSLO", "date": "March 29, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 126918775}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "We LOVE Britt Scripps. The restoration that has been done on this beautiful home is outstanding. And their service is excellent. The linens were wonderful and the claw foot tub was so fun. If you appreciate history this is a great place. We cannot wait to go back.", "title": "Amazing antiques", "user": "Karimark_12", "date": "March 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 126693301}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "An absolute delight in every way. The Victorian house is beautifully restored with breathtaking attention to detail - the decor, furnishings, ornaments - everything is in keeping with the era but without the cloying kitschness sometimes associated with victoriana. The bed was super comfortable, the linens luxurious, the bathroom a joy. The service was friendly and efficient and we couldn't fault the breakfast - homemade muffins and granola and hot food perfectly cooked to order. The staff were quite happy to serve us in the pretty garden where we could smoke without bothering other guests. A relaxing retreat close enough to the city to be convenient but far enough to be peaceful.", "title": "Authentic San Diego history", "user": "LynnBarbee", "date": "March 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 126164675}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "This is a small, quaint operation. The rave reviews on service from Frommers may lead one to expect a Four Seasons type experience. This is not that. It is personal service from a very small staff at a 9 guest B&B. We did not receive turn down service either night that we were there, for unknown reasons. If you want turn down service, best to request it.", "title": "Quaint B&B in a real Victorian Home", "helpfulness": 2, "user": "alohadawn", "date": "February 16, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 124671209}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "The breakfast was very nice, served in the dining or living room; -starting with good coffee, fresh baked muffin or scone, berries and cream, followed by your choice of two egg entree's of the day and a homemade granola/yogurt option. The evening wine and cheese is offered, self service, from nice trays in the home's elegant small living room. There was no one playing the piano, ever, during our two night stay over Valentines weekend. The recorded music played in the common areas and during breakfast is \"standards\" muzak... Not too offensive, familiar, but gentle classical would have been an improvement.", "title": "Historic, Charming House with Helpful Staff", "helpfulness": 1, "user": "mmullins0767", "date": "February 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 124536311}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "This is a top notch bed and breakfast. The home has been renovated in beautiful details. The staff is friendly and the food is amazing. Will definitely go back again!", "title": "Wonderful", "user": "1suelu", "date": "January 31, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 123942556}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled with family", "text": "This B&B is in a great location, near the museums, theaters, restuarants and Balboa park. It is a very nice old house that has been renovated. The breakfasts are excellent, and the staff are very helpful. I will definitely go back when I am in SD.", "title": "Graet place to stay in SD", "user": "delidog", "date": "January 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 123083583}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "We looked for a special place to stay in San Diego for our 50th Wedding Anniversary. We found it and some! This 1887 Victorian bed and breakfast has nine bedrooms that are fully updated and very nice. We stayed five nights in the \"Garden Room\" and enjoyed every minute of it. Each morning we were served a gourmet breakfast starting with fruit, yogurt, and a scone or croissant. This was followed with a gourmet egg dish prepared by Paula, a very talented chef. From 5:00 to 7:00 each evening the staff serves hors d'oeuvres of meats, special cheeses and crackers with wine. The staff was very attentive and took care of our every need. The location of the B&B is perfect, and only two blocks from Balboa Park and several very good museums and restaurants. We will definitely stay at Britt Scripps Inn the next time we are in San Diego.", "title": "A Perfect Delight", "user": "boballee", "date": "November 17, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120717019}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "The Britt Scripps is such a beautiful property...a gorgeously restored Victorian home. The rooms are all different but the Gothic is why I chose this Inn for our night out. This is not Halloween Gothic, but classic sumptuous and luxurious Gothic. All the comforts you need plus ambiance galore. There is a lovely wine and cheese hour in the evening and breakfast in the morning. The breakfast, for me, is the only weak spot. It was good, just not great. I would be remiss to forget mentioning Al, our host for our stay. Pleasant, efficient, helpful....yet always unobtrusive. It is located right by Balboa Park and there are many restaurants within walking distance and of course a very close Starbucks. I would return in a heartbeat (and indeed already have plans to do so!).", "title": "Very sexy room!", "user": "Shoshin", "date": "October 31, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 119944939}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "We have just returned from a 5 night stay and thought this place was excellent. We stayed in the Garden Room and although it didn't look as elegant as the other rooms it was very comfortable and as we overlooked the garden was very quiet. We didn't have a car and although it had excellent access to the park it was quite a walk from the Gaslamp area, which wasn't a problem during the day as it was quite a pleasant walk but we wouldn't have felt comfortable at night. So like when we went to the baseball it meant paying for a taxi which could prove to be quite expensive if you planned to spend your evenings in this area. The breakfasts were brilliant and as I do not eat meat or eggs the granola and the scones we delicious. We really only dealt with Martin during our stay and he was brilliant and nothing was too much trouble. We do not see how you could be disappointed with this place its excellent.", "title": "LOVED IT!!", "user": "auntie-ellie-22", "date": "September 25, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 118576951}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled on business", "text": "I stayed at the Inn because it was close to a business office I attended. I have stayed at a number of B&Bs and this one is exquisitely cared for. There was no sense of it being run down as many B&Bs can be. It was exquisitely furnished with lovely antiques. There is the most beautiful two story stained glass window next to the stairwell.", "title": "Lovely and comfortable. Nice location", "user": "berniss", "date": "July 30, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 3.0}, "id": 116002581}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "The main floor includes an inviting living room, a large foyer, a breakfast room, and a kitchen and a couple of guest rooms. The second floor has all guest rooms. I stayed in two rooms: the Balboa and the Renaissance. Each are included in the deluxe category and are the largest in the Inn. The Balboa was the original master suite and includes a large bedroom and bathroom, with plenty of storage and a balcony. It was tastefully decorated and had terrific light. My only complaint was that there was no rim or table in the bathroom to put your soap comfortably when taking a bath in the large soaking tub. The Renaissance room was even prettier, but a tad smaller. While the bathroom was smaller, it was actually better laid out. My only complaint with this room was that the lighting was a bit dim.", "title": "Wonderful, elegant inn.", "user": "Catchrider", "date": "July 29, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115979136}, {"rating": 3.0, "stay_parameters": "Stayed April 2011, traveled with family", "text": "I found the Inn very quiet. You could get to Old Town in 5 minutes, the airport in 10 minutes and walk to Balboa park and nice eating places.", "title": "Disappointing!", "helpfulness": 5, "user": "patsbosoxfan", "date": "July 27, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 3.0, "value": 1.0, "service": 3.0}, "id": 115873878}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "I thought the breakfasts were lovely. A bottle of Voss water was included in the room. I wouldn't hesitate to stay again.", "title": "Loved it, but the bed was too soft! Also Expedia warning.", "helpfulness": 3, "user": "Kjpelletier", "date": "July 14, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 2.0, "value": 5.0, "service": 5.0}, "id": 115373524}, {"rating": 3.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "The Inn should do something about their computer system as it is has glitches and doesn't handle automatic reservations well.", "title": "Beautiful place - but would not stay here again", "helpfulness": 4, "user": "sandrita55", "date": "June 10, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 5.0}, "id": 112617982}], "location": {"country": "United States"}, "variance": {"poor": 2, "average": 6, "very good": 17, "terrible": 3, "excellent": 58}, "aka": "Britt Scripps Hotel San Diego", "slim_ranking": 0.303703703704, "description": "Welcome to Britt Scripps Inn, a distinctive retreat located in the heart of historic Bankers Hill overlooking downtown San Diego. We have created a place where Victorian-era charm and elegance blend seamlessly with modern day luxuries, to provide our guests a lavish alternative to the typical bed and breakfast or boutique hotel."}