{"user_rating": 4.0, "review_count": 1201, "name": "Broadway at Times Square Hotel", "reviews": [{"rating": 5.0, "title": "Fabulous", "text": "Extremly good vbalue for money...good breakfast and very courteous staff", "helpfulness": 1, "user": "SameerSah", "date": "May 11, 2009", "id": 29746206}, {"rating": 4.0, "stay_parameters": "Stayed May 2009, traveled on business", "text": "Stayed here about 16 months ago. The same lady who worked the front desk last time was still there and remembered me. Also the man who takes care of the continental breakfast area was there from 16 months ago. The fact that both employees were still there speaks well for the hotel in my opinion. Make sure you ask for a room NOT facing the street as it can be very noisy in the middle of the night otherwise. Rooms in the rear of the hotel are quiet though. I would reccommend this hotel for the excellent location and clean comfortable rooms. Rate I booked one month before trip was $189 a night. Two days before I left I checked on-line and the rate had dropped to $149 a night and I called and they adjusted the rate for me no problem.", "title": "Best Bang for the Buck", "helpfulness": 2, "user": "livetoski", "date": "May 6, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 3.0}, "id": 29499152}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled with family", "text": "My teenage daughter and I make a yearly trip to NYC to shop and see Broadway shows and for the past 3 years we have stayed at the Comfort Inn Midtown! The location is wonderful, rooms are comfy and quiet and service is great! My only complaint is the frosted bathroom doors and we fix that problem by getting brochures from the lobby and taping them to the door for privacy!! A great hotel for a great price!", "title": "Best Hotel in New York City!", "helpfulness": 2, "user": "PTOFan", "date": "May 6, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 29495887}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "excellent location, the staff is impeccable, I strongly recommend, when you return to NY I will be in the same hotel, so need to repair the elevator and it does not have air conditioning and e very slow, with regard to the rooms and bathrooms are good and very clean and spotless", "title": "Location - Great Staff - Location", "helpfulness": 1, "user": "CarlosViseu_Portugal", "date": "May 5, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 29406084}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled with family", "text": "Just returned May 2 with teenage son. This was the perfect place. Just as good as hotels that charge 2 or 3x more. Room updated and clean. Bed very comfy. Absolutely no problems. Everything very close within walking distance. When returning to New York will stay at this hotel. Jovannie at the front desk very helpful and pleasant. In fact all staff very friendly. Like someone said before a hidden gem in the middle of New York.", "title": "Location - Location - Location", "helpfulness": 4, "user": "PaFrequenttraveler", "date": "May 3, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 29246250}, {"rating": 4.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "My wife and I stayed here for one night while we were in New York to see some shows. While we didn't have to pay full price for our room due to points earned on a credit card affinity program, we would nonetheless definetely consider staying here next time we're in New York City. This hotel isn't fancy, certainly, but it has everything you would want for a comfortable stay. The front desk staff is exceptionally friendly and helpful for an establishment of this sort. The room is small, and a \"real\" window with a view of something beside the ventilation shaft would have been nice, but everything was extremely clean and well maintained. The bathroom was large and well-supplied. The television set, air conditioning, coffee maker, and clock radio worked fine, and seemed quite new. Indeed, the whole room seems to have been updated and refurbished faily recently. There was even an extra pillow for both of us! There was a nice complimentary continental breakfast, and an excercise room and internet room (which we did not use). For a hotel at this level, you really couldn't expect more. A great location as well; I couldn't believe how close Times Square was! The $23 special rate for overnight parking (in a very modern garage across the street) was quite reasonablr, as well, for New York (about half what it would have cost otherwise).", "title": "Nice simple, friendly hotel with a great location", "helpfulness": 2, "user": "revjeff", "date": "November 13, 2006", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 5.0, "rooms": 4.0}, "id": 6120808, "likes": {"liked": "— great location, friendly staff", "disliked": "— no real window, no view"}}, {"rating": 3.0, "stay_parameters": "Stayed October 2006, traveled with friends", "text": "I really liked the place, abit dated in decor but it feels warm and doesnt have the sterile feel like alot of chain hotels have.", "title": "A Handy place for a visiting Manhatten", "helpfulness": 1, "user": "Sunshine2907", "date": "November 11, 2006", "detail_rating": {"front_desk": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 6107299, "likes": {"liked": "— The location", "disliked": "— lacked a proper cooked breakfast."}}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled with family", "text": "The room service was good with comfy beds.", "title": "Excellent location", "helpfulness": 1, "user": "tarra", "date": "November 2, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 6045960, "likes": {"liked": "— Location", "disliked": "— Lifts"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "Be warned of the Receptionist though, He's an anglophile - and loves all things British, constant refrences to the BBC's \"keeping up apperences\" made me laugh.....", "title": "Good Value and Great Location", "helpfulness": 1, "user": "Davewight", "date": "October 29, 2006", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 6025957, "likes": {"liked": "— Location"}}, {"rating": 3.0, "stay_parameters": "Stayed October 2006", "text": "i would recommend this hotel.", "title": "What a location!", "helpfulness": 5, "user": "Loulabelle44", "date": "October 27, 2006", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 5.0}, "id": 6017611, "likes": {"liked": "— Location"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "Stayed at this hotel after finding it here on Trip Advisor. It was clean, convenient and well priced. Less than a block from Times Square. Great breakfast; great staff; very clean and great value for the money.", "title": "It's All Good!", "helpfulness": 1, "user": "Trisha4591", "date": "May 31, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 31246579}, {"rating": 4.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "We stayed here twice in May, and it is a great place to stay, just around the corner from Times Square but in a quiet and safe street. Sure, the rooms are small, but they are clean, well appointed and modern. We stayed in king rooms, and I would recommend the rooms facing the street as they are larger and lighter. There is a little noise in the street facing room, mainly early in the morning when the gargage trucks go by, but most of the time it is not a problem. There is a flatscreen TV in the room, coffee and tea making facilities, plenty of drawer space, and the bed is very comfortable. Wifi is free in the rooms and throughout the hotel, and also a computer room with 2 printers for guest use which is great for those travelling without laptops. The breakfast is great, cereal, toast, a range of pastries and bagels, waffles, boiled eggs, fresh fruit, juice and coffee. Coffee and Tea is available in the breakfast room throughout the day. As others have commented, the breakfast room is small, but we never had to wait long for a table and most days didn't have to wait long at all. The staff member working in the breakfast room is very friendly, makes sure the food is replenished regularly and keeps the area clean. We found all the hotel staff to be friendly and helpful, and they will securely store your luggage if you have a late flight etc. The location here is fantastic, and while the rooms may be small, it is New York and value for money this is a great hotel. Highly recommend !", "title": "You cant beat the location and the staff are great.", "helpfulness": 2, "user": "Australia07", "date": "May 31, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 3.0}, "id": 31240854}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "I've been looking through Trip Advisor and elsewhere for affordable Manhattan hotels for our upcoming long weekend in New York City, and I think I finally realized that one can't improve on near-perfection. That's why my choice will be, for the fourth time in five years, this comfy, well-priced (for New York!) hotel in the best location in the City! The rooms are clean, comfortable, and attractive, and the staff is very attentive, (and like other reviewers mentioned, the same staff members seem to be there every year, including the gentleman who mans the busy breakfast area and is very attentive to his job.) We find you just can't beat the location, price, and free breakfast. My husband loves to get up early every morning and run around the corner to Rockefeller Center to see the Today Show. We've walked easily to Broadway shows, seen the Naked Cowboy on Times Square a couple of hundred yards away, and dined at the excellent restaurants in the area (great Italian restaurant across the street and the Scottish Saint Andrews Pub with affordable dinners and wonderful atmosphere around the corner.) We've easily caught the nearby subway to Central Park, the Village, and Battery Park. It has always been home away from home for us, and we truly appreciate this great little hotel.", "title": "Can't improve on near-perfection, planning my 4th stay....", "helpfulness": 3, "user": "CapeKim", "date": "May 28, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 31049143}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "It is a bit risky choosing an inexpensive hotel in a good location in NYC. The Comfort Inn Midtown was a real winner for us. First of all, location was perfect - a half block off of Times Square. Next best thing was the friendly and very helpful staff. How pleasant it was to NOT see signs of frustrated, tired empolyees. They all went out of their way to offer help - especially \"Sidibi\" the bellhop.", "title": "Comfort Inn Midtown was a winner!", "helpfulness": 4, "user": "Cinque44", "date": "May 17, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 30158991}, {"rating": 4.0, "stay_parameters": "Stayed May 2009, traveled with family", "text": "The rooms were crisp & clean and nicely furnished. Not all rooms were spacious like ours. We at first were assigned to a rather small room toward the back part of the hotel. We simply asked if there was another room with more space or a window view. They said there was (a handicap room), but that it was not yet ready. We gladly waited (sightseeing on Times Square). We were given room 602 with 2 windows with a view. Four days later 602 was needed for a handicap person and we gladly moved to 802. They actually moved all our things for us to the new room so that we could be on our way . Both rooms were spcaious and comfortable with lots of closet & drawer space. But keep in mind - this is New York where space is at a premium. About the only complaint we had was that the dining area was too small. But the food was good. So yes I would definitely go back to this hotel - and ask for a front room facing the street. We did not have any street noise the whole week we were there.", "title": "Great location & value", "helpfulness": 2, "user": "Vespette", "date": "May 16, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 30093545}, {"rating": 4.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "We stayed at the Comfort Inn Midtown from 21st-25th September this year. The location of the hotel is superb being only 1/2 a block from Times Square. Our room was on the 7th floor and was quite bright. The room was larger than I expected and both the room and the bathroom were spotless. There were coffee making facilities which were replenished daily and an ironing board and iron in the room. All of the staff I had dealings with were polite and friendly. The free buffet breakfast consisted of bagels, toast, pastries, doughnuts, cereal, fruit, coffee and juice, all of which was replenished constantly. There is a complimentary fitness room with 3 cardio machines and a business room with 2 computers which offer free internet and printing. I would definitely recommend this hotel to others and would be very happy to stay here again.", "title": "Great Location, Excellent Value", "helpfulness": 3, "user": "Helking", "date": "October 25, 2006", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 6009141, "likes": {"liked": "— LOCATION!", "disliked": "— Breakfast room slightly small, sometimes had to wait for a table."}}, {"rating": 4.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "Footnote: Rosie O'Grady's Steak house a couple of doors down serve excellent food in a nice atmosphere, and O'Briens Irish Bar across the road is a great place for pre dinner drinks or for a night cap - very friendly!", "title": "So close to Times Square A must stay at!!!", "helpfulness": 2, "user": "dplnortheast", "date": "October 21, 2006", "detail_rating": {"front_desk": 1.0, "business": 3.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 5981870, "likes": {"liked": "— LOCCATION LOCATION LOCATION", "disliked": "— basic style hotel but still within the comfort inn guidlines and looks:)"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled with family", "text": "This is a nice place and i would stay there again for sure, the elevator is broken alot and as long as you ask for a room on the highest floors available you will be able to see past the comfort inn sign they have on the from of the building!!!! also, ask for a room on the front of the hotel not the back, the back looks out onnto a alley and tltho not bad, its not fun to look out to a brick wall when you are in the CITY!!!! all the rooms on the front tho are one bed so our boys slept on the CLEAN NIC KEPT FLOOR!!! the hotel even offered us free extra blankets and pillows for us!!!! along with the room is a clean bath bigger then i planned on being in the city and all and the room was basic but great great location only 1/2 block from times square!!! check in is not overly friendly but you dont pay for that since the prices are pretty low for you where you are staying!!!!", "title": "Highly recommend this hotel!", "helpfulness": 3, "user": "Princess78", "date": "October 17, 2006", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 5964031}, {"rating": 4.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "Myself, my mother and my sister stayed in this hotel for 5 nights while on a shopping trip. It is in an excellent location and terrific value for money. Everything is within walking distance, broadway, 5th Av, Macys, Port Authority etc... Breakfast was included in the price which included bagels, cereal, pastries etc.. and the guy looking after the breakfast was great and don't forget to tip him! There was free computer and internet access...very handy. The room and ensuite were clean and tidy, and cleaned every day!!! Great choice for a trip to NY, have stayed in other hotels on other trips and none of them come close....will definitely be back!", "title": "Great Value", "helpfulness": 2, "user": "Jimers", "date": "October 5, 2006", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 5920967, "likes": {"liked": "— Location", "disliked": "— Street Noise"}}, {"rating": 4.0, "title": "Great Location for a room with no view :)", "text": "New York City: Comfort Inn Midtown", "helpfulness": 2, "user": "Yankee11", "date": "October 2, 2006", "id": 5900287}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "All of the previous reviews are right - this is a great hotel value on a street right off of Times Square. Rooms are small, as expected in NYC, but they are beautifully furnished - really a notch better than you would expect from a Comfort Inn. Staff is friendly and goes out of their way to help you. The fellow in the breakfast room was especially helpful. And free breakfast in NYC is a great perk! Both the room and the public areas were extremely clean, too. This place is such a bargain for tourists and theatergoers alike.", "title": "Great hotel in convenient location", "helpfulness": 1, "user": "Bandlady", "date": "July 16, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 34963906}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled solo", "text": "From the moment I checked in, I could tell that this hotel was going to be good. Clean, fresh looking lobby area, friendly staff and an effecient check in process.", "title": "Great hotel, amazing location", "helpfulness": 1, "user": "twood90", "date": "July 15, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 34812073}, {"rating": 4.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "The negative points: Rooms were a bit dark", "title": "Great Place!", "helpfulness": 1, "user": "NovaEast_Coast", "date": "July 8, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 34242919}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "Elevator is a bit slow", "title": "COMFORT INN lived up to the reviews", "helpfulness": 3, "user": "Cheschirecat", "date": "June 8, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 31903607}, {"rating": 4.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "The street outside smeels a bit sometimes", "title": "Great experience", "helpfulness": 2, "user": "Justine28", "date": "June 8, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 31871998}, {"rating": 5.0, "stay_parameters": "Stayed January 2009, traveled on business", "text": "Just can't beat the location, one a half block from the center of Times Square. Very comfortable older hotel. Breakfast was good, clean and its the spot. I can't say enough about the staff - they were terrific.", "title": "Great Location and Staff", "helpfulness": 2, "user": "Koolit", "date": "May 2, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 29207843}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "We stayed four days in hotel. We were surprised how near is Times Square! We had even a breakfast included in price of acommodation, what is not usually for hotels in NYC. The room was very quite. The staff were very helpfull and kind. We would definietly recommend this hotel and we will probably come back one day in the most beautifull town in world, of course in this hotel!!!:-)", "title": "Great hotel, very kind staff and great location!!", "helpfulness": 2, "user": "garoZadar", "date": "May 1, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 29149013}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled with family", "text": "We have just returned from NYC and staying in Times Square. This our second visit to this hotel. We had a mini family reunion here and all 8 of us were very pleased with everything about this hotel. The staff in fantastic! Helpful in many ways, 4 or five of the same people as 2 yrs ago, nice to see a familar face. Continal B-Fast is nice bagels, donuts, cereal and fruit. Location is GREAT! Staff had our room clean everytime we got back from seeing the city. Gave great recommendations for eating and directions. All the staff we encountered here made our stay perfect. RonP", "title": "The Best", "helpfulness": 2, "user": "sawmill", "date": "April 28, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 28955921}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled solo", "text": "i stayed in the comfort inn for 6 nights 14th-20th april staff were great rooms cleaned and fresh towels every day close to everything just a few minutes to times square would deff stay here again would recommend to anyone looking for a clean comfortable hotel in the centre of new york", "title": "excellent hotel", "helpfulness": 1, "user": "sam_moore06", "date": "April 26, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 28819237}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled with friends", "text": "We were looking for a comfortable, affordable, conveniently located, clean hotel. Comfort Inn Midtown turned out to be all that we had hoped. The location 1 block from Times Square was amazing, but the hotel itself seemed enough off the beaten path to not be hectic or loud. Sure there was some traffic noise, but you're in a big city. The hotel has 70 rooms or so on 9 compact floors -central elevator separates the floor into 2 wings with 5 or 6 rooms per wing. Nice features - clean, comfortable bed, continental breakfast, friendly, helpful staff, access to free wireless in room and printer accessibility in small business center. Would definitely stay there again.", "title": "What a pleasant surprise!", "helpfulness": 2, "user": "Missyhaha", "date": "April 20, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 28437925}, {"rating": 4.0, "stay_parameters": "Stayed September 2006", "text": "We were staying in Comfort Inn Midtown, New York 4 nights before we went on a cruise. The hotel considering the price was above average, situated in the heart of Manhatten, the service in top, very friendly and I could go on praising the hotel. The only negative experience was the noise from the street, why I advice the owners to install windows with double glaser .", "title": "Value for money", "user": "JPDenmark", "date": "September 26, 2006", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 4.0, "cleanliness": 3.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 5877183, "likes": {"liked": "— The location", "disliked": "— The noise at nights"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2006, traveled solo", "text": "Hi! When I was planning my first-ever trip to New York City I really did not know where to stay and I admit the reviews that I read in Trip Advisor where the key element in order to choose the Comfort Inn Midtown. After a four-night stay my conclusion is that I agree to previous reviews in the sense that this hotel is a very good option in New York City.", "title": "I agree, this is a very good option", "helpfulness": 9, "user": "Mayer_AGU", "date": "September 17, 2006", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 5809224, "likes": {"liked": "— Excellent location, good price", "disliked": "— ---"}}, {"rating": 4.0, "title": "Good location, Gruff but later helpful staff, Great value", "text": "I do not have new things to add to the many reviews posted here, but I would like to comment my agreement on the following advantages of the Comfort Inn Midtown:", "helpfulness": 6, "user": "vwsswv", "date": "September 9, 2006", "id": 5783071}, {"rating": 3.0, "stay_parameters": "Stayed September 2006", "text": "Price.- Very affordable considering the hotel is closely located to Times Square.", "title": "Great Hotel for a NYC Trip!!", "helpfulness": 2, "user": "Caltobello", "date": "September 7, 2006", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 5.0, "rooms": 3.0}, "id": 5777066}, {"rating": 4.0, "title": "Great hotel and great location", "text": "Room/bathroom cleanliness.- They were spotless in my experience.", "helpfulness": 7, "user": "DiscoStick", "date": "August 23, 2006", "id": 5702285}, {"rating": 4.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "This hotel was better than expected. It was close to Times Square (1/2 a block away) and close to grand central station (3 blocks). The most important thing was that the rooms were clean. The bathroom was clean too! I know that other reviews said something about church bells, but we were right next to the church and didn't hear the bells. The only noisy thing was our child neighbor screaming at 11pm and then slamming the door to her room about 10 times. This is of course nothing that the hotel could have controlled. It was very convient to have free internet access (two computers) in the lobby. The free breakfast was also very nice. My fiance even used their fitness room which was very small but had a bike, treadmill, and stairmaster. The best part of this hotel was the unbeatable price of $110 per night! I would stay here again and reccommend it to my friends!", "title": "Clean with a great location", "helpfulness": 9, "user": "AlissaFr", "date": "August 15, 2006", "detail_rating": {"front_desk": 3.0, "business": 5.0, "service": 3.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 5614114, "likes": {"liked": "— Price!", "disliked": "— The loud neighbors"}}, {"rating": 2.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "Oh and we also stopped in Havanna central (right on 46th street a couple doors away from the hotel) for dinner and it was fantasitic especially the mojitos!", "title": "building work!", "helpfulness": 7, "user": "john7glen", "date": "August 14, 2006", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 2.0, "value": 2.0, "rooms": 3.0, "location": 5.0}, "id": 5611046, "likes": {"liked": "— location, great for Times Square"}}, {"rating": 4.0, "title": "Better than expected", "text": "Nice hotel, at this price. First room offered was a single (that claimed to be a double). I could not see two 200lb people getiing into the bed. They changed our room for a better one. Main problem was the buiding work going on inside the hotel. They had completed the restyling of first four or five floors, but the work was still going on as we could see every day. Men carrying plaster board in the lifts and old units out meaning that only one of the two lifts was available most of the time. Place was dusty desoite the constant effort of the staff. Should be OK soon, I hope,", "helpfulness": 5, "user": "Narelle M", "date": "July 12, 2006", "id": 5457799}, {"rating": 4.0, "title": "I agree heartily - this is a great Location!!!", "text": "We stayed here from June 10-17, 2006. We had booked a room with a King bed and sofabed in November 2005. Due to the other comments on this site I rang the day I was checking in to be told byu the hotel they do not have king size beds with a sofabed in the same room. This made for a very uncomfortable stay for my husband, our eight year old and me in one bed. My brother-in-law slept in the other bed. We have not yet had an apology from the hotel, although we booked through Choice Hotels. Anyway, we had a room on the twelth floor and had fantastic views of both the Empire State Building and the Chrysler Building. We walked the stairs most of the time, and it was great to walk the various staircases and to see the old building, including watching the mail go down the chute. Our room was always clean. The breakfast was very good each morning and the location was great for subways and walking.", "helpfulness": 9, "user": "AussieTourist", "date": "June 28, 2006", "id": 5396528}, {"rating": 3.0, "title": "good spot for a night or two", "text": "I would stay here again, but you need to ensure you are getting what you pay for.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "June 26, 2006", "id": 5390937}], "location": {"country": "United States", "city": "New York City"}, "stars": 3, "variance": {"poor": 28, "average": 122, "very good": 526, "terrible": 23, "excellent": 502}, "aka": "Comfort Inn New York", "slim_ranking": 0.357466063348, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "description": "The newly renovated Broadway at Times Square Hotel offers clean and elegant accommodations with free wireless Internet access, flat screen TVs, a fitness center, a 24-hour business center, complimentary continental breakfast, free calls within the US and a lot more!"}