{"user_rating": 4.0, "review_count": 962, "name": "Broadway Plaza Hotel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled on business", "text": "My friend and I met in NYC for business, but also for fun. We were two ladies on our own, and had never been to NYC, so safety was of a concern. We arrived at night. Check-in was very quick and convenient, and we were really pleased with the room. Very spacious, up-to-date and clean, and we had a great view of the Empire State Building. Because it was already getting late, and the area was pretty dark, we decided to stay in and order room service, which is delivered from a nearby restaurant. The food arrived quickly, was very good and a reasonable price. We could hear the elevator in our room, but the sound wasn't bothersome, and didn't interrupt my sleep. One thing I will make note of -- the pillows are very narrow and almost round, nearly like bolsters. I thought they'd be uncomfortable, but I slept great every night. The doormen were perfect gentlemen, and always helpful. If you need a cab, they'll get one for you. If you order room service, they bring it up. I've read some complaints about the breakfast room, but we were very pleased with everything there. (Great bagels!) Just plan to take your food/coffee/tea back to your room due to space limitations. We walked everywhere -- the location of the hotel was very convenient to shopping, restaurants, shows, banks and parks. As everyone else has said, there are a lot of guys standing around on the sidewalks just outside, but we didn't have any problems with them. They are all gone at night. We walked back to the hotel late at night, and felt safe. I would stay at the Broadway Plaza again in a flash.", "title": "Great Hotel! Great Price!", "user": "TexWriter", "date": "October 24, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 21186624, "likes": {"liked": "— Size and cleanliness of rooms, as well as the price compared to other hotels.", "disliked": "— All the male sidewalk loiterers outside."}}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled with family", "text": "I have just returned from a weeks stay with my cousin and her friend and having read the reviews i didnt know what to expect.", "title": "Great stay", "user": "Iireland", "date": "October 10, 2008", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 3.0, "rooms": 5.0, "location": 3.0}, "id": 20791670, "likes": {"liked": "— close to shopping and helpful staff", "disliked": "— nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "In my opinion the hotel was lovely and i felt quite safe in the area. We had a room with a great view of the ESB.The staff were lovely especially the young doorman tony who helped with any requests that we had no matter how unusual.The rooms were cleaned everyday and were comfortable.Iwould recommend this hotel", "title": "Very large, comfortable room", "user": "coatgirl", "date": "October 3, 2008", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 20603350}, {"rating": 4.0, "stay_parameters": "Stayed September 2008, traveled with friends", "text": "The rooms are the reason to stay here. My room was very large - much larger than expected - and had a big TV, a big desk, and its own air con that was fairly quiet. The bed was very comfortable and the bathroom was large with a hot, high pressure shower.", "title": "Little Gem!!!", "helpfulness": 1, "user": "Cat_99Stirling", "date": "September 12, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 4.0}, "id": 20009749, "likes": {"liked": "— Value", "disliked": "— Immediate neighbourhood"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "Top marks for giving me what I asked for, i.e. a room on a top floor with a view (unimpeded) of the Empire State Building. Go for a top floor room if you're a light sleeper - there's very little noise.", "title": "Would Definately Go Back", "helpfulness": 1, "user": "u03deg", "date": "September 3, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 19691415, "likes": {"liked": "— Value"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "I lived down the street from this hotel a couple years ago, so I was prepared for the trash and hustle of the wholesale district. Yes, this isn't the nicest area of NYC, but you will not get harmed. On the weekend, all the shops are boarded up and there's not as many people around.", "title": "Great staff", "user": "kjc5032", "date": "July 16, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 3.0, "location": 3.0}, "id": 17961157, "likes": {"liked": "— The helpful staff", "disliked": "— The small bed and shower"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "For the hotel itself, the staff was great. We had a problem with our theatre tickets, and although they couldn't help, the concierge tried. They were always willing to hail us a cab. They held our bags for us both before we checked in and after we checked out. They were great.", "title": "Best Little Hotel......", "helpfulness": 1, "user": "lynrenae", "date": "July 15, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 17922464, "likes": {"liked": "— The Staff and the size of the rooms", "disliked": "— Nothing...."}}, {"rating": 4.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "The room was really small, but had a fantastic view of the empire state building and Broadway. I only stayed one night and was barely in the room, so I didn't mind. The bathroom was a good size, although the shower was a stall and no bath. I don't take baths in hotel rooms, so no problem.", "title": "Super Hotel", "user": "Floffy69", "date": "June 26, 2008", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 3.0, "cleanliness": 3.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 17248933, "likes": {"liked": "— That it was Central for everything", "disliked": "— The BIG bed"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled with friends", "text": "The hotel offers a free continental breakfast, which I didn't take advantage of, and free coffee and tea 24/7, which is really nice for a NY hotel. And the rates were comperable or better than other places in the city.", "title": "Loved the Broadway", "helpfulness": 1, "user": "Salem_ALJenden", "date": "June 22, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 17135842, "likes": {"liked": "— Friendly Staff, Cleanliness", "disliked": "— Neighborhood"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled with friends", "text": "If I needed to stay in this area ago, i would absolutely stay in this hotel. I'll probably stay elsewhere next time only for the convience of being near Penn Station or Times Square.", "title": "A great value hotel: we liked it so much, we went back!", "helpfulness": 1, "user": "laura_the_explorer81", "date": "June 20, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 4.0}, "id": 17078138, "likes": {"liked": "— Location, value, friendly staff, cleanliness, view, value....", "disliked": "— Television, only 2 lifts and only 1 goes to top floors so not best for anyone with mobility problems"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2008, traveled on business", "text": "I took the recommendations of fellow trip advisor travelers and booked this hotel for a 1 night business stay in Nov 2008. I was not disappointed. Excellent price for the room quality and amenities. The room was very clean and the room was on the larger size for a NYC property.", "title": "Affordable Semi-Luxury Hotel in NYC", "user": "DaveySF", "date": "November 19, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 22004757, "likes": {"liked": "— Excellent value", "disliked": "— Limited bathroom counter space"}}, {"rating": 3.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "The hotel offers a decent complimentary continental breakfast, but wi-fi/internet access is an additional $10/day. The entrance to the hotel is a narrow hallway to the front desk, and counter space in the bathroom is limited, but again, the room was very clean, a good size, and the bed was excellent. The staff was also very helpful.", "title": "Bad and Good!", "user": "WhickhamLad", "date": "November 18, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 4.0, "cleanliness": 2.0, "value": 3.0, "location": 3.0, "rooms": 4.0}, "id": 21963568, "likes": {"liked": "— Looked Clean but obviously hidden agenda", "disliked": "— Being Bit to hell!"}}, {"rating": 3.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "The hotel is located about 1 block away from the 28th street WR train station, and located close to the Fashion Institute of NY.", "title": "Not The Best But Okay As A Base.", "helpfulness": 2, "user": "PaulMurphyOfTheUK", "date": "November 15, 2008", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 2.0}, "id": 21867574, "likes": {"liked": "— Service", "disliked": "— Location"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2007, traveled solo", "text": "Overall, a very decent quality boutique hotel for about $300/night.", "title": "Great Hotel for the Price", "helpfulness": 1, "user": "YDM425", "date": "November 11, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 21747101, "likes": {"liked": "— Room was large for NY standards", "disliked": "— Street noise (horns, sirens)"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "We went to NYC and stayed in Central Park for a few days before we booked \"The Broadway Plaza\" for 2 nights at the end of our week. When we arrived we were fairly impressed though by no means overwhelmed! The entrance is small but re-assuring when you see a well presented friendly door security chap who was very welcoming. The staff at the desk too were fairly friendly. We checked in and went to our Room 802, upon entering my partner and I were very impressed. the room looked clean and tidy and well presented, with a large Old style TV (That Suprisingly had Signal, unusual for many Hotels in NYC) Our room was a corner room and for a Queen size room was a decent size with tidy bathroom. There was also a Drinks machine and Sweets,Crisps dispenser too on our floor. All Good so far! We then ventured outside at night to go to Maddison Square Garden to see AC/DC Play and were a little shocked at first, for about 500 metres strectch directly outside the hotel is slightly dodgy! Many groups hanging around doing well NOT much just hanging! my girlfriend was a little worried, but being honest they do not harrass or talk to you so don't worry, also after a little while it we were not at all bothered by it! BAD point - Ignore breakfast on the 4th floor! Tiny room and expect to que, though hell your in NYC go elsewhere and enjoy the delights of breakfast. EXTREMELY BAD POINT - The night we checked out the hotel - feeling happy enough with the Plaza, we entered JFK Airport and were ready to board our plane when my partner complained of bites on her arm, hey I'm telling you these were big bites, we thought nothing of it until flying home to Newcastle via Amsterdam, when I started itching on my back and legs, once at Schippal Airport I went to the Gents to find I had god knows how many bites on my back, pretty horrible. My Partner and I are pretty healthy 33 and 27 Year olds who have never had anything like this before and unfortunalty we both knew this came from our previous two nights stay at the Plaza! How to put a damper on things - Well that's all I'm saying, it's now 2 days after our return and as I write this I must stop as my back is still itching!!!!", "title": "Excellent choice for NY City tourists", "helpfulness": 1, "user": "LynnYorkshire_UK", "date": "November 7, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 4.0}, "id": 21629913, "likes": {"liked": "— Amentities in the room, large comfy bed", "disliked": "— Slightly too warm in the room."}}, {"rating": 1.0, "stay_parameters": "Stayed June 2008, traveled on business", "text": "I read reviews and they were mixed, but I didn't think this place would be this bad. Area NOT safe....Rooms smelly ...I do not recommend.", "title": "Shady area", "helpfulness": 1, "user": "Carlii1964", "date": "June 19, 2008", "detail_rating": {"front_desk": 2.0, "business": 1.0, "service": 2.0, "cleanliness": 2.0, "value": 1.0, "location": 1.0, "rooms": 1.0}, "id": 17061397, "likes": {"liked": "— nothing", "disliked": "— everything,..BAD location"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled with family", "text": "I am a single prof. female and I felt very unsafe here.", "title": "Reasonably priced hotel", "user": "alexsim2006", "date": "June 6, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 16718203, "likes": {"liked": "— The view of Empire State Building was amazing", "disliked": "— The breakfast routine"}}, {"rating": 1.0, "stay_parameters": "Stayed August 2007", "text": "A very nice hotel situated on Broadway, the room was quite nice and very spacious for New York standards, however it maybe could do with a bit of refurbishment. The only negative part of the hotel is the ridiculous breakfast routine - there is one tiny room for the whole of the hotel and about 2 (four seater) tables, which is ridiculous for a hotel this size - and we dreaded getting up in the morning to have to trek down to the breakfast room - but eventually we got used to it and made a bit of a laugh and a joke about it.", "title": "Worst Hotel ever.", "helpfulness": 2, "user": "123456md", "date": "June 1, 2008", "detail_rating": {"front_desk": 1.0, "business": 2.0, "service": 1.0, "cleanliness": 1.0, "value": 2.0, "location": 1.0, "rooms": 1.0}, "id": 16576964, "likes": {"liked": "— Madison Square Garden was right down the street.", "disliked": "— EVERYTHING."}}, {"rating": 3.0, "stay_parameters": "Stayed May 2008, traveled with friends", "text": "The hotel staff were very friendly and helpful - especially the concierge who will tell you how to get to places in new york via the subway or will call a private cab for you.", "title": "Pleasantly surprised", "user": "DublinBridget", "date": "May 28, 2008", "detail_rating": {"front_desk": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 2.0}, "id": 16462877, "likes": {"liked": "— The beds and central location", "disliked": "— Immediate area of hotel is undesirable"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2008, traveled with friends", "text": "The hotel is situated in the wholesale district of new york - where there are many cheap shops and the area is fine in the day - but at night everywhere is closed - there are very little restaurants and bars in the proximity and it is very lonely at night - but more nightlife is not a long way away if you know where to go.", "title": "Excellent Location with friendly staff", "user": "Black110", "date": "May 28, 2008", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 5.0}, "id": 16462637, "likes": {"liked": "— Location", "disliked": "— Nothing"}}], "location": {"country": "United States", "city": "New York City"}, "stars": 3, "variance": {"poor": 41, "average": 137, "very good": 466, "terrible": 24, "excellent": 294}, "aka": "Broadway Plaza Boutique Hotel", "slim_ranking": 0.399548532731, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "description": "Intimate 69 room boutique hotel located in the heart of mid town Manhattan at 27th Street and Broadway, in the Chelsea-Flatiron-Herald Square area. All guestrooms and public areas were renovated in March 2013. Known for our spacious accommodations, friendly service, moderate prices and convenient midtown location. Complimentary continental breakfast served daily between 7:00 am-10:00 am as well as 24 hour self serve Starbucks coffee and Lipton tea available in the 4th floor lounge. Within walking distance to Madison Square Garden and Penn Station, Empire State Building, Flatiron Building and Madison Square Park, Macy's, Herald Square as well as all the fabulous shopping of the wholesale district and 5th and 6th Avenues are just outside your door or within walking distance. Whether you are here for business or pleasure, we offer a easy and convnient location to all points of the city."}