{"user_rating": 5.0, "review_count": 100, "name": "Brompton Lakes", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled with family", "text": "Stayed in Abbey Lodge with family and 2 teenagers and our Old English Sheep Dog. Oct 2010. Beautiful Place...Tranquil setting we began to unwind almost instantly! The Lodges are beautifully furnished and comfortable with a large patio and fishing peg ( much to the delight of my Husband) Only thing missing was a hot tub on the patio. Location is great for access to the surrounding towns", "title": "Totally relaxing retreat............ but has its Negatives :- (", "helpfulness": 2, "user": "sewessential", "date": "January 26, 2011", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 94454595}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "Negatives:", "title": "Our favourite place in the whole of the UK", "user": "Laurafunok", "date": "January 11, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 92601189}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled with family", "text": "The Lodges are pobably the most expensive we have stayed in £680 for fri-mon. Kitchen was under equiped and many of the utensils were old. Lots of debris under sofa cushions, sofa, beds ( obviously slack maid). Due to location... flies are an issue. No shop on site. Wifi is weak signal and we were opposite the mast! Could never find anyone in the office. Teenagers were bored stiff as nothing on site for them except a tennis court .", "title": "perfect in every way", "user": "RobinSuffolk_UK", "date": "December 30, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 91078789}, {"rating": 5.0, "stay_parameters": "Stayed December 2010", "text": "**** Husband burnt his arm on the fire ... which is positioned in a central position", "title": "Lovely place to stay!", "user": "Family2011", "date": "December 13, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 4.0, "rooms": 5.0}, "id": 89758290}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "****** VERY DANGEROUS******", "title": "will definately return again", "user": "goodfellows", "date": "December 4, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 89001410}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "First visit to Brompton Lakes and we were knocked out, it was brilliant!!! Other lodge owners should come and take a master class from Brompton, they have thought of everything in the lodges. We came armed with all our usual self catering items for the kitchen but everything and more was already there. We were two families with children aged 6 and 4, the site was great no kids play area but we didn't need one with the paths to explore on foot and on bike, boules, tennis, basketball, not forgetting the fish, ducks and geese that were so much fun to feed. The children also loved the river with their fishing nets. We stayed in Florence and cannot recommend it enough the weather was great on arrival but was chillier the other two days which was a shame as with the decking and views we would quite happily spent the time relaxing on the deck. The colder nights did mean we got the chance to light the fabulous log fire, yes they get hot but the lovely lady had already explained that on arrival, kids were great, looked at it but steered clear as they were told to. All in all a brilliant time we will definately be looking for an opportunity to return ...we would happily live there.......cannot reccomend it highly enough.", "title": "Fabulous !!! Relaxing & Gorgeous Accomodation.", "user": "Fen0915", "date": "June 6, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 111741321}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled with friends", "text": "We have just returned from a weekend break for our first visit to Brompton Lakes and we certainly were'nt dissapointed !!! As 6 long term friends,who frequently go away for 'girlie' breaks,we have visited some very pleasing (and not so pleasing)properties.....but we have to say that this is most definitely the best yet!!! Our lodge was 'Rebecca' and everything about it was superb...we faced the evening sun..and may I say,we were well and truly blessed with beautiful weather,so that was an added bonus! You can be as lazy or as active as you wish and the staff are very pleasant and helpful. It's a very short car ride into Richmond,which is a very pretty market town...and it's definitely worth a visit to 'The White Swan'pub just before you enter Richmond....the Sunday lunch was excellent and well worth the £6.99...the meats were beautiful and tender. Anyway,back to the lodges,they are designed to offer you plenty of privacy but if sitting on your veranda,you can watch the activities of your neighbours.The wild life is lovely and we were lucky enough to see 11 new born ducks visit us daily with their mum to be fed..so sweet! Excellent place to visit...the previous reviews also say it all. Our advice...you have to go there!!!! But......don't tell too many people....it's a little piece of paradise!!!", "title": "Beautiful", "helpfulness": 3, "user": "nurse4cherry", "date": "April 11, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 103647179}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled with family", "text": "With this being our second stay at Brompton, we were hoping that everything was going to be as good as before...", "title": "Another fantabulous stay!", "helpfulness": 1, "user": "spottytiger", "date": "March 6, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 99109142}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled with friends", "text": "Brompton Lakes didn't disappoint us, everything was brilliant, if not better! We stayed in Isabella this time and loved the peace and tranquillity of where she is situated. The lodge was spotlessly clean and beautifully decorated. The under floor heating and the log burner kept us all warm and cosy after some very long walks in the snow, all in all another great stay...so great in fact we have just booked again for August!", "title": "One year on and still as good........", "user": "gatesheadgirlie", "date": "February 3, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 95361869}, {"rating": 5.0, "title": "Superb!", "text": "Having stayed at Brompton in January last year we wondered if the cleanliness would still be the same one year later.... The whole group thought so , you would think that they had just been opened. One of the group could not attend last year and she was so impressed with the cleanliness. The oven which we used every day friday to sunday was spotless which is hard when they no doubt get abused on a regular basis. I would like to think that we left he place almost as we found it and this is partly to do with the fact that it is so immaculate when you arrive..... However enough of the cleanliness aspect. We are a group of ten women who come to Brompton to chill out, eat ,drink and play games around the fire. Brompton is perfect for this on a chilly January day. We get taxis into Richmond for a rake around in the fresh air and to buy tea for Saturday then its back to the warm fire.", "user": "martweb", "date": "January 27, 2011", "id": 94680147}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "Just come back from a one week stay at Brompton Lakes. Everything about this place was fabulous!", "title": "Simply the best!", "helpfulness": 2, "user": "BillNoble", "date": "August 14, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116700870}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "The lodges are beautifully designed, and equipped to a very high standard with everything you could want for. It was like staying in a 4/5 star hotel. As it rained for most of the time we were there we spent more time in the lodge than we would normally do and it was perfect for hanging out, watching the rain pit pat into the lake, and observing the ducks cruising from lodge to lodge in search of bread.", "title": "Top Quality Accommodation", "helpfulness": 1, "user": "PJH_EHH", "date": "August 8, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116433866}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "The site has been very sensitively landscaped and borders the very beautiful river Swale which, in the time we were there, went from a gentle stream hugging the gravely river bed, in which children could safely paddle, and build dams, to a torrenting river which would have been perfect for white water rafting.", "title": "Fantastic place, would thoroughly recommend!", "helpfulness": 1, "user": "misty1408", "date": "August 5, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116295932}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "It was the most perfect place to explore the Yorkshire Dales from. The market town of Richmond is only minutes away by car and has all the shops you could possibly need. I would particularly recommend The Station complex opposite the river which has a good cafe and an artisan bread shop selling speciality breads, cakes, and quiches. They also have other artisan food shops on site.", "title": "Loved it - Already wanting to go back", "helpfulness": 3, "user": "Rockk1984", "date": "July 24, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115718040}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with friends", "text": "If you decide to go to Brompton lakes I recommend choosing a lodge on the lake that has Willow lodge (this was the lodge we stayed in) as it is better landscaped than the other lake and provides more privacy.", "title": "An amazing place with second to none facilities", "helpfulness": 2, "user": "LOULATRAVELS", "date": "July 4, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115005804}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "I am hesitant to submit a review,in case it becomes harder to attain accomodation...but Brompton Lakes deserves one. I searched for weeks,through \"Luxury in Yorkshire\" etc accomodation,until I finally found Brompton Lakes. There was no looking back!", "title": "Eco Friendly Luxury!!", "helpfulness": 1, "user": "huddoshols", "date": "October 13, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 83356536}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "From the moment we arrived,we knew we had made the right choice in Yorkshire. Our \"home\" for 7 nights delivered everything we had hoped for and more. The view was magnificent. The amenities delivered. But then the staff gave the extra oomph!!", "title": "AMAZING!!!!!", "helpfulness": 1, "user": "Bek83", "date": "October 5, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 82210084}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled with friends", "text": "My goodness,you all are lucky..we have to travel from the other side of the world and we have travellled extensively for 20 years.", "title": "Absolutely Fabulous", "user": "SusieHuddersfield", "date": "September 12, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 79211263}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "Thanks Everyone at Brompton Lakes.", "title": "Fantastic Retreat", "user": "D3NTK", "date": "September 7, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 78580119}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "Amanda and Grant xx", "title": "Excellent location, helpful staff, small but", "helpfulness": 2, "user": "worthingite", "date": "September 2, 2010", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 77945249}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "variance": {"poor": 0, "average": 0, "very good": 11, "terrible": 0, "excellent": 89}, "aka": "Brompton Lakes Hotel Richmond", "slim_ranking": 0.25, "description": "Brompton Lakes is an exclusive development of luxury eco lodges situated just two miles from the historic market town of Richmond on the edge of the Yorkshire Dales National Park. Set in 26 acres of privately owned land, the 5-star lodges are designed to complement the natural features of this stunning lakeside location, the award-winning lodges are distinctive and contemporary and are built on the shores of two lakes, surrounded by woodland and open countryside."}