{"user_rating": 3.5, "review_count": 1488, "name": "Broncemar Beach", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed April 2012", "text": "The hotel meets all the needs of a family with young kids. We traveled at easter with a 5yr old and almost 2 yr old. It was great. Good sized rooms. It was a bit noisey at night as we were at front with pool vies and close to entertainment but only up to about 11.30pm., but then if you want to be near pool during the day that's a fair trade off, our room was 223. We good go back again. Really good location close to shops and beach and good selection of local restaurants.we did a mix of self catering and all inclusive. I would not telly like to go all inclusive anywhere for a week but the food was fairly good, what you expect really. Good range on offer most nights the roast meats carved to order weren't bad. All in all very good spot, its just a pity when travelling from Belfast the prices are so expensive for Thomas cook package holidays at easterand non term time.", "title": "Great place for a young family holiday", "helpfulness": 3, "user": "camloch", "date": "April 28, 2012", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 128983568}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled with friends", "text": "Broncemar beach is good value for money; however this is definitely a 3 star hotel. We used the hotel as a base because we were out and about investigating the island most days, so it was perfect for our needs.", "title": "Good 3 star accomodation", "user": "NDThom", "date": "April 28, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 2.0, "rooms": 3.0, "location": 4.0}, "id": 128973364}, {"rating": 3.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "The apartment was big (for 2 of us anyway) and it was kept clean as the maids were in 5/7 days we were there. We were self-catering so I can't comment on the food in the resort. The SC facilities were ok, but very basic; if you plan to do any of your own cooking you may want to bring something to cut with as no sharp knives are provided. The staff were always very friendly and helpful, and were also quick to respond to any requests we had.", "title": "Definitely a 3 star hotel...", "user": "PrincessTini", "date": "April 27, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 128900547}, {"rating": 3.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "I only had a couple of minor problems - our room was literally next door to reception and above the dining room, so it was noisy all day and night. There was karaoke every night which was so loud you could hear it everywhere across the complex. We had building going on outside our bedroom window which started at 7.30am most mornings. If - like me - you prefer having 2 pillows on your bed I would advise you to bring a spare. These really are minor complaints as the apartment met all of our basic needs.", "title": "Just about average....", "helpfulness": 1, "user": "robcop_8182", "date": "April 27, 2012", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 3.0, "sleep": 1.0, "rooms": 2.0, "location": 5.0}, "id": 128840899}, {"rating": 3.0, "stay_parameters": "Stayed May 2011, traveled with friends", "text": "We stayed here for a week from 11th-18th April 2012. We arrived, got into our room and it was disgustingly thick of cigarette smoke. As Asthmatics, we couldn't stand it and asked for a new room. We were given another \"smoking\" room which had just had a quick blast of air-freshner round, but as there were no other rooms available, we had to put up with it (it was miles better than the first).", "title": "One Year On", "user": "Secy", "date": "April 27, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 128736395}, {"rating": 4.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "I wanted to dislike the Broncemar due to arriving 6 hours late (thanks Thomas Cook), a rainy day and a room with no hot water and loud music until 3 am. The noise was from a bar ouside of the hotel grounds so the hotel was not responsilble but If noise bothers you then avoid rooms 101 to 121 and all rooms on that side.", "title": "Better than Expected", "user": "Globe-spanner", "date": "February 27, 2010", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 57225312}, {"rating": 2.0, "stay_parameters": "Stayed February 2010, traveled with family", "text": "However we changed rooms at the 3rd time of asking and with hot water and no noise it was not that bad a hotel. The rooms were fair sized with lots of cupbords/drawers/hanging space etc, kettle, microwave, toaster, fridge, clothes airer, table and chairs and 2 sofas. One room had no hangers the other room did.", "title": "NICE FOOD THINK NOT !!", "user": "jell67", "date": "February 23, 2010", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 56837213}, {"rating": 4.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "The downside is the state of repair (things are botched mended rather than a proper repair). Lack of air conditioning(but the room did not get that hot - maybe wrong season in February). But there was nothing serious and if you want better decor pay more and go more upmarket. The rooms were clean.", "title": "Great Hotel!!! Do NOT go All inclusive!!!!!!", "user": "daviecollins", "date": "February 22, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 56811647}, {"rating": 3.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "Two extras were the room safe at15€/week (in both our rooms the safe worked without paying the money to get the activation code). Neither room safe would accomodate a 13\" laptop. Hair driers are also extra but my missus took one with her.", "title": "Needs some maintenance and cleaning", "user": "Mark_Solihull", "date": "February 22, 2010", "detail_rating": {"service": 4.0, "cleanliness": 1.0, "value": 3.0, "sleep": 3.0, "rooms": 2.0, "location": 3.0}, "id": 56740713}, {"rating": 2.0, "stay_parameters": "Stayed February 2010, traveled with family", "text": "Towels are changed 3 times a week and are smallish threadbare affairs. This is one area the Broncemar needs to improve. I don't know if families get more towels. As a coup[le we got 2 small bath and 2 small hand. If you can take a big fluffy bath towel from home.", "title": "Good and bad points", "helpfulness": 1, "user": "TopazJo", "date": "February 21, 2010", "detail_rating": {"service": 2.0, "cleanliness": 1.0, "value": 2.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 56650188}, {"rating": 5.0, "title": "broncemar beach is the place to go", "text": "fantastic hotel and staff alike , everything you need for a family holiday , entertainment was second to none , and the food was exceptional , needless to say we av booked for 2010 , kids were happy and entertained which in my book makes for a perfect holiday , can't wait to go back .", "helpfulness": 3, "user": "beachbabe46", "date": "January 2, 2010", "id": 52366488}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled with family", "text": "we have just returned from a week (23-30th december) at the broncemar beach appartments. The hotel was brilliant and the entertainment team was great! well done stevie luke and carrie! the all inclusive menu had a variety and was suitable for everyone. All in all we loved it!", "title": "brilliant stay!", "user": "laurenramsay", "date": "January 1, 2010", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 52294174}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled with family", "text": "superb location,just a stones throw from the shops and restaurants where there is plenty of choice and the food is reasonably priced. There is plenty of space around the pool where sunshades are provided. There is a twice weekly barbecue. The snack bar", "title": "Family orientated,fab location", "helpfulness": 1, "user": "shellybean17", "date": "December 29, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 52071494}, {"rating": 4.0, "stay_parameters": "Stayed December 2009, traveled with family", "text": "provides plenty of tasty and reasonably priced food. The restaurant has plenty of choice and the food is plentiful and tasty.drinks are expensive so if you drink and eat a lot an upgrade to all inclusive is well worth it. The Thomas Cook entertainment team are on hand both day and night so you can join in if you want too. They are fab. with the kids.Outside shows also provide entertainment. you can book excursions to other islands. The beach is also close by,as is crazy golf and an up market shopping centre for expensive goods.All in ALL a superb family holiday,there is even a sports bar on the complex so you dont miss too much sun!", "title": "well worth the money", "user": "kilgannon", "date": "December 27, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 3.0}, "id": 51926363}, {"rating": 4.0, "stay_parameters": "Stayed December 2009, traveled with family", "text": "just back 16 dec with family ,great location nice quite,plenty of entertainment staff very helpful few cockroaches but was moved right away to a 2 bedroom apt as was only in 1 apt was very nice of them .weather abit rainy but expected this time of year food .isok put it this way u will not starve as can choose something .sorry but not for me wont be back .", "title": "Great Family Holiday in Great Location with Great Entertainment", "helpfulness": 1, "user": "PDunne75", "date": "December 24, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 51814759}, {"rating": 4.0, "title": "Great value, great for kids and friendly single parent friendly holiday!", "text": "My 6 yr old daughter and I stayed at The Broncemar on 12th April for 1 week. I was slightly nervous travelling as a single parent on our first holiday abroad together but as soon as we arrived I was relaxed. The reviews are very varied and it saddens me to hear people complain endlessly about a great hotel with lovely surroundings and fab staff.", "user": "Madelaine H", "date": "May 8, 2012", "id": 129604625}, {"rating": 4.0, "title": "Broncmear, out of season but fab", "text": "I didn't book a transfer as I had read that it was only 10mins away and 12 Euros roughly - all true. So all in all much quicker and cheaper than the transfers which is great if you have kids.", "user": "Joanne D", "date": "May 6, 2012", "id": 129461548}, {"rating": 4.0, "title": "It's an OK place.", "text": "I emailed the hotel before arriving and requested a room which had been recommended by a prior guest as being close to kids pool with a good view (189 - first floor)and the hotel emailed me back straight away which was impressive customer service promising that room or one very close. When we arrived I was very pleased to find we had been allocated that very room!", "user": "4400Gains", "date": "May 6, 2012", "id": 129446137}, {"rating": 4.0, "title": "Very Good!", "text": "The bedroom was very spacious with twin beds, double wardrobes and a small balcony overlooking the kids pool. The bathroom was spacious also and we always had lovely hot showers. There was a large kitchen come lounge with enough equipment for self catering if you wish and sofa, chair, TV and a private balcony. The room was cleaned 6 days out of 7 and was all that we needed for our stay.", "user": "Dean H", "date": "May 5, 2012", "id": 129394534}, {"rating": 3.0, "title": "not as bad as some would say!", "text": "The food in the restaurant was excellent, there was such a wide variety and if you could not find something to eat then I can only assume you are very fussy. There was fresh salads, roasts, fish, pasta, etc and the usual chips and fried stuff if you want and a selection of bread. I ate the fresh fish most lunch and/or dinner times and it was delicious.", "user": "88ashley", "date": "May 2, 2012", "id": 129256164}, {"rating": 5.0, "title": "Fantastic Holiday", "text": "Have just returned from week AI at broncemar and have hada fantastic time read some of the bad reviews before we went and all i can say is that to many people expect 5 star hotels at 3 star prices this hotel is advertised as 3 star plus and it is at least that. There was 6 of us 3 couples and are all in agreement that it is a fantastic place to stay and are planning on returning next year.", "user": "JD1970BishopAuckland", "date": "May 1, 2012", "id": 129177498}, {"rating": 5.0, "title": "fantastic holiday", "text": "FOOD:- Always plenty of choice and standard above what you expect from 3 star hotel", "user": "kim s", "date": "April 30, 2012", "id": 129127759}, {"rating": 1.0, "title": "Hideous mis-sold holiday. FOR YOUR HAPPINESS DO NOT STAY HERE", "text": "DRINKS:- Could not fault the drinks in both pool bar and tavern never had to wait long to be served", "user": "Simon U", "date": "April 29, 2012", "id": 129058071}, {"rating": 4.0, "title": "Good value. No real Complaints", "text": "ROOMS:- Very spacious and clean were cleaned 6 days out of the 7 we stayed", "user": "meandher45", "date": "April 29, 2012", "id": 129027904}, {"rating": 4.0, "title": "Self catering view from a couple in our 40s!", "text": "POOL AREA:- Was very clean pools were a good size only 1 heated but some days it was nice to get in the cooler pool as it was refreshing there can be a problem some days getting a sun bed if not up early but think that is same for most places lucky for us one of our party was always up early so had no problem", "user": "Jancity66", "date": "April 29, 2012", "id": 129026823}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "wont say too much as everything has been said in previous reviews but just to say we think this place is great value for money. We book self catering as we enjoy eating in the many great places to eat in the resort but if you are on a tight budget then we met many people who were generally happy with the all inclusive (a few grumbles about the food quality but at the price they charge you cant expect gourmet dining!) Big clean apartments, lots going on around the main pool (pool/darts/table tennis comps,quizs,bingo etc) but also a quieter pool if you want peace to read a book. Some great places to eat out are Minstrels/15/Jinxing chinese and the indian near the aberdeen steak house (they give you a free jug of sangria with the bill)", "title": "our 3rd visit and it won't be our last!", "user": "Norwich_Tractor_Boy", "date": "January 23, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 3.0, "location": 5.0, "value": 5.0, "rooms": 5.0}, "id": 94170403}, {"rating": 4.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "Pleased to see the hotels family of 5 feral cats are still thriving!", "title": "value for money", "user": "kevinball14", "date": "January 19, 2011", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 5.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 93763103}, {"rating": 3.0, "stay_parameters": "Stayed December 2010, traveled with family", "text": "We'll be back next year!", "title": "good value for money", "user": "irene007", "date": "January 10, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 92471429}, {"rating": 3.0, "stay_parameters": "Stayed January 2011, traveled with family", "text": "saying its a 3* the food was upto a 5* as there was food for everyone to like, for breakfast there was fruit to full english but the bacon wasnt the typical british bacon but still good, for dinner you had the poolside food which was bbq with burgers an fries and sandwhices which you can help your self to, or you can have the buffet in the resturant which was good, and for the tea there was a slection of food with all different meats to choose from. the food always changed at dinner an tea so it was varied. i would go away as the entertainment was 1st class and the staff were very helpful and kind but i do think its how you speak to them. the hotel rooms are big but theyve all got twin rooms which was the only downside i can think of. everythin is within walking distance and its not to loud or a far walk to places.", "title": "It's okay but nothing special", "user": "HibTraveller", "date": "January 10, 2011", "detail_rating": {"service": 4.0, "cleanliness": 2.0, "value": 4.0, "sleep": 3.0, "rooms": 2.0, "location": 3.0}, "id": 92380417}, {"rating": 4.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "the room we had was large and clean with a really large balcony , a smaller balcony and a terrace at our door. room 309 which was an upper apartment.", "title": "Nice hotel for a base only", "user": "PhilandDi045", "date": "January 9, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 92316229}, {"rating": 4.0, "title": "Fuerteventura, good and bad!", "text": "This was the forth time we visited this Island, staying in Caleta d Fusta. As ever we had a great time, escaping the UK winter! Weather in fuerteventura can be changeable this time of year, but you would be unlucky not to get some sun.", "helpfulness": 1, "user": "sidecarkeith", "date": "February 18, 2010", "id": 56341191}, {"rating": 4.0, "stay_parameters": "Stayed February 2010, traveled with family", "text": "This year we stayed at Broncemar beach hotelaprtments and because of the exchange rate meaning visiting local restaurants every night is now too expensive we went all inclusive. The food is OK, if not very exiting, but the staff worked very hard to make sure we had a good holiday.", "title": "Wish I was still there", "helpfulness": 1, "user": "Macysmum", "date": "February 15, 2010", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0}, "id": 56027745}, {"rating": 4.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "The entertainment on site was not really to my taste, being run by the Thomas Cook entertainment team. These three entertainers had to somehow entertain the kids all day, prepare the evenings entertainment then perform it, working through till well after 23.00hrs each night. They put in some really major effort, and just because I was not to bothered about that particular style of entertainment, the majority were (including our 10 year old) does not mean they do not deserve a big pat on the back!", "title": "Great holiday, weather and location", "user": "yeoldecrier", "date": "February 13, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 55898665}, {"rating": 4.0, "stay_parameters": "Stayed February 2010, traveled with family", "text": "The hotel is generally clean, if you get worried by the huge cockroaches which can appear out the plug holes if you are unlucky in rather large numbers (not the hotels fault- remember where you are!), mention it to the cleaners- I don't know what they put down the drains but it sure worked well!", "title": "Great holiday, Shame about the food!!", "user": "lisandave", "date": "February 11, 2010", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 2.0, "rooms": 4.0, "location": 5.0}, "id": 55772141}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "The swimming pools were great, one heated and great for splashing around in, the other not, but this meant it was largely empty and was long enough to some some lane swimming to help work off that all inclusive dinner from last night!", "title": "I don't no why people have complianed about this place...", "helpfulness": 2, "user": "abbysmad_3", "date": "February 7, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 55389244}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "My husband and I were on holiday with friends who had been to the Broncemar several times. I was a bit nervous as we have had bad experience of 3* AI before and had vowed never to stay at anything below 4* we were very pleasantly surprised. Our friends had requested specific apartments and we were given those (211 and 214) - upstairs apartments overlooking the pool. Very spacious with open plan lounge/kitchen, bedroom & bathroom which were spotless. We had a large terrace with table & chairs.", "title": "Outstanding value", "helpfulness": 4, "user": "FionaM", "date": "May 15, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 129970826}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "We were very impressed with the standard of the meals. We've stayed at 4* & 5* hotels and the food at the Broncemar compared very well, if not better. Lovely fresh salads, and the pasta sauces were delicious. I defy anyone not to find something to eat. There is also a snack bar next to the pool serving sandwiches, burgers, hotdogs & something different each day such as chicken kebabs, frittata, paella. My only complaint is the restricted lunch times - 2.30 for the restaurant to close is a little early for my liking, and the hot food at the snack bar is removed just after then also. Also, in the snack bar it would be good to provide butter as the sandwiches/rolls are a bit dry without it.", "title": "A fab week at the broncemar......", "helpfulness": 6, "user": "prestons5", "date": "May 10, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 129692775}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "The hotel caters very much for young families, however it was not intrusive and the reps don't hassle you if you don't want to participate. Money to be won at bingo if you're interested. In the evening we did tend to go out - we went to the hotel pub on the first night, which opens at 9pm until midnight. The one night we wanted an early night we made to go there (Wednesday) but it was closed! The only option was the kiddy entertainment by the pool, so we went out again. The holiday had been such good value though (we only paid about £700 for the 2 of us) so I felt that our budget allowed for us to go out of an evening.", "title": "Wonderful place Great for the whole family", "helpfulness": 4, "user": "lfcscaffolding", "date": "May 10, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 129687425}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "The resort is great - only 10 minutes from the airport ($15 by taxi including tip), lots of dining options (prices pretty reasonable) and bars. We thoroughly enjoyed our week there and would have no hesitation in recommending it to anyone. It's not fancy but it really does have everything you need and it's clean/food is very good.", "title": "Restful and enjoyable holiday", "helpfulness": 4, "user": "celand23", "date": "May 9, 2012", "detail_rating": {"service": 4.0, "cleanliness": 2.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 129676140}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "stayed at the broncemar from 2nd may for a week, me, the wife, and 4 kids age 18,16,10,3.", "title": "A really enjoyable holiday", "helpfulness": 6, "user": "Suzy P", "date": "May 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 129641880}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled with family", "text": "This is a great hotel. The apartments are roomy with double bedroom, bathroom with constant hot water, kitchen and living room with a tv. Unfortunately the tv is coin operated at a Euro per hour . . . . . but then again you don't go on holiday to watch tv ! Everything is very clean and most of the staff are very friendly. The food is wonderful with plenty off choice. The shops and bars are are a couple of minutes walk away and the large, uncrowded beach is only 6 or 7 minutes walk away. Coleta is a quiet resort, great for families and couples . . . . . if you want to party . . . . . don't come here ! We came with our 6 month old daughter and everyone made a real fuss of her and we had a great time. I'll be back again and i thoroughly recommend this hotel. Book with confidence and enjoy !", "title": "Totally recommend this excellent hotel.", "helpfulness": 1, "user": "PengamPete", "date": "December 11, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 89573412}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "Everything about these apartments was first class,very clean and tidy,lovely terrace for sun bathing,nice gardens,They have a lovely family of feral cats which i enjoyed feeding and they have their own cat cafe in the garden and it wouldn't be the same without them thanks to Twinkle trust animal aid,everyone was saying how they loved the cats and i will definitely be going back there.", "title": "very good", "helpfulness": 1, "user": "gussy-44", "date": "December 8, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 89320712}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled with family", "text": "This is the third time that my family and I have stayed at this hotel, and cant reccommend it enough if you have young kids. Rooms are spacious and clean, staff are very friendly and the kids club and entertainment teams do a fantastic job.", "title": "Stop Moaning", "helpfulness": 1, "user": "si2468", "date": "December 7, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 89242185}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled with family", "text": "To all those people who cant stop moaning about food and accommodation, then by all means pay an extra £1500 for the week and stay at the 5* Sheraton in one room, on a room only basis. Thats 3 times more than we paid for a two bedroom apartment with lounge , kitchen, balconey and patio on an all inclusive basis. Hmmmm !", "title": "Fantastic value for money. Well recommended.", "helpfulness": 2, "user": "scott9705", "date": "December 6, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 89150342}, {"rating": 1.0, "stay_parameters": "Stayed September 2010, traveled with family", "text": "If you want a quiet ,family friendly resort where you and the kids can relax then this is the place to go. So please ignore the whingers who will always find something to moan about .", "title": "Yuck", "user": "berrykerrie", "date": "December 2, 2010", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 1.0, "sleep": 1.0, "rooms": 3.0, "location": 3.0}, "id": 88817493}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled with family", "text": "Have just returned for an 11 night all inclusive break at the Broncemar Beach and all I can say is we didn’t want to come home.", "title": "FANTASTIC HOLIDAY, GREAT HOTEL", "helpfulness": 2, "user": "kesmars", "date": "December 29, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 91004546}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "From the moment we checked in nothing was too much trouble for any of the staff. Reception are very efficient and nothing is too much trouble and things get sorted instantly the only thing we had an issue with was we requested a double bed and were given singles but this was sorted within 5 minutes of us checking in.", "title": "Great Hotel - Will book again soon!", "helpfulness": 2, "user": "sunrovers", "date": "December 28, 2010", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 90919544}, {"rating": 3.0, "stay_parameters": "Stayed December 2010, traveled with family", "text": "The bedroom was very large with a nice kitchen area and big bathroom we were 2 adults, 1 teenager and 1 child and we never felt cramped. Patio doors took you out onto your own terrace with table and chairs and it was nice to sit and enjoy a cuppa after a day around the pool. You have to pay for the safe and tv in the room but was very reasonable.", "title": "Great value, great service but beware cockroaches....", "user": "thepartridgefamily", "date": "December 28, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 4.0, "sleep": 2.0, "rooms": 2.0, "location": 4.0}, "id": 90914247}, {"rating": 4.0, "stay_parameters": "Stayed December 2010, traveled with family", "text": "Rooms are cleaned every day apart from one and we had our towels changed at least 5 times and sheets which were nice thick cotton changed about 3 times. Never seen a cockroach or ant in the whole complex the entire time and never spoke to anyone who had any issues with them either. The hotel staff are constantly cleaning the hotel and also around the pool and while we were there they took all the plastic grates around the pool up to clean them and also all sun beds and tables were being cleaning. Workmen were repairing broken tiles etc around the whole complex so you can see that a lot of work is being and going to be done to update the hotel and talking to staff they are going to be updating all the bedrooms. I think give then a couple of months and the whole place will have been updated as the manger was always with different workmen getting quotes for jobs to be done and after a couple of days new furniture arrived in reception and was very nice.", "title": "Ignore the moaners.......great holiday for what you pay!!!!", "helpfulness": 1, "user": "Killer-Darts-Champ", "date": "December 20, 2010", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 5.0, "location": 4.0}, "id": 90282796}, {"rating": 1.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "The food was great so much choice everyday and we only seen the same dishes once in the 11 nights. These people who complain that there was always chicken, pork, beef and fish everyday what else do you want? Yes every day it was chicken, pork, beef and fish but always cooked in a different way and always very tasty and very hot and replaced before it had all gone. I have 2 very very fussy eaters and they never had a problem with any of the food and enjoyed it everyday. My daughter has a very severe allergy and they made sure if none of the food was suitable for her they made her something special, the staff made a point when we went into the dinning room to tell us what she could eat or the chef would bring her something out and even stopped putting chocolate sprinkles on the jelly for her. We have stayed in 5* hotels where the food has been worse than here. The staff in the dining room were very friendly and always smiling and talking to us and make a big fuss of the kids.", "title": "Don't go!........", "user": "piggy31", "date": "December 11, 2010", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 2.0, "sleep": 1.0, "rooms": 1.0, "location": 3.0}, "id": 89580415}, {"rating": 2.0, "stay_parameters": "Stayed January 2011", "text": "I would like to start this review by saying yes i know its 3 star and have stayed in 3, 4 and 5, but would rate this more 2, maybe we just caught them on a bad week.", "title": "Happy holiday, Unhappy staff!!!", "helpfulness": 1, "user": "car0line1", "date": "January 9, 2011", "detail_rating": {"service": 1.0, "cleanliness": 2.0, "value": 2.0, "sleep": 1.0, "rooms": 2.0, "location": 3.0}, "id": 92278645}, {"rating": 3.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "Apartments - our room was large, with a balcony and large terrace which was great and the room had good facilites, however the beds are awful, the towels were very smelly and tatty, and we did not get ours changed for 3 days. The room had dampness and after a day in the sun we would return and our clothes and bedding would be damp. Also just a wee note a member of our group has money stolen from apartment and a got chatting to a neighbour and she also had money stolen this was reported to reception but still waitin!", "title": "ok for families - great location", "user": "bluejohncharles", "date": "January 4, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 91752164}, {"rating": 3.0, "stay_parameters": "Stayed September 2010, traveled with family", "text": "Food - well yes it is three star and although if not a fussy eater there was somethin most days, however in our group and talking to other guest a few ended up with dodgy tummys again i repeat it was 3 star!", "title": "Been 3 times, going downhill slightly!!", "user": "Walkers81", "date": "January 2, 2011", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 2.0, "location": 5.0}, "id": 91425390}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled with family", "text": "Entertainment - the girls done really well and for it being out of season you could of been forgiven it was july they were very enthusiastic so well done girls. The 1st night of our arrival the guy who done the karaoke walked out, but he returned the next and we were so glad he did FANTASTIC got us all goin and played really good music in between songs, sadly he was only there until wednesday and was then replaced, well can not really say much about him!!!!!!!!!!!!!!", "title": "top class 4th time coming soon", "helpfulness": 1, "user": "richarddsp", "date": "January 2, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 91424063}, {"rating": 4.0, "stay_parameters": "Stayed December 2010, traveled with family", "text": "Staff - I begin this by saying these guys and girls work really hard long hours and have to put up with some not nice people, however we were part of a large mixed groups age range 13 - over 50's who were all extremely polite and we always cleared our tables and the pool area we were at but the bar staff apart from Hose were some the the rudest, misrable and cheeky that i have ever met and this really really does let this hotel down. When we arrived we were met by a very friendly efficient receiptionist and the lady who works in the resteraunt were always polite, cheary and willing to assist, i can not comment on the maid as never seen her. For those wishing to complain to the managment dont bother he makes Mr Grumpy look like santa.", "title": "great holiday!", "helpfulness": 2, "user": "kelchris75", "date": "December 29, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 91041510}, {"rating": 4.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "Clean basic apartment in need of a lick of paint. Nice to have full size appartment whilst on all inclusive. Cost of inclusive on booking Thomas Cook late deal less than £20 per person per day which was brill in a resort where meals are about €10 a head and drinks €3 - €4 each (and even dearer in the Complex.) Excellent pools with plenty of sunloungers. Close to commercial centres and 5 - 10 minutes tops to beach with no hills. Entertainment team did a really good job working tirelessly all day and evening. All staff friendly but special thanks to Hose the pool bar waiter who looked after our every need at every opportunity. Downsides? = one Euro an hour to watch TV a bit petty.", "title": "Very good value for money.", "helpfulness": 1, "user": "Bluechippy", "date": "January 22, 2010", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 3.0}, "id": 54092066}, {"rating": 3.0, "stay_parameters": "Stayed January 2010, traveled with family", "text": "Just got back from broncemar beach and had high hopes after reading many positive reviews. Apartments were nice enough. Basic and well cleaned throughout the week. We went b&b and were made to feel quite uncomfortable by staff especially the main woman on reception who was very ignorant and the twitchy man in the dining room who ran over the minute you walked in to check you were entitled to be in there. Most guests were all inclusive and wore the obligatory wristbands so you felt out of place not having one. You could upgrade once there at a cost of 28euros pp pn which for my family of four would have been extortionate. 112euros per day. I dont think so. Drinks expensive from on site bars. 4euro a beer 3euro soft drink. Pool area very nice and thomas cook team were fantastic with my boys. Especially Luke and Carrie. Breakfasts were nice with plenty of choice. Did not see a single cockroach on the complex the whole time we were there. The resort itself was very quiet and very expensive. 50-60euros a night to eat out just one cousre with a beer and three soft drinks. Dont bother with the supermarket at atlantico as the hiperdinos near apartments are pretty much the same prices. Gambrinus restaurant attatched to the hotel is decent and you get 15%discount if you ask for card at reception. Patrick who works there is fantastic with kids. Also fado rock steak house is out of this world for food. This was our first and last time on fuertaventura as lanzarote and tenerife are much better value for money. All in all had a very dissapointing week.", "title": "ok, but not for us!", "user": "talmick", "date": "January 14, 2010", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 3.0, "service": 2.0, "rooms": 3.0}, "id": 53496306}, {"rating": 4.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "My husband and i have just come back from the broncemar 11th jan,", "title": "lovely spacious apartments and in a great location", "helpfulness": 1, "user": "dustynewcastle", "date": "January 13, 2010", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 53372472}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "our first impressions were how big the apartments were and how clean it was .", "title": "Fantastic family holiday - suitable for all ages.", "user": "mrsmoleStHelens", "date": "January 12, 2010", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 53294420}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled with family", "text": "we were all inclusive , but we had a fully equiped ktchen with microwave and fridge ,there were2 balconys , one facing the pool area which was big with 2 loungers and table and chairs ,and the other was outside the bedroom.", "title": "brillant family holiday", "helpfulness": 1, "user": "xkelly1", "date": "January 10, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 53101841}], "location": {"country": "Spain", "continent": "Europe"}, "stars": 3, "variance": {"poor": 125, "average": 320, "very good": 610, "terrible": 84, "excellent": 349}, "aka": "Broncemar Beach Hotel Caleta De Fuste", "slim_ranking": 0.238095238095, "detail_rating": {"service": 3.5, "cleanliness": 3.5, "value": 3.5, "sleep": 3.5, "rooms": 3.5, "location": 4.0}}