{"user_rating": 4.0, "review_count": 35, "name": "Brother s Cove Log Cabin Resort", "reviews": [{"rating": 5.0, "title": "A cabin in the mountains", "text": "We spent a week at Brother's Cove, a gated log cabin community 5 miles into Wears Valley away from the traffic and activities of Pigeon Forge. We found it via an internet search and were not disappointed. Style and standard of cabin were excellent, and as advertised. Staff friendly and helpful, nothing was too much trouble, they helped us Brits make the most of our stay with tips and hints on places to visit.. In fact every place we visited in Tennessee we were met by friendly and helpful people. Scenery was stunning, weather so hot, another great trip over the pond !!!", "user": "Datchet", "date": "October 24, 2007", "id": 10283367}, {"rating": 2.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "While we did enjoy our stay (who couldn't/such a beautiful place in our world?), I was extremely disappointed that they did not respond to my e-mail asking for a discount or some money back because both of the jacuzzi tubs were just tubs and did not jacuzzi because they were either broken or never worked. One person staying with us was looking forward to this, and it was a huge disappointment to him. No response from Brothers' Cove. Also, as to their new \"gated community\". What a joke. We checked in and the gates were broken. The young lady checking us in indicated that they were broken most of the time. The reason became apparent on the last night we were there as we decided to venture out and didn't return until 9 pm or so and the office was closed and our access code did not work and there was no emergency number. We were only able to get in because we sneaked in when someone left. This took about an hour, and a good chunk of time out of our vacation, and again, no response to our e-mail to Brother's Cove. I guess you can figure out why the gates are always broken because frustrated paid visitors have to force their way through the gates, possibly? Still, would enjoy staying there, but am extremely disappointed that they don't seem to care and did not respond to my e-mail.", "title": "They obviously don't care", "user": "chelmat", "date": "August 8, 2007", "detail_rating": {"front_desk": 2.0, "service": 1.0, "cleanliness": 5.0, "value": 2.0, "rooms": 5.0, "location": 5.0}, "id": 8376191, "likes": {"liked": "— cabin was absolutely beautiful", "disliked": "— they did not respond to my concerns"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007", "text": "Brother's Cove was the best place we have ever stayed in the Smoky Mountains. We wanted to stay away from the strip in Gatlinburg. This resort is seven miles from Pigeon Forge. We booked Brown Bear Lodge. This was a 3 bedroom chalet. We had three adults and three children. We could not believe that this chalet actually lived up the pictures on the internet, as isn't the case a lot of the time. Our place was brand new and obviously professionaly decorated. There was a fireplace on the deck next to the hot tub.We had our 1, 6 and 9 year old girls with us. They had a ball. The view was spectacular. We had 4 rockers and a swing. We spent most of the time on the deck. The only downfall to Brother's Cove was the drive to our chalet. The last mile was a little scary, GO SLOW! The resort pool was awesome. I think it was a salt water pool. We totally recommend Brother's Cove.", "title": "Top Notch!!", "helpfulness": 4, "user": "TripinBrums", "date": "July 7, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "business": 5.0, "cleanliness": 5.0, "rooms": 5.0, "location": 5.0}, "id": 8073039, "likes": {"liked": "— The pool", "disliked": "— harrowing drive to the chalet"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "My new husband and I just got back from a week in cabin #41 Dream Catcher on our honeymoon. I probably wouldn't have left the cabin had it not been for my husband. It was beautiful. The cabin was very clean (the hot tub was spotless.) The TV in the game room had a remote that didn't work, but we didn't watch that TV anyway. Although there were other cabins around, we always felt very secluded. There was not internet access in our cabin (which I would have liked, but oh well it was kind of nice not having it.) The location is great because it is close to Pigeon Forge, but far enough away that we didn't have any of the noise or anything. The views are great. If you want to sleep in then bring a eye cover sleep mask with you, there are a lot of windows in the cabin and not all of the higher ones have curtains, so it was kind of hard to sleep in. We had a wonderful honeymoon and when we go back we will most certainly be staying at Brothers Cove.", "title": "Great Place!", "helpfulness": 1, "user": "SBH0078", "date": "April 30, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 15515538, "likes": {"liked": "— The view", "disliked": "— No internet access"}}, {"rating": 2.0, "title": "loved the view", "text": "There were 8 of us on the 4 day 3 night vacation. When we arrived we thought this is great; but the refrigerator was dirty, my sister was bitten by a spider or scorpion (while asleep) the first night, There was a leak from one of the bathrooms on the 2nd floor to the bedroom below on the first floor. I called the office about the leak and the maintenance man came out a fixed it (it still leaked but not as much). When I told the lady in the office that my sister had been bitten by a spider she laughed and said that we were in the woods. I think that she needs to attend some customer contact classes. I was always told that the customer is always right. We asked twice on the phone and once in the office to talk to the manager but he was never available. We were told that he was on the grounds or that he did not work weekends.", "helpfulness": 1, "user": "treas53", "date": "April 23, 2008", "id": 15292821}, {"rating": 1.0, "stay_parameters": "Stayed March 2008, traveled with friends", "text": "Our experiece with this cabin rental was horrible. The water in our cabin was really yellow. We couldn't even take a bath. The hot tub was too full and when we got in it overflowed. The pass code they gave us to open the gates was incorrect so when we came back late a night we couldn't get into the resort. We had to wait until someone came out so that we could go to our cabin. They didn't offer any discount for the problems we had. We will never return to this resort!!", "title": "Bad", "user": "davidson1217", "date": "March 24, 2008", "detail_rating": {"front_desk": 2.0, "service": 2.0, "cleanliness": 3.0, "value": 1.0, "rooms": 1.0, "location": 2.0}, "id": 14486255, "likes": {"liked": "— Soft beds", "disliked": "— Nasty water"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled with family", "text": "My wife, daughter & I just returned from a wonderful stay at Brother's Cove. We stayed in cabin #39 ( Buck's Lookout). This cabin is on the top of the mountain with great views in all directions. We got to see both sunrise and sunsets. The staff was very friendly and helpful. We enjoyed our stay so much that we have already reserved a cabin for the entire family (6 adults & 3 kids) for a stay in May and December. If you like peace and quiet you will love this place. It is only about 8 miles back into the center of Pigeon Forge.", "title": "Breathtaking view", "helpfulness": 3, "user": "Sun&Sand", "date": "January 25, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 12990036, "likes": {"liked": "— The view", "disliked": "— Having to leave"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled with family", "text": "We heard about this place through an article in Southern Living Magazine who gave it a great rating. We were not disappointed! We booked this location for an after Christmas getaway with our two daughters, aged 22 and 25. Our cabin (#60, Serenity) was 3 story with 3 bedrooms, all with king-sized beds. It was very spacious with a well equipped kitchen and plush furnishings. It poured rain our first full day on the property, so we stayed indoors and enjoyed the amenities of the cabin. The big screen TV, hot tub and pool table helped make our stay very enjoyable. The place was well built and very clean. We will definitely return! We have been to this area many times over the years, but this was the best cabin we had ever rented. I highly recommend this property!", "title": "Fabulous", "helpfulness": 3, "user": "cindyrobinson", "date": "December 31, 2007", "detail_rating": {"cleanliness": 5.0, "front_desk": 5.0, "location": 5.0, "value": 5.0, "rooms": 5.0}, "id": 12146630, "likes": {"liked": "— very spacious", "disliked": "— nothing"}}], "location": {"country": "United States"}, "variance": {"poor": 5, "average": 0, "very good": 4, "terrible": 3, "excellent": 23}, "aka": "Brother s Cove Log Cabin Hotel Sevierville", "slim_ranking": 0.243243243243}