{"user_rating": 4.5, "review_count": 429, "name": "Brufani Palace Hotel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "Only one night, unfortunatly at this Super Hotel in Perugia. Great service, beautiful rooms, excellent location ( ferris weel outside the main entrance ruined the appeal of this beautiful historical Palace). Staff at front desk full of suggestions with a smile. You can tell as you check in that this is a very well managed Hotel. Breakfast room is Grand with an ol' time atmosphere. Spa located on lower level, with swimming pool. We shall return.", "title": "Above expectations", "helpfulness": 1, "user": "vincent k", "date": "December 23, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 122017097}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled on business", "text": "There's a reason if everyone knows the Brufani in Perugia: it's one of the city's institution.", "title": "Best place in Perugia", "helpfulness": 1, "user": "Lozio", "date": "December 22, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 121975148}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "The hotel has elegance and comfort.", "title": "Romantic Hotel, excellent service.", "helpfulness": 2, "user": "donald m", "date": "December 11, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121614006}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "Staff is warm yet very professional. They like to pamper you.", "title": "Outstanding!", "user": "milton k", "date": "December 3, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121345688}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "Centrally located, the Brufani is perfect for business and for your holidays with your loved one.", "title": "Beautiful hotel", "helpfulness": 2, "user": "Lorna353", "date": "November 13, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 120540551}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "Just back from a long weekend in Perugia, and we were spoilt rotten in the Brufani, the staff are so good, and helpful, from the breakfast staff to reception, to the bar staff for drink before bed, all so pleasant, the hotel is lovely, very old worldy and bedroom comfortable with stunning views. Location good also.", "title": "All aspects - wonderful", "helpfulness": 2, "user": "smog1", "date": "February 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 123987141}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "Brufani is at the top of the hill overlooking the valley. The view from the room was breath-taking. The rooms are unique, comfortable and clean. The exceptional, helpful staff provided outstanding service. The food was quite good. I would definitely return.", "title": "A perfect two days", "helpfulness": 2, "user": "Walking16", "date": "January 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 123119387}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "Excellent service from the very beginning. Easy check in at front desk with a smile (it helps a lot!) Rooms are lovely, very well decorated and warm. You can park your car outside or have valet from the garage. Ideal for downtown walk and shop. Breakfast above Italian standards but what make this Hotel grand is the attitude of the staff. Fabulous!", "title": "Excellent.", "helpfulness": 1, "user": "henry w", "date": "January 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 122719968}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "My wife and I decided to stay at Bruffani for 2 nights over Xmas to allow easy access to Perugia's many excellent restaurants. From the moment we arrived we expereinced excellent service. Even though our room was booked at a good on-line rate we received an upgrade to a lovely big room. Also the hotel parked our car for us outside saving us the Euro 30 per night parking charge.", "title": "Exceeded our expectations", "helpfulness": 1, "user": "Dubaiexpattraveller", "date": "January 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 122639291}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "We did not eat in the hotel but enjoyed an excellent breakfast.", "title": "Just perfect.", "user": "lajollatraveller", "date": "December 29, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 122214201}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "Stayed here four five nights in August in a junior suite at the top corner of the hotel with views over the two vallies. Superb room, bath tub, sperate shower, verandahs, sitting area, two Tvs. Good breakfast but evening resaturant was too formal for us. Nice bar with outside sitting area on piazza. Elevated position meant there was often a breeze. Very small pool in basement looked interesting but whenever we wanted to have a swim it was occupied by children and families. Two children and two adults virtually filled the pool.", "title": "brilliant Brufani", "user": "Maldoc", "date": "September 15, 2007", "detail_rating": {"cleanliness": 4.0, "front_desk": 5.0, "location": 5.0, "value": 5.0, "rooms": 5.0}, "id": 8720544, "likes": {"liked": "— Superb views", "disliked": "— Stuffy formal restaurant"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "The Brufani is an oldy-world, expensive, hotel located in the centre of Perugia. The rooms on the south side - in one of which we stayed - provide wonderful views of Perugia and the surrounding countryside. The rooms are large, include a king bed, (generally) excellent bathroom, and the service is excellent.", "title": "Excellent, oldy-world hotel in the centre of historic Perugia", "helpfulness": 1, "user": "JohnEO", "date": "August 27, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 3.0, "location": 5.0, "rooms": 5.0}, "id": 8513974, "likes": {"liked": "— The friendlly, helpful, staff", "disliked": "— Some plumbing problems"}}, {"rating": 2.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "We stayed one night between leaving our timeshare in neighbouring Toscana and returning home from Perugia's tiny but efficient and friendly airport. Arrived about noon. No problem with early check in, but the witty reception clerk told us we had committed an offence by bringing our car into the zona limitato. (They get you to sign a waiver at no cost. This is common in Tuscan and Umbrian hill towns). Wonderful portiere unloaded our car from the front door and whisked our luggage to the excellent room. Wanted to park out front (free) but the Saturday market pre-empted that. The car was put in the garage. We were told it would be moved later. It was not. However, despite the ominous €31 euro per night price tag, we were not charged on check out.", "title": "No 5 stars hotel", "helpfulness": 3, "user": "Borreke", "date": "August 15, 2007", "detail_rating": {"front_desk": 2.0, "service": 3.0, "cleanliness": 2.0, "value": 2.0, "rooms": 2.0, "location": 4.0}, "id": 8425555, "likes": {"liked": "— The King size bed", "disliked": "— Very noisy airco and room"}}, {"rating": 3.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "We are regular visitors to Perugia, so we spent most of the day walking, sipping coffee and eating gelati. All wonderful sociological experiences!", "title": "Overpriced but leading hotel", "user": "globetrotterfirst", "date": "July 15, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "location": 3.0}, "id": 8121841, "likes": {"liked": "— location", "disliked": "— Breakfast experience"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled with friends", "text": "Showering for dinner identified some problems with the bath drainage and the fittings, but these had been efficiently fixed on our return from dinner, with apologies. (We took the advice of a previous review and made reservations at Il Padrino. This is not a tourist restaurant; all diners, except us, were locals. Hardly haute cuisine; turned out to be a set meal, incl. wine and coffee - all for €50. As in most restaurants in Tuscany and Umbria, the food was more than passable, although the wine list is very limited.)", "title": "Beautiful view", "helpfulness": 1, "user": "jankoke", "date": "June 11, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7836267, "likes": {"liked": "— Clean and the food was terrific!", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "This hotel is at the edge of the main historical center and very easy to access by car. We had a very good sized room with a French balcony overlooking the valley - beautiful view and lots of fresh air. The air conditioning was turned on! Staff is very professional and helpful. The breakfast buffet was very good. We chose to park our car with the hotel which might have been expensive, but saved a some headaches of looking for a spot. The bellmen were very good. Front desk service depended on the person. Two sinks in the bathroom was a pleasant surprise. All-in-all an excellent choice.", "title": "Excellent location and a great value in May", "user": "msanta", "date": "May 9, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 129662587}, {"rating": 2.0, "stay_parameters": "Stayed May 2012, traveled on business", "text": "Today is May 4. I have been staying in this hotel the past 4 days and I will depart tomorrow. The hotel is beautiful, the staff is incredible, the beds are very comfortable, and the location is the best. The problem is turning on the hotel air conditioning. We are between seasons and the management will not turn on the AC. My room has been very hot (above 80 degrees every night). I've left the windows open but there is very little draft to cool the room down. There are no fans available to the guests and the front desks says there is not plan to turn on the air conditioning right now. So I post this to give any reader a heads up. Call the hotel before you make you reservation. If the AC has been turned on, do not hesitate with your resevation. However if the AC has NOT been turned on, I would think twice before making a reservation, the rooms are hot and it is very difficult to cool the rooms down. The wether outside is great, sunny and a high of 70.", "title": "call before you make your reservation", "helpfulness": 1, "user": "CTCurt", "date": "May 4, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 2.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 129344271}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "This hotel dates from the 1920s - the public parts of the hotel are really lovely with all of the beautiful detail...staircases, timber work, fireplaces. The staff were mostly...we only found a couple who were not terribly helpful. Our room was downstairs and quiet, but we felt a bit out of it and would have preferred a room upstairs. We were upgraded to a suite, a vast room for two people, we felt like goldfish in the ocean. The lounge room furniture was a bit formal and decorative, not lounging furniture, so we used the bedroom....watched tv in bed. The views were great, fabulous from the terrace just outside the hotel. The pool and gyn are worth trying, a grotto with clean pool, steam rooms and small gym. We had breakfast at the hotel, we felt it was worth the money and we couldn't find anywhere in the old town who did breakfast and we got over pastry and sandwiches very quickly, so if you enjoy your cereal, fruit, toast or eggs, eat at the hotel. Great location, it was nice wandering around the old town, found a great expresso bar in the street behind the hotel and a pub....many if the buildings have vaulted ceilings. We'd recommend this hotel to friends and family...the hotel bar is nice as well after a hard day of walking and eating.", "title": "Very nice historical hotel", "user": "evansbrown", "date": "April 27, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 128767879}, {"rating": 5.0, "title": "Perfect in every way -\" a jewel\" of a hotel", "text": "We absolutely loved this jewel of a hotel. We stayed 9 nights and it was a perfect and delightful setting for our visit to Umbria.-It is well situated in the heart of Perugia yet it is a quiet,ralaxing,luxurious and romantic place.", "user": "A TripAdvisor user", "date": "April 24, 2012", "id": 128495401}, {"rating": 5.0, "stay_parameters": "Stayed March 2012", "text": "From the moment we arrived we were greeted by helpful and friendly staff and shown to our elegant, beautifully furnished and spacious suite. In addition we had an amazing view of the surrounding countryside and hilltowns from our private and very spacious balcony .Welcomed like royalty to a hotel which is indeed a palace.The staff are dedicated and with a passion to please in every way and we were shown true Italian hospitality .", "title": "Superb in every way", "user": "lewhoff", "date": "April 16, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 127967990}, {"rating": 5.0, "stay_parameters": "Stayed June 2007", "text": "This hotel was part of our Tauk tour and earned its 5 stars. Only 96 rooms (many of them suites). If you get one on the south side you will be rewarded with commanding views of Perugia in the valley below.", "title": "High on a Hill", "helpfulness": 2, "user": "AHW", "date": "June 10, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 7827873, "likes": {"liked": "— Comfort and food", "disliked": "— Shopping"}}, {"rating": 3.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "Our room had a balcaony (open for morning sun and fresh air), king size bed, decent size wardrobe (be sure to use the fluffy bathrobes!) but a small batroom (the tub/shower combo was awkward to enter).", "title": "Fabulous position!", "helpfulness": 1, "user": "Madge1", "date": "February 5, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 3.0, "rooms": 2.0, "location": 5.0}, "id": 6746983, "likes": {"liked": "— The position", "disliked": "— The furnishings"}}, {"rating": 3.0, "stay_parameters": "Stayed July 2006, traveled on business", "text": "The kitchen was magnificent. We had two dinners there that were outstanding (I'll be talking about the strawberry parfait dessert for the rest of my life). Our tour included a chocolate cooking demonstration (Perugia is famous for chocolate) ending with tasting chocolate souffle's (forget the calories and enjoy)", "title": "Beautiful, but some negative points...", "helpfulness": 8, "user": "GCEK", "date": "October 27, 2006", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 2.0, "location": 5.0, "rooms": 2.0}, "id": 6018492, "likes": {"liked": "— Views, position", "disliked": "— Terrible door entry system"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "We decided to go last minute to Perugia for two nights to look at a venue (two villas) nearby, to hold my husbands 50th in June which turned out to be perfect (www.racchiusole.com).", "title": "Very nice", "user": "c7999", "date": "September 22, 2006", "detail_rating": {"cleanliness": 5.0, "front_desk": 5.0, "location": 5.0, "value": 3.0, "rooms": 5.0}, "id": 5827481, "likes": {"liked": "— views", "disliked": "— price"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled on business", "text": "I read the reviews on this site and also looked at the hotel's own website and had a few reservations! It did look old fashioned, so I was expecting that. We booked a junior suite - the bathroom was modern and a good size with separate bath and shower and double basin. Although there were downlighters, they were not aimed at the mirror so shaving and make-up were quite difficult!", "title": "Beautiful Hotel", "helpfulness": 7, "user": "drakey", "date": "August 27, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 5714198, "likes": {"liked": "— Style"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled with friends", "text": "A delightful setting for our headquarters while touring in Umbria! When the guide began our Umbrian tour in the elegant lobby by reviewing the history of the place where we were standing, this was a portent of even better things to come. The charms of the hill towns were matched by the charms of the Brufani Palace---its distinguished period decor, comfortable well-appointed rooms, unmatchable spa pool with viewable archaeological excavation beneath, and generous, beautifully-presented breakfasts. The star in its crown was the warmth, friendliness, and thoughtfulness of the staff from the front desk to the breakfast salon and everywhere in between. Our first and best choice in Perugia!", "title": "Historic, Elegant, and Charming", "helpfulness": 1, "user": "JFWalters", "date": "March 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 126919589}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "This old Palace was the cherry on our cake! Very romantic Hotel, rooms are fantastic with fantastic views. Not to mention the little spa with an amazing see trough bottom swimming pool!!", "title": "Romantic........", "user": "northwestern1435792", "date": "March 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 126398358}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled with family", "text": "Everyone at this lovely Hotel was super nice, concierge service with a smile. Breakfast simple but fresh and served in a Grand Salon. We will recommended to our friends.", "title": "Wonderful service, great location", "user": "Cornelia B", "date": "February 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124867131}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "This is a little paradise in the middle of old town Perugia. The service is outstanding, the staff very friendly and always ready to help. We stayed there for 7 nights and we had not once one complaint!!! We will recommend this Hotel to anyone going to Perugia. Fantastic breakfast in an old stile ballroom setting. The pool - you have to see it - just beautiful.", "title": "Just the best of our trip.", "user": "desrtfoxes", "date": "February 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124644446}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "We spent 3 nights before Christmas. Wonderful experience, beautiful rooms and spa, very nice breakfast, all of that downtown Perugia, in walking distance from everything. Staff polite and well trained, priced like a 3 stars in Rome. fantastic stay!!!", "title": "Cozy, warm, fantastic.", "user": "245mrsjane", "date": "February 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124598204}, {"rating": 3.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "The once-glamorous Brufani has seen better days! We didn't have a bad stay but everything seemed faded and stuffy. The staff was not knowledgable regarding restaurants. The hotel lacks the charm that one expects from Italy.", "title": "Old & Musty!!!", "helpfulness": 2, "user": "Saisawan", "date": "December 8, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 3.0, "cleanliness": 2.0, "value": 2.0, "location": 5.0, "rooms": 3.0}, "id": 22534142, "likes": {"liked": "— The location and the view", "disliked": "— The smell"}}, {"rating": 3.0, "stay_parameters": "Stayed November 2008, traveled with family", "text": "With that said, the hotel is beautifully located. It has spectacular view and easy access to restaurants, night life and sites.", "title": "Spectacular View", "helpfulness": 2, "user": "BrittaE", "date": "November 20, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 3.0, "rooms": 4.0, "location": 4.0}, "id": 22028121, "likes": {"liked": "— Views, decoration, location", "disliked": "— breakfast !!!"}}, {"rating": 2.0, "stay_parameters": "Stayed October 2008, traveled with family", "text": "If you have to pay a full rack rate, you will likely be disappointed!", "title": "Only good for the excellent views", "helpfulness": 2, "user": "Jowies", "date": "November 15, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 5.0}, "id": 21872364, "likes": {"liked": "— Great Views", "disliked": "— Food5"}}, {"rating": 3.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "We stayed four days in a Deluxe double room. The room was very beautifull and had a spectacular view over Perugia. We loved the antique furniture and the perfect decoration. The bathroom was fine, too.", "title": "Disappointing stay", "helpfulness": 2, "user": "talkative", "date": "October 5, 2008", "detail_rating": {"front_desk": 3.0, "service": 2.0, "cleanliness": 2.0, "value": 3.0, "rooms": 4.0, "location": 4.0}, "id": 20648458, "likes": {"liked": "— Location & view", "disliked": "— Expense & lack of care"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled with family", "text": "The concierge gave us very good advice and was very helpfull and friendly as were all service people in the hotel.", "title": "Fantastic location, incredible views!", "helpfulness": 1, "user": "CheshireJosephine", "date": "September 20, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 20229189, "likes": {"liked": "— Location", "disliked": "— Breakfast"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "During our stay in Italy, me and my wife went to the GREAT hotel BRUFANE PALACE, in PERUGIA, where the staff gave us a special treatment, in a way that we felt we where the most important people in the world.", "title": "Perfect!!! Everything Perfect!!!", "user": "Mineirim", "date": "July 27, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 18307871, "likes": {"liked": "— The historical and beautiful building of the hotel."}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "We must also register that the staff guaranteed a unique journey in Perugia, with a treatment that was gave to us really kindly: just to example, a great champagne in my room, after the check-in with a upgrade to the great suite.", "title": "Loved this place!", "user": "k8modlock", "date": "November 29, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 11131660}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled on business", "text": "About the restaurant, what is that? Perfect!!! We had a dinner in our marriage birthday and they provide us a small gift: a cake to say congratulations because of the date.", "title": "Hotel of some class", "helpfulness": 1, "user": "BG_perth", "date": "November 23, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 11002847, "likes": {"liked": "— great royal style", "disliked": "— room rate and high charges for all services (except internet)"}}, {"rating": 1.0, "stay_parameters": "Stayed August 2007, traveled on business", "text": "We stayed here as part of our honeymoon and couldn't be more pleased.", "title": "Brufani Palace Overpriced and Disappointing", "helpfulness": 7, "user": "Traveller124", "date": "November 10, 2007", "detail_rating": {"front_desk": 2.0, "business": 2.0, "service": 5.0, "cleanliness": 2.0, "value": 2.0, "location": 4.0, "rooms": 2.0}, "id": 10737747, "likes": {"liked": "— Location - very central", "disliked": "— Hotel is old. Teh newer wing is nicer, but they charge for these rooms and then move people into the older part of the hotel."}}, {"rating": 3.0, "stay_parameters": "Stayed September 2007", "text": "In short, this place is in the best location, the staff are great, the rooms are lovely (in a grand Italian way) and the pool was a really good considering the hotel is in the centre of a very old town centre. The pool is underground and looks like it's in a cave/cellar... I really liked it!", "title": "OK but expensive", "user": "CAT2222", "date": "September 27, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 2.0}, "id": 10011450}], "location": {"country": "Italy", "region": "Umbria", "continent": "Europe"}, "stars": 5, "variance": {"poor": 12, "average": 49, "very good": 88, "terrible": 9, "excellent": 271}, "aka": "Brufani Palace Perugia", "slim_ranking": 0.117647058824, "description": "Traditional 4-story Hotel with many elegant touches, located on a hill at center of town."}