{"user_rating": 3.0, "review_count": 452, "name": "Brynowen Holiday Park - Park Resorts", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "I returned yesterday from a three night stay at Brynowen Park Resort and am very disappointed with my stay. My brother lives in Aberystwyth and so myself, my Mother, her partner and his teenage son stayed here on a Sun holiday booking in order to visit my brother. Incidentally, we stayed at this park in April last year, also on a Sun holiday, and we were absolutely astonished when we arrived and got the key to our van, to discover that we were in exactly the same van as our last visit! The van itself is extremely old and basic, with uncomfortable beds and not many utensils. However, after our last stay, we didn't feel it necessary to complain as we only stayed for two out of our three nights due to other committments. However, on this visit, the state of the van had only deteriorated further with stains on the carpet not having been cleaned, I found a childrens colouring in sheet and a broken bracelet under a cushion, the seat cushions kept sliding off the bases when attempting to sit on them, the springs in the mattresses were actually on the verge of piercing through the fabric, the bathroom door handle kept falling off and the toilet roll holder in the bathroom was broken and hadn't been replaced. Ok, so it was a £9.50 per person Sun holiday, however, people forget that this is only the initial cost. You also have to pay extra for entertainment passes, linen and also service charges, meaning that the total cost of the holiday JUST for the accomodation was over a hundred pounds. It is not unreasonable for me to suggest that this van is disgusting and is ready for destruction. The site itself is not too bad... Certainly a short walk up to the top levels of the site show where obvious care is taken to the grounds and walkways etc - I believe most of the vans up this end are privately owned. However, there are lots of scrap items lurking about such as bed frames and rubbish which wouldn't take much effort to hide just to tidy things up. There is a man who drives around the site all day on some kind of buggy with a trailer on the back in which I believe he transports dirty and fresh linen to vans - This man drives so very fast and doesn't appear to look where he's going. It is pointless having signs alerting visitors and other people to drive slowly if the site's own staff cannot even adhere to this - he is actually a danger to the many young children who freely run around the site. I have to admit, the entertainment in the evenings is good - even if it's not to your taste, at least there is something on which is inoffensive and is both appealing and suitable for children and adults alike, however, the prices of drinks are a complete rip off. On our previous visit, the price of a bottle of house wine was around the £9 mark - this time, upon asking for a bottle of house wine, we were given a bottle priced £15, which we later, upon asking again for the same bottle, were asked if we were sure we wanted that and not the house wine, discovered that we'd been charged for a more expensive bottle of wine than we'd asked for. The average cost of a drink is approximately £3.50 a pint, with soft drinks being over £2. I was charged £2.60 for a can of energy drink which I was told was sold at 60 pence in the smaller 'Patio Bar' which is open in the day on site. It is also worth mentioning that there seem to be far too many 'security' members of staff, largely, people in their late twenties, early thirties, who have delusions of authority. It seems that these people are actually glass collectors, but they wear t-shirts saying security on their backs. They carry walkie-talkies and are incapable of smiling. They are constantly walking around and watching your every move and I must say, I found this extremely uncomfortable and wholly unecessary. My advice here really would be, do not bother with the entertainment unless you are happy to pay absolutely extortionate prices for drinks, or drink in the van first then just go for one drink as I could literally have gone abroad for a week all inclusive with the money that this holiday cost. As I said, the entertainment is good - I can't really complain there, and the actual location of the site is brilliant if you want to be a bit further out than Aberystwyth, however, we will not be returning as we were just so disappointed.", "title": "Not worth it, even on a Sun holiday", "helpfulness": 2, "user": "rlvickers", "date": "May 10, 2011", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 2.0, "sleep": 1.0, "rooms": 1.0, "location": 4.0}, "id": 107667119}, {"rating": 3.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "With a good deduction from Tesco vouchers, our holiday proved to be cheap and cheerful. There are many scathing reviews regarding the caravans, however, we must have dropped lucky as ours was spacious, clean and had a great sea view!", "title": "Good value for money, facilities need updating.", "user": "eternaloptimist_11", "date": "May 5, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 107007726}, {"rating": 1.0, "stay_parameters": "Stayed April 2011, traveled with family", "text": "A meal at the onsite 'Patio Bar' was lovely and we couldn't fault it, just the surroundings could have done with a lick of paint. The pool was absolutely grotty. This is a good facility that is being overlooked and is in serious need of a paintbrush if not just a good deep clean. However, my four year old loved it so it wasn't all bad.", "title": "Dont Go!!!!", "helpfulness": 4, "user": "crunchie153", "date": "May 3, 2011", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 1.0}, "id": 106653727}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "Borth itself isn't the best seaside town but we found a great little part of the beach that was sandy and had rockpools which, again, my four year old loved. This was only a five minute walk from the site and with a picnic in tow we spent hours there.", "title": "Go for a Gold", "helpfulness": 1, "user": "Tkette", "date": "May 3, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 106624500}, {"rating": 1.0, "stay_parameters": "Stayed April 2011, traveled with family", "text": "Overall, you get what you pay for and a hundred pounds for five days was not bad at all!", "title": "Worst touring caravan site we have ever put our legs down on", "user": "4HappyCampersAndADog", "date": "May 1, 2011", "detail_rating": {"cleanliness": 1.0, "location": 3.0}, "id": 106321972}, {"rating": 1.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "The only advantage of this site was its proximity to the beach. Believe or not the manager was away this week so a lot of the facilities were not operating.", "title": "awful place", "helpfulness": 1, "user": "Johnehall", "date": "July 7, 2011", "detail_rating": {"cleanliness": 1.0, "sleep": 5.0, "value": 1.0, "service": 3.0}, "id": 115124250}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "Because of a family commitment we arrived a day late for our holiday at almost 11 p.m. I had phoned ahead and our keys were waiting with security. It took a while to find them but they couldn't have been more helpful especially when we'd been given a different van from the one we'd been told about on the phone. Next morning the office staff went out of their way to change our caravan; they chose a beautiful van that was being vacated, sent in cleaners to get it ready for us immediately and even offered to move all of our luggage etc for us if we had shopping to do! We were made to feel that nothing was too much trouble and that attitude was found in every single staff member we dealt with from the life-guards at the pool to the shop staff! The weather in Britain wasn't good this June but we had the best of holidays in a superb caravan with views out over the sea and the mountains to die for!! Everywhere we went staff smiled and greeted us, the site was quiet and spotlessly clean and we lacked for nothing that goes towards creating a wonderful holiday. What touched us most was that the housekeeping staff thanked US for being nice people!! We didn't take advantage of all that the site has to offer but we can't recommend Brynowen more highly.", "title": "Probably the most helpful staff ever", "helpfulness": 3, "user": "sheilahon", "date": "July 3, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 114974238}, {"rating": 1.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "Brynowen was the last choice of my 5 places to stay when I applied for a Sun holiday. I hugely regret putting it down as an option. Bear with me with this long review but I feel it all needs to be out there for people to know what they’re getting themselves in to.", "title": "Never again - old, run down, plain boring - be warned!", "helpfulness": 7, "user": "shaniannie", "date": "June 30, 2011", "detail_rating": {"cleanliness": 2.0, "sleep": 1.0, "value": 1.0, "service": 1.0}, "id": 114902380}, {"rating": 1.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "First of all, after completing the booking through the Sun we ended up upgrading to a Gold caravan (thinking it would be better.... more about that later) the total cost for a family of 5 (2 adults, 3 kids) for Mon-Fri in June was £250.00. Performing a search on the Park Resorts website after doing this we realised we'd actually paid MORE than if we had booked direct through Park Resorts! Nevertheless, nothing we could do, if we cancelled we lost our initial £50 sent off to the Sun so we just had to lump it.", "title": "bloody awfull - never again", "helpfulness": 6, "user": "CAIN_2011", "date": "June 26, 2011", "detail_rating": {"cleanliness": 1.0, "sleep": 1.0, "value": 2.0, "service": 2.0}, "id": 114769669}, {"rating": 1.0, "stay_parameters": "Stayed June 2011", "text": "Because we upgraded to a Gold caravan (at an extra cost of almost £100 from the bottom of the range bronze) we were allowed to check in at 1.30pm, however, we didn't arrive until around 4pm. My husband popped in to reception and was out within 1 minute with the keys to our caravan and a printed resort map with our caravan circled. I noticed immediately that this supposed gold caravan was right in the middle of all the caravans right at the entrance to the park that looked awful and had no space to park next to.", "title": "Will never go here again", "helpfulness": 4, "user": "Hanley2290", "date": "June 23, 2011", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "location": 3.0, "service": 1.0, "rooms": 1.0}, "id": 114682118}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "We booked a cheap long weekend away for the family on a newspaper voucher offer, we were another scepical visitor after reading some horrendous reviews. We arrived an hour early and were told the van was ready, which was a bonus. Our van was situated at the upper end of the site (Gwent) and we were nicely surprised when we got to our van, it was large, well equipped and very clean. two bedrooms, 2 toilets, large living room, flat screen tv, dvd, stereo, a selection of cd's & dvd's and situated on its own in a corner with lovely views...not what we were expecting!", "title": "Lovely caravan", "helpfulness": 5, "user": "chocka1", "date": "June 22, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 5.0, "service": 5.0}, "id": 114629175}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "It was used as a base for travelling the area so we didn't really use the facilities on site except to watch a comedian on the Saturday night with a couple of beers.", "title": "Caravan was fine and the kids loved it!", "helpfulness": 1, "user": "isaacm97", "date": "June 15, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 3.0, "value": 4.0, "service": 4.0}, "id": 113716808}, {"rating": 3.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "The van site is situated in Borth which is about 5/6 miles from Aberystwyth and the town is a little run down. 4 pubs, a curry house and amusement arcade The site restaurant shut at 7.30 which a little early for us so we ate out. We can reccomend the Railway pub, we had a very nice meal, large portions, good service and real ale. We toured the area, the weather was lovely and there are some really nice places to visit.", "title": "Not toooo bad after all the bad reviews.", "helpfulness": 1, "user": "Juliemufc", "date": "June 15, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 1.0, "value": 2.0, "service": 3.0}, "id": 113679971}, {"rating": 2.0, "title": "Never again!", "text": "We went with great trepidation after reading the reviews but we were really pleased with our caravan. It was clean, well maintained and well equipped. We were in the part near the road and the caravans were packed in, but it wasn't an issue.", "helpfulness": 1, "user": "teeandess", "date": "June 8, 2011", "id": 112285439}, {"rating": 2.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "We couldn't park by the caravan but again this caused us no difficulties. The kids loved the adventure. Although before we went we decided against the entertainment, so we can't comment on it, or the pool, which did look a bit dated but in terms of the caravan it was great and the location was a great spot to explore mid wales.", "title": "Seen better days", "user": "karensolihull", "date": "June 7, 2011", "detail_rating": {"cleanliness": 1.0, "sleep": 1.0, "value": 3.0, "service": 2.0}, "id": 111952954}, {"rating": 5.0, "title": "The kids say it was the best holiday they have ever been on!!!!!!!!!", "text": "We stayed here at whitsun. We had originally booked for 4 nights but as we were enjoying ourselves so much we stayed for an extra 3!!", "helpfulness": 3, "user": "ahick1205", "date": "June 7, 2011", "id": 111938897}, {"rating": 3.0, "stay_parameters": "Stayed June 2011", "text": "We had a 3 bedroom bronze caravan which was basic but very clean and we were located in the bottom area of the park. We were initially disappointed we couldn't park next to the caravan but saw the advantage of this as the week went on as we didn't have to worry about traffic when the kids were playing outside.", "title": "Wouldnt go here again", "user": "jellybean6587", "date": "June 7, 2011", "detail_rating": {"cleanliness": 1.0, "value": 2.0, "location": 4.0, "service": 2.0, "rooms": 1.0}, "id": 111937188}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "The Teamstars work extremely hard and the children fell in love with them. Thank you so much to Paige, Emma, Caroline, Matty, Zoe and Naomi - you really made the childrens holiday. They now want to know if we can move to Brynowen.", "title": "Fantastic for all the family!!!", "helpfulness": 4, "user": "saja1531", "date": "June 5, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 111629505}, {"rating": 3.0, "stay_parameters": "Stayed May 2011, traveled solo", "text": "We will definately be back in September and the kids are already counting down the days.", "title": "Not great but not as awful as led to believe", "helpfulness": 3, "user": "nige9359", "date": "May 29, 2011", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 110382352}, {"rating": 2.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "Thanks again Brynowen for such a great holiday.", "title": "Holiday to Borth", "helpfulness": 1, "user": "k221331", "date": "May 18, 2011", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 2.0, "sleep": 2.0, "rooms": 3.0, "location": 3.0}, "id": 108837145}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "variance": {"poor": 74, "average": 86, "very good": 122, "terrible": 82, "excellent": 88}, "aka": "Brynowen Holiday Park - Park Hotel Aberystwyth", "slim_ranking": 0.428571428571, "detail_rating": {"service": 3.5, "cleanliness": 3.0, "value": 3.5, "sleep": 3.5, "rooms": 3.0, "location": 3.5}}