{"user_rating": 4.0, "review_count": 280, "name": "Budget Inn & Suites", "reviews": [{"rating": 5.0, "title": "A great surprise at a great price", "text": "We were traveling through Pennsylvania on our way back to Scranton from Long Island when our car broke down (AT 11 PM!!). No garage open, couldn't get a line on our cell. We walked from the interstate to the Budget Motel.(We saw the lights from the highway) Clerk at the desk was very helpful, with 2 children, both overtired from the long drive, car broken down & a wife who was far from happy at this point, he really saved us all. He made some calls & arranged for the car to be towed to a local garage, gave us a great room with 2 double beds (the decor seemed a little old, but it was very clean) Their restaurant was closed, but the manager got us somoe sandwiches & snacks for the children. We slept well in a quiet room & enjoyed a wonderful continental breakfast that was served with a smile. Our car was ready at 2 pm & they even gave us a late check-out at no additional charge. We tried the restaurant for their lunch buffet. It's a great all you can eat deal at 6.95.", "user": "nepaman69", "date": "March 19, 2006", "id": 4693569}, {"rating": 2.0, "title": "Not Great, Definitely Not A Value", "text": "All in all, I would stay at this place again. Not just because they really saved us, but its just a great value & at a great price(59.00 PER NIGHT). THIS PLACE GETS MY VOTE!", "user": "pokey8001", "date": "January 3, 2006", "id": 4321810}, {"rating": 4.0, "title": "more than a name", "text": "First off, the rooms are hardly offered at a \"budget\" rate. Second, although the rooms are okay, the whole hotel stinks of smoke (and even in a nonsmoking room it's hard to avoid the pervasive stench). Also, the furniture and mattress in my room were functional, but both looked and felt kind of old. The restaurant is a joke, and very overpriced. For a real meal, try the Dansbury Depot, it's a couple miles away but the food and atmosphere are in a much higher league. Do not, I repeat, do not waste money on the breakfast offering at the restaurant. Finally, I thought it was a little creepy that the hotel is located next to a cemetery.", "user": "hanskel", "date": "November 6, 2005", "id": 4089535}, {"rating": 3.0, "title": "Good motel", "text": "This hotel is perfect located, directly connected to Int. 80 and close by the Poconos.", "user": "A TripAdvisor user", "date": "September 14, 2005", "id": 3901326}, {"rating": 5.0, "title": "Just Right", "text": "The name is for sure not what you should suggest.", "user": "islandd", "date": "May 30, 2005", "id": 3510925}, {"rating": 4.0, "title": "Nice, but...", "text": "I stayed at the Budget Inn and Suites Hotel (Formerly Super 8) from November 10 thru the 13th. Sunday and Monday were free due to a timeshare presentation I attended and I paid for Saturday out-of-pocket since it was my girlfriends' birthday. The motel is right at I-80 and has ample free parking. No coffee makers in the standard and deluxe rooms but it's available in the main lobby at all times along with fresh fruit, cookies, tea, cocoa and the local newspaper.", "user": "DrewClevelandOH", "date": "November 15, 2007", "id": 10836266}, {"rating": 5.0, "title": "Loved this place", "text": "The deluxe room I upgraded to was well kept with a desk and table. The bathroom was in good shape and the heat/air controls worked marvelously. Vending machines along with a mini exercise room and video games provide refreshments, exercise and gaming activity. The in-house restaurant J. R. Grill is excellent if you're a steak lover but not so good if seafood or Italian dining is your cup of tea. It's prices are reasonable and the service is quick, fast and in a hurray. The hotel offers a free breakfast buffet during the week that consists of oatmeal, eggs, potatoes, sausage, juices, coffee, bagels, etc.--and is really worth getting up for. On weekends you pay $7.95 for an upgraded breakfast buffet.", "user": "Trickflow", "date": "September 5, 2007", "id": 8660576}, {"rating": 1.0, "title": "Crap", "text": "The only real negative was my upgraded room inability to received the motel's advertised and touted free WiFi service; I had brought my laptop and it was rendered to a glorified word processor due to a weak WiFi signal that the desk clerk told me only worked in certain parts of the building. Well, I wish I would have known this before upgrading as this was the only reason I upgraded. In the car trunk went my laptop for the rest of our stay.", "user": "Pete495", "date": "August 7, 2007", "id": 8369733}, {"rating": 4.0, "title": "Nice Place", "text": "If you going to the area to visit the new casino, Mt. Airey, you might want to pick a place closer. The slot house is about 15 miles from the Budget Inn Hotel and Suites.", "user": "travlintwo", "date": "June 5, 2007", "id": 7780087}, {"rating": 5.0, "title": "Clean and nice hotel", "text": "My family stopped here on our way to the east coast. This hotel was one of the cleanest I've stayed in. The beds had what seemed to be brand new comforters; the bathroom was spotless. The hotel is privately owned and it shows. The front desk staff was very friendly upon check in (including giving us fresh baked chocolate chip cookies and complimentary bottled water) and each time we interacted with them. The lobby includes a table providing coffee, hot tea, hot chocolate, etc. available 24 hours. We will definately stay here again when traveling out east.", "user": "GerberaTravel", "date": "June 4, 2007", "id": 7757768}, {"rating": 4.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "Satyed here one night as we needed a US address for customs. Right next to interstate be our room was very quiet. Room was clean and comfortable. Good continental breakfast included.", "title": "Great one night stay", "helpfulness": 1, "user": "iainskye", "date": "October 24, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 21180847}, {"rating": 1.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "Nice bar/restaurant at the side with reasonable prices.", "title": "worst experience we've ever had", "helpfulness": 1, "user": "shoppergirlbostonma", "date": "July 28, 2008", "detail_rating": {"cleanliness": 1.0, "front_desk": 3.0, "value": 1.0, "rooms": 1.0, "service": 2.0}, "id": 18351957, "likes": {"liked": "— the 3 double beds", "disliked": "— placed in a smoking room ;smoking floor which we did not want"}}, {"rating": 3.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "We were returning from our week long vacation and stayed at the budget Inn and suites for one night. I had booked a non-smoking large double weeks in advance. When we arrived @5 p.m. we got a corner room facing the highway. Note: rooms facing the front can be noisy as the highway is right there as well as a main access road. The corridor where our room was located smelled horrible-very stale and smokey. The when we entered the room the same smell permeated the room. The large double has 3 double beds which is nice but there is no microwave or refrig. Being in a rush to see some sights and have dinner we quickly went out for the evening. On returning the stink wof the room and hallway was overwhelming. I went to the first floor for ice and noticed all the rooms had non-smoking signs. On returning to the second floor I noticed no signs- we were put on a smoking floor with a smoking room that stunk and had dirty, stained carpets. When I went to reception yes I was told it was a smoking room. I was furious as we always book a non-smoking room. We were told there were no other rooms available and all they could do was to send someone up with an \"ozone\" machine to clear the air. Well, after a half hour someone finally showed up with the the machine that turned out to be broken. We were then told that was the only machine he could find and that was the end of that. So at 10:00 p.m. My husband went out to cvs to buy fabreeze, which did help to diminish the musty, stale odor. The next morning we again expressed our displeasure, and were told that room was recently converted to a non-smoking room! I just rolled my eyes and decided I would never stay at a budget inn and suites anywhere.", "title": "Poconos trip with pets", "helpfulness": 1, "user": "bakariman1", "date": "July 5, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 4.0}, "id": 17540383, "likes": {"liked": "— large pets allowed with no extra pet fees", "disliked": "— The door knobs needed some maintenance-- or probably replaced."}}, {"rating": 1.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "I can certainly understand why this hotel would not meet some people's travel standards, however, this Budget Inn & Suites worked well with our plans for 3 reasons:", "title": "Hated it", "user": "CCCLady", "date": "March 9, 2008", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 1.0, "cleanliness": 2.0, "value": 1.0, "location": 3.0, "rooms": 2.0}, "id": 14170500, "likes": {"liked": "— Free coffee in lobby", "disliked": "— No hot water"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled with friends", "text": "1. good location (approx. 20 minutes from Bushkill Falls);", "title": "Budget and friendly!!", "helpfulness": 1, "user": "GeniaNC", "date": "February 1, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 4.0}, "id": 13167388, "likes": {"liked": "— Price and location", "disliked": "— Area around hotel was not to fantastic."}}, {"rating": 3.0, "title": "50-50 depends on your luck!", "text": "We stayed for 3 nights. Stayed in room 323 for a night-A/C, heating was making a lot of noise when started and we realized only night time that we cannot sleep. We reported next morning to reception desk and was told somebody will take care or problem. Late next evening when we came back nobody came for repairs. We called again and someone came and decided to give us room 321 which was OK. In the morning we saw that 323 was given to somebody else that said they could'n sleep for the same reason. Not very nice!", "user": "danico22", "date": "February 21, 2007", "id": 6822874}, {"rating": 2.0, "title": "couldn't sleep", "text": "Motel is clean, beds OK, the food we didn't try it and don't use the phones. We was told that local calls are not charged, we asked and was told that if we don't dial area code is local. However after 3 days when I check out I showed them that I made local calls and the same woman told me that in area code 570 some call are local and some no. Of course mine was no local but I found out too late.", "user": "MapleGlen", "date": "February 4, 2007", "id": 6745360}, {"rating": 3.0, "title": "Clean Hotel, Curteous Staff", "text": "Prices OK for a motel but better is you have a room on second floor, on lower floor is noise in he morning from cars who leave early.", "user": "paleo56994", "date": "December 31, 2006", "id": 6526581}, {"rating": 4.0, "title": "Pleasent stay", "text": "We rented the queen suite and paid double the price of a regular room. The room was very nicely laid out and very clean but has in-room heating cooling units with no thermostat.", "user": "mikez99", "date": "November 27, 2006", "id": 6183110}, {"rating": 1.0, "title": "Not a bargain!", "text": "It was either so hot we couldn't sleep or if we turned it off, after about an hour we all woke up including the children-freezing.", "user": "bvh520", "date": "July 19, 2006", "id": 5487002}], "location": {}, "stars": 2.5, "variance": {"poor": 19, "average": 29, "very good": 107, "terrible": 16, "excellent": 109}, "aka": "Budget Inn And Suites", "slim_ranking": 0.111111111111, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.5}, "description": "112 Room & Suite, AAA Three Diamond Award winning property nestled in the heart of the Poconos. Ranked among the top 200 hotels nationally by Lodging Hospitality Magazine. Featuring J.R.'s Grill & Salad Bar with comfortable, modern lounge. All the amenities of a large scale hotel at reasonable prices. Locally owned & operated for more than 25 years. Expect more & pay less at The Budget Inn & Suites."}