{"user_rating": 4.0, "review_count": 2509, "name": "Buena Vista Palace Hotel & Spa", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled with family", "text": "The palace was a great place to stay at . Check in was fast. The location was great and close to nightlife,shopping,places to eat,and the buses to the theme parks.", "title": "Great place to stay", "user": "mmsmlm", "date": "October 8, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 46274688}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled with family", "text": "Beautiful Hotel very polite and helpful staff, the room was beautifully decorated , and is located next to Downtown Disney, resturants and shopping, Slef parking is hard to come by so if you have a car it is difficult to find a parking space.There are several resturants in the Hotel and a mini-mart. Our rooom did not have a mini-bar/ fridge as was advertised so a little difficult if you are traveling with small children.", "title": "Beautiful Hotel", "user": "trishalg03_9", "date": "October 8, 2009", "detail_rating": {"cleanliness": 3.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 46233022}, {"rating": 1.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "On 7/17/09 I had checked into the Buena Vista Palace Hotel and Spa for an Island Water View Suite. I had requested this room on-line from the Buena Vista Palace Hotel and Spa web-site. When my boyfriend and I arrived at our room, we found what was included in our \"water view\". We were on the first floor viewing the \"No Glass Allowed\" sign for the pools. We did not even have a view of the water. The room had an unpleasant smell (mouldy), many cigarette burns were found on all of the outdoor furniture, and the air conditioning unit was so loud that we had to raise our voices to understand one another. The balconies by the way, are not private. The pictures on their website present them as private, but they're not. When we called the front desk, we asked to speak to a manager about moving to a different room. We were originally told that there were no other Island Water View Suites available. When we asked about an Island View Suite with a resort view, we were also told there were none available. We then asked if it would be possible to move to a down-graded room within the main building. We were told to come to the front desk. When we arrived at the front desk, and spoke with the front desk clerk, we were then offered 2 different island view suites with resort views. We found this interesting, considering we had just been told that none were available. When we asked the desk clerk why we were told originally that no other Island View Suites were available, she apologetically said she was not sure why. We accepted one of the rooms. When we arrived at this new room, the walls had dirty hand-prints on the light switches and the couches. The balcony was covered in bird droppings, and cigarette butts were found on the floor of the balcony as well as on the chairs. Again, the room had a (mouldy) odor. Although the bed was made and new toilet paper was placed on the handle next to the toilet, it appeared that the room had not been cleaned to most other LXR hotel standards. Being that we had just seen another room and we were disappointed, we decided to speak with the manager again. When we presented our complaint we were told that we had already paid for the room and it was not refundable. She did not seem to care about the cleanliness of both rooms that we had viewed, and we were not offered other accommodations.", "title": "Island View Suite - false advertisement", "user": "BabyKatcher", "date": "October 5, 2009", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "location": 4.0, "service": 2.0, "rooms": 1.0}, "id": 45882851}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled with family", "text": "We travel quite often, and have stayed in many Orlando hotels within the Walt Disney area. We actually live in the Tampa area. This was the worst experience I have ever had with a hotel. The lack of concern this manager showed, and the cleanliness of their rooms was disconcerting. Their web-site shows beautiful, clean rooms with clean and private balconies. Both rooms that we were shown did not come close to what I had paid for, and were falsely advertised.", "title": "Best Beds In Florida!", "user": "tk3346", "date": "September 30, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 45488445}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled with family", "text": "I stayed at the Buena Vista Palace last week and I'm still talking about the beds. Wow, they were so comfortable, huge pillow top mattress with lovely down comforter and 4 hugs down pillows per bed., all made for a great night's sleep. The rooms overall were very nice, a tad small, but plenty of room for my daughter and I. Contemporary and clean, the room also had a safe, frig, iron and ironing board, and hair dryer. Housekeeping staff was very helpful and efficient. Be prepared to pay an additional $15 per day service charge which inlcudes things like self parking (valet more) and transportation to parks, pool towels and lounges, internet etc. Conventient location to attractions. Restaurant was overpriced, for OK. The did offer a character breakfast on Sunday (at the normal price) which was very nice for my daughter. Convenience/snack store way overpriced. I felt the room rates were moderate for the quality, convenience and overall experience. I would certainly return to the Buena Vista Palace and hope to soon.", "title": "I cant Belive it!", "user": "max2000here", "date": "September 28, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 45354695}, {"rating": 5.0, "title": "Nothing else on my radar", "text": "This is the second time that I have stayed at this hotel. The facility is first rate and the service is excellent.", "helpfulness": 1, "user": "FyrCapt", "date": "October 23, 2007", "id": 10260479}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled with family", "text": "During our first stay it was absolutely trouble free. There were a few minor gliches during this stay but I still rate the hotel excellent. Why? With any business there will be problems. The mark of the business is how they handle it. These folks responded promptly and efficiently and always with a positive attitude.", "title": "More good than bad", "helpfulness": 1, "user": "gatorphin", "date": "October 22, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 10228438, "likes": {"liked": "— location", "disliked": "— parking"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "The location is directly across from Downtown Disney and is just minutes away from everything. Great location, the most bang for the buck hands down. When staying in Orlando, there is nothing else on the radar.", "title": "Excellent Hotel / Terrific Service", "helpfulness": 2, "user": "bki_7", "date": "October 20, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 10178608, "likes": {"liked": "— Service / Great Views / Great Rooms", "disliked": "— Not Applicable"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled with family", "text": "Booked hotel for a 2 night stay thru Travelzoo for $99 a night. Reserved a Dsiney view room. Stayed there with my wife and girls ages 5 & 8.", "title": "short stay 11/10/07-13/10/07", "helpfulness": 2, "user": "MTTGlasgow_Scotland", "date": "October 20, 2007", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 4.0}, "id": 10171035, "likes": {"liked": "— clean , convenient for Disney", "disliked": "— nothing!"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "Got there around 9:30 PM and got checked in within minutes. No line. Friday night.", "title": "Absolutely Fabulous", "helpfulness": 5, "user": "meesh76", "date": "October 15, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 10080842, "likes": {"liked": "— location"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "A good place to stay when you're in Orlando. The room was comfortable en clean and the staff friendly. At night also quit in and around the hotel. Free parking and a free shuttlebusservice to the Disneyparks. Downtowndisney is just round the corner.", "title": "Good place to stay!", "user": "Corina82", "date": "September 28, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 45259006}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled with family", "text": "The also have a selflaundryservice, very handy when you're on a roadtrip!", "title": "This hotel was SO much more than we could have hoped for!!!", "user": "grandkidsrgreat", "date": "September 28, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 45255535}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled with family", "text": "We stayed at this TOP notch hotel for less than we could have stay at a low rate motel.", "title": "Exceeded our expectations", "user": "dnysmith", "date": "September 28, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 45243495}, {"rating": 3.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "It was awesome!!! We brought four of our young grandchildren and they had a great time!", "title": "Standards have fallen at the BVP", "user": "Orlandoisfab", "date": "September 23, 2009", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 5.0, "service": 3.0, "rooms": 4.0}, "id": 43840939}, {"rating": 3.0, "title": "The other side", "text": "Between the pools and playground they got to be outside playing all the time.", "user": "WanderingProfessor", "date": "September 23, 2009", "id": 43833851}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "From the minut we arrived we knew it was a special hotel. Fortunately, they had a discounted rate, because we normally could not afford it. It was awesome, and the price they charge is probably because they pick the best people to work there.", "title": "Absolutely great service and beautiful place to stay", "helpfulness": 1, "user": "fufsabita", "date": "September 22, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 43747478}, {"rating": 3.0, "stay_parameters": "Stayed September 2009, traveled on business", "text": "I stayed here for 3 nights (September 16-18, 2009) for a professional conference. Upon arriving, the lobby area is very nice, and the staff is exceptionally friendly. We checked in, my co-worker and I were given rooms on different floors and the front desk staff gladly moved us to the same floor.", "title": "Looks nice, but smells bad!", "user": "NavyMomNC", "date": "September 20, 2009", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "location": 4.0, "service": 3.0, "rooms": 2.0}, "id": 43118030}, {"rating": 3.0, "stay_parameters": "Stayed September 2009, traveled with family", "text": "Upon exiting the elevator on the 23rd floor we were greeted by a musty smell. I opened the door to my room and the moldy/musty/stale smell was overwhelming! The air conditioning was NOT turned on, however, and being from Florida I thought that getting the air moving would help. I turned the air on full blast, unpacked, and we left for dinner. I mentioned the smell to the front desk on our way out, and was assured someone would be up to \"freshen\" the room. The smell was slightly better on returning, and someone had been in to spray air freshener (guess that's freshening the room).", "title": "Beautiful Hotel but Falsely advertised in many areas....Not happy.", "helpfulness": 1, "user": "babyblooeyes21", "date": "September 16, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 1.0, "service": 2.0, "rooms": 2.0}, "id": 42304841}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled with family", "text": "Over the course of our 3 night stay, we learned from talking to other conference attendees that many of them had changed rooms due to musty smells. We even found instances where some folks had been moved into rooms that others had requested to be moved out of! My co-worker noticed mold spots on her ceiling. They had been painted over and were starting to come through. Her roomed smelled okay as long as the air was running full blast....as soon as the fan turned off the moldy smell became very noticeable. My room was tolerable, and given all the room changing that was going on, I figured that there was a real chance I could end up in a worse situation. Housekeeping staff came up on a daily basis, however, to \"freshen\" the room. (guess they got tired of me stopping by the desk a couple of times a day)", "title": "Lovely, but disappointed that I was lied to by staff.", "helpfulness": 3, "user": "SEflordiagirl", "date": "September 16, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 4.0, "rooms": 3.0}, "id": 42203498}, {"rating": 3.0, "stay_parameters": "Stayed August 2009, traveled on business", "text": "I was extremely disappointed in this hotel. For more than $200 a night, you expect your room to smell good and be free of mold and mildew.", "title": "Great hotel if you dont mind constant noise", "user": "flmiltraveler", "date": "September 15, 2009", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 2.0, "service": 3.0, "rooms": 3.0}, "id": 41884952}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled with friends", "text": "This hotel was turned out to be much more than expected.", "title": "REALLY Nice", "user": "DuffyDo", "date": "November 19, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 10922977}, {"rating": 4.0, "stay_parameters": "Stayed November 2007, traveled with family", "text": "From the exterior, it looks like all the other hotel surrounding the Disney complex but when you enter the hotel....WOW...it's nothing like the rest of them.", "title": "perfect hotel for Disney visit", "user": "Glitter-Queen", "date": "November 16, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 10862525, "likes": {"liked": "— comfortable rooms and beds", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled on business", "text": "It has been recently remodled. The lobby is spacious and open with lots of natural light. The rooms are large and clean with great views from the balcony. EVERY employee of the hotel that we came in contact with was pleasant and helpful. We were even able to check into our room at 10:30 AM!", "title": "Had a great experience at the Buena Vista Palace", "helpfulness": 2, "user": "Metzy7", "date": "November 14, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 10828436}, {"rating": 4.0, "title": "Great Place!", "text": "Room service had a nice selection and was fairly quick.", "helpfulness": 2, "user": "CDamato", "date": "November 12, 2007", "id": 10781241}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled on business", "text": "My husband and I WILL stay at this hotel again.", "title": "Loved the Palace", "helpfulness": 1, "user": "Iowa4Vacations", "date": "November 12, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 10769795, "likes": {"liked": "— The bed was comfortable.", "disliked": "— Can't think of anything."}}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "We stayed at from Thursday-Sunday (10/8-10/11) and enjoyed our stay. The hotel is nice and the staff was very accommodating. We especially liked the pool area, which contained two pools and a hot tube. One pool was mostly adults which was nice for people that don't like having loud children jumping in the pool and splashing constantly. Both pools were large and clean. The outside bar was nice and served food, beer, cocktails, etc. Thankfully there were many other young adults and the crowd wasn't either just young families or senior citizens. We hung out at the pool late night two nights and had a blast. A lot of people were swimming very late which was a nice option considering the lights are on all night. Snacks and drinks from the hotel pantry shop were a bit expensive. $3 for a vitamin water is not cheap. We also ate and hung out at Kooks Sports Bar. The first night was fine. However, the second time we had terrible service. We were a party of 3 and even though we were seated with our orders taken two larger parties that came in after us received their food first. One of those parties was even gone long before we got our food. Our waitress was not very friendly. Food was ok. Finally, when we asked the bartender to put a specific sporting event on a tv, he gave us some attitude and catered to some people that came in long after us. It was kind of ridiculous because they have like 50 tv sets in there. If I ever go back there, I'll never visit Kooks. We didn't eat at the Outback restaurant. It is NOT Outback Steakhouse, it just shares a similar name. All in all, we stayed there because it was right across the street from Downtown Disney and we were there to see a concert at the House of Blues. Our room was fine. It was clean and had a balcony. Could use a better shower head but that wasn't a big deal. I don't particularly care for Disney parks and the crowds and crying children but if I did happen to go back to that area, I would absolutely stay at Buena Vista Park Palace.", "title": "Short Stay - Good Time", "user": "ardmoreflyer", "date": "October 13, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 46751189}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled with family", "text": "We stayed at the hotel on 10/10/2009. Very clean, very updated. Strange layout. It is comprised of many buildings which made it difficult to navigate. Shuttle to Disney ran every 1/2 hour, which was great, and the parking was free.", "title": "Good Location, Clean Room", "user": "jesinjax", "date": "October 12, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 46645564}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "What a lovely hotel! very modern, spacious rooms with balcony. whole hotel is modern and contemporary! we loved it! after a disasterous start to our holiday at another hotel we refused to stay at we went here, originally had 2 days booked for the end of our holiday in an Island suite(which was fantastic) but ended up staying 8 nights plus our original 2! staff very helpful and courteous! couldnt comment obn the food as we did not eat here(food seemed quite expensive,buut they did give us a discount card on check in for the restaurants and shops within the hotel). Spa was lovely, although treatments overpriced. pools were great, especially the \"lap pool\" at the spa! a hidden gem as no children allowed, so perfect for couple/adults who want to relax. Big comfy loungers(including doubles) and towels provided! would DEFINATLEY go back and recommend to a friend! and it was a 2 minute walk to \"downtown Disney\" They also had \"MAC Pc's\" in the lobby for guests to use free of charge. Be careful of \"resort fees\" in the Usa, its usually about $15 per night, at least at this hotel it covered your free local calls, towels at the pool plus parking!", "title": "FANTASTIC!", "helpfulness": 1, "user": "Lisab018", "date": "October 10, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 46441533}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled solo", "text": "I stayed at the Buena Vista Palace as a pre-night for my cruise last month (9/13/09). The hotel staff was very friendly and helpful. They smiled a lot and, as far as I am concerned, that is a big plus. The room was large and the bed very inviting. I had dinner and the sports bar (I don't recall the name. I was so tired from flying I just wanted to grab a bite and get to bed), which was very tasty. I have found a new favorite hotel, and I will stay there again as a pre-night to my next cruise.", "title": "My new favorite hotel", "user": "SheilaAW", "date": "October 9, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 46420613}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "Positives: Across the street from Downtown Disney, shuttles to all theme parks. Great pool and hot tub area. Room was large with great view of DTD. Also close to everything in the area. The room was clean and very comfy.", "title": "Great Convenient Place to stay", "user": "bgaile", "date": "October 8, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 46321608}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "We stayed at the Buena Vista Palace for the weekend after our wedding. I had called a couple of weeks prior to see if we could get the best room possible at the room rate we purchased. When I checked in I found out they upgraded us to to a resort suite at no additional cost. The room was bigger than our apartment...It was an amazing weekend & gave us the chance to just relax & enjoy. The hotel is so close to Downtown Disney also. We had a great time & we will definitely be back!", "title": "Ultimate Relaxation", "helpfulness": 2, "user": "rp5aam", "date": "November 7, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 10667260, "likes": {"liked": "— Accomodating Staff"}}, {"rating": 5.0, "title": "Home away from Home", "text": "I have to tell you at first I was a little skeptical to stay in the hotel, but my husbands conference was being held there. I did some research about the hotel and read some reviews online. Some reviews were complaining about the renovation contruction that was going on. As a mother of 2 small children and also bringing relatives with small children I was wondering what we were going to walk into. Boy! was I pleasantly suprised when we walked into the hotel. All renovations and contruction work was done. They did a beautiful job. Our rooms were joined so the kids could run back and fourth without disturbing other hotel guests. I had the best nights sleep ever on the new beds, and even thought our rooms did not have a view of the park fireworks we awoke every morning to the most spectacular sunrises. There is a small cafe/store opened very late for when you come back from the parks. The kids loved the pools, I especially liked the \"baby\" pool but my husband will tell you to go for the jacuzzie after a day on your feet. The buses to and from each park were clean, friendly, and airconditioned. And Downtown Disney is right across the street, no waiting. I would go back in a heart beat.", "helpfulness": 2, "user": "stayingaway", "date": "November 5, 2007", "id": 10619295}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled with family", "text": "Our stay was for three nights and very pleasant. My wife and two daughters and I were invited to Orlando for two days and three nights. I had family here on business and we came to play at Disney World. We all came from Knoxville, Chicago and Ft. Lauderdale. So I was fortunate to have visited many rooms in this hotel.", "title": "Very nice stay", "helpfulness": 3, "user": "anewman3", "date": "October 31, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 3.0, "rooms": 4.0}, "id": 10471067, "likes": {"disliked": "— The breakfast buffet"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2007", "text": "First, my family, we had two connecting rooms. One room had a Large Queen bed (yes comfortable like everyone else has said) very nicely decorated, flat screen T.V. refrigerator, safe, Iron, Ironing board and a balcony with a view of Epcot and the Front entrance of the building on the twelfth floor. Our second room had to full beds that were very comfortable as well. With the same amenities I previously mentioned. House keeping was very prompt and thorough. I hate coming back to my room at 2:00PM finding that the room hasn’t been touched. More money will get you extras from an extensive T.V. menu like music, movies, games etc. none of which we purchased. I think 10$ a day gets you internet, didn’t do it, it’s nice to forget about that stuff for a while.", "title": "Very nice hotel, friendly staff.", "user": "CanadianSeniors", "date": "October 26, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 10349205, "likes": {"liked": "— comfortable beds and pillows", "disliked": "— ridiculous room surcharges daily"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "We ordered room service late Friday night for a pizza party. Two pizza’s and a twelve pack of beer and it was very fast delivery.", "title": "Amazing all the way!!", "helpfulness": 2, "user": "miamimickey140", "date": "October 23, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 10269947, "likes": {"liked": "— Room, Bed Linens, Lobby", "disliked": "— No Secure Parking"}}, {"rating": 3.0, "stay_parameters": "Stayed October 2007, traveled on business", "text": "Second stay at the Buena Vista Palace for business this year. Location near Downtown Disney makes it as good as some of the Disney resorts for access to conference center at Dolphin and Swan.", "title": "OK for Business Travel, but Probably Better for Families", "helpfulness": 5, "user": "SixContinents", "date": "October 12, 2007", "detail_rating": {"front_desk": 2.0, "business": 2.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 3.0, "rooms": 4.0}, "id": 10072272, "likes": {"liked": "— comfortable beds", "disliked": "— internet access slow"}}, {"rating": 2.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "The resort has both a high rise tower and a low rise \"island\" resort. The high rise tower is much more convenient to everything except the pool--if you do get the island resort, you can try self-parking in the spa parking area, it is a much shorter walk from there to your room.", "title": "Great room, horrible service", "helpfulness": 3, "user": "beckaroosy", "date": "October 11, 2007", "detail_rating": {"front_desk": 5.0, "service": 2.0, "cleanliness": 2.0, "value": 2.0, "rooms": 4.0, "location": 3.0}, "id": 10066485, "likes": {"liked": "— The room's decor and size", "disliked": "— The poor customer service, poor housekeeping and painfully high water pressure"}}, {"rating": 3.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "The fitness center is reasonably well equipped with 4 treadmills and two ellipticals and two bikes. Lots of weight machines but they are a bit tired and could use refurbishment or replacement.", "title": "Nice Getaway", "user": "res172aw", "date": "October 9, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "rooms": 4.0, "location": 3.0}, "id": 10060850}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "Room service looked expensive compare to most, but there was a reasonable selection of cold foods in the cafe on the first floor. If you have a car you can save a lot buy buying food and snacks off the hotel property.", "title": "Buena Vista Palace is GREAT!", "helpfulness": 3, "user": "Grumpyone1", "date": "October 9, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 10059654, "likes": {"liked": "— The luxuious bed, and everything is new", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled with family", "text": "Advantages:", "title": "GREAT stay @ Buena Vista Palace", "helpfulness": 1, "user": "poo22", "date": "October 9, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 10059070, "likes": {"liked": "— price for room, nice hotel, water view", "disliked": "— The price of my martini in the hotel lobby!"}}], "location": {"country": "United States"}, "stars": 4, "variance": {"poor": 215, "average": 398, "very good": 747, "terrible": 177, "excellent": 972}, "aka": "Buena Vista Palace Hotel And Spa", "slim_ranking": 0.595744680851, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.5}}