{"user_rating": 4.0, "review_count": 44, "name": "Buffalo Pointe Lodge", "reviews": [{"rating": 5.0, "title": "\"A Great Route 66 experience\"", "text": "A great Bed and Breakfast! All the rooms were beautifully decorated and the owners went out of their way to make our visit fun. Provided lots of information on area attractions.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "December 15, 2003", "id": 1517960}, {"rating": 4.0, "title": "Feel right at home", "text": "We have stayed here year and after year and still never tire of it. The family owners make you feel like part of their family. Relax on the big old fashioned front porch and watch the people go by or walk down route 66 and window shop. Some of the rooms are a bit small so make sure you check that out before you reserve. They have the softest towels I have ever used in a hotel/motel. Enjoy!", "helpfulness": 2, "user": "A TripAdvisor user", "date": "August 14, 2003", "id": 1227111}, {"rating": 4.0, "title": "Thanks for a Great Time.", "text": "What a Great Time. We really enjoyed staying with these good folks. They steered us in the right direction everytime, so we never had a bad meal or missed any of our itineraries. Chuck Morris", "helpfulness": 2, "user": "A TripAdvisor user", "date": "April 25, 2003", "id": 983119}, {"rating": 5.0, "title": "Will certainly stay here when in Williams, AZ", "text": "Greg and Estefana make you feel like family. The rooms are comfortable and the breakfast is fantastic and the host and hostess are superb! We stayed in the Harley Davidson Room which my wife and I really enjoyed. They even held some of our luggage for us while we stayed overnight at the Grand Canyon. Like I said . . . you are treated like family at the Mountain Country Lodge. This is definitely the place to stay in Williams, AZ.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "June 3, 2004", "id": 2149936}, {"rating": 4.0, "title": "lovely people", "text": "This is a great place to stay when you visit the grand canyon and you don't want to stay in the park. The rooms are great, the breakfest is a real breakfest and not just coffee and donuts but the best of all are the lovely couple who run the place and let you feel like your at home.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "June 3, 2004", "id": 2149177}, {"rating": 5.0, "title": "Great Breakfast", "text": "We went to Williams for 3 days as a side trip after spending 4 days in Vegas. Our first time at a B&B and we would definitely go back again. The rooms have themes (we stayed in the Deer Room). A little smaller than we expected but adequate with a separate entrance. Greg and Stef were great hosts and the full breakfast included in the price cannot be beat - waffles, pancakes, eggs plus they brought out plates of cut fresh fruit. Day 1 we went on the Grand Canyon Railroad which I highly recommend. Day 2 we went to the Canyon on our own and took the Desert View Drive and came back through Flagstaff where we stopped at Wupatki Sunset Crater Volcano (a totally different scene than the canyon). We went to Black Bart's for dinner and the show. You have to visit the little shops in Williams with all the Historic Route 66 memorabilia. Had to stop at the old fashioned ice cream shop, Twisters to cap off the day. Had a great visit and would return again.", "helpfulness": 4, "user": "Breadhead1", "date": "May 27, 2004", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 2120693}, {"rating": 5.0, "title": "Just wonderful", "text": "from the moment we arrived we were impressed. very quaint, sweet get away spot that feels like home. owners are very pleasant, friendly and helpful people. None of that \"continental breakfast\" crap here. Stef will hook ya up with a \"stick to your ribs\" REAL breakfast to start the day right!! She'll even make you a lunch for the road.We will definitely be back.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "May 19, 2004", "id": 2081150}, {"rating": 5.0, "title": "Great place to stay!", "text": "Wonderful place. Greg and Estefana make quite a team. The room was VERY clean and quaint, and the breakfast was EXCELLENT, and in a very nicely-renovated deli section in the back. They gave us frank advice about the local attractions and were really fun to talk with in general. Great place to stay in Williams!", "helpfulness": 3, "user": "A TripAdvisor user", "date": "May 14, 2004", "id": 2061032}, {"rating": 5.0, "title": "Just like home", "text": "The owners made you feel so at home. Estefana made us feel as if we were eating breakfast in her home kitchen and in a way it was! The food and friendship made this place the most memorable of our trip. They are biker friendly for fellow motorcyclists.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "May 4, 2004", "id": 1870307}, {"rating": 5.0, "title": "Charming and Delightful", "text": "Loved staying at this bed and breakfast! The Victorian Suite was upstairs and was very spacious and clean. The beds are firm and felt wonderful. Breakfast was fabulous with eggs, pancakes, and other choices available. New owners are very courteous and we received a great rate on our room. Williams and this stay made a great stop for us during our spring break trip. I would recommend staying here and we will be back next year!", "helpfulness": 3, "user": "A TripAdvisor user", "date": "March 23, 2004", "id": 1737353}, {"rating": 5.0, "title": "Felt Like We Were With Family", "text": "This is just the best place to stay in town. You just feel like part of the family. Everyone is so helpful and always smiling. There is something to be said by a family operated Hotel or B&B. Just those special touches. They all take the time to chat with you and even sit down and talk. And if you want a really good meal just walk on down the street to Old Smokies that they also own the food is awesome but you better be mitty hungry and if your not just share a plate. I look forward to my stays with in Williams all the time because of these wonderful people and the conforts of home.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "January 18, 2004", "id": 1555886}, {"rating": 4.0, "title": "Great little hotel.", "text": "Arrived late in evening after a drive from Las Vegas. Received a friendly welcome and after signing in, was showed around rooms.Was given advice on where to eat and what to do and see, owner very friendly and helpfull. Stayed in 2 room upstairs suite, plenty of room very comforable and warm despite freezing temperatures.Had a steak at Rod's.Breakfast taken in detached restaurant consisted of everyhing you expect from an American breakfast - very good. Next day trip on railroad to Grand Canyon - Excellent something never to be forgotten.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "January 6, 2004", "id": 1539848}, {"rating": 5.0, "title": "A fun and memorable stay on Route 66", "text": "Train journey made special by entertainers. Outlaw raid on way home very entertainng.Spent a last night at hotel before driving to Santa Monica, thoroughly recommend hotel, rooms overlook route 66 for enthusiasts.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "December 23, 2003", "id": 1528669}, {"rating": 4.0, "stay_parameters": "Stayed March 2007", "text": "Nice enough room, work being done in room next door was fairly loud, but ceased in the evening. I found the town of Williams to be kind of dissapointing as a whole, but this hotel was not bad. It is a fine \"jump off\" spot for heading to the Grand Canyon whether by train or car (I drove). Could have been cleaner - cleaning person missed a used washcloth from previous guest. Oh, and if its cold outside, make sure you ask for a second space heater! Even with that it took a long time for the room to warm up (keep in mind, I'm from south Florida and am not used to cold at all). Lots of blankets provided.", "title": "Good place for the money.", "user": "MyWorldatPeace", "date": "April 3, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 3.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 7278635}, {"rating": 2.0, "stay_parameters": "Stayed October 2006, traveled with family", "text": "People were friendly and helpful. I didn't have breakfast so cannot comment.", "title": "This place really needs some TLC!", "helpfulness": 2, "user": "waternana", "date": "October 6, 2006", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 2.0, "value": 2.0, "location": 2.0, "rooms": 2.0}, "id": 5921120, "likes": {"liked": "— Breakfast was really very good, in a congenial atmosphere!", "disliked": "— The slightly shabby, uncared for conditions."}}, {"rating": 2.0, "title": "Not the best place to stay while visiting Grand Canyon", "text": "We stayed at the Buffalo Pointe based on travelor's reviews from TripAdvisor, and I have to admit it's the first time I felt that TripAdvisor let me down -- although admittedly I did \"ignore\" some of the negative reviews being the generally positive person that I am! I've stayed in a lot of different B&Bs, but this one just really doesn't measure up! My overall feeling is that the owners/managers just really don't care enough to pay attention to all the little details that distinguish a B&B from the local Motel 6! For instance:", "helpfulness": 8, "user": "A TripAdvisor user", "date": "June 29, 2005", "id": 3620677}, {"rating": 3.0, "title": "Handy for Grand Canyon Railway", "text": "1. We had to go downstairs to ask for a roll of toilet paper, as our roll was 3/4 empty when we moved into our room, and no extra rolls to be found in the room or bathroom.", "helpfulness": 5, "user": "Sheepshearer", "date": "February 4, 2005", "id": 3163019}, {"rating": 5.0, "title": "Will stay at Mountain Country Lodge again!", "text": "2. We had to keep taking the lid off the toilet and \"fixing\" it ourselves, as it had a problem with either not flushing or constantly running, which was very annoying.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "July 11, 2004", "id": 2289840}], "location": {"country": "United States", "city": "Williams"}, "stars": 2, "variance": {"poor": 3, "average": 4, "very good": 19, "terrible": 0, "excellent": 18}, "slim_ranking": 0.75, "description": "A Route 66 original. This Bed and Breakfast dates to 1909 as a lumber barrons mansion, then the bus stop and Mayors' house. Located downtown Williams and 45 minutes from the South Rim of the Grand Canyon. See you soon!"}