{"user_rating": 3.5, "review_count": 136, "name": "Bumas Hotel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "We stayed here for 2 weeks in September 2009, little bit cautious after reading some previous reviews, but let me say we enjoyed every minute of the holiday. The staff were really friendly, nothing was too much trouble for them. Room was very spacious with massive double bed and very comfortable(unusual these days abroad)Clean towels, and the room was cleaned everyday. Provided towels for the pools. The gardens were so beautiful and very well kept. Has a beautiful place set out for Massage, so peaceful and an excellent therapist. There were always lots of beautiful smelling frangipani flowers around the grounds in bowls or on the tables. Breakfast quite basic, but nice. we will be going back in May.", "title": "Friendly, Relaxing, Spotless", "helpfulness": 6, "user": "Sunworshipers_9", "date": "October 6, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 46021700}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "Very impressed. The pictures on the hotel website sell this hotel short. I paid £19 a night, which is one of the cheapest in the area. The hotel is clean, and the staff are very friendly (I found the balinese very friendly in general). The pools are very nice. I saw one comment on here which said that one pool is cloudy. It is not cloudy, it is just that the walls of the pool are turquoise and not blue like most others!! The hotel is very quiet. It is a 5 -10 minute walk from the beach. The breakfast is ok, but for the price i would not complain.", "title": "Great Value", "helpfulness": 2, "user": "Rishi1London", "date": "September 13, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 41314397}, {"rating": 3.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "The Bumas hotel is in great need of an update, the furnishings and even the pool furniture was extremely tired and in need of repair. We did not expect the Ritz as this was a 3 star rated hotel but we expected a little more than what we got from Bumas. This hotel should not be rated as 3 star and was more like 1 or 2 star. Bali is a lovely place and this was our second visit in 2 years but we found that even buying a coffee in the hotel was as expensive as buying a meal in the surrounding café's We will be visiting Bali again because we love the people and the island but will definitely not be staying in the Bumas again..", "title": "Bumas not my cup of tea!", "user": "SitaTorquay", "date": "May 17, 2010", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 64400219}, {"rating": 3.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "Unable to get my first night at my chosen destination in Ubud,I found this accomodation very acceptable, and reasonably priced. Room was very large and airconditioned, interesting bathroom with hot water, and very clean. Outside 2 beautiful pools. Breakfast was more than adequate.", "title": "First night in Bali", "helpfulness": 1, "user": "hmc76", "date": "March 15, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 58617042}, {"rating": 3.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "Overall a good start to a pleasant stay in Bali", "title": "could be so much better.", "user": "plantmanLeeds", "date": "February 3, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 55098267}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "Stayed at hotel for nearly 3 weeks from mid January. On first night no hot water.It would appear that the water is heated by gas bottles and each bottle heats about 10 rooms.The only way the reception know that the bottle has run out is when a guest reports no hot water.This happened 5 times in the 17 nights stayed but on reporting this the bottle was changed immediately and the water warm within 30 mins. Another problem is that when the hotel gets busy there is a shortage of sun beds.There are 73 rooms and only 30 sun beds. This could be easily solved and there is ample room for numerous more sun beds. The grounds of the hotel are extensive and ample room around the 2 pools.The reception staff were polite and helpful as were the room cleaners. The room was large and clean but an investment in new bed linen would be appreciated. The worst experience was the breakfast. When the hotel is busy there is a lack of seating and on 3 occasions I went to a nearby restaurant as i got fed up of waiting for a table.There is also a problem with lack of glasses and crockery and often there is a wait whilst tables are cleared and these items are washed up for waiting guests.The menu is very limited and could be vastly improved.Fortunately local restaurants provide breakfast for 30,000 rupiah or less,around £2.00. A further irritant is the fact that fridges are not provided as standard in the rooms and this is a must. The reception hire them out at 3 dollars a day but fotunately I had kept the tour operators description of the room which stated a fridge was included. On producing this i was given a fridge free of charge.Having said all this i still enjoyed the stay at the Bumas but i can see how these things would upset some people and for just a small outlay by the hotel all these problems could be avoided.The problems are with the management of the hotel and not the staff.", "title": "Relaxing and friendly but without any frills", "helpfulness": 6, "user": "MurciaDivechick", "date": "October 30, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 48098360}], "location": {"country": "Indonesia", "continent": "Asia"}, "stars": 3, "variance": {"poor": 15, "average": 40, "very good": 56, "terrible": 11, "excellent": 14}, "aka": "Bumas Hotel Sanur", "slim_ranking": 0.822580645161}