{"user_rating": 3.5, "review_count": 1742, "name": "Butlins Skegness Resort", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "Just got back from spending our first visit at Butlins.We went for a three night stay over the Weekend.I travelled with my husband and our twin children 22 months. We had a superb time.We stayed in a 2 bed room in Silver Accomodation in Starfish Quay, clean and comfortable and a good base.We upgraded to DBB, food was plentiful but a bit bland, and very few healthy options, but the restaurant was clean and the service good.Would look at upgrading to Premiun next time.", "title": "Fantastic Time!", "helpfulness": 1, "user": "helensmithLeeds", "date": "May 2, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 129241797}, {"rating": 1.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "The entertainment was excellent, in particular for the children, they had a fantastic time seeing Bob the Builder and Fireman Sam ,Jack and the Beanstalk Panto, the indoor rides and the playcentre , Splassh Pool were great for the children . The Front Room bar had the footie on in the afternoon so my husband was happy too.The weather didnt stop us from having a good time,as there was plently to do.The staff were all so cheery and friendly,would definaitely revisit and recommend. In this country you get use to the varied weather, so its really important to go with the flow and enjoy yourself and make the most of your family time, as it is few and far between with work commitments etc. Enjoy!", "title": "Expensive and downrate horrible", "helpfulness": 1, "user": "Dawnsimon", "date": "May 2, 2012", "detail_rating": {"service": 1.0, "cleanliness": 2.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 3.0}, "id": 129238725}, {"rating": 3.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "We came here for a weekend away and booked bedrooms only with the food included, the food was basic, I would say a second rate ikea standard, we left the resort fri and sat night as feel it didn't cater for our needs, the sheets were smelly and you could hear everything from the people staying in the next room, snoring and conversations, made my wife feel quite scared.", "title": "expensive", "user": "jess c", "date": "May 2, 2012", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 2.0, "sleep": 1.0, "rooms": 3.0, "location": 3.0}, "id": 129219732}, {"rating": 3.0, "stay_parameters": "Stayed April 2012", "text": "We will never return here, infact it was that bad even though we had paid for meals on the sunday and monday we left early to go home.Overated 2nd rate service, never again, we upgraded to silver accomm....think the only extra was an iron !!!! a drip on the bathroom floor made it wet through all the time we were there and guess what? they are not interested in our comments.", "title": "Not a lot to do considering the amount I paid to stay in a tiny room with nothing in it.", "user": "Saraturner", "date": "May 2, 2012", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 3.0, "service": 3.0, "rooms": 2.0}, "id": 129217356}, {"rating": 2.0, "stay_parameters": "Stayed April 2012", "text": "weather was awful but carnt help that the accomdation was a bit plain and boring for a sliver could of been better it was only expensive cause of cash machines chargeing you per transaction", "title": "Expensive and rubbish", "helpfulness": 3, "user": "Loulou972011", "date": "May 1, 2012", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "location": 2.0, "service": 1.0, "rooms": 2.0}, "id": 129166461}, {"rating": 5.0, "stay_parameters": "Stayed May 2012", "text": "Stayed for 3 nights in a caravan which we sub let via the Internet Caravan was great but only had single glazing. Despite having a gas fire and a portable oil filled radiator provided in was a very cold weekend and we went to Argos and bought a fan heater for £14. After that it was great. If we had known we could have brought one with us. Some other caravans had double glazing but they still have thin walls and loads of air vents.", "title": "Caravan village review", "user": "mince963", "date": "May 10, 2012", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 129698137}, {"rating": 4.0, "stay_parameters": "Stayed April 2012", "text": "The location was good. Only 5 min walk to the activities but away from all the noise. Activities and shows were great for our 4 year old. Lots more to do than at Centre Parcs and most at no extra cost. Pool area not quite as good as CP's but still enjoyable. Changing area was very cold though.", "title": "Great resort for the family at reasonable prices", "helpfulness": 1, "user": "tomtomsmom", "date": "May 9, 2012", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 129671198}, {"rating": 5.0, "stay_parameters": "Stayed April 2012", "text": "Much better value than CP's.", "title": "Trip number 7 still finding new things to do!! Amazing value for money", "user": "The4goodwins", "date": "May 8, 2012", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 129606210}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "Heard a lot of people complaining about noise in the chalets and checking out early. Would do the caravan again next time", "title": "FANTASTIC FAMILY HOLIDAY!!", "helpfulness": 3, "user": "joanne w", "date": "May 8, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 129605918}, {"rating": 5.0, "stay_parameters": "Stayed May 2012", "text": "We had a wonderful time at Butlins this year. We booked on a late deal and got an excellent price. We also went during a quiet week so queue times were greatly reduced which meant more time to do things rather than time spent waiting.", "title": "How can anyone possibly complain????", "helpfulness": 3, "user": "gemwanos", "date": "May 8, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 129600895}, {"rating": 2.0, "title": "Ok for children!!", "text": "Me & my family recently stayed for 5days in the basic self catering apartments 2 rooms, lounge/kitchen/diner area, small bathroom there was another room but there was no handle on the door so dont know what was behind that!! The apartment was clean although very dated the windows had gaps in them which we found out the first evening when I checked on my little boy to find the curtains blowing wide open (the window was shut because we was on the ground floor) so me or my partner took it in turns to sleep in there so my little boy would keep warm. The shower door wouldn't close properly in the bathroom so the water would be all over the floor by the time you'd finished your shower which wasn't good when the supposed bath mat they gave you was a hand towel!! Butlins itself was brilliant for my little boy, the shows had all his favourite characters so he was well pleased, the arcade was as you'd expect, we didn't visit the fairground because of the weather (it rained all week) We spent a lot of time in bob the builder land which my little boy loved, splash world was as you'd expect for a swimming pool although I was surprised they didn't have there own toddler area but they are expanding that area so who knows. As we went self catering we found there was very limited places to eat I.e burger king, papa johns & the chipshop which wasn't very nice when we did eat there, we found it to be very pricey if we wanted to eat in the restaurants £15 pp or £8 for children, now being a mother of a 2yr old I know he couldn't eat £8 worth of food in a week never mind in one mealtime!!! There was a pub on site that did meals but that was often very busy & again the 1 time we did eat there wasn't very nice. We left a day early but I think that was mainly down to the weather but as a whole I'd be very suprised if went back to that particular Butlins again!!", "helpfulness": 1, "user": "Beccy D", "date": "May 8, 2012", "id": 129589216}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "We spent 5 days at Butlins Skegness in a gold apartment (We being a family of 4 - 2 adults, 2 children, 8 & 4 yrs) and I have to say it was fantastic. Value for money is excellent. There is so much to do within the resort. Bob the builder rides for younger children, swimming pool with water slides, fun fair, soft play - and this is all included in the cost!! Obviously it can get more costly if you want to do some of the other things where there is a supplementary cost (climbing wall, high ropes, cinema etc).", "title": "Excellent fun for children!! (and adults!!)", "helpfulness": 3, "user": "Kelly R", "date": "May 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 129455911}, {"rating": 2.0, "stay_parameters": "Stayed May 2012", "text": "Overall, great holiday had by all. Not sure I would pay the prices during the school holidays though!!", "title": "If you stay here book gold!!! As basic hidious!!", "user": "wowkat", "date": "May 6, 2012", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 3.0, "service": 3.0, "rooms": 4.0}, "id": 129455196}, {"rating": 3.0, "stay_parameters": "Stayed May 2012", "text": "We came down for footy tornament and thsnkgod we chose gold rooms as the other options were just awful and wouldn't put a dog in there! First time here but never agsin just not for us!! On a positive house keeping excellent and helpful room was very clean and came every day to clean. Food here average but staff in papa john excellent!! We had fun but place needs a good makeover and touch up!!", "title": "My son liked it", "user": "juneryder", "date": "May 6, 2012", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 4.0, "rooms": 3.0}, "id": 129451348}, {"rating": 3.0, "stay_parameters": "Stayed March 2012, traveled with friends", "text": "The holiday was ok even rho when we got there we got put in the wrong room with no electric .then moved to a room were the keyss had to be ativated 3 tumes due to others trying get in our room becouse they also been given our aportment.", "title": "Good for kids, but quite run down", "helpfulness": 1, "user": "Alf_9104", "date": "May 5, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 2.0, "rooms": 2.0, "location": 3.0}, "id": 129406664}, {"rating": 3.0, "stay_parameters": "Stayed May 2012", "text": "Spent 5 days at the skegness resort for our first Butlins holiday for me, my husband and our 3 year old daughter. We were in the Gold apartments, however these are the furthest away from the centre for all the events. Realistically its only a 10/15 minute walk but when its freezing cold and wet it seems ages!! The apartment itself was ok and was clean. We were self catering so had most of our meals here but the kitchen area was small and not much room to put anything anywhere. Beds comfy and had tv/dvd player in the living room which was good.", "title": "Ok, but didn't meet my expectations", "helpfulness": 1, "user": "barney4_11", "date": "May 4, 2012", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 3.0, "service": 5.0, "rooms": 4.0}, "id": 129379196}, {"rating": 1.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "Entertainment was good, the Bob the Builder world is where my daughter spent most of her time on the rides. Swimming was a bit of a let down but only for the fact that there is not much space for babies/toddlers who are learning. All the other pools had water jets and rapids which are no doubt fun but my little girl was quite restricted to be somewhere a bit more quiet. But they are undergoing construction at the moment too so maybe this would improve.", "title": "rip off place", "helpfulness": 3, "user": "shroplass", "date": "May 4, 2012", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 2.0, "rooms": 2.0, "location": 1.0}, "id": 129355185}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "Arcades were good, wide variety, you need a bit of money to gather tokens that you can collect over time and get gifts in return. Soft play area excellent and manned by staff so they are always on the look out. Outside funfair ok, bit basic but didn't help it was freezing.", "title": "Great holiday fun that gets better all the time", "helpfulness": 1, "user": "Jon T", "date": "May 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 129321924}, {"rating": 5.0, "stay_parameters": "Stayed April 2012", "text": "Didn't really get to watch the shows as my daughter wasn't interested in them so we went bowling a couple of times and went out to visit the nearby seal sanctuary which was small but still a few hours visit and get to see the animals being fed and lots of other creepy crawlies!!", "title": "Lovely break", "helpfulness": 1, "user": "lsecrets", "date": "May 3, 2012", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 129284972}, {"rating": 2.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "Overall it was ok but the weather didn't help. The apartment could have been better and things were quite pricey to buy there.", "title": "Lost it's way", "helpfulness": 2, "user": "sirianpaul", "date": "May 2, 2012", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 1.0, "sleep": 1.0, "rooms": 2.0, "location": 1.0}, "id": 129252786}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "variance": {"poor": 144, "average": 277, "very good": 490, "terrible": 177, "excellent": 654}, "aka": "Butlins Skegness", "slim_ranking": 1.0, "detail_rating": {"service": 4.0, "cleanliness": 3.5, "value": 4.0, "sleep": 3.5, "rooms": 3.5, "location": 4.0}, "description": "Set on the Lincolnshire coastline, Butlins Skegness resort is the place to go if you’re a beach lover. Butlins Skegness boasts a luxury spa, fantastic outdoor family pools and the longest, sandiest beach. Staying in charming New England style accommodation you’ll feel right at home. Make the most of the county famous for its agriculture and take the kids to visit a real working farm, or even meet the seals at the seal sanctuary."}