{"user_rating": 4.0, "review_count": 1017, "name": "Butterfly on Prat", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled with friends", "text": "We been hong kong for the first time and the staff helps us a lot for attractions and restaurants. The service is nice as well as the room decoration. Also, free wifi.", "title": "Lovely hotel in a good service", "user": "Pailin S", "date": "April 19, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 128178565}, {"rating": 5.0, "title": "Good service & helpfull all of staff", "text": "Nice hotel with a very nice staff, clean room, this condition is the same as we're looking at everybody's comment in booking.com.......nice to stay at your hotel....thank you....", "user": "Bimo H", "date": "April 17, 2012", "id": 128089121}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled solo", "text": "This was my first stay with Butterfly on Prat and what impressed me was the good and friendly service provided by the staff. They made my stay very pleasant and comfortable which is what good hotels should be doing. The location was excellent as it was about 5 minutes from Tsim Sha Tsui station. However as it is along a busy street, it can be quite noisy. I booked a superior room but was given an upgrade as the hotel was crowded. The room was big and comfortable, there was ample space to move around. With free wifi, I was able to face time with my family anytime I want. Plus the wifi connection was good and had no disruption. If only the hotel had a 'no smoking' policy, the cigarette smell do linger in the lift and along corridor areas. A sign to remind customers to tone down is required at the lift area, it can be quite noisy which was what I experienced as my room was directly facing the lift. Overall, this is a good hotel which I would come back to as well as recommend to friends going to Hong Kong.", "title": "Friendly service and big room", "helpfulness": 1, "user": "Goodtrip2012", "date": "April 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 128030116}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "I only stayed one night at this hotel. The hotel was a little hard to find bc there are so many small streets. Having found the hotel, I was fairly impressed with the chicness of this hotel. Located right in Tsim Tsa Tsui, it is a great location to be in such a busy area. The room was nice and chic. If I had known, I would have stayed longer however I was booked in another hotel and only needed the one day stay. There are many restaurants and shops within the area. The check in process was quick and painless. Overall a great hotel!", "title": "Boutique and chic!", "helpfulness": 1, "user": "jenn4592", "date": "April 13, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 127832071}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "We booked this hotel for its proximity to some restaurants that we wanted to check out. We were in for a pleasant surprise! Butterfly on Prat was located right in the middle of everything - restos, cafes, dessert shops and bars. It's also a mere 5-8 minute walk to the MTR station and Nathan Road. The room was beautiful, clean, and came with a microwave, a well-stocked mini-bar, fluffy pillows and everything else that you would usually find in a much more upscale hotel. The hotel also has a friendly English-speaking staff and excellent Wi-fi.", "title": "Chic and Modern!", "helpfulness": 1, "user": "ard0912", "date": "April 13, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127787918}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "I booked this hotel for my husband and myself via the internet and had no problems at all with booking. Check-in was not perfect but was not difficult. There was a little communication issue but this was solved quickly after a little checking.", "title": "Charming!", "helpfulness": 1, "user": "purplepinay", "date": "April 11, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 127650840}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "The room we had was quaint and (truthfully) stylish. It was brown and white with orange ceiling accents. Stylish! The bathroom was comfortable and spacious. There was no tub but the shower enclosure was big. The bed was very comfy. The TV was big. Wi-fi signal was strong and free. My only issue was that the thermostat of the air-conditioning was not perfectly tuned so I had to snuggle underneath the (thankfully) warm quilt. The bedroom slippers were also quite charming. There were 2 pairs in the room--one in violet and another in lime green. This is a nice departure from the usual white bedroom slippers that are found in other hotels.", "title": "Butterfly on Prat- excellent value & location!", "helpfulness": 2, "user": "fatcat2222", "date": "April 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127544668}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled solo", "text": "The hotel is less than 5 minutes walk from the Tsim Sha Tsui MTR station so it was very convenient. It is near enough to everything. It does not have any coffee shop but it does have smoking rooms (we stayed in one of those, by request), free use of computers in the hotel lobby, efficient cleaning and maintenance service and fast elevators. The lobby is as cute as it appears on the websites and travel sites. Kudos to the interior designer. The ambience of the hotel contributed greatly to the whole experience.", "title": "Lives up to it's motto", "helpfulness": 1, "user": "Changsha_Panda", "date": "April 9, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 127522817}, {"rating": 4.0, "stay_parameters": "Stayed April 2012", "text": "Would I check in again? Yup, yup, yup!", "title": "2nd stay, not as good as the 1st one though...", "helpfulness": 1, "user": "fijitime71", "date": "April 8, 2012", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 3.0}, "id": 127463690}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "We stayed at Butterfly on Prat from 5-9 April 2012 for a short weekend getaway.", "title": "Very good, terrific location", "user": "Michelle C", "date": "April 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 127460956}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "We stayed at Butterfly on Prat for 4 nights. Checking in was painless and the staff were very helpful. We had two rooms on the 9th floor, one with a queen bed and the other was a twin. The twin room was larger than the double and were spacious for Hong Kong standards. I guess we were high enough not to hear noise from the street. There is no scenic view on this floor! The The chic colour scheme in the rooms was refreshing and one could not fault the cleanliness of the place. Free wifi is a major plus as is access to public transport.", "title": "Great Location, good value", "helpfulness": 2, "user": "Dunedain", "date": "May 4, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 129343745}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with friends", "text": "The efficient metro at Tsim Sha Tsui is a few minutes walk away. Being in the heart of Kowloon, we found it buzzing with activity all the time and we went with the flow and found it safe to walk in the area at night. If shopping is your thing then Nathan Road is a stone's throw. There was never difficulty in finding eating places as eating is a favourite pastime. We took the queue from the locals and frequented places where they ate.", "title": "Very good hotel !", "helpfulness": 1, "user": "julia s", "date": "May 4, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 129343287}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "As we spent most of our day out and about, we found the hotel to be a good place to rest away from the hustle and bustle of the crowds. We choose the Prat as we wanted to be in Kowloon otherwise we would have stayed at the Morrison or the Wellington which might well be the case the next time we visit.", "title": "Neat, tidy and handily placed", "user": "LoftusroadW12", "date": "April 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 129144564}, {"rating": 3.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "This hotel is very nice and good value for money.Rooms are very nice, modern, and well - maitained. Staff very friendly as well. It's very close to restaurant and bar nearby. Highly recommendation!", "title": "Tidy and neat, nothing special about the rooms though", "user": "raysar", "date": "April 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 129090098}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with friends", "text": "The place is ideal, bang in the heart of Kowloon and close to all that you may need in that part of HK.", "title": "best choice !", "helpfulness": 1, "user": "jiamin88", "date": "April 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 129087731}, {"rating": 2.0, "stay_parameters": "Stayed April 2012, traveled on business", "text": "Sadly after booking this hotel for a 18 night stay i checked out after two nights. The hotel location is fine for backpackers but not a good location for business. The area is very seedy and frequented by some unsightly people and professions.", "title": "Not exactly what you read odr see on the web site", "helpfulness": 1, "user": "bldeagle99", "date": "April 30, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 1.0}, "id": 129073479}, {"rating": 3.0, "stay_parameters": "Stayed April 2012, traveled on business", "text": "Even though the Hotel is supposed to be a non smoking area it is not and after two nights of finding hotel rooms dors open and people openly smoking in the rooms and corridors i left.", "title": "A1 Location- good short-stay business traveller hotel", "helpfulness": 1, "user": "Waterwise", "date": "April 29, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 129061838}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled on business", "text": "Even though i had called the front desk staff about what was happening in ther rooms and corridors it still continued.", "title": "perfect location, good hotel for work or holiday.", "helpfulness": 1, "user": "Philippad", "date": "April 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 128961201}, {"rating": 5.0, "title": "Comfortable and central to everything", "text": "The room quality was ok but overall this hotel is a low 3 star and not at all for a long stay or a business friendly location.", "user": "Leon S", "date": "April 26, 2012", "id": 128628493}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "GREAT SHAME but cannot receommend to stay there.", "title": "\"Great little hotel\"", "user": "Robert M", "date": "April 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 128565652}], "location": {"country": "China", "continent": "Asia"}, "stars": 3.5, "variance": {"poor": 21, "average": 117, "very good": 488, "terrible": 12, "excellent": 379}, "aka": "Butterfly On Prat Hotel Hong Kong", "slim_ranking": 0.106884057971, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.5}, "description": "This chic and contemporary boutique hotel Butterfly on Prat is strategically situated in the heart of vibrant Tsim Sha Tsui providing a perfect location for shopping and sightseeing. The hotel’s 122 rooms are decorated in a bright orange or earthy green color tone offering unparallel comfortable setting and relaxing atmosphere.The hotel is just a few minutes walk from exciting tourist spots and vibrant shopping malls. Explore Kowloon Park, discover Avenue of Stars, or take-in the shopping hub of Harbour City or the luxury name brands along Canton Road.The hotel enjoys a perfect transportation network that allows one to easily cross Victoria Harbour by Star Ferry or by MTR to Hong Kong Convention and Exhibition Centre, or further afield to Hong Kong International Airport and AsiaWorld-Expo."}