{"user_rating": 4.0, "review_count": 99, "name": "Ca' Doge", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "After extensive reading, we decided that this was the place to stay, as we had to stay in Venice for one night before our cruise. It is within 50 feet of the Piazalle Roma, where we get off from the ATVO bus which we took from the airport. The problem is that the PR was crowded with buses and people, and we lost our bearing, so we walked a little out of our way until we found the hotel.", "title": "Locatio, location", "user": "Jed3", "date": "October 26, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 182512535}, {"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "It is an old, small, unattractive building on one corner of the square. We got a room in the annex, which involved getting your luggage through a parking lot of thghtly packed cars. There was someone to help us lift the luggage over the cars through the tight spaces. We had a room on the second floor, which has an elevator. The room was about 250 SF, 2 beds, mostly comfortable. It was plain and unattractive, but clean. It was not noise proof. Breakfast was minimal but adequate.", "title": "Convenient hotel for cruise ship travel", "user": "Zimfamily4", "date": "October 14, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 181072021}, {"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "The second location benefit was that it was within 50 feet of the People Mover, which we took the next morning to the dock. We didn't have to pull our luggage over any bridges. Until there is a better hotel in the PR area, I think this is the best place to stay for one night before getting on a cruise ship.", "title": "Convenient location for cruisers", "user": "sueajp", "date": "October 11, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 180568653}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "We stayed one night in this hotel prior to our cruise out of Venice. We stayed in the main building with no elevator but the person at the desk (a male checking in and a female checking out) helped us carry our luggage up and down. The rooms are adequate, but the a/c worked very well and staff were pleasant. Free breakfast was nice, probably great for European standards. The hotel is located on the Piazzale Roma so is right across the street from the people mover for cruise ship, and the bus terminal and not too far (just over one big bridge) from the railroad station. The best part is that I left a whole bag of souveniers that I had purchased outside the hotel. I ran back to the hotel and a very nice maid helped me find it. She got a big hug and tip!", "title": "Once again ... terrific experience!", "user": "TNTColorado", "date": "October 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 179838538}, {"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled with friends", "text": "We booked this hotel prior to our cruise on The Ruby Princess of the Mediterranean . The location was perfect for us. I had read on Venice for Visitors that you might want to thin about how many bridges you wanted to haul your luggage over! We took the ATVO bus from the airport and the hotel is literally next to the bus station, Piazzele Roma and the People Mover to the port. It was a little tricky to find the door in but were greeted warmly. We had two rooms upstairs in the annex building. We had to cross a very crowded car park, but had expected that. There was an elevator so that was helpful. The rooms were large enough and very clean. Beds were comfortable and the bathroom was updated. There was a refrigerator in the room. They had left a couple of sad looking candy bars and some cans of soda. The air conditioning works well but there is a funny system where you need your room key card to turn on the lights and electricity.the view is of,the car park. Don't open the windows as there can be a mosquito issue. Not necessary for us. The rate included a small continental,breakfast in a small dining room. Adequate..... And there was a good coffeemaker. We were allowed to,store our bags after check out. They were very helpful and cooperative. It was hard to negotiate the luggage around all the cars in the lot like a game of Tetras! I would recommend this hotel for its convenience,price and comfort if you are heading out on a cruise.", "title": "Excellent Location", "user": "Lyn M", "date": "October 3, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 179617701}], "location": {"country": "Italy", "region": "Veneto", "continent": "Europe"}, "stars": 3, "variance": {"poor": 6, "average": 22, "very good": 43, "terrible": 3, "excellent": 25}, "aka": "Ca` Doge Hotel Venice", "slim_ranking": 0.533007334963, "description": "Best located hotel in Venice.Easy to find, situated in Piazzale Roma, where the buses/taxis arrive, two steps far from People Mover going to the port. The only hotel in Venice with private parking available on site.The rooms are spacious and all equipped with free wifi connection, air conditioning/heating, private bathroom and other facilities."}