{"user_rating": 5.0, "review_count": 425, "name": "Ca' dei Dogi", "reviews": [{"rating": 5.0, "title": "Perfect Location and very Accomodating", "text": "We spent June 11-14 at Ca' dei Dogi and this was a great place. Perfect location off of the Grand Canal with boat stops very close and about a block away from St. Marks's square. There are great places to eat everywhere and we simply would walk and get lost and then look for a place to have dinner. The staff here were very accomodating and friendly. The free breakfast was very good and the wait service were great. The room was slightly on the small side, but we managed just fine. Free internet access was available in their lobby on their laptop. This is a great place in a perfect location where you will be treated well.", "user": "NorthTexas76226", "date": "July 8, 2010", "id": 70213281}, {"rating": 5.0, "title": "Excellent Choice", "text": "I am really only repeating what everyone else has said, its in a great location, the staff are fantastic very helpful and friendly. It has a beautiful clean modern interior. Our downstairs room was very small but planned very carefully so that everything fitted in. We loved it and it was our favourite hotel on our european trip. And we loved the fact that we got omlette for breakfast made a lovely change for us.", "user": "greycott", "date": "June 29, 2010", "id": 69034728}, {"rating": 5.0, "title": "Excellent. Don't hesitate - Book Now!", "text": "Excellent location and price. Very easy to find. Steps away from St-Marco and Bridge of Sighs. Close to Grand Canal and water taxis. A clean, modern and safe hotel. Very quiet rooms, in-room safes, air conditionning, excellent full bath rooms. etc. There is even a beautiful roof top patio to relax after your long day of touring and sightseeing. The full breakfasts were excellent (eggs, coffee, croissants, yogourt, fruit salad, juice, etc.). Service at the front desk (Susanna) was excellent and very hospitality. Susanna provided excellent advice for touring around - she really knows Venice. She helped me with my tax refund. Don't hesitate to book here.", "user": "Andy155004", "date": "June 27, 2010", "id": 68871772}, {"rating": 5.0, "title": "Romantic, Excellent Location, Great Service", "text": "My boyfriend and I just stayed at Ca' dei Dogi for two nights this week. It was my birthday and we chose Ca'dei Dogi for its intimate accommodations, excellent and attentive staff and perfect location. Susanna and Stefano were amazingly helpful as my boyfriend planned a special birthday dinner for me and as we needed to plan our transportation options during a massive transportation strike. Also, we went to Lido and rented bikes, which Susanna helped us arrange. It was the perfect way to spend a day!! We had a Superior Room one night and a Jacuzzi Room the second night. I preferred the Superior Room (less expensive, actually) as it had a sweet sitting room and a nice shower with lots of shower heads. The Jacuzzi room had a bigger bathroom but only a bathtub, no shower. And the bed in the Superior Room was softer than the bed in the Jacuzzi room. The breakfast was awesome- great croissants, nutella, lovely fruit salad and yogurt, and omelets if you want. The cappuccinos were dark and strong. You are right around the corner from St. Mark's square with this hotel. It's perfect. I was just thrilled with this hotel and would definitely stay here again.", "user": "alexfi24", "date": "June 25, 2010", "id": 68654060}, {"rating": 5.0, "title": "Charmy and Modern in great Venice location", "text": "Originally booked 2 nights but there was an error with the system and only 1 took . This was caught only days before our arrival. Stefano, the owner, was completely apologetic and had secured another hotel he knew well, around the corner, at the same price. He even promised to move our luggage for us (huge help when you realize how hard it it to lug heavy suitcases up 6 flights of very narrow stairs)! When we arrived he had a bottle of sparkling wine for us. Everything worked out fine....but we would have preferred spending both nights in Ca' dei Dogi as the accommodations were a big step above everything else.", "user": "ricksriot", "date": "June 17, 2010", "id": 67832752}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "We have just returned from a trip to Venice which was extended due to the volcanic ash cloud. We are so thankful that we chose to stay at Ca' dei Dogi as the hotel staff did their upmost to help us deal with this problem, kindly holding a room for us, ringing our airline, advising on a nearby train booking agent and even preparing a breakfast at 4.30am before we left.", "title": "A special place to stay with such friendly, helpful staff.", "helpfulness": 3, "user": "Purdy006", "date": "April 24, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 62314814}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "Ca' dei Dogi is in a fantastic location, behind bustling St. Mark square, yet in the opposite direction you can wondering around the quiet allies of Castello.", "title": "Fantastic Hotel", "helpfulness": 1, "user": "saveryc", "date": "April 13, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 61243561}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "Ca' dei Dogi sets you up for the day with a hearty breakfast including delicious omlettes and after a busy day exploring venice the sunny roof terrace is a relaxing retreat.", "title": "A hidden gem, one block from St. Mark's Square", "helpfulness": 4, "user": "klkb", "date": "April 3, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 60258044}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "We stayed in two rooms during our extended stay, Batik room with its own balcony and the twin room on the ground floor. Both rooms were impeccably clean with a slick design making use of every space available..", "title": "Superb hotel just at the heart of Venice", "helpfulness": 2, "user": "ElFranjo", "date": "March 29, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 59827622}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "The icing on the cake for Ca'dei Dogi is the service we received from Susanna, Stefano and Michael and we cannot thank them enough for their kind hospitality.", "title": "Brilliant - our only 5 star review for our Italian trip", "helpfulness": 2, "user": "love2travelTokyo", "date": "March 26, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 59556152}, {"rating": 4.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "We stayed here for three nights in early June and throughly enjoyed this hotel experience. We stayed in room 301, batik. Yes, the room was small, but it was gorgeous and comfortable. And we loved the peacfullness of our private balcony with potted flowers, table, chairs, and candle in hurricane lantern - the perfect spot for midafternoon or after dinner glass of wine. The bathroom was tight for space, but again beautifully decorated and fully functional. As noted in other reviews, breakfast was excellent, and do have dinner here, as well. Very convenient location. Overall, the service was very good, but some staff were happier to help with information about the hotel and city than others. Also, after the booking, inquiries made by e-mail (about recommended restaurants and advice on airport transfer services) did not receive a response. Regardless, we would definitely stay here again.", "title": "Great value in Venice, beautiful hotel", "user": "SandyGeoff", "date": "June 15, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 67587891}, {"rating": 4.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "We stayed in one of the Jacuzzi rooms with the patio overlooking a garden. The location was great- very close to St Marks square and within walking distance to pretty much everything. It was also very close to one of the stops on the water, so it was very convenient and easy getting to it from the airport. The room was kinda small- not a lot of space around the bed, but the bathroom was pretty large. Only complaint about the bathroom was that it didn't have a shower. It had a shower head attached to the Jacuzzi that you just had to hold over your head in order to shower and rinse. The bed was also pretty hard- but we found that it was typical of most beds in the hotels we stayed at while in Italy. The room was pretty expensive- but we found that was typical of Venice: small rooms for more money than other places. The breakfast was really good- good coffee and pastries and omelets (this was the only place we stayed at that offered omelets). Overall, the staff was friendly and we enjoyed our stay.", "title": "Great Location", "user": "megs4220", "date": "June 9, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 66982877}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "Trip Advisor does it again! Another fabulous find, I cant say enough about this hotel. I was looking for a reasonably priced hotel in Venice to stay before I started my 12 day Med Cruise. The location is a 2 minute walk from St Marks Square which is great. The hotel appears to be all redone and modern inside, the room was spacious, fabulous bathroom, windows that opened and a nice little slider for fresh air too. They serve a delicious hearty breakfast in the morning which was a nice surpirse.", "title": "Amazing Hotel Amazing Service, Amazing Location, Amazing Breakfast!", "user": "Danawheatley", "date": "June 4, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 66479022}, {"rating": 5.0, "stay_parameters": "Stayed May 2010", "text": "Stefano the manager or perhaps owner is just lovely and full of information. They have some nice guides books to look through and a speedy wifi connection, and if you dont bring your computer, they have a laptop available for use, very nice touch.", "title": "Venice's Best Small Hotel--don't tell your friends!", "helpfulness": 2, "user": "braesides", "date": "May 12, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 64002296}, {"rating": 5.0, "stay_parameters": "Stayed May 2010", "text": "Oh and hotel has really nice rooftop patio as well with great view!", "title": "A perfect small hotel", "user": "Holleeds", "date": "May 10, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 63742998}, {"rating": 5.0, "title": "Wonderful from start to finish!", "text": "We had a wonderful time in Venice, and staying at Ca' dei Dogi made it even better! First of all, the directions are great! Arriving by vaporetto from the train station, getting off at St. Marks Square, and then walking the narrow streets to the hotel couldn't have been easier. Check-in was fast & friendly, and our room was modern, but charming...good bed, bathroom, plenty of storage..just right!", "user": "TeachinCa", "date": "August 14, 2010", "id": 75229886}, {"rating": 5.0, "title": "Good location, very comfortable, terrific staff, great value!!!", "text": "We looked forward to our breakfasts everyday (wonderful omelettes!) and the staff treated us like we were guests in their home! We're so very happy that we stayed there.", "user": "lightning411", "date": "August 5, 2010", "id": 73932409}, {"rating": 5.0, "title": "The Reviews are Right", "text": "The owner Stephano & Susanna were extremely pleasant, knowledgable and helpful. They were genuinely interested in making a guest feel comfortable. This was quite apparent via emails we had sent while evaluating where to stay. They were always curteous and responsive. The included breakfast was really nice. We (wife/17 year old daughter and 12 year old son) stayed in the top floor apartment across from the main hotel/restaurant. It was spacious enough and had a full kitchen and balcony/terrace. It was quiet and realxing. My son has a dairy allergy and they were very careful to provide food that he could eat in their restaurant. The hotel is just over a1 minute walk down the alley to the main lagoon at San Zaccaria which is next to St. Mark square. In fact, it is behind the 5 star Hotel Danieli. Of course you could spend 3 times (or more) for that hotel or enjoy the wonderful value and hospitality of this hotel. We were fortunate to find this gem and were quite happy with our decision to stay there. We highly recommend this place if you are visiting Venice.", "user": "gazmania", "date": "July 31, 2010", "id": 73141208}, {"rating": 5.0, "title": "Absolutely Perfect!", "text": "Chose this hotel based on TA reviews. We weren't disappointed. The staff could not be more attentive. As Italian breakfasts go, this was better then our other hotels. First impression; down a tiny alley then approaching the building, we wondered what we were heading for. Inside, a warm welcome, relieved of our luggage, quick debrief and off to the room. As others have said, if there has to be a downside, it has to be the small, cramped rooms. However, this is Venice. The room was small but cleverly designed with the traveler in mind. Ample power points, room safe, air con, and tea/coffee making facility. Gorgeous shower room. Free internet. Nice cosmetics. I can go on............just go there; you won't be disapointed.", "user": "cdnliving", "date": "July 30, 2010", "id": 73041978}, {"rating": 5.0, "title": "They really know how to take care of you at the Ca dei Dogi", "text": "Our family of four (children 16, 14) stayed here for three nights and it was absolutely delightful. The rooms were tastefully decorated, although small they were efficiently designed, and very clean. The morning breakfast was one of the best we had throughout Italy - fresh pastries, yogurt, fruit salad, coffee, juices and custom made omlettes. A perfect location, close to St. Marks. And above all else, the owners Stefano and Susanna and ALL of the staff were amazing - always charming and attentive - we felt like family thanks to their kind hospitality. Thankyou Stefano, Susanna and everyone at Ca' dei Dogi for a wonderful stay!!", "user": "LZ12345", "date": "July 21, 2010", "id": 71832088}], "location": {}, "variance": {"poor": 0, "average": 11, "very good": 80, "terrible": 0, "excellent": 334}, "aka": "Ca` Dei Dogi Hotel Venice", "slim_ranking": 0.0551181102362, "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.5, "rooms": 4.5, "location": 5.0}}