{"user_rating": 2.0, "review_count": 33, "name": "Cabana Motel", "reviews": [{"rating": 1.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "We decided to take a long weekend in Ocean City, MD the 1st weekend in September, 2009. Check out a lot of sites and this Motel kept coming up - being touted as \"clean, family owned and operated, yadda, yadda\". We didn't want something right on the beach of boardwalk because of the noise and this one was a block in - pretty pictures - family run - sounded good enough - we just needed a place to sleep!", "title": "DISGUSTING! Don't STAY", "helpfulness": 4, "user": "Lislazz", "date": "October 6, 2009", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "location": 4.0, "service": 1.0, "rooms": 1.0}, "id": 46002135}, {"rating": 5.0, "title": "I will be back - great location&rate", "text": "It was the most disgusting place I have ever stayed in. Unfortunately, they've got your deposit up front and as you're checking in (and second guessing you're plan because of what you're seeing in person - and it has nothing to do with the photos on any web site checked) you see the small sign that says \"no refunds\". So you might as well grin and bear it and stay the night. Right? WRONG. DON'T DO IT! RUN AS FAST AS YOU CAN.", "helpfulness": 4, "user": "amiga801", "date": "August 28, 2009", "id": 39066330}, {"rating": 1.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "Entering the room - (I'll forget about the outside - it is a motel near the beach - the elements have beaten it to death) we put down our bags and sit on the corner of the bed, which immediately falls to the ground.", "title": "The most nasty place you've ever seen, trust me", "helpfulness": 1, "user": "Jay3607", "date": "August 17, 2009", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "location": 5.0, "service": 1.0, "rooms": 1.0}, "id": 37896075}, {"rating": 1.0, "stay_parameters": "Stayed August 2009, traveled with friends", "text": "The carpets, wall paper/paint, curtains, etc., have not been changed (or probably even really cleaned) since the 1960's. I am NOT exaggerating.", "title": "Spend the extra money for a better place", "helpfulness": 1, "user": "Traveler1234Pa", "date": "August 14, 2009", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "location": 1.0, "service": 1.0, "rooms": 1.0}, "id": 37668410}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "The bathroom - OMG. Worse than the public restrooms on the beach/boardwalk. Again, NOT exaggerating.", "title": "Very Small but Nothing too bad", "helpfulness": 1, "user": "poca1313", "date": "July 7, 2009", "detail_rating": {"cleanliness": 5.0, "location": 5.0, "value": 3.0, "rooms": 3.0}, "id": 34173033}, {"rating": 1.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "I have stayed at the Cabana many times in the past and it was always \"Okay\" (you got what you paid for). However this most recent stay was the first time in about 5 years. Since then there has been new owners. The room was filthy, the bathroom made me want to vomit it was so dirty. (see photos) We never got clean towels, I had to go into the store room and get them myself. I was affraid to eat anything while in the room for fear I might get sick. I am 49 years old and I have traveled all over the world and this motel without a doubt is the most disgusting place I have ever seen. If anyone has given this place a goo rating I will bet a years pay it came from the onwers. The toilet would not flush and I complained but they did nothing and I had to fix it myself. I would not shower in this room and had to go to a friends hotel to shower", "title": "HORRIBLE!!!!!", "helpfulness": 1, "user": "tspeck63", "date": "July 15, 2012", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 1.0}, "id": 134436901}, {"rating": 1.0, "stay_parameters": "Stayed June 2012", "text": "At the last minute we decided to stay in OC for another night and couldn't stay in the same motel. Being stingy we did not want to spend an arm and a leg....big mistake. The guy at the front desk was nice enough to let us check in early but that was the nicest thing about the Cabana Motel. As soon as we walked in the room it smelled like rum vomit. Even after spraying the room with air freshener the smell lingered. The sink only have out a trickle of water, barely enough to wash your hands and lord only knows what the stains were on the shower curtain. Showers weren't taken and we slept with our shoes on. Whenever anyone walks by your room, especially on the second floor, it feels like the building is going to crash to the ground. Do yourself a favor and spend and extra $30, it'll make a huge difference.", "title": "Spend the extra $ for a cleaner room", "user": "SaltyPaw", "date": "June 20, 2012", "detail_rating": {"cleanliness": 1.0, "value": 3.0, "location": 5.0, "service": 3.0, "rooms": 1.0}, "id": 132372323}, {"rating": 1.0, "stay_parameters": "Stayed August 2011", "text": "Granted it's $40 a night, but this place is flat out disgusting. We had dead cockroaches all over our room's wall when we checked in. I complained, but the guy at the desk didn't even speak english. What a disgrace. We are not at all picky, but we ended up sleeping in our car. Do yourself a HUGE favor, don't be cheap and settle for this dirthole. Spend the extra few bucks elsewhere...ITS WORTH IT", "title": "They couldn't PAY ME to stay here again, dead cockroach on the wall as we checked in, most disgusting building I've ever stepped", "helpfulness": 1, "user": "MarkBees", "date": "August 30, 2011", "detail_rating": {"cleanliness": 1.0, "value": 2.0, "location": 3.0, "service": 1.0, "rooms": 1.0}, "id": 117430902}, {"rating": 3.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "My boyfriend and I wanted to take a spur of the moment trip overnight to OC back in June of 2010 (not 2011 like it says above). We found out about The Cabana Motel online prior to going down and booked the room a few days in advance. We really didn't think it was all that bad, considering the price was affordable for us and we are not all that picky. It was very close to the beach and boardwalk and was just fine for us. I didn't notice any mold, smells, dirty carpets or plumbing issues. The only things that I can say that weren't good about the place were the rickety, old, wooden steps that we had to walk up to get to the 2nd floor to our room, the fact that the key we were given wouldn't open our door so we had to go back to the office and get the attendant, and the ants that invaded the room during the night (I woke up and found them all over the nightstand and next to my head on the bed). Other than that, the room pretty much provided everything we were looking for...a place to crash, watch cable, keep a few drinks in the mini fridge, a microwave, and a nice, little view outside the bathroom window which faced the beach. The bed was really comfortable, too. I'd go back again, and I've heard they made some renovations since we stayed. Maybe they worked out the kinks...", "title": "It was an OK place to stay spur of the moment", "helpfulness": 2, "user": "Pam L", "date": "August 21, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 4.0, "value": 5.0, "service": 3.0}, "id": 117054227}, {"rating": 2.0, "stay_parameters": "Stayed June 2011, traveled on business", "text": "If you are looking for a very basic room without traditional amenities or hotel comforts, this is for you. Hotel rated a 2-star - very much a stretch. Older motel that has not been updated (no outlet in bathroom, old tile, old windows, screen with large hole - allows flies in). You will need to bring a power strip, blow dryer, and iron / ironing board. Room did provide clean sheets / towels and ok flat pillows. Mini-fridge, microwave, and old TV were stacked vertically in the closet space opposite the beds. No room for hanging clothes. One dresser - 2 drawers was it for storage. Shower curtain had mold and it was hard to tell if tile was clean so bring flip fliops. Front desk staff very friendly. Hotel rate was inexpensive. Many long-term :young people were guests.", "title": "You get what you pay for", "helpfulness": 2, "user": "cin0576", "date": "June 23, 2011", "detail_rating": {"cleanliness": 2.0, "sleep": 2.0, "value": 3.0, "service": 3.0}, "id": 114675336}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "We came down on a weekend that we randomly planned. looked up some hotels and motels , but they were ridiculously expensive, so then we stopped by cabana motel. they had a good price and i've been told they just re innovated the rooms, so we decided to spend the weekend there. We had a wonderful time there , not going to lie, its nice, cozy and looks fresh. staff is also very helpful and nice. while i read all other reviews on this site i just had to write a review that they really did a good job on renovating the rooms and they look nothing like the photos i saw on this site, however i never stayed at this motel before.", "title": "Accessible! Affordable rates and we loved it!!", "helpfulness": 10, "user": "Thomas54046", "date": "May 30, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 110541862}, {"rating": 1.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "I read the reviews for this motel after I had already booked the room. I had been to OC before and remember seeing it, and the pictures from the website didn't look to bad. But even after i read the bad reviews I figured it couldn't be that bad. Well I was wrong. It was. It was by far the worst place I've ever stayed in. We first walked into the lobby to check in and the lobby had a funky smell and looked like the carpet hadn't been cleaned in years. Well our room wasn't any better, first we couldn't open the door all the way cause it hit the bed cause the room was so small. My bedroom at home is bigger then the entire room with the bathroom. The smell was horrible and you can't even open a window to even try and air it out. The carpet hadn't been vacuumed in years and it looked like the bathroom hadn't bee touched in that long either. I had to wear my flip flops in the shower cause I was afraid to touch the floor. They gave us 2 towels and when I asked for more they told me that I would need to bring him all the dirty stuff before he could give me more, and I said I thought that is what the maid was for and he looked at me like I was crazy. They don't use fitted sheets so they slide off all night long. And when I was packing up to leave my boyfriend found dirty socks under the bed that weren't ours, who knows how long the were there. Stay as far away from this hotel as you possibly can.", "title": "Horrible place to stay.", "helpfulness": 1, "user": "manda1344", "date": "September 18, 2010", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 5.0}, "id": 80097365}, {"rating": 2.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "But that's where it ends...OK...I took the cheap route...but also fell for the advertisement and claim of \"new management\". The 1st room offered had the commode dismantled and laying in pieces on the bathroom floor, and the sink was full of ashes and cigarette butts.", "title": "Prime location.....", "helpfulness": 1, "user": "Dugl", "date": "September 7, 2010", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 1.0, "sleep": 3.0, "rooms": 2.0, "location": 5.0}, "id": 78699058}, {"rating": 1.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "A replacement room was offered and it was somewhat better.......", "title": "It's not the Hilton.", "helpfulness": 4, "user": "kjill99", "date": "August 27, 2010", "detail_rating": {"service": 2.0, "cleanliness": 1.0, "value": 2.0, "sleep": 3.0, "rooms": 1.0, "location": 5.0}, "id": 77041100}, {"rating": 3.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "1.) One bed frame was broken.", "title": "Decent", "helpfulness": 4, "user": "msvenice", "date": "May 13, 2010", "detail_rating": {"service": 4.0, "cleanliness": 2.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 64055802}, {"rating": 1.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "Stayed here for 4 days last july. It was very hard getting extra towels, there was mold on the ceiling and in the bathroom. The entire room smelled like something had died. The cherry on the top was when i thought the maid was stealing money from me. I would leave spare change on the dresser and on the bed, when we came back form our day it would be gone. I wouldent suggest anyone staying here, you get what you pay for. Also, I got a really bad case of athletes foot from their beautiful bathroom floor, make sure you wear flip flops, bring your own blankets, and maybe a safe to put you’re belongings in.", "title": "Nasty!!!!", "helpfulness": 1, "user": "BannaBoat87", "date": "June 16, 2009", "detail_rating": {"cleanliness": 1.0, "value": 3.0, "location": 5.0, "service": 1.0, "rooms": 1.0}, "id": 32488199}, {"rating": 1.0, "stay_parameters": "Stayed June 2008, traveled with friends", "text": "This hotel was terrible. For starters the room was riddled with ants. It was highly disgusting. Throughtout the week the security comes door to door.. EVERY NIGHT to knock on your door and check to make sure you don't have anyone over because your allowed no guest. And you have to watch him sit in the parking lot and yell at girls all night. Then at check out which i believe was 11. I go to the front to get my security deposit, and they don't have any money because they just opened, the guy asked me to come back later. I live 4 hours away might I add. So after numerous phone attempts to get my money back with the the response of \"we sent it out today\" a few times.. i gave up.", "title": "Waste of a vacation", "helpfulness": 1, "user": "WvJjjjjjj", "date": "January 9, 2009", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 3.0, "location": 4.0, "rooms": 1.0}, "id": 23403281, "likes": {"liked": "— the location", "disliked": "— the hotel its self and everything associated"}}, {"rating": 3.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "This hotel is horrible if your going to enjoy OC do not.. i repeat do NOT stay here. Ants. Musky Smells. Mold. BOO! thumbs down.", "title": "I want to Stay Again!!!!", "helpfulness": 1, "user": "lullabykisses13", "date": "May 30, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "location": 5.0}, "id": 16519996, "likes": {"liked": "— The location and price.", "disliked": "— Nothing really, but if I had to say something it would be the fact there was no one in the office at night."}}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "I'll admit it wasn't what I expected...but for me it was perfect! Me and my guests stayed in a standard room and some other people that were with us stayed in the larger room. The standard room was fine, small, but sufficient (stay in the deluxe room if you have a lot of people). The bathroom was a good size and the shower was plenty large enough (The bathroom in the deluxe room was the same size but had a tub/shower). It has great parking and great proximity to the beach and boardwalk. The balcony/walk way is a little concerning because its weak in some places, but it wasn't a problem. I stayed on the second floor in a room second from the end. I wanted to stay this year but they were booked for the dates I need :). I liked it, and it was the best vacation I ever had (and yes I've stayed in nicer hotels). Perfect for people who want to spend most of the day out and about and have a clean convenient place to sleep and shower...or just watch TV. Oh and big plus...Dunkin' Donuts is right next door...and CVS is across the street! Such a great location we never had to use the bus (I do like the bus though, its great for getting around). All in all, I got my money's worth and then some.", "title": "old but very clean and good price", "helpfulness": 1, "user": "aj4519", "date": "August 30, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 8588587}, {"rating": 1.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "me and my wife stayed at the cabana motel for a week our stay was very good the price was even beter and the service i could not say one bad thing about it i would tell all my friends to stay at the cabana because the price is great and teh rooms are clean and its a family motel that does not rent to too many kids i saw all families there and i liked that alot.", "title": "Mold Ridden Mess!", "helpfulness": 2, "user": "silverpen957", "date": "July 16, 2007", "detail_rating": {"front_desk": 2.0, "business": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "location": 4.0, "rooms": 1.0}, "id": 8126813, "likes": {"liked": "— The location (19th street on the boardwalk)", "disliked": "— everything else!"}}], "location": {"country": "United States", "city": "Ocean City"}, "stars": 1.5, "variance": {"poor": 4, "average": 4, "very good": 3, "terrible": 21, "excellent": 1}, "aka": "Cabana Hotel", "slim_ranking": 0.962264150943, "description": "The Cabana Motel welcomes you to relax and enjoy your summer vacation in our comfortable and friendly motel. Our small motel has been a land mark in ocean city Maryland since 1954 we have gone through many changes and many remodelings and many face changes but as then and now we are still offering a great place to stay and enjoy the beach and at reasonable prices. We are conveniently located just half-block from the beach and the famous ocean city boardwalk. The Cabana Motel is within walking distance of Phillips sea food buffet just half a block away and jolly Rodgers amusement park just half a mile away also night life entertainment just one block away and a shopping center just half a block away. Complimentary coffee is available in the motel lobby in the morning. At the Cabana Motel we try to provide a quiet atmosphere so you can enjoy the bay and ocean air. We also have a pool with a great sun deck so you can get your sun tan or have fun with your kids and family. So call today to make your summer vacation at the Cabana Motel."}