{"user_rating": 4.5, "review_count": 12, "name": "Cabana Beach Club", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed February 2009, traveled with family", "text": "Overall we were satisfied with Cabana Beach Club and Resort Quest but there were some minor issues which will be outlined below.", "title": "Cabana Beach Club Unit 12 (on the bay side)", "helpfulness": 3, "user": "caramela", "date": "February 9, 2009", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 4.0, "service": 3.0, "rooms": 3.0}, "id": 24419354}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled with family", "text": "When we first walked into unit 12 we were very happy with what we saw. The unit had been renovated and was clean. Contrary to a review I read which said the front door was in the bedroom, ours was in the living room. The front door is in the back by the deck. It may seem strange but you have to go to the back of the building to access your front door. The back doors (patio doors) are facing the street and that may seem a bit weird but there is a dead bolt so we never felt unsafe at night (besides Longboat Key is very safe).", "title": "great place", "helpfulness": 1, "user": "loveflatrock", "date": "September 10, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 19960013, "likes": {"liked": "— everthing", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "Contrary to another review which said there were only 2 parking spots and 1 handicap spot, there are now 3 parking spots and 1 handicap spot. Anyway, we parked right in front of our unit which was like coming home! No long walks from parking lot to your front door etc.", "title": "We'll be back", "helpfulness": 4, "user": "imjackhandy", "date": "June 8, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 5.0, "rooms": 4.0}, "id": 16770084, "likes": {"liked": "— Location, location, location", "disliked": "— Leaving"}}, {"rating": 5.0, "title": "Loved the Cabana Beach Club", "text": "I loved the kitchen counter which was large and spacious and doubled as an eating area with stools. The appliances (fridge, stove, microwave, and dishwasher) were clean and adequate. The place was well stocked with dishwasher and laundry detergent as well as dish soap. Also cleaning pads, paper towels, were provided. The kitchen had many pots and pans as well as loads of kitchen utensils.", "helpfulness": 1, "user": "StPauliGirlNebraska", "date": "May 27, 2008", "id": 16445719}, {"rating": 4.0, "stay_parameters": "Stayed January 2008, traveled solo", "text": "This unit has 2 televisions. One in the living room and one in the bedroom. You could technically sleep 4 in this place but I think it would be too crowded. After all the unit is composed of 2 areas. Area 1 is the living room/kitchen/dining and Area 2 is the bedroom. This was perfect for us (2 adults and 1 baby).", "title": "Same Horse Different Color", "helpfulness": 2, "user": "santurce", "date": "February 7, 2008", "detail_rating": {"front_desk": 2.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 13351647, "likes": {"liked": "— Location on Longboat Key and accommodations.", "disliked": "— Location of bedroom and inability to easily access deck area."}}], "location": {"country": "United States", "city": "Longboat Key"}, "stars": 2, "variance": {"poor": 0, "average": 1, "very good": 3, "terrible": 0, "excellent": 8}, "aka": "Resortquest Cabana Beach Club Hotel", "slim_ranking": 0.7, "description": "Cabana Beach Club is a wonderful Florida resort located directly on the beach overlooking the turquoise, placid waters of the Gulf of Mexico. Enjoy warm, sunny days and tropical nights while staying in our one- or two-bedroom condominiums or efficiencies. Every unit features a fully equipped kitchen and patio for the most comfortable, casual stay.Enjoy the relaxed pace of this intimate resort. Discover miles of white sand beaches, unlimited water sports on Longboat Key or simply take a dip in our large, heated swimming pool. No matter what your vacation pleasure, book with confidence using property rating standards. Whatever you choose, you will love the comfortable accommodations and beautiful beach views. The attention to detail, from the cleanliness of your unit to the manicured grounds, will be evident the moment you arrive. The glorious sunrises, the romantic sunsets, the lush tropical flowers abloom everywhere - you will believe you have found paradise in the Cabana Beach Club."}