{"user_rating": 3.5, "review_count": 400, "name": "Cadillac Hotel", "reviews": [{"rating": 4.0, "title": "so unique!", "text": "Walking in to the Cadillac was a trip in itself...", "user": "MEGGERS09", "date": "May 18, 2009", "id": 30202825}, {"rating": 5.0, "title": "Loved this place...", "text": "At first I was taken aback that there was no A.C. in the room..but soon realized you didnt need one with the beach breeze...The rooms were small but quaint and very, very clean!!", "user": "Doc1953", "date": "May 17, 2009", "id": 30164627}, {"rating": 4.0, "title": "A Diamond in the Rough", "text": "The bathrooms were adorable and updated..The whole laid back atmosphere of the hotel was such a refreshing change for me and my boyfriend..I will be back in June and we will be staying there again..There is a little restaurant on the boardwalk next to the hotel called the candlelight..IT IS AMAZING The breakfast is out of this world..The best breakfast I have EVER eaten!!! I love Cali and I love Venice.. :) I want to live there..lol", "user": "kanelson", "date": "April 17, 2009", "id": 28185913}, {"rating": 5.0, "title": "Great value, great location, highly recommended!!", "text": "The staff was absolutely great, responded to guests immediately, answered all my questions... and to top it off, it was only four block's from my adult children's home. Walked to breakfast across the alley every morning at a excellent little bistro on the beach walk, four star Italian restaurant next door, and a convenience store on the opposite corner of the building. I didn't have to start my car for four days... live music at a venue two doors North... on and on, I can't imagine a better, more beautiful location to take in the SoCal beach! I love you guys!", "user": "intheindustry2", "date": "March 23, 2009", "id": 26687972}, {"rating": 1.0, "title": "The Cadillac - Up On Blocks", "text": "We had mixed feelings about staying at the Cadillac based on many reviews here. Having visited Venice Beach before, we were prepared for the characters that hang around the boardwalk. With that in mind, you shouldn't have any problems with them. These people can be very entertaining. At night, because we have a small child, we put him to bed and took in the sights below from the fire escape. My boyfriend often went out to grab some drinks or snacks at night and he felt safe enough. The noise does subside at around 11:00 p.m.", "user": "greypawn", "date": "March 18, 2009", "id": 26363460}, {"rating": 1.0, "stay_parameters": "Stayed September 2008, traveled with family", "text": "We were very impressed with the Cadillac Hotel during our stay.", "title": "Loved the local flavor and ecclectic hotel experience", "user": "VCRRTraingal", "date": "October 10, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 4.0}, "id": 20782633, "likes": {"liked": "— The location (so much was right outside our door)", "disliked": "— The location (so much noise was right outside our door)"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "The room was impeccably clean and the decor is really inviting. The staff was friendly and welcoming when we came and went from the hotel and we thoroughly enjoyed the colorful atmosphere we were able to experience being right down on the boardwalk.", "title": "Dont worry!", "user": "YorksireLassUk", "date": "September 21, 2008", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 20257716}, {"rating": 1.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "My mom is in a wheelchair and we never even took the car out until Monday. There are so many food, attraction and entertainment options around the hotel, you don't need to. That was great!", "title": "incubo", "helpfulness": 1, "user": "ItalyBiba", "date": "August 31, 2008", "detail_rating": {"front_desk": 2.0, "business": 2.0, "service": 3.0, "cleanliness": 4.0, "value": 1.0, "location": 2.0, "rooms": 4.0}, "id": 19588861, "likes": {"liked": "— the room", "disliked": "— the noise"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2008", "text": "We would recommend this hotel to anyone that really wants to experience a little \"beach life\" for a few days.", "title": "Such a Relief!", "helpfulness": 1, "user": "thanktheuniverse", "date": "August 12, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 18896661, "likes": {"liked": "— Price/Location", "disliked": "— The mini fridge cooler could use improvement."}}, {"rating": 2.0, "stay_parameters": "Stayed January 2008, traveled with family", "text": "My husband and i stayed in August for 3 nigths. Although we didn't pay for an ocean view ,the view out of our window was FANTASTIC! We had read all he reviews and were a little apprehensive. BUT there was nothing to worry about and we felt quiet safe , even when coming back after eating out in Santa Monica late at night. Yes ,there are some \"different \" people hanging around ,but this is Venice beach! We had a great time and the rooms were lovely (especial the shower!) Please don't let the bad reviews put you off .We would totally recomend the Cadiilac to anyone wanting to stay at the \"beach\" in L.A.", "title": "Not for your consideration .....", "user": "streaker3", "date": "August 9, 2008", "detail_rating": {"front_desk": 2.0, "service": 2.0, "cleanliness": 1.0, "value": 2.0, "rooms": 2.0, "location": 4.0}, "id": 18789593, "likes": {"liked": "— It was close to our house", "disliked": "— It made us very weary of all the characters in the neighborhood"}}, {"rating": 3.0, "title": "ok here is the down low", "text": "We new some what what to EXPECT, WE DID THE RESEARCH FIRST!!", "user": "hmoney", "date": "June 28, 2009", "id": 33339414}, {"rating": 2.0, "title": "Stuck in the 60's", "text": "This was a perfectly located, cute little, boutique hotel full of character.", "user": "IndianapolisSprky", "date": "June 15, 2009", "id": 32411377}, {"rating": 5.0, "title": "I don't usually write reviews but this was so good....", "text": "For the price we paid it was awesome, via it being through hotwire of course. Its located right on the Venice strip near the end ,a block or so from the start of Santa Monica.", "user": "Rocky077", "date": "June 10, 2009", "id": 32059377}, {"rating": 4.0, "title": "Loved it!!!", "text": "Its in a very popular part of the strip with the locals being that there is a pub & a patio resturant right beside it popular with such...also the transients there frequent that area.", "user": "OzSnoopy", "date": "June 7, 2009", "id": 31818035}, {"rating": 2.0, "title": "Very Expensive and dissapointing", "text": "There was previous reviews stating the noise from the locals & such from below, but we got there on a Saturday & the whole strip seem to shut down right before 12am & the street was quiet. Again, this was on a Saturday...which we found shocking for such a lively beach compared to the entire pacific coast we had travelled.", "user": "burrisaz", "date": "May 25, 2009", "id": 30741500}, {"rating": 4.0, "stay_parameters": "Stayed March 2009, traveled with friends", "text": "Started my 2 weeks california trip with my younger sister in this hotel. Arriving from deep winter back in switzerland it was like hitting the summer (even though everybody told us it's still to cold here and we should have come in summer). I did not expect a high-class hotel at this location at this price but was quite excited when I saw the location and the rooms. The lobby doesn't look too promising and the desk guy was not relly full of joy having us but still very helpful and friendly. It looked like the hotel was just renovated. Everything looked quite new and clean. Nice flat-screen tv on the wall. No working table though. Badroom nice and clean with everything you need. They don't server breakfast but due to it's location directly at the beach, there are enough possiblities nearby. The restaurant just next by was our favourite. Starting the morning with fresh fruits and juces with having a few on the free speach zone is really an expericence. The price is okay due to its location. I would stay again in this hotel. Parking and WiFi costs extra (parking 20$, wifi 3.99$ per hour). Hard to find if you don't have a gps (which we lucily had).", "title": "Perfect Location, neat and clean", "user": "l3my", "date": "March 14, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 26161990}, {"rating": 4.0, "title": "Great Hotel, renovated, perfect spot on Venice Beach", "text": "We stayed there for 4 nights in May 2008 after escaping a too expensive and snobby Beverly Hills \"In-Hotel\" . Although the renovation was still going on, we were able to stay in a beautiful newly renovated room on the top floor with a spectacular ocean view. Also you were able to step up to the roof where we had great views to Santa Monica and LA.", "user": "A TripAdvisor user", "date": "February 17, 2009", "id": 24657339}, {"rating": 1.0, "stay_parameters": "Stayed January 2009, traveled as a couple", "text": "We also loved the surroundings which was by our feeling not at all dangerous, but very colorful and interesting. It is close to bars, good restaurants and caffees. Maybe it is not the right hotel for familys, but if you want to have a good time and dive into the spirit of Venice Beache, go for it. We (my girlfriend and me) loved it and will definetly return.", "title": "Nightmare! Never Again! Beware!!!!!!!!", "helpfulness": 2, "user": "BrazilanCouple", "date": "January 29, 2009", "detail_rating": {"cleanliness": 1.0, "front_desk": 1.0, "location": 1.0, "value": 1.0, "rooms": 2.0}, "id": 24008558, "likes": {"liked": "— Nothing", "disliked": "— Everything"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2009, traveled as a couple", "text": "I am from Brazil, so forgive all spelling mistakes....", "title": "Had a great time at the Caddy!", "user": "rweekend", "date": "January 20, 2009", "detail_rating": {"front_desk": 3.0, "business": 3.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 23741173, "likes": {"liked": "— Its location right on the beach and the famous Venice Beack boardwalk with great vendors", "disliked": "— Tight Parking"}}, {"rating": 3.0, "stay_parameters": "Stayed July 2008, traveled with friends", "text": "Me and my wife went to California to visit San Francisco, Los Angeles, Las Vegas and other small towns. After staying in a lot of motels, we searched for a nice place. Our Guide Book didn´t give us much options but recomended Cadillac because of its location. Whe got to Cadillac very late, after a long car trip. So, we just wanted to stay somewhere safe with a nice bed.", "title": "Nowhere near as ad as lots of the reviews", "user": "mambo202", "date": "October 15, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 20892693, "likes": {"liked": "— location, views, rooms, services", "disliked": "— can be a little scary at night but felt safe and secure"}}], "location": {}, "stars": 2.5, "variance": {"poor": 39, "average": 64, "very good": 119, "terrible": 67, "excellent": 111}, "aka": "Cadillac Hotel Los Angeles", "slim_ranking": 0.375, "detail_rating": {"service": 3.5, "cleanliness": 3.5, "value": 3.5, "sleep": 3.5, "rooms": 3.5, "location": 4.0}}