{"user_rating": 4.0, "review_count": 29, "name": "Cambrai Backpackers Hostel", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled solo", "text": "The Cambrai hasn't been reviewed here in a few years, but it's still great! I stayed for a few days in December and the owners Ron and Marg are so helpful and welcoming. If you're on a working holiday, they'll help you find work in the farms or onsite. The hostel is in the centre of town with Woolworths just a quick walk away. Rooms are clean and comfy, my only complaint would be the room had no window, so no fresh air- there is a fan and a vent though. Otherwise everything was wonderful and I really enjoyed my time there.", "title": "Great little place", "helpfulness": 1, "user": "lovebeachtravel", "date": "January 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 122856869}, {"rating": 4.0, "stay_parameters": "Stayed November 2007", "text": "I was highly impressed and Marg was both knowledgeable and helpful regarding local amenities. I travel a lot but have never stayed in a back-packers establishment - I would definitely go back if I get the opportunity. I travelled alone but with my S.O. I know we'd still have a fabulous time. Thanks Marg! :)", "title": "Fab", "helpfulness": 1, "user": "neil_hove", "date": "October 27, 2008", "detail_rating": {"value": 5.0}, "id": 21320376}, {"rating": 4.0, "title": "Cambrai Backpackers the best!", "text": "I highly recommend Cambrai backpackers,Maffra. Ron and Marg are friendly and very helpful and the place seems more like home than a hostel! A definate must for backpackers in the area!", "helpfulness": 2, "user": "A TripAdvisor user", "date": "January 30, 2006", "id": 4396619}, {"rating": 5.0, "title": "Cambrai, Maffra was great", "text": "Cambrai is such a chill-out hostel. So is Maffra as a town. An 'off the beaten track' place that you can experience some real local country hospitality. The hostel is friendly, clean, laid back and Marg, Ron and Tom are great hosts. My family and I will certainly go back. There is much to see around the local area with both the sea and the mountains close. We stay in many hostels around Australia, and this one is high on our list.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "January 14, 2006", "id": 4351726}, {"rating": 5.0, "stay_parameters": "Stayed January 2006", "text": "This place is one out of the box. The hostel is situated in the main street of Maffra which is connected to Sale by daily V/Line coaches. Many international backpackers use this hostel for seasonal harvest work to gain an extra 12 months on their holiday working visa. The 90 mile beach is not to far and much bush walking into the Alpine National Park is aviseable with spectacular scenery, Australian wildlife and Aborigional spiritual past. Great hosts Ron, Marg & Tom", "title": "Backpackers Delight", "helpfulness": 4, "user": "petermac", "date": "January 7, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4331405}], "location": {"country": "Australia", "continent": "South Pacific"}, "variance": {"poor": 1, "average": 0, "very good": 4, "terrible": 4, "excellent": 20}, "aka": "Cambrai Backpackers Hostel Maffra, Victoria, Australia", "slim_ranking": 1.0, "description": "Historic Cambrai in the dead centre of the main street of Maffra has been renovated into this homely hostel as a base for visitors to explore the Gippsland region of south eastern Australia. Dormatory rooms of six and eight bunks, family rooms with double bed and bunk, communal kitchen and great TV/games space with open fire for those cool winter evenings. Fully licenced bar to cater for all tastes."}