{"user_rating": 4.5, "review_count": 621, "name": "Cambridge Suites - Halifax", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled on business", "text": "After a couple of weeks in historic B&B's the facade of this hotel seemed charmless. Once inside we found a nicely appointed modern hotel.", "title": "Clean, comfortable, modern professional hotel", "user": "StHyde", "date": "August 8, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 37097276}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "With the Canadian Forces Rock Fest in full swing at the Citadel we were concerned about noise. The desk staff assured us that it would not be a problem and informed us that there were several harbourside rooms available if we found the noise objectionable. The room well isolated from the noise on the street. Curious to see the activity we wandered up to the roof deck which provided a great view.", "title": "A very nice place to stay in Halifax", "user": "smallface1", "date": "August 7, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 36978915}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled solo", "text": "The room itself was a spacious, well appointed modern hotel room with a very functional kitchenette. We found the staff courteous and able to accommodate our needs. The location was great for exploring the downtown area.", "title": "Exceptional Value, old world hospitality, new world accomidations", "helpfulness": 2, "user": "screamingfish02", "date": "July 23, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 35568695}, {"rating": 3.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "We had planned to have breakfast out and passed on the complimentary continental breakfast, but it looked good enough to make us pause on our way out.", "title": "It was just OK", "user": "I_Luv_To_Travel_Too", "date": "July 21, 2009", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 4.0, "service": 3.0, "rooms": 3.0}, "id": 35384966}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "This is a gem of ahotel in a great location for seeing Halifax. The large suite room are comfortable and well priced and the staff are very accomodating. Breakfasts are included and are excellent", "title": "What a clean place in a fantastic location with great service", "user": "PoliticoJ", "date": "July 15, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 34883254}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "Comfortable beds, great location, spacious rooms, & a rooftop terrance. All of these things made our stay a good one. There were multiple choices for breakfast. Having access to computers & a printer were much appreciated and used.", "title": "Great Stay", "user": "kftw", "date": "October 11, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 46561388}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "Our family, 2 adults and 2 teen boys, had 2 adjoining suites and this hotel worked perfectly for us. Breakfast was included and was right downstairs, and the hotel was centrally located near the Citadel, shopping and the waterfront. The rooms were clean, comfortable with flat screen tv's, and had a good view of the Citadel. The parking was expensive, but very convenient right under the hotel. We would use this hotel again.", "title": "Halifax for 2 nights", "helpfulness": 1, "user": "BenMarkey", "date": "October 8, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 46257253}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "This hotel was modern, clean and had friendly staff. The free wifi in the room was much appreciated. You could walk to all the attractions, provided you don't mind walking up a long hill to get back from the harbor area. There are good restaurants just a 5-10 minute walk away. The breakfasts left a little to be desired - awful, industrial made pastries, but at least there were hard-boiled eggs, apples, and toast available. Hotel parking is expensive, but city parking (meters just steps from the hotel) is free on weekends.", "title": "convenient, clean with free wifi", "user": "viaggatrice", "date": "October 8, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 46217149}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "Found this hotel on the internet. Check-in was easy, parking was easy getting around town was easy. Everyone on the staff was friendly from the front desk staff to the manager. The restaurant was a pleasant surprise, meals were relatively inexpensive as were drinks. We tried to stop in at the bar each night we were there because we actually felt the staff became friends. I hope to return to Halifax someday because it is a wonderful city to visit.", "title": "Friendly, caring staff cater to you every desire.", "user": "rx1234", "date": "September 26, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 44784130}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled with friends", "text": "I recently stayed in the Halifax Cambridge Suites. What a wonderful experience! The rooms were great as well as accommodating. The management had clearly thought of the travelers' needs. The staff was even better. They volunteered to call a cab for our airport return and saved us money as opposed to taking the airporter shuttle. On Wednesdays there is a manager's reception (free) in the lobby with wine and beer, hot and cold appetizers. The connecting restaurant had a great prime rib beef dinner special which was excellent. There is also a continental breakfast there. The Suites are close to the Public Gardens, Spring Garden Street of shops and the Citadel. Also, the FRED (Free Ride Everyday Downtown) bus stop is on the corner. Computers were available so we were able to do our airline check in and print our boarding passes. I would highly recommend the Cambridge Suites to any traveler! There was underground parking available also but I did not have a car so I am not familiar with pricing for that, if any.", "title": "Halifax Cambrige Suites is Outstanding with thoughtful and generous staff.", "user": "JudyRochester_NY", "date": "September 25, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 44450369}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "We booked a single night at the Cambridge Suites toward the end of a wonderful vacation in Nova Scotia. Selecting it on the basis of tripadvisor reviews, I was delighted to find it to be exactly as described in the reviews. Our room looked out toward the Citadel, a fact that delighted my husband. Yet we were only four blocks from the harbor (an easy downhill walk, but somewhat tough coming up the hill on return).", "title": "Perfect place to stay in Halifax", "user": "Joyful1", "date": "September 25, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 44425026}, {"rating": 5.0, "title": "Lovely, friendly hotel, ideal location", "text": "The room was spacious, clean, and customer service at this hotel is superb. EVERY employee greets you with a smile and \"we're glad you are here\" attitude. Guest services also provided directions, maps, and recommendations for maximizing our short stay. Breakfast was simple, yet more than adequate.", "user": "bluebell078", "date": "September 24, 2009", "id": 44197105}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "Two attractions are \"\"must see in Halifax. We spent several hours at the Citadel, and many more at the Maritime Museum of the Atlantic. With a late checkout of 1 PM offered to all, it was easy to leave our car in the garage and walk to both places. The tall ship sailing vessels in the harbour offer interesting cruises, but since you are motoring the entire way and the trip isn't narrated, it would be down the list to do again.", "title": "great value", "user": "sugarmags", "date": "September 6, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 39954059}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "Walking along the boardwalk is scenic and interesting.", "title": "Great Hotel", "helpfulness": 1, "user": "hewitt", "date": "August 30, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 39263507}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "Finally, I highly recommend a visit to the graves of the Titantic victims. It is extremely moving, and since we have toured both the museum in Queenstown, Ireland (now Cobh) and in Halifax, it was like coming full circle for us.", "title": "Fantastic hotel", "user": "KittyCat_10005", "date": "August 25, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 38736204}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "This was the first time we had stayed at a Cambridge Suites. The website shows pictures of beautiful rooms. However, experiences told me not to get excited yet until I saw it for myself. I was pretty surprised to see the room as clean and good looking as on the website. The beds are comfortable too.", "title": "Clean room, Comfortable beds, Friendly staff.", "user": "starry4", "date": "August 23, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 38496081}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "It is centrally located and is within walking distance to most places in Downtown Halifax, like Citadel Historic site, the Province House, the waterfront and Pier 21 etc.", "title": "Great Place to Stay", "user": "bigfatoldguy", "date": "August 19, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 38172038}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "I’ve used their gym twice during my 2-day stay at the hotel. It has all the basic equipment and is good enough for my workout purposes. In fact, it is better equipped than some other bigger chained hotel, like Delta.", "title": "A Wonderful Find", "user": "Joe K", "date": "August 12, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 37503888}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "There are complimentary breakfasts between 6am to 10:30am. It’s a busy place at all times, but the staff always wears a smile on their faces and keeps refilling the food relentlessly.", "title": "Great & Convenient Spot In Halifax", "user": "D-R-Maryland", "date": "August 11, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 5.0}, "id": 37418378}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "Everything is excellent except for the room doors that have some acoustic issue. We could hear other room doors opening and closing very loudly even with our door closed. We could also hear people walking and talking in the hall way, even though they didn’t speak too loudly. Luckily, the earliest time we were awoken by a door was at around 6:30am, which is about the time we should get up anyway. We told a lady staff at check-out about this and she accepted it gracefully. I think I am not the only one who has mentioned this problem to them.", "title": "Great location; adequate rooms", "user": "Carissa", "date": "August 9, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 3.0, "rooms": 4.0}, "id": 37181255}], "location": {"country": "Canada"}, "stars": 3, "variance": {"poor": 13, "average": 28, "very good": 185, "terrible": 13, "excellent": 382}, "aka": "Cambridge Suites - Halifax Hotel Halifax", "slim_ranking": 0.192307692308, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "Cambridge Suites Hotel is located in Downtown Halifax across from Citadel Hill. The rooftop patio offers a beautiful panorama of the city and you're within walking distance of many downtown attractions. Guest rooms feature comfortable beds in spacious living areas and kitchenettes to make you feel at home. Complimentary Continental breakfast helps start your day while our sauna, spa tub & fitness area lets you wind down."}