{"user_rating": 3.5, "review_count": 696, "name": "Cambridge City Hotel", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "Spent one night here. Friendly greeting on arrival and check in was swift and clear. Room looks like a standard box of a hotel room circa 1993. Beige and cream, box TV, dim lighting, zero character. Bed was comfortable, bathroom fine (more beige). I like sleeping with air circulating in my bedroom and you cannot open any window in any bedroom in this hotel, apparently due to the heating/airconditioning system. Feels like 1993 with no concessions to eco-friendly here, and I disliked having a window bolted shut intensely! The aircon/heating is fine, but is it really necessary 24/7 all year round? We were warned that if you turn it off the room gets very stuffy. Having said that, street outside got noisy on a Saturday night so may have some advantages.", "title": "great location but dated", "user": "Mrs C", "date": "March 10, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 2.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 154176167}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "We got a deal at £125 for a double, but even so I think over priced for a hotel with all the soul of a Travel Lodge. Location however IS brilliant, right in the heart of Cambridge.", "title": "Excellent Staff, Brillant location", "helpfulness": 1, "user": "EmilyB2013", "date": "March 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 153634213}, {"rating": 1.0, "stay_parameters": "Stayed March 2013", "text": "I stayed at this hotel while visiting Cambridge for my graduation. I was travelling with my husband and children. Jane Jones in reservations began what was all in all a fantastic experience. We were greeted by Ruby and Ance on reception who checked us in early as there was a room available -this made a huge difference as our young children could take a rest after an early flight. They both then helped me find a suitable local hairdressor as well as help get a parcel posted. I just found no request \"was an issue\". At breakfast we were greeted so warmly by Fiona Simms who seems to be able to manage large groups with the slightest of ease and make everyone feel welcome and their various needs met immediately. On several occasions she rearranged tables to accomodate our friends joining us for breakast. Again no request was an issue. The room was cleaned daily and was lovely to come back to a freshly made up room. The location is superb-right beside John Lewis and the main shopping area, 2 mins walk to Jamie Oliver's Italien restaurant and within a few minutes walk to several of Cambridge's amazing colleges. Our friends came to stay in the hotel as well and they had an equally positive experience. So yes while its not new, its very clean and the staff go out of their way to be helpful to their guests. It would be No 1. on my list when I'm back in Cambridge again and I have also recommended it to my friends.", "title": "Over priced and poor value for money", "user": "FTG1513", "date": "March 3, 2013", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "location": 5.0, "service": 1.0, "rooms": 1.0}, "id": 153576769}, {"rating": 5.0, "stay_parameters": "Stayed March 2013", "text": "This hotel is significantly overpriced for what you receive. We booked a family room for four. There were only three bath towels, two glasses - why can they not adjust the room according to number of occupants? Lighting in room poor with no bedside light to read by. Shower has peeling paint on ceiling and dirty grout. Cooked breakfast was cold. Restaurant manager at breakfast very attentive but no excuse for cold food. This is not a four star offering and at £170 for a room a rip-off. Location is good but standards have fallen. This is our fifth stay here but never again.", "title": "Another superb breakfast", "user": "willmeyes", "date": "March 3, 2013", "detail_rating": {"cleanliness": 5.0, "location": 5.0}, "id": 153573874}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled on business", "text": "Fiona the friendly hostess and Syed (spelling?) looked after me very well.", "title": "Certainly worth consideration", "user": "Ken M", "date": "March 1, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 153463496}, {"rating": 4.0, "stay_parameters": "Stayed March 2013", "text": "Our third stay in 12months.", "title": "Excellent location, good service but rooms really need the planned refurbishment", "user": "retsehcniw", "date": "March 21, 2013", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 155279891}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled on business", "text": "Service remains good and it is in a great location however we've only stayed here when we've got a good rate!", "title": "Location is key factor here", "user": "Bookman55", "date": "March 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 155274834}, {"rating": 3.0, "stay_parameters": "Stayed February 2013, traveled on business", "text": "Disappointed still no letter in room about planned refurbishment & also no hotel guide.", "title": "Good enough", "user": "IAH88", "date": "March 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 154844295}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "For quiet rooms stay on 4th floor with internal views.", "title": "Pleasantly Suprised", "helpfulness": 1, "user": "vixter2104", "date": "March 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 154783378}, {"rating": 4.0, "stay_parameters": "Stayed March 2013", "text": "My third stay here in less than a year. Comfortable, very central hotel. Rooms are reasonably large, and the housekeeping staff do a very good job albeit on somewhat tired rooms. (Refurbishment commences later this year. ) Staff are very helpful and friendly, although the whole of the dining room staff seem to have changed, and many were still appeared on a learning curve. If you can get breakfast included as part of your package then it is very good value, (normally only seems to be about an extra £5 per person) with a vast selection on display, and anything else available to order. Public areas are very large and are good to relax in. In terms of rooms it is a bit of a trade off whether you would prefer an outside window, which can be noisy in terms of students at night/traffic etc, or an interior room overlooking the atrium, which are surprisingly quiet, but some may find slightly claustrophobic. A few niggles; wired internet or wifi is not free in the rooms (costs £10 for 24 hours). In this day and age I think guests expect to have free access to the internet. It's free in the Irish Pub which is part of the hotel, so not making it available in the rooms seems churlish. Reading lights are not particularly good; I know most people use screens/computers, but if you plan to do any reading then you might want to ask reception to provide a couple of desk lights when making your reservation. And curiously, there is nothing in the room about the hotel or services; obviously you can pick up the phone and ask reception, but a hotel guide is usual and quite useful. Rooms have very good refreshment trays, and are provided with a trouser press and iron/ironing board. Toiletries in the bathroom are generously sized. Car parking is priced at £18 per day but although this sounds a lot it is pretty good for central Cambridge, and you can get your car washed for £5, which is a bit of a bargain! Will certainly stay again, and just hope that the refurbishment doesn't put the room prices up too much!", "title": "Good value hotel - by Cambridge standards!", "user": "TabithaAndMike", "date": "March 16, 2013", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 3.0}, "id": 154771987}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled on business", "text": "Very average hotel. Nothing exceptionally good or bad. Price tag for wifi internet was 10£ per day, but remember you have to pay for each computer separately even if you have paid for another computer. Used room service. OK food not much choices. Rooms have small fridges if you wish to eat something yourself. Double beds are small like most London rooms, but our room had two of these which kind of made up.", "title": "Not memorable", "user": "screenname060309", "date": "March 24, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 3.0, "location": 4.0}, "id": 155542290}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "Have just returned from a break at this hotel , lovely place ideal for all needs staff excellent nothing to much trouble ! Rooms are very nice ,have been told they are being refurbished in a month , restaurant food from breakfast to dinner great , bar area good ! Will be going back in a couple of months , ideal location Janet James Bennett .", "title": "2 day break", "helpfulness": 1, "user": "jimbo023", "date": "March 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 155485735}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled on business", "text": "This is my fourth stay at this hotel and each time I've had excellent service. Staff are friendly and helpful, rooms are comfortable with the beds being some of the most comfortable during my travels. I look forward to staying here when I'm in town for business.", "title": "Great location and service", "user": "Lancec341", "date": "March 22, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 155345724}, {"rating": 3.0, "stay_parameters": "Stayed March 2013", "text": "The location of this hotel is very central but not in a pretty location. The rooms are reasonably large but I found mine rather claustrophobic because the only window overlooks an enclosed space over the hotel reception and was riveted shut, meaning no fresh air was possible. It didn't help that the maid kept turning on the air conditioning at a high temperature each day and leaving it on. There is an old CRT television with a very poor choice of channels. Everything costs extra: wi-fi, parking. Breakfast was OK but expensive at around £15 if not already included in room price. The room was cleaned quite well but I got bitten in the night several times.", "title": "Rather average", "user": "theflyingfish", "date": "March 22, 2013", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 4.0, "service": 4.0, "rooms": 3.0}, "id": 155339561}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled with family", "text": "Stayed here for one night with the family. Staff were very helpful and attended to our needs, such as when we needed a heater in the room looked at. Didn't stay long but overall recommended for both the location and staff.", "title": "Great location & staff", "user": "fulhamsupporter", "date": "March 22, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 155332457}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled with family", "text": "We have stayed here twice - the first time was last October when it was the Crowne Plaza, the second time in February when it had changed hands and become the Cambridge City Hotel. We could see little difference between the two visits. As the title says it is \"great for us\". Our son is studying at Downing College, which makes this hotel perfect for us in terms of location as it's just 5 minutes to walk from the hotel to his room. Another bonus is they have rooms with 2 double beds which means we only need to book 1 room, and our younger son gets a proper bed, not a camp bed. Not all hotels in Cambridge offer this.", "title": "Great for us!", "user": "Kruzgal", "date": "March 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 154768886}, {"rating": 3.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "We have a 'taste card' and this gives 50% discount off meals in the restaurant, even on the weekend, which makes it very good value. We enjoyed our evening meal here and the service provided by Katrina. We thought the food was improved on our more recent visit, the only negative being the menu is quite limited (we also had a lovely evening meal at Bill's Cafe in the city centre on the second evening, which I highly recommend).We did not eat breakfast in the restaurant as at £17 per person we thought it expensive, although I think you can get it cheaper by buying breakfast when you book. There are lots of cafes in the city that serve breakfast or it is a short stroll to the local Sainsburys where they have a wide selection of fresh baked pastries, yogurts, orange juice etc. to have in your room with coffee made using the kettle & coffee provided.", "title": "Basic and comfortable but somewhat overpriced", "user": "nsl115", "date": "March 16, 2013", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 154752683}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled on business", "text": "The hotel has a large bar/lounge area which again is perfect for us. We can sit comfortably, catch up with our son over a few drinks or a pot of tea and no one worries how long we are there. For us it becomes 'home from home' and enables us to chat in a relaxed and comfortable environment - especially like the pianist in the evenings! Yes, the rooms are dated but there is a refurbishment plan in place and in a city such as Cambridge how much time do you spend in your room?", "title": "great staff", "user": "icw", "date": "March 15, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 154702277}, {"rating": 1.0, "stay_parameters": "Stayed March 2013, traveled on business", "text": "When booking it is worth shopping around for the best price. Yes, it is a pain having to pay for parking, but the location, so close to the shops/museums/colleges means we think it is a price worth paying, particularly if you can get a good deal on the room!", "title": "What a rip-off", "user": "Paul L", "date": "March 14, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 1.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 154575358}, {"rating": 3.0, "stay_parameters": "Stayed February 2013, traveled on business", "text": "Our son has another 3 years of studying so no doubt there will be many more visits to the Cambridge City Hotel!", "title": "You're paying for location", "user": "Colette M", "date": "March 12, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 154386798}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "stars": 4, "variance": {"poor": 73, "average": 158, "very good": 286, "terrible": 35, "excellent": 144}, "aka": "Crowne Plaza Cambridge", "slim_ranking": 0.272727272727, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.5, "location": 4.5}, "description": "Cambridge City Hotel enjoys a prime location in the heart of the City Centre. Located within walking distance from Kings College and the many universities with easy access to Cambridge Business Park. Punting or Cycling offers the ideal way to view the city. Travel to Ely or historic market towns such as St Ives or Huntingdon. Newmarket Races hosts some of the racing calendars most prestigious racing programmes. Imperial War Museum at Duxford home of the World War II Museum, Concorde, and other famous planes such as Spitfire and Lancaster bomber. Cambridge City Hotel rooms and Suites are available at your request. High Speed Internet access and WiFi is offered in all bedrooms, meeting rooms and hotel s lounge. The Fitness Room offers Cardiovascular and muscle toning equipment, with a sauna also available. The Conference Centre has four well appointed meeting rooms ideal for business and social events. Altogether Cambridge is the Educated Choice. The Grand Arcade is an exciting new city centre retail development that brings a 21st Century Shopping experience to Cambridge. On-site Car Parking available at a charge of £18.00 per night."}