{"user_rating": 4.0, "review_count": 541, "name": "Cameron Highlands Resort", "reviews": [{"rating": 3.0, "title": "Bring ear plugs", "text": "Hotel is nice and staff are friendly. Food is pretty good in both restaurants. Could do with more options for lunch though. The main issue is the proximity to the main road. It's literally right next to it and there is a large volume of trucks passing. Not for light sleepers", "helpfulness": 1, "user": "2Stuffed", "date": "August 6, 2012", "id": 136355084}, {"rating": 3.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "Stayed for two nights in this resort, good location and climate, Rooms are dim light and not very fancy type.the food served was ok. Many strawberry farms nearby where you can take a walk and try various things made with strawberry. The Hotel Staff were good though.", "title": "Nothing Fancy", "user": "Rittaz", "date": "August 4, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 136197735}, {"rating": 4.0, "title": "Great for a quiet relaxing stop", "text": "Beautiful hotel with impeccable service - downfall is that there is no view from the hotel. Rooms are spacious and tastefully decorated. Hotel is lite up with fairy lights at night which are spectacular. If your looking for somewhere to relax and chill out this is a great place - when you book your room ask them about the free guided tour-as we unfortunately arrived to late to take part in this. Great food and if your driving here make sure you stop off at Cameron valley tea plantation as this is amazing and was a highlight of our trip.", "user": "Kate B", "date": "August 2, 2012", "id": 136034096}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "Great service and same staff were present throughout the 3 day stay, with welcoming smiles and greetings everytime they see us. Made us feel right at home.", "title": "Great service", "user": "hlmh", "date": "July 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 135843719}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "Complimentary high tea was served while waiting for roomto be ready. What delicious scones they had. Must try.", "title": "Will definitely be coming back", "user": "Winston668", "date": "July 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 135834834}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "We definitely made the right decision to stay here whilst in the CH for 2 nights. The room upstairs was lovely but you do hear the traffic noice. Not sure why they didn't have better insulation but overall it wasn't a big problem really. All the staff are very friendly. Did the Jim Thompson trail organised by the hotel- excellent service-excellent walk and tour guide. One of the best things we did whilst in CH, whch we overall found to be a disappointing vacation destination.", "title": "Probably the best place to stay in the CH", "user": "HappySydChampers", "date": "August 14, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 137221452}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "The breakfast is not the usual buffet but you sort of get a chance to pick a few things.It was fine but not exceptional and the staff are friendly.", "title": "Tales, Trails and Traditions", "user": "KevinLeong", "date": "August 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 137095645}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "We also visited the Smokehouse and Lakehouse and although we ate at both we didn't stay in either place. The Smokehouse gets 10/10 for dinner and ambience. The Lakehouse was a bit of a drive down the mountain and has a cosy interior setting and dinner was 9/10.", "title": "Nice hotel", "user": "ruzannaca", "date": "August 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 136865160}, {"rating": 5.0, "stay_parameters": "Stayed August 2012", "text": "Despite not dining at the CHR [except breakfast] we were very glad we stayed at this resort and would not hesitate staying there again if we were to ever return to the highlands.", "title": "Good location and good service", "user": "YEOJE", "date": "August 11, 2012", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 136864034}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "As the title suggests, this resort epitomize and exemplifies every single word of their own motto. I would like to congratulate YTL corporation again for this outstanding resort. Among the other YTL resorts that i've been to, i have to say that this is my personal favourite. I have always believed that great people make great organizations. Kudos to YTL for hiring staff/workers that go the extra mile for their customers. Never was i once not impressed by the information and services that they provided. Food is extremely good as usual. I asked for a quieter room and front desk placed me upstairs. Personally, i think i would enjoy the room upstairs rather than the ones downstairs. Though less view (only of the mountain and half the golf course), it offered alot more privacy and alot less noise. Very peaceful. Afternoon tea is magnificent (especially the chocolate truffle cake) and deco/attention to detail is impeccable. However, i would like to give my biggest thanks to Cameron Highland Resort's resident naturalist mr Madi. We went on the Jim Thompson Trail and we got a lot more than we asked for. Very informative trail. At the same time, it is honest in the sense that you get to occasionally see Mr. Madi's disappointment towards the rapid deforestation of the surrounding grounds. The Jim Thompson trail itself does not exist anymore as a result of deforestation for some strawberry farm, as if cameron highlands did not have enough of those. I would recommend anyone who can afford to stay here to miss out the opportunity to do so. At this place, you will find a lot more than whatever that you are looking for. I have no complaints about this establishment at all (maybe the piano needs a bit of tuning or the lid has to be open when it is sounded). Otherwise, this place is perfect. Will definitely revisit again. Hopefully, sometime in the near future.", "title": "Great spot with wonderful staff", "user": "bsboard", "date": "August 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 136844630}, {"rating": 5.0, "stay_parameters": "Stayed August 2012", "text": "If you cope with the VERY wiggly road up to the resort, then once you get there you are welcomed with open arms. The chief chap, Jim, was great. Very welcoming and helpful.", "title": "Great spa and walks", "user": "caseydee", "date": "September 1, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 139096404}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "The room was beautiful and well kept. As some have commented, there was traffic noise at night but it was not enough to become enraged enough to criticise the hotel!", "title": "\"World class resort and super excellent service\"", "user": "sh d", "date": "August 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 138868356}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "If you go here make sure you go on walk with local guide Madi. He really made our trip as he was informative and passionate about his home.", "title": "Highland weekend getaway", "user": "Mimiahmad", "date": "August 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 138478730}, {"rating": 5.0, "title": "Excellent hospitality with a British flavour", "text": "We spent a lot of money on a couples spa experience. It was wonderful. Very relaxing and worth the money.", "user": "Wan Azlina A", "date": "August 26, 2012", "id": 138375541}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "We also had afternoon tea in the tea room. No need for dinner that night!", "title": "Luxury and lovely location", "user": "Julia F", "date": "August 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 138090459}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "Stayed here for 2 nights with my wife and daughter during the recent national holidays.", "title": "Wonderful!", "user": "KWong_11", "date": "August 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 138078956}, {"rating": 5.0, "stay_parameters": "Stayed August 2012", "text": "Anticipating that there will be terrible traffic condition in Cameron Highlands during this time, we opted to have the Full Board option and it proved to be a wise choice. The Full Board option covers breakfast, lunch, high tea and dinner. Every of the meals are quite splendid. Breakfast is served in the Dining Room in a semi-buffet style and I thought the waffle was great. Meanwhile, lunch is served in the Jim Thompson Room with a good selection of Western and Japanese foods. The scones and pastries during high tea is simply delicious. For dinner, we have it both nights at Gonbei which is a Japanese restaurant. It basically serves a variety of steamboats, shabu-shabu and sukiyaki on a semi-buffet style. While it is a Japanese restaurant, I was also given a option to order western food which they will deliver from the Dining Room to Gonbei. However, maybe due the lengthy transportation time, the raw fish in Gonbei is not really great. Overall, we had a great dining experience and the hotel make it a point to fill your tummies to the fullest on each meals.", "title": "Great hotel", "helpfulness": 1, "user": "mauratur", "date": "August 21, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 137879308}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "As for the room, we got a Junior Suite is which wonderfully decorated in a colonial style with a 4-poster bed. It has 2 rather tight balcony which I can enjoy the view while sipping a cup of tea. As many others had complained, the traffic noise from the main street is the biggest letdown; especially during the early mornings where trucks and 4x4s rev their engine while passing by the hotel. Maybe the hotel should really think of a way to solve this. Another personal feeling of mine is that I felt the cleanliness of the room is could be improved especially on the floors.", "title": "'Top Hole' hotel at the Golf Coarse", "user": "Twitchyjim", "date": "August 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 137693631}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "As a \"resort\", it is more inclined towards providing spa services. I wasn't able to join the jungle trekking and the only other activities are snooker and playroom for kids.", "title": "Personalised service, great hotel", "user": "SpYap", "date": "August 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 137635390}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "Be aware that there is not internet connection in the room (at least I didn't find the point in my room). Free wifi is available in the library and there are computers for free use too. Cellular data connection in this part of the highlands is not good.", "title": "A beautiful hotel (but it smells of fresh paint and can do with better soundproof windows)", "user": "Yau Baby", "date": "August 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 137414512}], "location": {"country": "Malaysia", "continent": "Asia"}, "stars": 5, "variance": {"poor": 19, "average": 80, "very good": 181, "terrible": 14, "excellent": 247}, "aka": "Cameron Highlands Hotel Tanah Rata", "slim_ranking": 0.1, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.0, "rooms": 4.5, "location": 4.0}, "description": "Set amidst tea plantations and rolling hills, this boutique hideaway promises all the splendour, romance and nostalgia of Cameron Highlands’ grand colonial heritage.Tall French doors, timber-beamed ceilings and plantation shutters add colonial charm and a touch of nostalgia to our rooms.Enjoy a refreshing round of golf, a pink-cheeked ramble along jungle trails, or a leisurely walk through tea plantations and strawberry farms. To recover, you can have a cup of tea in the drawing room, or a tea bath at the Spa Village, or you may simply choose to spend the day curled up with a good book by the fireplace.Cameron Highlands Resort is situated on the largest hill retreat in Malaysia, surrounded by breathtaking scenery, lush greenery, rolling hills and Tudor-styled cottages. The luxurious boutique Resort features 56 beautifully-appointed rooms and suites, and fronts Cameron Highlands' 18-hole golf course. It also houses the third wellness centre of the award-winning Spa Village group, which offers exotic treatments focusing on the healing and restorative properties of tea. Located in the state of Pahang, approximately 200 kilometres north of Kuala Lumpur, Cameron Highlands is a beautiful holiday destination and the only place where you can find tea plantations and strawberries in Malaysia. At about 1,500 metres above sea level, it is the highest area on the mainland and enjoys a cool climate and fresh air, with temperatures ranging between 15° and 25° Celsius. Much of the character of the highlands remains unchanged since colonial times. It is endearingly known to some as the 'little corner of England in Asia'. The cool climate on the picturesque plateau and its surrounding hills and forest make this a popular retreat for golfing, jungle trekking and exploration of the many plantations and gardens. Cameron Highlands Resort is ideal all year round for families, honeymooners and holidaymakers out to satiate their appetites for trails, tales and tradition."}