{"user_rating": 4.5, "review_count": 113, "name": "Camperio House Suites & Apartments", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "The hotel is located on a quiet street just around the corner from via Dante. The Castello, Duomo, La Scala and many other sights and restaurants are within a 5 to 15 minute walk. The train station is about 15mins by cab and there is a metro stop right around the corner.", "title": "A-1 location and service", "user": "Magnum55", "date": "May 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 129612170}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "The hotel is very quiet and I didn't see or hear any other guests except at breakfast (which was very good). My wife and I were expecting a package and the front desk made sure it was waiting for us in our room when we returned from sightseeing.", "title": "Terrific Location in Central Milan", "user": "Duomo3", "date": "April 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 129070687}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled with friends", "text": "We only stayed two nights but we were very pleased with this hotel. I booked the best available rate on the hotel website and found our room to be a little small (but fine for a couple of days). The bathroom however was very large and the shower was very good. Overall the room and the hotel were very clean and the staff were very helpful.", "title": "Great location and rooms. Don't take restaurant recommendations from them.", "helpfulness": 1, "user": "Airbound13", "date": "April 28, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 128989876}, {"rating": 3.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "I would definitely stay here again.", "title": "Very nice apartment, BUT...stay alert!", "helpfulness": 3, "user": "evansbrown", "date": "April 22, 2012", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 128329523}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "We spent three nays and nights at this non traditional hotel and were completely satisfied. Quiet, extremely clean, and close to Via Dante, The House Suites were the perfect choice for our group of three. Our room had a kitchenette with a fridge, a sleeper sofa, and a separate suite for privacy. The service at the hotel was spot on, with a very satisfying continental breakfast with coffee service and plenty of choices, served in a lovely dining room. The discrete location was so cool, entering through a private entrance which opens into the courtyard of the suites and private residences. We were close to Sforza Castle, Il Duomo, Santa Maria delle Grazie and all of the stores. This location is great in that you can drop off bags between stops, or just return to your room to rest those feet sore from all of those little paving stones that you will no doubt enjoy!", "title": "spacious chic room, well located", "helpfulness": 1, "user": "garjlb", "date": "April 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 128201619}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "We booked a three-night stay here in June through Tablet.com and were not disappointed. Our suite was nicely decorated with a kitchenette, bedroom and sitting room that provided a comfortable separate sleeping area for our teenage daughter. The hotel is on a quiet street, but just a short block away from the metro station and within easy walking distance of the Duomo and other central city attractions. The staff was very accommodating and helpful. The breakfast buffet was top quality with a good selection of pastries, cereals, yoghurt, etc. and a couple of hot items, plus made-to-order cappucinos and espressos. We will definitely stay again when we return to Milan.", "title": "Great accommodation", "user": "cmelsten", "date": "August 4, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 136187878}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "Our family of 4 have just returned to Australia from a terrific holiday in Italy. We started and finished our holiday in Milan. Camperio House was one of very few hotels that could take our family in 1 room. We stayed in 2 different delux suites and loved them both. They are very spacious rooms. Facilties were excellent - breakfast was one of the best we experienced on our holiday, we were able to use their washing machine and dryer and all with extremely friendly and professional service. Location was ideal. We look forward to returning again some day.", "title": "Wonderful Stay", "helpfulness": 1, "user": "Chuckles0310", "date": "July 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 135112377}, {"rating": 2.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "Anyone familiar with travel in Europe learns that A/C is only A/C if the owners of the building turn it on. Unfortunately the management of Camperio seem to hope that their guests won't know the difference between 'fan' and 'cool' functions of an A/C unit. Our 'romantic' getaway was unpleasant because the nicely decorated room was stiflingly hot, and opening the window for 5 minutes resulted in us having to hunt down 16 (count 'em!) mosquitoes that were breeding in their window boxes. The hot room ensured that we sweated more than slept there. The Camperio staff had been very nice until we mentioned the issue with the A/C (or lack thereof). Our hopes for finding a solution were first met with denial that there was a problem, then different stories of why it didn't work, and finally complete dismissal. \"Why are you bothering me?\" and \"You shouldn't be bothered by the mosquitoes\" were actual responses we received. They did offer us a useless insect repellant plug-in (and called it a mosquito-machine). Some solution. For almost 200E p/n one expects better service. That said: Camperio is in a nice location, and it is decorated nicely. If they would use a little of their decorating budget to run their A/C they may have had a return customer.", "title": "Nice Show, No A/C, Little Service", "helpfulness": 3, "user": "Bad2Roam", "date": "June 28, 2012", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 1.0, "sleep": 1.0, "rooms": 3.0, "location": 4.0}, "id": 132991237}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "The Hotel was very well situated: 5 min walk from the duomo and right by the Via Dante (also a nice shopping street). Also, it was in a nice part of Milan called Brera, where you can find really nice cafés and restaurants. It's a very lively place and tipically italian.", "title": "Fantastic Location!", "helpfulness": 1, "user": "Odalix", "date": "May 22, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 130389713}, {"rating": 2.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "The Service was also good: the staff was very friendly and the room was pretty big, and very clean. The only thing is that there was some kind of problem with the air-conditioning. It made a really strange and lound sound when we turned it on.", "title": "Where are these spacious rooms??", "helpfulness": 1, "user": "Joanpvb", "date": "May 21, 2012", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 2.0, "sleep": 2.0, "rooms": 2.0, "location": 4.0}, "id": 130323177}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled on business", "text": "i visit milan many times for business and camperio is my hotel. from the moment that i have by mistake found it in a good price in e booking i try to always book in camperio when i visit milan. it is a walking distance from the center therefore i alsways walk no need to take a taxi. the rooms are very good, they are cosy like i am in my own home, they are clean, the service is very good and the breakfast has amazing croisants.", "title": "i just like it", "user": "Dimitra K", "date": "September 30, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 141619083}, {"rating": 5.0, "title": "Great choice", "text": "i defenetly recoment to anyone who visits milan either for business or plesure.", "user": "OBX_Fan_10", "date": "September 29, 2012", "id": 141618499}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "We started our Italy vacation at this hotel and were very pleased. The room was clean, nice linens and a good size bathroom. The girl at the front desk was extremely helpful with directions, restaurant recommendation and reservation and the train schedule. The free breakfast was amazing in a nice spacious dining area. The location was perfect, close to everything plus free Internet in the room. I would highly recommend this hotel.", "title": "Great home base for Milan", "helpfulness": 1, "user": "caryn1958", "date": "September 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 140665670}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "We ended a 2 week trip through Italy here and it could not have been a better choice.", "title": "Our home in Milan", "helpfulness": 1, "user": "hamutukness", "date": "August 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 137496709}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "Spacious and centrally located with a very helpful staff. We were able to spread out , unpack (repack) and cool down with A/C. Lovely bathroom and comfy bed and linens. We cold walk anywhere from here after a good breakfast in the downstairs dining room.", "title": "Good accomodation in central Milan", "user": "anders b", "date": "August 9, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 136704828}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "Two couples were recently in Milan for one night before flying back to the US following a 2 week vacation in France and Italy. We arrived on the train and took an inexpensive cab ride to the hotel. We arrived early but Stephano directed us to a place for lunch and kept our bags. When we returned he had upgraded us to nicer rooms and got us situated. The hotel is lovely and the rooms are very nice. The bathrooms are spacious as well. The location is very central. Stephano made dinner suggestions and booked us a car to Malpensa airport for early the next morning.", "title": "Nice hotel BUT", "helpfulness": 3, "user": "swatts1", "date": "October 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 2.0, "rooms": 4.0, "location": 5.0}, "id": 143563432}, {"rating": 3.0, "stay_parameters": "Stayed September 2012, traveled on business", "text": "We had a half day tour with a local company that happened to be right up the street from the hotel. The rooms were stuffy so we turned on the AC so that the room would cool down when we returned from our tour. In fact, Stephano even went with our friend to his room as the AC didn't seem to be working and reset the tripped fuse. After our tour and dinner we returned to the hotel to find that our rooms had not cooled off at all. We were told by the young woman at the desk that the AC had been turned off on Oct. 18 in the entire building and that there was nothing they could do about it. We ended up opening windows and the room cooled off around 2am. When we got up at 5:30am for our flight we were covered in mosquito bites. I chose this hotel based on the reviews from Trip Advisor and because their own website claimed that each room has AC and individual controls. Additionally the website says the rooms have wifi and we were never able to access the wifi.", "title": "Brochure does not match", "user": "henricus p", "date": "October 22, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 2.0, "sleep": 2.0, "rooms": 4.0, "location": 5.0}, "id": 143447846}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "This hotel is lovely. I can not give it a 5 star rating because of the AC issue. It should be noted that the AC is only available from May to October.", "title": "Spacious room, excellent position", "helpfulness": 1, "user": "JEJ54", "date": "October 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 142521665}, {"rating": 5.0, "title": "Best of both worlds - modern apartment and charming hotel", "text": "Everything was oké but to the minimum , we expected some form of kitchen , there was only", "user": "woland", "date": "October 8, 2012", "id": 142321813}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "coffee machine. Also no extra room for dinning. This was a other part of the hotel.", "title": "A great place to stay in central Milan", "helpfulness": 1, "user": "Adrian1958", "date": "September 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 141676846}], "location": {"country": "Italy", "region": "Lombardy", "continent": "Europe", "city": "Milan"}, "stars": 4, "variance": {"poor": 4, "average": 4, "very good": 32, "terrible": 3, "excellent": 70}, "aka": "Camperio House Suites & Apartments Hotel Milan", "slim_ranking": 0.0781609195402}