{"user_rating": 5.0, "review_count": 115, "name": "Camp Junction House & Apartments", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "I agree with the other reviews, this B&B is wonderful, certainly one of the best we stayed at on our 20 day journey around Ireland and U.K. John also greeted us on arrival as if we were long lost friends and made us a cuppa. We were even invited to join his family for his father's birthday celebrations at one of the pubs across the road. Had a great time enjoying the friendly atmosphere and the traditional irish music, was great fun and a memorable experience for us. The rooms are large and we had a beautiful view of the bay and surrounding countryside. Also enjoyed the spectacular views from the large bay windows in the dining room while eating a freshly cooked big breakfast. Would highly recommend a stay at Camp Junction, very relaxing, spectacular views and nice walking along the beach in front.", "title": "Excellent B&B", "helpfulness": 1, "user": "AussiesOS", "date": "June 25, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7989927, "likes": {"liked": "— New, clean and spectacular views", "disliked": "— all good"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "We stayed with John Doyle at Camp Junction House on18 May. What an experience! John greeted us at the door of his very new guesthouse as long-lost friends and we soon got to know a lot about him over a cup of tea beside the fire in the spacious lounge/dining room .", "title": "One of the best!", "helpfulness": 1, "user": "GodwitDownunder", "date": "May 24, 2007", "detail_rating": {"cleanliness": 5.0, "front_desk": 5.0, "location": 5.0, "value": 5.0, "rooms": 5.0}, "id": 7684990, "likes": {"liked": "— Cleanliness, hospitality , friendliness"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "John is a most friendly and hospitable person and it didn't take him long to invite us to join a group that was going on a 2 hour walk in a nearby forest that evening as part of a three day \"walking festival'.", "title": "Brand New Facility, Incredible Views", "helpfulness": 2, "user": "alcibiades12000", "date": "April 17, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 2.0, "location": 5.0}, "id": 7379307, "likes": {"liked": "— The views", "disliked": "— Noise in hallways"}}, {"rating": 5.0, "title": "Outstanding! Accessible to Airport and many sites", "text": "Camp Junction House is not yet 12 months old.", "helpfulness": 1, "user": "jpmac", "date": "November 27, 2006", "id": 6180803}, {"rating": 5.0, "stay_parameters": "Stayed September 2006", "text": "It is purpose-built with all rooms at ground level- a very nice change from lumping one's bags up the usual two or three flights of stairs. The rooms are a good size with excellent en suite bathrooms.", "title": "Spectacular Views", "helpfulness": 1, "user": "Tiddle", "date": "October 5, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 5911247}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "John Doyle has what it takes to be successful! He was charming and welcomed us to his house with great interest and pleasure. The 4 of us stayed in 2 rooms. At the time we were one of the few there as a wedding party was preparing to come in. His advice was dead-on and service outstanding. Great location. Easy to find and use as a base. We walked on the beach across the street from the inn and enjoyed perfect hospitiality. The house is brand new and extremely clean. We will visit again!", "title": "loved it!", "user": "four-from-nc", "date": "August 17, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8442951, "likes": {"liked": "— John Doyle", "disliked": "— no pictures on the walls(which means not much)"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "Camp Junction House B&B is the perfect stay to be traveling around the peninsula. New hotel, big and clean rooms, beautiful bathrooms with huge shawers and nice breakfast overlooking the bay. If I had to give a but I would say that you don't have many nice places to eat around. You do have a couple of pubs to have a drink but you will need to drive if you want a nice meal. When you book ask for a bay view room, it makes a diference.", "title": "New, clean and excellent views", "user": "LPM", "date": "August 6, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 8362279, "likes": {"liked": "— the views", "disliked": "— no nice restaurants around"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "This is a beautiful home with an unbelievable view. John Doyle is an excellent host and greeted us with open arms and a cup of tea. Our luggage was missing from the airport when we first arrived and it finally made it's way 4 days into our trip to Camp. John had accepted our luggage and had it waiting in our room when we arrived (thank goodness). There is a little pub right across the street for a pint and traditional irish music in the evening. The next time we are able to visit Ireland we will definitely plan on staying at Camp Junction House for a couple of days and really get to check out the rest of the beautiful Dingle Peninsula. This was our favorite location of the trip and I highly recommend it to anyone planning a visit.", "title": "Favorite stay of our trip", "user": "E-Foot", "date": "July 10, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 8091509, "likes": {"liked": "— Beautiful home, location and great host", "disliked": "— N/A"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled with friends", "text": "After a long day driving we saw a sign for Camp, thought this looks like a great photo opportunity. Then we saw a sign for the \"Camp Junction B&B\". After finding rooms available, John welcomed us in like an old friend. After seeing the rooms and views we were hooked, with John being the best host that we have ever had.", "title": "The B&B with the lot!", "user": "CamandNat", "date": "June 30, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8030976, "likes": {"liked": "— The Host", "disliked": "— No Muesli with breakfast (But Full Irish made up for it)"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled with friends", "text": "Using his local knowledge he showed us the best places to go, arranged a late dinner when we arrived at a local restaurant and horse riding just up the road along the beach near the Dingle Peninsula. This is the sort of bloke he is.", "title": "The B&B and the host are the best in Ireland!", "user": "AaronAndEmma", "date": "June 27, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8015481, "likes": {"liked": "— The host", "disliked": "— Nothing"}}, {"rating": 5.0, "title": "camp junction house,Camp", "text": "We stayed here for a long weekend as we were going to a wedding. The b&b is absolutley lovely, it is newly built so all ooms are ensuite and are really lovely. The showers are hugh and breakfast is served at what ever time you like. John and co makes you realy feel at home.", "helpfulness": 1, "user": "claire1653", "date": "August 12, 2006", "id": 5603705}], "location": {"country": "Ireland", "continent": "Europe"}, "stars": 3, "variance": {"poor": 1, "average": 1, "very good": 12, "terrible": 0, "excellent": 101}, "slim_ranking": 0.2, "description": "Newly-built luxury bed and breakfast, with two additional apartments. Spacious luxury home where you will be guaranteed warm Irish hospitality. Breathtaking panoramic views of the ocean and only five minutes walk to miles of beautiful, sandy beach."}