{"user_rating": 3.5, "review_count": 243, "name": "Campanile Paris X Gare du Nord", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed February 2012, traveled solo", "text": "Stayed for two nights in February as I had travelled to France for a concert at Paris Olympia. The last time I was in Paris was a couple of years ago with my wife and we stayed at the Keppler (which is a Tripadviser top hotel) but this time I was on my own on a \"jolly\" to see an aging French rock star so cut my cloth accordingly. The Louis Blanc area is not brilliant but the hotel is right opposite the Metro station on line 7. It is therefore really easy to get in and out of the centre of the city and to access main line stations. The hotel seemed fairly clean and the bed was reasonably comfortable. The bathroom was small. The George V it is not, but if you want somewhere simply to sleep that is not expensive (about £65 per night), easy to get to and from and don't mind being in a more run down area of town then this hotel is not bad at all. I booked and paid months in advance through Expedia but when I went to check-out in the early morning the hotel claimed they had not received any payment. My rusty French and the need to catch a plane meant I had to pay and try to sort it out later. I contacted Expedia immediately upon my return (yesterday) and it looks like they have sorted things out and that the hotel will give me a refund, so full marks to them.", "title": "Good value if you don't get charged twice", "helpfulness": 3, "user": "BigMac58", "date": "February 17, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 5.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 124710210}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "I'd visited Campanile Gare Du Nord in September 2010 and I have to say that it's the best hotel I've ever been to, in Paris (I've been to around 4-5). The rooms are spacious enough (considering that rooms in Paris are usually holes!), the bathroom was a recently renovated one. It had coffee making facilities, cleaning service daily. Also, the location is excellent.", "title": "Very good choice for Paris", "user": "shialagnes", "date": "January 15, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 123124095}, {"rating": 3.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "Just for a nite before trip back to London on Eurostar. Closer to Gare de L'Est rather than Gare du Nord but not too bad. Just make sure you allocate 20 minutes slow walk and it should be fine. English speaking receptionist advised to take bus but I have quite some luggages and did not mind walking.", "title": "Okay for a night", "user": "jazzmate", "date": "January 5, 2012", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 122554235}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled on business", "text": "Hotel a bit tired and not so clean to my liking. Was in family room and given pullover bed. Okay for just a night.", "title": "Good value... if you get the room on special deal", "user": "JapaneseFrog", "date": "December 12, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 121651931}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "We stayed only one night for business reason and wanted something close to Gare du Nord for convenience.", "title": "Best rapport quality-price!!!", "helpfulness": 1, "user": "ceko1982", "date": "November 11, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 120453291}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "My mum and I had a nice stay here. The room was clean and comfortable, and the lift was a respectable size, unlike some. The staff were invariably friendly and seemed to speak English well - we are practising our reasonably good French so tried not to use English except in emergencies.", "title": "Comfortable stay", "helpfulness": 4, "user": "cycloneviv", "date": "May 15, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 108332713}, {"rating": 2.0, "stay_parameters": "Stayed March 2011, traveled with friends", "text": "It's not a long walk from the Gare du Nord really, but I was dragging two suitcases over frequent cobblestones, which caused a lot of shoulder pain over the next few day. I baulked at doing the return journey after our week's stay, but there is a taxi stand a few metres away and the fee, including extra for more than two bags, was around 8 euros. The metro is just across the road, with a direct line to the centre of things. Do take advantage of the wonderful baked goods at Tania et Thiérry's boulangerie/patisserie at the opposite corner - fabulous stuff!", "title": "learn your people behave", "user": "Maria_And", "date": "March 31, 2011", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 2.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 102262248}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "i arrived at 5 in the afternoon and since there was a booking, the man at the reception told me that our room is not ready. and not only that, he was keep telling that it's not his fault, and you shouldnt come in this hotel again!! not a tin apologise, anything. the hospitaly od the hotel is zero. the good thing is that the room is clean and \"sophisticated\" enough for the money.", "title": "Good Hotel and nice & Central", "helpfulness": 2, "user": "cjtraveller1", "date": "March 16, 2011", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 5.0, "sleep": 2.0, "rooms": 2.0, "location": 5.0}, "id": 100382249}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "it's very close to bastile metro and other two metro station.", "title": "Great hotel in great location!", "helpfulness": 3, "user": "TrooperK421", "date": "January 30, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 94967236}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "Really enjoyed staying at this hotel, very good breakfast and nice rooms. Unfortunately we asked for a double room as we were on our 40th Wedding anniversary, they moved us from the nice twin on the 2nd floor to a double on the 1st floor, smell of cigarettes was horrendous. However they cleaned our room well each day and good hospitallity tray. Information was good and we were able to store our luggage with reception. Good all round hotel and very central for so many things including the metro and the buses. Catch a 26 bus outside of Gare du Nord middle pavement, takes you straight to the hotel. All other routes are long winded. Found a wonderful restaurant 5 mins toward Gare du L'est called \"Enjoy Coffee\" 8 Rue Chateau Landon real french bistro style beautifully clean and presented with food to die for. Dont miss the canal walks and local parks at the bottom end of Louis Blanc, real french atmosphere bars/cafes and shops.", "title": "Excellent budget hotel", "helpfulness": 2, "user": "trixie111_10", "date": "September 18, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 79990196}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "1st of all - this Hotel is not exactly CLOSE to Gare du Nord (15 minute walk - not really scenic), but it is literally right across the street from metro: Louis Blanc - so take the RER to Gare du Nord then transfer to the yellow line for Louis Blanc.", "title": "All around Great experience!", "helpfulness": 3, "user": "ErinmarieX", "date": "September 13, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 79377202}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "Hotel - Great Hotel! The room and hotel were very clean and small (to be expected) but we are not in Paris to hang out at the Hotel anyhow so we really didn't care. All staff that we encountered were extremely nice AND helpful - I wish I had gotten their names ;/", "title": "EXCELLENT - WILL DEFINITELY STAY THERE AGAIN", "helpfulness": 1, "user": "JADLondon", "date": "August 30, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 77467162}, {"rating": 3.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "We had a quaint street view (see pics) from the 2nd floor, room 207. yes, the room was a bit noisy b/c of the street BUT again - it's Paris and this is to be expected.", "title": "Boxed in comfort", "helpfulness": 2, "user": "June H", "date": "August 16, 2010", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 75379313}, {"rating": 3.0, "title": "Good quality - Good Price", "text": "Nightlife- We had to take a taxi from PLace de Clichy (party spot) to the Hotel since it was 4:30 am, metro was closed and it was only 8 euro's for taxi!", "helpfulness": 3, "user": "samspaceopera", "date": "August 9, 2010", "id": 74444874}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "There is a great Fruit market right across the street that we hit every day for Dates, bananas, Avocado's etc etc.", "title": "Excellent location", "helpfulness": 1, "user": "wendij76", "date": "July 18, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 71329662}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled with friends", "text": "Good Value Hotel ,.Super fast check in .Ten mins walk to Gare du Nord &Est .Rooms small but very clean .Breakfeast not the best but plenty of other plases to eat nearby . Do give Chez Papa a try just around the corner .Metro right out side so you can get into city centre really fast.", "title": "Good location Good Value Good Time", "helpfulness": 2, "user": "AlbieESussex", "date": "October 4, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 118921516}, {"rating": 4.0, "stay_parameters": "Stayed September 2011", "text": "Good bar on other side of road showing live soccer .", "title": "Poor value for money but clean and next to a metro.", "helpfulness": 1, "user": "biggles168", "date": "September 23, 2011", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 3.0, "service": 3.0, "rooms": 3.0}, "id": 118493500}, {"rating": 3.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "You can reach this hotel from gare du nord on foot which saves struggling with cases on the metro. It means you are in the NE of Paris though which is rather less picturesque than other parts of town. I booked 4rooms for 5 days and still had to pay £100 per night without breakfast which is extra £9. Rooms were tiny with tiny bath and tiny wardrobe. There's also a claustrophobic bar area which we didn't see anyone using. If all you want is a clean base to crash out then there's no problem. And the metro is next door so it's easy to reach the city centre etc. No restaurant but the breakfast room is bright with an adequate selection of basic breakfast foods. Don't think we'll go back unless they gave a substantial discount.", "title": "Simple, clean and good location.", "helpfulness": 2, "user": "neushan", "date": "August 12, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 3.0, "value": 4.0, "service": 3.0}, "id": 116624770}, {"rating": 4.0, "stay_parameters": "Stayed July 2011", "text": "We stayed at Campanile Gare du Nord July 26 - 28, 2011. The hotel isn' t fancy or posh, but it's reasonably priced, the rooms were clean. The biggest bonus is the location. The metro station is literally steps outside the front lobby!", "title": "Small, clean, good on a budget.", "helpfulness": 1, "user": "ab_af", "date": "July 25, 2011", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 4.0, "service": 3.0, "rooms": 3.0}, "id": 115765306}, {"rating": 4.0, "stay_parameters": "Stayed June 2011", "text": "We booked the hotel through Expedia and they couldn't find a record of the transaction and spent an hour on hold with Expedia trying to clear it up for us. In the end, they just gave us a room with only the confirmation printout from Expedia, which I thought was quite accommodating considering they could have just let us wait in the lobby for hours until the error was cleared up.", "title": "The better end of the budget market.", "helpfulness": 4, "user": "Lochfyne2", "date": "June 13, 2011", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 3.0, "service": 5.0, "rooms": 4.0}, "id": 112997893}], "location": {"country": "France", "region": "Ile-de-France", "continent": "Europe", "city": "Paris"}, "stars": 3, "variance": {"poor": 22, "average": 47, "very good": 128, "terrible": 10, "excellent": 36}, "aka": "Campanile Paris x Gare Du Nord Hotel Paris", "slim_ranking": 0.524261015059}