{"user_rating": 4.0, "review_count": 147, "name": "Campanile Bradford", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed July 2011, traveled on business", "text": "This is a convenient hotel just off the motorway, easy to find. It's on the edge of an industrial estate but as I've only stayed here at weekends I can't comment on what effect that might have on overall stay. Ask for room at front as rear rooms face the motorway which I found noisy at times. That would be my only complaint, otherwise clean and comfortable, friendly competent staff, good evening meal and adequate breakfast. Have stayed on more than one occasion.", "title": "Comfortable Stay", "user": "disleksik", "date": "July 29, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 3.0, "value": 4.0, "service": 4.0}, "id": 115973555}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "First you need to get over the location on an industrial estate off the M606, and walls & ceiling being covered in artex – because everything else about Campanile was spot on, even more so with a good room rate off the web.", "title": "Highly recommended!", "helpfulness": 1, "user": "lindale", "date": "July 28, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115896562}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "Parking is easy, and we had no noise from the industrial estate – in fact sitting in the breakfast room looking out at the garden you would not believe your location! The entrance lobby is big and reception staff were very friendly as were all the staff we met – the lovely lady at breakfast even brought us coffee (rather than having to serve ourselves) and clearly looked after all the guests well and with enjoyment.", "title": "Pleasant surprise", "user": "Jean C", "date": "July 10, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 5.0, "service": 5.0}, "id": 115218360}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "The recently refurbished rooms are large, with comfortable beds, flat screen TV with many channels, modern en-suite with separate toilet. Rooms have air-conditioning which was a blessing due to our stay coinciding with a hot spell.", "title": "What a lovely surprise - inside!", "user": "joy_hood", "date": "June 27, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 114784401}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled on business", "text": "We went for the continental breakfast which was fantastic. Lovely cakes & croissants, fresh (not tinned) fruit and some of the best coffee we’d had in a hotel for a long while. For this class of hotel the eating area and bar was much better than expected.", "title": "Outstanding", "helpfulness": 1, "user": "Marcastle", "date": "June 24, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 114707127}, {"rating": 4.0, "stay_parameters": "Stayed June 2010, traveled on business", "text": "An excellent hotel, especially if you have your own car as it's just off the M606 which links Bradford city centre with the M62. A taxi to Bradford Interchange in the city centre (where Grand Central now run trains direct to London and Doncaster) costs £7.", "title": "Excellent Hotel for Bradford", "user": "addictivepsycho", "date": "September 13, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 79398835}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "Rooms are very spacious, were clean and had ambient lighting, which some may have found annoying if trying to work. As i was only there to relax and sleep it didn't bother me. Bathroom and free toiletries were good. The toilet seemed to have its own little room which was an interesting touch rare in the UK! Most importantly it was nice and clean. TV was fine, all standard in-room services as you would expect.", "title": "Excellent base to get about the area.", "user": "Efrog", "date": "September 12, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 79233324}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "Reception fine and attentive. Restaurant has a pretty minimal choice, though - that's the only real downside to the hotel.Wifi in rooms is free - an excellent bonus, also unusual in uk hotels.", "title": "Very Good Stopover", "user": "Kirk60", "date": "September 7, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 78611859}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled with friends", "text": "For a bargain of £29 a night if you book in advance, a great hotel.", "title": "Good value - better than expected!", "user": "wannabetraveller786", "date": "August 15, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 75283800}, {"rating": 4.0, "stay_parameters": "Stayed July 2010", "text": "We stayed for three nights on a breakfast included deal, and at £35 for a twin room, I have no complaints on this at all. Spotless rooms, and children quickly made use of the free w-fi. The only gripe was the vegetarian cooked breakfast ... we upgraded to this from the continental, but all it was was a 'full English' less the meaty bits. Location not conducive to leaving the hotel on foot -located on an industrial estate, but this didn't bother us.", "title": "Lovely hotel close to motorway, nice...", "user": "NicolaFred", "date": "August 14, 2010", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 75211608}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled on business", "text": "Stayed here again recently, our 5th stay I think! Really excellent value. My only criticism would be the rather poor service in the restaurant (although the meal was fine). The waiter should realise that the customer should take preference over watching the football! Fortunately the waitress was a lot more attentive.", "title": "Still Good", "helpfulness": 1, "user": "disleksik", "date": "October 27, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 143862041}, {"rating": 4.0, "stay_parameters": "Stayed October 2012", "text": "Brilliant Value. Lunch good. Rooms perfect. Great cheap getaway. Beds are very comfy.", "title": "Zumba Convention", "user": "suzi 1955", "date": "October 27, 2012", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 143849872}, {"rating": 2.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "Decor lime green!!!! It makes a nice change. Artex is a bit dodgy. Michelle better than we expected. Would recommend to friends.", "title": "Campanile Bradford", "user": "Davydiva", "date": "October 20, 2012", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 2.0, "location": 1.0}, "id": 143267282}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled with friends", "text": "We were booked in to this budget hotel as part of a coach trip deal. It is set on an industrial site but views of the countryside can be seen from some bedrooms. Having read the Tripadvisor comments I thought it would be fine. The rooms were clean and a fairly reasonable size, but not a designer's dream. The walls and ceiling are plastered with artex and the decor is average at best. Our toilet roll holder was missing at it took them two days to sort this out. The breakfast was almost adequate, although scrambled eggs were the only type on offer. When I asked for a fried egg I was told that there was only one chef on duty so I couldn't have one. They ran out of butter and brown baguettes by the third day. The philosophy of the staff was generally one of 'no can do'. The evening meals were basic, with the same starter every night, ie. salami, pasta salad and a very basic salad, or soup. Three choices of mains were available but by the third night there were no vegetables on offer at all. The desert were chocolate cake or a basic lemon merangue, neither of which were particularly palatable. I understand that coach party food is below the standards that other guests get, which is pretty grim. Overall, this was one holiday I was glad to get home from.", "title": "Great value", "helpfulness": 1, "user": "Greenpiglet", "date": "October 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 143235866}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled on business", "text": "Although in an industrial area this hotel is quiet and I got a great nights sleep. Rooms were spotless as were all communal areas.", "title": "Clean and tidy, exactly what you are looking for!", "helpfulness": 2, "user": "youngg05", "date": "October 4, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 142000670}, {"rating": 4.0, "stay_parameters": "Stayed August 2012", "text": "Coming from London, I dont really know the area so well, so I can't really comment on the location so much. However using satnav it was straightforward to find. The rooms are good sized (we had 1 double 1 single), you have your normal stuff, cupboard with hangers, desk, tea stuff and kettle, tv, air conditioning, towels, etc. You have a separate wc from the shower, and the shower is with a bath tub aswell. The hotel is slightly outdated but they are trying to keep it looking good. The rooms were 90% clean. Towels were provided per person which means I didn't have to ask for more like I have done in other hotels. We had 3 rooms, some bathroom doors didn't have locks on, which may be fine or inconvenient for some. 1 of the rooms were disadvantaged by being on the ground floor and facing the road so abit noisy during the night. The other two benefitted from a quiet night and a nice view outside. We had free parking, free wifi. We made requests when booking which they tried to fulfil. We didn't try the bar or restaurant, but the guy at reception did give a pizza leaflet which was really nice. Customer service although not tested so much did seem really good and I feel they would have tried to help the customer a lot. Rooms kept clean with housekeeping popping round too. I really enjoyed it, and would stay there again if the location suits me.", "title": "Decent. :)", "user": "RChaudary", "date": "August 29, 2012", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 3.0, "service": 5.0, "rooms": 4.0}, "id": 138745366}, {"rating": 5.0, "title": "a very comfortable hotel", "text": "Recommended. :)", "helpfulness": 1, "user": "scotlandmargo", "date": "August 20, 2012", "id": 137728435}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "recently spent time here on a coach trip. it was a really enjoable hotel. friendly staff, very clean room and spacious. outside area with pool nice to sit here on a summer evening. the food was very good and plenty of choice. the breakfast was lovely again plenty of choice.", "title": "Excellent value", "helpfulness": 1, "user": "Valentine1973", "date": "August 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 137674769}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled on business", "text": "Booked two rooms for my family of 4, as it was only for one night I choose a budget hotel. I was really suprised this hotel was modern, spacious and one of the cleanest hotels I have ever stayed in. The staff were extremely helpful, my daughter asked for more tea bags and milk and she came back with a bagful of each. Would definitely stay again :)", "title": "I will stay at this Hotel again.", "helpfulness": 1, "user": "EwanHossami", "date": "August 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 137270285}, {"rating": 3.0, "stay_parameters": "Stayed August 2012, traveled on business", "text": "Room was clean, quiet, comfortable and large.", "title": "Great Value for short stays.", "user": "orlando_fan_62", "date": "August 14, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 137134010}, {"rating": 3.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "The Campanile is situated on an Industrial/Retail Park, but don't let this put you off. Just off the M606 into Bradford it is an ideal base for travelling to other towns and cities for day trips. The room and bathroom were very clean although basic - with larger than normal towels for a typical basic hotel chain. The room is completely artexed, walls and celings, so can feel a bit clinical. We only used the room for sleeping in as we were out most of the time, so this didn't bother us.", "title": "Clean, Comfortable and Cheap!", "helpfulness": 1, "user": "LiverpoolL9", "date": "June 14, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 113368645}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "Breakfast was fine with the usual foods available, hot scrambled eggs, bacon, sausage, beans etc and cereals, yoghurts, breads, croissants, cheese etc for those wanting a continental breakfast. We ate out in the evenings so don't know what their evening meals are like.", "title": "Very nice!", "user": "Happy736833", "date": "May 10, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 107626991}, {"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "The staff were very friendly, especially the reception staff, who went out of their way to be helpful and recommended places for us to visit.", "title": "Super Breakfast and attentive and polite staff", "helpfulness": 1, "user": "araf", "date": "April 10, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 103520923}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled on business", "text": "We stayed at the Campanile on the 7th may. We had two rooms booked for my husband and myself, and my daughter and her husband. The staff were very pleasant, and the rooms were very comfortable, especially the beds. We had a full english breakfast (Excellent)which was served until 11-0am. This was great as we were in late the night before. We would definately stay there again and highly recommend it.", "title": "Quite nice and spot on value for money, unless you need the internet access.", "user": "Winger_IE", "date": "March 8, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 99469013}, {"rating": 3.0, "stay_parameters": "Stayed January 2011, traveled with family", "text": "One night stay only but hotel ticks the boxes. Refit of reception bars and dining to a high standard. Ou side swimming pool not in use.", "title": "What I expected", "user": "Archaeologist", "date": "January 26, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 94444189}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled on business", "text": "Stayed one night on business bed and breakfast, selected hotel for location. Much, much better than most of the other Campanile motels I have used which are pretty basic and in some cases getting a bit seedy. Another reviewer said this was not built as a Campanile, and it shows - proper hotel layout, larger rooms, excellent free Wi-Fi throughout, air con, all much better than I was expecting but still at normal Campanile price which makes it excellent value. Only disappointment was that I had the cooked breakfast which was pretty tasteless, should have stuck with the continental buffet. Location is pretty uninspiring, but okay if you have transport.", "title": "Surprisingly good", "helpfulness": 2, "user": "Stephen H", "date": "September 24, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 141165187}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "The first thing my teenager daughter said after walking into the hotel, having made disparaging remarks about the look of it as we drove into the car park. The staff were absolutely brilliant, very polite and attentive despite having a coachload of holidaymakers who also needed feeding just as we arrived at the restaurant. The food was lovely (and you get a free glass of wine with your meal - voucher in the bedroom, check first before you go to the restaurant - although they did honour it for us later in the evening). And the rooms were extremely comfortable and well looked after. Even hubby (the fusiest person on this planet) was heard to stay that it was the best hotel bed he had slept in for some time, and wondered if they would notice a couple of pillows going walkabout as they were even better than the ones at home - have I mentioned how fussy he is? Would highly recommend this to anyone - and we did leave the pillows for someone else to enjoy", "title": "Never Judge a Book By Its Cover", "helpfulness": 1, "user": "colonial_clive", "date": "September 23, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 141025021}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled on business", "text": "Great place to stay,very clean,nice good sized rooms,comfy beds.A little out of the centre but that made it a good place to sleep from lack of noise.The staff are all friendly and polite. The food was very good on the evening but despite getting up early for breakfast there wasnt much left. Other people staying there with us told us when it was there it was good!", "title": "Excellent Value", "helpfulness": 2, "user": "Shahzeen", "date": "September 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 140425775}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled on business", "text": "They could do with more staff on duty when there are a couple of coach parties in. Having said I would stay there again.", "title": "Good value - great food", "helpfulness": 1, "user": "RobbyJBridlington", "date": "September 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 140345886}, {"rating": 4.0, "stay_parameters": "Stayed September 2012", "text": "Campanile's vary in price I find depending on where you stay. The Bradford Campanile is very new, spotlessly clean and newly refurbished. It is a little difficult to find. My satnav did not take me straight there but watch out for a brown sign off the M606 roundabout which will take you straight there.", "title": "We stay here every time we visit", "helpfulness": 1, "user": "newlywed100", "date": "September 7, 2012", "detail_rating": {"cleanliness": 3.0, "value": 5.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 139689171}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "excellent reception staff, especially Rebecca Gibson who went out of her way to find us the right room.", "title": "brilliant bargain", "helpfulness": 1, "user": "No1silversurfer", "date": "August 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 137108714}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with friends", "text": "the room was clean, exceptionally comfortable with the usual hostess tray.", "title": "Really worth a stay here - why pay more ?", "helpfulness": 3, "user": "Andy606", "date": "July 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 135699303}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "the food was excellent as was the service from our waiter, John-Paul Maloney, who explained what each meal was as some had names we didn't recognise. he altered the menu to suit our needs and made reccomendations and, considering the fact that there were 2 coach loads of mature guest dinin at the same time as us, service was speedy and the food hot - and - no noise from any guests - oh ... and air-con!", "title": "Very good", "user": "Lori058", "date": "July 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 135631453}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with friends", "text": "We stayed here for 2 nights. Although it is located outside of Leeds, it was only a short drive away - and totally worth it. The hotel was clean and bright, the room was spacious, spotless and comfortable, the staff could not have been friendlier, and the breakfast was good (with a superb choice). We will definitely stay here again - it was just as good as lots of much more expensive chains I have stayed in - and the value for money is excellent.", "title": "Excellent stay", "user": "lynchnic", "date": "July 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 2.0}, "id": 135546069}, {"rating": 3.0, "stay_parameters": "Stayed July 2012, traveled on business", "text": "Managed to book £35 per couple bed and continental breakfast rate. Room 019 was spacious and very clean. Did not bother to pay extra for the cooked breakfast as the continental was so extensive - excellent fruit juice, fresh fruit salad as well as orange and grapefruit segments, yogurt with fruit compote, meat and cheeses, warm croissants, pain au chocolate, french bread plus bread for toasting!. Also ate in the restaurant on both nights - again very good choice at reasonable prices. There was even a voucher in the room for a fre drink if you ate in the restaurant. Both the restaurant and bar/lounge areas are very comfortable. Every staff member we came across was pleasant and friendly. Yes, this hotel is on an industrial estate but it is very quiet at the weekend and was easy to find. We would not hesitate in recommending this hotel and would certainly stay again.", "title": "Nice hotel, poor location", "user": "FrankieB2012", "date": "July 22, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 1.0}, "id": 135089861}, {"rating": 4.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "Got a great rate for this Campanile motel on late rooms. £35 for a double room including continental breakfast with only a £2.50 supplement to upgrade to a full English breakfast.", "title": "Good value, great for a no frills stay", "user": "joh1961", "date": "January 23, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 2.0}, "id": 94149608}, {"rating": 3.0, "stay_parameters": "Stayed November 2010, traveled on business", "text": "The motel is situated in the middle of a trading estate so not the place if you are looking for pretty and picturesque! Batleys cash and carry just across the road. (see photos of window views)", "title": "Good Value - Good Sleep - 1 or 2 nights only though", "user": "PEM67", "date": "November 28, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 3.0}, "id": 88413011}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "However if you want a clean room with a comfortable bed with easy links to motorways (just off the M606) this is the place for you. Parking was easy and free. Check in quick and efficient. Lift was a bit scruffy, graffitti on the mirror, and I did start to think \"oh dear\" but the room was good for the price. Shampoo and soap provided. Clean good quality towels. Free wi fi - no problems accessing it. Room a bit cool when we arrived but the heating system was very good and it was warm in no time at all.", "title": "not what I imagined....", "user": "GFL", "date": "November 28, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 88402242}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "Very quiet night, didn't hear any other guests but we were near the end of a corridor. (room 135)", "title": "Excellent value for money", "user": "ljg1006", "date": "November 7, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 86276851}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "Breakfast served from 7 -10 on Sundays. Pleasant staff greeted us. Good selection of self serve items. Upgrade to a full English for only £2.50 each. My husband received a good plateful of food. 2 sausages, 2 bacon rashers, beans, mushrooms, scrambled egg and 2 hash browns + he could help himself to the continental buffet as well. Hash browns a bit crispy, looked like deep fried.", "title": "Excellent value for money", "helpfulness": 1, "user": "ljg1006", "date": "September 16, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 79808710}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "stars": 3, "variance": {"poor": 8, "average": 26, "very good": 70, "terrible": 4, "excellent": 39}, "aka": "Campanile Bradford Hotel", "slim_ranking": 0.433333333333, "description": "Modern, full service hotel with multilingual staff, restaurant and bar; located near M62 motorway."}