{"user_rating": 4.5, "review_count": 181, "name": "Candlewood Suites Harrisburg", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled with family", "text": "My stay at Candlewood was absolutely wonderful. Front desk was very kind knowledgeable and friendly. Lobby was clean as well as hallways. My room was clean and had a lot more accomodations that i would have expected. The full size refridgerator was nice. Clean linens and everything was organized in the room and easy to find. We also used the hot tub and pool which was clean and the towels were well stocked and the bathroom was clean too. I WOULD DEFINETLEY GO BACK AGAIN!!!!", "title": "Girls night in.", "user": "shefs2010", "date": "January 18, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 93546648}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled with family", "text": "I just came back from a trip to the PA Farm Show. I booked this hotel because it was close to the Farm Show Complex and it had a small kitchenette in it. I read the reviews; some were good and others were not so I did not know what to expect. I (and my daughter and her friend) were extremely happy at how wonderful this hotel was. Everyone was so nice and helpful and the room was AWESOME!! We had two queen beds, a large bathroom and closet. The kitchenette was perfect and had every utensil I needed to cook with. I had brought some of my own not knowing what to expect. Next year I will not bring as much...I have already booked for next year's Farm Show. The girls loved the pool and hot tub and the free use of dryers (and washers) was greatly appreciated. I had requested a non-smoking room because my daughter's friend is allergic to smoke and the front desk clerk assured me we were on the bottom floor (all smoking rooms are on the top floor). Our room was perfect-no smell of smoke at all. I did hear some kids running down the hall one night but that was it. The beds were so comfortable and the chair/recliner was great too. Love this place!!", "title": "What a great place to stay!", "user": "4Hfamily3", "date": "January 12, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 92682423}, {"rating": 2.0, "stay_parameters": "Stayed November 2010, traveled with family", "text": "The staff would not look up our priority club number. He said he did not know how. When we checked out, they charged us a different rate than what we were told when we arrived. The Manager never called us back after leaving 4 messages. We asked for the district Manager to call us and he gave us a credit.", "title": "Manager and Staff not helpfull", "user": "Disney555", "date": "December 30, 2010", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 91113323}, {"rating": 3.0, "stay_parameters": "Stayed November 2010", "text": "We were across from the laundrey room (we had a small dog) and you could hear the machines all night.", "title": "Stay was ok, but lacked a few things.....", "helpfulness": 1, "user": "Davesnhere", "date": "December 5, 2010", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 1.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 89086743}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled on business", "text": "The bed, TV and kitchen were nice. We have stayed at better Candlewood Suites in PA.", "title": "Highly Recommend", "user": "biztravelerchitown", "date": "September 15, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 79683105}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled on business", "text": "i wrote a review on this place before and it never appeared, so i will write again. i stayed here from jan-may 0f 2011. this was my second extended stay at this same hotel. the price is very economical for the ammenities you receive. the room was well maintained and spotless when i arrived. housekeeping cleaned my room weekly after that and they were very accomodating to my schedule since i work the night shift. the lobby staff are top notch-very friendly and helpful-made me feel like this was my home away from home. i cant say enuf abt the staff-they are what makes this place special. my family and dog visited several times and they had blast here. the hotel is very safe for my son to wander ard in-he is autistic and he loves to talk and visit with everyone. the pool is beautiful and spotless. frequent problems with hot tub. the food in the commissary needs freshened more frequently. sometimes supllies were low, esp on frozen meals. sandwiches and deli foods need replaced more frequently for freshness. healthier foods and less junk would be nice, but overall a pretty good variety. nice grocery selection-has everything you need without having to run to the store for a simple meal or snack. ice creams were too soft. freezer needs adjusted. location is awesome. on and off major highways and a direct drive into the city. plenty of shopping, restaurants and walk-in medical facility nearby. beds are the ultimate in comfort. separate desk for work would be nice, but room space is limited. will stay here again in future.", "title": "highly reccomend it!!!!", "user": "teresanln", "date": "June 14, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 113476019}, {"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled with family", "text": "The room was just right size,queen bed with desk and small kitchen. Refrig worked fine and bathroom was clean and neat. Pool was quiet and refreshing as was jacuzzi.", "title": "convienent and would stay again", "user": "bxrams", "date": "June 7, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 4.0}, "id": 112082836}, {"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "I love Candlewood suites, this was not the best I have stayed in. Desk clerk seemed very unsure of what she was doing. Took forever to print our registration card, then it was the wrong one. Noticed that it wasn't my name on the paper, and there was a charge when it was supposed to be a Priority club free night. She took care of it and we went on to our room. As we were walking down the hall, we were 'greeted' by a barking dog that was eveidently left alone in the room. Couldn't hear the barking once we were in the room, but I think that hotels that allow pets should reserve a certain part of the hotel for those guests so that the barking won't bother other guests. Walls were very thin, could hear the children in the room next door, so if the dog had been there, it would have bothered us.", "title": "Not the best Candlewood I have stayed in", "user": "mississmissi", "date": "April 24, 2011", "detail_rating": {"service": 2.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 105313227}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled with friends", "text": "I searched endlessly for a hotel in the Harrisburg/Hershey area that was affordable, nice and clean, and would allow pets for a reasonable fee. I read the reviews and this place sounded great. When we got to our suite, within 10 minutes we noticed ants in the kitchen and bathroom. I called the front desk and they immediately moved us to another suite. There were no signs of any ants in the suite just down the hall. The suites were fairly new looking with nice appliances and furnishings. The beds were extremely comfortable - just as comfortable, if not more, than my bed at home. This is the first time I've ever had a truly comfortable bed in a hotel! The bathroom was very roomy with granite countertops and a nice shower/tub combo. The towels were the best towels I've ever seen at a hotel. The pet fee was $25.00 for the entire stay which was reasonable compared with other hotels. They have a nice area out back that is designated as a pet walking area. They even have doggie bags and a waste receptacle for you to use. I would definitely stay here again - you cannot beat the price and the quality of the hotel is wonderful.", "title": "Pleasantly Surprised!", "user": "Piglet601", "date": "March 23, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 101278809}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "First time at this Chain as we searched for a Hotel close to our family in Harrisburg at a reasonable price. This turned out to be excellent in all respects except for complementary breakfast.and adequate sign in procedure. Would not hesitate to stay again and recommend to our friends.", "title": "Excellent Quality for Reasonable Price", "user": "cintibum", "date": "March 17, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 100557334}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "Our family of 4 stayed here for 3 nights and it was just right for us. Although we didn't spend much time at the hotel, we used the full-size refrigerator, took a dip in the pool and made good use of the free hi-speed internet. I didn't realize until we checked in that the hotel doesn't offer daily maid service, but since I could get fresh towels and linens from the front desk at any time, it didn't matter. Speaking of which, the bed and linens were high quality. The towels were only okay.", "title": "Just right for a family of four", "user": "almabalma", "date": "July 14, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115375169}, {"rating": 1.0, "stay_parameters": "Stayed June 2011, traveled on business", "text": "We had paid in advance for room with 2 queens, but we were upgraded to a King suite with a pull out bed in the living room. It turned out to be an ideal arrangement for us.", "title": "Used to be OK...Not any more.", "helpfulness": 1, "user": "AndiPhillyArea", "date": "July 14, 2011", "detail_rating": {"cleanliness": 1.0, "sleep": 3.0, "value": 2.0, "service": 1.0}, "id": 115370256}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "I used to recommend this hotel to people who needed to travel to the Harrisburg (non-downtown area). Now I would say: STAY AWAY. I complained that my tub was not draining and was assured that it would be addressed while I was out the next day. Not done. No manager on duty. Oh and \"the maintenance guy quit a week ago\". I told them to get an emergency plumber. As assistant manager had magically appeared in my room when I returned from dinner. He was pulling out globs and globs of hair from my tub drain---too gross for words. The front desk also failed to notify me that a gift was delivered. Had I not spoken to the person who sent it, I would have never known or received it. Management refused to return my calls to address my experience.", "title": "Best Deal In Hershey", "user": "vegas4superbowl2009", "date": "July 11, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115254823}, {"rating": 5.0, "title": "great stay", "text": "I stayed here in August of 2010, and while planning my 2011 trip I decided to write my review of this property, First off, I will be returning to this hotel again in Auguast 2011 for our annual family trip to Hershey Park.", "user": "987traveler", "date": "July 1, 2011", "id": 114932660}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled on business", "text": "I have stayed at other ICHG Hotels (Holiday Inn, Crowne Plaze, Staybridge Suites) but this was my first Candlewood Suites stay. This hotel is very clean, looks very new and provided a very enjoyable and relaxing stay for my son and I. We arrived on a Monday with a 3-night reservation. The staff was very considerate. Indoor Pool and jacuzzi were immaculate and well maintained. Room was spotless. Gym and Laundry faciliates are new and very clean.", "title": "Decent place for a short or long term stay.", "user": "Steeler_Pens_fan", "date": "June 26, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 114767514}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled solo", "text": "Friendly staff, extremely clean rooms, and wonderful amenities! I would return in a heartbeat & i will make sure to recommend Candlewood to anyone I know that is coming to the area! Thank you so much!", "title": "BEST STAY THANK YOU SO MUCH!", "user": "dradle17112", "date": "March 1, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 98518834}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled on business", "text": "I had to travel to Harrisburg on business and it's very important to me to find a hotel that is clean, has comfortable beds, and a good shower. and this hotel has all 3. I'm very impressed with the Candlewood in Harrisburg, PA and will be coming back to stay here everytime I'm in town! Not to mention that the staff was friendly and went the extra mile to make sure I was satisfied with any request that I had. As a Platinum Priority Club member that has stayed in many hotels I will reccommend this hotel to all my colleagues and friends.", "title": "GREAT EXPERIENCE!!", "helpfulness": 4, "user": "kristydawn24", "date": "February 28, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 98469963}, {"rating": 5.0, "stay_parameters": "Stayed February 2011", "text": "First time to stay in a Candlewood chain, I was very pleased! Free laundry facilities, great workout room, clean pool area & very helpful & friendly service. The room had plenty of electrical outlets. The pantry was well stocked with a nice verity. Each unit has its own kitchen, we purchased groceries & we saved $ on meals. We had a puppy with us. It was quiet, our pup never barked due to noise.", "title": "Clean & friendly service", "user": "2_kid", "date": "February 21, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 97407792}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "I will be staying here during my annual visits.", "title": "hotel is beautiful, clean; staff is courteous and pleasant; had a wonderful stay!", "user": "Peggy016", "date": "January 18, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 93552769}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled solo", "text": "we have stayed at outher candlewood hotels, and knew this would be a good place to stay. shopped, visitied with family and friends, went to the casino. would stay her again, and have recommended hotel to friends. thank you!", "title": "Friendly, warm, clean environment with a helpful staff.", "user": "soldierwife312", "date": "January 18, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 93546975}], "location": {"country": "United States", "city": "Harrisburg"}, "stars": 2, "variance": {"poor": 6, "average": 16, "very good": 45, "terrible": 7, "excellent": 107}, "aka": "Candlewood Suites Harrisburg Hotel Harrisburg", "slim_ranking": 0.36, "description": "Welcome to the Candlewood Suites Harrisburg Hershey, where comfort and guest satisfaction are our primary goals. We are conveniently located off Interstate 81 just minutes from Hershey Park and Hershey's Chocolate World as well as the Hollywood Casino at Penn National Race Track. A short drive to the south is downtown Harrisburg and our quiet suburban property is within 2 miles of multiple restaurants and shopping centers, and is an easy drive to PA Dutch country. Our all suite extended stay hotel is built for comfort. Our rooms are the ultimate suites for the business traveler. Each suite has a full kitchen complete with microwave and full size refrigerator. Work efficiently at your extra large executive desk with high-speed Internet and speaker phone. Relax in the overstuffed recliner while you enjoy the CD and DVD Player. Borrow your favorite movie or CD from our lending library. Work off some stress in our 24 hour fitness center, relax in indoor heated pool & spa and take advantage of the complimentary laundry facility. You can purchase meals, snacks and sundry items at value prices at the Candlewood Cupboard."}