{"user_rating": 3.5, "review_count": 38, "name": "Candlewood Suites - Austin Arboretum-Northwest", "reviews": [{"rating": 4.0, "title": "Great Location, very clean", "text": "Clean, quiet, nice staff, good sized rooms, very easy location to get in and out of. Rack rates can be high sometimes, but this is a great hotel if you get the right rate.", "user": "A TripAdvisor user", "date": "September 20, 2005", "id": 3925835}, {"rating": 4.0, "title": "Great value for the money", "text": "Not the Four Seasons, but perfect for a low budget stay. I wouldn't pay their rack prices, but certainly worth going through a discount travel site. Rooms are small but very functional. Location is good, building and rooms are in generally \"new\" condition. Staff helpfulness varies greatly, but in reality you really don't need to talk to them!", "user": "BernardJP", "date": "August 25, 2005", "id": 3805909}, {"rating": 5.0, "title": "Always a pleasant experience!", "text": "This is my hotel of choice when I'm on business in the Austin area. It's not on the freeway, so it's very quiet. The staff is always pleasant and helpful. It's like a home away from home for me!", "user": "A TripAdvisor user", "date": "July 30, 2005", "id": 3723479}, {"rating": 4.0, "title": "Great for Extended Stays", "text": "This all suite hotel is perfectly set up for the business traveler in Austin for a while. The kitchenette is well equiped, the easy chair was a bonus, and I don't know that I've ever stayed in a cleaner looking place. Pantry, laundry, and exercise room combo was very convenient. Two MINOR complaints: the mattress had way too much give (and I like a softer mattress) and the automatic fan that comes on with the bathroom light was annoying. But overall, I'd go back in a heartbeat.", "user": "cagseg", "date": "July 19, 2005", "id": 3682184}, {"rating": 1.0, "title": "There are better values for the money", "text": "I booked this through Hotwire for $41/night. I think I was assigned the \"Hotwire special\" room. Several TV channels were not working, broken control on the air conditioning - I could not adjust to a cooler temperature in room than 77 degrees on a 100+ day outside, room smelled of stale garlic, rudeness of desk clerk on checkout. I only stayed one night; if I was staying longer or had checked in earlier I would have asked for another room.", "user": "clementine85", "date": "July 6, 2005", "id": 3644092}, {"rating": 3.0, "title": "Just acceptable", "text": "I stayed for one night at this hotel becasue EVERYTHING else was pretty much booked in Arboretum and I wasn't sure of staying in Austin Downtown since it was my fist time to the city and I didn't know long things were away from each other.", "user": "elakan", "date": "April 29, 2006", "id": 5019407}, {"rating": 1.0, "title": "Disappointing Stay - Book Somewhere Else", "text": "The hotel does not have a swimming pool> it's close to a highway and it's right next to the mall and cinema. I actually walked to (a HUGE) Whole Foods - it's only 5 minutes walk, if that.", "user": "A TripAdvisor user", "date": "March 20, 2006", "id": 4706870}, {"rating": 2.0, "title": "Poor Service though well furnished as advertised", "text": "Even though my room was non-smoking, you could feel the cigerattes in the hallways. The pillows were really old - clean covers, but the pillow itself was pretty much flat/worn out.", "user": "A TripAdvisor user", "date": "January 16, 2006", "id": 4355374}, {"rating": 2.0, "title": "Rude and Confused Staff", "text": "It's a stuido type suite - fridge, stove, microwave.... Decent bathroom.", "user": "A TripAdvisor user", "date": "December 16, 2005", "id": 4245110}, {"rating": 1.0, "title": "Very Disappointing!", "text": "Overall clean. The staff was OK.", "user": "MichelleAustin_TX", "date": "November 9, 2005", "id": 4102305}, {"rating": 5.0, "title": "Excellent rooms for the money!!", "text": "I've stayed in 3 hotels in 12 days, and Candlewood Suites wins hands-down. I booked the one bedroom for less than 62.00 a night on their website, and was pleasantly surprised at how nice the accomodations are. The kitchen has a full-size fridge, microwave, and 2-burner stovetop, and lots of pantry space for groceries. The bathroom is large and the place is nice and clean. The honor system convenience store is a plus, and the free laundry room is great. Everything is pretty much self-service, but for families (or anyone needing accomodations for a week or more) it's a great set-up. Only con? The elevator is in the front of the building-we're in the back of the third floor. Still, at least they *have* an elevator, and the location (in a newer building than most) is great.", "user": "A TripAdvisor user", "date": "August 7, 2004", "id": 2427805}, {"rating": 4.0, "title": "a great deal under $50", "text": "booked thru Hotwire and got a great deal for ~ $38/night back in Feb, 2004. The sofa's a little sunken, but the room's got everything you can ask for & more... including a well-equiped kitchen. I really like the idea of the honor-system pantry. The exercise room and laundry were nice additons. The location is very closed to the Arboretum shopping district. Which happens to be one of the nicer neighborhoods in the NW part of Austin. I've booked the hotel again this time. Couldn't get as low a price, but anything under $60/night is a good deal.", "user": "daijobu", "date": "June 17, 2004", "id": 2200088}], "location": {}, "stars": 2, "variance": {"poor": 4, "average": 3, "very good": 14, "terrible": 8, "excellent": 9}, "aka": "Candlewood Suites - Austin Arboretum-Northwest Hotel Austin", "slim_ranking": 0.563535911602, "detail_rating": {"service": 3.0, "cleanliness": 3.5, "value": 3.0, "sleep": 3.5, "rooms": 3.0, "location": 4.0}, "description": "Candlewood Suites is not your traditional hotel, and that is the best part! At the Candlewood Suites Austin Arboretum NW we put the amenities where they really count; in the rooms! That means a suite with a full kitchen and plenty of space to stretch out! Each suite has a full kitchen complete with microwave, full sized refrigerator and all your utensils and pans to cook with. Work efficiently at your executive desk with two separate phone lines, free hi speed internet, check email and talk on the phone at the same time. Relax in the overstuffed recliner while you enjoy a DVD borrowed from the hotel in your DVD player. Work off some stress in our fitness center or visit our Candlewood Cupboard. In the Candlewood Cupboard you can purchase meals, snacks, and sundry items at value prices. The Candlewood Suites Hotel is located in the Arboretum Area of NW Austin. Candlewood Suites is within blocks of Gateway, Arboretum Mall and dining area, Domain Mall and Arborwalk Shopping Center. Candlewood Suites is located 9 miles from the University of Texas, DK Royal Memorial Stadium Home of the 2005 National Champion Longhorns and a short drive to the famous 6th Street and Warehouse Entertainment Districts. Major employers IBM, Motorola/Freescale, and Camp Mabry are only minutes away. Our location is accessible from Mopac (Loop 1), Hwy 183 N and Capital Of Texas Hwy (Loop 360)."}