{"user_rating": 4.5, "review_count": 604, "name": "Candan Club Hotel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed September 2013", "text": "Hadnt been to turkey befor but absolutly loved it, excellent for family,couples etc... Staff was so friendly and helpful, entertainment was the best cookie and honey made that place even more enjoyable.. I would def recomend club candan to everyone .. Excellant value,entertainment and welcoming !! Had the best time ever and hope to go next year ... X", "title": "Fantastic holiday!!!! Shazzy b xx", "helpfulness": 2, "user": "Shazzwahh", "date": "September 13, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 176992722}, {"rating": 5.0, "stay_parameters": "Stayed August 2013", "text": "The entertainment was amazing through the day (cookie+honey) made our holiday with the laughter they brought to us and everyone there. Brilliant service from the bar and restaurant, really cheap food n drink and the food was really fast, bar stays open nearly as long as you want as long as your still buying drinks.", "title": "Brilliant", "helpfulness": 2, "user": "Jamieb1411", "date": "September 12, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 3.0, "service": 5.0, "rooms": 5.0}, "id": 176852510}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "Have just came back from a family holiday at club Candan , and all I can say is it was the best holiday I have ever had. the rooms were spotless, the maid service excellent, the location very good and only 5 min walk to restaurants and bars & 15 mins max to the seafront. This hotel has everything you could possibly need for a fantastic holiday. We were kept entertained all day long with Honey & Cookie the hotels entertainers, I have never meet such a dedicated hard working couple that go all out to make your stay a enjoyable one - such a brilliant couple and such fantastic fun !!! .Cant wait to book again next year.", "title": "Fantastic Holiday !!!", "helpfulness": 3, "user": "janette b", "date": "September 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 176755974}, {"rating": 4.0, "stay_parameters": "Stayed September 2013", "text": "Well just came back from a fabulous holiday at club candan (jandan) we arrived at 2am quick check in and was shown to our room no hassle could not complain about the room only a few gripes air con only in bedroom and could of done with having a toaster but used the grill thing and was just as good we had rooms throughly cleaned and towels changed every day. If we had any problems we phoned reception and was dealt with quickly,", "title": "Already looking to book for next year", "helpfulness": 2, "user": "tinkeywinks", "date": "September 9, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 176479452}, {"rating": 5.0, "stay_parameters": "Stayed September 2013", "text": "Club candan as a shop a gift shop a hair and beauty and a tattooist and turkish bath plus a small gym me and my partner had a turkish bath £10 each and child free", "title": "First time in turkey, first of many...", "user": "Applecheek", "date": "September 9, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 176441950}, {"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "Just got back from a week at the Club Candan in Marmaris. We booked very last minute and left the next day! Was a little apprehensive after reading some reviews but we went with no great expectations and had a lovey time. The apartments are spacious but basic. (Yes hard beds too, but a request for extra pillows helped.)They have a small kitchen area set aside in the living room with a fridge/toastey maker/kettle/mini cooker with 2 hot plates. (We didn't cook at all as it was cheap enough to eat out. Its end of season now so all the bars/restaurants/tours are reducing prices. We had a nice meal and a few drinks for @ £30 for 2, cant grumble!) The apartments also have a nice balcony and living area. Nice pool area too. My only gripe with the Candon is the bar/restaurant staff. As per previous reviews they really have no customer service skills and I found them totally unworthy of my money due to this. Shame really as the food they serve up is good! Loved Marmaris as a location. Plenty of friendly banter with resort staff vying for business but not in a pestering manner. I found a polite No Thanks always worked. We booked some tours with Mustaffa as recommended on here and had a very good albeit wet jeep safari and practically free moonlight boat trip thrown in for booking this. Like I said its nearing end of season so its probably the best time to go. We ate at Summer Rain, Bonos and Natalies steak house, again as recommended on here and all were good. (Bonos has a recommended reservation policy for Saturday nights!) I would recommend you taking English Money and changing it in resort as the pound is very strong at the moment and this was the recommended option but you can buy in Euros and pounds too. Weather was lovely. We only went to the beach once but didn't have a problem with dirt as per previous reviews. Sand is shingly so sea shoes recommended. Lots of people smoking everywhere so be prepared if you don't like this. We don't smoke and have a dislike of inhaling other peoples smoke especially when we're trying to enjoy a nice meal but with it being quieter you can normally pick a spot away from people! As for reviews about the mosque and its calling, we too were only woken on our first morning by it and found it didn't bother us after that. Earplugs helped :-) This hotel is really suited to families with small children. All in all had a lovely, cheap and cheerful holiday. Would go back.", "title": "They pronounce it Jandan !!!", "helpfulness": 2, "user": "Derbyshire-MrsS", "date": "September 22, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 178138812}, {"rating": 5.0, "stay_parameters": "Stayed September 2013", "text": "Just got back from my 1 week holiday and just wish I had booked 2.. We had the best week ever kids loved every bit of the holiday.. Rooms were very clean and tidy the maid did a great job room was cleaned and bedding and towels changed daily.. Pool area was great always got a sun bed and plenty to do for the little ones and even the adults the slide was great fun there is also a slide in the small pool.. Big up to the hotel entertainers Honey + Cookie my children have not stopped talking about them think they were fab with both kids and adults liked to get everyone involved in games and even took time to sit and play individual games with the kids was woken up with what my kids call the chicken song this morning off the CD we bought was like being back at the pool side well done both you are great..hotel staff were great just a pitty the bar staff were so grumpy they were the only downfall. Hair salon on site and photographer were also a great hit. Defo recommend for a 5 star family holiday :)", "title": "Fantastic!!!", "user": "rhad_n_munster", "date": "September 21, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 177990707}, {"rating": 5.0, "stay_parameters": "Stayed September 2013", "text": "Absolutely loved staying at the candan. we went as a family of 5. my children loved the slide and everything about the place. curlys the hairdresser is great too. would def be back. Thanks for a great week away.", "title": "BRILLIANT!!!!!!!!!!!", "user": "xdannixx", "date": "September 20, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 177947379}, {"rating": 5.0, "stay_parameters": "Stayed September 2013", "text": "Club candan is great cookie and honey are great as entertainers do lots of stuff with the kids and the rooms were nice and tidy overall my holiday wouldn't have been as it had been is cookie and honey weren't at the club candan", "title": "The club candan is a great hotel and cookie and honey are fab", "helpfulness": 1, "user": "Ciara_macdonald", "date": "September 20, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 177920117}, {"rating": 2.0, "stay_parameters": "Stayed September 2013", "text": "We have just come back from our 2nd visit at the Club Candan. Unfortunately, this visit was nowhere near as good as our first.", "title": "2nd visit - not great :(", "helpfulness": 1, "user": "sarahS1990", "date": "September 20, 2013", "detail_rating": {"cleanliness": 5.0, "value": 1.0, "location": 5.0, "service": 2.0, "rooms": 3.0}, "id": 177906563}, {"rating": 3.0, "stay_parameters": "Stayed September 2013", "text": "Hotel clean rooms are large food was resonable .not enough english speaking waiters .1st was ok 2nd week stomach bug me my partner 15 yr old son ....most of the hotel had it entertainers too .caused by leaving the food hanging around on the table before serving it ..in temp was high 40s ....there wasnt enough staff I was glad to get home ....Ispent 2 days in bed my partner 1 day too and my son back &fore toilet all time gripeing pains we couldnt keeo nothing down ....never felt pain like that before never again that was our 4th year to marmaris we never had any trouble like that before in fact we booking cyprus nxt year had enough of marmaris its put me right off ...", "title": "Never again", "user": "Morning321", "date": "September 17, 2013", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 3.0, "service": 2.0, "rooms": 4.0}, "id": 177549166}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "just got home after two weeks at club candan and must say the hotel was very good clean well looked after ,and friendly ,we had a room at the back of the hotel ,this was great as no noise,from the bar or the pool !!! and cool ,the staff at the main desk where very helpful ,its not far to town and the beach,now the down side ???don't change money in the hotel its a rip off ,don't get any shopping at the hotel shop its a rip off !! one packet of fags in the hotel shop was 14 ntl in a shop down the road same fags 5 nty ????breakfast in the hotel and coffee 25 nty in the queen vic down the road 7ntl and the staff at the queen vic are great fun and friendly and the food is great eat there its worth it ,unlike the hotel ,with rude lazy young boys that don't give a stuff !!!!and as for the so called entertainment ???well if you want 1960 holiday camp style then your ok but if not go out,as its crap !!not joking it is,and all some people did was sit around the pool and sod all else !!!! but as most of them looked like contestants from the Jeremy kyle show !!! and behaved like it to !!!!so go out there is lots to do and see and its so much cheaper and what ever you do don't go to eat at the summer rain !!!! the food is so bad ,and its dirty ,and it made us ill !!!! and get your trips out from a shop down the road ,or any where but in the hotel !!! much much cheeper ,marmaris is a fantastic place and I will go back ,and the hotel is good but just use it as a base and go out its so worth it ,", "title": "good and bad ???", "helpfulness": 2, "user": "bullet50cal", "date": "September 17, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 177500717}, {"rating": 5.0, "stay_parameters": "Stayed September 2013", "text": "First time to turkey and club candan really won it for us, there was lots of activities for all ages and lots to do, the entertainment staff were amazing and made us feel welcome, wouldn't be the same without honey and cookie", "title": "Amazing", "helpfulness": 2, "user": "SophereAndLee", "date": "September 15, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 177211351}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "Club Candan is the best place we have ever stayed at, never been to Turkey before but myself, partner and 4 kids loved every minute of it. The entertainment with Cookie and Honey was great, so much to do for kids, my 4 year old was in tears the night before we came home because he didn't want too and that was after a two week holiday, he got a fab haircut at Curlys who is such a nice man. There is lots and lots of places to eat nearby at very cheap prices, we will definitely be coming back here, got home on the 26th August and missing it already and the sun", "title": "Fantastic holiday", "helpfulness": 2, "user": "Mychelle2013", "date": "September 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 177196270}, {"rating": 3.0, "stay_parameters": "Stayed September 2013", "text": "Staff were great , pool was amazing , food was ok by the end of hol was fed up if it , location was a bit far from mamaris , because walking down was a nightmare , locals trying to pull u in to buy every step of the way was quicker getting a taxi , no bank near , only a very small shop ,which has a lovely man in it , but not good if self catering , and mosque right next to hotel was chanting out through the night and woke my children up", "title": "Ok ,", "user": "Welcrime1", "date": "September 14, 2013", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 2.0, "service": 3.0, "rooms": 3.0}, "id": 177094588}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled with family", "text": "Just back from our 6th consecutive stay at the Candan and we can't wait to book to go back again next year. Love it here, people are friendly right from the cleaners to the pool guys to the waiters and the bar men. Reception are available 24 hours a day. Our room was cleaned every day and fresh towells as well. Entertainers Honey and Cookie we're fab, best Entertainment there by far in the 6 years of us going. Ayhan, the restaurant manager kept us entertained as usual. We've made some really good friends with the staff there and look forward yo seeing them every year and we are always welcomed with a big hug and kiss. Jan was a fantastic waitor and was brilliant with the kids. Had yet another tattoo from Sait....he's amazing!!! Weather was unreal while we were there and the pol was very refreshing in 45° temperatures. We've made some fantastic friends there too. We met a fab couple last year and booked our stay this year to coincide with their stay and we had a blast. Met up again with a crazy bunch of Welsh folk that were there last year also. Another Neill holiday xx", "title": "Yet another fab holiday at the Candan!!!", "helpfulness": 2, "user": "MrsWinters", "date": "September 19, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 177821853}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with friends", "text": "Just a couple of weeks back from an absolutely incredible holiday. This was my second time to Turkey and to Club Candan, can't find a fault with either. The hotel is fantastic, and kept very clean. All the staff are very friendly and interact with everyone. Rooms are cleaned daily, and are fairly large and comfortable. The food was really good and a decent price, the waiters couldn't do enough for you, amazing. There is various activities on throughout the day, both in and out the pool, suitable for children and adults. The hotel itself is just a short walk/ taxi ride from the beach or from the bazaar and bar street. Can't wait to go back to Turkey and wouldn't even consider another hotel, 5 star all round!!!", "title": "AMAZING!!!!", "helpfulness": 1, "user": "Scoots501", "date": "September 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 177814867}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "It was our first time in Turkey and although we have no kids and the hotel was very family orientated, it did not stop us having a fantastic time there. The pool is brilliant with the large slide (perfect for adults lol!). Also the entertainers Honey & Cookie work really hard and make things fun and get people involved.", "title": "Lovely Hotel - Made the Holiday!", "helpfulness": 2, "user": "Steph892", "date": "September 18, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 3.0}, "id": 177697982}, {"rating": 5.0, "stay_parameters": "Stayed September 2013", "text": "I don't normally like getting involved with pool games etc. preferring to just chill out and sunbathe but the mood around the pool area was fun, with great music playing and things like water gym for ladies, lie-lo races, water polo and dancing around the pool - I found it hard to stay away! Also we had a huge stroke of luck and won a bit of money playing \"What's in the box\" a kind of Deal or No Deal type raffle game - all loads of fun. I never got to the pool before 10am and always managed to get a couple of sun-loungers for us - even though many of the Brits had reserved theirs really early!", "title": "Fab holiday again", "helpfulness": 1, "user": "red1971Wales", "date": "September 18, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 177611613}, {"rating": 5.0, "stay_parameters": "Stayed September 2013", "text": "The hotel room was immaculate, we were in Block A on the top floor with a pool-view room that was very clean with fridge, air-con in bedrooms, decent, powerful shower, TV and large balcony. The towels were changed regularly but bring your own loo roll as they don't replenish it!", "title": "Shamazeballs!!!!!!!!", "helpfulness": 1, "user": "Nicola G", "date": "September 17, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 177550434}], "location": {"country": "Turkey", "region": "Turkish Aegean Coast", "continent": "Europe"}, "stars": 3.5, "variance": {"poor": 17, "average": 58, "very good": 142, "terrible": 4, "excellent": 383}, "aka": "Club Candan", "slim_ranking": 0.0424028268551, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.0, "rooms": 4.5, "location": 4.5}}