{"user_rating": 4.0, "review_count": 82, "name": "Canmore Rocky Mountain Inn", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "Stopped over on the way to BC. Great room with twin beds, very clean and all the amenities you need. Particularly liked the small balcony. A great place to sit on a warm evening and watch the world go by. Morning breakfast great and thanks to the attendant for great conversation and a made you welcome attitude.", "title": "Service and accommodations were great", "helpfulness": 1, "user": "Brucezzz", "date": "September 4, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 139414212}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "The rooms was clean, with 2 x massive beds. We didn't have a mountain view, but the hotel was a 15 min walk in to town, which was pleasant on a nice day. There is a free continental breakfast which was great, as well as free wifi.", "title": "Nothing to complain about", "helpfulness": 1, "user": "Kerrance1", "date": "September 4, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 139380837}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled on business", "text": "*** I hope that this review is not against Trip Advisor rules as I do not have any business agreement with the hotel. This review is a culmination of observations over a period of more than 3 years and I receive no gratuities or benefits as a result.***", "title": "Mountains are for exploring, hotels are for sleeping.", "helpfulness": 2, "user": "Andrew B", "date": "August 29, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "location": 5.0, "service": 5.0}, "id": 138738298}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "I own one of the local towing & service companies. I have been dealing with this hotel for a number of years, since it was once called 'The Westridge'; bringing my customers in for rooms on last minute notice when I can not get them back on the road the same day. I have personally brought more than 30 customers to stay at this hotel and have never once heard a complaint!", "title": "Pleasantly surprised", "user": "Linda K", "date": "August 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 3.0, "location": 4.0}, "id": 138620227}, {"rating": 3.0, "title": "Price suits the quality", "text": "Both wild and planted flowers adorn the property, always ready for an after dinner stroll. There is enough room in the rear parking lot to fit (and turn around) almost any sized vehicle or combination of vehicles as well as heater plug outlets for those winter nights. The parking lot is also monitored 24/7 for security! (As a token of appreciation for the hospitality they offer my customers, I extend deep discounts to any of their guests that require automotive assistance.)", "user": "Iceman1966", "date": "August 20, 2012", "id": 137830586}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled with friends", "text": "This hotel was great - it's not too far from all the attractions of Canmore but it is quiet. Our room had a fireplace, and a small balcony which looked out onto another hotel, but you could still see the mountains. The room was quiet and roomy for two. The complimentary breakfast was among the best I have had. We would definitely stay there again.", "title": "Quiet gem in Canmore", "helpfulness": 4, "user": "booklovr", "date": "March 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 154525117}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "friendly service, good value for $. recent renos,gas fireplace in the room, cheaper than staying in Banff, continental breakfast great,its on the northside of the main road, away from the trains. bar fridge, and microwave in room. The front entry, has a large comfortable conversational area with fireplace, excellent idea, with updated furniture.", "title": "good value", "helpfulness": 2, "user": "Susan P", "date": "February 15, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 152228269}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "We had booked a one night stay here rather than going into Banff where the prices jumped overnight at least $30 for the hotels we were looking at (why do they do this???). As we were just travelling through the park on the way to BC from Edmonton we didn't want to spend a fortune! Unfortunately we had a huge snow fall in Edmonton and did not feel equipped to try the roads so we called Booking.Com to see if we could change the booking. The very helpful person there called the hotel and spoke with Ellen who said she would either cancel or change the booking which we really appreciated (the booking stated we would have to pay cancellation charges as it was just the day before). We decided to rebook and did in fact arrive safely the next day. We found Ellen at the front desk and she was once again extremely helpful and friendly. A great asset to the hotel we feel.", "title": "Great customer service", "helpfulness": 2, "user": "catloverSotogrande", "date": "November 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 145470360}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "The rooms were fine. Bathrooms are a little bit on the small side but clean and functional. The rooms have a gas fireplace which is wonderful and quickly warmed us up. Also a fridge and microwave which was a plus. A little balcony in the summer must be lovely to sit out on. There is a very nice large room with a huge log fireplace on the ground floor. It has comfortable chairs and a fantastic view of the mountains where you could sit and have coffee and read or access the wi-fi internet access which is throughout the hotel now.", "title": "Good Hotel", "helpfulness": 1, "user": "mshep87", "date": "November 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 145273593}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "The breakfast was good in the morning with more than enough choices. All in all we were very pleased to have found this hotel and again we really appreciated the fact that we arrived a day later than planned but we did not incur any extra charges.", "title": "Good value", "helpfulness": 1, "user": "Edu-Adri", "date": "October 18, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 143150796}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "Check in was friendly and quick; room was very large and clean. Although we faced the main street, we had a lovely view and it was quiet at night. The wifi was free and quite fast, and we very much enjoyed the continental breakfast, which had lots of options and plenty of seating. We would suggest, however, that the breakfast server try to keep the coffee and orange juice full! If we are in Canmore we will stay here again.", "title": "Clean, friendly property", "helpfulness": 2, "user": "Bandlady", "date": "July 17, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 167981566}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "If staff can sell a room then Canmore rocky mountain inn fits the bill. The front desk staff were so helpful and friendly that we decided to stay based on that alone. Once we got into the room we were very pleasantly surprised clean,nice mountain view and a great breakfast. Highly recommend staying here.", "title": "Great one night stay", "helpfulness": 5, "user": "Janos T", "date": "May 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 161002717}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "My boyfriend and I had a chance to stay at the Rocky Mountain Inn in Canmore during the first weekend of May and I have to say it was such a great little hotel. We received fantastic service from the front desk agent Ellen and made our stay very comfortable. The customer service from everyone at the hotel was great and the rooms were clean and comfortable. The complimentary breakfast was also very good. The hotel is older but has great mountain views and didn't feel dated at all. I would highly recommend this hotel to anyone!", "title": "Hidden gem in Canmore", "helpfulness": 2, "user": "Pantera791", "date": "May 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 160129981}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "Decided on a last-minute trip to Canmore over Easter weekend, so accommodations were somewhat limited. This hostelry turned out to be a real surprise. Okay, it lacks the basic facilities that so many other hotels in the area boast but it is warm and inviting, the staff are very friendly and it is spotlessly clean. They even throw in a continental breakfast at no extra charge. But the best bit: we rented a twin room for four of us (2 adults, 2 small children) for under $100 per night. Highly recommended if you're planning on a short stay.", "title": "An unexpected and inexpensive gem", "helpfulness": 2, "user": "Trevor E", "date": "May 7, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 160012501}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "We had decided to take a day trip to Banff on a Sat. afternoon. The day in Banff was great we spent some time shopping and had supper. when we left to go home to Calgary it started to snow as we reached the park gates. Twenty Ks past Canmore the traffic was at a stand still after sitting for 2hrs. we were able to turn around and get back to Canmore. We saw the Canmore Rocky Mountain Inn the sign said 79.00 a night they had a room so we decided to stay for the night. We told the Reception our situation they gave us tooth paste and directed us to a store around the corner to pick up other necessitys. We had a relaxing evening and a free contenental breakfast. We had never stayed in Canmore before we always stayed in Banff but we will be returning there again.", "title": "Stuck in a snow storm on our way home from Banff", "user": "Dale M", "date": "April 23, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 158618058}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with friends", "text": "We stayed here for one night on our way up to Jasper. The rooms were lovely and roomy and I loved the small balcony where we had a view of some mountains. The breakfast was also very good. Loved the waffle maker. Wifi Internet also stong which makes a change for the area. Overall I would recommend this hotel", "title": "Great stay", "helpfulness": 1, "user": "jeanwales", "date": "September 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 141461117}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled solo", "text": "From the moment I walked in the door at the Canmore Rocky Mountain Inn, I was impressed. The lobby was inviting and clean, and the front desk supervisor greeted me right away. She was incredibly friendly, personable and helpful, and actually ended up giving me a room with a better view. The room was clean and bright, and the bath tub was to DIE for. It was seriously the best one I've ever been in.", "title": "Great Room, Great Service", "helpfulness": 1, "user": "Star F", "date": "September 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 141275705}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "The bed wasn't the most comfortable I've ever slept in, but it wasn't awful. Overall, it was a great experience and I'd definitely recommend it to anyone, and stay there again!", "title": "Good Value in all respects", "helpfulness": 1, "user": "bigjim5551212", "date": "September 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 140597088}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "We stayed at this place in September 2012. The check in clerk was cordial and informed. He appeared to have some responsibility there. The room was comfortable and had everything you need including a fridge and a microwave. TV was good, bathroom was good. The continental breakfast was one of the best on our trip. They even had \"cook your own waffles\". I think this was the best value hotel on our trip. This place looks small on the outside, but it is large. They are doing construction in part of the building. There is an elevator which is convenient.", "title": "terrific", "user": "2012traveler2012", "date": "September 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 140503314}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "Clean and comfortable with a great breakfast. They had hard boiled eggs, a waffle maker, great cereals and muffins, yogurt, ham, roast beef and cheese.", "title": "Conveniently Located Hotel", "helpfulness": 1, "user": "matwaites", "date": "September 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 140124538}], "location": {"country": "Canada"}, "stars": 2, "variance": {"poor": 2, "average": 13, "very good": 36, "terrible": 5, "excellent": 26}, "aka": "Canmore Rocky Mountain Hotel Canmore", "slim_ranking": 0.484848484848, "description": "Cozy Hotel in the Canadian Rocky Mountains, Canmore, Alberta, near Banff National Park. 3.5 stars Canada Select. Retreat for vacations and conventions."}