{"user_rating": 4.0, "review_count": 60, "name": "Canterbury Inn", "reviews": [{"rating": 2.0, "title": "Why it's not a Luxury Oceanfront Resort", "text": "This place bills itself as a luxury oceanfront resort. Let’s deconstruct that.", "user": "jelleric", "date": "September 3, 2008", "id": 19688606}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "1. Luxury? Nothing about the room says luxury. The room hasn’t been updated in twenty years, and that includes the kitchen appliances, lineoleum in the bathroom, kitchen and bathroom cabinetry, and the furniture. The comforter on the bed is standard-issue two-star-hotel. The towels are sandpaper, there is no bedskirt, and the toilet seat didn't stay up unless I held it. There are thin walls, so thin that I heard two couples \"making noise\" simultaneously, in what I assume were two separate rooms. Finally, if a guest goes to the front desk of any “luxury” hotel and says that his party is leaving for the day, the front desk attendant should gracefully say “thank you,” then notify housekeeping. This attendant should not suggest that the guest return to his room and hang the “maid service please” placard from the door handle.", "title": "Best at Ocean Shores", "user": "zolokar", "date": "June 22, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 17126770, "likes": {"liked": "— cleanliness, great staff"}}, {"rating": 5.0, "title": "The Canturbury is my home away from home", "text": "2. Oceanfront? I suggest you pack a lunch before you walk to the beach. While it’s true that there are no other hotels or properties between the Canterbury and the beach, there is quite a bit of dunes to walk through.", "user": "betherbee", "date": "February 24, 2008", "id": 13798707}, {"rating": 4.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "3. Resort? This word means that the property is self-contained, and all a vacationer’s wants will be satisfied while remaining on-property. There should be food, drink, shopping, sports and entertainment. The Canterbury has none of these. There is no restaurant, no room service, no lounge, no gift shop, and no entertainment (though there is a social room with board games and puzzles).", "title": "Winter on the Beach get-a-way", "helpfulness": 2, "user": "LotsATravels", "date": "February 9, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 13411384, "likes": {"liked": "— Value, location and location", "disliked": "— Bed was too soft"}}, {"rating": 3.0, "stay_parameters": "Stayed July 2007, traveled on business", "text": "So you see, this property is guilty of misleading all of us. This does not mean the property is not without its merits. All rooms open up onto a lovely lawn, which was visited by a deer one day. I like the heater in the bathroom. I also appreciated the guest laundry and vending machines, with very reasonable prices for everything.", "title": "Canterberry Inn condos", "helpfulness": 1, "user": "guess1903", "date": "August 3, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "location": 4.0}, "id": 8316044, "likes": {"liked": "— It was close to the beach", "disliked": "— The noisy bikers and the older feel to our condo"}}, {"rating": 5.0, "title": "We will be back !", "text": "The first thing we noticed was the cleanliness of the front office and the surrounding area. The front desk people were very cordial and explained everything fully. When we entered our unit, we got a pleasant surprise as to the cleanliness once again. We noticed that the units that we looked at were decorated differently and not the same as most motels we have been in. The units were very well kept and were equipped with all the cooking utensils you might need to prepare a regular dinner. The hallways were also very quiet. All in all, we had a fun time at the Canterbury and will be back the next time we want to dig clams or just to relax.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "February 18, 2006", "id": 4468555}, {"rating": 5.0, "title": "Enough room for all!", "text": "We showed up without a reservation and with the whole family in tow, all 8 of us. The Canterbury Inn had a large room that fit all of us so we did not have the additional expense of a second room as usual. The full kitchen allowed for home-cooked meals and a better \"family\" experience.", "helpfulness": 8, "user": "A TripAdvisor user", "date": "July 21, 2005", "id": 3690163}, {"rating": 4.0, "title": "Older average 2 star Hotel with a good view.", "text": "The Inn is right on the beach and the kids had a blast. Grandma was able to walk with them. They say \"Create a Memory.\" Well, this is a fond memory we will all cherish for the rest of our lives.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "July 11, 2005", "id": 3655590}, {"rating": 5.0, "title": "You will keep coming back.", "text": "Signed, a future repeat guest.", "helpfulness": 8, "user": "A TripAdvisor user", "date": "June 17, 2005", "id": 3572530}, {"rating": 5.0, "title": "Like home, But with a beach view!", "text": "This Hotel is near the end of the Ocean Shores strip, very close to restaurants and beach access. We stayed in a 3rd story studio with murphy bed. The staff wasn't to helpfull. When asked questions about the small town they would pass you the directory or phone book. The cost was a bit high despite the good view.", "helpfulness": 7, "user": "pdey", "date": "May 31, 2005", "id": 3514807}, {"rating": 5.0, "title": "Home away from Home", "text": "The Canterbury Inn is a feel-good, relaxing home away from home. The view from our room (315) was breathtaking. Comfortable sleeping arrangements for all 6 of us in my family, we absolutely had a wonderful stay and always recommend it to our friends.", "helpfulness": 10, "user": "A TripAdvisor user", "date": "April 27, 2005", "id": 3419697}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "We try to find accomodations that allow us to eat at least one meal in....and with this unit's lovely ocean view, we took all of them in! Just like a one bedroom condo, but with maid service and with the ocean spread before us, there couldn't have been a better veiw in town. The unit had comfy beds and tasteful furnishings. The full kitchen was compact with every pot a cook might need. We especially liked that first cup of coffee on the lanai. Price seemed good, for a busy summer week and the staff very friendly. Great pool, warm for a change, and hot tub. Will very definitely go back.....maybe in the winter to better enjoy the fireplace.", "title": "Great value, with all the comforts of home...plus the beach!", "helpfulness": 3, "user": "PaulaLea", "date": "August 23, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5700562, "likes": {"liked": "— condo like feel with full kitchen and great view", "disliked": "— best deal is 2nd floor for view; first floor for little kids and dogs"}}, {"rating": 2.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "We stayed in a two-bedroom suite that was quite nice, with a decent view of the ocean. Our problem came after we got home from vacation. When checking in we initialed the \"$150 charge for smoking in the non-smoking room\" notice and the one member of our party who smoked made sure to be well outside and away from the building before lighting up. A week after our stay, when we were home halfway across the country, we get a bill for $166+ and a claim that there was a cigarette burn in a window screen. I immediately called and spoke to the clerk to dispute that fact, only to be told that they had pictures of the hole and of a cigarette butt in the trashcan. Those pictures could be years old for all we know, or the housekeeping staff could have smoked in the room, or it could all be a scam. But considering we did not take pictures of every inch of the room before we left, we cannot dispute their claim and will probably be out the $166, but we can make sure that anyone else who stays at this hotel makes sure to have the maid or clerk check their room before check-out and have documentation showing that you didn't smoke in the room. Be careful with this place!", "title": "Decent hotel, but beware", "helpfulness": 8, "user": "hobbitt_mn", "date": "August 17, 2006", "detail_rating": {"cleanliness": 3.0, "front_desk": 3.0, "location": 3.0, "value": 2.0, "rooms": 3.0}, "id": 5620268, "likes": {"liked": "— Two bedroom suite with living room and kitchen", "disliked": "— The fact that they falsely charged us for smoking in a room we did not smoke in"}}, {"rating": 3.0, "stay_parameters": "Stayed May 2006", "text": "My husband and kids spent the 3-day Memorial day weekend at the Canterbury. We reserved a one-bedroom suite. I checked the price on-line before calling the hotel to make the reservation (sometimes I get a better rate by speaking with real people) and was quoted $170 per night. The price shown on the website was $151 per night, so I obviously said \"no thanks\" and booked on line.", "title": "Nice People, Fair Location, Dingy Hotel", "helpfulness": 6, "user": "Julie23269", "date": "June 3, 2006", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "rooms": 3.0, "service": 2.0}, "id": 5294878}, {"rating": 5.0, "title": "wounderful great stay", "text": "There's a long grassy yard behind the hotel where kids could play, as well as several BBQ grills of the variety seen in public parks. Unfortunately, it rained so much the weekend we were there that our kids didn't have a chance to play in the yard, but it looked like a nice area for frisbee or kite flying, etc. Beyond the yard is a wild-ish patch of plants and then the beach. So, our view was okay. We saw water...but mostly yard and plants. The location was okay, but not wonderful. We set out to walk to the beach the first day we were there, and found that we had to walk a considerable distance to actually get to the water. So, we drove everyday from then on out.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "May 22, 2006", "id": 5191290}, {"rating": 5.0, "stay_parameters": "Stayed March 2006", "text": "The staff was very friendly, with the exception of one very grumpy old man. At one point, I heard a woman asking to be moved because her room was next to people with a loud baby. This gentleman grudgingly did this, and told her that that she would probably just be next to other loud children. We checked out right behind this woman, who was complaining that the gentleman raised her rate when he moved her room.", "title": "Wonderful stay!", "helpfulness": 3, "user": "ODuck", "date": "May 11, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 5055838}], "location": {"country": "United States", "city": "Ocean Shores"}, "variance": {"poor": 4, "average": 6, "very good": 21, "terrible": 1, "excellent": 28}, "aka": "Canterbury Hotel", "slim_ranking": 0.466666666667, "description": "On Washington's coast, The Canterbury Inn is the distinct waterfront lodging that brings the comforts of home and a beach vacation together. Right on the Pacific Ocean The Canterbury Inn features beach access, manicured grounds, BBQ areas, indoor swimming pool, spectacular ocean views, hot tub, guest laundry, pet friendly rooms, kitchens, flat screen TVs, gas fireplaces and more. Everything you need to kick back and relax."}