{"user_rating": 4.5, "review_count": 89, "name": "Cap d'Antibes Beach Hotel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "The hotel is very good. We stayed there two weeks and each day was fine. Rooms are comfortable. Plus they are new and clean. Very attentive personnel -- all requests were fulfiled fast and in full (flowers, car rental, reservations, etc.). Plage is good. Food and service in the Restaurant Le Cap is good. During week-ends plage restaurant was a bit overbooked, but the staff always found a place for us even if we did not have a reservation. Drinks on the beach were delivered within five minutes (no delays at all). I liked a pool zone. Very calm and relaxing. Les Pecheus is a remarkable place which attracts people from other towns on Cote d\"Azur. Good and worth each euro. The hotel itself is located in a very good place. On the one hand it's isolated from other plages on the other hand it takes 10 minute walk to get to the center of Juan les Pins with a very dynamic night life. Of course there are some minor flaws: gel and shampoo were not always replaced, taxi service to the hotel was quite expensive.", "title": "WE liked the place very much", "user": "Tourist_SVO", "date": "August 20, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 75999789}, {"rating": 2.0, "stay_parameters": "Stayed July 2010, traveled with friends", "text": "The rooms are very modern and completed very tastefully. They are looked after very well with only the small niggle that the bathroom amenities such as shampoo and shower gel were consistently not replaced. The reception and concierge were very helpful. The hotel is let down badly though by the abysmal food service (not in Les Pecheurs) but with the breakfast service and beach restaurant. Ordering simple items such as toast became a major exercise, and not just for our party. Another guest was so infuriated with the continuing slowness of the service, he chased the staff down the stairs and into the kitchen to demand breakfast for the rest of his family. The special lunch in the beach restaurant organised for our friend's birthday was a disaster with different orders turning up, and everyone getting their food at different times. It is clear the kitchen and the staff cannot cope with the numbers of guests. Couple this with one of the rudest beach managers ever, and you have a hotel of differing parts and varying quality. Complaints to the owner at the time were received well but little was done to alleviate the problems.", "title": "Lovely Hotel - Shame About the Beach and Food Service", "helpfulness": 4, "user": "Perspective49", "date": "August 18, 2010", "detail_rating": {"service": 1.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 75792165}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled with family", "text": "A charming hotel with a breathtaking view over the water and it's private beach. Just a 10 minute walk from the centre of Juan-Les-Pins. A staff that's so kind and helpfull and doesn't treat you as a number but as a person. Our room was off an incredible design and had all the comfort you would expect but even more. Me and my husband were there with our little son and really everything was taken care off. The food and it's presentation was outstanding and the service was excellent . We've found what we were looking for to have a stay worth our while .", "title": "A breathtaking and memorable hotel with a staff that makes your stay worthwile.", "user": "sebolijo", "date": "August 13, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 75012411}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "We stayed at this hotel at the end of July for 2 nights - we should have booked for a longer stay as it was perfect for a romantic getaway. We were greeted personally by the Manager and the staff were very friendly, helpful and they went out of thier way to make us feel welcome. The rooms are beautifully designed, the bed was very comfortable and the blinds closed properly to allow for a great sleep in in the morning. The food in the restaurant Les Pêcheurs was exquisite and worth every cent. If you are looking for a boutique hotel with an exclusive yet private feel about it I would highly recommend this hotel. We will definitely stay there again.", "title": "Wonderful hotel - très chic", "user": "Shopaholic37", "date": "August 12, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 74875506}, {"rating": 2.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "A great location and concept, the food is fantastic and many staff were memorable at the restaurant and the beach. Service is dire though. Reception/concierge is awful, sending us on a wild goose chase to a glass factory they recommended that was shut, forgetful room service and not having our rooms made for almost 48 hours... For a new hotel, it was also falling apart - one of our bathrooms did not have a door. The spa is also a massive understatement, there were no spa facilities and the massages were very average. We had 4 rooms in this hotel (3 suites) and even though it was a boutique, we still felt like we were a number. Shame, has a strong foundation and a lot of potential.", "title": "Has potential but poor service.", "user": "Tarek M", "date": "July 6, 2010", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 2.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 69862713}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled on business", "text": "We stayed for one night at this beautiful hotel - we were lucky enough to get a good offer, directly with the hotel. We would have happily stayed all week!", "title": "Gorgeous!", "helpfulness": 3, "user": "IOWtravelbabes", "date": "May 16, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 108509344}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "We received an extremely warm welcome by the Hotel Manager - possibly the best welcome ever.", "title": "Beautiful location, wonderful service - very relaxed atmosphere", "helpfulness": 1, "user": "Sibford-Ferrisians", "date": "May 12, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 107908954}, {"rating": 5.0, "stay_parameters": "Stayed May 2011", "text": "The location is beautiful, with direct beach access, a very chilled bar/lounge/dining area just off the beach, superb infinity pool and very comfortable sun loungers. Service was superb - incredibly welcoming, professional and quite relaxed. A special thank you to the gentleman who took our beach drinks order - he was really professional, friendly and welcoming as we arrived quite late in the afternoon, after lunch had finished.", "title": "A memorable stay at an intimate and stylish hotel", "user": "Platinum00", "date": "May 10, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 107692046}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "Our room was super - spacious and a very nice tranquil garden area, walking distance to the beach.", "title": "Fantastic Finale in Cap D`Antibes", "helpfulness": 2, "user": "phxdoc", "date": "October 15, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 83545321}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "We did eat at the hotel's restaurant which was a very nice experience - see separate review. It is expensive, but then the best things always are!", "title": "Chic meets beach meets Michelin star", "helpfulness": 1, "user": "WarwickshirelittleL", "date": "September 7, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 78666207}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "We only stayed 2 nights but in our experience the hotel was faultless. The staff were extremely helpful and welcoming. The rooms were a good size and nicely decorated albeit very modern. We only had a view of the gardens so if you can afford it I would pay more to get a sea view. The beach was small but very nice, with sand not stones, and plenty of loungers. The pool was for adults only which was a great idea as it was a nice quiet oasis to esape to. We only ate at the beach restaurant which was perfect for us right on the edge of the beach with uninterrupted views of the sea and fantastic food.", "title": "Wonderful", "user": "sjwoolnough", "date": "July 19, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115518227}, {"rating": 3.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "I was very disappointed. Hotel LOOKED great but didn't function great.", "title": "Disappointed - not quite up to the usual Relais & Chateaux standards", "helpfulness": 1, "user": "alondongirl", "date": "July 15, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 2.0, "service": 3.0}, "id": 115401831}, {"rating": 5.0, "stay_parameters": "Stayed June 2011", "text": "Service was friendly but besides the management level, the rest of the staff were not that \"switched on\".", "title": "Beautiful beach location", "user": "KAP526", "date": "June 11, 2011", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 112689117}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "Definitely not what I expected from a R&C hotel and at the prices they charge, I'd stay at the Hotel du Cap instead.", "title": "FANTASTIC !!!", "user": "Modiealaf", "date": "June 8, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 112125690}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "Beautiful beach location with modern rooms very creatively decorated. Private beach is great with comfy chairs but reserve your spot the night before to get a first row seat. Service at the beach is great and there is a restsurant that serves lunch and snacks (no dinner). Free wifi but had to keep our patio door open to get it to work (which wasn't bad given our sea view). Close walk or drive to town of Juan de les Pins. Only staying for two nights which is about right given the price.", "title": "Chic, Modern and worth every euro!", "helpfulness": 3, "user": "KHA1", "date": "May 18, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 108831044}], "location": {"country": "France", "region": "Provence", "continent": "Europe"}, "stars": 5, "variance": {"poor": 6, "average": 10, "very good": 11, "terrible": 1, "excellent": 61}, "slim_ranking": 0.0860215053763, "description": "The perfect venue to unwind face to the Mediterranean Sea.A little cove at the entrance to Cap d’Antibes, one boutique hotel of 27 Rooms & Suites Design, two restaurants – Les Pêcheurs & Le Cap (Beach Restaurant), a \"Summer Beach Wellness\" center and a fine sandy beach, a magnificent panoramic view stretching from the Lérins Islands to the Estérel mountains, everything you could possibly dream of. Enticing gastronomy and farniente, luxury and pleasure, dizziness and passion... all the temptations offered by the Cap d’Antibes Beach Hôtel are invitations to indulge in luxury and refinement."}