{"user_rating": 4.0, "review_count": 31, "name": "Cape View Motel and Cottages", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "We enjoyed our stay at the Cape View Motel. We stayed in the motel section of the property. The cottages looked good & if we were coming this way again and were planning to stay more than one nite, we would book a cottage. The location is great. A couple of minutes from the Mavilette Beach & a nice drive out to Cape St. Mary's lighthouse. The Cape View restaurant is near by & we had an excellent dinner. There seemed to be a lot of locals eating there also.", "title": "Relaxing Stay", "helpfulness": 1, "user": "kftw", "date": "October 3, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 3.0}, "id": 45761324}, {"rating": 5.0, "title": "Why go anywhere else?", "text": "This being my first trip to Nova Scotia I wanted to see all that I could in the time that I had,it is a beautiful place.Now that i have seen a great deal of the area,my next visit(and there will be one)will be spent at the Cape View on the beach relaxing and thinking about the next lobster im gonna be eating,its agreat place to just chill out.Carol and Russ are great people to.", "user": "KimHarvey", "date": "August 17, 2009", "id": 37978865}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled solo", "text": "I had spent the last two summers in this area as a participant in the well-known French immersion program at nearby Université Ste-Anne. When I first visited Mavillette Beach and saw this property, I told myself that I was going to stay there next time I was in the area. So this was the year!", "title": "Closest property to beautiful Mavillette Beach", "helpfulness": 8, "user": "Kinnereth", "date": "July 27, 2007", "detail_rating": {"cleanliness": 5.0, "front_desk": 4.0, "location": 5.0, "value": 5.0, "rooms": 5.0}, "id": 8244910, "likes": {"liked": "— easy access to beautiful beach, friendly owners; wireless Internet was a surprise and helped me keep track of weather forecast", "disliked": "— nothing at all, I was 100% satisfied"}}], "location": {"country": "Canada"}, "stars": 2, "variance": {"poor": 1, "average": 0, "very good": 7, "terrible": 4, "excellent": 19}, "aka": "Cape View Motel And Cottages Mavillette, Nova Scotia", "slim_ranking": 1.0, "description": "Cape View Motel and Cottages, Mavillette, Digby County, Nova Scotia, Canada is far enough away to be enjoyable, and yet close enough to have all the amenities of two Nova Scotia towns. Yarmouth is only 20 mile drive with Digby a mere 40 miles. Enjoy a comforting stay while exploring a picture postcard view of Mavillette Beach, Cape St., Mary's fishing village, lighthouse, Saint Mary's Bay and the Bay of Fundy!"}