{"user_rating": 3.0, "review_count": 264, "name": "Capitol Square Hotel", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed April 2007, traveled with family", "text": "Good hotel for a base within walking distance of Chinatown and Darling Harbour. Just off a busy road but no real problem with noise and within easy reach of bus routes to the Opera House, shops and Bondi. The room (Queen) was not exactly spacious but had a balcony and aircon; the bathroom was really very tiny but serviceable. Buffet style breakfast was more than adequate, and the guy on the Reception Desk was very helpful. Quite OK for a couple of nights stay.", "title": "Decent hotel within easy reach of Darling Harbour", "helpfulness": 2, "user": "JoFromBracknell", "date": "April 20, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 3.0, "rooms": 3.0}, "id": 7402782, "likes": {"liked": "— Convenience for central Sydney", "disliked": "— Busy road"}}, {"rating": 3.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "Paid 45 GBP per night, stayed for 4 nights. Hotel was perfectly fine, bed was soft and comfortable, didn't get any noise problems. Room and bathroom were clean - not at all kennel-sized. Had room for two large suitcases. Reception staff were really friendly and helpful - told us how to get to places and gave us internet sites for long term accomodation. Had buffet breakfast for $10 each, was very nice. Location is excellent - walking distance to chinatown, Darling Harbour, central station and CBD. I don't remember an Irish pub being downstairs but it's a large hotel so it may depend where your room is. All in all a perfectly fine stay - good value, great location. Obviously not the Ritz though!", "title": "Perfectly fine", "helpfulness": 2, "user": "A_Traveller27", "date": "January 8, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 6563977, "likes": {"liked": "— Location", "disliked": "— Couldn't book extra night for the same internet price"}}, {"rating": 1.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "We stayed at this hotel based on another website's reviews. Whilst it is close to Chinatown and next door to the Captitol Theatre, it has small (dog kennel sized) rooms, hard beds (I mean worn out not firm), cleaning standard is less than that of a backpackers. We stayed in Backpackers which have been better. I have stayed in may hotels in Sydney and have had better experiences at a cheaper price. This hotel should be more around the $60 per night mark.", "title": "DREADFUL", "helpfulness": 2, "user": "mdgalore", "date": "November 6, 2006", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 2.0, "cleanliness": 1.0, "value": 1.0, "location": 3.0, "rooms": 1.0}, "id": 6078998, "likes": {"liked": "— The Breakfast staff were friendly and location", "disliked": "— rooms and noise and dirty"}}, {"rating": 3.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "Oh, if you like noise and thin walls, this is the place for you with an Irish pub right underneath going on Friday to the wee hours of the morning. Sydney does love to show off the sirens the Government has paid for on the Police and Fire vehicles and these pass right up George street every hour at least.", "title": "Ok at the best", "user": "get_jessica", "date": "October 15, 2006", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 4.0, "location": 3.0, "rooms": 3.0}, "id": 5956513}, {"rating": 2.0, "stay_parameters": "Stayed September 2006, traveled on business", "text": "The Rydges in Camperdown, an old hotel near the Hospital, is MUCH better.", "title": "You get what you paid for!", "helpfulness": 1, "user": "MumTrav", "date": "September 23, 2006", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 2.0, "value": 3.0, "rooms": 2.0, "location": 5.0}, "id": 5828938}, {"rating": 4.0, "stay_parameters": "Stayed June 2005, traveled on business", "text": "I had an extended stay at this hotel, as I was in Sydney for 6 days of business and several more for pleasure. I stayed at this hotel as a conference-recommended hotel and it seems like a fine choice for a budget traveler. In response to one of the previous reviews, yes the TV seems to be reception-only (no cable or sat TV) but there were a number of stations and as a US-expat living in Asia I enjoyed watching Letterman and USA morning shows at the wee hours of the morning – so the reception and channels were fine enough. The location is pretty good – you can easily walk to places like Darling Harbour and Hyde Park (both about 15 mins walk away). There were many and frequent buses right out at the street that take you directly down to Circular Quay (5 min bus ride). There are a ton of restaurants in the area – especially if you crave Asian food (there are plenty of non-Asian choices also). There is a major grocery store 2 blocks away – and keeping yourself well-stocked was no problem and very convenient. I was not a fan of the breakfast – the choice is somewhat limited. Although the setting is bright and cool, I only ate breakfast there as it was a convenience on working days. The young staff was very friendly and helpful – and after so many days I had a lot of contact with them. One downside was that some guests seemed to attempt smoking in their rooms (which is not allowed) and set off the fire alarm - - this happen at least twice and having to evacuate is not a pleasant experience. Overall, it was a pleasant stay. While initially I was not sure I could stay for so long in a small room, it grew on me and I quickly grew to like it.", "title": "Good Budget Hotel", "user": "BanaPona", "date": "July 8, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "service": 4.0}, "id": 5438837}, {"rating": 2.0, "stay_parameters": "Stayed May 2006, traveled on business", "text": "Booked this hotel on line and asked for a non smoking room. Upon entering the room it was evident that it was a smoking room - there was an ashtray sitting on the TV ! My husband went down to reception and complained about the smell - we were quickly moved to a larger non smoking room. Bathrooms are very small and there was no water pressure in the shower. Breakfast was okay..The reception area is very small and looks like it needs a revamp and not very impressive and if there are lots of people checking in it gets very cramped. I have stayed at better hotels nearby for the same price.", "title": "Good location but not sure I'd stay there again", "helpfulness": 1, "user": "Heckle", "date": "May 24, 2006", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "rooms": 2.0, "service": 2.0}, "id": 5205339}, {"rating": 4.0, "stay_parameters": "Stayed May 2006", "text": "I booked Capitol Square due to it's price and location. I wanted a basic but clean hotel right in the city. That is exactly what I got - not much more.", "title": "perfect location, slightly above average hotel", "helpfulness": 2, "user": "beachbunn-e", "date": "May 19, 2006", "detail_rating": {"cleanliness": 2.0, "value": 4.0, "rooms": 3.0, "service": 4.0}, "id": 5181469}, {"rating": 3.0, "title": "A superior pension", "text": "The staff were very friendly and helpful. The lady at reception gave me great ideas on where to site-see, and how to get around.", "helpfulness": 2, "user": "wingate", "date": "March 27, 2006", "id": 4736622}, {"rating": 3.0, "stay_parameters": "Stayed March 2006", "text": "The room was small, but nicely decorated. Didn't try the food, but I checked out the breakfast buffet and it looked good.", "title": "Location & price both good", "user": "CraigAsh", "date": "March 20, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "service": 3.0}, "id": 4694984}, {"rating": 3.0, "title": "Good Location - furniture a bit tired", "text": "Stayed here for 4 nights in mid February and one night in March (liked it enought to return!). Hotel well located close to Chinatown (great food)and the pleasant pedestrianised walkways to Darling Harbour (fantastic evening venue). Short walk to City Monorail and around 20 minutes along Pitt Street (the main shopping street)to Circle Quays Harbour and Opera House. Supermarket/ travel companies and internet cafes all around. As already reported reception is tiny but there was a locked room to store lugage. Staff helpful and friendly. Rooms compact with furniture looking a bit tired but nonetheless clean. I found the hotel to be suprisingly quiet expecially considering its location close to George Street/Pitt Street and I am a very light sleeper. An interesting Restaurant with a good breakfast choice. Overall I reckon this hotel was very good value for money and would certainly use again.", "user": "Jim100Uk", "date": "March 11, 2006", "id": 4600490}, {"rating": 1.0, "title": "Avoid this Terrible Hotel !!!", "text": "Me and a friend had the misfortune of staying at this hotel. The location is rubbish - there is nothing of interest nearby. There is only ONE lift for the entire hotel to use which is utterly ridiculous. The receptionist is extremely rude - he doesn't even bother to say hello when you greet him. When you walk into the hotel the first thing you see is tons of luggage lying around as there is no storage room. Anyone can walk off with somebody else's suitcase. The rooms was VERY small - the floorboards creak and the reception on the TV was appalling - unwatchable. The beds are uncomfortable. The hotel was FREEZING - we had to wrap up before going to have breakfast in the mornings.", "user": "Traveller2006", "date": "October 26, 2005", "id": 4053773}], "location": {"country": "Australia", "continent": "South Pacific"}, "stars": 3.5, "variance": {"poor": 44, "average": 95, "very good": 62, "terrible": 52, "excellent": 11}, "aka": "Capitol Square Sydney", "slim_ranking": 0.740540540541, "description": "Capitol Square Hotel, Sydney's best value economy hotel is ideally located within Sydney’s CBD with a range of attractions at our doorstep. We are a 3 star rated property, conveniently located adjacent to The Capitol Theatre complex.We are also just a short walk from Darling Harbour, Sydney Entertainment Centre, Central Station and China Town. Our comfortably appointed rooms will ensure you enjoy your accommodation whilst in the Harbour City."}