{"user_rating": 4.5, "review_count": 712, "name": "Carlton George Hotel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "Stayed for 2 nights last week with friends booked to stay with us for the second night, for a special ocassion. We live in Spain but are originally from Glasgow. Picked the Carton George from the Web choice of Glasgow Hotels. As it was a special ocassion I booked Club rooms for all. Was a little disappointed in the size of our room (511) but the standard was 1st class. Our friends room (309) was larger (thankfully as I would have rathered their room was) and again 1st class. We found the staff were pleasent and courtious. A friendly smile and hello from every member we met, and a high visible number of staff for such a small hotel. The big chap at Reception does need to smile a bit more and I can see he might be seen as \"unfriendly\", but his efficiency and courtesy to us could not be questioned. All other reception staff were very pleasant. As for a previous comment regarding the \"bribe\" of alcohol, I can only comment that I found this aspect highly welcomed, especially as we found Glasgow (or rather I think the UK), very expensive compared with our adoptive Country Spain. We didn't milk it for all it was worth but the Crystal decanters and six glasses in the rooms were a classy addition and the well stocked mini bar, which I think we used for three cold drinks only, was again a great addition. We have stayed at many 5 * Hotels throughout the world and have never received complimentary drinks on this level, especially considering the excellent Executive Lounge 24 hours a day. The staff in the Exec Lounge were very helpful and attentive as were the staff in Windows at both dinner and breakfast. Dinner could not be faulted in either presentation; choice or quality and neither could breakfast. I had read a comment about breakfast being \"ordinary\", well quite frankly how anyone could regard it as so, beggars belief. Yes it might be a little slow, but that's the price you pay for freshly cooked food as opposed to the poor \"buffet\" food offered generally these days to enable quality staff to be cut to the minimum. Again two more 5* assets. Have also noted 2 recent negative comments which I think have to be looked at in perspective. Standard rooms in Hotels can frequently be \"disappointing\" when Hotels strive to publicly meet the more diserning clients requirements in enhanced rooms. And I don't think \"standard\" usually would be expected to include crystal decanters of spirits and a stocked mini bar as complimentary. Everywhere, you only get what you pay for, and we found we certainly got that, in spades, although we will have paid more than those who choose not to. I hope those disappointed folk enjoy the fruits of their complaints. I, despite this, am glad I found nothing to complain of. Well seen this little gem, is picking up well deserved rewards.", "title": "Excellent Experience", "helpfulness": 4, "user": "WillinSpain", "date": "October 16, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5959901, "likes": {"liked": "— Quality of the room and excellent food", "disliked": "— absolutely nothing"}}, {"rating": 1.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "I stayed at the Carlton George in September for my wedding anniversary and wished i'd saved the money and stayed at home.", "title": "What a let down...", "helpfulness": 7, "user": "ellies1", "date": "October 14, 2006", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 3.0, "value": 1.0, "rooms": 1.0, "location": 3.0}, "id": 5955217, "likes": {"liked": "— Location", "disliked": "— Staff"}}, {"rating": 1.0, "stay_parameters": "Stayed September 2006", "text": "Having read all the mostly great reviews here on trip advisor I thought i was onto a sure thing.", "title": "If you have booked with Superbreak read on", "helpfulness": 3, "user": "LittleTink", "date": "October 7, 2006", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "rooms": 1.0, "location": 4.0}, "id": 5924229, "likes": {"liked": "— the location", "disliked": "— dark uninspiring room"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2006", "text": "Wrong.", "title": "Central location - great", "helpfulness": 1, "user": "shaz3466", "date": "October 6, 2006", "detail_rating": {"front_desk": 2.0, "business": 4.0, "service": 3.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 5922483, "likes": {"liked": "— central location", "disliked": "— Restaurant to expensive"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "First ly let me say that my Husband i were married in 2002, since that time due to work commitments we have not been able to take any time off together to get away, secondly we are both hotel managers ourselves (although only in a lowly 3 star establishment, not 4 stars like here!) so we are only to aware of how this industry works.", "title": "Excellent Stay", "helpfulness": 3, "user": "croney", "date": "September 27, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5882093}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled with friends", "text": "My friend and I stayed at the Carlton George at the start of November as a belated 40th birthday treat for her, a rare chance for both of us to have some time to ourselves away from work, hubbies and kids.", "title": "Great Break!", "helpfulness": 4, "user": "rareNItraveller", "date": "December 2, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6317824, "likes": {"liked": "— Great room", "disliked": "— No luggage storage room"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled with family", "text": "Got bus in from airport and it stopped directly outside hotel - great start!", "title": "Quality hotel", "helpfulness": 1, "user": "dawsontraveller", "date": "November 23, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 6169089, "likes": {"liked": "— The quality of the rooms", "disliked": "— The parking"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "Although we arrived just after 10am our room was ready. We had booked an Executive room, but were given a free upgrade to a club room, because of my friends birthday. Brilliant!", "title": "Comfort and style in Glasgow", "helpfulness": 1, "user": "Havering", "date": "November 4, 2006", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 3.0, "rooms": 5.0, "location": 5.0}, "id": 6055694, "likes": {"liked": "— interior design", "disliked": "— inward facing room (which was changed for us)"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "After a busy day shopping, we went to the Executive lounge on the top floor for a drink. Spent a lovely hour and a half here in front of a lovely fire, reading supplied magazines, and having our glasses automatically refilled each time they emptied (free!). Returned to our club room and watched the complimentary movies on TV.", "title": "Lovely Night at The Carlton George", "helpfulness": 4, "user": "KirstyBella", "date": "November 2, 2006", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6046932, "likes": {"liked": "— Executive Lounge", "disliked": "— Room not ready till 3pm"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2005, traveled as a couple", "text": "Lovely large room overlooking West Geroge Street. thought it may be a bit noisy but didn't hear a thing. Best bed I have ever slept in!", "title": "fab engagement pressy!!", "helpfulness": 3, "user": "kandis", "date": "October 23, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 6001427, "likes": {"liked": "— Scottish Feel", "disliked": "— -"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "This was our first and last hotel during our trip to Scotland, we arrived and departed from Glasgow. About a 15-minute taxi ride from the airport, costing about 17 pounds. Located in the middle of downtown Glasgow next to bus and rail stations, shopping mall and outside attractions and shops.", "title": "Very Nice", "helpfulness": 3, "user": "MarkWiz", "date": "September 2, 2006", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 5762052, "likes": {"liked": "— big rooms and clean", "disliked": "— billing inaccuracy, poor a/c"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "My Wife and I satayed at the Carlton George during an overnight stay in Glasgow. We were stuck between this hotel, the Raddison and Langs but plumped for this after all the great reviews it received. We booked a club room which was big enough for the 2 of us. The check in desk staff were very helpful and welcoming and the overall decor and ambience was great. The added extras in the room were a total bonus. Free Whisky, Gin, Sherry and mini bar. The room was only set for 1 when we got there but staff were quick to amend. We had a dressing gown each and lovely cosmetics for my wife. There could have been 2 of each glass and maybe a wine glass but total bonus of not getting conned by very overpriced mini bar. The hotal is in a cracking location if you come by train but think it woudln't be so good if you drove as there is a bit of a hike to the car parks in central Glasgow.", "title": "Great location, Great added extras", "helpfulness": 2, "user": "busastep", "date": "January 29, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6712865}, {"rating": 4.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "The club room is a little tatty but gives you somewhere to relax and have another complimentary drink and again - makes you feel very pampered.", "title": "Great location & polite staff", "helpfulness": 2, "user": "sunseeker14", "date": "January 28, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 5.0}, "id": 6709644, "likes": {"liked": "— Great location", "disliked": "— View from bedroom"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "The room wher ethey serve breakfast is really impressive. High above the skyline you get to see Glasgow waking up and all teh steam and busstle from the buildings. The breakfast could have been a little better - some of the quality of the food wasn't as good as you would expect by the rest of the quality elsewhere but it was ok. Staff were excellent throughout the hotel.", "title": "Will certainly visit again", "helpfulness": 1, "user": "beaver66", "date": "January 26, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6700145, "likes": {"liked": "— everything", "disliked": "— didn't stay lont enough"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2007", "text": "We booked the Carlton George based on previous reviews and were not disappointed.", "title": "nice extras", "helpfulness": 2, "user": "Mike025", "date": "January 9, 2007", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 5.0, "rooms": 5.0}, "id": 6570371}, {"rating": 4.0, "stay_parameters": "Stayed November 2006, traveled with friends", "text": "A big plus point is the great location, just off one of the main shopping streets in Glasgow, we didn't have to take a taxi anywhere but to the airport during the weekend.", "title": "Worth the Money", "helpfulness": 1, "user": "MollyMacSporran", "date": "December 3, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 6321105, "likes": {"liked": "— Location", "disliked": "— Lighting in Bathroom"}}], "location": {"country": "United Kingdom (UK)", "continent": "Europe", "city": "Glasgow"}, "stars": 4, "variance": {"poor": 22, "average": 57, "very good": 210, "terrible": 16, "excellent": 407}, "aka": "Carlton George Glasgow", "slim_ranking": 0.0804597701149, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 5.0}, "description": "Based right in the heart of Glasgow, adjacent to Queen Street Station and Buchanan Street and with the airport bus service stopping right at our door, we are the perfect city centre base. We are four star rated, and each of our 64 bedrooms feature a complimentary Minibar and decanted spirits, multi channel LCD TV with Sky Sports 1, 2 and 3, desk, and bathroom with bath and power shower to ensure you have a comfortable and relaxing stay while you are with us. WiFi is free for the duration of your stay, and so are local phone calls. National calls are just 3p per minute. Located on the 7th floor of the hotel, Windows is Glasgow’s only rooftop restaurant. Windows Restaurant serves delicious dishes created with local produce with menus changing to reflect what’s in season. In fact, the food is only matched by the view over the rooftops of Glasgow! Breakfast is served in Windows in the morning, or can be delivered to your room for no additional fee. Guests can enjoy complimentary soft drinks, snacks and coffee throughout the day, and complimentary wine, beer and selected spirits each evening in the Executive Lounge located on the 7th floor. The lounge also features the Thomson Boardroom, ideal for meetings or private dining for up to 14 people. At the Carlton George Hotel we’ve worked hard to create a comfortable and informal setting where you can make yourself at home and relax, but still experience fantastic service."}