{"user_rating": 4.5, "review_count": 421, "name": "Carlsbad Seapointe Resort", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "this review coming from a 12 yr old, it only makes i more phanomenol. this is the BEST hotel ever!!! everything about this place is great, the food, the rooms, the service, the senery, the pool, EVERYTHING. we have a timeshare here for once a week and its the best part of our summer. (the 11 hr drive is totally worth it) its great for kids with at least 10 activities to do everyday, not to mention the ping pong table, pool table, and fuze ball table! every time you go there the experience is amazing. everyone there is totally nice and helpful. i can't describe how amazing this place is, so youll just have to find out for yourself!!!", "title": "You havent lived until you've come to this resort!!!!!!!!!", "helpfulness": 1, "user": "Izzy K", "date": "January 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 122833077}, {"rating": 5.0, "stay_parameters": "Stayed January 2012", "text": "The resort provides activities to do while you stay with them: tennis, mini golf, basketball.. you can pick up the equipment at the activity center next to the lobby. The gym is open 24hrs but you have to use the back door to get in late hrs. The adult pool is spectacular as well as the kids pool.So, the resort is green by having automatic timers on the lights, fireplace.. ect. The service was very friendly and helpful which will make us go back again. Oh! A few things.. no pets allowed and check out time is 10am. Train tracks in the back of the resort; not loud enough to be a bother plus they do not pass often..", "title": "Resort going green..", "user": "locomotion11", "date": "January 7, 2012", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 122725094}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "We travel every year to Carlsbad and stay at the Seapoint resort. It's a fabulous location which close to shopping, restaurants and area attractions. We also go up the to the Los Angelesarea and it takes about a hour and half depending on traffic. The views of the ocean from the Seapointe are beautiful. We couldn't think of a better place to stay.", "title": "Great Location", "user": "902LDCollins", "date": "January 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 122663834}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled with family", "text": "The accomodations were very good. We stayed in a 2 bed 2 bath unit that really ccould sleep 7 if you don't mind close quarters. The unit had 1 double & 1 single in the one bedroom, a king bed in the master bedroom and a pull out sofa in the livingroom. The kitchen was large with granite counter tops and gas stove. There was tons of cupboards in the kitchen...but they were pretty dated and worn (early 1990's I am guessing). Both bathrooms were very large. The master bath even had a deep jet tub. Our room was very close to the pool and the play area for the kids. Which worked great for us with young kids. There was secure underground parking and laundry avaliable at the resort too. The staff was very friendly and eager to help. The one and only complaint I have is that the kitchen could have been stocked a bit better... there was only one dish cloth and tea towel and there was very few cooking utensils. other than that it was a perfect unit.", "title": "Comfy", "user": "sunsoaker78", "date": "January 6, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 122637482}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled with family", "text": "My family (5 adults 1 teen) shared a 2 bdrm unit for Thanksgiving week and every one had a great time. My wife and I are multi-time visitors, we want to keep CSR our secret, but they work very hard and always excel. Beach access you can't get elsewhere, great views, close to everything in SoCal, restaurants and shopping nearby.", "title": "Carlsbad Seapointe Resort- yes please", "user": "Henry C", "date": "January 4, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 122538649}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "This is an absolutely fabulous resort. We were greeted at the registration desk by Phillip Gaitan, who was extremely friendly and helpful. His personality started off our stay there on the right foot. The room was beautiful, perfect with kitchen, double sinks in the bathroom, spa tub, shower, living room with a gas fireplace, and a nice balcony with table and chairs, overlooking the ocean. Room was super clean. Carlsbad Outlet Mall was right across the freeway from the hotel. Lots of restaurants in the vicinty. perfect place for a vacation. And upon leaving, we were so happy to see Phillip again!", "title": "Beautiful, Peaceful, Clean, Safe", "user": "Iris R", "date": "December 15, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121781182}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled with family", "text": "We planned a family reunion and booked three 2-bedroom condos. The staff worked hard to accommodate our requests to be near each other and have an ocean view. The resort is well maintained, and the everyone was committed to assisting us in meeting all of our needs. The only negative is the noise from the train track in the back and the road that has traffic at times in the front. There's not much that can be done about that, but it wasn't negative enough for us not to want to return to this lovely place by the sea. Our family did find it a place to come together and enjoy each other's company.", "title": "Where land and sea inspire to unite", "user": "Marge E", "date": "December 1, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 121270747}, {"rating": 5.0, "stay_parameters": "Stayed October 2011", "text": "I used this location for my wedding. The site was beautiful. My representative Rosalie, was awesome. The customer service from the front desk staff to the cleaning crew was superb. The views of the beach from the reception room was great.", "title": "Beautiful location for a wedding", "user": "Eceinoj", "date": "November 1, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 120038261}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "Got an oceanview condo. Right there on the ocean in the quaint town of Carlsbad. Everyone is extremely accomodating, accomodations are very nice, has everything in the kitchens that you need. Very roomy with masgter bedrooms, kings, dining areas, full kitchens.They also have lots of daily activities for all ages.All have good size balconies to enjoy your meals or morning sunrise coffee, or even sunset wine. Has a travel desk to help with sight seeing arrangements. Very close to Carlsbad Village where there are lots of restaurants and shops. This is not too close and not too far from anything, just placed right so you can have a little more privacy from all the hussle and bustle not to mention great ocean views. It is family friendly but also has adult only pool and spa. No pets, service dogs only.", "title": "Best oceanview and quiet", "helpfulness": 2, "user": "monetkids", "date": "October 31, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119996878}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "We're leaving on our last day after a week of staying here at the Carlsbad Seapointe Resort. They offer everything you could possibly need and if you need more - just ask the great staff!! There is free underground, gated, secure parking and lots of additional parking in the cul de sac right out front. We overlook the ocean - listen to the sound of the surf everyday and night. They have daily activities - fun and very informative. The Coaster Train Poinsettia statiion is right behind the hotel but the sound is barely noticeable. It is a short drive or longer walk to the station to take it down into San Diego - very much worth it instead of fighting the busy freeways. Carlsbad Blvd is out front and it will take you to the local shopping and restuarants. We took a one hour drive up to Newport Beach for a Whale Watching tour with Davey's Locker .(Visit their website for information and discount coupons)The king bed is very comfortable -the seperate double vanities make geting dressed very uncrowded . There is a seperate jacuzzi tub and shower, in the bathroom..They have a fully stocked kitchen ,free WiFi and Ipod dock and 2 TV's in the suite.There are seperate adult and family pools and the adult pool was heated and overlooking the ocean, as well as a huge hot tub. BBQ's on premise as well as lots of covered patio tables if you want to eat downthere..We will definately come back here again - our new Southern California, \"Home away from Home\"!!", "title": "Great Resort with everything you could need!!", "helpfulness": 1, "user": "patriciab48", "date": "October 16, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119356232}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "we loved seapointe. jae at front desk, and andrea in activities were pleasant , and informed young employees. the amenities were terrific! gas stove , and very well equiped kitchen. we had jacuzzi in our suite, and wonderful view of the ocean. suite 217. the sunsets were wonderful. walking on the beach {which was so close}, relaxing , and refreshing. loved the fact that there were 2 pool areas -one for famillies , and one for the adults. enjoyed the farmer's market in carlsbad.", "title": "great location", "helpfulness": 1, "user": "sunset60", "date": "January 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 123576167}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "a highlight of our stay there was sailing with captain les , who owns the osession--an experience not to be missed!!", "title": "Fabulous!", "user": "Bev W", "date": "January 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 123339403}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "can also catch the coaster behind the resort. for $5.50 return , can go to old town , and then take trolley to balboa park, midway air craft carrier ,coranado island, little italy etc. all in all a place we'd like to return to . barb and bill canada", "title": "Near the beach with comfort", "user": "DennisSAnkeny_IA", "date": "January 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 123319127}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "The staff always ask,\"Did you enjoy your stay?\" The answer is \"Always!\"", "title": "Good Location, Uncrowded Beach", "helpfulness": 1, "user": "Barry356", "date": "January 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 123137913}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled with family", "text": "Staying at Carlsbad Seapointe Resort is beyond wonderful. The ambiance of the resort the staff, especially \"Jae\" at the front desk. If you want something done or answer's ask Jae . He will professionally, calmly with caring kindness make things happen.", "title": "The best resort ever!", "user": "Vall1017", "date": "January 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 123037642}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "Had a fabulous Friday night in So. Cal this week (Dec 30th). Our stay at Seapointe was very enjoyable and relaxing. The staff was friendly and check in was a breeze. When wanting a suggestion for a restaurant they had many ideas and helped us decide on a great Italian place.", "title": "What an enjoyable stay!", "helpfulness": 1, "user": "Cheri O", "date": "January 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 122427916}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "I don't know where I have ever encountered a resort where the entire staff was so friendly and accommodating. The least of hint of something I might need or enjoy and it was a done deal, withourt even asking. Staff were outgoing and smiles were the norm. The accomodations were clean, very well maintained, comfortable, and very pleasing in decor.The best of all though was the BED- a comfort foam bed. I slept like a princess. Other amenities were there and convenient- parking, internet, pool, jacuzzi. And the location was beautiful right accross from the ocean, close to town but secluded too. I highly recommend the Carlsbad Seapointe for a great travel experience.", "title": "Awesome Service", "helpfulness": 1, "user": "Suzanne C", "date": "December 21, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121951160}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "This resort lets you call in the morning to get an est. time of when your room will be ready.", "title": "Great relaxing get away!", "helpfulness": 1, "user": "caligirl175", "date": "December 21, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121946147}, {"rating": 5.0, "stay_parameters": "Stayed December 2011", "text": "I was able to check in around noon even though they said check in was at 400 pm", "title": "Peaceful and beautiful setting.", "user": "nama211", "date": "December 21, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 121938573}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "I reserved a 2 bedroom 2 bath condo and had requested an Ocean View.", "title": "Nice in every way.....", "helpfulness": 1, "user": "DarrenJonesOC", "date": "December 17, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 121838469}], "location": {"country": "United States", "city": "Carlsbad"}, "stars": 3, "variance": {"poor": 16, "average": 26, "very good": 67, "terrible": 11, "excellent": 301}, "aka": "Carlsbad Seapointe Hotel Carlsbad", "slim_ranking": 0.294117647059, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "Carlsbad Seapointe Resort offers an unbelievable location for visitors visiting San Diego. These vacation condos sit along some of the most beautiful beaches in Southern California, and are within easy driving distance of LEGOLAND California, SeaWorld, the San Diego Zoo and the Wild Animal Park. After a day of sightseeing or enjoying the sand and surf, relax in your own one or two bedroom designer-decorated condo. With an average of 800 square feet of space, beautiful balcony views, and a romantic fireplace, you can rest and unwind while listening to the sound of the ocean nearby. Guests can enjoy on-site amenities including swimming pools, a spa, fitness room, activity center, basketball, volleyball and tennis courts."}