{"user_rating": 4.5, "review_count": 184, "name": "Carrygerry Country House", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "Carrygerry is a beautiful setting right near the airport, a perfect way to begin and end a trip to Ireland. The rooms are well appointed and the food is superb. Moreover, Carrygerry Country House went out of their way to help us, after we had an incident with lost passports. We'll never forget their kindness. Highly recommend you stay there. Larry + Alice.", "title": "Very memorable stay at Carrygerry", "helpfulness": 1, "user": "Alice A", "date": "July 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 169231029}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with friends", "text": "The staff at the Carrygerry Country House was fantastic. The property was just what we wanted. The sheep and cows lowing in the evening was a pleasant touch! We stayed here the first two days of our 10 day self-guided tour of Ireland. Gillian provided us with a pint when we arrived and gave us great advice on things to do in this beautiful country. The breakfast was great. To top it all off, we accidentally left our electricity converter in our room. They had found it and asked how to forward it to our next stop on our itinerary. It was waiting there when we arrived!", "title": "First rate service!", "helpfulness": 1, "user": "Chris P", "date": "July 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 169001617}, {"rating": 4.0, "stay_parameters": "Stayed July 2013", "text": "After evaluating the four places that we stayed on our trip, the overwhelming consensus was that this was our favorite stop!", "title": "One of the best airport hotels...", "helpfulness": 1, "user": "flying_dutchman_US", "date": "July 24, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 5.0}, "id": 168922303}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "This place is great. It is a family run country house close to Shannon airport. We had a fantastic room. The breakfast was great and the people were very nice. The outside of the house needs some maintenance and painting. But the inside is perfect. We enjoyed it very much.", "title": "Great Experience at Carrygerry House", "helpfulness": 4, "user": "Jim T", "date": "June 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 164710191}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled on business", "text": "We reserved a room at Carrygerry House on both ends of our recent trip to Ireland . It's located just 10 minutes from Shannon Airport so it is very convenient. Gillian and Niall treat you like family and do whatever they. Can to make your stay enjoyable -- including setting up a special early breakfast for us due to an early. Morning departure.", "title": "A fantastic breakfast --not far from Shannon", "helpfulness": 2, "user": "Tvbobdeb5", "date": "June 18, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0}, "id": 164431092}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "We recently stayed here for one night before an early morning flight out of SNN. The map and directions on the web site are accurate but not drawn to scale – keep going past the other houses and you’ll find it. Service was friendly and efficient – even the dog seemed happy to see us; our room was in the old carriage house and was spacious, well decorated, comfortable, and equipped with a large bathroom (plenty of hot water and pressure – our best shower in Ireland!). Because of the thickness of the wall we could not access the wi-fi signal in our room; we carried our phones and laptop into the lounge and had not problem connecting", "title": "Wonderful deluxe option near SNN", "user": "JohninDC", "date": "September 30, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 179192673}, {"rating": 3.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "The bar and restaurant were wonderful; service was good and the food was exceptional. The wine list had a variety of fairly priced options and we enjoyed every bit of our 3-course fixed price menu. We would stay here again!", "title": "A good option in Shannon, where options are limited...", "user": "kokosandiego", "date": "September 24, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 178506570}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "We chose this hotel due to TA reviews and also that we had very little choice in Shannon for our last night in Ireland. I must say driving up to the property we were very disappointed, the exterior is shabby and in dire need of paint and attention. We almost drove away, I later learned the owners are slowly having things repainted and had to remove ivy on the walls, therefore the shabby appearance. This is a very old farm house, built around 1790...we like these places full of character and ambiance and we give well deserved credit to the owners for the attention, effort and money they are putting into their hotel. However, for the price we paid for our room, I do not feel we received the commiserate value. It is an old house, that understood, and again one sees that it is being painted inside also and care is being given to refurbish a difficult property to maintain. But they are not quite there, yet are charging to be there, in our humble opinion. We were first shown a room in the annex across a rather shabby courtyard, this room was quite dark, not inviting at all, so chose a more expensive option upstairs. This room was brighter and had been decorated, but in keeping with an old house which is ok, but not great comfort...bath, bed, sitting area etc. Public areas are dark, and dark colors were used in repainting and fabric. We did hear their restuarant is good but did not dine there. All in all, much credit is due the owners as I have said, and eventually with the paint and new carpet on the stairs (this was very worn and sort of a turn off) and other details, it will be a very nice option...", "title": "Great Place Near Shannon Airport", "helpfulness": 1, "user": "Steven B", "date": "September 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 177309477}, {"rating": 5.0, "title": "Magical", "text": "location is nice , away from the airport area, sort of out in the country, and we visited a pub (Honk Pub)very nearby..one of the best pubs we visited on our trip...clean, cozy, fireplace..friendly folks! Give it a try!", "helpfulness": 1, "user": "William D", "date": "September 15, 2013", "id": 177247337}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "Some folks have said they had a difficult time finding the Carrygerry Country House but if you just", "title": "Great place to stay close to Shannon", "helpfulness": 2, "user": "riverworld", "date": "September 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 176333778}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "This was our second stay with Gillian, Niall and Charlotte of the Carrygerry Country House and it was once again a lovely experience. Our room had a lovely front-facing view of the grounds and was beautifully decorated - not to mention very comfortable for sleeping. The food is delicious and fresh with very generous portions. We arrived much too early for our check-in as we came straight from Shannon Airport and a flight that came in an hour early. We were welcomed just the same at 8:30 am, provided with a pot of tea and cookies and invited to rest in the front parlor until our room was available (Carrygerry was full the prior night). Couldn't have asked for more even in a country as friendly and welcoming as Ireland!", "title": "Best of Irish Hospitality", "user": "Europophile", "date": "August 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 172368983}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with friends", "text": "CARRYGERRY is a lovely country B&B. You'd never know you're 10 minutes from Shannon airport. it was such a racing way to spend our last day in Ireland. We had a large room with two beds (which can be tricky to find in a B&B) and our own bathroom. It w a s built in the 1700s so it's not modern, but then again I wouldn't want that in Ireland. The food is a whole different story....delicious doesn't give it justice. Dinner ends at 9pm, so check in before then so you can taste the yummy food. Come hungry because the portions are huge or plan to split your dinner. Yummy!!", "title": "Lovely, quiet and yummy!", "helpfulness": 1, "user": "Lisa A", "date": "August 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 171717493}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "We had been in Paris and London and arriving at this beautiful inn was a complete, much needed, Irish change of pace. The hosts, Gillian & Niall, couldn't have been more accommodating and helpful with tremendous service and solid sightseeing advice. The rooms were spacious and the beds were very comfortable. The breakfasts and dinner we had in the restaurant were excellent. Staying at the Carrygerry was like having our own Irish family, their friendly son Paddy and dog Rocky added a personal touch to a otherwise delightful stay.", "title": "Refreshing stay after city life!", "user": "Andy M", "date": "August 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 171551516}, {"rating": 3.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "We had reservations to accommodate our whole family here for the final night before our flight back to the US. We did pick a tough night for reservations as it was the start of a bank holiday weekend in Ireland. The rooms were off the outside courtyard and were mediocre at best, not anything like any of the photos shown on the website. I felt like I was inside of a motel 6 or something. The bathrooms were better but none of our showers drained and I was afraid we were going to flood the bathroom floors. When I mentioned this to one of the staff members she said she was surprised as she had not noticed this...... I was underwhelmed with the rooms. The breakfast was lovely although only Gillian was serving everyone and one table was running her ragged with special requests so we didn't get any particular attention.", "title": "Not what I expected", "helpfulness": 2, "user": "Curtainlady34", "date": "August 4, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 5.0}, "id": 170770938}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "I loved driving up the drive to the front of this beautiful house and being ushered into a cute lil bar cum waiting room. I knew this was going to be good.", "title": "Amazing Resturant with beds", "user": "Nichola D", "date": "July 31, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 170174793}, {"rating": 5.0, "stay_parameters": "Stayed June 2013", "text": "Had private party for 20 guests and attention to detail was just superb", "title": "Special place for a special occasion", "user": "Merc350sl", "date": "August 30, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 174806671}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "A very special place for those that recognises the character, friendliness and professionalism of a warm country home from home", "title": "Perfect country house/hotel.", "user": "Robbie M", "date": "August 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 174299135}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "One of those special old country homes that oozes with charm and just great food at a very realistic price", "title": "Amazing dinner and nice room", "helpfulness": 1, "user": "TravelingSmythes", "date": "August 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 5.0, "location": 4.0}, "id": 173794621}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled solo", "text": "An idyllic Country House Hotel for a relaxing getaway.", "title": "Beautiful property, excellent staff", "helpfulness": 1, "user": "RosalindNYC", "date": "August 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 173413763}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled on business", "text": "Only two and a half hours from Dublin, with the aid of Google Maps Carrygerry House is easy to find.", "title": "Beautiful setting, warm hospitality, worth a visit.", "user": "timcarr38", "date": "August 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 172944839}], "location": {"country": "Ireland", "continent": "Europe"}, "stars": 3, "variance": {"poor": 4, "average": 8, "very good": 27, "terrible": 5, "excellent": 140}, "aka": "Carrygerry Country House Hotel", "slim_ranking": 0.1}