{"user_rating": 3.5, "review_count": 136, "name": "Carriage Inn", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed June 2012, traveled solo", "text": "My recent trip to San Francisco was my first experience with a hotel on the west coast. In trying to find a hotel within walking distance of the Moscone center, I started to realize that anything was going involve some kind of compromise based on reviews and pricing- shiny new hotels in sparkly neighborhoods were all going to make my wallet cry. If you can afford somewhere else, go for it. If not, this place may be nicer than some of the other hotels in the area.", "title": "Close to Moscone center", "user": "ibmman", "date": "September 3, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 139311139}, {"rating": 2.0, "stay_parameters": "Stayed August 2012, traveled on business", "text": "I flew into SFO and took the BART to the market street station that's near the hotel. Despite being a very small guy, trying to find the hotel while staring at google maps on my phone at around midnight, I still managed to get to the place without being accosted or mugged. Market street isn't bad, but some of the side areas can seem imposing until you get a feel for the place. Well, even then, there might be some lingering concern for personal safety. My solution was to walk very fast, and sometimes run. Your mileage may vary. There were a couple of spots between the hotel and Moscone that weren't great, but I didn't bother anyone and they didn't bother me. As for hotel security, the \"lobby\" is a small entrance room always attended by someone. You need a room key for the elevator. If you're coming back late or checking in late, the person at the desk will have to unlock the door for you.", "title": "Dirty, noisy, run down in a very sketchy neighborhood.", "helpfulness": 1, "user": "ktmoon", "date": "August 31, 2012", "detail_rating": {"service": 2.0, "cleanliness": 1.0, "value": 3.0, "sleep": 1.0, "rooms": 2.0, "location": 1.0}, "id": 139023684}, {"rating": 2.0, "stay_parameters": "Stayed July 2012, traveled with friends", "text": "I booked at the last minute and didn't realize I had booked a double room and not just a double size bed, for just myself. Even if it was more than just me, the room would have been plenty big still. The theme is a nice idea but in execution is a halfhearted retrofit of an old building that still feels oldish. I don't know if the A/C worked (if there was any?) since I didn't use it. I usually tethered my phone to my computer because it was faster than the hotel wifi internet service. The bathroom was large but on the dimly lit side. All the fixtures worked fine. I don't recall any issues with cleanliness overall, and I didn't have the room cleaned while I was there. If you're really sensitive to noise and get a street-side room, you might want to get ear plugs as the windows don't insulate sound well.", "title": "Ok Hotel--HORRIBLE Area", "helpfulness": 4, "user": "Erin F", "date": "July 21, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 2.0, "rooms": 3.0, "location": 1.0}, "id": 135026351}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled solo", "text": "I received tickets redeemable for breakfast items at a cafe just a little ways down the street. It's a nice little cafe! You'll know it when you see it, it stands out as it's pretty new... the breakfast ticket covers a reasonable array of stuff but I didn't have much time to try much more than bagels and bananas. Coffee was pretty good.", "title": "Nice stay but poor acoustics", "helpfulness": 2, "user": "Luc V", "date": "July 10, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 134065930}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "Theres a hotel immediately across the street that's also a Best Western (the Americana) with more facilities that you can use if you're in the Carriage Inn. The CI doesn't have a fitness room/pool but the Americana does- and you can use it if you talk to the front desk people in the Americana and get a key for the elevator over there. It's a small fitness room but I wasn't familiar enough with area to map out nice long run routes, so I went with the elliptical instead. It worked. I saw the pool but didn't use it.", "title": "An unexpectedly charming place", "helpfulness": 1, "user": "cbs02", "date": "July 6, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 133627035}, {"rating": 3.0, "stay_parameters": "Stayed January 2012, traveled on business", "text": "My trip got off to a rocky start. The flight was delayed, I had a 45 minute wait for my shuttle. And while I was waiting for my airport shuttle, all I could think was how nice and comfy my room would be when I finally arrived.", "title": "Nice room, Bad service!", "helpfulness": 7, "user": "K60455", "date": "February 9, 2012", "detail_rating": {"service": 2.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124358771}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled with friends", "text": "Well Yes the room was nice, comfy, and beautiful. But check-in was a bit of a hassle. When I booked my room I assumed it was 100% paid for. The email that I printed said \"Charged $507\". I guess I needed to read between the lines. So when I checked in the guy asked for a credit card to charge the full payment and a deposit. I told him about the email and I said", "title": "Great value Good Location", "helpfulness": 4, "user": "Tom11_78", "date": "February 6, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 124233459}, {"rating": 3.0, "stay_parameters": "Stayed January 2012", "text": "I stayed at the Best Western Hotel Carriage Inn - San Francisco May 11 but I have read that theere have been some renovations done since then. i thought it was a great hotel, the rooms are very interesting and each has a theme so a little different. There is no restaurant and breakfast is minimal but there are places to eat nearby so no big deal. Advantages are the cost, very close to Union Square and the cable car and it has a carpark underneath which was handy as I had a hire car. The staff were friendly and the place was clean. Room had a great bathroom and all the facilities you need.", "title": "Good place if you need parking and to be close to Moscone", "helpfulness": 2, "user": "swami12", "date": "January 31, 2012", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 3.0, "service": 4.0, "rooms": 4.0}, "id": 123936840}, {"rating": 3.0, "stay_parameters": "Stayed December 2011, traveled with friends", "text": "I used the Best Western chain many times during a driving trip through California and Nevada. I found them always to be good quality and reasonably priced. Most had laundry facilites which was handy. Breakfast normally included. Basic but all you need.", "title": "3.5 - a good stay overall", "helpfulness": 3, "user": "bobotheoboe", "date": "January 8, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 2.0}, "id": 122791575}, {"rating": 4.0, "title": "Well placed for a quick holiday", "text": "Attended MacWorld last week & spent 4 nights here. We chose it for the walking distance to the Moscone center and on site parking (and price). The room (Ken Keesey) was quite large so that was nice for a long stay. Very clean and nicely appointed, good bed. Service was friendly and helpful. Wished for more ice machines! Neighborhood has some troubled folks and such but we expected that. Wifi was good but you have to keep logging in :-(", "helpfulness": 1, "user": "QldTraveller62", "date": "December 29, 2011", "id": 122213513}, {"rating": 2.0, "stay_parameters": "Stayed April 2012, traveled with friends", "text": "Stayed here for a few nights the rooms are really nice, and all very funkily decorated. However, the service is TERRIBLE. Doorman wouldn't help with luggage (even with offer of a tip) and I had to deal with all my bags myself. Got locked out and they didn't want to give me another key (plastic?! what's the big deal?) Let me stand in the street by myself for 30 minutes trying to flag a cab (they said they couldn't order one), gave me wrong directions etc. However, the cleaning staff were fabulous, it was mostly the front desk personnel that ruined my stay (I want to specify the male ones, the one lady i interacted with was great)", "title": "Great hotel, terrible service", "helpfulness": 1, "user": "alliecat83", "date": "May 13, 2012", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 3.0}, "id": 129894817}, {"rating": 3.0, "stay_parameters": "Stayed April 2012", "text": "PROs: Location- walking distance to Civic centre and downtown SF. However, there are similarly priced hotels in the same area. Parking is $5 per night which is cheap. We paid around $120/night for a room with 2 double beds which I thought was a good price. But as the saying goes- you get what you pay for!", "title": "Great location, but a very old motel with poor insulation.", "helpfulness": 1, "user": "deepest_blue17", "date": "May 11, 2012", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 4.0, "service": 3.0, "rooms": 3.0}, "id": 129782357}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "CONs: Poor insulation! We could hear every single footstep from the room above! Unfortunately they must have a toddler that loved to run up and down the room at 7am! This woke me up for 3 days straight! The hotel itself is old. The decor is a bit tacky for my liking and the room was crowded. The bathroom needed an upgrade & we could hear every time the room next door flushed! Overall, I wouldn't stay here again. I know it was cheap, but I would pay the $40 extra a night for a Holiday Inn express up the road.", "title": "Great hotel in the City", "helpfulness": 1, "user": "friendlygnome", "date": "May 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 2.0}, "id": 129707464}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "Let me just start by saying I hate San Francisco and I was sick as a dog during my stay. With that being said, this was a great place to catch some sleep. Hotels are a hit or miss in San Francisco and I'm so glad I picked this one. Parking was easy and cheaper than most hotels in the city. I slept soundly with no noise from other rooms which was amazing considering it seemed to be a full house. The provided soap, shampoo, conditioner, and lotion were a really good quaility. Custom Burger across the street was great for dinner. The hotel is within walking distance to a lot of things, but it's also easy to catch a cab to take you where you need to go. I'm rating the location low only because it's not necessarily in an area that you'd want to walk around in (especially at night), but kudos to the hotel for doing everything they can to make up for that. You needed a room key to enter the lobby and use the elevator so the place was very secure. I unfortunately didn't make it to breakfast but it's provided at a cafe a few doors down. I also didn't use the in-room fireplace which had a provided duraflame log. The downside to this is that I'm pretty allergic to wood smoke and the room had a lingering smell from the fireplace, but that's to be expected with a woodburning fireplace in the room. I didn't think I could get any sicker than I already was though so it didn't matter much. The hotel and the room had a boutique feel with each room being named after, and decorated for a different author. Our room was a little funky with some crazy colors and 70's style decor, but I liked it because I knew that each of the rooms were different. All in all the place was great and helped to make my night in San Francisco a little more bearable. If I ever need to go back to the city, I'll definitely be staying here again.", "title": "Good hotel!", "user": "Vic2riaKiev", "date": "April 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 128506766}, {"rating": 5.0, "stay_parameters": "Stayed March 2012", "text": "Nice hotel and very friendly staff! Good location. Parking is a plus. The only minus was that breakfast was just a cup of tea or coffee + muffin (for me it was OK, but for my family - 3 guys - definitely not!). But on the other hand they do not have enough place for placing folks for breafast.", "title": "Nice hotel for the price!", "helpfulness": 3, "user": "Eaebersold", "date": "March 31, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 127041024}, {"rating": 4.0, "stay_parameters": "Stayed October 2010", "text": "After having booked this hotel we were mainly concerned with its location that was supposed to be in a bad neighbourhood. Though we did see some scruffy looking people in the nearby blocks we did not experience any discomfort, a taxi was never needed and Union square a 10 minute walk away.", "title": "A hotel with a little personality", "user": "Gnopps", "date": "October 11, 2010", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 3.0, "service": 4.0, "rooms": 5.0}, "id": 83064595}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "Upon check-in we were upgraded to fireplace rooms. The roms are decorated in a way not seen very often in american hotels and are a good break from standard business furniture. Staff was friendly and breakfast almost non existent.", "title": "Great Hotel, not so good location", "user": "AdamsFamilyX4", "date": "August 10, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 2.0}, "id": 74601110}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "All in all we were very happy with this hotel.", "title": "loved it and loved SF", "user": "LukasHeart", "date": "July 29, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 72822900}, {"rating": 3.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "We travelled to SF for 5 nights with a 17 and a 13 year old for the start of a three week holiday. We thought this hotel was a short walk to Union Square. It was actually only 15 minutes but it was in a location that had a lot of homeless people and beggars etc. They did not bother us and it was OK to walk in during the day but we got cabs everywhere when it was dark. The hotel was great, very comfortable and clean and the front desk staff were very good and helpful. There was a great diner across the road that did super breakfasts and great burgers. It also had a bar.", "title": "nica hotel bad area", "user": "kerridwen82", "date": "June 14, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 2.0, "sleep": 5.0, "rooms": 5.0, "location": 1.0}, "id": 67470826}, {"rating": 3.0, "stay_parameters": "Stayed March 2010, traveled with friends", "text": "It was good value for money, great room, staff, just wrong location. But nevertheless a good find.", "title": "Nice hotel, scary area", "helpfulness": 1, "user": "VP007", "date": "May 25, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 1.0}, "id": 65312370}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "This was our first time to San Francisco. This hotel is a great location and we found getting around really easy; With buses and trams are not far. We stayed here for 3 nights and we enjoyed my time here that we stayed again on our way home. The staff were all polite and helpful in directing us where to go. The rooms are great! Very comfortable for one or more people. Very clean.", "title": "First Time In San Francisco", "helpfulness": 1, "user": "WellyPotato", "date": "June 22, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 132560268}, {"rating": 2.0, "stay_parameters": "Stayed June 2012, traveled on business", "text": "As another reviewer mentioned, seedy neighborhood, but relatively safe. We did not have any problems while we stayed here.", "title": "If you need internet connections, stay away", "user": "Hankscott", "date": "June 5, 2012", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 131375154}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled solo", "text": "There was no noise that kept us up at night, we both got good night sleeps.", "title": "Good base to explore downtown San Francisco", "user": "GypsyKingBrussels", "date": "June 3, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 131183944}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled solo", "text": "Having free internet access and breakfast was a great plus for us as well. The cafe is on the corner and is great.", "title": "Reasonably priced, but a bit off the beaten path", "helpfulness": 1, "user": "Noxgear", "date": "May 21, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 2.0}, "id": 130377412}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "I liked this place in many respects -- comfortable and moderately priced room, close to Folsom street and all it has to offer. But trying to gon online, which was essential for work, was near to impossible. I spent hours (quite literally two hours) trying to get a connection. Finally did, but it didn't last. Problem occurred with my MacBook Pro, my iPhone, and my iPad (which never connected). Big issue, I think, is this hotel and its sister hotels nearby used Lodgenet, a very crappy internet service (which also offers the most incomprehensible and difficult to navigate TV service possible).", "title": "Glad we chose this hotel", "helpfulness": 3, "user": "Laurie F", "date": "May 19, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 130229243}], "location": {"country": "United States", "city": "San Francisco"}, "stars": 3, "variance": {"poor": 9, "average": 32, "very good": 70, "terrible": 3, "excellent": 22}, "aka": "Best Western Plus Carriage Hotel", "slim_ranking": 0.48085106383, "description": "The Carriage Inn features 48-rooms and offers a witty, warm, and sophisticated escape from the ordinary. Featuring guest rooms saluting San Francisco's notables eccentric notables and drawing inspiration from the \"carriage\" of a typewriter, the hotel provides a San Francisco experience well suited for vacationers, theater patrons, convention goers, couples and business travelers alike.Located in the vibrant South of Market (SoMA) district, the convenient location provides quick access to many of San Francisco's top attractions and destinations including Civic Center Plaza, Moscone Convention Center, Union Square, Westfield Shopping Centre, the Theater District, and Cable Cars that will take you to Fisherman's Wharf and Pier 39."}