{"user_rating": 5.0, "review_count": 332, "name": "Carriage House Provincetown", "reviews": [{"rating": 5.0, "title": "This is a fantastic place to stay - we'll definitely come again.", "text": "Fantastic accommodation, excellent service, fab breakfast.", "user": "simonfromlondon", "date": "August 14, 2007", "id": 8419283}, {"rating": 5.0, "title": "Love staying at the Carriage House Inn", "text": "Beautifully restored old property just off the main drag but its peaceful and quiet.", "user": "Bikenut67", "date": "August 7, 2007", "id": 8369718}, {"rating": 5.0, "title": "A beautiful and relaxing place", "text": "Angus and Ken are friendly and helpful and Bradley the dog is a cutie.", "user": "janinesays", "date": "August 2, 2007", "id": 8279714}, {"rating": 5.0, "title": "Loved the Carriage House, Provincetown", "text": "We will definitely go back and recommend to all our friends.", "user": "Kershel111", "date": "July 17, 2007", "id": 8136593}, {"rating": 4.0, "title": "Great location, Hospitable staff", "text": "We've stayed at the Carriage House Inn 3 times in 4 years and have always had a great experience. The hosts are friendly and accomodating. Love the lemonade in the afternoon, the fresh quiches for breakfast, the quiet location and the tastefully decorated rooms.", "user": "Calrugger", "date": "July 17, 2007", "id": 8133746}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "My partner and I decided at the last minute to spend a long weekend in Provincetown for the film festival. We researched online and found that the Carriage House had one room left. We were not sure what to expect.", "title": "Comfortable, Relaxing and In the Center of It All", "helpfulness": 1, "user": "bbjj0827", "date": "September 9, 2007", "detail_rating": {"cleanliness": 5.0, "front_desk": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 8681788}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled on business", "text": "The Carriage House was absolutely perfect and we'll definitely stay there again. The house was located on a side street of Commercial Street, convenient to the main buzz of activity, although perfectly quiet. The host was very sweet and hospitable – and loved giving helpful suggestions (restaurants, shows, etc). At the end of our stay, he volunteered to drive us to the wharf to catch the ferry home – much easier than dragging your luggage down Commercial Street.", "title": "Excellent accomodations", "user": "DENjax", "date": "August 29, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 8536605, "likes": {"liked": "— rooms and location"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled on business", "text": "Breakfast was the bomb – and unexpected. We were just looking for a place to sleep, not expecting to be fed very morning. Cereal, toast, fruit, quiche, coffee, juice, baked good, etc. Honestly, we were psyched to be eating freely in the mornings. Oh, and fresh lemonade was available every afternoon – loved it.", "title": "The Best in Provincetown", "helpfulness": 1, "user": "miko222", "date": "August 27, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8517320}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "The room was average sized and quiet – the bed was the best. Our room was located in the back near a patio. While other guests ate breakfast in the patio, we didn’t hear a thing, although using the bathroom was a bit unnerving.", "title": "Wonderful place!", "user": "Tagless", "date": "August 26, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8509832, "likes": {"liked": "— Is overall a nice place to stay", "disliked": "— Can't think of anything I didn't like"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "If we’re looking for an Inn or a room for the weekend, we’re definitely staying there again. Next time I’ll remember to take pictures to post on TripAdvisor.", "title": "Carriage House ....would stay here again", "user": "67Strath", "date": "August 14, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8421159, "likes": {"liked": "— felt like home", "disliked": "— nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2007", "text": "Carriage House was very nice and clean with a good host. The floors were a bit creaky, but that adds character. The TV is small with a limited channel selection, but there is a VCR and plenty of movies to watch if you are staying in your room. Cell phone reception is limited, but the internet access works well. Loved the remote control air conditioning controls and spacious deluxe room with a separate living area and private deck. The only down side was the smell of cigarette smoke from an adjoining room. Parking is also only offered with deluxe rooms, so if you book a standard room you will have to find parking at a pay lot. Location is very close to the main business district with no noise. Breakfast was very good, but don't expect a heavy breakfast with any kind of meat.", "title": "Nice and Convenient", "helpfulness": 1, "user": "TravelPartnerDC", "date": "July 16, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 8131154, "likes": {"liked": "— Closeness to business district and space in the room.", "disliked": "— Cost and demeanor of person on the phone for booking"}}, {"rating": 5.0, "title": "Brilliant Place felt like home", "text": "I would stay again.", "helpfulness": 1, "user": "THESMITHSONTOUR", "date": "July 9, 2007", "id": 8082013}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled with friends", "text": "After a long trip from Niagara what a welcome we received. The most cleanest comfortable room I have stayed in a long time. My husband and I were treated excellent. Absoluteley loved Provincetown, really bohemian and exciting. Our accommodation made this trip really worth while. Angus and Ken were the nicest people you could wish too meet. The breakfast was fabulous and they made us feel like we were at home. Little touches meant so much, like the Patio, the internet use and the conversation. Well done! would whole heartedly recommend. Please dont miss this.", "title": "Great Place!", "user": "TicoBoy", "date": "July 7, 2007", "detail_rating": {"front_desk": 3.0, "business": 5.0, "service": 3.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8071983, "likes": {"liked": "— Nicely Cared for Bed and Breakfast, Clean and Peaceful", "disliked": "— N/A"}}, {"rating": 5.0, "title": "It's a Gem!", "text": "Marion and Alan Smith England.", "user": "lld225", "date": "July 5, 2007", "id": 8065157}, {"rating": 5.0, "title": "Wonderful stay", "text": "Great location. We were hosting our friends from Costa Rica and wanted them to see Provincetown. The Carriage House was quite nice. Clean with all of the amenities. We loved the resident dog. The location was excellent. Walking distance to everything. We met wonderful people. We loved the German's. When we visit P-Town again, we will definitely stay at the Carriage House.", "user": "saezas", "date": "July 5, 2007", "id": 8059035}, {"rating": 5.0, "title": "The best of P-town!", "text": "We've stayed in a lot of places in Provincetown, but The Carriage House is by far the absolute best! Ignore the thing about a \"continental breakfast\" -- it's a HUGE breakfast with just about anything you could want. They have coffee and soda available all day. If you want to go to the beach, you can borrow their chairs and towels. They have a hot tub that's to die for. I can't say enough good things about it, except that the service you get is second to none.", "user": "PBLKNP", "date": "July 4, 2007", "id": 8055678}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "Carriage House is located in the West End of Provincetown, very close to Commercial Street's shops, restaurants and cabarets but on a quiet residential street. We stayed in what was considered one of the smaller rooms at the B&B, but really it was quite roomy. The beds and linens were so comfortable, with feather pillows and a down comforter, and the central air was great for the summer. We made use of the hot tub during our visit, and Carriage House lent us beach towels to take with us to Race Point (the Shuttle that travels from Commercial Street to the Provincetown Beaches goes right by the property). The breakfast there was a pleasure, especially the blueberry bread. Thank you so much for making our mini-honeymoon so special!", "title": "Great getaway from Boston", "user": "meuri", "date": "July 3, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 5.0, "rooms": 5.0}, "id": 8052229}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "My boyfriend and I stayed at the Carriage House for four nights over a long weekend - it was the perfect choice.", "title": "The best place to relax on the Cape", "user": "graycat17", "date": "July 3, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 8051303, "likes": {"liked": "— quiet, relaxing and beautiful", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "The location can't be beat - about 2 houses off the main street with all the restaurants and night life, but tucked down a quiet lane so the noise doesn't filter into the rooms.", "title": "Why are we telling you?", "user": "JimHackett", "date": "June 30, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8029324, "likes": {"liked": "— Everything", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "The building is gorgeous, but comfortable - and I wish I could take the room home with me. Really nice lounge area in the back deck, where we had breakfast every morning. The main part of the house and the guest rooms are cleverly separated to give privacy, but still retain the small inn feel.", "title": "Wonderful Carriage House", "user": "PauVon", "date": "June 27, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8016778, "likes": {"liked": "— Friendly, Clean and Top Notch", "disliked": "— nothing"}}], "location": {}, "variance": {"poor": 1, "average": 7, "very good": 29, "terrible": 2, "excellent": 293}, "aka": "Carriage House Provincetown Hotel Provincetown", "slim_ranking": 0.366197183099, "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.5, "rooms": 5.0, "location": 5.0}, "description": "Carriage House Provincetown - a perfect blend of Luxurious Space, Amenities & Location."}