{"user_rating": 5.0, "review_count": 363, "name": "Carter Notch Inn", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "We returned home yesterday after a trip to Quebec City, Jackson NH and the coast of Maine. By far, our highlight was the CARTER NOTCH INN in Jackson NH. From the moment we arrived to the time we left we felt as though we were in nature's paradise. After a day of hiking and early each morning we would sit in the swing on the inviting large porch with ample seating. Drinking our tea we could watch hummingbirds feed while looking out over the golf course. A walk two hundred yards down the road took us to a beaver pond and beautiful waterfall. The quaint town of Jackson was located at the end of the waterfall. Our hosts, Dick and Sally, made us feel 100% at home. Each day they had suggested hikes and activities for us - all that we thoroughly enjoyed! Tea, coffee and homemade cookies were available at all times - they even had a refrigerator full of complimentary drinks. Each morning we were served the most delicious breakfast that sustained us throughout most of the day. A light dinner each evening was adequate. Our room was very comfortable, bright, cheery and spacious. We loved sitting on the loveseat in the alcove while reading our books. My husband loved the flat screen TV! We were also able to get our puppy fix while playing with Henry and Dudley, their precious Old English Sheep dogs. After traveling through much of Canada and the US and staying at numerous B&B's, my husband and I both agreed that the Carter Notch Inn is at the top of our list. We only hope to return some day!", "title": "Nature's Paradise!", "helpfulness": 1, "user": "duenowhovious", "date": "June 29, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 114869523}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "Stayed here for a weekend, and we absolutely loved the location of the inn and also the hospitality of the innkeepers, Dick and Sally.", "title": "Loved it, and definitely coming back !!", "user": "Irina_RI", "date": "June 20, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 5.0, "service": 5.0}, "id": 114584294}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "The breakfast is quite creative, and both Dick and Sally are very engaged, constantly offering to help you fill your day at the lovely white mountains.", "title": "The Inn is a perfect compliment to the Conway/Jackson area", "user": "stephdp", "date": "June 12, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 112925365}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "Their outdoor jacuzzi is definitely great for relaxing tired legs after a long hike up the mountains.", "title": "Book now to avoid disappointment", "helpfulness": 1, "user": "shedlad", "date": "May 26, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 110004590}, {"rating": 5.0, "stay_parameters": "Stayed May 2011", "text": "The summer views here are awesome, so fall foliage must be absolutely stunning. We're planning to be back in the Fall !!", "title": "Loved Carter Notch Inn!", "user": "DawnMNottingham", "date": "May 16, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 108550005}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "My wife and I had a wonderful time at the Carter Notch Inn. The Inn is located in a beautiful peaceful setting within walking distance of the beautiful Jackson Falls.. Dick and Sally did a wonderful job making us feel welcome and comfortable. They provided excellent advice on where to eat dinner and suggestions on great nearby hiking trails. Dick and Sally on short notice went out of their way to accomodate special dietary requirements for my wife for breakfest. We have stayed in many bed and breakfests around the country and this was truly are best B&B experience.", "title": "This is a great bed and breakfest", "user": "jtpotter", "date": "July 23, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115684367}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "There really isn't anything that we can add to previous reviews. We thought everything about Carter Notch was delightful, and cannot recommend highly enough. Dick and Sally were charming, and sipping a glass of wine on the swing seat on the verandah with good company was heavenly. Having a stocked fridge for the guests was a really nice touch. And we saw a beaver at the pond ! The only downside was that we only stayed for one night and couldn't change our plans.", "title": "We loved it.", "user": "janetatt", "date": "July 18, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115487168}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "We had an outstanding trip to New England and it wouldn't have been the same without our stay at Carter Notch Inn. The couple that runs the B&B were very inviting and helped maximize your time efficiency as you toured the White Mountain area and other points of interest. They allowed their guests to feel at home without being bothersome. The food was delicious and amenities (beverages, snacks, internet access etc.) were at your fingertips. We will definitely go back and highly recommend it to anyone that is looking for a relaxing get away.", "title": "Comfortable, Relaxing, Good food", "user": "btyree", "date": "July 17, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115451216}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "DITTO to all the other positive, glowing reviews! Here are my top five reasons for making the Carter Notch Inn a must -", "title": "Loved it so much we extended our stay by two nights!!!", "user": "babsnh", "date": "July 10, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115229328}, {"rating": 5.0, "title": "Do not miss the opportunity to stay with Sally, Dick, Henry & Dudley", "text": "1. Dick & Sally - innkeepers extraordinaire! They are friendly, informative, funny, great cooks (loved the moose and bear pancakes!), great conversationalists, all around good folk!", "user": "Trolleroller", "date": "July 6, 2011", "id": 115088523}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "Everyone else has said it over and over -- this place is terrific. I don't need to elaborate. Be sure to take Sally and Dick's recommendations for dinner -- they know the best places in the area.", "title": "Sally and Dick do it right", "user": "jbullock47", "date": "October 3, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 118886315}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "The Carter Notch Inn was recommended by close friends of ours and we were not disappointed. The Inn is a fabulous property located in idyllic surroundings. Sally and Dick run the inn superbly well and create a wonderfully relaxed atmosphere for their guests. Room 7 which we occupied provided very good and spacious accommodation. During the 3 nights we stayed at the inn, we met guests on return trips from afar afield as Australia and Sweden - what better recommendation. Dick went to great lengths to ensure we had all the information required to fill our time in this wonderful area. Highly recommended.", "title": "Great accommodation in a great area of New England.", "user": "Ed G", "date": "September 25, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 118580927}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "J & E Dorset, England", "title": "Best spot in the White Mountains!", "user": "TheHikerDog", "date": "August 21, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117044513}, {"rating": 5.0, "stay_parameters": "Stayed August 2011", "text": "Spent three wonderful nights with Sally and Dick their friends Henry, Dudley and Lulu at their ideally B&B. Located on 16A next door to the Eagle Mountain Hotel, this B&B is quiet and yet centrally located for the hiking and other outdoor activities that the White Mountains offer. The Inn itself is very charming and comfortable and Sally and Dick are warm, gracious and welcoming hosts. Breakfasts are both interesting and delicious and they keep a small fridge well stocked for that late afternoon glass of wine or beer before you head out for the evening. They also know their way around the entertainment and dining options in the area - and everyone knows them! Plus Sally is a hiker, so she can fill you in on lots of great places to visit.", "title": "The search for a friendly, homey, B&B is over", "user": "sbaker1224", "date": "August 20, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 117006418}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with friends", "text": "The room (we stayed in Room 1) had two windows so a nice breeze was felt in the evenings. The Inn itself dates back to 1890 and has the cool little quirks old homes have - strange sloping floors, odd little nooks and spaces and high ceilings. We looked around and the other rooms are just as interesting and spacious.", "title": "The Best B&B in Jackson NH\"", "user": "Globe58Trotter", "date": "August 19, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116961494}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "After driving 4 hours...it took 5 minutes to feel refreshed sitting on the front porch with Sally,Dick,Henry, and Dudley. Sally and Dick are the perfect hosts...helpful with ideas, friendly with conversation, and they serve a breakfast...second to none. This B & B is spotless with everything in place. Their location is convenient to golf ( across the street), hiking ( as close as the back yard), and a wonderful watering hole ( within walking distance).", "title": "A great place to relax...and renew", "user": "Glenn149", "date": "August 17, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116860875}, {"rating": 5.0, "stay_parameters": "Stayed August 2011", "text": "Sally and Dick are the best hosts you could ask for. Warm, attentive and friendly. They had great suggestions for food and fun things to do. Their two sheepdogs Henry and Dudley were super companions for evenings on the porch sipping wine and having great conversation.", "title": "Amazing stay!", "user": "kemulvey", "date": "August 17, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 116848918}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "If you're looking for a great stay, Carter Notch Inn is the place. Immaculate rooms with a view. And the breakfast was incredible.", "title": "Top of the White Mountains!", "user": "Dobrien-1", "date": "August 7, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116399596}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "Thanks, Sally and Dick, we'll be back!", "title": "The best B&B you could possibly hope for and more...", "user": "Johnfroevan", "date": "August 1, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116129795}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "Top notch B&B. Nicest people . Comfortable and quiet. A glass of wine or a bottle of beer on the house. Online PC just in case you cant stay away. Quiet front porch to meet a new friend. You will not beat this place. Right near the whole White Mountain experience but away from it all. If you complain about this place you should just stay home for vacations.", "title": "Awesome", "helpfulness": 1, "user": "J0yLady", "date": "July 29, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115998530}], "location": {"country": "United States"}, "variance": {"poor": 0, "average": 1, "very good": 6, "terrible": 2, "excellent": 354}, "aka": "Carter Notch Hotel", "slim_ranking": 0.0588235294118, "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "description": "A beautiful Bed and Breakfast located in the quaint New England village of Jackson, New Hampshire, overlooking the Wildcat River & in the heart of the White Mountains. Year round outdoor hot tub, full country breakfasts & quiet location."}