{"user_rating": 4.5, "review_count": 130, "name": "Casa Morgano", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "This small hotel is in the perfect location in Capri--central to everything but in a magical place that is enough off the beaten path to feel calm and serene. The views of the sea are magnificent, the staff superb, the rooms comfortable and the bathrooms absolutely first rate.", "title": "Understated elegance and charm in a great location", "helpfulness": 1, "user": "AGrassini", "date": "May 25, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 65284059}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "The hotel has two pools and a gym. The facilities are not what this place is about--the real luxury is in the details...the beautiful linens--turned down impeccably every evening--, breakfast served on your own terrace or by the pool, the elegance of the bathroom, the ease with which the bags appear in your room after your arrival at the port, the staff recommendations for dinner and so much more.", "title": "great experience - would love to go back", "user": "tim90nyc", "date": "November 3, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 5.0}, "id": 48442630}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "Overall, we had four magical days and, as we come to Italy often, we look forward to returning in the future!", "title": "A little piece of heaven", "user": "April2179", "date": "November 1, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 48258691}, {"rating": 1.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "The hotel is a bit off the beaten path in Capri, but will worth looking for. The rooms are gorgeous, nice pools, great views, large modern rooms, ours had a balcony with unbeatable view.", "title": "careful - thieves in this hotel!", "helpfulness": 1, "user": "alexioLondon", "date": "September 13, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 41280942}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled with family", "text": "Casa Morgano is a spectacular hotel on a spectacular island. We were here at the tail end of their season, so it was fairly empty. I believe it was only us and three other rooms. But I could see that it would be quite incredible in the higher season (when it wouldn't be quite so cold!).", "title": "this hotel is paradise go and see for yourself!", "user": "BrightonBethany", "date": "June 10, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 32011091}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "We stayed in Casa Morgano for our honeymoon and I can only say the best about this hotel. We got upgraded upon our arrival. The staff was very helpful and friendly. The hotel has a great location, great breakfast place and a beautiful view on the sea. We liked it a lot and ould love to go bak again.", "title": "Perfect for honeymoon!", "user": "ZsofiL", "date": "August 1, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 73256113}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "If your tired of the scene or high prices (Grand Hotel Quisisana or Punta Tragara), Casa Morgano is the place to stay. The rooms are bright and sunny not too mention clean. The beds and linens are comfortable and soft. And the rooms are spacious! The location is superior as you are not on the main street with the shops but in situated in the middle between Punta Tragara and Grand Hotel Quisisana. You can relax by one of two pools or workout in their gym. The staff is incredible as they work their tails off too provide you with first class service. Roberto, Vinchenzo, Miguel, David, Dominico, Tonino and the rest off the staff will make your stay incredibly pleasant. They are very professional, courteous and friendly. You can venture next door to Hotel La Scalinatella for lunch outside next to the pool. Just ask for Ginero, who will help you select a delicious seafood dish or Caprese salad and or Raviolis! The food is great! Try their ice tea. Also, unless you don't mind whole shrimp (that means with the head, body and legs) ask for the \"Shrimps\" peeled.", "title": "Elegant, first class service and beautiful views!", "user": "Descente", "date": "July 30, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 73054006}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "Casa Morgano is a nice break of peace and quiet, with breathtaking views, in it's own world. Enjoy!!!!", "title": "Luxurious Hotel with excellent views and wonderful staff", "user": "barrymooring", "date": "July 30, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 72956355}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled with family", "text": "This Hotel is truly wonderful. Everything about this hotel was excellent. The staff were welcoming and extremely helpful.", "title": "Views and luxury", "user": "phdtravel", "date": "July 9, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 70339442}, {"rating": 4.0, "stay_parameters": "Stayed June 2010, traveled with family", "text": "Our room was very large with a double bed, sky tv and a sofa. The bathroom was fitted with double sinks, a jacuzzi bath and an excellent shower.", "title": "Lovely hotel with wonderful staff", "helpfulness": 1, "user": "foodie0075", "date": "July 4, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 69692190}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled with friends", "text": "We though Casa Morgano was an incredible deal. I think we paid about 180 euros for this place which is or should be a 4 star hotel. It’s owned by the same people who own the luxury flagship Quisiana on Capri. They give you the Quisi bath amenities, etc. But it’s the views that make the place. Our balcony room looked over the back of the island with giant pines overhead and glimpses of the sea beyond. The rooms were small, but they were comfortable and nicely furnished. The public rooms were ornate with lots of gold trim here and there and elaborately tiled floors. The most beautiful place in the hotel was their small pool in the front next to which they served their included buffet breakfast, again with pines overhead and views of the sea beyond. Relaxing and lovely. To get to our room we had to walk up a flight of stairs and cross an open tiled balcony—a sort of outdoor public terrace. There was a table with cracked vase sitting forlornly in the area which suggested they could use some sprucing up but overall the place was well attended and a real bargain for what it provided. The location is on the path leading out of the main part of Capri town, so it is quiet but that also means you have to walk a bit to get to the “downtown” area.", "title": "Fabulous balcony views, lovely setting", "user": "FloridaTravelmum", "date": "December 22, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 90468932}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "Our first trip to Capri met with trepidation as the ferry crossing from Sorrento was horrendous, my husband gripping the table and muttering that he hated me for making him go to Capri. Would he ever speak to me again if the hotel I chose was awful as well? Well Casa Morgana saved the day in every respect. The welcoming professional staff upon seeing his grey face and my stressed out look, sent a tray of camomile tea and dry toast to the room to settle his stomach and my nerves. And what a room, and the view and atmosphere. The romantic holiday was back on. We ended up extending our stay. Our visit to Axel Munthe's Villa San Michele was a highlight and I am busy reading his biography and missing Capri immensely since we returned last week. The hotel was the best we stayed in 4 weeks in Italy . The breakfast is worth a mention. Quality food and ingredients and wonderful service. I felt very comfortable trying out my freshly learnt Italian on the poor staff who took it on the chin in good spirit. We hope to return soon.", "title": "Can't beat Casa Morgana for top spot, top staff and ambience", "helpfulness": 1, "user": "llamalady", "date": "October 23, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 84505636}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled with family", "text": "We just returned from a 5 night stay at Casa Morgano and wanted to report that we thought the entire hotel, staff, and overall experience was superlative. The hotel is exactly what you want from a high-end, boutique hotel in Italy - it is small, beautiful, friendly, gracious, and with impeccable service that is simultaneously welcoming and personable but extremely competent and effective. The location is unbeatable in our opinion - on Via Tragara - the most beautiful walking street on the island just a few minutes past the action of the main Piazzetta. A few minutes past the gorgeous shops and the crowds trickle away and - especially at night - you are left with twinkling lights, honeysuckle scented air, and beautiful hotels and homes. Yet, you don't have to walk TOO far down Via Tragara, so you don't feel like you are schlepping. CM is next to their equally (and slightly more expensive/rarefied) La Scalinetella property and shares some facilities.", "title": "Casa Morgano was PERFECT in Capri - AND we had our 4 year old!", "helpfulness": 2, "user": "psaseattle", "date": "October 2, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 81829044}, {"rating": 5.0, "stay_parameters": "Stayed September 2010", "text": "We had a 2 bedroom suite with double terraces facing the sea. The rooms were lovely, spotless, and decorated in the typical blue and white tiles of Capri (note - every room is different on the property). Housekeeping was unobtrusive, very friendly, and always spot on. The entire staff at the front desk and at breakfast was absolutely fantastic and I can't fault them for anything. They made all of our dinner reservations, travel transfer reservations (including arranging private driver for transfer from Naples train station to they hydrofoil, to the taxi from Capri's Marina Grande Harbor, to being escorted during the walk through town to the hotel...and then in reverse on our outbound). Nothing was too much to ask.", "title": "The Essence of Hospitality", "user": "brookline426", "date": "September 22, 2010", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 80655139}, {"rating": 5.0, "title": "Excellent choice...", "text": "We spent 2 glorious days at La Fontelina beach club (our absolute favorite thing to do on Capri from previous trips), relaxing, swimming, and having amazing lunches and unbeatable sangria. We cannot recommend this more highly as a way to really \"experience\" Capri, avoid crowds, and just melt into the island life. We enjoyed dinners at Edode (2x), Sollievo, and Aurora. Lunched also at La Conca del Sogno on Nerano - another favorite \"must do\" for us when we are in the area.", "helpfulness": 1, "user": "Subway01", "date": "August 20, 2010", "id": 76091443}, {"rating": 5.0, "stay_parameters": "Stayed September 2008", "text": "Casa Morgano is one of those hotels that cannot be overrated. No matter what you think you might experience when booking this hotel, you'll be impressed. I stayed in this hotel with my daughter for her graduation present and it was absolutely amazing. From the spacious room, awesome breakfast and lovely staff, we couldnt have asked for more. The pool is awesome, The price was WELL WORTH IT and this is the best way to spend a vacation in capri. One of the, if not THE, most amazing hotel we stayed in.", "title": "An Unreal Hotel in Capri!", "user": "JLove2512", "date": "December 26, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 23020648}, {"rating": 5.0, "stay_parameters": "Stayed June 2007", "text": "you go to capri for the views, and the views from this hotel are the best on the island. we did a lot of walking around during the day and casa morgano by far had the best views. just awesome.", "title": "Our Only Place on Capri", "helpfulness": 6, "user": "Mike14c14", "date": "December 13, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 22695236, "likes": {"liked": "— Splendid rooms, superb staff", "disliked": "— Somewhat limited ammenities"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "We visit Capri for a week every June and always stay at Casa Morgano.", "title": "Our Favorite", "helpfulness": 2, "user": "RoamnGnome", "date": "December 12, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 22680268, "likes": {"liked": "— The location and the breakafst and the Caprice salad!!!!!", "disliked": "— NOTHING!"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2008", "text": "It's a definitive small Itallian luxury hotel of the sort that are becoming scarcer and scarcer. Deluxe rooms and junior suites are large, very airy and quite Caprese. The pool area is always quiet and comfortable, and though they no longer serve lunch there, we find that if you ask for a little something to eat around mid-day, some marvelous treats will materialize.", "title": "Excellent hotel", "user": "astronomer-at-large", "date": "November 8, 2008", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 21645941, "likes": {"liked": "— views from the balcony", "disliked": "— long walk to the pool"}}, {"rating": 1.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "The staff is always delightful, know us well by now and extended a most garcious welcome. And of course, the views! You won't see the Faraglioni, but the the wide mediterranian vista is nonetheless splendid.", "title": "More 3 star than 5 star", "helpfulness": 2, "user": "parky12384", "date": "August 26, 2008", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "location": 1.0, "rooms": 1.0}, "id": 19364188, "likes": {"liked": "— Leaving", "disliked": "— The room and the beds"}}], "location": {"country": "Italy", "region": "Campania", "continent": "Europe"}, "stars": 5, "variance": {"poor": 5, "average": 4, "very good": 21, "terrible": 6, "excellent": 94}, "aka": "Casa Morgano Hotel", "slim_ranking": 0.209302325581}