{"user_rating": 4.5, "review_count": 403, "name": "Casa La Fe - a Kali Hotel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "My husband and I enjoyed our stay very much at Casa La Fe. The staff and owner Geoff are quite accomodating. If this is your first trip to Cartagena it is perfect because it is located in Centro near everything. You can walk to restaurants, markets, etc. If you are a late or light sleeper try to get a room on the 2 or third floor because the breakfast area is located outside the rooms. The beds are very firm as well which I found slightly uncomfortable. Most of the guests that visit tend to be English speaking. Geoff , who is from the UK and his manager Monica both speak English. The AC works great being it is very hot in Cartagena and the mini fridge is great to keep extra water, beer etc. The staff will organize tours for you as well. What else can you ask for? I highly recommend this gem in the heart of the city. Enjoy.", "title": "What a great find!", "helpfulness": 3, "user": "argentinevisitor", "date": "November 27, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6181966, "likes": {"liked": "— proximity to city sites, value for the money and comfortable accomodations", "disliked": "— beds too firm, location of room to close to breakfast area"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "We recently stayed at Casa La Fe and the hotel certainly deserves its current high rating in TA for quality and value.. However we decided to break our eight day stay by spending three nights at their beach house. We wanted a complete escape from the hustle and bustle of downtown Cartagena and needed to relax . Wow, this beach house was something else- fully catered, beautifully prepared and furnished and set in quite remarkable tropical surroundings. Like the hotel it also had free internet and satelliteTV/ comms. It's not advertised on their webpage so you need to ask for the details and book in advance. We highly recommend it..", "title": "Casa La Fe offers even more", "helpfulness": 5, "user": "andersz", "date": "November 9, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6089843, "likes": {"liked": "— staff attention", "disliked": "— nothing"}}, {"rating": 5.0, "title": "Casa La Fe was great!", "text": "Run by a native Englishman and his Colombian wife, Casa La Fe was a wonderful home away from home during our stay in Cartagena. The hotel staff was extraordinarily friendly and Carmen and Geoff (the owners) went out of their way to be helpful including setting up tours to the mud volcano and the Islas del Rosario.", "helpfulness": 6, "user": "sparkle22449", "date": "September 18, 2006", "id": 5813747}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "The hotel was very clean and very safe. Each room has it's own safe and hotel guests must ring the doorbell to enter. For anyone who is weary of travelling to Colombia this hotel will make you feel very secure.", "title": "Great location, Great Service", "helpfulness": 3, "user": "tom101", "date": "September 11, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5791366, "likes": {"liked": "— location and service", "disliked": "— nothing"}}, {"rating": 5.0, "title": "A great hotel with a bed & breakfast atmosphere", "text": "The roof deck is a wonderful little oasis complete with lounge chairs and a small pool for cooling off. A delicious breakfast of fruit, eggs and toast (and if you're lucky a delicious cheesy biscuit type of treat!) are included in the rate and each room has a well stocked and very well priced mini bar to cool you off after your forays about town. I highly recommend Casa La Fe to anyone travelling to Cartagena!", "helpfulness": 2, "user": "jas5131", "date": "August 19, 2006", "id": 5626049}, {"rating": 5.0, "title": "Great B&B", "text": "Casa La Fe is a great option in the old city, particularly if you're looking to stay away from the large hotels there. The owners, Geoff and Carmen, did a beautiful job restoring the property. The rooms are very comfortable -- ours was on the top floor and the ceiling must've been 20 feet high -- and the bathrooms are modern. There is a rooftop pool area that, while small, was never crowded. The first floor atrium is a pleasant place for breakfast. The food was simple but authentic and quite good. The staff is absolutely wonderful. And the hotel is in a terrific spot -- centrally located such that you're a 10-minute walk from just about anywhere within the walls, but comfortably removed from the most heavily trafficked plazas. Many of the city's best restaurants are within a couple of blocks (it seems they've clustered there because the Sofitel is nearby.)", "helpfulness": 6, "user": "A TripAdvisor user", "date": "June 25, 2006", "id": 5380778}, {"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled with family", "text": "We stayed in Casa la Fe for four days with our daughter and her friend., and so we took two rooms. Casa La Fe is a charming old building in a very central location in Cartagena, so you can literally walk everywhere you want to from the hotel. I keep on using the word \"hotel\" but it is more like staying in someone's beautiful home. The rooms are spotlessly clean, with all the amenities that you would expect. The one surprise was a reasonably priced mini bar, so cheap in fact that we were able to tell our daughter to feel free with it! Breakfast in the lobby was always delicious, with eggs and a variey of the local fruit, and fruit juices - forget Colombian coffee drink the fuit juice instead!", "title": "It's better than a hotel!", "helpfulness": 5, "user": "MoandEric", "date": "February 11, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6778730}, {"rating": 5.0, "title": "A total gem", "text": "The owners Geoff and Carmen are always charming and helpful as are the rest of the small and attentive staff, and you always feel as if nothing would be too much trouble.", "helpfulness": 8, "user": "honusari", "date": "February 3, 2007", "id": 6738938}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "There's a small pool in the roof garden which is a welcome refuge from the heat of Cartagena. Throughout the hotel are interesting local objects - someone has a good eye for design! Casa La Fe is very secure, and unfortunately that is a consideration in Colombia . There are safes in the rooms and the hotel entrance is guarded - no one gets in who shouldn't!", "title": "Married at Casa La Fe", "helpfulness": 4, "user": "NicBill", "date": "December 26, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6500120, "likes": {"liked": "— Friendly staff", "disliked": "— -"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "We noticed some of the other hotels on our walks round the city and they were to us either unreasonably posh, or rather down at heel. We thought that we had made the best choice - all at only 50 quid a night !", "title": "Thankyou Casa la Fe", "helpfulness": 5, "user": "sallyGT", "date": "December 10, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6358773, "likes": {"liked": "— location", "disliked": "— nothing"}}], "location": {"country": "Colombia", "continent": "South America"}, "stars": 3, "variance": {"poor": 5, "average": 22, "very good": 127, "terrible": 8, "excellent": 241}, "aka": "Casa La Fe Hotel", "slim_ranking": 0.144144144144, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.0, "rooms": 4.0, "location": 5.0}}