{"user_rating": 4.5, "review_count": 430, "name": "Casa de Billy Barcelona", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled solo", "text": "I spend five nights at Casa de Billy in early December. Casa de Billy actually consists of three apartments, all located on different floors of the same building, I stayed in the one on 4th floor. I can't review the other two Casas since I newer entered them, but judging from the traveller photos presented on this site and the photos on Casa's web page, they all have similar layout, just the decor varies.", "title": "Cozy Casa", "user": "Losviages", "date": "December 23, 2011", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 122032853}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled with friends", "text": "I had a single room with a shared bath and it worked fine for me. The room itself was small, it's decor wasn't quite as nice as in the photos (which apparently are all from the other apartments), but it was fine. The room was also pretty dark with a window opening to the patio interior, so not much natural light entered the room. There wasn’t any safe deposit in the room either, so I had to carry all my travel documents etc. with me all the time - and that’s not really the best thing to do in Barcelona.", "title": "Ticks all the boxes!", "helpfulness": 2, "user": "TheBrewers_11", "date": "December 3, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 121343513}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with friends", "text": "However, the bed was very comfortable and the room - like all common areas in general, was kept perfectly clean and I really appreciate that. The apartment had two shared bathrooms and I don't know if my schedules differed from those of the other guests, but I never needed to queue to use one. Needless to say, the bathrooms were also immaculately clean too. A pair of complimentary bath slippers in the room would have been a nice touch, though. Like in all old houses in BCN, some noise always carries from the street, other floors etc. and you can hear pretty well when other guest enter their rooms, but overall, it’s was a quiet place.", "title": "feels like home", "user": "Jakartan04", "date": "December 1, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 121305975}, {"rating": 3.0, "stay_parameters": "Stayed November 2011, traveled solo", "text": "At last a word of the common kitchen; the staff dine in the kitchen too, so I didn't feel quite comfortable using it in the mornings. I kept some bread and yoghurt of my own in the fridge, but I can't really think of using kitchen for preparing anything bigger than sandwiches or other snacks. Regardless of this, I do recommend Casa de Billy, whether you’re travelling alone or in company.", "title": "Cozy, clean and good location", "helpfulness": 1, "user": "Peiying", "date": "November 28, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 2.0, "rooms": 4.0, "location": 4.0}, "id": 121167356}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled with friends", "text": "We spent two nights at Casa Billy; it is extremely clean, comfortable and ideally placed for sightseeing because of its proximity to transport services. Billy, Sarah and staff were very friendly and helpful: free use of the dining room and kitchen and the 'honesty' bar was a nice touch, giving it a homely atmosphere. A slight problem was the Barcelona 'no noise after 10pm' rule; we were stayng there with friends to celebrate a birthday and after returning to the hotel from dinner, there was nowhere to sit and chat without the possibility of disturbing other guests. It wasn't too much of an issue as we were tired from our tour of Barcelona and didn't mind an early night but it could have been a disappointment in different circumstances. For the many people for whom this wouldn't be an issue, I would highly recommend Casa Billy.", "title": "Great place to stay", "user": "Dee G", "date": "November 16, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 120679634}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "Casa de Billy is a pure delight!. My wife and I stayed for 5 nights in Oct. 2011 and the place could not be better. Billy collects antiques so period charm abounds. Our room was unusually large by European standards, with an equally large in suite bath. By bath I mean deep bathtub, not just shower, which my wife loved. And when was the last time you saw a king sized bed in a modestly priced guesthouse. Easy to get to, the location on Gran Via leaves a short walk to most important sites. Staff was attentive and helpful, and the other guests we had breakfast with were polite and interesting. The continental breakfast was served in an elegant setting with fine china and real silverware. Billy understands small details and what a traveler both needs and wants. All the little things that make you feel at home are covered, like a fully stocked complete shared kitchen. Our only issue was that internet in our room was spotty. This could be as much my ancient laptop as Casa de Billy, but during our stay Billy even tried to fix this by installing a new router. Billy has 2 other facilities in Mexico and 1 in Istanbul. I am really interested in trying the one in Istanbul. Barcelona is fabulous but still a big city. Casa de Billy made our stay easy and afordable.", "title": "A Special Place", "user": "Bob M", "date": "October 27, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119788821}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "Casa de Billy is a lovely place to stay - more like staying in a friend's very well-appointed home than in a hotel. Our room was lovely, a good size, with a very comfortable bed and good bedlinen. Our private bathroom was large with an excellent shower and a great big wardrobe (with, hurrah! a full-length mirror) for storing our things. Bedroom and bathroom were cleaned daily and everywhere in the house was spotless. We took advantage of the opportunity to keep food in the fridge in the common kitchen. The breakfast, while simple continental, was beautifully presented and provided the opportunity to meet fellow guests - very convivial. Joaquin and Sarah are lovely - very welcoming and helpful and always pleasant. The location is excellent - 2 minutes from a metro station, near the Plaça d'Espanya and within walking distance of the Ramblas. We loved it. However, if you decide to book, choose your room carefully - some of them are quite small and have shared bathrooms. Ours was off the breakfast room/bar with a glass panel above the door, so we had to turn off all the lights in the breakfast room before we went to bed, and there was always the potential of being woken up by people getting stuff from the bar or making cups of tea or coffee. That being said, we stayed for 6 nights and were woken by a very quiet tea-making person only on our last night. We would highly recommend Casa de Billy, and it is amazingly good value for money in Barcelona, which is a bit pricy on the accommodation front.", "title": "Lovely place and great value for money", "helpfulness": 1, "user": "CarloRotterdam", "date": "October 21, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119543454}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled solo", "text": "This place is more like a boutique hotel. Location is perfect next to plaza de espana and the main metro lines. Couldn't recommend a booking here highly enough.", "title": "top location and excellant accomadation", "user": "dwhelan", "date": "October 13, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119247963}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled with friends", "text": "We really enjoyed our stay at this guesthouse. Sarah and Billy made us feel welcome and offered very good advice on Barcelona. It was very relaxing to come back to the guesthouse after a busy day of sightseeing. We ate out mostly - but also enjoyed using the common fridge for storing drinks and snacks. We would definitely stay here again.", "title": "Clean, comfortable and good value!", "user": "patny8", "date": "October 11, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 119185556}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "very convenient location, easy to get any where you want either by walking or metro. large space, clean, warm and cozy, just like staying at home. Nice staff.", "title": "best value B&B", "user": "BostonJanlee", "date": "October 5, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 118970749}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "My husband and I stayed at Casa de Billy in a room with the private bathroom. I liked the location, close to the bus and metro stations and accessible to the new looking shopping mall. I loved the interior coordination there...very stylish. Friendly and warm atmosphere. Would love to stay there again!", "title": "Stylish and Warm", "user": "ReinaUch", "date": "October 5, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 118959866}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "My husband & I spent 2 nights at the Casa de Billy and really enjoyed our experience.", "title": "Charming, Comfortable & Great Value", "helpfulness": 1, "user": "Anyliz", "date": "October 3, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 118893483}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "Perfect place to stay in the Montjuic area and very close to the Metro. Approx 10-15 min walk from the Magic fountain. The staff were friendly & hospitable, breakfast was yummy and the interior was chic, clean & cozy. We would definitely recommend this B&B for a quiet, relaxing stay.", "title": "Great B&B", "user": "smh33", "date": "September 30, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 118784033}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled with friends", "text": "At first I was worried that the location would be too far from the main part of town, well I was wrong. The location was perfect, close to everything, including the Metro, which is easy to ride.", "title": "Easy", "user": "c l", "date": "September 29, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 118729233}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "I stayed with my girlfriend in one of the rooms with a private bath and could not believe how much space we had.", "title": "Relaxing and charming", "helpfulness": 1, "user": "neleh87", "date": "September 27, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 118649132}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "Very well located. Just some minutes from the Montjuic complex and very close to 2 metro stations. The room we stayed was huge with a very clean, big and good bathroom. Classy decoration. The staff are very nice and gave us maps and information about Barcelona. Good wi-fi internet for free.", "title": "Excelent location, great room", "helpfulness": 1, "user": "CarolinaSantosREC", "date": "November 6, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 120244169}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled solo", "text": "You can use the kitchen, which is very good. The breakfast is simple, but very tasty. I would definitely recommend it!", "title": "The best hostel I have ever stayed", "user": "ultzipa", "date": "November 3, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 120103669}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled with friends", "text": "Hostel was very nice, great location and nicely decorated. Very clean and friendly staff. Would go there again!", "title": "more like home", "user": "caalartim", "date": "October 28, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 119822470}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "it is more likely a house with a great decoration and cozy rooms. We much enjoyed the breakfast which is very simple but makes you feel in the 19th century. Every morning people gather around the wooden table under a chandelier and your orange juice and coffee are served with a lovely music. Location is quite nice, very closed to Plaza Espanya -tourist attractions- and also 2min to the metro stop Rocafort where you can get any line in Barcelona. The staff is so friendly and helpful*love it*", "title": "A great place to stay", "user": "TraceyPBath", "date": "October 27, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 119789930}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "Casa de Billy is a great place to stay, It is stylish and a real haven. It was lovely to use elegant tea cups instead of the usual bland hotel offerings, and a treat to breakfast around an antique table. The whole place feels opulent and indulgent but at the same time, comfortable enough to use as your own home away from home. The facilities are great, with the flexibility to use the kitchen if you desire and everything you need to tailor your stay to your requirements is provided.", "title": "Casa de billy was wonderful", "user": "Neah F", "date": "October 27, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 119789187}], "location": {"country": "Spain", "region": "Catalonia", "continent": "Europe"}, "variance": {"poor": 3, "average": 13, "very good": 91, "terrible": 0, "excellent": 323}, "aka": "Casa De Billy Barcelona Hotel Barcelona", "slim_ranking": 0.0459770114943, "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "Beautiful, Luxurious guesthouse, B and B, located Gran Via in a Regia Style building built around 1890. Near metro Rochafort."}