{"user_rating": 5.0, "review_count": 283, "name": "Casa de Las Flores", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with friends", "text": "This B&B was perfection and I will certainly stay at Casa de las Flores on my next visit to Tlaquepaque. The garden is lovely and a great place to enjoy a glass of wine and relax with friends. Fabulous breakfasts and an evening dessert, created by Stan, are also enjoyed in the beautiful garden setting. The hotel is full of mexican pottery and folk art collected over many years by the owners. Customer satisfaction is clearly important to the hosts. I bought a rather large piece of furniture in Tonola and Stan spent a great deal of time coordinating with his driver, Luis, to have it picked up from the factory and delivered to my home which is five hours away from Tlaquepaque. Talk about service above and beyond! They were all just great.", "title": "Wonderful experience!", "user": "donna c", "date": "September 19, 2011", "detail_rating": {"value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 118319795}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled on business", "text": "Casa de las Flores is owned by a former sou-chef at a prominent Berkeley restaurant., and his partner who manages the financial end of things. His partner shares with him a love for vintage mexican pottery which fills the entire hotel. They are close friends of many of the important potters in the Guadalajara area, and these new pieces are available in their tienda. The hotel itself is staffed by competent and wonderful people who are always willing to help bi lingually. One of the special helps is dependable taxis- always the same drivers who are committed to comfort and fair prices. The food is superior- veggie concoctions with delicious cheese sauces at breakfast or home made ice cream in the evenings. The rooms are especially large, clean and welcoming! Never a shortage of hot water or hangers. The garden is one of the loveliest and when a cactus blooms over the patio with 100 blossoms the perfume fills the night air. Romantic and practical this is the place to stay when in Guadalajara area.", "title": "How can life be any better than at Casa de las Flores", "user": "jcbt", "date": "September 14, 2011", "detail_rating": {"value": 5.0, "service": 5.0}, "id": 118127711}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "Casa de Las Flores is the perfect bed and breakfast experience. They have a very thorough web site even advising which taxi to take from the airport and directions from the airport to the property to give to the taxi driver. We were welcomed with a glass of wine and orientation of the property and area by Stan, our host. We stayed in a junior suite which was white glove test clean and spacious - queen bed, bathroom with shower, sitting area and work desk area - wi-fi included. The breakfasts personally prepared by Stan are to die for - I would challenge you to find a better breakfast anywhere in town! Each evening there is a dessert served in the patio area. Stan inquired each evening and each morning as to any information or advice or help he and co-host Jose could provide to make our stay the best it could be. Stan and/or Jose were available morning til night to answer questions, offer advice, or just for pleasant conversation. There is a bar with great margaritas if you decide not to venture out and Chris was a wonderful bartender who remembered each evening that we liked our margarita glasses only 1/2 rimmed in salt. The location of Casa de Las Flores is perfect for easily walking to the shops, restaurants, museums, cathedrals, town square, public market, etc. etc. etc. in Tlaquepaque and it's only a block to a bus that takes you to Tonala if you desire. Our departure day flight was very early and Stan arranged for a driver to pick us up before daybreak and prepared a box breakfast for us to take with us to the airport. Stan and Jose have an EXTENSIVE Mexican folk art collection (museum quality) housed in Casa de Las Flores and Stan was kind enough to give us a private tour of the collection - the knowledge he imparted about the history and development of Mexican folk art was very interesting. Oh, and the gardens - lush and beautiful, tranquil and quiet - great to enjoy over the delicious breakfast, a cocktail, conversation with the hosts or friends and family or that evening dessert. We highly recommend this wonderful hidden jewel of a bed and breakfast - Casa de Las Flores - we are already making plans to visit Tlaquepaque again in the Spring and wouldn't dream of staying anywhere else - Casa de Las Flores is a keeper!", "title": "WE LOVED IT AND WE'LL BE BACK!", "user": "Norman and Joyc... H", "date": "September 10, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117907791}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled on business", "text": "This is the best place in Tlaquepaue! I travel to Mexico several times a year for business. At Mexidona in Sedona Arizona, we import furniture, accessories and folk art from Mexico. I have stayed at several hotels and b and b's over the years. Stan and Jose always welcome me back and make me feel like this is indeed my \"home away from home.\" From the evening cocktails to the delicious gourmet breakfasts, to the simple amenities like calling home (Vonage), they take amazing care of their guests. Stan and Jose have great knowledge of the area, restaurants, artisans, and more. All you need to do is ask.", "title": "Another fabuolus stay with Stan and Jose", "user": "SedonaBarbi", "date": "August 22, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117100096}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "Kind Regards,", "title": "Paradise Behind those old adobe walls!", "user": "Zip77", "date": "August 18, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116893482}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled with friends", "text": "In the often impersonal world of today's travel, it's always an unexpected delight to enter a place where one is treaded to the kind of service, usually, reserved for family members. Casa De Las Flores showers you with this kind of service. From the moment you enter, you're immediately made to feel welcome and at home. Your hosts, Stan and Jose, as well as their entire family of emplyees, leave nothing to be desired in the way they pamper and spoil all their guests. The beautiful guest rooms; the lush, magical garden; the artistically appointed common areas of the house; the gourmet breakfasts and delicious dessert treats (served nightly) all contribute to your wanting to return as often and as soon as possible to this B&B destintation. Give it a try on your next trip to Tlaquepaque, You'll be glad you did!", "title": "The Best Of The Best!", "user": "ROBERT D", "date": "November 7, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120307060}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled with friends", "text": "Robert DeRusso", "title": "A haven amidst fine Mexican art", "user": "JulianHeathcote", "date": "October 31, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119954615}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled with friends", "text": "When you arrive at Casa de las Flores, you would be forgiven for perhaps thinking that behind its modest exterior, you would expect an equally modest interior. Nothing could be further from the truth. Behind its doors, a vast space filled with Mexican art treasures awaits you (many of them personally commissioned by owners Stan and Jose). This guest house is bright, airy, clean and very friendly. We enjoyed marvelling at the impressive collection of local folk art and relaxing in the tropical paradise of the garden, which was lush and very restful and quite vast. The rooms, situated beyond the garden (more like suites with comfortable chairs and sofas) are clean, comfortable, extremely well appointed and quiet. Here you can get a restful sleep before attacking the art shops in the beautiful town of Tlaquepaque. The owners (and consummate hosts) could not do enough to help us, whether guiding us on the area, explaining in good detail the techniques used to produce the myriad pieces we saw at this guesthouse and in general, to making sure our stay was relaxed and pain free. It was a truly wonderful experience and we would definitely return here.", "title": "A wonderful Inn in a great greater-Guadalajara town", "user": "Davis_Erik", "date": "October 31, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 119951714}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled solo", "text": "Tlaquepaque is a great place to base yourself for visiting Guadalajara (a human scaled town, with great proximity to Guad. and other nearby attractions), and Casa de las Flores is a real treat. Not only are the rooms very comfortable (great beds! wonderful showers!), but the common areas of this inn are full of beautiful foliage and wonderful ceramics. The breakfasts are the best you'll find in Mexico and it is a real treat to sit on the patio in the evening and enjoy a margarita or other cocktail. Stan and Jose are very friendly hosts and their staff are very attentive. A real refuge from the hustle and bustle of Guadalajara.", "title": "a great inn; just part of the Tlaquepaque picture.", "user": "Janice M", "date": "October 23, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119646303}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "The Casa de Flores is without a doubt a wonderful spot in an exciting and interesting area Tlaquepaque. There are so many things to do and see in the area-ceramics, glass, ironwork, home design. And being able to stay in the heart of it with Stan and Jose who are knowledgable in the area's arts just adds to the experience. Not to mention the garden, and a collection of folk art to die for!!! Guadalajara is lovely, has great museums, and big hotels--but Tlaquepaque is a community a place to go back to after a day \"in town\"--and where better than Casa de Flores? I use it as my \"airport hotel\"- sure I could get a shuttle from a big hotel, but just the relaxation factor alone in today's nasty air travel world makes it my choice--add in those great evening desserts, and oh so good breakfasts hands down the best!!!!! It has all the things you would get at those big hotels;internet, comfy towels,a helpful staff that's more like family. But the rooms don't all look alike, and generally you just feel at home. I also make it my base when I'm staying longer in the area-- I rent a house", "title": "Wonderful B&B in (Guadalajara) Tlaquepaque MX", "helpfulness": 1, "user": "OaxacaRestaurant", "date": "September 20, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 118374741}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled solo", "text": "This was actually my second stay at Casa de las Flores. I first stayed in May while on an extended shopping trip and rebooked in July when I would be finishing up the shopping. The location is very convenient and yet far enough from the city noise. Stan, one of the owners if a fantastic cook and I enjoyed all the breakfasts that were served. I made sure to be back in time of the dessert service as well! The staff were all pleasant and responsive to my needs. They were able to help locate an english-speaking cab driver to help tour the Tonala area. Both of the rooms I stayed in were lovey and comfortable-decorated with an eye for rich detail. A very unexpected benefit were both times, the other guests. Each stay I meedt repeat guests who were fasinating themselves. There is an area conducive to visiting where one can get a glass of wine. Just lovely!", "title": "Loved the stay!", "user": "penrod53", "date": "August 14, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116716393}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled on business", "text": "I have been coming here for 15 years !!! I do business all over the Metropolitan area but would never stay anywhere else. Casa de las Flores is situated in Tlaquepaque which was the \"weekend home\" area of historic Guadalajara and is beautiful in itself,", "title": "Mexico with all the comforts of home", "user": "BlondieNewZealand", "date": "July 22, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115669398}, {"rating": 4.0, "stay_parameters": "Stayed January 2011, traveled with family", "text": "The hotel is situated in a local street just 3 walking blocks from the Parian and walking Mall. It is a typical Mexican styled house that has a locked front wall right on the street and opens up to a courtyard at the back of the main area. There are only 7 rooms all with seating areas which are situated at the back of a wonderful garden full of flowers and birds like humming birds.", "title": "Highly Recommend this B&B", "user": "artlover65", "date": "July 7, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115138600}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "There is also a great bar / outdoor eating area where it is easy to meet other guests.", "title": "Every Detail was taken care of before you thought of it", "user": "molamarl", "date": "July 6, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115106957}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "The hosts Stanley and Jose with their staff are really helpful in absolutely anything that is required. Stanley is an amazing chef and cooks wonderful breakfasts for the morning and when you come home at night you are offered and equally wonderful desert. Everywhere you are in the hotel you are surrounded by \"typical mexico\". Its great , I love it! As long as I am coming to mexico, I will be coming here", "title": "Charming doesn't do it justice!", "user": "globalgal09", "date": "July 6, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115102978}, {"rating": 5.0, "stay_parameters": "Stayed January 2012", "text": "As you step through the fairly non descript door, it is a bit like Alice arriving in wonderland. Stan & Jose have created something very unique and special. With the area being renowned for artists, they have embraced the theme and have the most spectacular collection, displayed in a quirky style. As you walk in, there is a small gallery, leading onto a comfortable lounge, breakfast room, bar and terrace - which overlooks a beautiful walled garden (complete with humming birds). The rooms overlook the garden and are spacious, well laid out and with everything you need for a comfortable stay. Attention to detail is everywhere - including the service and hospitality. Stan prides himself on breakfast and every morning is a real show - both in presentation and taste. Along with the relaxed bar in the evening, they also have a complimentary desert (home made and delicious). You are a short walk from the art galleries, great restaurants and mariachi singers in the square, that make Tlaquepaque such a great destination (and very safe - contrary to media reports). You are provided with maps of the area, as well as downtown Guadalajara (a short bus, or taxi ride away) - no stone is left unturned by these great hosts. A true pleasure to experience - if you enjoy travel, then don't miss out and rush to Casa de las Flores.", "title": "Wonderful oasis and hospitality", "helpfulness": 1, "user": "Globaladventure", "date": "January 25, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 123599433}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled with friends", "text": "This is my second time at this wonderful B&B, having stayed at nearly all the others in Tlaquepaque. It is by far my favorite. I go on an annual \"girl's\" outing each year from our little beach village, spending 2-3 nights in Tlaquepaque. This is where we will stay from now on. The rooms are lovely, beds extremely comfortable, delightful hosts, and beautiful garden. Stan's breakfasts are truly memorable...such delicious gormet food and all included in your room rate! Good coffee is important to me and each morning by 7:30 it is ready and waiting. Complementary dessert is also served at night. Just a short walk and you can spend the day walking around Tlaquepaque, shopping at lovely boutiques, and having lunch or a snack at an outside (or inside) table. Wonderful restaurants all within walking distance.", "title": "Perfect spot to relax or shop till you drop", "helpfulness": 2, "user": "nic60760", "date": "January 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 122889567}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "Six of us ladies stayed here this time and we tended to go in different directions. Stan and the staff are all very helpful in making recommendations on where to look for items. He helped two friends plan their continuing trip on to different areas of Mexico. Louis, a driver, is available to take a group around.", "title": "absolutely fabulous--wouldn't stay elsewhere!", "user": "wgott", "date": "December 29, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 122255241}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "It is a small B&B with only about 6 or 7 rooms, but all are quite large and lovely.", "title": "Home away from home", "helpfulness": 1, "user": "Claire C", "date": "December 3, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121342139}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled with friends", "text": "Stan and Jose made our trip to Guadalajara so much more memorable. The breakfast was amazing each day. The complimentary dessert each evening was amazing. Hosts were extremely attentive. Took great deal of time to help us figure out where to eat, what little places to visit, where to shop. They made the trip amazing. Rooms were impeccably clean. This is a true gem! Right near heart of Tlaquepaque. Fabulous centrally located place to stay.", "title": "Magical time despite Red Alert", "user": "Lois267", "date": "November 27, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121077197}], "location": {"country": "Mexico"}, "variance": {"poor": 0, "average": 2, "very good": 5, "terrible": 2, "excellent": 274}, "aka": "Casa De Las Flores Hotel Tlaquepaque", "slim_ranking": 0.25}