{"user_rating": 5.0, "review_count": 65, "name": "Casa Pericos", "reviews": [{"rating": 3.0, "title": "Definitely Not in the Rainy Season", "text": "The house has no beach and is far from the beach! The walk to a beach is about a mile: on a path along the shoreline over the rocks, through the streams and coastline forest to the town, then a skiff awaited us to help us cross the river to the beach (for 10 pesos and operational until 2pm, thereafter, a bridge will get you across, add another 1/2 mile to your journey). The rain did not start until after 2pm, and when it rained daily, it pounded warm rain, flooding the streams and the river, walking back was tedious and dangerous. Another option was hiring a motorized skiff from the beach (for a small fee) to carry you back through the rain to a rocky shoreline area near the house.", "helpfulness": 2, "user": "Pamela4400", "date": "September 27, 2009", "id": 44936735}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "This house is not for the weak of limb or heart. A recent change in management led to some confusion in the booking process. Yelapa had no cars, no computers service available, we had cell or land line service and and no neighbors nearby. Of course sounds like a getaway from reality , and it is - but being truly incommunicado I had issues with safety isolated at the house, should I need it (reality) . Although we had no incident, we heard from locals of incidents with tourists walking the coastline back to their houses. As the house has an open format, exposed to the mountain in back, and really a balcony over the water in front, critters creeped, crawled and flew into our #2 unit. Advisement of scorpion vigilance made it difficult to fully relax (although we never saw one!). When the rains blew in, some furniture was soaked - including our beds until we moved them. Nothing ever dried while I was there due to the high and constant humidity, I went home with a suitcase of wet things. And my personal pet peeve, the safe is not safe (as it is lightweight and not bolted down.", "title": "Depressed to leave this paradise!", "helpfulness": 2, "user": "kublueyes", "date": "September 18, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 42680780}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "That being said, the house is beautiful. Low cost dining is available! We had fabulous fish dinners and ceviches for lunch, both on the beach and at Pollo Bollo and Las Brisas in town (it being low season, only two restaurants alternated being open in town - there was no nightlife). The small waterfall is worth the hike - just lovely. The pie ladies sell their homemade goods on the beach and the pies are delicious. The eternity pool at La Lagunita is soothing and fresh watered. A visit to UNESCO's Isla Marietas was fabulous for snorkeling and views. We are fluent in Spanish, and found the people were friendly and helpful.", "title": "We picked the right place to stay!", "helpfulness": 2, "user": "elskieanne", "date": "July 16, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 34885848}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "My advice is not to go in the rainy season ... and know what you are getting into.", "title": "Beautiful Pelapa n' Yelapa!", "helpfulness": 2, "user": "Brittanyleigh", "date": "June 8, 2009", "detail_rating": {"front_desk": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 31908893, "likes": {"liked": "— Beautifully decorated and open-concept", "disliked": "— Hard to sleep the first night, because we weren't used to the noises. But second night was amazing!"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled with friends", "text": "I stayed for 3 nights in the slow season of Sept with my boyfriend. We were greeted warmly! We had the most magical time there! Breathtaking view, beautiful weather, and surreal snorkeling! Tips: bring bug spray...lots, shop the local \"grocery store\" and cook in your kitchen in the room, go to bed when the sun sets and get up when the sun rises, look up to the beautiful jungle when you are washing your hair in the shower! Make an excellent choice and go here! Its a bit of a walk to get to the main beach and you must cross a small river to do so. Bring flash lights, be friendly and attempt to speak Spanish! Such a magical place!", "title": "I can't believe I'm going to tell anyone how great this place is!!", "helpfulness": 4, "user": "balooohalooo", "date": "May 4, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 29336643}, {"rating": 5.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "My husband and I, along with another couple, visited Casa Pericos this past Febuary and it was amazing! The open air floor plan, furniture flown in from Bali, and amazing location made this trip more than what we could have expected! Quite frankly this could be the nicest place in Yelapa. When we go back we are going right through Puerto Vallarta and jumping on the first water taxi to Yelapa.......with a large beer in hand of course!", "title": "Absolutely Beautiful place to stay! Extremely Nice Owners!", "helpfulness": 3, "user": "dgordo6", "date": "May 1, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 29156485}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "Wasn't really sure what to expect because the casa pericos web site only showed 1 photo when I made the reservation. This was the best gamble I have ever made. What an incredible place to stay. No need for parking, pool, fitness center, room service, or restaurants with this amazing location. No cars in this town, no parking needed. The ocean is your front yard pool. With so many amazing resataurants to choose from that are priced $2-$12 a meal who needs a restaurant. You have a beautiful oceanside leasurely 15-20min walk to restaurants, so you don't need the fitness center.", "title": "The most magical place I have ever been", "helpfulness": 3, "user": "cocopebbles", "date": "April 30, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 29098011}], "location": {"country": "Mexico"}, "variance": {"poor": 0, "average": 2, "very good": 1, "terrible": 0, "excellent": 62}, "aka": "Casa Pericos Hotel", "slim_ranking": 0.166666666667, "description": "Casa Pericos, located on \"The Point\" in Yelapa only a few palapas down from Isabel's Beach, is the newest and most finely appointed palapa in Yelapa. Casa Pericos, which translates as “House of the Parrots”, are three romantic Indonesian-inspired loft suites rising within a beautiful jungle canopy filled with parrots and butterflies directly on the ocean. All three romantic Indonesian-inspired loft suites of Casa Pericos sleep up to 14 when rented together, but may be easily closed off to be two or three very spacious lofts, all with private baths and separate kitchens to accommodate our guest's needs.With breathtaking ocean and jungle views, calm warm ocean breezes, and waters teaming sea life literally at your front door, you will immediately understand why people are instantly lured to jump into the water before they even unpack. Once settled in, take a soak in our Zen Soaking tub with expansive jungle and ocean views, or shower in our private outdoor shower pavilion, before enjoying a margarita on your balcony overlooking Banderas Bay. We are located in the quietest area of Yelapa on The Point, yet Casa Pericos is only a five minute walk to the village restaurants and two locals dance clubs, or 20 minutes walking to the main beach or nearest waterfall. Begin your journey with us below as we explore each of our three Indonesian-inspired loft suites at Casa Pericos and the eco-barefoot experience Yelapa offers!"}