{"user_rating": 4.0, "review_count": 25, "name": "Casa Romano", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "I totally echo the previous reviewer. We stumbled upon this place by chance after the hostel we had planned to stay at was full. $20 for a lovely, clean room with bathroom. When we were being shown around by the \"mum\" of the house, she told us we had use of the kitchen, which was great for us as we prefer to cook our own meals. However, shortly after we started using the kitchen, it became clear that this was a problem. The utensils/plates etc are shared with the family - they cook their food in the same kitchen. I felt slightly uncomfortable with this at first as some of the plates/utensils were really nice. However there was no sign/cupboard specifically stating what guests were allowed to use, so we just used the stuff in the kitchen, as previously we were told.", "title": "Lovely hotel/casa but poor staff service", "user": "Beckiboo1983", "date": "May 8, 2012", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 129617384}, {"rating": 3.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "The lady of the casa was rude and cold with us. She would huff and puff each time we cooked - she would instruct us to wash up straight away and put the dishes back, nitpicking about a smear left on one of the plates, for example. She clearly did not appreciate us cooking in her kitchen. This would be fine apart from the fact she clearly advertises the rooms come with full use of the kitchen.", "title": "Very nice place but no service", "user": "MatSoph", "date": "April 21, 2012", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 128306802}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "I had told her we would be staying for a week, however after three nights she asked when we would be leaving as she had a reservation - exactly the same as the previous reviewer! We checked out the next morning and I begrudged giving them $80 of our money. Really bad customer service - don't open your house to guests and then be a poor host.", "title": "Cheap, clean, quiet, #1 for us in SJDS.", "user": "Bryce K", "date": "March 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 125463189}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled solo", "text": "We were very happy to find this quiet, clean and cheap place. Our room was nice and confortable and the bathroom was okay. The access to the kitchen was very useful as well as the wifi. However the family was not friendly at all. The mother was always dark and cold. Furthermore we had the impression they were not very satisfied that we used the kitchen.", "title": "Quiet Top Value Close to Beach", "user": "John M", "date": "January 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 123676504}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled solo", "text": "We wanted to stay two weeks but we paid only for one. 2 days before the end of the first week the mother told us that we had to leave because she had a resevation. We were very surprised as we thought they understood we wanted to stay one more week. She did not apologize. With that all the good thoughts we had about this place collapsed.", "title": "At Casa Romano as I write this", "user": "artjm", "date": "January 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 123021395}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "We discovered this motel quite by accident. We had decided to go against the norm , to take a chance and find a motel once we arrived in San Juan Del Sur.", "title": "Amazing Motel ( yet to be discovered)", "helpfulness": 1, "user": "lkdSanJose", "date": "December 6, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121468269}], "location": {"country": "Nicaragua", "region": "Rivas Department", "continent": "Central America"}, "variance": {"poor": 1, "average": 7, "very good": 7, "terrible": 0, "excellent": 10}, "aka": "Casa Romano Nicaragua/San Juan Del Sur", "slim_ranking": 0.378378378378}