{"user_rating": 5.0, "review_count": 287, "name": "Casa Cartagena Boutique Hotel & Spa", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "Casa Cartagena is an amazing boutique hotel recommended by Imagine Latin America.", "title": "Superb Hotel in Cusco", "user": "Steve H", "date": "April 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127983520}, {"rating": 1.0, "stay_parameters": "Stayed February 2012, traveled solo", "text": "Great service, unique rooms and great food. Spa facility excellent. Thoroughly recommended!!", "title": "Very bad policies", "helpfulness": 9, "user": "Joanne K", "date": "April 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 1.0, "sleep": 5.0, "rooms": 3.0, "location": 3.0}, "id": 127838181}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "While this hotel is certainly first class in accommodation and service I was severely disturbed by their policy regarding visitors. Here I had this lovely $400. a night room with sofas, dining tables etc....yet they would not allow a visitor to my room! I was visiting in Cusco and had many friends that I would have like to entertain in my room for drinks and conversation. Certainly in any other city, Paris or New York or London this would be normal. But not here....I suspect that there was a predjudice because my friends were native Peruvians and seemingly not fancy people. I bet if my all american caucasian daughter showed up there would have been no problem..", "title": "Amazing time at Casa Cartagena, Cusco!!!", "user": "Thomas Y", "date": "April 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127613254}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled with family", "text": "Would never go here again.", "title": "Spectacular Hotel! Excellent service and outstanding suite. A 5 star hotel to stay in Cusco!", "user": "Claudia L", "date": "April 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127550690}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled with family", "text": "Casa Cartagena is a dream!! Such an amazing place, our stay at Casa Cartagena has been a unique experience from beginning to end... we didn´t want to leave!", "title": "amazing", "user": "Priscila T", "date": "April 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127522998}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "We thought this hotel would be a good alternative to Monasterio, where we heard that the rooms were of uneven size and quality. It proved to be a good choice. We reserved a \"balcony suite,\" although it was not really a suite. The rooms open to a beautiful courtyard with a fountain, and outside seating is available there for the restaurant. The buffet breakfast was one of the best we had in South America. There were many appetizing fresh pastries and fruit was abundant. The hot chocolate was perhaps better than Angelina's in Paris! The hotel employees are extremely friendly and eager to please. There are a few glitches to be worked out--the lighting in the room was dim and inadequate, the refrigerator/minibar was not operating, and the pillows were foam (with no feather alternative available). The hotel is located about 2 blocks higher than Monasterio on a steep hill and it can be a difficult climb if the altitude is affecting you. However, the ascent is worth it for the intimate experience you will enjoy at this property.", "title": "Stylish and Intimate", "helpfulness": 1, "user": "DCRE", "date": "May 17, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 130111103}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "Cusco is a tourist mecca like Venice and its central streets are lined with trinket shops, restaurants and bars - - sidewalks are clogged with locals selling souvenirs, tours and massages. It can all be a bit overwhelming - or exhilarating, depending on your mood.", "title": "Small & Peaceful Hotel with Great Staff", "user": "244mahnyc", "date": "May 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 129451407}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "Fortunately, the entire area around Casa Cartagena is quiet and free of the hustle and bustle. Inside, the hotel compound is even more pleasant due to a smart re-design of the colonial structure that includes sitting areas, a bar, a garden and plenty of space for resting. Rooms are large and comfortable (exception: bathrooms are a little over-designed, with not-great lighting and showers that look good but splash the floor) and the common areas are inviting.", "title": "A Must Stay", "user": "jcopas", "date": "May 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 129147546}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "The hotel itself is very good, but the BEST part is its wonderful staff. From the minute we arrived to the multiple times they helped with reservations, directions, room service, dinner and breakfast in the hotel restaurant - and a very early departure, everything was handled cheerfully, efficiently and quickly. It was, without a doubt, some of the best service I have ever had at a hotel. A+", "title": "A real looker, just overlook the front desk", "helpfulness": 1, "user": "ivypivy", "date": "April 27, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 128947803}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled with friends", "text": "From the moment we arrived we were greeted with exceptional service. The hotel offers the feeling of a home away from home. It's stylish, personal and staff cater to your every need and more. Congratulations on achieving that special ambience that makes you not want to leave and leaves you wanting to come back for more.", "title": "Amazing boutique Hotel in Cusco!!!!!!", "user": "Jeff-tvl", "date": "April 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 128655190}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled with friends", "text": "From the moment we arrived until the moment we left, the experience was outstanding. We were greeted with some cocoa tea, chocolates, and a tour of the property. The hotel is amazing. It looks recently renovated, but with a lot of the original character of the original building. Our room was large and had a nice balcony overlooking the courtyard. The best part was the staff. From the front desk to the restaurant staff to the management, everything we needed was taken care of.", "title": "Amazing property, outstanding service", "helpfulness": 1, "user": "ordtraveler75", "date": "March 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 125548728}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "During my trip to Machu Picchu, my passport was stolen. When I returned to the hotel, they immediately began to help me with the process. They made phone calls on my behalf and were sincerely concerned. I have to recognize Arturo the bellman for saving the day/ He personally took me to the police station to fill out a report. The hotel sent him to help with translating as I speak very little Spanish. This was above and beyond. The process took a couple of hours, but Arturo was with me the entire time, not just translating but also trying to make me feel better about the situation and keeping me calm. You can't put a price on that kind of service. I owe my sanity and positive outcome to the situation to Arturo and the staff. I can't thank them enough.", "title": "Casa Cartagena", "user": "draratogabriella", "date": "January 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 123399913}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "This hotel is located near the heart of Cusco and is the only place I will stay when I return.", "title": "Great location, excellent hotel & Staff", "user": "TravelSnob1", "date": "January 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 122901948}, {"rating": 3.0, "stay_parameters": "Stayed December 2011", "text": "We spent 4 nights in Casa Cartagena at the end of 2011.It was very charmfull hotel with excellent service and good location. 30 of December was unforgattable for us visiting the Machu Picchu during the day, and back to the hotel the hotel managment invited all guests a glace of champain. It was fantastic! I can recommended for everybody!", "title": "Disappointing", "helpfulness": 2, "user": "Travelling004", "date": "January 10, 2012", "detail_rating": {"cleanliness": 4.0, "value": 1.0, "location": 3.0, "service": 3.0, "rooms": 3.0}, "id": 122896613}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "A middle aged couple from Hungary", "title": "beautiful hotel", "user": "Lindy T", "date": "December 31, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 122335149}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled with friends", "text": "Casa Cartagena was the place in Cusco to stay for my birthday celebration with my friends among other places around the world. It was really wonderful. The historical place its amazing......the Royal Suite absolutely wonderful. In it terrace we had a cocktail time with our friends that travelled from diffrent parts.", "title": "Wonderful place to stay in Cusco.", "helpfulness": 1, "user": "Pevilgal", "date": "November 6, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120235409}, {"rating": 4.0, "stay_parameters": "Stayed October 2011", "text": "The place is unique, charming and with a great atmosphere. You will love to relax in it's spa and also enjoy a great and relaxing massage in the Royal Suite and in the private jacuzzi. Besides enjoying Cusco......Casa Cartagena it's a destination itself.", "title": "Style space and comfort", "user": "FootlooseSingapore", "date": "November 1, 2011", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 120001305}, {"rating": 5.0, "stay_parameters": "Stayed September 2011", "text": "Breakfast it's delicious as well their appetizers. The service superb and very friendly. The whole staff verr professional.", "title": "One of the best places we've stayed!", "user": "LordBoddington", "date": "October 25, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 119693853}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "Thank you very much to the all Casa Cartagena team for making my birhtday celebration a real \"imperial celebration\"!!!", "title": "Consider where you are, and this place was fantastic.", "user": "michaeljaxman", "date": "October 24, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 119673737}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "The hotel is built around a charming courtyard. The suite rooms are huge. Ask for room 13 - it comes with a balcony and the free wifi signal is strong and consistent. Breakfast is lavish and service is wonderful!!", "title": "Peruvian Paradise", "user": "DrBillandME", "date": "October 24, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 119665142}], "location": {"country": "Peru", "region": "Cusco Region", "continent": "South America", "city": "Cusco"}, "stars": 4.5, "variance": {"poor": 3, "average": 5, "very good": 24, "terrible": 3, "excellent": 252}, "aka": "Hotel Casa Cartagena", "slim_ranking": 0.0588235294118, "description": "Casa Cartagena CuscoHigh in the Peruvian Andes lies the historic city of Cuzco, famous for its unique blend of Spanish and Incan cultures. Located just off a tranquil square behind the main plaza of Cuzco, Casa Cartagena Boutique Hotel & Spa Cusco emerges after years of restoration, which respected the original design of the historic house, to become one of the most exclusive boutique hotels in the city. Its walls of carved stone, which combines warmth, elegance and perfection, invite you to experience the fascinating magic and traditional mysticism that will transport you through time in this historic Spanish house declared a cultural heritage site of Peru.Its lovely atmosphere was built on an ancient Incan site, occupied by the ruling nobility of that time and from which it takes its name: Casa Cartagena, former property of the local Spanish ruler of Cuzco, Don Fernando Cartagena and Santa Cruz.This luxury hotel in Cuzco is an intimate refuge that has only sixteen spacious and comfortable suites, which perfectly blend the modern with the ancestral and luxury with the historical. The rooms are distributed symmetrically along a spacious patio of your dreams where time is suspended. It is located in the historic center of Cuzco, which was declared by UNESCO as a world heritage site.Recovery from an exhausting trip to Machu Picchu or the Sacred Valley of the Incas with our Qoya Spa will be something truly unequalled. It can be perfectly complemented with a delicious dinner in our restaurant which offers the best of local cuisine, \"La bodega de la Chola\", where poet Pablo Neruda was inspired and Che Guevara shared bohemian nights; it is considered one of the best restaurants in Cuzco.All of these unique features of Casa Cartagena and our warm and personalized service will make your stay in Cuzco an experience you will never forget."}