{"user_rating": 4.0, "review_count": 793, "name": "Casa Munras Hotel & Spa", "reviews": [{"rating": 3.0, "title": "Small Room - Very Noisy!", "text": "First, let me say the good things about the Casa Munras. The location is good. Close to downtown Monterey, Fisherman's wharf etc. The grounds & pool area were nice. Lots of beautiful flowers and tasteful touches. The bed was VERY comfortable. The room had some nice new features (new carpet, new paint, etc) The staff was pleasant and helpful. The breakfast was above average with a large variety of choices.", "user": "daisymay1", "date": "September 12, 2007", "id": 8703298}, {"rating": 5.0, "title": "Exceeded My Expectations", "text": "Unfortunately, there were a couple items that made the stay less than pleasant. First, the room we had was TINY. I would expect more room for the price. The setup of the hotel is much more \"motel\" than \"hotel\" - as there are all external walkways with the doors & windows facing out onto the walkways and parking areas. This setup caused us to have very restless nights because of the noise! The hotel doesn't have air conditioning, which would generally not matter in cool Monterey, but because of this, we had to keep our windows open all night long - and it was LOUD! People arriving to the hotel at all hours talking and laughing and slamming car doors. People standing right in front of our open windows talking loudly. It was miserable. Also, the parking situation is very difficult if you have an extra large vehicle - so beware.", "user": "llfitz", "date": "September 5, 2007", "id": 8660666}, {"rating": 1.0, "title": "Not three and one-half stars!", "text": "For the price - I would recommend finding another place to stay.", "user": "RMS3", "date": "August 28, 2007", "id": 8523084}, {"rating": 1.0, "title": "Ignored by incompetent staff, noisy, crowded, constuction", "text": "My husband and I stayed here over Labor Day weekend. I booked through Priceline we paid $147 per night. After reading some of the reviews about the construction I was a little nervous so I called the motel and asked some questions. They assured me the construction was contained toward the lobby where they are remodeling the lounge. The staff was very friendly, we were upgraded to a room with a king bed at no charge. We stayed in room 523, upstairs toward the back in one of the newer buildings. Our room was nice, very clean and the bed & bedding was incredible. Yes, the room is small so it may not be the best for a family but it was just my husband & I so we didn't need much room, comfort and cleanliness is more important to us. If you are looking for a place to stay with a beach view this is not the right place. The Casa Munras is located on Munras Ave. where there is a string of 2 star motel chains, the comfort of this room I found to be far superior to those chains and we paid less than what those chains were asking for a holiday weekend. Amenities were nice, pool area was clean, starbucks coffee in the room was a plus. I would reccommend this motel to friends. It will be even better when their lounge area is completed.", "user": "DrWeniki", "date": "August 21, 2007", "id": 8467244}, {"rating": 5.0, "title": "Great Spot for Business or Pleasure", "text": "Casa Munras is not a three and one-half star hotel as represented. The $170 room was a cracker-box. \"Do Not Disturb\" sign was missing. The foam cup for my morning coffee leaked. Foam coffee cup in a three and one-half star hotel? Carpet was tired. Hallways were worn and in need of renovation. Mediocre continental breakfast. New patio overlooked construction fence. The bed was nice. The bed was the only thing that distinguished this hotel. It is a two and one-half star property.", "user": "DMMoore", "date": "August 20, 2007", "id": 8457400}, {"rating": 4.0, "stay_parameters": "Stayed May 2009, traveled on business", "text": "We were in town for a conference and decided to stay at Casa Munras because it was much more reasonably priced than the accommodations that came with the conference.", "title": "Great deal and location", "helpfulness": 1, "user": "SSSteph", "date": "June 3, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 31513545}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled with family", "text": "The hotel itself is quite charming, especially for the price. The beds are comfortable and have the softness and feel of what you would expect to find at a $300+/night type of place. The room was spotless and we did not have any of the issues other reviewers have had. As far as the look of an old motel, well most of the hotels in the area look like that anyway, but the grounds alone were stunning. I could smell the gardenias in bloom from the floor below.", "title": "Destination Wedding Carmel Mission/Casa Munra Reception", "user": "msilkwood", "date": "May 6, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 29469665}, {"rating": 2.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "We brought our dog (dog-friendly hotel) and our toddler who loves to sleep in her “big girl” tent. There was plenty of room to set this up on the floor without it being in the way. There was no refrigerator, but guest services brought one up within 5 minutes of our request. The staff was very professional and friendly. As nice and clean as the hotel is, the best part about it is the central location. It is an easy walk to downtown, Trader Joe’s, the beach and the excellent Dennis the Menace park where the kid and the dog could exercise themselves to exhaustion. It is about a 15 min walk to Cannery Row and the Aquarium. Also, the scenic bike/runner’s path that goes all along the shore and ties into the famous 17 Mile Drive is easily accessible from Casa Munras.", "title": "Not what we expected…", "helpfulness": 2, "user": "SK99NewJersey", "date": "April 29, 2009", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 4.0, "service": 4.0, "rooms": 2.0}, "id": 28990270}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled with family", "text": "We had the excellent breakfast buffet one morning and were not charged for our toddler. Plus the cooked to order omelet was delicious and was included in the price with the buffet. Next time we’re in Monterey I will not think twice about staying here again.", "title": "Relaxing & Rejuvenating", "helpfulness": 2, "user": "collegemomsandiego", "date": "April 24, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 28693361}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled on business", "text": "This was our first experience with a Destination Wedding Carmel Mission and Casa Mundras for rooms and reception, the staff is wonderful to work with Sabrina, Maria and a very nice young man with curly hair at the front desk were wonderful. The Catering Staff was perfect kudos to the management team, sales, catering etc...... Our family will never forget the beautiful weekend wedding and all there special touches, our three days there were perfect, and what is always wonderful the price was a very pleasant value for all we received,", "title": "Classy Accomodation, Excellent Location, Helpful Staff", "helpfulness": 2, "user": "IncidentalTraveler09", "date": "April 22, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 28563812}, {"rating": 3.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "We stayed here for one night on our drive down the coast. The place was under renovation but this didn't affect us in any way.", "title": "Loved the heated pool", "helpfulness": 2, "user": "GooseyB", "date": "August 4, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 3.0, "rooms": 4.0}, "id": 8351105, "likes": {"liked": "— The pool", "disliked": "— Unfriendly staff"}}, {"rating": 4.0, "title": "Convenient location and a very comfortable bed!", "text": "It was good value and the room was nice, homely & clean. The heated pool was a welcome surprise after our drive.", "helpfulness": 1, "user": "Skittykitty", "date": "July 29, 2007", "id": 8254127}, {"rating": 5.0, "title": "Don't judge a book by it's cover", "text": "The downsides were that the staff weren't particularly friendly or helpful. We didn't have a particularly restful night as the room was quite hot as I think we didn't manage to set the thermostat at the right temparature. We got up to go to breakfast and couldn't find a table to sit at - I think that we probably timed it badly as everyone was getting up to go to the aquarium in time for it opening. (If you are planning on going to the aquarium - get there early as it gets very busy) We picked up some food and then managed to get a table but seemed to surrounded by screaming children.", "helpfulness": 5, "user": "lovebeingmom", "date": "July 29, 2007", "id": 8250557}, {"rating": 2.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "The hotel itself was nice enough and fine for our stay (I think our view of the place was worse due to the restless night). The plans they had on display for its expansion looked pretty impressive.", "title": "Sleepless in Monterey", "helpfulness": 3, "user": "friscojay", "date": "July 17, 2007", "detail_rating": {"cleanliness": 3.0, "front_desk": 3.0, "location": 4.0, "value": 2.0, "rooms": 2.0}, "id": 8138967}, {"rating": 2.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "The location was very convenient for local attractions and the airport. The 'gardens' a limited but the site is very pleasant, it's just a shame that it has to accomodate so many cars in amidst the room blocks. The room was clean and had a TV, DVD player (DVDs can be borrowed from reception), fireplace, free wi-fi and tea/coffeee making facilities. The hotel is being changed at the moment and our room had not yet been redecorated, but was still fine if a little dated. The bed was really comfortable and huge by UK standards! Breakfast was included and there was plenty to choose from. It was sold as a 'healthy start breakfast' but I think that depended on how many muffins you ate! There was cereal, bagels, yoghurts, coffee/tea, juices and fruit as well though. There is free coffee and cookies in reception from 5.00pm. The pool was heated and so is lovely to swim in even when the sun doesn't shine. The staff were helpful and booked taxis etc. for us. The two nights cost around $440 which is about 220GBP. It was perhaps a little on the expensive side but it was a good option none-the-less.", "title": "Owner change", "user": "SammiandPeanut", "date": "July 14, 2007", "detail_rating": {"cleanliness": 4.0, "location": 4.0, "value": 1.0, "rooms": 4.0}, "id": 8117480, "likes": {"liked": "— The flowers", "disliked": "— change of ownership"}}, {"rating": 4.0, "title": "Super Value and Service", "text": "My husband and I stayed at the Casa Munras for 1 night last week. We drove up from Cambria in order to see the aquarium. We arrived at about 11AM intending to park our car,buy aquarium tickets and then check in later. Imagine our surprise when we were told our room was ready and so we were able to check in right away!", "user": "Riff M", "date": "August 18, 2007", "id": 8449180}, {"rating": 4.0, "title": "We love this place!", "text": "Parking was quite easy and then we went up one flight of steps to our room overlooking the pool and rose garden.", "user": "ESL", "date": "August 17, 2007", "id": 8444098}, {"rating": 4.0, "title": "Old Spanish Beauty with Style", "text": "I will admit that the room size was fairly small. We didn't mind that . The TV was fine.There was Starbucks coffee for the in -room coffee pot.The bed was extremely comfy! The water pressure in the shower was delightful. I didn't use the pool but I saw lots of families enjoying it.", "user": "40DDD", "date": "August 17, 2007", "id": 8443217}, {"rating": 5.0, "title": "Most comfortable bed!", "text": "It was a short 1 1/2 block walk to the free trolley bus that took us to the wharf,cannery row, and the aquarium. In the late afternoon when we returned, we found coffee,tea and bakery cookies in the lobby.", "user": "yasminsaleh", "date": "August 7, 2007", "id": 8368550}, {"rating": 2.0, "title": "Not worth the money!", "text": "The last lovely surprise was waking up to the barking of seals in the bay and finding a wonderful expanded continental breakfast ready at 7AM. Besides the normal breakfast breads there was hot and cold cereal ,fresh fruit(bananas and nectarines)and yoghurt.O f course they also had my Starbucks.", "user": "Malcolmsmom", "date": "August 6, 2007", "id": 8362224}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "This hotel is close to everything. A short 10 minute walk to Monterey Pier and just a few blocks from Alvarado Avenue. The staff were very friendly and offered up some great dining suggestions. The room was a good size, the bed was quite comfortable and the toiletries were excellent( L'Occitane Products). The one drawback is the seagulls, I can't write in this review what I wanted to do to them. Another drawback is with the city of Monterey, the city does it's garbage collection at 3:00 a.m. in the morning! Where is the garbage going that it can't be done at some other time?", "title": "Very helpful staff", "user": "monarg", "date": "July 14, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 34789922}, {"rating": 3.0, "stay_parameters": "Stayed April 2009, traveled with family", "text": "I was traveling with my husband and two kids. The room was nice, clean but quite small. I expected a much bigger room for 4 people. My son had a nice time at the pool. I think I would try another place for the same price (approx $200 a night) but closer to the water. Fitness center equip did not work. Lobby and business area were very quiet and updated. Dennys across the street.", "title": "Nice Place, don't know about the price though", "user": "emendoza99", "date": "July 4, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 4.0, "service": 5.0, "rooms": 3.0}, "id": 33862558}, {"rating": 2.0, "stay_parameters": "Stayed June 2009, traveled on business", "text": "I don't normally give out bad reviews. I will try to stay again to give them a chance, however, I had one of the worst experiences ever at a hotel. Wasn't because they lost a reservation or gave me someone elses room. Basicly, the hype wasn't what it is said to be and its so noisy! Most rooms are right next to parking lot if all. So like a no tell, motel you get noise from foot and car traffic. The walls are so thin you can hear everything! I was on a downstairs room and you can hear every footstep coming down the walkway and stairs. The rooms are very small and no AC. So even though Monterey is normally cool, your room gets warm and then opening windows makes it even more loud. Then if you take a shower, there is no room for the heat and steam to go. TV's are out of date. bathrooms are big enough for maybe one smal child. Only good things were the soap and shampoo, smelled great, and the bed was pretty comfortable. When you arrive you get this feeling that the place is very posh, but it is clearly brushed aside after you get to your room. I think they try to make it nice but for the money, I'd stay somewhere else.", "title": "Don't let the charm and smiles fool you!", "helpfulness": 1, "user": "morlannet", "date": "June 29, 2009", "detail_rating": {"cleanliness": 5.0, "value": 2.0, "location": 5.0, "service": 4.0, "rooms": 1.0}, "id": 33471229}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "Casa Munras is a first class hotel that is VERY comfortable. They offer all the amenities for a great stay, but for us the front desk staff we're the most friendly and helpful we have ever experienced. Besides their welcoming disposition, the staff were very efficient and made sure we had everything we needed. We even received a follow-up phone call from the front desk an hour after we checked in to see if there was anything needed.", "title": "Service With Great Big Smiles", "user": "TravelingDuo13", "date": "June 28, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 33371594}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled on business", "text": "We had a first class experience at a first class hotel. Two thumbs-up for Casa Munras; we'll be back soon.", "title": "great stay", "user": "ltowngirl", "date": "June 28, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 33369129}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled on business", "text": "Our third visit to Casa Munras and, as excpected, our stay was exceptional! The front desk staff are extremely helpful; the location is downtown Monterey, within walking distance to excellent restaruants, night life, Fisherman's Wharf and for the hearty, even Cannery Row; the pillow top beds are wonderful, the rooms are clean and cozy; the staff are extremely friendly and are willing to help and answer questions without hesitation. For the price and location, would not stay anywhere else!!", "title": "Charming hotel, excellent location, great staff", "user": "FoothillTraveler47", "date": "June 27, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 33335828}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "We stayed in the begining of the week, the staff was pleasant and helpful. Our room was not big but quaint and comfy and the bed was full of pillows. The bathroom was also small but being tall the shower and the tub were great for tall people. We were in the back of the hotel and it was very quiet. We very much enjoyed the frieplace, would absolutely stay again.", "title": "Great beginning week trip", "user": "daisygrl-63", "date": "June 26, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 3.0, "service": 4.0, "rooms": 4.0}, "id": 33247156}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled with family", "text": "Casa Munras was absolutely beautiful from the reservation deask to the restaurant. Staff is friendly and willing to go the extra mile. I was able to reserve an early check in and I actually got in much sooner thanks to David at the reservations. The grounds are beautiful and pool sparkeling clean. I could see that staff was out each morning cleaning it. Beds were comfortable and ceiling fans are a plus. Rooms are well maintained and the spa is a great addition after a long day on the beach or out shopping. I will definately be booking again for next months trip to the area. Parking is tight large trucks and Hummers may have proplems mine did.", "title": "A little piece of Heaven", "user": "Travelingmommma", "date": "June 26, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 33206144}, {"rating": 3.0, "stay_parameters": "Stayed June 2009, traveled with family", "text": "We booked two adjoining queen rooms which were very attractive and clean. The problem we encountered was that the rooms had no air conditioning and they became stuffy and very warm even though the outside temperature was in the 60's. To open the windows we had to move furniture and the shutters covering the windows. There was no other source of fresh air. The hotel did provide fans which we used continuously through the night. Also finding an electric outlet was a challenge. The room was quiet at night even though the windows were open. The hotel is in an excellent location. Two blocks away is a public transit hub with a free shuttle to the Monterey Aquarium. Also there are many restaurants within walking distance..", "title": "Lovely small, stuffy rooms", "user": "Ipomoea", "date": "June 17, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 3.0, "rooms": 3.0}, "id": 32535463}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled solo", "text": "the hotel staff made me feel very welcome from the time I walked in the door and checked in. The restaraunt Esteban's food and drinks were awesome, as was their service. My room was clean and very comfortable, with a nice fireplace and comfortable bed.", "title": "fun and comfortable", "user": "jeffrey95112", "date": "June 5, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 31608916}, {"rating": 2.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "Let me preface my review by letting you know I work for a company that maintains hotels and motels in an investment portfolio. So, I am aware of the marketing effort that takes place to draw in people. That said:", "title": "Straight Motel. Period.", "helpfulness": 3, "user": "Scotucla", "date": "April 20, 2009", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "location": 1.0, "service": 3.0, "rooms": 1.0}, "id": 28365913}, {"rating": 3.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "This is one of the few places where, the moment I arrived at the room, I partook of the free wifi to find out what the cancellation policy is. We booked the place for 3 nights, and within 5 minutes of walking into the room, I had canceled the third night (48 hour notification unfortunately).", "title": "Didn't get a great night's sleep but good place for young families", "helpfulness": 1, "user": "madcritic", "date": "April 14, 2009", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 27967191}, {"rating": 3.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "I was almost willing to cut this place some slack and say that I came with VASTLY different expectations than what the reality is. As another reviewer noted, I was under the assumption that this place was a cozy, boutique-ish hotel that was quiet and would provide a relaxing getaway vacation. Good Lord was I wrong. This place is nothing more than a second rate motel. However, upon reflection, I am not willing to give this place a pass. They actively marketed this place to make it seem like it is a cute little boutique. Let me reiterate: Nothing better than a typical motel.", "title": "It's just an old motel.", "helpfulness": 1, "user": "SFRonster", "date": "April 14, 2009", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 3.0, "service": 3.0, "rooms": 1.0}, "id": 27966807}, {"rating": 2.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "The first night, I didn't sleep b/c my legs were itching so bad, I finally had to go and put on some sweats (alleviated the situation). Also, the in-wall heater is so loud, I had to turn it off and brave the cold in order to drift off into a haphazard sleep.", "title": "Glorified Motel", "helpfulness": 1, "user": "sbelle50", "date": "April 12, 2009", "detail_rating": {"cleanliness": 1.0, "location": 3.0, "rooms": 1.0}, "id": 27831983}, {"rating": 4.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "Let me tell you: Arriving at this place with the expectations I had (drawn from their representations on the website), I have rarely been more disappointed in my life with regards to 'hotel' accommodations. And let me tell you; the other, more disappointing instances involved third-world countries, very late arrival times, and communication difficulties.", "title": "Comfotable & affordable in Monterey", "helpfulness": 1, "user": "1webwiz", "date": "April 11, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 27822820}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "Having stayed at many of Monterey's finest Hotels I was pleasantly surprised at my stay at Casa Munras. The staff", "title": "Great experience in lodging comfort", "helpfulness": 1, "user": "upintheairpics", "date": "July 13, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8112923, "likes": {"liked": "— The charm and comfort of the room and the property", "disliked": "— nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "was outstanding in every detail. Therroom was more charming than I expected and the experience was the best I have had when visiting Monterey. My total endorsement for anyone looking", "title": "Nice place, nice location, excellent service", "helpfulness": 1, "user": "isitfriday", "date": "July 9, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 8085304, "likes": {"liked": "— historical district location, walking distance to Pier", "disliked": "— thin walls, lots of noise"}}, {"rating": 2.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "to stay in Monterey.", "title": "Overrated", "user": "scucman", "date": "July 8, 2007", "detail_rating": {"front_desk": 2.0, "service": 2.0, "cleanliness": 3.0, "value": 3.0, "rooms": 2.0, "location": 2.0}, "id": 8079468, "likes": {"liked": "— price was reasonable", "disliked": "— small, dark room -- lack of food at breakfast"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "Robert Hodgson", "title": "Good family spot", "user": "SantaMonicaTraveler", "date": "July 3, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 8052473}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled solo", "text": "Senior Producer", "title": "Expect a Good Nite Sleep!", "user": "bogeygolf7", "date": "June 26, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7990319, "likes": {"liked": "— Larkspur signature FeatherBorne Bed"}}], "location": {}, "stars": 3.5, "variance": {"poor": 65, "average": 142, "very good": 274, "terrible": 34, "excellent": 278}, "aka": "Larkspur Collection Casa Munras", "slim_ranking": 0.377358490566, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.5}, "description": "Stay Authentic. Historic Casa Munras Hotel & Spa is located in the Old-Town heart of the picturesque coastal town of Monterey. True to its Spanish heritage, this hacienda-inspired hotel embraces its outdoor spaces while beckoning guests to the warm comforts of their living quarters. A short stroll to Historic Old Monterey or the world famous Fisherman’s Wharf, Casa Munras Hotel & Spa is ideally located near many of the Central California region’s most visited attractions – coastal California at its best. Casa Munras Hotel & Spa strives to offer a personalized experience tailored to guest’s individual needs and interests, from complimentary wireless high speed Internet, DVD players and movie libraries, to a full service business center and a knowledgeable concierge program. Whether traveling on business or enjoying a well-deserved vacation, the Casa Munras Hotel & Spa offers a wide array of amenities to make your stay comfortable and memorable. Guests can \"sip, savor and share\" Spanish-inspired tapas at the hotel’s on-property restaurant, Estéban. Serving traditional dishes with a pinch of adventure, Estéban is the ideal place for a sit down dinner or socializing with friends."}