{"user_rating": 4.5, "review_count": 949, "name": "Casa Dorada Los Cabos", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "In 2009 we listened to the timeshare pitch here and purchased. We had stayed at Missiones last year and knew we wanted to be here. Medano Beach, the best beach is right out your door. The view to the Arch is right here. We have an Executive Suite which is a 1 bedroom/1bath small kitchen area. Jacuzzi tub inside. Two balconies, one with table/chairs and one with two lounge chairs. We receive daily cleaning and towels (most timeshares do not offer this). Our typical day consists of pool and beach alternating. The beach in directly at the bottom of the stairs. All the resorts along this beach have gates which I think provides a sense of security. The Mango Deck is just out the gate and it's true it is like a spring break type bar but it is great fun to watch the activities. You can also get lounge chairs front row of sea as long as you are buying a drink or food. Perfect for us. The rooms have dark (mahogany?style?) wood which is very high end looking. There is an armoire in living room for guests who might sleep on sofabed and there are 2 in bedroom along with other cabinetry and storage. Granite kitchen and bath, tiled large shower. Big vanity/desk area near jacuzzi at back side of bedroom. Swimup bar generally offers 2x1 drinks so about $6.00 for 2 frozen drinks. They have great steak tacos (which seem more like what I would call a fajita) and nachos. The also have staff coming around pool to bring you drinks/food. The activities desk is very helpful and polite. We are extremely happy with our choice. We look forward to coming year after year.!! They also provide valet parking at no charge, other than a tip.", "title": "Perfect in every way!", "user": "travelgirlMonroe", "date": "July 22, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 71908846}, {"rating": 3.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "We had 2 rooms, a 1 bedroom suite and a junior suite for our group of six for 5 nights. The positive elements where the location, oversized rooms, nice staff, overall newness, and cleanliness. The negatives included a physical disconnect to the beach where you actually have to leave the property through a locked gate to get to the beach and the hard sell on time share units even though the activities director said the presentation we could attend to get a discount on some activities was not a time share sales pitch. In addition there were a number of maintenance items unattended to or improperly fixed around the pool that are very unsafe including hundreds of missing floor tiles in the pool, the pool drains can be moved with the slightest effort exposing a sharp underwater hole, missing coping stones at the lower pool, and most importantly the skimmer or valve cover next to the hot tub was replaced with a flimsy piece of plastic cut to fit with just caulking holding it in place. On our very 1st night my girlfriend stepped on this make shift cover in the middle of the spa and her foot broke through into a 12\"-18\" deep hole with sharp metal edges. The doctors report on our return indicated a sprained ankle, pulled calf muscle, and partially shredded achillies tendon. To add to this injury the hot tub turner her hair bright green. The hotel took a report that night yet offered no help and only after repeated requests did they provide free drinks the next day, a partial hair treatment, crutches two days later, and finally an offer for a return stay for 4 nights. Unfortunately none this is anywhere close to the medical and physical therapy costs, not to mention the pain and down time. We have several calls into the hotel management to discuss this with no return calls so we are looking at legal action to at least force the hotel to fix these hazards for other travelers.", "title": "Overall a very nice hotel but some dangerous maintanence issues", "helpfulness": 4, "user": "edboersma", "date": "July 19, 2010", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 2.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 71551655}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "My wife and I stayed at this hotel and it was amazing. We frequently travel all over Mexico for leisure and have stayed at many well known hotels, but this hotel by far offers the most with respect to value, location, family and luxury. We went mainly to relax and recharge ourselvesbefore returning to the rigors of work. From the moment we entered the main lobby, we were in awe. The view from the lobby is amazing. All of the staff that we encountered were extremely pleasant and helpful. Our room was great! What you see on the website is what you get and even moreso. We ordered room service and were told the food would take about thirty minutes, but in fact it was brought to our room within fifteen minutes and excellently prepared. We were never approached by anyone atempting to sell us a timeshare. The hotel staff were very pleasant and offered us excellent tips on dining within the area. Our room was spacious and very clean, we didn't need our room to be serviced each day, but were politely asked if we needed anything whenever we were seen in the hallway area. I cannot respectfully say there was anything bad about our experince there as everything was great!", "title": "Amazing-Blissful-Serene", "user": "bigmacwongnoony", "date": "July 19, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 71520279}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "Just returned from a week as Casa Dorada – my third week in Cabo this year but definitely the best. Casa Dorada was awesome in every way! Check-in was smooth – even dealing with the salespeople wasn’t too bad. You just tell them “no” and you are on your way. We had suite 623 – if you have seen the webcam of the pool at the cabovillas website, then you have the same view we had every morning, as that webcam is off the 623 patio. The 1 BR is awesome – kitchen, twin patios (main and bedroom) and Jacuzzi tub. If you haven’t stayed here before you may wonder about those buildings you see on the webcam between the pool area and the beach. The largest is the Mango Deck – pretty much a spring breaker’s type of place with cheap drinks and drinking games with lots of audience participation. Beside it is the Office – great breakfast where you can put your toes in the sand. Billygan’s is next to the Office. Back to the Casa Dorada – we spent a lot of time by the pool – never had a problem finding chairs, even though we didn’t make it down until 10 AM sometimes. Service by the pool was good. Cervesas were around $3.00. Not bad, but you can walk across the street from the Casa Dorada entrance to a small convenience store and pick up an 8-pack of Pacifico for around $5.50 and bring it back. Note that water is also less expensive at that store – I got 1-liter bottles for around 90 cents.", "title": "Fantastic resort in every way!", "user": "j37genie", "date": "July 17, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 71234029}, {"rating": 4.0, "stay_parameters": "Stayed June 2010", "text": "Casa Dorada’s location is perfect. Great beach, and the walk to the marina is around 10 minutes. We strolled there pretty much every morning for breakfast, as there are lots of options, the views are great, and we got a little bit of exercise. Signs around the marina point you into town. We made it into Caba Wabo on Sat afternoon to find out if Sammy Hagar was playing (he played Fri night). No luck on Sat night! A note about Cabo Wabo: meals are pricey there. Entrees run in the mid $30s; however the tequila shrimp appetizers are great! Monday was marlin fishing on the “El Budster”. Awesome experience and I highly recommend them. Hooked up to 3 marlin, caught and released 2 of them. Also caught a tuna, which were transformed into blackened tuna, sashimi, and tuna with lemon and butter at the Cavendish Tavern, just off Dock 3. Tuesday’s lunch was highlighted by a visit to Gordo Lele’s – easily the best tacos in Cabo. Gordo’s is hard to find (look up the street from the Corners Bar behind the Giggling Marlin – Gordo’s is about 5 storefronts on the right)but worth the hunt. Javier is the owner, and one of the nicest people you will ever meet. Javier is known by many to be the “fifth Beatle”, and if you are lucky he will belt out a song for you! Wed and Thu were golf days at Cabo Real. It will cost you $25 each way for a taxi, but it really is a great golf course. Janice works the drink cart and she did a fantastic job of taking care of me.", "title": "What a fabulous surprise..perfect location, 1 bdrm condo for the price of a room, Ritz-Carlton level service.", "user": "snvlysheri", "date": "July 12, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 70705733}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "Following an ill-fated Aug/Sep 2009 visit to Cabo with hurricane Jimena, we returned this July to Casa Dorada and picked up right where we left off, without the hurricane. The hotel is the newest, beach-front hotel in Cabo, directly behind the Office & Mango Deck. After chceking in, we shot down the \"free breakfast\" guy who was very respectful of our discision and did not bother us for the remainder of our trip. Our room, #522 was an amazing 1-room suite with kitchen etc. The weather was hot, yet we had no problem getting chairs by the pool. The hotel was very strict about a 30-minute abandoned pool chair policy. If chairs are unused without any butts in them, they are made available to other guests.", "title": "Thank god, a non-hurricane visit to Cabo", "helpfulness": 1, "user": "neverenoughtime1", "date": "August 8, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 74351818}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "The rooms are great, clean, modern (flat-screens, etc) and the overall property is fantastic. We've stayed at this property in 5/09, 8/09 and 7/10 and will again in the future.", "title": "Casa Dorada was perfect!", "helpfulness": 1, "user": "svagrad76", "date": "August 8, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 74341665}, {"rating": 5.0, "title": "love it!!!!!", "text": "I have been reading reviews of Casa Dorada for months. Most have been positive; a few complained about minor things. But I must say that our experience was just marvelous. We arrived at the hotel right around noon, and not surprisingly, our room (618) was not ready. But the desk staff suggested that we get some lunch and check back a bit later. We were immediately \"shown around\" by one of the vacation club agents. He was suggesting that we join them the next morning for complimentary breakfast. I had read the reveiws and knew about it. After discussing it with him, my husband basically said thanks, but no thanks. We weren't planning on taking advantage of any ot the discounts offered for listening to the speil. Reluctantly, but politely, he told us that we could change our mind at any time and gave us his card. So...... we grabbed lunch at the poolside restaurant, stored our luggage and spent the afternoon around the pool. That's where my 20 yr old daughter and I spend most of every day. The loungers around the pool were very comfortable. Huge umbrellas. There was the usual \"saving\" of pool furniture as early as 8 am every day. But even though we didn't go down until after 10:30 or so, we could always find a place to enjoy our day. The wait staff was terrific. Especially Mayra and Vanessa. The food around the pool was pretty good. The two for one drink specials were great, too! We didn't spend any time down at the beach. I found it a bit too crowded feeling, and the noise from Mango Deck would have been too much.", "user": "lola60763", "date": "August 8, 2010", "id": 74240291}, {"rating": 3.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "What I was most amazed with was the rooms. Check out the pictures on their website. Beautifully appointed. Comfortable beds. I was never disturbed by noise from outside, or from other rooms.", "title": "Its All About The Location!", "helpfulness": 6, "user": "dyverze", "date": "August 3, 2010", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 73620301}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "I have no complaints about our stay at Casa Dorada. It being \"off season\", the price was incredibly reasonable. I highly recommend this place. I'm sure we'll return.", "title": "#1 choice -Outstanding location and facilities - Genuinely friendly service :)", "user": "Westcoast_Newlyweds", "date": "July 24, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 72184283}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled with friends", "text": "I just returned from a girl’s getaway in a two-bedroom villa at Casa Dorada at Medano Beach. We LOVED it and would highly recommend this place. In fact, I just booked the three bedroom penthouse for next September.", "title": "I just booked my return!", "helpfulness": 1, "user": "mrselett", "date": "September 25, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 80985147}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "The customer service was fantastic. The resort was clean. The spa – spotless and serene with amazing therapists. The food was excellent and affordable. We ate at the resort most days and enjoyed the two for one drinks on the beach and at the swim up bar. We also ate at 12 Tribes, which was good. We ordered room service twice. The food and service were both excellent.", "title": "We will be going back someday", "user": "PlanoJay", "date": "September 25, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 80963351}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "This resort had customer service beyond what I expected for a timeshare like daily cleaning service, plus turn down service each evening. During turn down, they turned on zen music on the clock/radio/ipod player and left chocolate kisses on the pillows. They also had a variety of toiletries, which some timeshares don’t offer. They included quality shampoo, conditioner, various scented soaps, lotion, facial cleanser pads, a sewing kit, etc. The water pressure in the showers was wonderful.", "title": "First time to Cabo, and Casa Dorada was perfect!", "user": "bc895715", "date": "September 23, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 80656756}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "The villa also allows you to control the air conditioning in each bedroom and the living area. This was nice because we all had different preferences. Each room also had ceiling fans. You could operate the fans and the AC with a remote on the nightstand. They were also mounted on the walls.", "title": "Beautiful property. Beware time share sharks !", "user": "libbikins", "date": "September 18, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 80039199}, {"rating": 3.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "Both the larger living area and smaller lock-off had kitchenettes with cook-tops and refrigerators. For serious cookers, please note there is no stove and no dish washer. If you left dishes in the sink, housekeeping cleaned them by hand.", "title": "Nice But Needs Maintenance", "user": "ivs40", "date": "September 11, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 79118028}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with friends", "text": "I love the Casa Dorada in Cabo. It has great rooms, great music and good well priced food. Not to mention the best spot on the beach. I have stayed there many times but up until Labor Day weekend I had never discovered C. D. real jewel. Fernando and Omar the hotel's photographers. They are professionals with style, talent and heart! So if u have any reason to have your picture taken while you're in Mexico..........find them!!!!", "title": "Casa Dorada has the best photographers in the world!", "user": "kcdozier", "date": "September 9, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 78950211}, {"rating": 3.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "Thanks Guys!", "title": "Great hotel with the exception of their obnoxious sales staff", "helpfulness": 2, "user": "LifelongHoneymooners", "date": "September 7, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 78679205}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled with family", "text": "We recently returned from our honeymoon, which was spent at Casa Dorada in Cabo San Lucas. We had a wonderful time with the exception of our welcoming to the hotel. Hotel guests are immediately approached by the activities staff who spend 30 min plus pressuring you into signing up for various recreational opportunities. The woman then urged us to join a representative the following morning for a \"free breakfast and tour of the hotel\"- we were told it would take 90 min. It was around 6:00 pm, we had just traveled for over 10 hrs and the woman simply would not let us get settled into our room! The following morning we are transfered from \"representative\" to representative until a large american man finally took us down to breakfast. Our meal was hardly relaxing as the salesman grilled us about our annual earnings and how frequently we traveled. He was overly intrusive into our personal lives and spent well over an hour hassling us over breakfast. We were then taken up to the sales room floor where we were further pressured into buying a timeshare that we didn't have ANY interest in buying. The rep spent another hour going through some powerpoint presentation. He repeatedly singled me out, as I was gazing out the window at the beach I so badly wanted to be sitting on. After we said \"NO\" at least 6 times, ANOTHER greasy salesman comes to our table asking us to sign a form saying we went through the sales pitch. This guy was so insulting that I would seriously reconsider ever staying at the hotel again. After we told him we were not interested, that it wasn't in the cards for us financially, the guy has the nerve to look at my husband and say \"nice watch\". He was so incredibly obnoxious and out-of-line. It's seriously unfortunate that guests, who haven't even had a chance to enjoy the resort, are put through this circus of events. We listened to your song and dance, the least you can do (after 2 1/2 hrs) is respect us when we politely say NO. If you do visit this hotel (which is a wonderful resort, with the exception of the slimy sales staff) politely decline the free breakfast- it was a HUGE waste of time.", "title": "FABULOUS HOTEL AND LOCATION BUT...", "helpfulness": 2, "user": "merjoe", "date": "September 7, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 78640449}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "The Casa Dorada is definitely a 5-star suite based hotel and resort.. The facilities were fantastic as was the service and location, which was walking distance to the marina and mall in downtown Cabo. HOWEVER....the one downside was their \"activities\" desk which actually is a time share selling team. They were incredibly deceiving and dishonest when we asked to book excursions for fishing and snorkeling. They said we could get huge discounts if we just listened to a lecture on the hotel facilities and the other hotels in the chain. We were stupid enough to believe them...we asked them to clarify that it had nothing to do with a time share and they confirmed this. The concierge is also complicit in this since when we emailed him prior to the trip with questions on deep sea fishing he forwarded my email to the Activities Desk.. Go to Casa Dorada but walk past the activities desk as quickly as you can!", "title": "5 star resort ........ but staff needs improvement", "helpfulness": 3, "user": "Lloydmbrown", "date": "August 13, 2010", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 75075582}, {"rating": 5.0, "stay_parameters": "Stayed July 2010", "text": "This place is the perfect location. My wife, son and I stay there for 7 nights 08/2010", "title": "Loved it, loved it, loved it....", "user": "travelgal444", "date": "August 12, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 74851121}], "location": {"country": "Mexico", "region": "Baja California"}, "stars": 4, "variance": {"poor": 32, "average": 70, "very good": 217, "terrible": 26, "excellent": 604}, "aka": "Casa Dorada Los Cabos Hotel Cabo San Lucas", "slim_ranking": 0.179104477612, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 5.0}, "description": "With an incomparable location on Medano Beach -- the best swimmable beach of Cabo, Casa Dorada is just steps away from world-class shopping, dining, entertainment, and the marina. As a member of Preferred Hotels & Resorts, a collection of the world’s finest independent luxury hotels, Casa Dorada Los Cabos brings the upscale service and family-friendly features to the Cabo San Lucas oceanfront. The Resort grants visitors a more convenient, yet equally spectacular, alternative to the more remote hotel zone of the Tourist Corridor. Boasting unobstructed vistas of Land’s End and the famous Arch, Casa Dorada is just 30 minutes away from Los Cabos International Airport. All of the 185 spacious one-, two- and three-bedroom suites and penthouses, open up to Los Cabos’ most dazzling ocean view, while the luminous and contemporary interiors ensure your comfort and satisfaction."}