{"user_rating": 5.0, "review_count": 263, "name": "Casa Gallina", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "My husband and I had the pleasure staying at Casa Gallina in the Leghorn Casita during our New Mexico vacation and it was by far the best stay of our trip. Richard, Casa Gallina's owner/designer/concierge/host has thought of every detail to make this place a unique and relaxing destination. Although these \"Casitas\" (little houses) are more of self-catering cottage than B&B, Richard has included many thoughtful touches to make you feel like his personal guests and friends, including a welcome note for us and a beautiful spread of nibbles and wine upon our arrival, home made cookies one afternoon and fresh eggs each day, a great music selection and even a laptop. It is obvious from meeting Richard that he truly loves what he does and every innkeeper and B&B owner should strive to meet his example. He has decorated each unit with a mix of local arts and crafts and treasures from abroad. The effect is is stylish, yet comfortable and unpretentious. When you first check-in Richard will provide you with a map and give you directions to local restaurants and shops. Do not hesitate to take his recommendations as he is spot on with every one. With that said, also make some time to stay-in and cook for yourselves. The fresh eggs produced the \"the girls\" can be the basis for a great frittata or omelet, paired with a tossed salad made from the veggies you can help your self to in the garden. Then have fun feeding the chickens with your scraps!", "title": "A truly memorable experience!!", "helpfulness": 2, "user": "WHERESWAUGH", "date": "October 20, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 84267413}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "If we are ever in Taos again we will be back to stay at Casa Gallina, but having told so many friends about this place I hope there is room for us. Casa Gallina is too good to keep a secret!", "title": "A really different -and wonderful- experience", "helpfulness": 1, "user": "DavidHBerkshire_UK", "date": "October 15, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 83643699}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "Just a couple of days in the Bantam Roost. The decor is immaculate, sympathetic and whilst eclectic, everything works well together to create a vibrant yet comforting environment.", "title": "Not to be missed", "helpfulness": 1, "user": "Caebhin", "date": "September 28, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 81376406}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "Somewhere between an apartment and a B&B, as ever the quality of these establishments is defined by the people that run them, and this is where Casa Gallina scores. From the design and maintenance of the property, through to having the table set with nibbles and wine for when we arrived; from bringing in cookies when we were out for the day or eggs for breakfast to advising us on driving routes, places where I might like to photograph and so on, Richard is a perfect host. We enjoyed Casa Gallina to the extent that we stayed in to cook our own breakfast, and bought lunch to bring back to eat there on the comfortable adirondacks in the garden. Both firsts for us. We'd absolutely return.", "title": "lived up to previous glowing reviews", "helpfulness": 1, "user": "joaniemz", "date": "September 22, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 80642101}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled with friends", "text": "Richard has carved out a unique piece of paradise. And it is to his credit that he has chosen to share it with the rest of the world. My wife and I spent our honeymoon there. I cannot think of any place in the world that could have been better. Thank you, Richard for providing us with a wonderful experience. We will be going back, just not soon enough. :(", "title": "Too warm in the hottest days of Summer", "helpfulness": 2, "user": "WineLover5000", "date": "August 11, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 2.0, "rooms": 5.0, "location": 3.0}, "id": 74809905}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "We spent two nights here in January, and can't wait to return. Richard was so friendly, welcoming, and helpful in making recommendations. We had breakfast the last morning, and it was the perfect end to a perfect stay at Casa Gallina. All of the food was so fresh and delicious, and we enjoyed chatting with Richard, hearing about how he came to Taos and started the B&B. We stayed in Leghorn Casita, which was beautifully decorated and designed. The kitchenette was great for a leisurely breakfast in, and all of the finishing touches really made it a special place. Thanks, Richard!", "title": "Such a relaxing, intimate experience!", "user": "SLVTraveler", "date": "February 16, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 56178603}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "Casa Gallina is a beautiful place, where I felt most welcome by our host, Richard. He showed us our casita, the Leghorn, when we arrived. It is a light, cozy and warm space. After helping me with my suitcase, Richard pulled out a map and oriented us to where we were, making sure we knew how to get into town, and while there, what we might enjoy. Excellent suggestions, especially for the restaurant, The Love Apple. He left us to enjoy some snacks and wine he'd prepared. We awoke to a light snow, and as we prepared to make our way over for breakfast, Richard was shoveling our walk. The breakfast was divine, as was the company. Somehow, he managed to gift us with baked goods and a newspaper. I felt he was available if we needed anything, but he respected our privacy, otherwise. We made frequent use of the woodstove, and the wood was always replenished and ashes removed for us. Silly us, we purchased eggs at the store the first day, which were not as tasty as the ones he provided daily from his hens. I appreciated having a kitchen in our casita. By the second day, I referred to the Leghorn as home and was excited to return every day. I would love to return to Casa Gallina.", "title": "Home away from home", "user": "UrbanaBeth", "date": "February 16, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 56175023}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled with friends", "text": "This is long overdue as our three-night stay was last summer (July 2009). Richard and Casa Gallina are just as special as all the reviews indicate. The pictures don't do justice to all the lovely details, including fresh flowers in various spots, local artwork on every surface, a stocked refrigerator, and yes, the happy hens. Our stay came near the end of a two-week road trip and was the perfect place to unwind. Both my friend and I left with one of Richard's books, which he trusted us to mail back (we did!), along with happy memories of our stay. My only complaint, and it is entirely outside Richard's control, is that the dirt road out front and the surprising amount of traffic on it, mean that the place is pretty dusty in summer with the open windows you need to stay cool. It didn't affect our enjoyment of the place, though, and we hope and plan to return.", "title": "As Wonderful As Promised", "user": "sclark30", "date": "January 24, 2010", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 54255599}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "After reading the glowing reviews here, we had sky-high expectations of Casa Gallina. Amazingly, Richard Spera managed to top them all, and our stay was even better than we imagined. We honeymooned in Taos and Santa Fe, and spent one idyllic week at Bantam Roost. Richard is the perfect host: friendly, kind, full of helpful suggestions, but also unobtrusive and extremely considerate. He's also a fantastic cook. We arrived to delicious welcome snacks, and Richard would often leave us fresh eggs from The Girls, vegetables from his garden, and sweet treats like a little apple pie or chocolate chip cookies. The breakfast he prepared for us in his kitchen was one of the best meals we ate in New Mexico! Bantam Roost is adorable, cozy and full of cool, quirky art -- Richard has great style. We loved having a full kitchen to make some of our own meals, and we also took advantage of the kiva fireplace (Richard kept us well-stocked with wood). The location of Casa Gallina is great, just a short drive from town. We explored all of Taos during our week there, and also made sure to spend time relaxing on the lovely second-floor deck of our casita, taking in the view of the surrounding mountains. We really can't say enough wonderful things about Casa Gallina. It was a dream come true, and the perfect honeymoon spot. We can't wait to go back for our anniversary!", "title": "A perfect, romantic, private getaway -- our Taos fantasy come true", "user": "brooklynite011", "date": "January 23, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 54182781}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled solo", "text": "I have been to taos many times for extended periods of time, but casa gallina is THE place I will always come back to from now on. I have spent four weeks there and stayed in two of the casitas. I loved them both, although the leghorn is my favourite as it is one big space, beutifully furnished. Light, cozy, charming. It snowed a lot when I was there and the fireplace provided extra joy when inside. There are beautiful views of the mountain, very personal touches, exquisite style with a great eye for details. You won't be disappointed, this is a place that has been put together with great love and you will feel that. Richard Spera is the host of your dreams. Discreet yet caring and always present. he's a wonderful cook (what a baker!!) and you'll enjoy very special food. I'm a writer and I worked in solitude at casa gallina, but always feeling i was being cared for. The beauty of the place provided great inspiration. I highly recommend this retreat for couples and for solo travelers in search of inspiration and peace.", "title": "the perfect retreat, it captures the essence of taos", "user": "ondina17", "date": "December 15, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 4.0, "rooms": 5.0}, "id": 51311063}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled solo", "text": "If you are looking for a truly wonderful laid back hideaway to capture the essence of Taos NM this is it. Just set back about a mile or so from the main road that runs through the town is the Casa Gallina and its three wonderful properties. Based on your requirements any of these choices should suit your needs. On this trip for me while visiting family I selected The Leghorn Casita, no coincidence that Leghorn is a reference to chickens which is a recurring theme. Richard Spera the proprietor is a very gracious host and will spoil you with his baking surprises as well as fresh eggs from his back yard brood. Feeding the chickens with leftovers is encouraged.", "title": "Memorable", "user": "bgnpd", "date": "May 4, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 63246285}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "Decorated with the sprit of what Taos is all about will have you quickly feeling you are a native and you will quickly settle into the right mind set. It will quickly be your new home away from home. Fireplaces and more wood then you could possibly burn ready and waiting.", "title": "Charming adobe casita", "user": "atuch", "date": "April 30, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 62813102}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "Add in the fine dining and local sights including the Pueblo, the Gorge and for sure the ski valley, toss in the never ending selection of galleries and a wonderful experience is awaiting your arrival.", "title": "Oasis in the desert", "user": "suziesworld", "date": "April 28, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 62706613}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled solo", "text": "I will return for future visits be it winter summer fall or spring.", "title": "Wouldn't consider anywhere else", "user": "jacdhaa", "date": "April 21, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 62121123}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled with family", "text": "BG, New Jersey", "title": "Wish we could have stayed longer", "user": "tekofo", "date": "April 14, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 61345569}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "Stayed at Casa Galina for four wonderful days. The place is lovely, so many wonderful details. My children loved Richard's \"Girls\" - his chickens, and we loved Richard. He was everything an innkeeper should be. Richard was able to offer wonderful recommendations for various activities in the area and was available when needed. I look forward to returning to Casa Gallina.", "title": "Everything we wanted and more!", "user": "jdmascarello", "date": "July 29, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 72883854}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled with friends", "text": "Just got back from a \"Southwest Road Trip\" that included a two day stay at Casa Gallina. The only bad thing about our stay was it was too short!!", "title": "Lovely place to stay............", "helpfulness": 1, "user": "Lsab2000", "date": "July 7, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 70028526}, {"rating": 5.0, "stay_parameters": "Stayed January 2009, traveled as a couple", "text": "We were welcomed by Richard, who is as friendly and welcoming as everyone says he is. He had wine and goodies waiting for us when we arrived which was a very nice touch and much appreciated. He spent the time to tell us about restuarants in the area and places to see and shop and gave us a tour of the casita.", "title": "Exquisite (Every time!)", "user": "moroccanmoon", "date": "May 19, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 64779687}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "We loved our casita and felt at home. The grounds are so lovely and perfect for relaxing under a tree with a good book or lunch and a drink.", "title": "Wonderful, home away from home experience.", "user": "Marissamoon", "date": "May 10, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 63773222}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "Looking forward to coming back!!", "title": "Sure it's a great place, but . . .", "user": "spypoint", "date": "May 7, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 63523412}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "We stayed at Casa Gallina for our anniversary. What a perfect choice. Richard is a wonderful host. We were greeted with a bottle of wine and antipasti on our arrival. The casita was so comfortable and decorated with New Mexico charm. The kitchenette was nicely supplied with basic items and of course the girls provide fresh eggs daily. There is a wonderful market in town, Cid's, to pick up whatever you might want. At first we were unsure of the location because it is somewhat on the edge of town, but quickly realized the quiet was wonderful. It is only a few minutes drive into the center of things. Richard gave excellent recommendations for dining, shopping and touring. I would have liked maid service to make up the bed, but fluffing the comforter just took a minute or two. If we can return to Taos someday we will definitely be staying at Casa Gallina. Thank you Richard!", "title": "Wonderful Experience", "helpfulness": 1, "user": "agardener", "date": "November 14, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 184729643}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled with friends", "text": "This place cannot be any better! Richard is an outstanding host, warm and welcoming just like his beautiful property. I have stayed at hotels and Inns all over the world, and this is one of the best experiences I have ever had. This is place is a true New Mexican classic, and I cannot wait to return!", "title": "Perfection", "helpfulness": 1, "user": "simba432", "date": "November 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 184312069}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "Casa Gallina really is as lovely and special a place as all the other reviewers have said it is, and Richard is a really wonderful host. Our casita was absolutely charming, and comfortable and beautifully appointed, and it felt like \"home\" from just about the first minute we arrived. From the lovely bottle of wine and antipasti waiting for us when we arrived, to Richard's restaurant recommendations (all of which were great), to the homemade cupcakes awaiting us late one afternoon, it felt more like we were guests in a friend's home than that we were paying customers. I kidded Richard that he has a \"cult following,\" and now I know why, and count me among them. We loved Taos as much as we loved Casa Gallina, and I can't wait to return!", "title": "There should be a rating higher than five!", "helpfulness": 1, "user": "Vicki F", "date": "November 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 183422312}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled with friends", "text": "Casa Gallina is the most fantastic place I have stayed at in Taos. We rented the three bedroom casita and it was wonderful. The beds were cozy and comfortable and the courtyard was stunning!", "title": "Fantastic!!!", "helpfulness": 1, "user": "Tammy S", "date": "October 30, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 182970628}, {"rating": 5.0, "title": "The Most Special Place...", "text": "Richard is an excellent host and entertaining as well. The chickens are a hoot, the highlight of our day was feeding them! It's a little off the beaten path but an easy drive into town and area attractions. You can feel the care and love Richard puts into the inn. The only thing I was disappointed in was that breakfast was not included, since it is listed as a B and B. But Richard does bring you fresh eggs everyday, you just have to drag yourself out of that cozy bed and cook them!!", "helpfulness": 1, "user": "Sari B", "date": "October 21, 2013", "id": 181846282}], "location": {"country": "United States"}, "variance": {"poor": 1, "average": 0, "very good": 3, "terrible": 0, "excellent": 259}, "slim_ranking": 0.0384615384615, "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "description": "Located on the edge of town in a quiet, pastoral setting, Casa Gallina's three gorgeous adobe casitas offer an oasis of home for visitors exploring the Taos area. Spacious, charming and just a five minute drive to historic Taos Plaza, each casita is decorated and appointed with furniture, art, antiques, and textiles from New Mexico, Old Mexico and the world over. Casa Gallina feels truly like your home away from home."}