{"user_rating": 4.0, "review_count": 20, "name": "Casa Amarilla", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "We stayed at Casa Amarilla (the yellow house) for three nights. Owner Dennis has four rooms on the first floor, and lives right above. Clean rooms, with excellent amenities (wifi, lcd/cable tv with decent english channels, hot shower, powerful a/c) at a very reasonable price. It's located on calle 5, a five minute walk from calle 3, the centre of Bocas town. It's also a short walk from the Bocas airport. Apart from the early morning wake-up calls from the roosters Dennis keeps in the yard next door, there's nothing not to love about this neat little inn! Best to book online and early as Casa Amarilla fills up quickly!", "title": "Almost always no vacancy", "user": "sg_stef", "date": "December 10, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 51017595}, {"rating": 4.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "Casa Amarilla is a very good place to stay in bocas. The owners are friendly and knowledgeable about the area (and for the English speakers, they're from Denver, so their language skills are impeccable). The rooms are well maintained, are very reasonably priced, and have great amenities (cable TV, fridge, AC, hot water). The minor downside is that the chickens in the yard next door may wake you up in the morning (not sure that isn't the case at all places in bocas).", "title": "Great amenities for a very reasonable price.", "user": "tudordynasty", "date": "November 25, 2009", "detail_rating": {"cleanliness": 3.0, "value": 5.0, "location": 3.0, "service": 4.0, "rooms": 3.0}, "id": 50063807}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "My son and I really enjoyed our stay in Bocas and have to attribute much of our comfort to Dennis and to his fabulous Casa Amarilla. The minute we walked in to the wall of cool air radiating from the room, we knew we had found our Nirvana.", "title": "Our home away from home", "helpfulness": 1, "user": "AurelieAM", "date": "July 27, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 35978188}], "location": {"country": "Panama", "continent": "Central America"}, "variance": {"poor": 2, "average": 3, "very good": 12, "terrible": 0, "excellent": 3}, "aka": "Casa Amarilla Bocas Del Toro, Panama - Bocas Town", "slim_ranking": 0.727272727273}