{"user_rating": 5.0, "review_count": 189, "name": "Casa Montani", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "Great location, wonderful staff, beautiful furnishings, very comfortable bed and pillows. Our room overlooked entrance to Piazza del Popolo. Breakfast is brought to your room minutes after you call for it. Totally fabulous experience and very fair price.", "title": "Perfect Rome hotel in every way", "user": "CharlieMontereyCA", "date": "October 16, 2010", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 1.0}, "id": 83762620}, {"rating": 5.0, "title": "A hidden gem---would definitely stay again!", "text": "My husband and I stayed at Casa Montani for our honeymoon. I am so glad we found it! Called \"Luxury Townhouses\", the hotel is made up of 5 rooms/suites on a floor of an office building, run by I believe a husband and wife. The rooms are beautifully decorated and immaculately clean.", "user": "IheartParis2010", "date": "October 14, 2010", "id": 83543357}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "We stayed in the Junior Suite, which had a foyer, bathroom, little living room and a bedroom (and closet). On the smallish side, but definitely a generous size for Europe. We had a safe, the AC worked well, we could get TV channels in English (a nice break from the usual CNN and BBC that European hotels usually only get), mini bar, toiletries are Hermes (but when we ran out, they weren't automatically replaced. I'm sure if we had asked they would have refilled them), lovely breakfast delivered to your room every morning, train station right outside the building, 5-10 minute walk to the Spanish Steps, but a little too far to walk to anything else we wanted to see (we took the train everywhere else.) Staff is really friendly and always were willing to help. If we travel back to Rome, we'd definitely come back here!", "title": "Thank you Trip Advisor", "user": "CynWhite", "date": "October 10, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 82827053}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "Only downsides were the Wifi was spotty, and after 5 minutes, if you weren't active online, it booted you off.", "title": "Charming boutique hotel in a perfect location", "user": "Westmount", "date": "October 2, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 81821662}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "Also, there is a little restaurant on the first floor of the building---cute, waiters were very nice and spoke english, food was good...we went there twice.", "title": "Great Location & Exquisitely Furnished Room", "user": "ChesterMonkey", "date": "September 23, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 80726504}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "Its not often that your expectations are met, but in the case of Casa Montani they were exceeded. Luxuriously decorated with top quality fitments added to the exceptional standard of cleanliness. Guiseppa and his girls run a slick operation with a freindly and relaxed style. The Breakfast which is delivered to your room on a silver trolley is the perfect way to start a busy day of seeing the sights of Rome. Situated opposite the Piazza del Popolo, the location is perfect for walking to all the main attractions of Rome.", "title": "Montani's a Must Stay in Rome", "user": "Rajworks", "date": "May 24, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 65167849}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled with family", "text": "What a find this place is! Cant fault a thing-book it now for a perfect stay in Rome.", "title": "The most comfortable Hotel I stayed in!", "user": "georgiagirl777", "date": "May 18, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 64646289}, {"rating": 4.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "This is a small B&B, located right off the Piazza del Popollo, so convenient and very posh and comfortable. Yvonne and Jelly were very helpful and the owner , Guiseppe,most congenial. I will definitely stay there again. Small and quiet located on the 3rd floor of an office building. Very safe and centrally located. The rooms and bathrooms were top of the line and decorated very stylishly with much attention to detail.", "title": "Unique concept in great location", "helpfulness": 1, "user": "hereinbody", "date": "March 29, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 59840004}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "Not a traditional hotel with concierge/restaurat etc. However if you want a stylish, comfortable space in a great location with attentive staff then this will work for you. The owner and staff were prepared to go that little bit extra to please - eg 1) my partner needed to use the internet for a work specific request that the laptop provided for guests couldn't do so the computer at the front desk was offered. eg 2) we were leaving very early (earlier than breakfast is normally given) and our pre 7 am request was accommodated. Would definitely go back.", "title": "Premier location in Rome", "helpfulness": 1, "user": "Littlejohn", "date": "March 2, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 57560144}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "Spent 5 wonderful days in Rome, and loved every minute of being at Casa Montani.", "title": "hidden pleasure", "user": "chilli29", "date": "January 28, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 54564295}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "Casa Montani's layout may be a bit strange for non-Europeans - it's actually a big suite in an office building, which they have converted into a lobby and 6 or 7 hotel rooms. While a little odd at first, it actually provides for a very quiet, comfortable home base during your stay in Rome. The hotel's location is fantastic - only a few steps from Piazza del Popolo, and a short walk from the Spanish Steps, Via Del Corso, and hundreds of shops and restaurants. Additionally there is a Metro stop 20 feet from the front door. The hotel is very modern and full of conveniences, with plenty of bathroom and closet space. While Casa Montani does state that they don't have a concierge, our only disappointment was that the women at the front desk - while very friendly - weren't always able to help us with questions about the city. Guiseppe (the owner) was more able to help, but he wasn't around that often. The hotel is a very good value in what can be a very expensive city, and I would stay there again.", "title": "Very nice boutique hotel in a great location", "user": "dyrewolf", "date": "September 21, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 80472754}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "Great Find!", "title": "Great Find :)", "user": "NYerLOVEs2TRAVEL", "date": "August 5, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 73860879}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "We had a great experience at Casa Montani. We started and ended our Amalfi Coast trip in Rome & stayed 3 nights at Casa Montani (2 in the beginning of our trip and 1 at the end).", "title": "A definite YES!", "user": "Marlzi", "date": "July 19, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 71434958}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "Not a full service hotel, but a perfect place to stay while in Rome. Great location (just outside subway stop & near Spanish Steps & Trevi Fountain, clean rooms, great Hermes amenities, working A/C & yummy breakfast! We loved our stay at Casa Montani! Stay in a suite if possible (more room & not much more $)", "title": "Luxury is so much more enjoyable when it doesn't break the bank", "helpfulness": 3, "user": "zetalambda", "date": "June 26, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 68740645}, {"rating": 4.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "This hotel was great! The staff was wonderful, helpful as well as friendly. We had two rooms and both were as comfortable as each other. It was just a short walk to the most wonderful shopping, restaurants and sites. I gave it a four for location as there were closer hotels to the Spanish steps, however, with the value for money and the quality of the hotel, walk the extra 5 minutes, it's worth it. This place felt like home and I would highly recommend it.", "title": "GREAT VALUE", "helpfulness": 1, "user": "CAMME85", "date": "June 23, 2010", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 68440755}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "This is a small lovely boutique hotel on a great location in Rome. We have stayed here twice and looking forward to come back soon again. Great rooms and superb service near Piazza Poppolo and the Spanish steps. For pleasure or business.", "title": "Great stay in Rome.", "helpfulness": 1, "user": "ilsvedese", "date": "June 16, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 67715846}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "Casa Montani was a very nice townhome with nice great design! Close to everything including the subway (which we never took) We walked everywhere and had a wonderful time there. Beds were comfortable and the bathroom was awesome! I would recomend to friends and I would stay there again!", "title": "Very nice", "helpfulness": 1, "user": "ttr0ut", "date": "June 10, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 67117595}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "Casa Montani is a true GEM. From the moment we walked in until are departure, we were extremely impressed the service and accomodations. Via e-mail prior to our trip, the owner of the hotel confirmed to have a car service greet us at the airport and deliver us to the hotel for 40 euro which was a fantastic after a long flight. The location is perfect for the BEST shopping, easy walk to Spanish steps, Pantheon and Trevi Fountain. The Metro is just steps from the front door making it a 5 minute trip to the Vatican, Colisseum and anything else you want to see! There is an incredible park just across the street that can be reached by taking the steps to the left of the Piazza- the perfect morning walk. The room is gorgeous with a modern yet comfortable feel. The owner and his staff were extremely friendly and the complimentary breakfast was always the perfect start to our mornings,delivered right to our room. My wife and I highly recommend this hotel, as it was much better than the other hotels we paid more for in Rome. Enjoy!", "title": "LOOK NO FURTHER! YOU HAVE FOUND THE BEST!", "helpfulness": 1, "user": "MBOregon", "date": "June 5, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 66556587}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "I loved everything about this hotel, we stayed in room 5. The room was amazing, with a great view of the street outside, and the windows kept all the noise out, we opened them and were amazed at the noise that came in. It was easy to get to everywhere we wanted to go from the hotel, and if you like the double decker bus there is a stop right across the street. The breakfast was amazing, and they bring it right to your room. We didn't really use the mini bar, but at the end of the stay found out everything was free because we stayed for a extended stay. Would of been nice to know that at the beginning of our stay. They also used our room to give directions through the window but we were not in the room so I guess that was okay. The bed was so nice, I slept so nice the whole time I was there. Would recommend this hotel to anyone.", "title": "This hotel was amazing", "helpfulness": 1, "user": "aarellano242", "date": "June 2, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 66176459}, {"rating": 5.0, "stay_parameters": "Stayed April 2010", "text": "It was the friendliest place I have ever stayed. The attention to the details. Impressive. Thank you for making my visit so wonderful.", "title": "150% perfect accomadations", "user": "Jeepdrver", "date": "May 24, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 65215715}], "location": {"country": "Italy", "region": "Lazio", "continent": "Europe", "city": "Rome"}, "stars": 3, "variance": {"poor": 1, "average": 3, "very good": 29, "terrible": 2, "excellent": 154}, "aka": "Casa Montani Hotel", "slim_ranking": 0.0512713630679}