{"user_rating": 5.0, "review_count": 929, "name": "Casa Camper Hotel Barcelona", "reviews": [{"rating": 2.0, "title": "cool hotel but beware of security!!!", "text": "my family stayed here for 6 nites over christmas/new years. i booked it due to the reviews and it is a very cool place as most people have stated. so why the mediocre review? as my family and i were checking in we were told to leave all of our luggage at the front desk and to take a quick tour of the main floor. we were assured it was safe. the tour took all of a few minutes and when i returned, my knapsack was not there with all of my electronics and personal items. the check in manager said it was impossible and it never happened there. she also went on to question if i even had the bag since she had not seen it - though i had just given her my passports from the bag. i was told they would check the surveillance video and let me know if thay found anything. well of course the video showed someone lurking and stealing my bag when the front desk people turned their backs.", "helpfulness": 26, "user": "coreyman97", "date": "February 20, 2007", "id": 6818656}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "i was told to go to the police station and make a report and they would see what they could do to compensate me with insurance. there is a fair amount of this petty thievery in barcelona so i was advised to come back real early the next day when i could take care of it in 1 hour rather that 3 or 4 as there were many similar cases. after making the report i was advised by casa camper that they were not insured unless i was mugged or physically had the bag ripped away from me. even though i was told by the hotel staff to leave everything and it would be safe, they couldn't do anything. they did say that i would receive a 15% discount on my stay - 2 rooms for 6 nites. while i appreciate the gesture it amounted to about 25% of what i had lost. i have emailed the owner of camper on 3 occasions to see if an organization as professional as theirs would \"do the right thing\" but i have not rec'd a reply. so just beware - the hotel is cool and our stay was enjoyable. but keep your bags and items close to you and when you are told to leave your belongings and they will be safe - DON'T DO IT!!!", "title": "Loved it.....", "helpfulness": 6, "user": "applemouse", "date": "January 24, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 6654569}, {"rating": 4.0, "title": "Pedestrian Chic", "text": "We stayed in a suite for 3 nights covering the New Year Period. The room was large and had a combined living room/bedroom, the room was extremely quiet and the bed was exceptionally comfy. There are so many good ideas in this hotel in regards to design, comfort and practicality. The 24 hour cafe was an excellent idea as you could help yourself to teas/coffee, soft drinks and food whenver you wanted.", "helpfulness": 8, "user": "Kradjian", "date": "January 23, 2007", "id": 6649860}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "Definitely of the best hotels I've ever stayed in. This is what hotels should be like. The staff were very helpful and friendly and all speak excellent english.", "title": "A Jewel In Barcelona", "helpfulness": 9, "user": "LittleLady123", "date": "January 6, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6559537, "likes": {"liked": "— Service and 24hr Inclusive drinks and snacks", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled with family", "text": "Stayed with my wife over New Years and concur with most of the reviews. The staff was excellent, especially Guillermo. The food lounge saved us an exceptional amount of money, allowing us to splurge on dinners. Location was central although if you have a lot of luggage take a cab as it sits on a tiny side street and typically very crowded. Very tight quarters but that is Europe. Don't expect elegance here, this is stricty an art nevaux atmosphere complete with somewhat tricky fixtures. Don't forget your electric converters! The shower was great and allowed us to replenish our resources after all the wonderful walking. The \"lounge\" room is seperated by a common hallway, however, served its purpose well when one spouse wanted to sleep and the other didn't. The sleeping arrangements kept it from getting a perfect score - the bed was small, a little uncomfortable and low to the ground. And the hallway is extremely noisy so if you are a picky sleeper may want to keep in mind. However, as an overall value this hotel is extremely hard to beat and we would consider returning.", "title": "Fantastic--One Of The World's Great Boutique Hotels", "helpfulness": 19, "user": "USAconcierge", "date": "January 3, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6548751, "likes": {"liked": "— Super-friendly staff, great breakfasts, best showers ever, great lobby", "disliked": "— They need to add some some good old-fashioned junk food, like cookies, to their 24-hour cafe"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "We stayed in the Casa Camper in March 2007 for a 3 night visit to Barcelona. We chose the hotel mainly based on the reviews in Tripadvisor and would agree that it certainly lived up to the glowing reports it has received.", "title": "Excellent hotel in a great location", "helpfulness": 2, "user": "Julytime", "date": "April 10, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7313098, "likes": {"liked": "— The relaxed atmosphere and great location", "disliked": "— Nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "It is a very modern hotel but is still very comfortable. The bedrooms are nice - very modern and the large shower area is nice. The 2 room idea is great - it's lovely to have a room other than your bedroom to relax in after a long day walking around the city. It was nice to be able to throw open the balcony doors and relax with a coffee while listening to the sounds coming up from the street before getting ready to go out for dinner. Also loved the fact that the all day snacks were included in the room rate.", "title": "Youthful and modern", "helpfulness": 4, "user": "Photopedia", "date": "April 2, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 7270501, "likes": {"liked": "— Friendly staff and convenient location", "disliked": "— Dark stark bedroom decor"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled with family", "text": "It's also in a great location - just off La Ramblas. I would certainly recommend Casa Camper to anyone planning a stay in Barcelona.", "title": "Service is what it's all about", "helpfulness": 1, "user": "freddiefrog", "date": "March 31, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7258936, "likes": {"liked": "— Friendliness and quirkiness.", "disliked": "— A strange smell in the hallway."}}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled with family", "text": "What a breath of fresh air. A unique experience....most of it delightful but one or two negative points.", "title": "Love the shoes, love the hotel...", "helpfulness": 2, "user": "LLSL", "date": "March 30, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 7252433, "likes": {"liked": "— Cool functional design, attention to detail", "disliked": "— We couldn't be in the same room as a family"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled with family", "text": "The positives (and there were many):", "title": "Practically perfect in every way!", "helpfulness": 3, "user": "CindyFRichmond", "date": "March 27, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7231669, "likes": {"liked": "— Great atmosphere and friendly, helpful staff", "disliked": "— There was nothing I didn't like!"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled with friends", "text": "I booked this hotel on the strength of the TripAdvisor reviews I had read and was certainly not disappointed.", "title": "Can not fault", "helpfulness": 4, "user": "Miss_L79", "date": "January 3, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 6546115}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled on business", "text": "Excellent hotel - I stayed there for 6 nights on a worktrip, and I must say that this hotel lived up to every single expectation of mine.", "title": "Casa Camper is the place to be at", "helpfulness": 3, "user": "ibboibbo", "date": "March 6, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6919938, "likes": {"liked": "— The design, very homey look and feel of everything", "disliked": "— uhm.. It would have been better if the lounge was connected with the room, but it really doesn't matter. Everything was great"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled solo", "text": "The staff is incredibly helpful and kind. The minibar is excellent, and the rooms were spacious and very comfortable. The rooms were also very homey, it didn't feel like I was at a hotel. The private lounge which comes with each rooms was a nice addition, it was great being able to relax in the hammock after a stressful day and reply to e-mails while listening to the street-life of Barcelona through the window.", "title": "A great place.", "helpfulness": 8, "user": "Natmandu", "date": "February 28, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 6892424, "likes": {"liked": "— Relaxed atmosphere", "disliked": "— Nada"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2007", "text": "I give this hotel a 5 out of 5. I would give it 6 out of 5, but I'm afraid that's not possible.", "title": "A relaxed, cool place", "helpfulness": 3, "user": "broomie", "date": "February 26, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 6841058}, {"rating": 5.0, "title": "My favorite hotel", "text": "I stayed at Casa Camper partly on the strength of the reviews on this site, and have to agree with everyone that said what a great place it is. This was my first time in Barcelona, and Casa Camper made it all the better. Close to La Rambla, and sat in the heart of the funky, arty, resurgent El Raval, the location is superb. The Mercado de la Boqueria is nearby, as well as several really good value cafes and restaurants. The Metro at Plaza de Catalunya is ten minutes walk, giving access to everything in Barcelona.", "helpfulness": 4, "user": "Arie-Mordejai", "date": "February 26, 2007", "id": 6840261}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "We thought this trendy modern hotel was terrific. Incredibly friendly and helpful young staff. Terrific included breakfasts. Best possible location. Clean room and bath, with well-planned shelving much more useful than bureaus. We took a junior suite which was worth the modest price difference. All in all, we enjoyed this hotel as much as any on our recent European trip.", "title": "Terrific find - has it all - location, staff, cleanliness, breakfast", "user": "dannyboy2_10", "date": "May 19, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 64761950}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled with family", "text": "2 Adults and 2 young children (ages 5 and 1.5) stayed one night after overseas plane trip here. Arrived during very busy holiday (St. George's day) about 10 am. All staff was friendly and spoke English well, room on second floor was ready on arrival, a Bell-man acted as a guide and went around showing us were things were. Crib for youngest was available in room on arrival. Nice food for snacking was available all day, and made to order breakfasts that were terrific the next morning. Place was quiet. Didn't see a single smoker in entire place. Very helpful staff that gave us directions on where to go and how to get to the Subway system.", "title": "Excellent", "user": "drbryguy", "date": "May 15, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 64210937}, {"rating": 4.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "We had a main room with a separate room across the main hall that was like a sitting room but had a sleeper bed, also had a hammock in it that our children loved (but did involve the entire length of room and was over tile so I didn't allow playing with it without supervision). Lots of activity that could be heard from this separate room outside if window/door opened, but this was the only noise heard from outside the place.", "title": "Agree with others - it's different!!", "user": "patnlcc", "date": "May 4, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 63250004}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled with family", "text": "Main room had nice bathroom with shower that overlooks a wall that had planted trees in pots in them and this was a nice touch. Our 5 year old loved the shower that had 3 different water sources and you could 2 of them at the same time (Wand, Bidet and overhead sunflower). Completely private.", "title": "I'll be back !", "user": "Jorge010", "date": "May 1, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 62975072}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "We only booked this place a couple of weeks before we went, and e-mailed them questions about the crib and families of four staying there before we booked; they immediately answered our emails within minutes in English. Moderately more expensive than nearby locations but we thought this was well worth it.", "title": "Unique, contemporary, chilled, lux minimalism in fab location", "helpfulness": 1, "user": "Herts02", "date": "April 18, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 61837041}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "This was our second trip to Barcelona, the first time we stayed at the Hotel 1898 which is also superb, but out of the two, we honestly prefer the Casa Camper.", "title": "Brilant hotel", "user": "contented_wanderers", "date": "May 30, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 65813777}, {"rating": 4.0, "stay_parameters": "Stayed May 2010, traveled on business", "text": "This hotel has an ultra modern and stylish interior with an almost Swedish feel. We had booked one of the suites which was a nice size with it's own seperate living space. All the bedrooms look into a private courtyard, so you always got a good night sleep. The staff were very friendly and helpful and it's location just off La Rambla was ideal.", "title": "Great service, perfect location", "user": "Olivia81", "date": "May 30, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 65792851}, {"rating": 5.0, "title": "Great hotel for the 3rd time", "text": "The 24 hour free buffet is a brilliant idea and very handy when all you want is a quick snack or drink.", "user": "orionyh", "date": "May 28, 2010", "id": 65575626}, {"rating": 4.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "People with more traditional preferences may find this hotel too modern at first glance, but should really give it a go as it is comfy and welcoming and hammock sleeping isn't compulsory!", "title": "Back in Eaurope", "user": "zimmermanmk", "date": "May 22, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 64991503}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "But beware of taxi drivers who rip you off!!", "title": "You're Really Gonna Like This Place", "user": "LivnBtr", "date": "May 21, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 64910918}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled with family", "text": "This is a gem of a hotel and had all of the things we wanted:", "title": "perfect for us", "helpfulness": 2, "user": "BaaCheshireUK", "date": "April 12, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "business": 4.0, "cleanliness": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7338128, "likes": {"liked": "— small hotel", "disliked": "— no bike for 11 year old"}}, {"rating": 5.0, "title": "Highly recommended", "text": "Location: Perfect. Near La Rambla, Placa Catalunya, El Corte Ingles department store, metro station, and many buses. 10 minutes by bus to the beach, 10 minute walk to Barri Gotic and El Born.", "user": "Baixas", "date": "February 13, 2010", "id": 55873534}, {"rating": 5.0, "title": "Loved it!", "text": "Service: Excellent. All the receptionists are very helpful and very nice. They made restaurant reservations for me, internet searches and phone calls to get information. All you have to do is ask and they are happy to help.", "user": "Julia R", "date": "February 2, 2010", "id": 54996533}, {"rating": 5.0, "title": "in love with barcelona", "text": "Breakfast: Excellent with many choices: cereal, muffins, cheese, fruit, and fresh orange juice. You can also have eggs or pancakes.", "user": "troymonster", "date": "February 1, 2010", "id": 54915620}, {"rating": 5.0, "title": "i am very particular about hotels and we LOVED this place!", "text": "Food: Available all day long. There’s soup, sandwiches, juice, yogurt, bread and cheese.", "user": "camjwg", "date": "January 14, 2010", "id": 53452307}, {"rating": 5.0, "title": "Excellent service", "text": "Room: Suite is very quiet and clean. I slept very well. There are two TVs and a hammock. I would have liked more closet space but that’s just nitpicking.", "user": "Oceans14", "date": "January 7, 2010", "id": 52831152}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "The most quirky and genuinely welcoming hotel I've stayed in. The staff are helpful and will investigate any question you have (we were inquiring about nightclubs and restraunts a lot). The 24 hour food is an original and convenient idea. Loved the showers and the lounge too. The hotel is right beside Las Ramblas so within walking distance of everything. Highly recommended.", "title": "It's all good.", "helpfulness": 4, "user": "geeinau", "date": "December 30, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 6520337, "likes": {"liked": "— Design/Staff", "disliked": "— Hard Water Area"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "PS- WATCH YOUR WALLET. Pickpockets are everywhere in Barcelona. Keep your wallet in an inside pocket if possible. Be careful in the back streets around Las Ramblas and on the escalators in the Metro. The bastards tried to steal my wallet twice in three days!", "title": "Very very cool", "helpfulness": 5, "user": "AC-Elite", "date": "December 17, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 5.0, "rooms": 5.0}, "id": 6453598, "likes": {"liked": "— Exceptional staff", "disliked": "— Lack of bathroom privacy"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "While Casa Camper isn't cheap, it is certainly an exceptional and unique hotel experience. Much has been said about the very cool styling of the rooms and some of the innovative concepts (all day complimentary snacks and drinks), but what really makes this place stand out is the exceptional service and friendliness of the staff.", "title": "An Unusual Hotel with Great Service", "helpfulness": 8, "user": "Anononymouse", "date": "December 12, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6367138, "likes": {"liked": "— Friendly helpful staff and location"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2006", "text": "GREAT THINGS:", "title": "My Favorite Casa", "helpfulness": 8, "user": "ricop", "date": "November 28, 2006", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6231349}, {"rating": 3.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "My partner and I spent two nights in a \"suite\" here in March. We left with mixed views.", "title": "Mixed feelings . . .", "helpfulness": 2, "user": "TipperaryStan", "date": "April 15, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 61409104}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled with family", "text": "On the one hand, the staff are very friendly and eager to please. On the other hand, and as noted elsewhere, the hotel has certain aesthetic issues i.e. it is quite dark, gothic even. Not surprising given that it is located in a narrow sidestreet off Las Ramblas.", "title": "Excellent hotel", "user": "christosgrGreece", "date": "April 12, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 61119714}, {"rating": 2.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "For some reason I was faintly excited at the thought of the free 24 hour buffet. The food, however, on offer in canteen style fridges did not look especially appetising although I did bump into a guy early on Sunday morning who had clearly been out for most of the night and was happy to eat anything and everything on offer. Breakfast was nice.", "title": "Friendly staff but dark and depressing hotel", "helpfulness": 12, "user": "Tatiana10", "date": "April 11, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 5.0}, "id": 61013583}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled on business", "text": "As for the suite, well it was . . . quite dark. Querky, yes, decent bathroom and comfortable bed, yes, hammock, er . . . yes, but still not altogether a satisfying or overly comfortable experience.", "title": "there are hotels and then there are hotels", "user": "Herbert&Zil", "date": "March 29, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 59827358}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "Still, if you are after a somewhat avant garde and well located hotel in the centre of Barcelona it ticks all the boxes; I probably would stay there again although not for long. It is pricey and . . . quite dark.", "title": "What a great place to stay!", "helpfulness": 2, "user": "Gra_ob", "date": "March 2, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 57497921}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled with friends", "text": "Casa Camper is a very unique hotel in the El Raval section of Barcelona, relatively close to the top of the Ramblas.", "title": "Excellent stay at unique hotel.", "helpfulness": 7, "user": "rsp1", "date": "June 2, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7741779, "likes": {"liked": "— accomodations and location", "disliked": "— Not cheap"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled with family", "text": "The location is great -- Raval is roughly equivalent to the Lower East Side / E Village of New York (many students, hip scene, etc.). The hotel is close enough to the Ramblas to make anywhere in the city an easy walk (Gothic/Born, Pl Catalonya, etc).", "title": "Casa Camper Excelente!", "helpfulness": 1, "user": "chgowanderer", "date": "May 28, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 7706576, "likes": {"liked": "— The seperate mini lounge", "disliked": "— No complaints"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled solo", "text": "The hotel itself is interesting. The \"rooms\" are really composed of two separate rooms (divided by the hallway). The main room has the bedroom and bathroom. The second room is a lounge with hammock and desk and large framed wall-map of the area.", "title": "superb in every way", "helpfulness": 1, "user": "tama99", "date": "May 22, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 7670205, "likes": {"liked": "— amazing location and excellent service", "disliked": "— there is nothing I didn't like - any concern I had was take care of immediately"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "The bedroom has a flatscreen, safe, Tivoli radio (with aux input for ipod). Storage space is plentiful and there are some creative touches in the bathroom area. The lounge has another flatscreen and telephone. The whole hotel has free wifi. Surprisingly, there was turndown service in the evening. The best touch, however, is the free food/drink available 24/7 in the lobby (soda/bottled water - even redbull, snacks, coffee, sandwiches/salads, etc).", "title": "A unique hotel", "helpfulness": 3, "user": "sgbslo", "date": "May 16, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 7631050}], "location": {"country": "Spain", "region": "Catalonia", "continent": "Europe"}, "stars": 4, "variance": {"poor": 10, "average": 15, "very good": 109, "terrible": 4, "excellent": 791}, "aka": "Casa Camper", "slim_ranking": 0.00381679389313, "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.5, "rooms": 4.5, "location": 5.0}}