{"user_rating": 5.0, "review_count": 81, "name": "Casapapaya B&B", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "We spent two nights in Casa papaya in august and we had a perfect stay. Hosts are really friendly and helpful, they gave us very good advices for our stay in San Miguel. We had lovely discussions s and they even let us use their washing machine for free ! They have a very nice dog named \"Bush\" who loves to play. We took the king room which is very comfortable ! It was spoteless and there is fresh water available 24h in the kitchen. They also provide a free wi fi access. Breakfast is excellent, with fresh fruits, cereals, yogurts , pastries dans toast. It's well located, a 10 mins walk down hill to the center. To go back, it's easy to take a cheap taxi or a bus. If we go back to San Miguel we'll definitely go back there !", "title": "Lovely stay with lovely hosts !", "user": "fifinou973", "date": "September 14, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 79514658}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "I had a lovely time in Casa Papaya. I found out about it through TripAdvisor and I am so glad I chose this place. It is a charming little place little bit outside the center of the town. It was very easy to get to the place from the Central Bus Station. It took about $40 pesos to get there. Cheap!", "title": "Lovely Stay in Casa Papaya", "user": "hanarei", "date": "August 14, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 75182702}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "Julia and Stan are our hosts and they were wonderful. One of the friendliest hosts that I met! Thank you, guys! I was there with my bf for only three days and wanted to stay longer to explore other places. The breakfast they provide is amazing! I think I gorged on fresh papaya because they were so tasty.", "title": "Great hosts make this place special", "user": "ViajeroCraig", "date": "July 25, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 72265472}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled with friends", "text": "What else can I say? Yes, the room was very clean and spacious. We got free wi-fi internet access. The bathroom water was nice and hot. Everything was lovely. The dog Butch was super-friendly and a big puppy.", "title": "Visiting Old Mexico and seeing...", "user": "railay99_online", "date": "July 15, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 70961868}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled with friends", "text": "The only slight issue people might have with the place is that it is a bit away from the town center. It's not too bad about 15 mins walk away. However, coming back to the place, you do have to climb a steep hill. It's an easy bus or even taxi trip away.", "title": "Casapapaya - Yeah!", "user": "takeatrp", "date": "July 3, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 69573817}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "As previous reviewers wrote repeatedly, Casa Papaya itself is an unforgettable experience. The hospitality of the hosts, Julie and Stan makes the place so special and unique that any traveler will leave SMA with an unforgettable memory in his or her heart. Honestly I enjoyed their company much more than SMA itself.", "title": "An unforgettable experience", "helpfulness": 1, "user": "humble_drinker", "date": "September 20, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 118368640}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "Casa Papaya is located in a quiet and relaxing residential area, so that you don’t have to worry about street noise. It takes about 10 minutes on foot to the center of the town, which was quite a pleasant walk through narrow winding streets. Coming back from the center may be difficult for some people, since the house is up in a steep heel, but you can take easily a taxi, which costs only 30 Mexican pesos or so.", "title": "Just what we wanted!", "user": "jarybra", "date": "August 25, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117225911}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled solo", "text": "They have two rooms: the King and the Queen. Both rooms are great, spacious, well equipped and exquisitely decorated. The house has a small patio filled with bugambilias, and other plants, a huge kitchen, which they allow you to use, a dining area in front of the kitchen where you can lounge around.", "title": "Great place to stay", "user": "brosoLA", "date": "August 13, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116678402}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled solo", "text": "Breakfast is also great. They serve you freshly brewed coffee, orange juice, bread, fresh fruits, yogurts, cereals, eggs of your choice, bacons and sausages.", "title": "I felt safe and well taken care of.", "user": "jeannette78028", "date": "July 29, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115964637}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "They allow you to use their garage free of charge, so it is very convenient for those who travel by car.", "title": "A wonderful experience created by two great hosts!", "user": "JBBotti", "date": "July 13, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115337596}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "Casa Papaya is THE place to stay in San Miguel if you are looking for a beautiful and comfortable B & B. Stan & Julie are two of the most generous and caring people we have ever come across, ANYWHERE! We woke to a breakfast fit for a king every morning, stuffed ourselves with Stan's fabulously prepared breakfasts: fresh fruit, yogurt, bread, cheese, eggs, bacon, sausage, ham, pancakes & cereal—or anything else we could possibly want to eat.", "title": "They make you feel like good friends!", "helpfulness": 1, "user": "BrooklynJacki", "date": "July 12, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115282770}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled with family", "text": "Stan & Julie will help you with anything you need or desire. Julie arranged great day trips for us and knows everything about San Miguel from spas to shopping to restaurants. Her Spanish is excellent, making Casa Papaya a great fit for Spanish-speaking people as well. The location is perfect, just a short walk to the center of town. There is even a shopping mall a 5 minute walk away. The pictures on their website do not do the rooms justice. They are beautifully decorated, spotless, and with gorgeous bathrooms.", "title": "Your vacation the way you want it.", "user": "sweet60745", "date": "May 18, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 108848918}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "My husband's snoring kept me up the first night and as soon as some other guests left they told me to sleep in the other room so I could get some sleep. I was so grateful for that! Their dog Butch adds to the feeling of love at Casa Papaya! Stan & Julie are such awesome people that when we return to San Miguel we will definitely stay with them again. They really made our trip special. Thank you Stan & Julie!", "title": "Above and beyond times a million!", "user": "Geneva915", "date": "May 13, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 108135187}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled with friends", "text": "When you find a B&B this reasonably price, you expect some corners to be cut, but that's not the case with Casapapaya. This little place is cozy, friendly, clean, quiet, and authentic. It's a quick cab or bus ride into town, and we liked that it wasn't IN town because San Miguel can get bustly.", "title": "Exceptional", "user": "Wendy154913", "date": "March 28, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 101940896}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled solo", "text": "Julie and Stan have all the bases covered. Julie has been around the world doing corporate training, and she now does online graduate level courses for U. of Maryland. She can rattle away on any subject, show you some cool places to shop...or leave you alone. Stan is a tough Brit who's lived on the wild side--convoying food to war-town Bosnians or digging tunnels in the London Tube--and somehow learned to cook along the way. He'll escort you to his \"private\" rooftop pool table, the abandoned silver mines up the road...or leave you completely alone.", "title": "What a wonderful introduction to my new hometown!", "helpfulness": 1, "user": "turkishraspberry", "date": "March 16, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 100445940}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "We stayed at the Casapapaya B&B for 3 nights (in the King Room). Our delightful hosts, Stan and Julia, made us feel very welcome. They gave us a map with important sites noted and information about ongoing events in San Miguel.", "title": "Wonderful hosts, great breakfasts, exceptional value!", "user": "ElderTrekkers", "date": "March 9, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 99552107}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled with family", "text": "Stan made fabulous breakfasts which we enjoyed on the covered terrace. There is also a rooftop terrace for relaxing with fabulous views over the city and the lake beyond. It was very helpful to be able to use Julia's laundry facilities to wash and dry our dirty travel clothes.", "title": "great hosts and great breakfasts", "user": "johannsebastionbark", "date": "February 17, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 97045622}, {"rating": 5.0, "stay_parameters": "Stayed September 2010", "text": "Their home is located in a quiet residential area above the Mirador. We enjoyed our walks both down to and up from the central square each day. In the evenings we always stopped at the Mirador to admire the lights below.", "title": "THE BEST place in San Miguel", "user": "ruttah", "date": "January 26, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 94525391}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled with family", "text": "We especially appreciated Stan giving us a ride to the bus station at the end of our visit. Overall we felt that this B&B was exceptional value for the money. We can happily recommend this cheerful spot to others.", "title": "More comfortable than our own home", "user": "AirlineEmployee84", "date": "January 4, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 91755390}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "Our extended family of five, ages 16-89 spent five days at Casapapaya. Julie and Stan were wonderful hosts. Stan prepared awesome breakfasts and Julie gave us great suggestions for activities, restaurants and more. The accommodations were spacious, comfortable and great value. Although the B&B is not in the center of San Miguel, bus service is frequent and taxis are always available. We also discovered some beautiful paths and streets to walk down to the center.", "title": "Relax and enjoying the town", "helpfulness": 1, "user": "laurentp001", "date": "December 4, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 89035888}], "location": {"country": "Mexico", "region": "Central Mexico and Gulf Coast"}, "variance": {"poor": 0, "average": 0, "very good": 0, "terrible": 0, "excellent": 81}, "slim_ranking": 0.0740740740741, "description": "Lovely B&Bs working together in quiet Mexican neighborhood close to movies, Tuesday market, and Botanical Gardens. Great beds. Quiet rooms. Wifi, full breakfasts, beautiful gardens, help with tours, spa services, and transportation needs. Can accommodate children. Three rooms in Casa Papaya and two in Casa Papaya Secreta. Friendly dogs. Breakfast separately or together as you choose. Easy walk to Centro down hill. Come and join us Julie & Stan, with new partner, Laura."}