{"user_rating": 4.5, "review_count": 119, "name": "Cascada de las Animas", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "We were there in an off-peak time (temporada baja, May) and really liked it. Stayed in the EL MAITEN cabana - small but clean and comfortable. We bought a package for 300 US Dollar including two nights , breakfast, rafting, a great dinner a la carte, a beautiful sauna, tirolesa, and a hike. Value for money and a great expreience. A \"but\" - the place is really badly lit in the night so bring on a torch. The other small but was that staff - even though friendly - had no clue about the package we had purchases - so we had to discuss all the time. However, in the end there was no problem and people were friendly. And before I forget it - they should clean the clothes better they give you for rafting!", "title": "Nice place for people who like outdoor activities", "helpfulness": 2, "user": "soyporteno", "date": "August 4, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 136222199}, {"rating": 4.0, "title": "Sanctuary is beautiful, lodge is fabulous, but restaurant and info center need help...", "text": "First and foremost, I would have gave them an \"excellent\" rating, but the restaurant and info center need to learn some lessons. Here is my honest an unbiased review of Cascada de las Animas.", "helpfulness": 6, "user": "Gringo66", "date": "July 19, 2012", "id": 134869486}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "The good: The sanctuary is beautiful beyond a doubt! The waterfall/cascada is very precious! The lodges are built very well and awesome! I really loved the bed and bathroom. The shower was wonderful, just be careful you don't spend too much time in it as the hot water will disappear after, say 15 minutes. The lodge staff were very nice and helpful. Last, but not least the breakfast was delicious: eggs, homemade breads, juices, kuchen, fruits, palta, and half decent brewed coffee. I would definitely suggest the lodge for its uniqueness and comfort.", "title": "Lodge Suites/ zip line/horseback ride - all highly recommended", "helpfulness": 5, "user": "travelcrazy58", "date": "June 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 132329498}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled with friends", "text": "The bad: The staff at the information center were not very friendly. Not what I would expect from a place were customer service is a must needed quality. I entered the center and was not greeted at all. I had to be the one to say hello first and that was after I was inside for more than 30 seconds. Not to mention when I asked to buy a water, they did not react to fast to attending to me. What happened to the customer comes first?", "title": "Good Option for a Day Trip", "helpfulness": 2, "user": "Foxguevara", "date": "May 22, 2012", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 4.0}, "id": 130434809}, {"rating": 4.0, "title": "Not For the Faint of Heart", "text": "The ugly: The restaurant needs to keep the dogs and cats out of the restaurant areas. Inside we had to tell one cat to \"beat it\" more than once. The waitress knew it, but did not remove the cat. Also there was a dog inside the restaurant sleeping on the sofa available to customers. I love dogs, but in a restaurant, not. Even outside on the patio a dog was begging for food at the tables, not to mention stealing food at the waitress area.", "user": "Trompetista89", "date": "May 6, 2012", "id": 129477387}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "We stayed at the Cascada de Las Animas in late 2009 and had a very interesting stay, we walked to the waterfall, had lunch and an evening meal in the very unusual restaurant right by the mighty Maipo River, very good food an interesting experience. We chose to do a horse ride up into the Andes, just a couple of hours, how exillerating do you want life to get? Treking along a trail just 60 cm wide with near vertical drops to the Rio Maipo with just very large thorny cactus to break your fall if unlucky, poor horse with me on it, it had to stop fairly frequently to get it's breath back, but what an experience and really good value. We were quite surprised to see Condors, we thought they were mythical, but no we saw six on one day, they are just so huge, really, no joke I have seen nothing bigger flying you start off seeing small specks circling in the sky and then they fold in their wings and drop like a stone and then spread their wings again and just fly!", "title": "Unusual and exciting stay", "helpfulness": 4, "user": "Jack D", "date": "February 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 151269056}, {"rating": 1.0, "stay_parameters": "Stayed July 2012, traveled with friends", "text": "I booked a stay in the cabins this past July for a group of volunteers who were working in Santiago. It was a great way to get out of the city and relax after a week of very hard work. While my group enjoyed the experience, the headaches I had to deal with from the staff have were more than enough for me to advise the volunteer organization to absolutely never recommend this place to groups again. However, I have since heard that another group went after ours and had similar unauthorized charges appear.", "title": "Warning: Check Your Credit Card Statements", "helpfulness": 2, "user": "ehclaire", "date": "January 7, 2013", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 1.0, "sleep": 2.0, "rooms": 3.0, "location": 5.0}, "id": 149120663}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "From the start when I was making all the arrangements, I was told that not everything would be available, as it was the winter. Since some of the activities are packaged together (wine tour, zip-lining, etc.) I inquired as to whether we would be advised of the conditions in advance and if we would still be charged the full price if we were unable to take part in all the activities for which we had signed up. Unfortunately that seemed to set off the woman with whom I was corresponding and all communication henceforth was extremely unpleasant, to say the least.", "title": "You must come here.", "helpfulness": 2, "user": "Jose M", "date": "December 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 148298147}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "After that point I noticed that the prices on our invoice had mysteriously increased. The transportation that was supposed to be included in the wine tour was now extra and I was being charged an exorbitant price. At first I offered apologies, thinking that there had been a misunderstanding when making the arrangements, as I do not speak much Spanish. I was very curtly told, no, the transportation was not included in my situation.", "title": "Adventure and Nature", "helpfulness": 2, "user": "Diego_Navigator", "date": "December 28, 2012", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 5.0}, "id": 148238949}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "At one point after coming back from dinner, one cabin found that they no longer had any hot water. I called the information desk to see if someone could come out to fix it and was told \"I don't speak English\" and was hung up on. I tried again, using my broken Spanish to explain that we had no hot water but could fix it ourselves if they told us how, and again was hung up on. The volunteers then took it upon themselves to find and fix the water heater so it was no longer an issue.", "title": "Wonderful scenery, great activities", "helpfulness": 2, "user": "MarkkuH2", "date": "December 12, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 147347390}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "Close to Santiago and full of activities to do. And just an anecdote: I left forgotten my Ray Ban sunglasses at the restaurant the last night I stayed there. The next day I called and the staff had my sunglasses in good storage. They told me \"nothing ever get lost here\" Guau, nice", "title": "Perfect weekend getaway", "helpfulness": 2, "user": "Macarena_LB", "date": "March 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 155241677}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "WOW! What a great stay. We originally looked for something close to Santiago for a long weekend. We originally were looking to spend some time at one of the thermal baths. So I looked at Termas de Colinas, but found out they were more than an hour away. We opted for the stay anyway. Originally, we booked to stay in the Hostel but we were pleasantly surprised that a cabin became available when we arrived. The cost was about 20,000 CLP more per night but we decided it would be a well spent 40 USD… We arrived around noonish and were greeted with open arms and welcome smiles. I was a bit surprised because on the phone, the young lady seemed a bit tired and pre-occupied with other things. Pleasantly we were greeted with cold water to drink and a smile. Upon checking in and paying for our cabin we were shown where our cabin was located and asked if we wanted help getting there. I should mention that when you make the reservation, a 50% deposit is required of which only portions are refundable depending on the time frame involved. It will be wise to read the T&Cs required for any changes or cancellations. Once we got to the cabin, a lady greeted us with the key and showed us in. She made sure we had clean towels and asked if anything else was needed. It was very kind of her to ask as (from reading other reviews) I was concerned about the hot water. I asked her and within 10 minutes a man was there to light the hot water heater. We had steaming hot water all weekend! After settling in and deciding we for sure would not make the Hot Springs, we took a short walk around the place. It was beautiful. The outside of the cabin was separated by trees and bushes etc. so you had the feel of seclusion. The Walnut trees were huge and beautiful and offered plenty of shade for the area. The grape arbor next to the house was teaming with some of the sweetest grapes I have ever tasted. We walked down to the “Information Cabin” and asked around about what to do. We decided on an all day horseback trek up the mountain with lunch provided. It was a little spendy but well worth it just for the views! We also opted for a massage and reflexology after the horseback ride AND (like dummies) we signed up for a river raft ride the following morning. We then retired to the restaurant for a light appetizer of Shrimp and Mushroom Pil Pil. Pil Pil is basically sauté in butter and garlic with a few other “secret” herbs and spices. This was some of the best we have had in Chile. Done to perfection, the shrimp were very tasteful and just the right size; not the little tiny eraser shrimp not were they the giants…just right. Additionally, the whole rafting and horseback team came over to the restaurant and made a large fire in the fir pit. We sat there talking and telling lies to each other for some time before my wife reminded me that they were in the mid twenties and didn’t need a bunch of people in their mid fifties hanging around! Their hospitality was gracious and we could’ve stayed all night with them, but the truth is, we were tired and had a big day coming!", "title": "Fun for everyone in the group!", "helpfulness": 3, "user": "BillyAbroad", "date": "March 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 154373430}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled with friends", "text": "Well, the horseback ride up the mountain was a little more intense than what I had anticipated as the trail was sometimes very narrow. But, my wife and I felt completely safe in the hands of our guide CRECHO. He was great! The horses were very gentle and easy to ride. The climb to the top was full of spectacular views of the Maipo River Valley, “Cajon de Maipo”, and the ride was enjoyable. Atop the mountain we took a quick (very quick I might add) in a spring fed stream of water that had a section of pool. I thought it was fed by a glacier! Then we had a fine meal of grilled steak, rice and some of the best Chilean Pebre I have tasted. Of course there was plenty of delicious tomatoes and avocado salad as well. Lunch was topped off with a desert of “banana peaches” that Crecho brought along. After dinner we took a short nap in the Hammocks that near the lunch area and took in the beautiful view. The trip down was a little long, but beautiful scenery made it pass. Yes, we were sore! We couldn’t wait for the massage! We had a short hour or so before our massage so we showered off and walked to the pool area where the massage “hooch” was. It was very relaxing and SOLDAR (pronounced sole dar I think) gave the best massage I have ever had! Now I am not an expert on massages but I couldn’t imagine it being any better. It hurt, but in a good way after a full day of horseback riding! After the massage the we opted to go to the restaurant and order rather than cook and we split the grilled Salmon. It was to die for. Cooked to perfect and not dried out! Delicious!", "title": "GREAT!!!!", "helpfulness": 4, "user": "cruisinbob", "date": "March 11, 2013", "detail_rating": {"value": 5.0, "location": 5.0, "service": 5.0}, "id": 154301815}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled with friends", "text": "Well, needless to say, I was ready for the rafting trip the next morning but my wife was not. Once she got to mentioning how her legs, arms, hips, back, thighs, and everywhere else on her body hurt, I agreed and then got out of bed. WHOA… I was out of horseback riding shape! We laughed at each other and decided to cancel our raft trip and opted for building a small fire outside, drank coffee and cooked breakfast.", "title": "Excellent combination of open air activities", "helpfulness": 3, "user": "FlyingRobert", "date": "March 7, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 153908343}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled with family", "text": "All in all in was a great trip. The service was fantastic and the accommodations were great. There was plenty to do; there was a zip line across the river, a canopy line (a zip line from tree to tree that looked fun), winery trips and anything else you could think of to do. There were additional charges for the extra stuff, but most of the prices were reasonable. The restaurant was an excellent value. The staff, from Crecho on the horses and Alex on the “Safety Kayak” there were never times when you were not attended to! I must say that we went the first of March, so it was not crowded on the week days and picked up on the weekends, so there were plenty of people to help us! A great staff; A great place and a great time was had by all!", "title": "Unique, unforgettable and beautiful experience", "helpfulness": 4, "user": "aho682", "date": "March 2, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 153547695}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "My daughter is going to college in Santiago, Chile and my husband and I recently went to visit her for two weeks. While she was in school during the week, we decided to leave town for a little getaway. I did research on Tripadvisor and liked what I read about Cascada de las Animas. This place is beyond wonderful. As others have said, the luxury suites at the lodge are like living in a fairytale. Much of the property is made with geodesic dome structures but the suites are shaped like mushrooms with whimsical wings on the windows. Some of the suites have a skylight to look at the stars at night. The number of stars and the galaxies that can be seen with the naked eye are amazing. There are cabins and camping accommodations as well as horseback riding, swimming, kayaking, zip lining, canopy zip lining, hiking, rafting and tours of the wineries in the area. We had a van pick us up at our hotel in Santiago and return us to the same location for $70.000 Chilean dollars which is about $140 for both of us. It was worth not having any hassles and the van was very comfortable. The best part though, was meeting the staff that run the lodge. We were greeted by a beautiful young lady named Maria Salvador. She showed us to our room and gave us towels for the private pool, just for lodge guests (beautiful, but not heated by the way). My husband and I hiked to the Cascades. It was a nice easy trail but pretty views. The next morning, we had breakfast at the lodge. They had a fantastic spread but also a chef that offered to make us anything we wanted to eat. My husband had french toast and I had eggs. The food was outstanding. At that time, we met David, the brother of Maria. He was extremely professional and runs the lodge like a 5 star hotel. He was a wealth of knowledge about Chile, the area and just a wonderful guy. By the way, he speaks English. By the end of the stay, we felt like we were family, and we were only there for 3 days. We have traveled throughout the world, and this place is now number one on our list. It is a wonderful get away that is only about 1 hour and 20 minutes from Santiago. The cost for the suites is $100.000 or about $200 dollars. Well worth it when you compare it to what you get for that price in Santiago.", "title": "beyond wonderful", "helpfulness": 2, "user": "wunderful", "date": "April 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 157625745}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "WOW! Our second last night on a three week trip to Chile, and we stumbled across this resort! We stayed in one of the unique, fairy tale cabins at the lodge. You have to see them to believe them! They are spacious and clean, and if you wake up in the middle of the night, you can see the stars through the window in the ceiling. The price included a wonderful breakfast, complete with freshly made scrambled eggs. The resort also offers activities such as canopy/zip lining, whitewater rafting, hiking, etc. for sports enthusiasts. Highly, HIGHLY recommend a stay here.", "title": "Cascada de las Animas - San Alfonso", "helpfulness": 2, "user": "DeniseLCalgary", "date": "March 31, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 156160884}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "I went to stay at Cascada de Las Animas with my wife and kids this March and words would fall short of the unique experience we had there. We were staying in one of their newly build lodges, which almost made us believe we had stepped into a fairytale. The architecture and commodities were simply marvelous, and the prices are more than reasonable.", "title": "Like a fairytale!", "helpfulness": 2, "user": "Alan D", "date": "March 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 155974610}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled solo", "text": "Included in our stay was a wonderful breakfast and a complimentary guided walk to the waterfall, which is an absolute must-see.", "title": "Wonderful place - easy getaway from Santiago", "helpfulness": 2, "user": "louxx", "date": "March 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 155732616}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "The next day we found out that Cascada is not only a wonderful hotel, but actually has a wide range of activities available. We decided to book a rafting trip, which was our first time so we were a little bit nervous. As it turned out, for no reason at all. The staff was very professional and after an extended safety speech they gave us a trip never to forget. The Maipo river is a great place for rafting, and the guides seemed very knowledgeable and passionate about their job. Double thumbs up!", "title": "This place is a little piece of heaven.", "helpfulness": 2, "user": "Roy_Leanne", "date": "March 22, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 155331333}], "location": {"country": "Chile", "region": "Santiago Metropolitan Region", "continent": "South America", "city": "San Alfonso"}, "variance": {"poor": 4, "average": 9, "very good": 38, "terrible": 4, "excellent": 64}, "aka": "Cascada De Las Animas Hotel San Alfonso", "slim_ranking": 1.0, "description": "Cascada de las Animas is a full service eco-tourism resort located in a natural paradise of over 3700 hectares of rugged mountains and valleys, rivers, springs and waterfalls. Only 60 kilometers from Santiago Chile, you will find a wide assortment of delightful cabins, rooms, hostel accommodations, a full service restaurant, swimming pool and more, all located in a park-like setting. Guided horseback riding, whitewater rafting, trekking, wine tasting excursions and other activities are available year-round."}