{"user_rating": 4.0, "review_count": 185, "name": "Castello della Castelluccia", "reviews": [{"rating": 3.0, "title": "Lacking atmosphere", "text": "Me and my daughter stayed here for 3 night in September. Its hard to believe that in a castel like this there is a lack of atmosphere, the bar area is very small with no guests . The reastueant again is lacking in any charm. Food was good but not great. Our room was lovely, clean old and had a charm about it, nice views from our small balcony. The pool area is quite a walk down many many steps from the main building of this hotel.Pool area very nice, grounds very nice. There is something missing from this hotel.....it desperately needs more attention to guests along with a certain something that makes a good hotel . Its such a shame, as the building is very special but a desperate lack of atmosphere inside.", "user": "UkSand", "date": "October 16, 2013", "id": 181278290}, {"rating": 1.0, "stay_parameters": "Stayed October 2013, traveled on business", "text": "I stayed as part of a business group holding an offsite meeting.", "title": "Cleanliness a concern", "user": "J M", "date": "October 16, 2013", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 3.0, "rooms": 3.0, "location": 2.0}, "id": 181254236}, {"rating": 4.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "Our drivers had mixed success in locating the hotel, although there are signs.", "title": "Beautiful", "user": "Claudizzle1", "date": "October 6, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 179894823}, {"rating": 4.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "When we arrived the hotel is attractive, but unwelcoming with a rope to prevent taxis dropping off at the door. Once I had struggled in with suitcase, laptop and meeting materials for the group I found reception who were prompt enough in checking me in and helping me to my room, but with none of the usual directions as to where to find the meeting room, restaurant etc.", "title": "Beautiful", "helpfulness": 1, "user": "Claudizzle1", "date": "September 11, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 176780821}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "The meeting room itself was light and airy, but it was here that we identified our first concern with the standards in the hotel as a number of mice decided to join our meeting, scurrying around the room and over the side tables. I hope the buffet we had consumed in the room hadn't been left unattended.", "title": "Recommended - but make sure you hire a car", "user": "cattewell80", "date": "September 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 175382327}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "We stayed our last night in Italy because we wanted to experience staying in a castle. The hotel was built in the 13th century and is surrounded by lovely grounds. The public rooms are well kept, impressive, with high ceilings boasting large wooden beams, tile floors, stained glass doors and windows, huge fireplaces. It is very romantic. The grounds are large and well kept, on several levels, with stone walkways, steps, olive trees and a large pool. The restaurant was beautiful with white linen covered tables and chairs. And the food was quite good. Our bedroom was small, and the bedding looked a little tired, but the bar was in a hand painted cabinet, as was the armoire, and the bath offered fluffy robes and slippers along with sizeable towels. Our room had a large tiled jacuzzi/shower/bath, which you stepped down into. There were wood beams on the ceiling and a porthole window. All in all, a romantic place to stay and we were glad to satisfy our desire to stay in a castle at the Castellucia.", "title": "A little tired, but lovely", "user": "india1939", "date": "September 1, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 175087798}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "A great place to stay to explore and enjoy Rome. We stayed here for 3 nights in August 2013, and got engaged! The food is fantastic, although a little pricey. The staff were very helpful and spoke very good english (we are both ashamed by our lack of languages) with all our enquiries with regards to transport, things to see in Rome, wine in the restaurant, everything.", "title": "Very good", "helpfulness": 1, "user": "Edd A", "date": "August 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 173864555}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "The pool is great and the hotel is in great surroundings.", "title": "A stunning hotel just outside Rome", "helpfulness": 1, "user": "Hillpudlian", "date": "August 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 172175783}, {"rating": 3.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "We hired a car, but my advise to anyone flying to rome would be to use public transport. The station is a couple of miles from the hotel and you can be in the centre of Rome in 40mins costing 1.50euro each.", "title": "Not bad but there are better places to stay", "helpfulness": 1, "user": "Mike Y", "date": "August 13, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 2.0, "sleep": 3.0, "rooms": 4.0, "location": 3.0}, "id": 172138235}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "The hotel is a great place to stay; peaceful and helpful but easily accessible for all Rome's attractions. Thank you.", "title": "nice hotel, but", "user": "eivetsrednow", "date": "August 5, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 3.0}, "id": 170836768}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "We had our wedding at castello della Castelluccia in march 2013, I could not have wished for a better venue. The building and rooms are beautifully decorated, and the staff could not have been more helpful and accommodating. Although it rained for most of the day we did not care as the hotel is so beautiful inside. The food was delicious and wait staff very nice and efficient. As said already, I could not have wished for a more perfect setting for our wedding, just wished we had stayed more than 1 night! I would definitely return.", "title": "Perfect wedding location!", "user": "Yvonneogorman", "date": "April 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 158422588}, {"rating": 4.0, "stay_parameters": "Stayed March 2013", "text": "We stayed in Castello Della Castelluccia for 4 nights at the end of March 2013, including my sister's wedding. The staff were very welcoming and friendly and were very helpful when we needed directions to and from the city. The castle/hotel itself is beautiful, very clean and well kept. My sister could not have wished for a more magical setting for her wedding. The only small shortcoming (which cannot be blamed on the staff or building) is the location. There is very little to do in the surrounding area. That said, it is the perfect place to relax away from the rat race and the city is easily accessed by car in 30 mins or by nearby train in about 40 minutes.", "title": "Beautiful castle hotel with great staff", "helpfulness": 2, "user": "BrianOGorman", "date": "April 5, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 3.0, "service": 5.0, "rooms": 5.0}, "id": 156668958}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "Overall a great experience.", "title": "Gorgeous Hotel - very romantic", "user": "h0lidaymaker121", "date": "March 15, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 154667275}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "Brilliant stay here, Breakfast was very good with a broad choice - however no choice of hot food, which is OK but would have been nice! The room itself was very clean, comfortable and beautifully decorated, one of the best rooms i have stayed in! The views were good although the sound of the trains to Rome in the night were noticeable. Staff were very polite and helpful aside from the Resteraunt waitress who was clearly having a ''moody'' day and put a bit of a downer on the morning, being a minor thing overall this hotel I would stay at again if the rate was the same for a special occasion. The relaxation area is great but quite small, we were the only people in there but if another couple were to have joined it would have made it a bit awkward.", "title": "The Perfect ending to our 4 part honeymoon", "helpfulness": 1, "user": "joel i", "date": "March 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 154313141}, {"rating": 3.0, "stay_parameters": "Stayed July 2012, traveled with friends", "text": "Wow! We were happy to have saved this one for last! The grounds were amazing upon arriving in the early afternoon. While we walked around for 2 hours after check-in to take in the scenery, we saw 2 foxes, a flock of sheep and horses in the nearby fields. We made friends with the Hotel cat that followed us around as we enjoyed the area. The front desk was very helpful and even let us know that they would pick us up with their complimentary shuttle service if we decided to come back at a non-routine schedule. The ride into downtown Rome was pleasant after a 20 minute Metro-train type ride. The front desk offers tickets that we took advantage of to use the train to and from downtown Rome. Horacio was a super everything. From lugging our luggage up to our Tower Suite, to driving us to the train station, to setting up the Turkish baths for us and for tending to the fireplace during dinner, this man did it all! He also served us our wine when we got there out on the patio! We ordered the honeymoon package and we were served an amazing 4 course dinner our first night there. I forgot our waiters' name but he too was a personable man that made our evening enjoyable. He was pleasant to chit-chat with and very witty. Adrian is his name, i think? We insisted he tell the Chef what an impeccable dinner we had. (We eventually ate there both times were nights!) We plan on taking our 6 kids to Rome and to stay at the little villas outside of the castle that the Castelluccia offers hopefully one upcoming summer. We were treated very well by each of the members that we met. This place is highly recommended by my wife and I to anyone that wants to take a romantic trip to Rome and would like to stay on the countryside and just bask in the serenity and cozy setting this hotel has to offer! We cannot wait to go back!", "title": "Looks nice, but.....", "user": "Ariestom62", "date": "March 5, 2013", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 2.0}, "id": 153792903}, {"rating": 2.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "The photos on the internet of this hotel looks amazing. We booked the suite with the fire place and the terrace. The man bringing our luggage to our room was in a bad mood but we did not mention this. We wanted to order some roomservice but their is no roomservice available. During the diner, with great food, the waiter was doing his very best in the understaffed restaurant. We had to wait at least a hour for our main course. Besides the people the terrace of the room was not clean, lot of animals in the room and not wood in the room for use in the fireplace.", "title": "We did not feel welcome", "helpfulness": 5, "user": "Michel_Wenzel", "date": "October 21, 2012", "detail_rating": {"service": 1.0, "cleanliness": 2.0, "value": 2.0, "sleep": 2.0, "rooms": 3.0, "location": 4.0}, "id": 143346345}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "As the title is saying, we did not feel welcome in this hotel, typically \"faded glory\"", "title": "A quiet haven in the countryside", "helpfulness": 2, "user": "daynawess", "date": "October 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 142709474}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "Located away from the hustle and bustle of Rome, this hotel, a renovated 11th Century castle, was the perfect place to unwind after a 3 week cruise and stay in Rome. We were there just for 1 night, but we were delighted with our stay. Because of its location in the countryside, the hotel offers shuttle service into the town's train station several times a day, and will also pick you up for return at a designated time. We went into town for lunch to try the local fare, but had dinner at the castle's elegant dining room. Service was great and the food unexpected. Because of a wedding that night we were offered 1 of 2 rooms and took the one with exposed wood beam ceiling and a small window on an upper floor. Because action at an Italian wedding does not take place til later in the evening with live music and dancing I was worried that the noise would not allow us to sleep but that was not the case at all! We slept soundly, and were out the next morning literally before the crack of dawn so we could not partake of the breakfast.", "title": "Heights above the rest!", "helpfulness": 1, "user": "OliviaMaree", "date": "October 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 142278351}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with friends", "text": "This was the last 2 days of our 3 week Honeymoon and we were done with touring just wanted to relax and enjoy the surrounds. This hotel not only allowed us to do this however also provided us with 5 star service and the most amazing food we have ever tasted! The dinners are highly recommended, whether you let their staff chose a full 3 course selection with wine or you pick your own it will blow you away! The room was steeped in history, so unique and the grounds allowed you to enjoy the area while relaxing by the pool, with a drink or taking a casual walk.", "title": "Wonderful stay at Castello della Castelluccia", "helpfulness": 2, "user": "Parissyn", "date": "October 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 141854286}, {"rating": 5.0, "title": "Castello della Castelluccia", "text": "We will definitely return to this hotel everything about it was fantastic!", "helpfulness": 2, "user": "Irunchick", "date": "September 16, 2012", "id": 140380652}, {"rating": 3.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "The hotel is beautiful and the location is stunning but it's the lack of attention to detail that's fails to make it perfect. Staff will often have a convenient break down in communication to suit, shuttle buses fail to turn up and they book taxis for the wrong times leaving them to sit in the car park with the meter running. There isn't a bar, they don't provide a lunch menu and there isn't anywhere to sit in the evenings apart from the expensive restaurant which has no atmosphere. If there's a wedding or private function on you're confined to your room as they do not allow guests in the hotel lobby or grounds, ushering you away shouting 'tradition'. They do provide an extensive breakfast menu and the food tastes amazing.", "title": "Beautiful location but...", "helpfulness": 1, "user": "MrsGibbins G", "date": "August 1, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 170300646}, {"rating": 3.0, "stay_parameters": "Stayed April 2013", "text": "We stayed here at the beginning and end of a Beach's motorcycle tour. Its location outside of Rome meant easy access to and from the area. This is a great event location, or country retreat. I would not recommend for those wanting to tour Rome. Excellent service and lovely dining room. Rooms vary greatly in size and amenities though in the same class", "title": "Far out from Rome. Great location to start motorcycle ride", "helpfulness": 3, "user": "Sensitivity", "date": "June 1, 2013", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 4.0, "service": 5.0, "rooms": 3.0}, "id": 162632435}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "We ended our trip in Rome, and this couldn't have been a more magical place to stay. The castle and grounds are absolutely beautiful. The rooms were well appointed, clean and each of them had so much character. The breakfast was truly outstanding and the staff were very friendly and helpful. And you gotta love a place that offers free parking, free wi-fi and free (elaborate) breakfast! The only thing I would caution is that it's about 15-20 minutes outside of the heart of Rome. We had a car so it wasn't a big deal and apparently there's public transportation options as well. Personally, we loved going into the city during the day and returning to this romantic, serene getaway at night!", "title": "One of the highlights of our trip!", "helpfulness": 1, "user": "JCanitz", "date": "May 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 161891330}, {"rating": 3.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "I so wanted to rave about this hotel as it looked like our perfect country retreat after a hectic four days in Rome's city center, but whilst so much of it was so lovely, a few things really did let it down.", "title": "A slightly disappointing country retreat.", "helpfulness": 1, "user": "Ant140973", "date": "May 22, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 161510257}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "We arrived just in time for lunch, but were told we couldn't eat in the restaurant as there was an event on that afternoon. We were then told that whilst we could eat in the restaurant that evening we couldn't on our second night as there was another event. Having been served one of the worst pasta dishes I have ever seen, in a soulless space off the reception, we were then brought complementary drinks as an apology for the terrible food. I can only presume this was because they were too busy dealing with the event going on as we had a superb meal in the evening.", "title": "Effective recovery of a disturbing situation", "user": "ericweiss", "date": "April 27, 2013", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 158926652}], "location": {"country": "Italy", "region": "Lazio", "continent": "Europe", "city": "Rome"}, "stars": 4, "variance": {"poor": 11, "average": 22, "very good": 62, "terrible": 5, "excellent": 85}, "aka": "Castello Della Castelluccia Rome", "slim_ranking": 0.193700787402, "description": "Castle of the Cancellieri family, built on a Roman villa between the 12th and 13th centuries."}