{"review_count": 75, "slim_ranking": 7.0, "name": "Castle Murray House Hotel & Restaurant", "reviews": [{"rating": 5.0, "title": "A perfect sanctuary", "text": "A wonderful setting with views out over the bay that are perfect for watching the sun set over the distant mountains while tucking into a 5star supper", "user": "jozx7r", "date": "March 4, 2012", "id": 125583173}, {"rating": 5.0, "title": "Wow wow WOW", "text": "TANTALIZING tasty scrumptious superb stunning,", "helpfulness": 1, "user": "darrenwhelan", "date": "March 2, 2012", "id": 125525189}, {"rating": 5.0, "title": "If you go, you will be pleased", "text": "All a restaurant and accommodation can offer and more... Affordable and comfortable staff amazing and food to lick the plate clean over and over again...", "helpfulness": 1, "user": "blosoom", "date": "February 27, 2012", "id": 125317802}, {"rating": 5.0, "stay_parameters": "Visited November 2011", "text": "Beautiful mostly French cuisine. A bit pricey but worth it. If you budget is stretched try the Sunday lunch which is served till about 6, I think and offers very good value for money for the same wonderful food!", "title": "Recipe for Success!!", "helpfulness": 1, "user": "Fionnuala22", "date": "November 23, 2011", "detail_rating": {"value": 4.0, "service": 4.0}, "id": 120944495}, {"rating": 5.0, "title": "fine Food", "text": "Take the freshest, finest Irish ingredients, cooked by skilled French chefs, add a stunning location on Donegal Bay, and an extensive well priced wine list, and the recipe doen't get any better. Castlemurray House Restaurant was just a joy. From the skilled Maitre d' on arrival to the final cup of coffee, this is a restaurant that knows what it has to deliver. Assurred, elegant and respectful of the wonderful produce of Donegal, this is dining as it should be. We will be back!", "user": "Denis R", "date": "November 7, 2011", "id": 120275980}, {"rating": 5.0, "stay_parameters": "Visited April 2012", "text": "We have been coming here for years & it is by far the best place we have eaten & stayed in the whole of Ireland ! The sea & mountain views from the restaurant, bedrooms are truely spectacular. The food is always consistantly superb & the staff are gracious & knowledgable on the food & wines they serve. This is a place to linger & stay awhile as it is hard to leave the fantastic surroundings & stupendeous scenery all around this hidden gem in the most scenic & unspoilt County in Ireland. Go there soon.", "title": "Best Restaurant in Donegal & Ireland.", "user": "Geraldine S", "date": "April 16, 2012", "detail_rating": {"value": 5.0, "service": 5.0}, "id": 127969521}, {"rating": 5.0, "stay_parameters": "Visited February 2012", "text": "If you ever have the opportunity to eat here, grab it with both hands and make sure you are hungry because you will be delighted with everything you get. The staff are wonderful and extremly accommodating, the decor is beautiful, the views are breath taking and well the food is just AMAZING. Truly a gem...", "title": "The best place to eat in Donegal maybe even Ireland", "user": "Taralady", "date": "April 3, 2012", "detail_rating": {"value": 5.0, "service": 5.0}, "id": 127188188}, {"rating": 5.0, "stay_parameters": "Visited March 2012", "text": "The food was absolutely excellent and the atmosphere is perfect, with several tables overlooking the bay. We were guests of the hotel, so we also had breakfast here: the irish breakfast was delicious and there was also a buffet of homemade croissants and bread, cereals, yogurt and jam. The staff was very friendly.", "title": "Excellent food, romantic restaurant with great sea view", "user": "Stelli2012", "date": "March 19, 2012", "detail_rating": {"value": 4.0, "service": 5.0}, "id": 126358571}, {"rating": 5.0, "stay_parameters": "Visited March 2012", "text": "Stayed with friends for 2 nights DB&B", "title": "Gastro fun............", "user": "luigi.90", "date": "March 11, 2012", "detail_rating": {"value": 4.0, "service": 5.0}, "id": 125929135}, {"rating": 5.0, "title": "Amazing", "text": "Superb food, very friendly staff, fantastic location..... a must visit.", "user": "Loveto8", "date": "March 5, 2012", "detail_rating": {"value": 5.0, "service": 5.0}, "id": 125667919}, {"rating": 5.0, "stay_parameters": "Visited May 2012", "text": "My wife and I ate dinner at Castle Murray to celebrate 10 years of marriage. The food was 5-star quality and the views are amazing. The seafood was extremely fresh. If you are a true \"foodie\", this is a great place to try. We were so full that we could not have dessert so they boxed up some homemade chocolate truffles to take home.", "title": "Fantasic experience!", "helpfulness": 1, "user": "Neil S", "date": "June 5, 2012", "detail_rating": {"value": 5.0, "service": 5.0}, "id": 131352276}, {"rating": 5.0, "stay_parameters": "Visited May 2012", "text": "2 weeks ago a family group of 9 of us had a truly superb meal to celebrate a 90th birthday. From our arrival the staff could not have been more attentive or courteous. Every bite was declared delicious and the birthday girl was thrilled to have her dessert arrive complete with candles which was a very lovely surprise from the hotel! The table allocated to us was excellent - it was so nice to be seated around a circular table rather than a rectangular one - and the view from it was perfect. 4 of our party were from Scotland and 2 from America so they have all gone away with a great impression of Donegal in general and Castle Murray Hotel in particular. Hopefully some of us will be back again soon to enjoy the food, atmosphere and service - all of which was second to none.", "title": "Superb", "user": "travelaid", "date": "May 29, 2012", "detail_rating": {"value": 5.0, "service": 5.0}, "id": 130840756}, {"rating": 5.0, "stay_parameters": "Visited May 2012", "text": "The food is excellent, the starterdish of prawn and monkfish", "title": "Amazing", "user": "andrew551498", "date": "May 28, 2012", "detail_rating": {"value": 4.0, "service": 5.0}, "id": 130743668}, {"rating": 5.0, "title": "Brillaint,Brillaint and more Brillaint", "text": "is to die for and to dunk the beautiful brown bread in the sauce !!!", "helpfulness": 1, "user": "lisireland", "date": "May 11, 2012", "id": 129771730}, {"rating": 5.0, "title": "Fab hotel and restaurant", "text": "The View is breathtaking, The food is created with pride and passion and every bite is mouthwatering.The monk and prawn starter is on the menu for years and I hope for many more years!!Even the glasses one drinks out of are top quality", "user": "Happycustomer186605", "date": "April 16, 2012", "id": 127973091}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled with friends", "text": "I tried all weekend to find faults with Castlemurray, working in the service industry myself, I know that no place 'has it all'. Unfortunatley, Castlemurray has that and more. Ideally located between Killbegs and Donegal town, the views from the hotel of St. John's point and beyond are breath-taking. On arrival we were warmly greeted by lady of the house Marguerita Howley, who showed us to our room. Marguerita had a smile, a recommendation and a good story to tell us about everything in Donegal over our stay and even convinced us with her passion and energy to go out and see more of the Donegal nightlife than we had originally planned!", "title": "5* quality accomodation, food and service with the warmth and of a local house hotel", "helpfulness": 1, "user": "TONCork", "date": "July 6, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 69858824}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled with family", "text": "The dining at Castlemurray is an experience in itself. If you don't have the time/opportunity to stay, at least go and have one of the most enjoyable meals of your life there. Heavily decorated with awards and accolades the french cusine lives up to its reputation consistently. Try the prawn and monkfish starter, any of the fish main courses and the belgian chocolate dessert. The service in the restaurant is impeccable, a true silver service feel, without any of the associated airs and graces of many 5* establishments. We ate at the restaurant in Castlemurray both nights we stayed out of sheer deisire to try more. The meals are a set menu, all in and very reasonably priced. Breakfast doesn't see Castlemurray miss a beat with homemde granola, warm crossiants and pastries and an award winning fry.", "title": "A fabulous place", "helpfulness": 1, "user": "dubsFlorida", "date": "April 14, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 61281167}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "The rooms are beautifully decorated, pictures on the websites will show you that they are all as exquisite and individual as each other. After a day walking the cliffs I was most overjoyed with the scorching power shower. Relaxing in the room with the wind and rain beating against the window made us realise, maybe Irish weather can be conducive to a relaxing weekend getaway if all the surroundings are as serene as Castlemurray!", "title": "What a relaxing and fantastic place", "helpfulness": 1, "user": "hollystar10", "date": "November 24, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 49999397}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "Castle Murray is set on St. John's Point with incredible views of the sea and the mountains. It is a peaceful place. The rooms are pretty, the food is excellent, and the staff are friendly and helpful. The freshly caught fish - especially the black sole - is fantastic.", "title": "Another faultless trip to Castlemurray", "helpfulness": 1, "user": "stephenmcg", "date": "August 28, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 39063038}, {"rating": 4.0, "title": "Amazing food", "text": "There for anniversary 20/11-22/11, loved our room in the attic very romantic and all in all it was all we needed for a great weekend. Service was faultless especially bar/waiting staff, we were made very welcome and nothing was to much trouble. The food was to die for both the dinner and breakfast. Love the pain au chocolate, try them. All in all very relaxing and felt like a real treat.", "user": "ChristineMark", "date": "August 12, 2009", "id": 37456605}, {"rating": 4.0, "stay_parameters": "Visited July 2012", "text": "back again with my family when on holidays in donegal . House special of monkfish and prawns was delightful. One thing though i think tea/coffee should be complimentary on the set menu .", "title": "another lovely meal", "user": "gabbie-TA", "date": "August 14, 2012", "detail_rating": {"value": 3.0, "service": 4.0}, "id": 137148211}, {"rating": 5.0, "stay_parameters": "Visited July 2012", "text": "I have just recently experienced the pleasure of eating incomparable seafood in the restaurant of Castle Murray House. I can't remember fish so deliciously cooked or beautifully presented in any restaurant in England, Scotland or Wales. The wild salmon on the last night was out of this world", "title": "Castle Murray House Dunkineely Donegal", "user": "brendanwoods", "date": "July 13, 2012", "detail_rating": {"value": 5.0, "service": 5.0}, "id": 134253135}, {"rating": 5.0, "stay_parameters": "Visited May 2012", "text": "although I should say that the turbot in the bouillabaisse the night before was perhaps the most delicately cooked fish I have ever tasted( even in Marseille). Our room was also had the most extensive terrace imaginable with views over the bay. Altogether a great experience with very pleasant and attentive staff.", "title": "Wedding", "user": "DonegalAvril", "date": "June 29, 2012", "detail_rating": {"value": 5.0, "service": 4.0}, "id": 133067661}, {"rating": 5.0, "stay_parameters": "Visited November 2011", "text": "A truely fantastic place all round to have a small wedding, made our day so much more special! Great day had by all! Excellent food and friendly staff.", "title": "League of its own!!", "user": "kizzy333", "date": "June 14, 2012", "detail_rating": {"value": 5.0, "service": 5.0}, "id": 131971502}, {"rating": 5.0, "title": "I love this restaurant", "text": "This place is in a league of its own and have yet to eat somewhere better. Its like time stops and you really relax and enjoy the food experience you have. Love it.", "user": "Breda C", "date": "June 14, 2012", "id": 131954173}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "As a travel consultant I get to travel every few weeks. I've stayed in all kind of properties all over the world and I have to say that this place was way up there with the 6* star hotels of Dubai. The personal service was fantastic and food to die for......I was very sad to leave and wished I could stay another night . I will most definitely be returning and will tell anyone who will listen that's it my newest favorite place:-)", "title": "WOW.....Honest Travel Agent review", "user": "asho36", "date": "July 20, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 71626688}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "This was our second stay at Castle Murray House Hotel, and I honestly think it is one of the most friendly places to stay. From the mouthwatering food the breathtaking view and the standard of friendly but efficient service this hotel cannot be faulted. We went to celebrate our wedding anniversary, and it was so good we hated leaving to go back to the real world!! There are also lots of places to visit, thats if you can drag yourself away from the hotel. We will certainly be returning for another piece of heaven!!!", "title": "A little piece of heaven", "helpfulness": 1, "user": "starstruck21", "date": "July 18, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 71364678}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "A great place to use as a sight seeing base where you can enjoy fantastic food in the evening. A small, comfortable hotel in a rural setting. The dining room and lounge area overlook a beautiful bay. Staff very friendly and helpful.", "title": "A great good food getaway", "user": "Ian-on-hols", "date": "July 16, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 71097120}, {"rating": 5.0, "stay_parameters": "Stayed July 2010", "text": "This was one of the best visits I have had.this is one of the nicest Hotels I have stayed especially for the price.", "title": "This was one of the best visits I have...", "user": "sladeshalisa", "date": "July 14, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 70940631}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "Myself and my family had a meal in this hotel after reading the reviews on trip advisor. We were on holiday for the week in glencholmcille and our meal in this hotel was certainly the highlight. The atmosphere as soon as you enter is very welcoming. The staff are very helpful and efficient. The presentation of the food was like a work of art and certainly delivered on flavour. If you are in the area definately make a point of treating yourself to a night out here!", "title": "Fantastic", "user": "fionnuala23", "date": "July 9, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 70312656}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "This was our second stay at Castle Murray after discovering it by accident in October 2008. What can we say the location and views were just amazing ! The food, staff, rooms all amazing too! It is by far one of the most amazing places we have stayed and will return again on our next trip to Ireland.", "title": "Amazing", "helpfulness": 1, "user": "TanyaJersey", "date": "July 12, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 34531289}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled with friends", "text": "We stayed at Castle Murray early March 2009 and I have been meaning to write a review since... Our stay was fantastic from beginning to end. Dinner was outstanding, my John Dory was excellent, we could not fault a thing. Our rooms (with views) were gorgeous, beautifully decorated with the most comfortable bed I have slept in. We woke up to a snow covered St. John's Point, (icing on the cake). Breakfast was again a lovely experience. I cannot convey enough what a great time we had, although we stayed only one night we left feeling truly relaxed. I am looking forward to a return visit!", "title": "Wonderful Stay in a Beautiful Place", "helpfulness": 1, "user": "clooneriver", "date": "May 5, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 29360674}, {"rating": 5.0, "title": "All round excellence", "text": "This must be one of the best places I have ever stayed. Although the athmosphere is friendly the attention to detail is very impressive. The food is of a very high standard - the prawns in garlic starter is a treat!", "helpfulness": 1, "user": "JohnCDublin_Ireland", "date": "March 5, 2009", "id": 25629928}, {"rating": 5.0, "title": "A little gem...and out favourite place in Donegal!", "text": "We got married in Castlemurray in Aug 06 and have stayed there many times before and since this.................. and we still love it as much as ever!!", "helpfulness": 1, "user": "OmcG", "date": "January 10, 2009", "id": 23435603}, {"rating": 5.0, "title": "Stayed there 7th February 2008", "text": "It is a unique place, both in terms of location, the individually styled rooms and the fabulous food. We have eaten in many fantastic restaurants, including Michelin starred, and the food in Castlemurray ranks up there with the best of them...Remy, the chef, is a modest star! People still talk about the food at our", "helpfulness": 1, "user": "OCV51", "date": "April 11, 2008", "id": 14955291}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "We stayed in Castle Murray overnight on Tuesday 27th July . It was a lovely break, great scenery and fantastic food . My husband said he'd go back - i haven't heard him say that about a hotel in nearly 10 years . One little thing though it would be nice to have some bottled water in the room .", "title": "Really great - will be back", "user": "gabbie-TA", "date": "August 10, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 74582856}, {"rating": 5.0, "title": "Stunning Scenery and Genuine Staff!", "text": "Hi Margoritte,", "user": "denisbird3", "date": "August 6, 2010", "id": 74102387}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled on business", "text": "Just a quick thank you from myself and Celine for such an exceptional weekend we had recently at the Castle Murray Hotel. In a world of plastic four and five star hotels you and your staff have really renewed my faith in what it is that makes the Irish Hotel Welcome a treasure to be bestowed. I have been to world renowned accommodation throughout Europe including Villa De'este in Lake Como, Italy, and I assure you in terms of scenery and above all, hospitality, your establishment surpasses these.", "title": "Tasty", "user": "Cookie6000", "date": "August 3, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 73553383}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "Your staff Fabrice, Finnulla, Margaret and Co. are an absolute credit to you. The food and accommodation were absolutely superb. And to think within all of this you and your staff had no issue with our immaculately dresses dog, Razz.", "title": "Loved it!", "user": "IrelandLaura", "date": "July 24, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 72182875}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "Both Myself and Celine will be back again. I would be really grateful if you put my email address, denisbird@gmail,com, on your email list. I would also be delighted if you use this recommendation for your world class establishment for your own use.", "title": "Wished we could have stayed longer.", "user": "rosebankl", "date": "July 20, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 71645522}], "location": {"country": "Ireland", "continent": "Europe"}, "variance": {"poor": 2, "average": 1, "very good": 12, "terrible": 0, "excellent": 60}}