{"user_rating": 4.5, "review_count": 204, "name": "Castletown House", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled on business", "text": "My husband and I and another colleague were exhibitors at Olympia for \"La Dolce Vita\" and found our 5 day stay to be exceptional value for London. Not only were we within 5 minutes walking distance from West Kensington tube stop, we were only 10 minutes from Olympia hall and would have been even closer to Earl's Court. It made everything so simple to organize. There are plenty of small shops in the neighbor hood to take care of any incidental item you might need or want and the Tesco superstore is very close by for everything else. It was a thoughtful touch to have water, milk, fruit, tea and fresh flowers already waiting for us, making an immediate trip to shop unnecessary. (Although for us ladies a loo roll would have been a nice start as well)", "title": "Whether it's business or pleasure, this flat is definitely a great location and value!", "helpfulness": 2, "user": "Pasticciera", "date": "April 6, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 27521775}, {"rating": 5.0, "stay_parameters": "Stayed February 2009, traveled with family", "text": "When I first called to inquire about making a booking, I wasn't sure if they were very interested, but as the conversation warmed up the helpfulness became more apparent. Upon arrival I found Mark and his father Richard very friendly and helpful. It did take As they live on the premises, I felt an added sense of security in what is a very pleasant neighborhood even arriivng back late at night. The one bedroom ground floor flat is really perfect for a couple with smaller children, but it worked out just fine for us as a couple with an adult colleague. We didn't mind sharing the bathroom and living room/bedroom, especially as we were out most of the time. It is very quiet and sleeping was heavenly. Plenty of pillows, and large towels for everyone. The flat was clean and has all the modern cons you could want complete with a couple of books to have a read at night if the DVDs or music or telly aren't your thing. I would say a bit of instructions for all of the electronics would be helpful for us with out the aid of a young child to steer you through the remote controls. I wish there had been some possibility to recycle our plastic jugs and newspapers to help cut down on the amount of trash. Maybe next time.", "title": "Perham House part of Castletown Rentals", "helpfulness": 1, "user": "marypoppinz", "date": "February 22, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 24970527}, {"rating": 4.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "Mark very kindly printed off a few pages of some things I needed and the wi fi reception in the flat was excellent. Make sure to ask all of those questions when you check in, so you're not wondering late at night how to get the internet reception or how to run the TV, or CD player.. Also, if you're like me and aren't thinking clearly, do try to remember that you will need to pay your balance when you arrive unlike a hotel, so that no one needs to go chasing after each other when it's time to leave. Quite sensible indeed. You can still find someone later on, of course, if you need something, so not to worry.", "title": "perfect location!", "helpfulness": 1, "user": "chrisworle", "date": "February 10, 2009", "detail_rating": {"front_desk": 3.0, "business": 5.0, "service": 3.0, "cleanliness": 3.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 24424802, "likes": {"liked": "— size", "disliked": "— n/a"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2008, traveled on business", "text": "We didn't do any cooking other than breakfast, but was so worth having the facilities to be able to relax and enjoy a casual start to our very long and hectic days, made it all very worth it. We went out to with other colleagues for dinner every night and found that Earl's Court area full of very wonderful eateries. Do find \"Benito Bistro\", as it it is a wonderful casual atmosphere, with excellent food, reasonably priced, with a menu that has something for everybody.", "title": "Modern, well furnished flats with friendly staff", "helpfulness": 2, "user": "tadiparthi", "date": "December 16, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 22787942}, {"rating": 5.0, "stay_parameters": "Stayed December 2008, traveled as a couple", "text": "So whether you are in London for business or pleasure, buy yourself an Oyster card, travel after 9:30 am and stay in West Kensington at the Castletown House flats and you'll save yourself some money and enjoy feeling like a Londoner for awhile.", "title": "good accomodation for a bargain price", "helpfulness": 3, "user": "Knabber", "date": "December 9, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 22575292, "likes": {"liked": "— Good equipment/furniture and amenities"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "Castletown house is in an excellent location. Lots of restaurants and shops in the area. The room was very clean. Had all the amenities you require for meals and laundry. We had a one bedroom apartment. The bed was very comfortable. The only downside I found was there were only 5 channels available and the reception was not good. It is very easy to find. Take the train from Gatwick or Heathrow to Victoria station. Then take the district line to West Kensington tube stop. Once you leave the tube stop turn left. You will see a pharmacy (blue sign) about two blocks away across the street. Turn right here and one block later you turn left and Castletown House is right there on the corner. Richard and Mark were very helpful with advice about London. Shopping in London is amazing. And of course there is so much to do in London it is difficult to make a choice of what to see next. We went for High tea and it was great. Word to the wise do not have anything to eat before going for the high tea. It does not look like much to eat when you see pictures but trust me you will definitely leave full. If you have any questions please do not hesitate to email me. If i return to London I will definitley stay at Castletown House again.", "title": "Excellent choice", "helpfulness": 3, "user": "DeanCalgary_Alberta", "date": "September 1, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 39442576}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "Comfortable and clean, this was a great location to access the underground and our adventures from. We will definitely look at staying here again if we go over the pond.", "title": "Great location for access to underground", "user": "DocCC1", "date": "August 17, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 37916787}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "Flat fully equipped and very comfortable. Owners very hospitable and welcoming. Area very nice and very close to Underground station and most of London attractions. Will definitely come back when we return to London. Will definitely recommend to our family and friends.", "title": "Will definitely come back - very welcoming, comfortable and central", "user": "BORGJx3", "date": "July 18, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 35101349}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled with family", "text": "My family and I (4 adults and 2 kids) booked and stayed in the top floor three bedroomed apartment at Castletown House. I booked the unit 4 months prior and needed to pay a 50% deposit to secure. We finally arrived at the apartment after a fairly quick transfer from London's Heathrow Airport. used batransfer.com for the airport transfer - they were punctual, reliable and reasonably priced too.", "title": "Outstanding value for money, decent location in an expensive city!", "helpfulness": 2, "user": "goldenvision942", "date": "July 8, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 34203024}, {"rating": 3.0, "stay_parameters": "Stayed June 2009, traveled with family", "text": "Anyway, Richard and Mark met us when we checked in around 20H00 at night. They took us around the apartment and gave us a handy file of interesting information. They also had a cedit card machine to claim the remaining 50%. And that was that.", "title": "Okay, nothing special", "helpfulness": 1, "user": "RunnerHouston", "date": "July 6, 2009", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 4.0, "service": 3.0, "rooms": 3.0}, "id": 34055329}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled with friends", "text": "Castletown apartments was well beyond my expectations! The accommodations, the price, the feeling you got when you walked into the flat after a long day of sight seeing just to feel relaxed and at home, and can I say the people of Castletown made this stay truly great. The owners were always within reach and incredibly helpful with anything from where to eat or see to which way to get home, and how to stay safe in the \"tourist\" zones. They were accommodating to our every need and had an answer to our every question.", "title": "I can't praise this place enough for our truly wonderful vacation!", "helpfulness": 1, "user": "alc4522", "date": "June 26, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 33228788}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled with family", "text": "The flat was well stocked, clean and cozy. The price is wonderfully affordable, which could make you nervous about the quality you would receive, but it was a fantastic value!", "title": "Nice Place, nice people, good value", "helpfulness": 3, "user": "dgbn", "date": "June 6, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 31738469}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled with friends", "text": "The West Kensington area was beautiful! Easy access to any sights with a tube station being around the corner. It was about a 15minute ride into the heart of London and it was surprisingly easy to maneuver around. Around the corner to Castletown were restaurants/pubs, banks, and 24 hours shops that were well stocked. PERFECT location for any visitor!", "title": "Great location and good value", "user": "ekoorb9", "date": "May 29, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 31085702}, {"rating": 4.0, "stay_parameters": "Stayed May 2009, traveled with family", "text": "I now have to focus on the men of Castletown, they made this trip fantastic! The individualized service you received in Castletown is unlike any service you would receive at a chain hotel. They were friendly and went above and beyond our expectations. I think these men are truly wonderful and I highly recommend this place for any person looking to get away.", "title": "Far from the Madding Tourist Crowds (but not too far!)", "helpfulness": 1, "user": "Tyrebiter", "date": "May 17, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 3.0, "rooms": 4.0}, "id": 30150954}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled with friends", "text": "Thank you so very much for the wonderful place and making us feel like a part of the family.", "title": "Unforgettable, Unforgettable, Unforgettable!", "helpfulness": 4, "user": "LINHDUONG12", "date": "May 1, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 29138815}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "Fantastic place and great location. Tube was just a short walk away. I really enjoyed the stay as the place has everything you needed. The apartment was roomy and clean. This was my first stay in London and I did quite a lot of research before I found this place. Compared to other hotels it seemed too good to be true however it was exactly how it was described. I can only think of positive things to say about the place.", "title": "Great place", "helpfulness": 1, "user": "Tinaria", "date": "November 20, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 22019269, "likes": {"liked": "— The place was like 2nd home", "disliked": "— Simply nothing to complain"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled on business", "text": "Castletown House is just a short 5 minute (or less) walk from the West Kensington tube station on the District Line. I stayed in a large, sunny and modern studio flat (recently renovated) on the ground floor. The owners, Richard and his son Mark, were friendly, helpful, and very accommodating. Highly recommended.", "title": "Great location, nice people, comfy lodgings", "helpfulness": 1, "user": "jkwriter", "date": "October 9, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 20758915, "likes": {"liked": "— Comfortable, clean, and cheerful space", "disliked": "— Limited TV channels"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled on business", "text": "Note: the building is on the corner of Castletown and Challoner. The entrance to Castletown House (#11) is actually on Challoner St., not Castletown.", "title": "Stylish and Modern With all the trimmings", "helpfulness": 2, "user": "live_to_eat554", "date": "September 2, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 19680373, "likes": {"liked": "— Very Brand New Modern, yet Comfy"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled on business", "text": "We stayed at one of these lovely apartments on perham road, which is part of castletown house rentals....very delightful experience, the owner was minutes away if we needed local advice, or help regarding where to dine, and airport transfers! even fastest way around london, to so and so.", "title": "The amenities of the best hotel without the price", "helpfulness": 4, "user": "johhnnyrocks", "date": "August 22, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 19226903, "likes": {"liked": "— location, location, location and did I mention LOCATION", "disliked": "— That we only stayed a few days"}}], "location": {"country": "United Kingdom (UK)", "continent": "Europe", "city": "London"}, "stars": 4, "variance": {"poor": 2, "average": 14, "very good": 69, "terrible": 2, "excellent": 117}, "aka": "Castletown House Hotel London", "slim_ranking": 0.0293577981651, "description": "Castletown House and Perham apartments; a collection of three to four star self catering refurbished Victorian apartments in West Kensington. We offer studios, one bedroom, two bedroom and three bedroom properties ideal for all types of traveller. All units have there own Kitchen and Bathroom, TV, DVD player and other amenities. Free Wi Fi as standard. A family run business, offering a home away from home feel."}