{"user_rating": 4.0, "review_count": 116, "name": "Catalina Beach Resort", "reviews": [{"rating": 3.0, "title": "Beware The Stairs", "text": "Our overall experience here was nice enough, but if you have any trouble walking up and down almost 200 stairs to get to and from the beach, the restaurant and the street level, don't stay here. Our room was very close to the beach and the pool, both of which are terrific. We didn't have air conditioning which would have been a blessing because it was hot and humid. And no TV, although there was a phone. The balcony with hammocks and chairs overlooking the beach was the best part of the room. The more deluxe rooms at the top have good views and more amenities but the walk up from the beach is daunting. The restaurants on the beach are much better than the one at the hotel.", "helpfulness": 1, "user": "David N", "date": "April 8, 2007", "id": 7294889}, {"rating": 4.0, "stay_parameters": "Stayed March 2007, traveled with family", "text": "Our family of four stayed at the Catalina Beach Hotel in Zihuatanejo, Mexico in March 2007. The reservation was found thru their website and the booking was done by email and their 1-800 number. A note that all bookings were made thru Lucio who is a very friendly person. However don't expect any reply emails. They are very laid back at that hotel and so we had to call them to get a confirmation number. The website also refers to a meal plan but there is none.", "title": "Catalina Beach Hotel", "helpfulness": 19, "user": "Tripreviewer91", "date": "March 24, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 4.0, "location": 4.0, "rooms": 3.0}, "id": 7215186, "likes": {"liked": "— The location"}}, {"rating": 4.0, "title": "Unbelievable value!", "text": "We flew down by Alaska Air and got to the airport. The taxi ride from the airport to the hotel was 32 US dollars. Many of the taxi rides in this town are for fixed rates. Because of the room we had booked, the hotel paid for our taxi ride back to the airport. The normal taxi ride rates back to the airport are cheaper than the $32 rate to the hotel.", "helpfulness": 8, "user": "bunnybutt23", "date": "February 27, 2007", "id": 6851652}, {"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "The hotel is undergoing some renos. A new hotel lobby is being built. During the time we were there however there was no construction underway.", "title": "Heaven on Earth", "helpfulness": 2, "user": "storey", "date": "February 23, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6832165, "likes": {"liked": "— totally unique and beautiful and the grounds", "disliked": "— lloved everything"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "The hotel is built into the side of a cliff overlooking Playa La Ropa. Playa La Ropa is generally considered the most beautiful beach in the Zihuatanejo area, and I would have to agree. Do a google search to see the many beautiful pictures of the beach that you can find on the web. The hotel itself is a short 5 minute taxi ride out of the town itself, situated in what is called the Hotel Zone.", "title": "Nowwe understand the magic....", "helpfulness": 20, "user": "2Seattleites", "date": "September 19, 2006", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 3.0}, "id": 5817813, "likes": {"liked": "— Overall beaty of the property", "disliked": "— Showers"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2008, traveled with family", "text": "Our family of four had a wonderful stay at the Catalina. The beach area was fantastic, large, many palapas, and kept clean by the hotel staff. The water at the beach was also nice for swimming as it did not have large rocks sticking out of it like north of the hotel. The pool was also beautiful, clean and well maintained. We stayed in a deluxe bungalow room which worked great with our two boys ages 5yrs and 18 months. This gave them plenty of space to move around when we were there. We usually retired somewhat early at night because of the boys, so my husband and I would lay out in the hammocks on the terrace and enjoy the great view and sound of the ocean. Althought the hotel is older, and does show it age in some ways, the grounds are well maintained, has a nice restaurant, and a bar with a super view of the bay.", "title": "Great stay", "helpfulness": 1, "user": "dorothy0", "date": "April 14, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 3.0, "rooms": 3.0}, "id": 15028805, "likes": {"liked": "— VIew from room, beach area, and pool.", "disliked": "— nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2007, traveled with family", "text": "This hotel is in a very nice location on probably the best part of the beach, within easy walking distance of several very nice restaurants. It's a bit older of a hotel and some of the areas are certainly showing their age, but it also has an aged charm, and it's a good value for the price. There are great views from the upper rooms and the bar. The steps get to you at times, but they're not so bad, particularly if you're expecting them. We had a two-year old, and stayed on the very top level next to the lobby, and the steps were a nuisance at times, but on the other hand the view from our room's balcony was well worth the climb. The upper level rooms have a/c, and many of the others don't - which I think would make it more unpleasant, particularly if you're with young children.", "title": "Quaint hotel, a bit worn but great views, good location and good value", "helpfulness": 6, "user": "EveAndGreg", "date": "December 27, 2007", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 4.0, "cleanliness": 2.0, "value": 4.0, "location": 4.0, "rooms": 3.0}, "id": 11985691}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "The pool has great views as well, and there is a nice kiddie pool. The service for the most part is good, although there was a particular waitperson who was very rude and aggressive about tipping, and the hotel needs to do a better job at making clear their policy on tips being included in the prices automatically (the policy appears to be that if you don't add any tip, they will automatically add 10% to any food and bar bills, although if you choose your own tip amount, they won't add anything) and not letting the staff be so rude on this point. The restaurant is okay, although nothing special for dinner, and you would be better served to explore for dinners out. It seemed like a better breakfast option to us.", "title": "Completely Amazing!", "helpfulness": 10, "user": "jeffyjoe44", "date": "August 8, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8371038}, {"rating": 1.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "The beach area is nice and well maintained, and seems large enough for the hotel to have your own space. There is internet and computer service (including a printer) available in the lobby. All in all, it's a pleasant place, as long as you know what you're in for in terms of the large number of steep stairs, etc. For the price it seems like a very good deal.", "title": "Couldn't wait to leave", "helpfulness": 5, "user": "KS111", "date": "August 1, 2007", "detail_rating": {"front_desk": 2.0, "business": 1.0, "service": 2.0, "cleanliness": 2.0, "value": 1.0, "location": 4.0, "rooms": 1.0}, "id": 8274262, "likes": {"liked": "— The food in the restaurant was good, but the prices were the same as Chicago area.", "disliked": "— The room was a HUGE disappointment and I couldn't leave the hotel fast enough."}}, {"rating": 4.0, "title": "Great Staff, Wonderful Views", "text": "This place was fantastic. If you like big resorts with fancy buffets, then go to Ixtapa instead. When you go to a great fishing village like Zihua, the Catalina is the place you want to stay. My girlfriend and I checked in four four nights on July 31st. I would say, if you stay here, book a Linda Vista suite. There were a few reviews complaining about the darkness of the rooms or the potential possibility of being robbed. I don't know about the decor in some of the rooms, but this place was as safe as can be. Our room had an amazing balcony, with a hammock, a loveseat, and two chaise lounge chairs. The room was clean, and well air conditioned. The bathrooms were clean and the showers were big, and tiled. The toilets work like toilets at home. The staff was friendly and helpful. The beach bar was great, and the sunset bar was nice. As for the stairs; yeah there's a lot of them. But it's give and take when you're downing beer and tacos. It's just fine if you don't have any physical conditions. The town is great. If you want a great meal, just hit up the Antojito joints in town. If you have to have a nice restaurant experience, the Kau-Kan right down the hill from the Catalina is nice. It has an outdoor deck and a beautiful view. The people of the city are great. The taxi cab drivers are friendly. I wouldnt even reccomend wasting time going into Ixtapa. It's clunky and touristy, and filled with Americans. If Senor Frogs or Carlos and Charlie's is your thing, then go for it. Otherwise, stick in town. Walk the streets with an Indio or a Mantejo in your hand. La Ropa is a little bit crowded if you want to lay in the sun, so go over to where the boats come in in El Centro. Walk the streets. The walk into El Centro isn't that bad. It's less than a mile, and there's three little liquor tiendas you can wet your lips at, on the way.", "helpfulness": 2, "user": "CaliforniaWanderlust", "date": "July 18, 2007", "id": 8140004}, {"rating": 5.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "We loved the Catalina Hotel. I wanted to stay there for quite sometime and i wasn't disappointed. This hotel is one of the oldest in Zihuat perched on the hillside overlooking la ropa beach.", "title": "this hotel has it all!", "user": "travelerseattle", "date": "February 26, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 25217006}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "The hotel has it all beautiful swimmable beach, walking distance to town, wonderful palapas and high end beach furniture, large infinity pool and great staff with special thanks to Cesaer who made our stay really great.", "title": "Trip Report for 10/17-10/24 Zihuatanejo and Catalina Beach Resort", "helpfulness": 1, "user": "ConnieJo", "date": "February 23, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 25058754}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled with friends", "text": "Also the hotel has attracted an extremely friendly, loyal following. We felt very welcome and everyone gave us tips on restaurants, side trips etc.", "title": "Loved It!", "user": "gopher_fan", "date": "January 6, 2009", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 23324571, "likes": {"liked": "— The views and the beach.", "disliked": "— Nothing--my legs got a workout from the stairs."}}, {"rating": 3.0, "stay_parameters": "Stayed December 2008, traveled with friends", "text": "We had the opportunity of meeting Eva, the owner, and want to acknowledge her work with stray animals in Zihuat.", "title": "Good, not great!", "helpfulness": 2, "user": "mikemo", "date": "December 19, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 4.0, "location": 4.0, "rooms": 3.0}, "id": 22850247, "likes": {"liked": "— location and service", "disliked": "— lack of hot water"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2008", "text": "All in all a truly relaxing, fun with no worries vacation.", "title": "A little worn but beautiful!", "helpfulness": 3, "user": "CallieTinaMarie", "date": "October 21, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 3.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 21068432, "likes": {"liked": "— the natural setting and bar", "disliked": "— the pillows"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "This is quite a lovely resort situated in a hill overlooking the Bay. We stayed 4 nights in the honeymoon suite with a large balcony overlooking the Bay and two hammocks. The suite itself is quite large and so is the bathroom. The staff was truly wonderful and very courteous. The restaurant served really good food and in a timely fashion. The only drawback was upon arrival at the suite there was no hot water and the toilet did not flushed properly. We contacted the main office and they immediately retified the situation. Also let me mention that one should be in relatively good shape because the steps that lead to and from the beach can be quite a strenous stretch. The beach was quite lovely and a palapa was always at our disposal. Overall, we had a great time and would definitely stay there again.", "title": "Fabulous!", "helpfulness": 1, "user": "pigeon428", "date": "June 5, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 7772785, "likes": {"liked": "— The quality of serviceN/", "disliked": "— N/A"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "My husband and I stayed at the Catalina March 17-24, 2007. I booked directly with their front desk and got a really good rate. We had to switch rooms about 3/4 way thru the week (I called 2 weeks before we went and expected to NOT get a good room), but it was no problem and actually really nice to get to experience two different types of rooms they have there.", "title": "Catalina is gorgeous!", "helpfulness": 6, "user": "BexA2", "date": "May 1, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7487924}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled with family", "text": "We stayed in the Honeymoon Suite for the first part of the week. The room is older and more rustic, but is huge and has a great balcony with a gorgeous view. It was quite secluded, so it was very tranquil and we couldn't hear our neighbors tv's or anything. It's also smack in the middle of the resort so equal distances to the beach or to the office. Yes, there are lots of stairs, but it didn't bother us as there were plenty of landings to stop and take in the lush gardens. Also, we didn't feel too guilty eating whatever we wanted because we were exercising it off with all those stairs!", "title": "Nice place, good value", "helpfulness": 2, "user": "phaminator", "date": "April 17, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 7381862, "likes": {"liked": "— Location and view", "disliked": "— Furnishings are old"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008", "text": "We were charged the \"off season package rate\", but a good breakfast was included daily.", "title": "Destination Wedding that went perfect!", "helpfulness": 1, "user": "saraalecia", "date": "July 8, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 17675476, "likes": {"liked": "— location and service"}}, {"rating": 2.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "Coffee was awful, but drinks were OK, albeit expensive.", "title": "The Jungle is slowly taking over...", "helpfulness": 3, "user": "angballard", "date": "June 22, 2008", "detail_rating": {"front_desk": 1.0, "business": 2.0, "service": 4.0, "cleanliness": 2.0, "value": 2.0, "location": 4.0, "rooms": 2.0}, "id": 17139532, "likes": {"liked": "— Pool and Beachfront Access", "disliked": "— Room, Grounds, Reception Area"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled with family", "text": "Otherwise, we ate in local restaurants.", "title": "Wonderful, wonderful, wonderful!", "helpfulness": 2, "user": "Carliey", "date": "June 6, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 16710514}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "We spent a wonderful week at the Catalina, June 7-14. We were in a Linda Vista Suite, room 49, and the view was great. We enjoyed the balcony morning and evening and spent the days relaxing on the beautiful beach. Sure, there are a few steps, 242 to the beach to be exact, but we're in our middle 40's and 50's and had no problems at all. In fact, it helped work off some of the good food and drinks! The landscaping was outstanding, keeping with the natural environment. The flowers were blooming all over the place! We're from the midwest, it was hot when we left so the weather was like home, but with a fantastic view of the bay and the ocean breeze it was a whole different world! The a/c cooled off the room in minutes and some nights we even opened up the doors to sleep with the sound of the waves. All of the beach restaurants were good. I had my birthday while we were there and my husband arranged with the Catalina staff for a private dinner on the beach. What a way to get a year older! The food was great , I had red snapper and he had Mexican style steak, all beautifully arranged. The beach bar staff was always available and the view from the Sunset Bar was breathtaking.", "title": "A Wonderful Week!!", "helpfulness": 5, "user": "mcrpolymers", "date": "June 16, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7856534, "likes": {"liked": "— The view", "disliked": "— Having to leave"}}, {"rating": 1.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "Now for the bad points: We were already planning for our return trip to the Catalina on our flight home!", "title": "Horrible Stay...", "helpfulness": 3, "user": "rachelseelke", "date": "June 9, 2007", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 3.0, "cleanliness": 3.0, "value": 1.0, "location": 1.0, "rooms": 1.0}, "id": 7819608, "likes": {"liked": "— Nothing positive to say", "disliked": "— Everything"}}], "location": {"country": "Mexico", "region": "Pacific Coast"}, "stars": 3, "variance": {"poor": 11, "average": 13, "very good": 44, "terrible": 8, "excellent": 40}, "aka": "Catalina Beach Hotel Zihuatanejo", "slim_ranking": 0.3625, "description": "spectacular sunsets are seen from the comfort of your hammock"}