{"user_rating": 4.0, "review_count": 625, "name": "Catalonia Oro Negro", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "We stayed here approx 16 years ago a few times but stopped going as went all inclusive. We found on our return that the Hotel is still excellent value for money and the staff are extremely hard working and friendly. We were there over Christmas and New Year for both Gala dinners which were brilliant variety and there was plenty of wine and bubbly available. The location is excellent. We had a fantastic view of the ocean from the 9th floor balcony. We paid extra for the family room as we have a 15 year old daughter, she had her own toilet but had to use our bathroom, however I would not hesitate to pay this again if we returned as she also had her own storage, tv ect.", "title": "Food, Staff and Service all excellent", "helpfulness": 1, "user": "Helen H", "date": "January 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 148679077}, {"rating": 4.0, "stay_parameters": "Stayed May 2012", "text": "Lovely, clean hotel with fab staff who work long hours. Food - always plenty of choice from toasties to roast beef. Fab salad bar, desserts a plenty and kids there's always ice cream. Pool area has plenty of Beds but its not heated and that's the only fault I can ever find. Ok in summer but winter it really makes a huge difference. No kettle in room but they can be hired or just take a travel one with you. The hotel is in a quite area but only a 5 min walk to the strip. Anyone liking motown and soul go check out the Soul Suite its fantastic about half way along the strip of bars. Enjoy", "title": "Wonderful hotel and staff who become your friends", "helpfulness": 3, "user": "xxdawn67xx", "date": "January 1, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 148535015}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled with friends", "text": "I stayed at the Oro Negro with a friend at the end of November.", "title": "Great value for money", "helpfulness": 2, "user": "durhamrower", "date": "December 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 148283006}, {"rating": 3.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "A three star rating is really a bit harsh on this hotel, it wouldn't need to do a lot more to hit the 4star level. The rooms were spacious, very clean and ours had a nice view over the pool and out to sea beyond.", "title": "good value but??", "helpfulness": 5, "user": "senic", "date": "December 28, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 2.0, "location": 3.0}, "id": 148226165}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "The pool was absolutely freezing but then it was November, I don't know if it was supposed to be heated but once you were in it was clean and was plenty big enough to have a swim with a separate children's pool, not they there were many children about.", "title": "Another Wonderful Week", "helpfulness": 1, "user": "Frankie6058", "date": "December 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 148075598}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "After reading some interesting reviews of this hotel, I actually rang Thomsons as I wanted to change to another hotel. They said they hadn't had any negative feedback about the alleged \"red light activities\" and I shouldn't worry. (Well they would say that, I thought to myself). However, they were correct. Don't let these reviews put you off this very good hotel. It's advertised as 3* and thats what it is. Rooms quite large and airy and we had a verandah half the size of the room as we were on the ground (pool level) floor. Reception and the entrance were upstairs. Although on the surface everything seemed clean, to me, a good spring clean was required. I noticed cobwebs in the corners of the high ceilings. Some of the towels were frayed and certainly past their best. Breakfast was certainly the best meal of the day. Plenty of choice for everyone. The evening meal was OK and I always managed to find something, even if it was the same as the previous day! There was usually fish, chicken or meat cooked in front of you. Desserts were the same each day. The restaurant staff were mostly OK apart from the seater, Simona, who was one of the nicest people I have ever met. She really looked everyone and always seemed to find a table where you wanted one, which wasn't easy when they were busy. And always a big smile and a quick chat about your day. The bar and reception staff were also good. After asking in the evening for some more towels at the desk, we returned to our room to find the towels arriving at the same time as us. The outside space was quite large with plenty of sun beds and a lovely clean pool which was hardly used. We watched the evening entertainment on 2 nights and that was more than enough. But there are plenty of places to go to outside the hotel. There were a lot of people staying for 4 weeks or more and some returning after Christmas but I don't think I would want to stay that long. However, for a 1 or 2 week holiday I thought it was good value and will certainly consider returning in the future.", "title": "Don't believe everything in a review all the time.", "helpfulness": 7, "user": "Suziesuperstar", "date": "December 21, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 147858158}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled with friends", "text": "Hotel rooms were fine and as expected for a 3star. Clean and spacious. Facilities ok and sunbathing area quite big. Breakfasts were lovely including the omlettes made in front of you. Evening meals lacked variety but were ok all the same.", "title": "Very good, cant complain", "helpfulness": 3, "user": "Dannii H", "date": "December 15, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 2.0}, "id": 147491284}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled with family", "text": "Would definitely go again.", "title": "Oro Negro", "helpfulness": 3, "user": "Stokies4", "date": "December 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 147147866}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "Stayed here for a week in November 2012, excellent hotel, large rooms, quiet, big deep pool, excellent food especially the full English breakfasts, close to all amenities which ever way you turn when you come out of the hotel, weather was good, it seemed strange wearing only swimshorts and sunbathing whne it was - 0 degrees back home, we will be going back at the same time next year, pure relaxation was all i could call it before flying back into a wet and cold England with Christmas bearing down on us, I would highly recommend this hotel to anyone.", "title": "Very good value for money.", "helpfulness": 5, "user": "Linda B", "date": "December 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 147070018}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "Just returned on the 6th Nov. after having an excellent week. We were on a Thomson's package and had asked for a pool view, with the evening sun. We got that and more, we had room 758 on the 7th floor and it was on a corner so we got a balcony which went all the way round! Sun all the time and great views from both balconies, perfect. The room was very spacious, comfortable beds and large bathroom. There was even 3 channels of English or should I say American TV. CBS action, drama or entertainment, besides the usual Sky News. The evening meals got to be very repetitive, everything on twice but you could always find something. One bad thing were the desserts, Tinned fruit, rice pudding and ice cream. Once we got very nice pastries. We will be back, most people there seemed to have been before, so that says something.Pool area and gardens excellent complete with butterflies emerging from their cacoons in front of our eyes, wonderful. The shows were not to our taste, Daniels's Bar was very good with a nice outside area, a great Irish coffe was enjoyed there costing around 5 Euros. All in all if you get a good room you can't go wrong here.", "title": "Another great stay at the Oro Negro", "helpfulness": 4, "user": "Yvonne M", "date": "December 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 147024797}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "I was really pleased by my whole experience at the hotel and really felt every need was catered for. The room was a really good size and we had a fab sea view too. I was particularly impressed with the bed as I don't normally sleep well in hotels but was out like a light here! The staff were very friendly and helpful, and there was always someone around if you needed anything. As other reviews say, there was always lots of good and really good variation. I wouldn't hesitate to recommend it or to go back!", "title": "All round pleaser and great value", "helpfulness": 2, "user": "gillhan", "date": "January 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 149240519}, {"rating": 4.0, "stay_parameters": "Stayed December 2012", "text": "Just back on the 6th jan that was our second stay brining in the new year and we are so impresed we have booked again for the next xmas and new year choice and quailty of food is the best of any hotel iv been in pool area large with plenty of sun beds and staff polite and very helpful. Also the rooms are kept clean only down side pool very cold.", "title": "We'll be back. Dougie+Mags.", "helpfulness": 6, "user": "weeblue1", "date": "January 7, 2013", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 149114453}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "I can't praise either the hotel or the resort enough, my husband and I who are in our 60's went for the New Year for 1 week (wish we'd made it 2). The room was comfortable and clean, the bed not too hard with a good sized bathroom and as stated in other reviews the food was good and plentiful, even the hotel bar had a nice atmosphere. The resort had something for everyone from Irish pubs to Night Clubs, from tribute bands to Elvis impersonators and every kind of restaurant you can think of. Would I go back .....you bet I would", "title": "Excellent Hotel", "helpfulness": 6, "user": "polly2NeEngland", "date": "January 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 149072262}, {"rating": 3.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "having just returned from oro negro where my wife and i spent new year a quick thank you to all the staff who were all very cheerful,friendly,helpfull and very hardworking,this is the second time we have stayed at this hotel the first time was 4 years ago in which not a lot has changed the rooms are clean but basic, maid came every day clean towels 3 times bed made every day but only changed once.we were on the sixth floor with great views of the sea and playa de las americas,nice pool area,bar,terrace,reception,the only problem being no food in the bar after 3 oclock so if we had been out for the day and fancied a drink and a bite to eat by the pool in the afternoon it wasnt happening unless you like frozen pizza.which brings me on to the resteraunt i have to say that on the whole the food was awful,over cooked meat of varied descriptions in stodgey sloppy bland sauces and tasteless gravy over cooked soggy veg but wow loads of chips.the only exeption was the gala dinner on new years eve,not superb by any means but acceptable i would of expected a similar standard as the norm,so the last 3 nights of our holiday we ate out.tenerife best again next year!", "title": "new year at oro negro", "user": "johnmulligan324", "date": "January 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 148878160}, {"rating": 3.0, "stay_parameters": "Stayed December 2012, traveled solo", "text": "This hotel was clean and the full-board food was very good. However the walls were thin and the rooms are quite dated. For the price, I think this represented good value, largely because the food was plentiful, fresh and lots of choice. Staff were generally very polite and helpful. The room itself was clean and comfortable enough, but I was disturbed on several nights by people in other rooms and could hear them talking. The pool was clean and there were enough sunbeds.", "title": "Good value but not amazing", "helpfulness": 1, "user": "djmtm", "date": "January 4, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 2.0, "rooms": 2.0, "location": 3.0}, "id": 148800708}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "Been previously 10 years ago so expected it to be a bit dated. Not at all. Like a previous writer we got room 365 side of hotel, no view, dull outlook. We asked for a new one and got it the next day overlooking the pool without any problems. Reception staff very friendly as were staff in restaurant. Food was of a high standard, usual buffet, but more variety than ' poster ' hotels. Staff very attentive removing used plates etc and escorting you to your table. Rooms cleaned every day, new towels if wished. Daniels bar showed sky for premier league football and was very reasonable prices for a hotel. Well used by residents as was upstairs lounge bar where shows every night. Pool area clean, well maintained although elderly English, not german, bed reservation group still there by about 8.20am. We had fun watching them whilst having breakfast.", "title": "Friendly hotel will be back.", "helpfulness": 4, "user": "Pat C", "date": "December 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 146825675}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "Me and my partner stayed here for 7 nights half board. The hotel was a fantastic location for us, a 10- 15 minute walk to the beach and the same to the nightlife. We didnt stay around the pool area but it looked nice with plenty of sun loungers.", "title": "Brilliant hotel and location", "helpfulness": 4, "user": "cooley02", "date": "December 2, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 146634676}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled with friends", "text": "The room was comfortable with everything we needed, lets face it you dont go on holiday to sit in the room all day!.", "title": "hasnt lost its touch.", "helpfulness": 3, "user": "CleethorpesLonny", "date": "November 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 146485734}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "The food in the hotel was fantastic especially as I am a fussy eater! i still found plenty to eat and it was all lovely. My partner is more adventurous with food and he enjoyed all the different food on offer.", "title": "friendly staff, great food", "helpfulness": 3, "user": "durhamtravelingjan", "date": "November 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 146130287}, {"rating": 3.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "Overall the holiday was fantastic and i would recommend it to anyone, and we have booked our next stay here for next year.", "title": "Service was great", "helpfulness": 2, "user": "angelahawkins1", "date": "November 24, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 146087965}], "location": {"country": "Spain", "continent": "Europe"}, "stars": 3, "variance": {"poor": 26, "average": 130, "very good": 265, "terrible": 20, "excellent": 184}, "aka": "Catalonia Oro Negro Hotel Playa De Las Americas", "slim_ranking": 0.396825396825, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.5}, "description": "Catalonia Oro Negro is located 500 metres from the las Americas de Arona beach, in Tenerife, close to the local leisure centre and the \"Las Americas\" golf club. The hotel facilities cater to the most discriminating clients, both adult and children: swimming pool for adults, children's swimming pool, children's playground, large terrace, solarium with hammocks, hairdressers and beauty salon, table football, table tennis, private garden, pool bar, live shows in the bar, Daniel's bar, breakfast buffet restaurant and more."}