{"user_rating": 4.0, "review_count": 380, "name": "Catalonia Portal de l'Angel", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "Stayed here with my 2 kids for 3 nights. Gorgeous courtyard in the middle of the hotel, spacious and quiet with a small pool - perfect antidote to the teeming city outside. Staff were really sweet and helpful, Excellent breakfast - no charge for under 12s.", "title": "oasis in city centre", "helpfulness": 1, "user": "BrightonWriter", "date": "October 10, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 142445019}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "Only thing I would say is request on booking a room that is not interior. Rooms are comfortable and nicely done, but interior rooms lack light and air. We were moved without fuss to a room overlooking Portal del l'Angel.", "title": "Holiday", "helpfulness": 2, "user": "Rosaleen B", "date": "September 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 141087210}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled on business", "text": "I would definitely stay at this hotel again, for two reasons - its peaceful courtyard and its excellent location, 2 mins from Placa Catalunya, 2 mins from the Rambla.", "title": "A little pearl in a great location", "user": "LollyMontreal", "date": "September 23, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 141039599}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "My Husband and I spent a very pleasant week here. Hotel very well located for sight seeing and shopping. We chose a room with a terrace which was over looking a very nice garden, this was very relaxing space to sit in shaded from the midday sun, lovely pool also and nice and quiet at the back of the hotel. (Front of hotel is on a very busy shopping street). Room was perfect for our needs, spacious and A/C was pleasantly quiet, well cleaned daily. Staff at desk pleasant and helpful. We didn't have breakfast as we thought it a bit too expensive but there are so many places close by you won't go hungry.", "title": "All you need in a fantastic location!", "helpfulness": 1, "user": "Junita56", "date": "September 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 140406067}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "My husband and I spent 6 days here in October. The hotel is conveniently located on a pedestrian-only street, just a short walk from the Cathedral, Barri Gotic, Las Ramblas, and La Boqueria. It's also very near the Placa Real stop for buses going to and from the airport. The street on which the hotel is located is crowded with people during the day but quiet at night. The building is a renovated 19th century property, retaining a lovely wide staircase (with tiled landings) rising from the lobby to the upper floors (there are elevators, too, of course!). Our room was large by European standards, especially the bathroom, and had been recently renovated. We paid a little extra to have a room at the back of the hotel with a terrace on which we could enjoy morning coffee. Staff at the hotel were very efficient and helpful, although not effusively friendly. We very much enjoyed our stay and would recommend the hotel to others.", "title": "Comfortable room in a good location", "helpfulness": 1, "user": "WillowG", "date": "December 23, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 147971389}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "Location is excellent, so Central, on a main shopping street. Hotel is very very clean, spacious and relaxing. Staff are friendly and had a few great nights sleep here. Your central to everywhere. Would HIGHLY recommend.", "title": "Excellent", "helpfulness": 1, "user": "ElleBi", "date": "December 19, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 147731643}, {"rating": 5.0, "title": "Great service!", "text": "Fabulous location! We were in the one and only suite, located on the roof. It was a little cold the first day and we needed a heater which was provided promptly without fuss & we were given complimentary breakfasts & a half bottle of cava for the inconvenience.", "helpfulness": 1, "user": "BearPear", "date": "December 18, 2012", "id": 147691892}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled on business", "text": "The staff were all pleasant & quietly efficient. The breakfast which, to be fair, we got for free, was a little disappointing and rather than paying 19 euros each I would recommend stepping out to one of the many local patisseries - coffee & pastries for 2, 6 euros.", "title": "A very supportive, friendly, comfortable place for a very busy week!", "helpfulness": 1, "user": "Daniel_W_52", "date": "December 15, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 147518929}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled on business", "text": "The hotel is a 2 minute walk to the aerobus drop off, many excellent shops outside the front door, the metro is cheap & reliable and the ho-ho bus was useful for getting our bearings. If I was to go back to Barcelona I would stay here, it has everything you need for a fantastic stay!", "title": "A year on it's still great!", "user": "Alan O", "date": "November 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 145576810}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled solo", "text": "Lovely hotel set in the heart of the city. Easy walk from the Airport Express Bus pick up and drop off. Hotel opens into the mall of Portal de l'Angel, where there are department stores and big brand shops. Easy walking distance to all major attractions. As a single female traveller, felt very safe with the location. Hotel staff very pleasant, hotel room, whilst no view, was very modern, with tea, coffee making facilities and cleaned every day. Hotel breakfast was very substantial (pay for service). Will be recommending to friends as a place to stay. Good value for money.", "title": "Fantasic location ... great value", "user": "Leigh H", "date": "November 1, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 144193010}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "Great location, only three minutes walk to the Placa de la Catalunya (where the airport express buses arrive/depart) and La Rambla (market street with cafes and restaurants), and only a valuable 45 seconds to the many awesome pastry shops and strong coffee nearby (important because there was no in-room coffee). Our room looked over the bustle of the street with a nice view and a double paned window (which opens wide so you can get fresh air in if you like), so at night it was quiet enough. The only noise stemmed from the super squeaky floors which amplified people's footsteps,(like mine at 7am each day going out to get coffee and pastries). Wifi worked well, and generally it was a nice hotel, friendly staff, but the bar at the back was a bit cramped and lacked character (though the bartender was nice). I'd stay there again, can't beat the location.", "title": "Great location", "helpfulness": 1, "user": "BD_Singapore", "date": "October 27, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 143844515}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "Stayed 4 nights with my wife for her birthday in early October. Hotel is in a great location, only 2 minutes walk from the Placa de la Catalunya and La Rambla. We stayed in a superior room with a view of the Portal de l'Angel. It's a busy street but the double glazing kept out all noise night and day. Very well appointed and comfortable rooms. Only gripe was that there was only one chair in the room so the other person had to sit on the bed. Great choice for breakfast and also top quality evening meals in the restaurant. In-room safe could be bigger - I had to ask the hotel manager to look after my MacBook whenever we went out, but she did this with no complaints. We would stay again the next time we visit Barcelona.", "title": "Hotel with great location and friendly staff", "user": "Richard S", "date": "October 17, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 143035295}, {"rating": 3.0, "title": "Not great--late review", "text": "This place was kind of creepy. Not sure why, it just felt that way. It's not that clean, breakfast is fine, and the service is OK. The place just feels a bit dilapidated and the room was not well lit even with all the lights on.", "user": "Guy71", "date": "October 15, 2012", "id": 142831006}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with friends", "text": "This hotel was recommended by a colleague. It was brilliant. Fab room and there was a pool with a few sunbeds in the garden. It was also very quiet as its on a pedestrian street. I would definitely stay here again.", "title": "A great central hotel with sunbeds", "user": "EllyBellyBumpkin", "date": "October 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 142716310}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "This quaint hotel is centrally located right near the Plaza Catalunya, great shopping and the Catedral (a beautiful church with a pedestrian-only plaza in front that is lovely to just sit at).", "title": "A lovely, quaint hotel, very central, great staff...", "user": "olga t", "date": "November 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 145568058}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "This hotel is wonderful because the staff goes the extra distance. They are helpful and friendly. My purse was stolen while in Barcelona and the young man on duty at their front desk, Mr. Bru, went through a rather lengthy process of making phone calls to arrange to try to follow up a tip I was given as to where to retrieve it...He also made sure we were not going to a dangerous area, showed us the area on google earth and offered to arrange transportation. It was because of him going through all that, that I was able to get back my belongings (including my passport). So because of him, I am able to be back home in New York tonight writing this review. The staff is friendly, attentive and caring.", "title": "An experience to remember", "user": "Rob2285", "date": "November 11, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 145145767}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled with friends", "text": "As for the location, the hotel's front entrance is located on the Portal del Angel (a pedestrian only street full of shops like Corte Ingles, Zara etc.). The back of the hotel has a nice interior courtyard with a swimming pool and painted murals. Our room had a terrace overlooking that courtyard so it's great to book a room with a terrace. We were there now, in november and we got a good rate to stay for four days...Their rate was quite a bit cheaper than similar quality hotels with comparable locations (we did however, skip the breakfast included rate because that would have added 25 euros to the price---they did however have an affordable bar with snacks and an order-in pizza and burger service that had a reasonable menu for lunches and dinners etc.)...", "title": "Definitely a Hotel to Return to!", "helpfulness": 1, "user": "newtravellerSuffolk", "date": "November 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 145063978}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "Great location in the centre of the city and easy walking distance to airport bus and city tour buses. Nice walk down to wharf and many attractions close by. Helpful and friendly staff. Best breakfast selection of almost any hotel we have stayed at anywhere. Would stay there again when we get the chance to return to beautiful Barcelona. Shifted rooms after first night and well worth the extra money.", "title": "Everything you need", "user": "Ross390", "date": "November 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 144361433}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "We chose this hotel on recommendations via Trip Advisor and so glad we did. It is situated on the edge of the Barra Gothic and is therefore within easy walking distance of many sights such as Cathedral, La Ramblas, Port, and some excellent restaurants and bars. Easy by Airport Express Bus to reach Plaza Cataluyna and short walk to hotel. Also easy at Plaze Cataluyna to pick up the tourist buses. Although our room was facing the street, the soundproofing was good and the street was quiet at night. The staff were extremely pleasant and helpful. We would definitely say there again.", "title": "LOVED our huge terrace the most!", "helpfulness": 1, "user": "AmAsiaMinor", "date": "November 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 144356350}], "location": {"country": "Spain", "region": "Catalonia", "continent": "Europe"}, "stars": 3, "variance": {"poor": 11, "average": 46, "very good": 137, "terrible": 9, "excellent": 177}, "aka": "Catalonia Portal De l`Angel Hotel Barcelona", "slim_ranking": 0.103448275862, "description": "Housed in a 19th-century building, the Catalonia Portal de l'Angel (formerly Catalonia Albinoni) is set between Plaza de Catalunya and Barcelona’s Gothic Quarter. It features an outdoor swimming pool on the grounds and has free Wi-Fi.The hotel's comfortable bedrooms all feature private bathrooms, air conditioning and satellite TV. The Albinoni maintains much of its original design. The hotel restaurant, El Jardí de l'Angel serves a range of Catalan dishes and guests can dine on the pool-side terrace. The famous Las Ramblas is less than 220 yards away, while Passeig de Gràcia and Gaudí’s Casa Batlló can be reached in around 10 minutes, by foot. Barcelona Cathedral is just over 110 yards from the hotel. The Catalonia has easy access to public transportation and is just a 5-minute walk from Catalunya Metro and Train Station, as well as several bus services."}