{"user_rating": 4.0, "review_count": 3598, "name": "Catalonia Riviera Maya", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled with friends", "text": "I just returned from seven days at CRM and had an absolutely fabulous time! I went with a girlfriend and we had a blast! For the money, you can't beat the deal. I just wanted to say a few things...", "title": "Great value & fun!", "helpfulness": 8, "user": "Traveler1014", "date": "August 6, 2007", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 8361724, "likes": {"liked": "— Pools", "disliked": "— Rocky Beach"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "Food - The three standalone restaurants. Make your reservations as soon as you can! I waited until our third day and was told that everything was booked. She did manage to find us times, but it did require some haggling. What I found most annoying was that when we showed up for our reservations at the Mexican (loved the seafood fajitas!) and the Italian (mushroom risotto! YUM!), there were a lot of empty tables. People either forgot about their reservations or just elected not to show up. I would suggest that the hotel start overbooking, so as to allow for all guests to enjoy the restaurant. The only restaurant that actually filled all the tables was the steak place (which is actually the snack bar but with tablecloths.) The steak was very juicy and tender. However, the service was not as good as the other restaurants. The buffets were average but with plenty of choices, you could always find something to eat. I did have an issue with water re-filling. I constantly had to ask for more water...it got a bit annoying. Breakfast was probably my favorite meal - the omelette station rocked!", "title": "Great Pool- worth the cost!", "helpfulness": 5, "user": "beachbumTexas", "date": "August 3, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 8347097, "likes": {"liked": "— Pools", "disliked": "— Never any pool towels"}}, {"rating": 2.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "Bars - You want it, you got it. And if you want a stronger drink, just ask for it. We tipped the bartenders at the Tequila Bar (Manuel, Armando, Wilbur & Alfonso) the first day and they took care of us the rest of the week. Manuel would bring us our drinks at our pool chairs!", "title": "No wonder it was an inexpensive resort!", "helpfulness": 7, "user": "Herg4", "date": "August 3, 2007", "detail_rating": {"front_desk": 2.0, "service": 1.0, "cleanliness": 4.0, "value": 3.0, "rooms": 1.0, "location": 3.0}, "id": 8316068, "likes": {"liked": "— Price of vacation", "disliked": "— Service was horrible in every aspect"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "Rooms - It's a room where you sleep and escape the heat. It's got a TV with access to ABC & NBC channels in NY & Miami and others as well. I found the firmer bed to be comfortable as a matter of fact. We had a humidifier in our room, which helped tremendously. They did remove it on Friday, for some reason and it took some time getting it back, but we did get it back.", "title": "Liked the Catalonia", "helpfulness": 2, "user": "fritobear", "date": "August 3, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 3.0}, "id": 8315687, "likes": {"liked": "— the view", "disliked": "— the food"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "Pools - We never had an issue with towels. We were usually up early so we put towels on our pool chairs and then ate breakfast. Never had an issue with getting a good seat.", "title": "Absolutely wonderful!", "helpfulness": 11, "user": "mmmj", "date": "August 2, 2007", "detail_rating": {"front_desk": 3.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8277730, "likes": {"liked": "— The food", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "Stayed for a week late in July. Really enjoyed the resort. Great food. Rooms were clean. Staff was very accomodating. We had a large group--four families (15 people). They helped us celebrate two birthdays and anniversary.", "title": "Great Resort", "helpfulness": 1, "user": "tolietpapermaker", "date": "August 12, 2007", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 4.0}, "id": 8402232, "likes": {"liked": "— Excellent food", "disliked": "— One family member got sick"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "Would definitely go back and recommend this site to others.", "title": "Great Holiday", "helpfulness": 7, "user": "mikedr", "date": "August 12, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 3.0}, "id": 8399703}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "Stayed at the Riviera Maya side from 25/7 – 5/8.", "title": "Good Value", "helpfulness": 6, "user": "surreyapples", "date": "August 8, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 8372049, "likes": {"liked": "— Close to beach/snorkelling", "disliked": "— Sun beds too close together, not enough shade, beach area a bit bigger!"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "Had an absolutely brilliant time. First visit to Mexico and would return again to this resort.", "title": "Very Nice Resort", "helpfulness": 8, "user": "Scottneon", "date": "August 6, 2007", "detail_rating": {"front_desk": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 8363935}, {"rating": 2.0, "stay_parameters": "Stayed August 2007, traveled with friends", "text": "Hotel – Room functional and clean, could probably do with updating, but that’s been picky. Mattresses are hard, but comfortable and air con worked a treat. Accommodation blocks and pools are well set out and the grounds are immaculately kept. Found staff to be always polite and friendly.", "title": "Be aware", "helpfulness": 6, "user": "Jandie", "date": "August 6, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 5.0, "value": 2.0, "rooms": 3.0, "location": 2.0}, "id": 8363251, "likes": {"liked": "— Cleanliness", "disliked": "— Inconvenient location; unhelpful and sometimes rude hotel staff"}}, {"rating": 5.0, "title": "Holiday of a life time", "text": "My group of 6 stayed for 11 nights (rooms 320 and 321) and enjoyed ourselves tremendously. The accomodation and catering was very good, the staff where very friendly and eager to please.", "helpfulness": 1, "user": "rusdfalco", "date": "August 23, 2007", "id": 8488557}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "The brochures fail to mention the local marina which is less than 5 minutes slow walk down the road. It runs free dolphin and sea lion shows throughout the day. The hotel offers lots activities to suit all age groups. My lot have never spent so much time swimming/playing in the pool or sea. I highly reccommend this holiday and will be going again next year.", "title": "Great resort, great value", "helpfulness": 3, "user": "love2travel26", "date": "August 22, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 8473875}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "My husband and I spent a week at the Cat. RM in August 2007 for our 2 year weeding anniversary. It was great! It is a 60 transfer from the airport. People complained about that, I really dont know why. Thats just where it is. Get over it! It is a Great sized resort,easy to get around (some places were so big they had trollies to get too the beach) With the 5 pools and the beach their is pleanty of room to relax!!", "title": "Unique Beach Features at Catalonia RIviera Maya", "helpfulness": 7, "user": "castoffthebowlines", "date": "August 20, 2007", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 8461399, "likes": {"liked": "— Very clean, lovely gardens, good food and terrific ocean layout, lagoon and beach!", "disliked": "— everything was excellent!"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "Food- We are very picky and we always found something to eat. We went to the Italian resturant one night, the food was better at the buffet and the meal took a long time! Go to the crepe and ice cream place for dessert (its upstairs) excellent ice cream", "title": "Treated like royalty at the Cat", "helpfulness": 16, "user": "Florie", "date": "August 19, 2007", "detail_rating": {"front_desk": 2.0, "business": 1.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8449545, "likes": {"liked": "— Impeccable, clean beach and landscaping; wonderful, friendly employees", "disliked": "— Children allowed in bar area"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "Pool/beach-Wonderful! we never had trouble getting towels or chairs. The beach is nice, if you arent use to walking on the sand bring water shoes, but I didn't need them. Snorkeling in the lagoon bridge area is great! If you have kids dont let them sit at the pool bar,that is bad parenting. oh and it is a topless beach soo just be aware. The hobie cats are great!!", "title": "Great place for the price!", "helpfulness": 5, "user": "beckytv", "date": "August 13, 2007", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 4.0}, "id": 8408523, "likes": {"liked": "— Value", "disliked": "— no frig in the room"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "I must say it has been a few months, since we went. But when I read that someone was telling people to go to the Palace resorts I felt compelled to write. First off the Catalonia Resort and The Palace Resorts are not in the same category. The Catalonia is more of an upper Mid-Scale resort they attract regular everyday people wanting to have a great vacation and not drain their bank account at the same time. The Palace resorts are Upscale and OVER PRICED, you will pay for it several times over and above the price you will pay at the Cat. I have stayed at a few 5 star resorts in Riviera Maya and I like it. However, hands down would recommend the Cat just for the pure over all experience I had with the resort itself, the guest clientele and resort staff.", "title": "Could not have had a better Vacation", "helpfulness": 7, "user": "Scubafreak1", "date": "July 15, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 34838569}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled with family", "text": "I had a blast 3 out of the 3 times I have stayed. Didn't always have a king bed, that was ok. We always have had a garden view... but I expect that when booking Run of House. Each time the room was nice, clean sheets/towels etc, running utilities.", "title": "24th trip to the Rivera Maya, Catalonia is as nice any others", "helpfulness": 3, "user": "talara", "date": "July 15, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 34827297}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "We have always hooked up with other couples wanting to have a great vacation experience just as we wanted. This resort has a great spa, water sports (you need water shoes because of the rocks on the beach) The lagoon is very nice, no rough waves. But if you’re into that the regular beach is for you. I thought the food was good, several options. Drinks were good with many options.", "title": "California Family Finds Tremendous Value", "helpfulness": 2, "user": "Touchies", "date": "July 14, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 3.0}, "id": 34755287}, {"rating": 3.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "We all have to remember when you book and put in a \"request \" for a King...smoking/non...views.... is just that a request...you may get it, or not. Don't let that wreck your vacation.", "title": "Pretty good- but there are much better choices nearby.", "helpfulness": 1, "user": "Travelerkris", "date": "July 13, 2009", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "location": 3.0, "service": 4.0, "rooms": 2.0}, "id": 34683333}, {"rating": 3.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "So go to the Cat and enjoy yourself because you’re on vacation and you can!", "title": "ok place", "helpfulness": 1, "user": "arupare", "date": "July 13, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 2.0, "service": 2.0, "rooms": 5.0}, "id": 34649991}, {"rating": 2.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "The beaches in the Cancun area are beautiful and the water is warm, but take this away and rate the hotel itself and you have a different rating. Yes the grounds are beautiful and the hotel from the outside is too. However, the inside is a different story!", "title": "This resort needs help", "helpfulness": 1, "user": "teach2nd", "date": "July 20, 2009", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 3.0, "service": 2.0, "rooms": 1.0}, "id": 35272260}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "We had a standard room which was in need of updating. The beds was as hard as a rock and the room was old. Some fresh paint and a little updating would go along ways. When we first checked in they tried to give us a room with one king bed for my husband, me and our 17 year old daughter! I guess they thought this would be okay if we all slept together! We booked this place 3 weeks in advance and were guaranteed two twin beds. I also requested something centrally located as my husband has cancer and we were trying to think about his needs. Instead we were placed by the lobby which is the farthest from all the action. We were less than thrilled and asked to look at an upgrade which everyone says to get. What a BIG differance. The upgrade is updated, clean and has more to offer. We thought we would go for this upgrade since everyone stated in their review it was only 25 dollars a night U.S. Well, this is wrong...it cost $25.00 per night per person. We would have had to pay $75 extra per night for the 7 nights there, and they only had a King bed! We were already paying $85 per person, per night. Our housekeeper kept our room clean and was very nice which made us feel better.", "title": "What a pleasant surprise!!", "helpfulness": 4, "user": "ieemc", "date": "July 20, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 35247205}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled with friends", "text": "The food at this resort was awful and some of the things we saw made us sick. This place is a nightmare when it comes to cleanliness. No wonder they had to shut resorts during the swine flu. The Brisa buffett was scary literally! We saw wait staff topping drinks off with old drinks. We saw people and staff eating with their hands at the buffett (no manners and lack of cleanliness). We saw silverware being reused!!! If the silverware looked clean they kept it for the next group, but many people touch their silverware even if they don't use it and I certainly don't know if the people before us wash their hands. They also use a knife to clear the crumbs from the table and \"SOME\" wait staff would put the dirty knife back on the table.", "title": "Another Honest Review", "helpfulness": 1, "user": "travelleo", "date": "July 19, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 35152437}, {"rating": 2.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "I would suggest eating in the El Mercado buffett on the Yucatan side. It is much cleaner, less crowded, and food is better, but the same as Mercado. Many people think they can't eat there as they paid for the Riveria side. Not true and it states that in your package.", "title": "Never Again! What a disappointment", "helpfulness": 4, "user": "SurgeonGeneral", "date": "July 18, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 3.0, "service": 3.0, "rooms": 3.0}, "id": 35075459}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "The pools at this resort were small compared to others. We were fine with that as we swam at the beach the whole vacation. Water socks are nice due to rocky shelf, but we loved the beach. The pool with the bar was packed and gross. No room to swim or move and was a place to just drink and be seen. Young crowd loved this. We prefer the bigger pools you can swim around in and swim up to get a drink.", "title": "The Cat just gets better and better!", "helpfulness": 1, "user": "bmanssister", "date": "July 16, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 34948669}, {"rating": 3.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "We stayed at The Cat on the yucatan side for the last week in February. I found the hotel to be nice, the rooms were simple but the grounds were wonderful. I found that the swim up bar was closed most of the time and when it was open the drinks werent very good. A short walk to the looky bar which is righ of the beach was well worth the improvment on drinks...Raphael was an awesome bartender. The a la carte reseraunts were a disapointment. The grill was great but the mexican and italian were awful...the buffets were much better. We preferred the buffet on the riviera side to the yucatan side.", "title": "Good resort with some problems", "helpfulness": 2, "user": "defiant_angel", "date": "August 28, 2007", "detail_rating": {"front_desk": 2.0, "business": 2.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 3.0}, "id": 8524329, "likes": {"liked": "— Very nice looking and clean", "disliked": "— there were a lot of children everywhere"}}, {"rating": 1.0, "title": "Worst Experience Ever!", "text": "The beach chairs were a huge problem, people would get up in the middl eof the night to put their towels on them, reserving them. There were times when I was up at 6:30 am and could not find an open chair.", "helpfulness": 3, "user": "kjdkuna", "date": "August 28, 2007", "id": 8523948}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "As for the attractions in the area, the Coba tour through playainfo.com was excellent...Mitch was a great tour guide. I found Xcaret to be very dissapointing but Xel-Ha is a must see. The hotel can book you a tour that is all inclusive at the park. I believe it was around $50 but included your snorkelling equipment as well as all the food and alcohol!!!!", "title": "Great Vacation", "helpfulness": 5, "user": "BoricuaBoston", "date": "August 26, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 3.0}, "id": 8508145, "likes": {"liked": "— Everything", "disliked": "— The beds"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "I would stay at the cat again for sure, the resort itself was very nice (we did lose power a couple of times however). The front staff rarely had any idea what was going on but if you are lucky enough to find gregory he is very helpful!", "title": "Very clean,Well located. enjoyed the Cat", "helpfulness": 8, "user": "Molson_ice", "date": "August 25, 2007", "detail_rating": {"front_desk": 2.0, "business": 1.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 8500326, "likes": {"liked": "— The entire resort was spotless.", "disliked": "— No mini fridge in the rooms and only one type of beer on tap."}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled with friends", "text": "Where do I start . . . The food is sub-standard i.e. beans and cheese and boiled eggs The only seafood we had was way, way over cooked and had bad, strong seasonings. The drinks were so watered down it was ridiculous! Even the wine!! The current & rocks made walking and/or swimming impossible. Trust me, next time I will be returning to Aventura Spa Palace and have the best of the best once again, why I ever went to Catalonia was my hubby's doings. Thanks, Rita", "title": "Great Resort. Best Place for Fish Lovers", "helpfulness": 10, "user": "Ellen_Markham", "date": "August 23, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 8490207, "likes": {"liked": "— beach, lagoon, water sports"}}, {"rating": 3.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "We stayed at the Cat for our 1 year anniversary Jun 15-19, 2008. This was my first time at an all-inclusive resort. I have been all over the carribean with family in private villas that are not all inclusive. Our travel agent said it was four star but I know what four star is and the Cat is barely three star just so you know.", "title": "Average", "helpfulness": 4, "user": "Erika2436", "date": "July 16, 2009", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 3.0, "service": 1.0, "rooms": 3.0}, "id": 34925548}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "The airport transfer took over 2 hours. It is an hour from the airport but we were the last to be dropped off so everyone else on the transport were dropped at their hotels first so it was a good two hours before reaching the Cat. My husband is Guatemalan and therefore speaks perfect Spanish and we never would have made it if it weren't for that. That's how he was able to find out that the transfer driver goes to the local supermarket and stocks up on Coronas and then charges $5 a piece to make extra money on the side. Beware! He offers you a nice cold beer then afterward charges you $5!", "title": "Awesome vacation - would definitely go back", "helpfulness": 7, "user": "portsmouth27", "date": "July 15, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 34883131}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled with friends", "text": "Our room at the Cat was fine. It had air conditioning and the beds were fine. We weren't there to stay in the room we were there to enjoy Mexico so the room was fine. At the swim up bar we talked with everybody and apparently there had been some theft. Thieves would enter the room through the sliding glass doors to steal wallets and money. We kept everything locked in our luggage in our room so we didn't have any problems with theft but it was a bit disconcerting to know there was theft taking place.", "title": "Girls Trip-Wonderful!", "helpfulness": 6, "user": "planotechmom", "date": "July 15, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 4.0, "rooms": 5.0}, "id": 34883006}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "The first night we arrived around dinner time and wanted to eat at an al a carte restaurant but were told you had to go to the Looky bar between certain hours to make reservations so our only choice was the buffet. I was sorely disappointed with the buffet. None of the food had any kind of seasoning (literally boiled chicken), a lot of it was cold and a lot of it undercooked. I figured I'd just eat more dessert (after all it is a vacation) but the desserts were disappointing as well! Think bread with unsweetened whipped cream. Even the ones that looked really good were again bread with unsweetened whipped cream. But the worst of all was the mosquitoes. I have never been eaten for dinner before like that and I live in Houston yall! We know mosquitoes but this was right out of the discovery channel! You couldn't get away from the cloud as the buffet is an open air restaurant and you couldn't carry on a conversation as they would try to get in your mouth! So needless to say, we ate what we could before we couldn't take it any more. I made sure we doused ourselves with OFF! each evening for the rest of our stay.", "title": "Well worth the money!!", "helpfulness": 8, "user": "MarkBB33", "date": "July 15, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 3.0, "service": 5.0, "rooms": 5.0}, "id": 34865814}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "The next morning we went to the front desk for tickets to the al a carte restaurants. Our travel agent had promised us we'd get one for each night of our stay. The front desk however said we'd only be allowed one ticket per 4 nights. My husband switched to spanish at that point and we were able to get two more tickets. That ALWAYS seemed to work. They'd see me (blonde and blue eyes) and didn't speak a word of English and couldn't help us and then my husband would immediately switch to spanish and the shock on their faces was almost downright halarious! It usually got the problem solved though.", "title": "A Excellent Value", "helpfulness": 7, "user": "sparkywoff", "date": "July 15, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 34855978}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "I travelled here at the middle of April last year and i loved it. The food was great and a nice variety was given. The rooms were standard but always kept lovely and clean with fresh towels given everyday. The staff were really friendly and really good to get along with. There was always someting going on a night but if you jus wanted a quiet drinks there was plenty of space alway from it all. While we were there there was a bbq on the beach it was really good. I would definitley come back here and am just looking at going back there next year.!!!", "title": "Amazing!", "helpfulness": 5, "user": "mexico_09England", "date": "July 13, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 34618394}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "My husband, six year old son and I stayed at the Catalonia from July 3-11/09. We have substantial experience with All Inclusives (Dominican Republic-Catalonia Bavaro, Dreams Punta Cana and Casa Del Mar/Dreams La Romana; Jamaica-Sandals Ocho Rios; Mexico-Barcelo Maya, Catalonia Royale Tulum), so we felt we could give a review that can be compared to our other experiences.", "title": "Great resort for the price", "helpfulness": 1, "user": "cchassie", "date": "July 12, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 3.0}, "id": 34561433}, {"rating": 1.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "First off, we had a great vacation for many of the reasons others listed, but this resort does have some flaws. |I will touch on both the good and the not-so-good.", "title": "Butlins abroad...... Don't go near it!!!!", "user": "morgan38", "date": "July 12, 2009", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "location": 1.0, "service": 1.0, "rooms": 1.0}, "id": 34528730}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "Rooms-we booked our vacation for the Catalonia Riviera Maya but based on what we wanted (near the beach and the pool, room for a cot for our son) we ended up on the Yucatan side. This was excellent for us-room 2115 had great air conditioning and, well very basic, was enough for us. The location was perfect-just out the door, down the stairs and 30 steps and we were at the largest pool in the resort. We brought our own one cup coffe maker, coffe and whitener so it was NOT worth $15 per person per night to upgrade for just the difference of a coffee maker and mini fridge. $25 per person per night for the Deluxe room. You do only get two bottles of water per room for your entire stay-so you must refill these daily. A bit frustrating. Especially since the water dispensers are empty frequently and are not kept running in the night-so if you want to fill in the morning you will have warm water. The beds are HARD. But we asked for a bed topper right at check in and they brought these within a short time when they brought the cot for our son. We also might mention that we always stay 2nd floor or above to minimize the bugs that like to crawl under the door at night. The walls are very thin and we had the unfortunate experience one night of listening to a guy beating his wife/girlfriend and another night a group of teenagers (local) destroyed the very same room. Security and housekeeping spent hours cleaning the room. But the response from security was immediate!", "title": "excellent for the value", "helpfulness": 2, "user": "mamamyriam", "date": "July 11, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 34466306}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "So, even with some of the negative things we mentioned, this was a wonderful resort and well worth the money we paid. We had a wonderful time and would recommend this resort if you are able to overlook some minor frustrations. Everything is what you make of it!!", "title": "decent place for first timers", "helpfulness": 3, "user": "javil2005", "date": "July 10, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 3.0, "service": 4.0, "rooms": 3.0}, "id": 34403460}], "location": {"country": "Mexico", "region": "Yucatan Peninsula"}, "stars": 3.5, "variance": {"poor": 197, "average": 455, "very good": 1263, "terrible": 115, "excellent": 1568}, "aka": "Catalonia Yucatan", "slim_ranking": 0.75, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "description": "Catalonia Riviera Maya is situated in the peaceful ambience of Puerto Aventuras, located directly on the beach of the beautiful Mexican Caribbean and in the heart of the Mayan Riviera. The white sandy beaches, crystal clear water, a great marina with restaurants and bars at a walking distance as well as a 9 hole golf course makes Puerto Aventuras a place that stands out, a place for those looking for the authentic Caribbean."}