{"user_rating": 4.0, "review_count": 1686, "name": "Catalonia Gran Dominicus", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled with friends", "text": "I seriously do not understand why people have so many negative things to say about this hotel! I think some people expect to pay a relatively cheap(ish) price for a hotel in this country and still expect 5 star plus standards! If you want a luxury holiday worth thousands of pounds then that is what you should pay for.", "title": "Don't believe everything you read!!! Fantastic Stay, would definitely visit again!!!", "helpfulness": 3, "user": "Emma_R1113", "date": "January 7, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 92098126}, {"rating": 3.0, "stay_parameters": "Stayed January 2011", "text": "We had a FANTASTIC holiday at this hotel and would definitely rate it at 4 stars!", "title": "DON'T GET MARRIED THERE!", "user": "Coldwaterbroomhida", "date": "January 6, 2011", "detail_rating": {"service": 1.0, "cleanliness": 2.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 92003193}, {"rating": 3.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "The staff were brilliant and worked tirelessly night and day to ensure we had the best stay possible! We are English and did not in any way feel ignored by the staff because of this, they were all more than friendly and made every effort possible to hold a conversation with us and include us in activities and were always very friendly!", "title": "GOOD if your a rookie traveler and looking for value", "user": "fivestargringo", "date": "December 24, 2010", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 2.0, "location": 1.0}, "id": 90594681}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled solo", "text": "We stayed in a standard room which more than sufficiently met our needs. I don't think the rooms are old or dated and are comfortably decorated with a large comfortable bed and more than enough room. The air-conditioning and safe in the room are FREE of charge, which is practically unheard of in a lot of places. The bathroom also more than met our needs. I must admit there was a slight musty smell when we first entered the rooms but this soon went and did not continue beyond the first night!", "title": "the best", "user": "drfinest", "date": "December 9, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 89462182}, {"rating": 3.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "We only wanted a comfortable room for a siesta and to sleep in at night and our room was perfect for this! If you go on holiday and want a room that you can sit in all day, you may as well stay at home!", "title": "Beautiful Beach, Great Food... but the rooms are NOT good", "user": "Southbeacher", "date": "November 25, 2010", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 2.0, "sleep": 3.0, "rooms": 1.0, "location": 5.0}, "id": 88205892}, {"rating": 2.0, "stay_parameters": "Stayed June 2010, traveled with friends", "text": "I don't even know where to start.. it was that bad!", "title": "Just Horrible- don't stay there if you wanna a nice holiday!", "helpfulness": 1, "user": "Raimonda L", "date": "October 21, 2010", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 2.0, "sleep": 2.0, "rooms": 1.0, "location": 2.0}, "id": 84322125}, {"rating": 4.0, "title": "fair", "text": "it was me and my mate travelling together, we wanted some nice and not too expensive beach holidays, and after a long consideration decided to book Catalonia Gran Dominicus as it was very good price and quite good reviews as well. It was the biggest mistake in my life, and actually for the first time i wanted to go home asap. Thanks to our Holiday rep we were able to change the hotel and at last to enjoy our holiday.", "helpfulness": 1, "user": "brianbonsell", "date": "October 19, 2010", "id": 84110559}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "The reason why we hated the hotel:", "title": "Excellent stay!", "user": "jollyenjoyer", "date": "October 4, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 82038166}, {"rating": 1.0, "stay_parameters": "Stayed September 2010", "text": "*First of all we didn't have very high expectations because of the price, but everything was just terrible, first of all all our luggages almost ended up at the wrong hotel, thanks god I saw them being left on time. So we went to the hotel, they gave us the keys to the room, we walked through quite nice garden in to our room, open the door and it was just really bad smell of bleach, shower was nearly falling off, room dark and decorated like 20 years ago. My first thought was that i do not want to stay in there for 2 weeks. we went straight back to the reception and asked for an upgrade, for which we had to pay of course. Hotel charged us $420 straight away, and we there given renovated room 1112. it was very nice room, newly done, but cleanliness was not there, after redecorating or painting or any works i believe rooms should be properly cleaned, as i was in the shower i touched the walls and there was a chalk on there, which means after putting new tiles nobody actually cleaned them.", "title": "Not so good!", "helpfulness": 5, "user": "Pvinas", "date": "September 24, 2010", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 4.0, "service": 1.0, "rooms": 3.0}, "id": 80861669}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled with family", "text": "*After all the stress we go for a swim in to the sea, get out of the water and all legs and body was covered in flies straight away! i wanted to disappear the same second! That flies actually were mosquitos and they there everywhere! and butterflies as well! just awful!", "title": "Family Friendly, Food Needs Improvement", "helpfulness": 1, "user": "joytiare", "date": "September 24, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 80810883}, {"rating": 3.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "We are frequent travellers at not first time in the Domincan Republic which we love. Usually stay at 4 star hotels.", "title": "3 star hotel unless you upgrade", "user": "SAMANABahiaprincipe", "date": "January 26, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 2.0, "location": 4.0}, "id": 94508892}, {"rating": 4.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "-Service at hotel is great.", "title": "A Fantastic Holiday", "user": "Jacq54", "date": "January 25, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 94361467}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "-Everyone is so friendly.", "title": "Best hotel in Caribbean", "helpfulness": 2, "user": "AnnieLennox", "date": "January 23, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 94135426}, {"rating": 4.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "-Good animation team.", "title": "Four stars in my eyes", "user": "shank22", "date": "January 16, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 93263056}, {"rating": 4.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "-Grounds are amazing.", "title": "Acceptable Resort if you have the right expectations", "user": "MapleG", "date": "January 15, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 93038925}, {"rating": 4.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "My husband and I went to Catalonia Gran Dominicus from November 14-21 and stayed in a privileged room. Upon arrival we were greeted with a cold drink, which was really nice after traveling for quite some time. The front desk was super nice (this was our 5th time to the Dominican) and we have decided that usually the front desk people are the worst that you will encounter so we were ready to get it over with. To our surprise the staff was exceptionally friendly and ready to accommodate any requests. The check in process was very quick, we were informed what was open to eat at the time we arrived, they briefly showed us a map of the resort and pointed out where the beach, bars, pool and restaurants are in relationship to our room. The privileged room was really nice, unfortunately it was on the first floor. We like to have the curtains open in the morning and sit on the balcony so that did not work for us. We called the front desk and asked if we could be moved to a 2nd floor room. They told us it would not be a problem but the room would not be ready until 5:30pm, so we agreed. We checked out the resort and got something to eat before going back to the front desk to see if our new room was ready and it was. The room switch was super easy and it made us really happy. The privileged room did have really nice furniture, updated bathroom, nice towels and bedding, a mini-bar, beach towels in room (but only upon arrival, we thought we would get replacements but did not).", "title": "Great vacation", "helpfulness": 5, "user": "KristinaGMI", "date": "November 24, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 88080202}, {"rating": 4.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "The beach in front of the hotel is probably one of the nicest hotel beaches that we have been too (aside from the 7 mile beach in Jamaica), in the Dominican we have been to Puerto Plata, Cabarete, Samana, Punta Cana and now La Romana. The water is crisp, clear, perfect blue over white sand. A good stretch of the hotel beach access is covered in rocks however there is a portion of the beach that is used to enter and it is all sand. If I could have stayed in the water all day and night I probably would have. They also have a man made reef where there was a ton of fish to see (just bring some bread and snorkeling goggles, invest the $10 to have your own as you will use it here). The beach is very important to us as we spend most of the time there, so we were really happy.", "title": "Great week!", "user": "Elly_Love_to_Travel", "date": "November 21, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 5.0, "location": 4.0}, "id": 87815428}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "When it comes to food, overall it was ok to good. There is a pizzeria (with a real wood burning brick oven) and we ate there at least once per day. We tipped the chef and he made us a pizza to our liking for upon request. The pizza was probably the best part of the trip when it comes to food. Second were the crapes on the beach. It was perfect to get a cup of coffee and a crape in the afternoon. The specialty restaurants were just ok (we went to the Mexican and Italian), we were not wowed with the food, but it was decent. We usually ate at the buffet for breakfast and dinner and it was ok. There was always plenty to choose from and it would satisfy any picky eater. There were a few dishes that were really good but it did not happen every day. We really liked the fresh made juice in the morning as well as the pastries. The desserts are pretty standard in the Dominican, if you are a dessert lover, I would not have high expectations. The specialty restaurants serve pretty much the same dessert as the buffet. Save your calories for a crape :)", "title": "Great value for money in the Caribbean", "helpfulness": 3, "user": "Saleman", "date": "November 20, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 87673462}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "When it comes to entertainment this is probably the most entertainment we have seen from having been to several resorts throughout the country. For us it was too much but there were plenty of people waiting to participate. The animation staff tries really hard to involve everyone, they are just a nice and friendly bunch. They work so hard all day long! During the day there were plenty of activities including volleyball, archery, darts, dancing, aerobics, yoga etc. In the evening after dinner, at the main bar, there would be some dancing and they would mingle with the guests. The shows were mostly good, as long as there was dancing involved. They have also done a few shows, more like theater and to get the audience involved, but that is super difficult when you have to say everything in 4 different languages. It becomes boring. They should stick to dancing, as those shows were always good!", "title": "Well worth a visit", "helpfulness": 1, "user": "wanderlust81", "date": "November 16, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 87330361}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "For those considering to stay in a privileged room if you are used to high class by all means do it. There is something about the initial feel when you get to your destination, if you don't feel happy it changes how you see the rest of the things the resort has to offer. If you are thinking maybe, then do not initially book the privileged room as it costs the same to upgrade upon arrival. Truly the only thing you get is a different looking room in the same resort. It was $15/per person per night to upgrade when we book and that is how much it is advertised as at the resort. See what the regular room looks like when you get there and if you need something different then upgrade. I personally liked the upgrade, but think I would have been just as happy with the standard room, you don't spend much time there anyway.", "title": "Great Holiday, lovely beach and friendly staff", "helpfulness": 1, "user": "mitrebrab", "date": "October 24, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 84678294}], "location": {"country": "Caribbean"}, "stars": 3, "variance": {"poor": 55, "average": 176, "very good": 696, "terrible": 37, "excellent": 722}, "aka": "Catalonia Gran Dominicus Hotel Bayahibe", "slim_ranking": 0.166666666667, "detail_rating": {"service": 4.5, "cleanliness": 4.0, "value": 4.5, "sleep": 4.5, "rooms": 4.0, "location": 4.5}, "description": "Catalonia Gran Dominicus is an all-inclusive resort located on the south-east coast of the Dominican Republic and overlooks the white sandy beach of Bayahibe; 25 km. from the famous Caribbean art centre Altos de Chavon and 4.5 km. from the tiny fishing of Bayahibe, close to the Natural Park of the East, home of the biggest remains from the Island's first inhabitants, the Taino Indians; only 30 minutes by boat from Saona and Catalina both wonderful virgin islands."}