{"user_rating": 3.5, "review_count": 2096, "name": "Catalina Hotel & Beach Club", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled with family", "text": "For Christmas this year, my family decided that rather than exchange gifts, we would do a group vacation. My husband, 27yr.old daughter and son-in-law, and two single daughters, ages 26 and 24 investigated the South Beach Hotel Group, as my youngest and I had stayed at one of the properties last January. We fell in love with the rooftop pool at the Catalina during our last visit so investigated this hotel first. From the moment we made our reservation, our stay could not have been more ideal. Yvette booked our rooms (3 in the same bldg) - perfect. The rooms have been updated with wonderful mattresses and great bed linens. And I must say that the free shuttle from the Miami airport to the hotel, is an extremely nice amenity. The shuttle arrived at 11am to the minute in Terminal G, second level - plenty of room for luggage. The beginning of a no stress vacation.", "title": "We could never have asked for more", "user": "maryp1n", "date": "January 25, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 54350107}, {"rating": 2.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "The rooftop pool is wonderfully relaxing. The main level pool is quiet, and is where we had our complimentary Starbucks each morning. Without even asking, Michael the pool attendant got towels for us as well as pass cards for free lounge chairs at the beach. The beautiful beach is only 1 block away.", "title": "Only consider if you are on a tight budget (and get a good deal)", "user": "Mantelstone", "date": "January 25, 2010", "detail_rating": {"cleanliness": 2.0, "value": 3.0, "location": 4.0, "service": 1.0, "rooms": 2.0}, "id": 54344906}, {"rating": 2.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "The hotel restaurants are excellent and offer great choices. The service is very nice.", "title": "Dirty and noisy", "user": "zipili", "date": "January 25, 2010", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "location": 2.0, "service": 3.0, "rooms": 1.0}, "id": 54329656}, {"rating": 3.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "Happy Hour, free from 7-8pm is a nice treat. The bartenders are not stingy with the liquor.", "title": "No issues it is a solid 3 star boutique chic", "user": "MrFunkinDC", "date": "January 22, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 3.0, "rooms": 3.0}, "id": 54100109}, {"rating": 4.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "There are many good and affordable restaurants on Lincoln Rd. - just a 5 minute walk. There are pharmacies, liquor stores, lovely shops within very easy walking distance. Espagnola Way with upscale restaurants is a quick walk, too.", "title": "Had a great honeymoon here!", "user": "TravelJesse", "date": "January 21, 2010", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 54061470}, {"rating": 3.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "Pros: Great location in the heart of north South Beach. Very close to Lincoln Road, many post hotels, beach right across street. Price (hotwire) was great. Hotel advertises free airport shuttle, but found its schedule very restrictive, so we used taxi.", "title": "Good and bad - don't pay too much", "user": "steptravel", "date": "February 28, 2010", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 3.0, "sleep": 4.0, "rooms": 2.0, "location": 4.0}, "id": 57368671}, {"rating": 3.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "We stayed in middle building, which was dingy and felt cheap. Reception was OK, took a long time, I thought, what with having to use credit card for damage insurance, etc. Room itself was small, but OK for 1 night. Really wouldn't have wanted to spend more time there. As others have noted, with lights on, was VERY dim. Would not be able to read in room. Bathroom dark and kind of dirty-feeling too. Whole place needs good scrub and decent lights. What we really did like was the Tempurpedic mattress on bed, which I found extremely comfortable. This was a big plus.", "title": "Mixed in all aspects", "user": "fifteencent", "date": "February 25, 2010", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 5.0}, "id": 57044688}, {"rating": 3.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "The happy hour, as others note, included only 1 well liquor (rum the night we were there), but bartenders were generous with making the drinks. Several bars, I should say -- 1 \"bartender\" seemed like she couldn't care less, another in next-door bar (part of hotel) was good. Did not get a chance to use the advertised free bikes, which sounds great, or even beach towel/chair service.", "title": "Great location - but you get what you pay for", "helpfulness": 1, "user": "MontrealMe", "date": "February 23, 2010", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 56866029}, {"rating": 4.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "We stayed at this location twice on our recent trip to Florida. The first was intentional and the second was on Bookit.com's super deal mystery hotel. The price was good for the location, but based on the add on bookit’s site we had anticipated something better. We were totally bummed when Catalina was the mystery hotel as were pretty much flipped coin between the mystery hotel and booking the Savoy - what are the odds.. LOL", "title": "Good place for the money", "user": "fsumathguy", "date": "February 14, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 55957337}, {"rating": 2.0, "stay_parameters": "Stayed February 2010, traveled with friends", "text": "Rooms - first room was just outside of the lobby entrance with an outside window that would not close (street level). Curtains were pretty much fixed in place - might as well not had a window at all. Room was clean with a good sized safe that could hold your laptop. Second room was on ground floor but further back from the street - alley view. Much quieter and decent. Beds are quite good. I wonder if the so called deals are for the lower end rooms. Both rooms are 2/3 white (lower part of wall) and a red out of a B Vampire movie on the upper 1/3 – Retro. With all the lights on, both rooms were about as bright as a dimly lit pub. Drain in 2nd room was blocked (not a big deal) Mirror in the shower was a hit...", "title": "Great location and pools, poor service and LOUD!", "user": "katec", "date": "February 10, 2010", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 2.0, "sleep": 2.0, "rooms": 2.0, "location": 4.0}, "id": 55685322}, {"rating": 5.0, "title": "All you can ever ask for", "text": "My girlfriend booked the two of us a trip to South Beach Miami and she picked the Catalina hotel. I would not be one to write these types of reviews, but I had the trip of a lifetime. the location of the Catalina was right at the heart of the city and was walking distance to all of the night life and was right off the beach. The service was phenomenal and the room was outstanding. The pool and lounge areas were relaxing and classy, the cabanas by the pool were very nice and had drapery around them so you can enjoy a nice private nap by the quiet pool. The two bars were great and were very lively at night time, and the service was outright outstanding. It was just all I could have ever asked for.", "user": "bigsheard", "date": "September 25, 2009", "id": 44419553}, {"rating": 5.0, "title": "A PHENOMENAL EXPERIENCE", "text": "I have stayed on South Beach many times before and this time I thought I would try something new. I was pleasantly surprised by the service, cleanliness, and comfort of the rooms. The staff truly makes you feel at home, and the location cannot be beat. One of the nicest boutique hotels I have ever stayed in. I will be returning.", "user": "alombardi520", "date": "September 24, 2009", "id": 44211685}, {"rating": 5.0, "title": "A hidden gem in Southbeach", "text": "This is without doubt one of Miami's hidden gems - the best boutique hotel I have ever seen let alone stayed in. From the decor and class of the Dorset building to the hospitality of the management and staff, you get complete value for money and an experience that compares to more expensive hotels in the neighbourhood. The hotel is superbly managed by Linsey Harris and every member of her staff that I encountered treated us more like friends than guests. I stayed in the Dorset building which would easily compare to any 5 star hotel. The rooms are large and beds comfortable. The corridors are so quiet and you would hardly believe that you are staying in one of the USA's most vibrant areas. The hotel reception/concierge staff were always courteous and were well connected with the local nighlife and always seemed to produce guestlist passes to the hottest clubs when we asked. The drinks bar in the Dorset building is pure class and a must for any visitor especially at happy hour. The location is perfect in the fashionable part of Collins Avenue and in the shadow of more expensive hotels. This was quite useful as some great parties were held in the larger hotels and we got in past the velvet rope with ease due to guestlist priviliges. The Catalina also has some great events from time to time such as Shecky's Girls Night out, which is great for girls that shop and guys that want to meet cute single ladies. The hotel pool is always a great place to chill when you want a break from the beach and the pool drinks are always pretty strong - especially Honey's Mojito. I will definitely go back to this hotel when I'm next in Southbeach.", "user": "SouthbeachTaz", "date": "September 23, 2009", "id": 43980888}, {"rating": 5.0, "title": "One of the best hotels!", "text": "i had a great time; the rooms were great! the service and staff are excellent!", "user": "fateens808", "date": "September 22, 2009", "id": 43726904}, {"rating": 4.0, "title": "Had a great stay, definately my hotel of choice!", "text": "The hotel is in a great location, along with friendly and welcoming staff. We had no problems, the rooms were clean and the beds were comfortable. Would definately without a doubt stay here again.!", "user": "classinsession", "date": "September 22, 2009", "id": 43595200}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled with friends", "text": "First of all do not believe everything that is on here. It is a great location, the staff was more than friendly and went out of their way to help me!!! The room was clean and it was decorated nicely. The price was right and I would definetly go back and stay there next time I am in town. Thank you Catalina for such a GREAT stay!!!!", "title": "It was a wonderful experience....want to go again!!!!!", "user": "pickygirl01", "date": "February 10, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 55662095}, {"rating": 1.0, "stay_parameters": "Stayed February 2010, traveled on business", "text": "This hotel was dirty and the worker's were rude. The valet service was rude and took forever to bring your car back. The rooms are above a sushi restaurant and have an awful fish smell. My room didn't even get cleaned one day. The rooms are dark and falling apart. There are parties in the hall way every night - so if you want a pace to sleep this isn't it.", "title": "Horrible experience - dirty, loud & rude", "user": "stamon14", "date": "February 4, 2010", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 2.0, "sleep": 1.0, "rooms": 1.0, "location": 3.0}, "id": 55165417}, {"rating": 2.0, "stay_parameters": "Stayed January 2010, traveled with friends", "text": "We purchased a room at the 4.5 star Riviera Hotel and were moved to its sister property, Catalina, due to overbooking. The room had a giant cockroach so we were moved to another room. You could hear the loud music from the bar and the pool the ENTIRE time (day and night). The cleaning was extremely poor... dirty glasses and trash weren't even removed. The bathroom sink had a bad leak and flooded the floor every time it was used. Although the location was prime, the hotel was not nice enough for the cost and I would not stay there again.", "title": "Don't stay here unless you plan to party the entire time", "user": "CindyStevens", "date": "February 2, 2010", "detail_rating": {"service": 4.0, "cleanliness": 2.0, "value": 3.0, "sleep": 1.0, "rooms": 2.0, "location": 5.0}, "id": 55021439}, {"rating": 3.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "Although this hotel was near the beach and had lovely facilities - swimming pools were beautiful and furniture in bar was funky, we didn't realise that the bar directly below our room was a 24 hr affair and had live music with loud speakers and amps, and that the party crowd stayed til 5am!!", "title": "Noisy spot in Miami Beach", "user": "Victoria_BCMoose", "date": "January 31, 2010", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "location": 4.0, "service": 2.0, "rooms": 2.0}, "id": 54840758}, {"rating": 4.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "The room itself was OK but tatty and the bathroom floor was dirty. Also the grout in the bathroom tiles was all black and yucky too. No coffee or tea making facilities in the room either and the room phone didn't work to call the concierge.", "title": "Cool Hotel for the Money. Right on the Strip in the Middle of it all.", "helpfulness": 1, "user": "MikeFromOhio", "date": "January 30, 2010", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 54754448}, {"rating": 3.0, "title": "Good spot...", "text": "We ended up staying at the Maxine after a quick mix-up at the front desk. Our original reservation was in the Catalina, but we were upgraded for a $50 fee. Our room was actually very nice. Large with a separate sitting space. The pool at the Maxine is also very relaxing. The location of the Catalina was ok. Five-ten minute walk to Ocean Drive and the restaurants. Located pretty conveniently to Lincoln Rd - headed there on our last day, wish we could've spent more time. We stayed on the 3rd floor and were glad when the dj was playing until 2am on the weekends. We almost ended up in a room right off the lobby.", "user": "Cathie H", "date": "October 8, 2009", "id": 46271540}, {"rating": 1.0, "title": "Not worth the money", "text": "If we went again, we'd probably stay somewhere on Ocean Drive just for convenience, but all in all, the Catalina is ok. Clean room. Good service. Very nice pool.", "user": "clou3108", "date": "October 8, 2009", "id": 46258148}, {"rating": 2.0, "title": "stay if you dont mind not sleeping", "text": "The website displays a good looking hotel but it's not true.", "user": "natataka", "date": "October 8, 2009", "id": 46215249}, {"rating": 5.0, "title": "What a great time", "text": "Rooms: red walls, DIM lighting, lack of amenities, towels are dirty", "user": "leo4037", "date": "October 6, 2009", "id": 46034878}, {"rating": 5.0, "title": "Already booked our next stay!", "text": "Service: called for towels and had to wait 15-20 long...had to call several times. No smiles at front desk. Room security is minimal...", "user": "Ilovethesun727", "date": "October 6, 2009", "id": 46005214}, {"rating": 5.0, "title": "Amazing experience!", "text": "When my friends and I arrived at the Catalina Hotel and Beach Club we were more than pleased. The valet and front desk service was not only quick, but all the employees were very nice. Our room was very clean and decorated beautifully. One thing I absolutely loved about the Catalina was the decor. The hotel is decorated so beautifully which really added to the vacation experience. The hotel is literally right across the street from the beach. During the day they have beach chairs you may rent (for free!) and a rooftop pool that blew my mind! There is happy hour everyday and two amazing restaurants. While we were there, we went to their weekly karaoke party. We met many Miami natives who told us the Catalina is a great spot and even locals stay there as a weekend get away! They said it was Miami's \"best kept secret.\" The food at both restaurants was to die for. Another thing I really liked was how the hotel was not too big, but not too small. It was small enough that you felt as if you were their own special guest (like a celebrity or something!) but big enough to have more than enough privacy and room. All in all a GREAT experince!", "user": "karenneunzig", "date": "October 6, 2009", "id": 46003060}, {"rating": 5.0, "title": "All Good Things", "text": "P.S.- I have never seen more beautiful people in one place in my life! Amazing!", "user": "cheleechic", "date": "October 6, 2009", "id": 45997762}, {"rating": 5.0, "title": "Fantastic Stay - Can't wait to go back", "text": "The Catalina is a trendy hotel that has a great vibe as soon as you walk through the door, the rooms are well decorated and comfortable and the service is fantastic. The Sushi restaurant in the hotel is fantastic as well.", "user": "Avril_Milan", "date": "October 2, 2009", "id": 45649477}, {"rating": 4.0, "title": "good enough", "text": "Having read the mixed reviews about the Cataline Hotel, my friends and I were a bit nervous about staying here. However, as soon as we checked in and saw our rooms we were over the moon!!!! We stayed in the Maxine block and it was fab, our rooms were lovely and clean with an ace rain shower! One room was really quiet overlooking the pool, but one of the rooms was slightly noiser overlooking street. However, we came to Miami to party and have fun so it wasn't too much of a problem! The food at Maxine's restaurant was excellent, so much so we ate alot at the hotel! Breakfast was my favourite, the portions were huge!!!!!! Entertainment was also really good. Everynight was something different. There was a really good guy on a guitar playing requests all night, then an excellent karaoke night another night! Free drinks every night from 7-8pm.....doesn't get any better! Can't wait to go back, we all thoroughly enjoyed our stay and would recommend it.", "user": "matjackson", "date": "October 1, 2009", "id": 45603419}, {"rating": 5.0, "title": "Chic Hotel on the Beach", "text": "Part of a three hotel complex, its not stunning but its good bits are good...", "user": "dorothyz", "date": "September 30, 2009", "id": 45503013}, {"rating": 4.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "this is a 2.5 start hotel so people shouldn't be expecting a 5 star. There are 3 hotels side by side that all belong to the same company. We checked in at the Catalina but our room was next door. Can't remember the name but I think it was Maxine's? it was to your left when you went out the main door. I was pleasantly surprised when I got there because some of the reviews sound scary. I loved the eclectic look and vibe. the entrance to the building we were in smelled a little musty but you didn't notice it for long. the whole building is dark, its their way to add ambiance I guess, hall ways are very dark. My room was very cool with a large white bed dark wood floors large mirror, mini bar fridge. No problems with our room and no odours, air conditioning worked fine. there was a safe and hair dryer. It's apparent that they have been renovating as its an old art deco building, bathroom was renovated but water from the shower went onto the floor due a design flaw, so don't put any clothes on the floor and lay a towel down. it has free wifi. free designated drinks, usually rum or vodka, they were good, got a few in inthe hour because were were there sunday/monday which was nice and quiet. I did find that the walls were very thin and it can get noisy when people are coming in from partying, it is a partying town so beware of this. I recommend ear plugs to help with the noise, as it can get annoying if you are tired and trying to sleep. You are close to Lincoln Mall Rd (2 blocks)which there is alot of shopping there. You will also find a CVS where you can get some food and liquor . drink before you go out because its very expensive. there is also a Macdonalds on this road. Beach is across the street and you can walk down towards south beach. If you are coming from the port, it cost us $25 to get to the hotel and to the airport it cost $32 flat rate. There are people on the street trying to sell tours. We went to Gator Park and did the Everglades. This was a excellent tour $39 each. We also did a city tour with a bay cruise, this was also interesting and you get to go by all the stars houses out on the island. They pick up at hotels. Don't forget to tip,tip,tip....they work for tips. Everyone we encountered were very professional and friendly. The main hotel has free coffee in the morning.", "title": "Great for the price I paid", "helpfulness": 1, "user": "cubabound15", "date": "January 29, 2010", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 3.0}, "id": 54684868}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled on business", "text": "Just got back from an exciting stay at the Catalina Hotel & Beach Club. This was my third time at the hotel and looking forward to returning in the near future.", "title": "Catalina Hotel & Beach Club is South Beach's diamond in the rough", "user": "GQ70", "date": "January 28, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 54597801}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled solo", "text": "What can I say about this hotel property? Everything from value, room size and location was paramount. Rooms are double the size compared to other boutique hotels along Ocean Drive. Centrally located in the heart of South Beach, the hotel is across the street from the beach, and walking distance to the Miami Convention Center and Lincoln Road. The location is perfect and really can't be better, but still the hotel had a very youthful and stylish atmosphere. Also the staff was very friendly and helpful. The Dorset suite I stayed in had an upgraded bathroom, huge 42\" plasma TV, mini bar, and enough room and furniture to accommodate some of my guests. Other notable amenities:", "title": "Best Hotel in South Beach! Free Ammenities!", "user": "gailslist", "date": "January 28, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 54565477}, {"rating": 2.0, "stay_parameters": "Stayed January 2010, traveled with friends", "text": "2 rooftop pools, 2 restaurants, 3 bars/lounges, health club passes to Crunch Fitness, valet parking, and VIP passes to all South Beach clubs.", "title": "If you don't mind being kept up all night...", "user": "tinat00", "date": "January 26, 2010", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 3.0, "service": 2.0, "rooms": 2.0}, "id": 54444455}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "It doesn't happen that often that you leave a hotel with such a good feeling about your stay as it happened this time!", "title": "The location near Lincoln Rd is great, but so is the sushi, rooftop pool, and complimentary drinks", "user": "EtherealMiami", "date": "January 26, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 54433057}, {"rating": 4.0, "title": "girls weekend", "text": "OMG the Catalina beach hotel was so fun this weeend with girlfriends. The hotel is in the hart of SOBE you can walk to everything or check out a fun catalina beach cruiser... what a great idea. The staff was so helpful and friendly from the moment we arrived to the doorman making sure we had a Van/cab so we could all ride to the airport together. the food was so good loved the Sushi! I'l looking forward to my next trip to the beach and this hotel.", "user": "heathBChicago", "date": "September 30, 2009", "id": 45492412}, {"rating": 5.0, "title": "Come for the location and stay for the service!", "text": "The Catalina surpassed all expectations for location, quality of rooms and above all, service! From the two doormen who opened the door each time I would enter, to the friendly wait staff who made coffee, brought drinks poolside, or delivered mouth-watering sushi, the service at the Catalina was more than hoped for. The pool is a great place to spend the afternoon, relaxing in one of the comfortable cabanas and the restaurants offer everything from brunch to creative cocktails. I will definitely stay here again the next time I am in South Beach.", "user": "SusanCNaperville", "date": "September 29, 2009", "id": 45454657}, {"rating": 5.0, "title": "Heavenly rooms, divine location, mouthwatering eats, hospitable staff", "text": "Just got back from a great weekend with a group of friends! The location is perfect. We stayed on the Dorset side. Check-in was quick and the guys at the desk couldn't have been friendlier. The room was huge and the decor was chic. I felt right at home! Btw, love, love, love the bed- so comfy!", "user": "moni_t_4", "date": "September 29, 2009", "id": 45428906}, {"rating": 5.0, "title": "I love this hotel!", "text": "We ate at both Kung Fu sushi and Maxine's. I'm still craving Kung Fu's signature roll and Maxine's salads are so generous and tasty. Neither restaurants disappoint.", "user": "katphoto", "date": "September 29, 2009", "id": 45373498}, {"rating": 5.0, "title": "The Catalina Hotel is one of the best hotels on the beach!", "text": "Attractive & extremely warm staff, great locale and free happy hour drinks- I'm coming back and telling friends!", "user": "Michelle B", "date": "September 29, 2009", "id": 45361808}], "location": {"country": "United States", "city": "Miami Beach"}, "stars": 3.5, "variance": {"poor": 231, "average": 296, "very good": 554, "terrible": 327, "excellent": 688}, "aka": "Catalina Hotel And Beach Club", "slim_ranking": 0.408163265306, "detail_rating": {"service": 3.5, "cleanliness": 3.5, "value": 3.5, "sleep": 4.0, "rooms": 3.5, "location": 4.5}}