{"user_rating": 4.5, "review_count": 107, "name": "Cathedral Cottage Bed and Breakfast", "reviews": [{"rating": 4.0, "title": "Bijou", "text": "We can happily endorse many of the positive comments that have been made about this very distinctive property. Its garden situation is charming and its central location a huge advantage. The family are friendly and helpful hosts.", "user": "NatGreen", "date": "August 5, 2013", "id": 170807346}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "Gareth and Christine have applied considerable skill and taste to making the best possible use of the space they had to work with, managing to accommodate a double bed and (though the internal doorway is somewhat restricted) providing an adequate en-suite.", "title": "A special place", "user": "AntBurr", "date": "August 2, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 170470201}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "A good choice for an overnight stay.", "title": "Excellent base", "user": "Tony J", "date": "July 30, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 169887992}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "A really lovely B&B in the perfect position in Winchester - easy to walk to from the station and metres from the Cathedral. Would definitely recommend for a weekend away. We were really looked after and had a fantastic time.", "title": "A Hidden Treasure!", "user": "Juerg M", "date": "July 30, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 169857216}, {"rating": 5.0, "stay_parameters": "Stayed July 2013", "text": "'The Garden Room' at the bottom of a lovely cottage garden was perfectly situated for a three night stay whilst exploring Winchester. The cosy self contained room was well appointed and nicely private. A splendid breakfast in the vine covered patio, there was even 'marmite' for my toast and brown sauce for my bacon! Christine and Gareth were excellent hosts providing plenty of local knowledge and information. We would certainly stay there again.", "title": "Perfect hide away B&B for relaxing break in city centre location.", "user": "Curlywigmop", "date": "July 21, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 168389545}, {"rating": 5.0, "stay_parameters": "Stayed June 2013", "text": "I was staying overnight in Winchester for a meeting and booked the Cathedral Cottage. The price pad was very good, especially compared to other hotels in the area and the Mercure hotel which is in very close proximity.", "title": "Lovely little place, excellent location, value and hospitality!", "user": "dyl_jb", "date": "June 27, 2013", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 165494631}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled solo", "text": "Christine was very friendly and the overall service was excellent. The room provided everything that was required, and also had an ethernet connection (although I don't know if WiFi is offered).", "title": "A Lovely Stay", "user": "ksfreyja", "date": "May 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 159521304}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "The breakfast was delicious and was excellent, served at a time to suit you. Again the service was very good and the food was delicious.", "title": "Peace, Comfort, Beauty", "user": "wroena", "date": "April 30, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 159241965}, {"rating": 5.0, "title": "Fantastic", "text": "I can highly recommend Cathedral Cottage B+B, and if I'm in the area again, will hopefully stay again!", "helpfulness": 1, "user": "Damien S", "date": "April 14, 2013", "id": 157692150}, {"rating": 5.0, "title": "Starting the South Downs Way", "text": "A wonderfully quaint little private cottage in the back of the garden - a perfect place just minutes from the Winchester Cathedral, High Street and all the main areas of this charming city. I recently spent one night here and found the bed cozy and comfortable. The bath had a fine shower and heated towel rack and there was a selection of books, as well as makings for tea and a small refrigerator. My choice of the full English breakfast in the morning included eggs, bacon, sausage, beans, tomato, mushrooms, cereal, homemade toast & jam and plenty of tea. Very good! Christina is a warm & friendly hostess who made me feel very welcome . This is a gem and highly recommended. I loved Winchester and my stay in this delightful cottage!", "user": "suzanneb396", "date": "April 8, 2013", "id": 157048796}, {"rating": 5.0, "title": "A Home Away From Home", "text": "Should I have the opportunity to visit Winchester, England again, I'll be sure to book ahead and request the Garden Room Suite. Would love to spend more time exploring Winchester, but even more so, just to lose myself in a good book while relaxing in this quiet get-away of a lovely B&B. Thanks to our wonderful hosts for their hospitality and a fantastic breakfast.Just an unexpected treat - a home away from home! And the location couldn't have been more perfect. The whole experience was surreal!", "helpfulness": 2, "user": "DianaLynnW", "date": "March 18, 2013", "id": 155015852}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "This bed and breakfast was a dream come true! I came to England to visit many sights in London, but also was so fortunate to have been able to take a side trip to Chawton and then Winchester with some of my family. Our hosts were amazing! They accommodated our group and delighted us with wonderful information about Winchester giving helpful advice for transportation and eating locations. It was beautiful, perfectly clean, and so comfortable. Three of us stayed in the cottage through the quaint, lovely garden. It had modern conveniences such as WiFi, refrigerator, TV, etc, but was built and decorated with such style and excellent taste! It was the highlight of my whole trip to England and I am anxious to return! I wish I could have spent more time in Winchester! The full English breakfast was superb! Everything was homemade and so delicious. Christine was so fun to talk to and her family was very helpful and so kind! This B & B is perfect for any person or group! Loved it and can't wait to return!", "title": "Loved this beautiful, comfortable, cozy cottage B & B!!", "user": "Abbi J", "date": "March 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 154452975}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "Our trip started in London. Have been there before so no surprises. We wanted to plan a side trip to Chawton for the Jane Austen elements so started looking for overnight arrangements a few months ago. Came across the Cathedral Cottage B&B in Winchester, on Tripadvisor, which worked out perfectly because we thought spending a day in Winchester would be a neat way to see \"real England\". I emailed Christine, the owner, and I was surprised at how quickly she responded. She told me about the \"Cottage\" and it sounded absolutely perfect for what we needed. We couldn't wait to get there. When the others traveling with us were told of this side trip they were so excited about it that they wanted to come with us. I emailed Christine and she totally accomodated them with a room in her home. The Cottage was so charming, we loved it. And the room upstairs was really cute. Christine gave us a choice of a full English breakfast or continental. We chose the full English breakfast and was it ever good. Homemade bread, sausage, baked beans, eggs, mushrooms, the works. All in her sunny dinning room. The whole family was so nice, so informative, helped us in so many ways. Like I said, we have all been to London several times and we have all decided that the next time we come back to England, and we will, it will be to Winchester and Cathedral Cottage. We have made a friend here. And Winchester is as charming a town as you would ever want to see. This was definately the best part of the trip. If I had known it would be this good I would have planned several more days here than in London.", "title": "The BEST PART of the trip", "helpfulness": 1, "user": "Kara D", "date": "March 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 154384254}, {"rating": 4.0, "title": "One-off great B&B stay in Winchester", "text": "Stayed here last Friday night and had a great stay. Lovely novel detached room at the bottom of an old English garden. Safe, secure and comfortable. Warm and friendly host made breakfast from scratch with tasty bread made with flour from the old City Mill around the corner - yum.", "user": "brian b", "date": "March 12, 2013", "id": 154327739}, {"rating": 5.0, "title": "Sweet little B&B in Winchester", "text": "BB", "helpfulness": 1, "user": "Sue576", "date": "March 11, 2013", "id": 154287450}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled with family", "text": "I was visiting my granddaughter at Uni and I was fortunate enough to be able to book the garden room at Cathedral Cottage. It is like a hidaway cottage from a fairy tale and I was very happy and comfortable during my stay there. In fact I cannot praise this accommodation highly enough. Christine is a very interesting lady, charming, friendly and helpful hostess. The room was very warm and comfortable and the breakfast excellent. I was given a key which enabled me to come and go as I pleased and Christine's family were very welcoming. It's in a very central location and is just a short walk to the Cathedral and the city, so a really good starting point. I would definately recommend staying at this Bed&Breakfast.", "title": "Very happy grandmother", "helpfulness": 2, "user": "Moira C", "date": "March 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 154067145}, {"rating": 5.0, "stay_parameters": "Stayed March 2013", "text": "Good English food, Warm and confy atmosphere, pretty friendly cat, near to the high street and bus station!", "title": "Feeling like home!", "user": "Piyome", "date": "March 8, 2013", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 154055575}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled solo", "text": "From the train station take a taxi and the taxi driver would know the road name.", "title": "It's top for a reason.....lots of reasons in fact.", "helpfulness": 1, "user": "Family_of_four100", "date": "February 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 152291429}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "Had a wonderful time!", "title": "Great experience!", "helpfulness": 1, "user": "Diana H H", "date": "January 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 150446629}, {"rating": 5.0, "title": "Excellent location and very welcoming hosts", "text": "Great room, fantastic breakfast and wonderful hosts. Located centrally but in a very quiet area, Light, airy and private room at the end of the yard. Sorry to leave. Pub and convenience stores a very short walk.", "user": "Jenny O", "date": "January 9, 2013", "id": 149236467}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "variance": {"poor": 1, "average": 4, "very good": 17, "terrible": 0, "excellent": 85}, "aka": "Cathedral Cottage Hotel Winchester", "slim_ranking": 0.0612244897959, "description": "Cathedral Cottage Bed and Breakfast is located in the centre of historic Winchester. Within easy reach of great restaurants, pubs, local attractions, university, train station, bus station, shops and river walks."}