{"user_rating": 2.5, "review_count": 230, "name": "Cecil Hotel", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed September 2007, traveled solo", "text": "I was recommended by another hotel due to sold out. I was very surprised when I walked in. it is a honest hotel with honest priced rooms, bit old style but you can’t beat the price.", "title": "not bad", "helpfulness": 1, "user": "peter6Ca", "date": "October 31, 2007", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 4.0}, "id": 10483635, "likes": {"liked": "— price", "disliked": "— N/A"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled on business", "text": "I cant say enough about the Cecil Hotel. The rates are very affordable and for the price you get a super clean room, movie channels, maid service, the works. The staff was very friendly and was on hand to answer any questions I had. The room was cleaned daily and on time. The central location was perfect and just a short walk away from the subway. With the resent renovations that downtown has undergone, it is a safe, clean area and I cant wait for my next visit. I will be using the Cecil hotel every time I visit Los Angeles.", "title": "Fantastic!!!! great rooms, great prices and great people", "helpfulness": 2, "user": "samfireitness", "date": "January 9, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6570217, "likes": {"liked": "— Clean and the friendly staff"}}, {"rating": 1.0, "stay_parameters": "Stayed November 2006, traveled on business", "text": "This place is located in one of the worst parts of downtown LA. There's piles of trash on the street corners five feet tall. When returning to the hotel at night I was not happy to see several police officers with full body armor guarding the entrance to the the hotel. There's some sort of strange eatery on the corner that's open nearly 24x7 and thusly attracts a lot of strange people. There's no overnight parking in the area. The rooms were filthy, the plumbing is circa 1960s. My bedspread had cigarrette burns in it, my chair had a knife slash in it. The room smelled of fresh vomit when I arrived and it did not have AC. The bathroom towels had stains on them and the water coming out of the tap was brown. The doors have 4 locks on them and trust me you'll feel like you need them. I lost track of the number of drunks I saw, and at one point had to ride in the elevator with a woman who was obviously on drugs and had a stun gun that she kept clickin on and off at her side. Basically I do not recommend staying here unless you have no choice.", "title": "It's a bit scary", "helpfulness": 6, "user": "Gnobro", "date": "December 13, 2006", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "location": 1.0, "rooms": 1.0}, "id": 6437580, "likes": {"liked": "— avoid at all costs"}}, {"rating": 1.0, "title": "wake up call?", "text": "hotel cecil, granted it looks like an ok hotel it isnt...bathroom messy and our wake up call was a man bangin on our door trying to get inside our room...avoid", "helpfulness": 4, "user": "A TripAdvisor user", "date": "February 16, 2006", "id": 4465010}, {"rating": 4.0, "title": "clean and cheap hotel- highly recommended", "text": "I've stayed here before and must say the area has improved dramatically in the last year or so. This is a part of downtown LA that is being redeveloped. A luxury apt building just opened next door. The rooms are clean and cheap ($45/night)and this included movie channels also. If you're on a budget this is the place to go. The (new )subway is 3/4 blocks away and goes to Universal Studios and Hollywood. Ask about discounts for multi night stays.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "January 13, 2006", "id": 4351016}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "So if you're just in town for a day or two and don't want to pay an obscene amount for an average hotel, definitely stay here. Don't expect much, but for the price, it's unbeatable! They're revamping the place slowly, so make sure when you book, you ask for a new room. Though even if you don't, like we forgot, the room you'll get is clean as can be. Make sure you get a room with it's own full bathroom. It's an old hotel so there are some rooms that don't have a bathroom inside and then you have to share, which you DO NOT want to do. The hotel itself is well worth the price. Really the only thing we ran into as far as not impressed were the people that stay there. It's a variety, but you can tell that the local druggies do rent I'm sure by the week, they stick to themselves though and we didn't run into any problems. What's great, is that it's close to everything, train station, Staples Center, just easy to get to. But whatever you do, don't eat at the midnight food place next door, lol, it's a grease pit.", "title": "You get what you pay for, and a little more", "helpfulness": 3, "user": "davefan124", "date": "December 12, 2007", "detail_rating": {"cleanliness": 4.0, "front_desk": 4.0, "location": 5.0, "value": 4.0, "rooms": 4.0}, "id": 11507598, "likes": {"liked": "— Price", "disliked": "— locals"}}, {"rating": 2.0, "stay_parameters": "Stayed July 2005, traveled solo", "text": "I stayed at this place a number of times on my trips to LA. Everything was OK by me, I always got my favorite room. Never had a problem until one night there is a banging on my door late at night. I answered and a security guard pushed his way into my room saying he had a noise complaint. Standing outside my door he could have heard if there was any noise or not, but instead he chose to knock and push his way in. He looked in my TV cabinet and then even looked in my clothes closet, then just non-chalantly said \"go back to sleep\" and left my room. I got dressed and went over to a police precinct a short walk away and complained. The police came back to the hotel with me, one spoke to me, the other to the guard. The next day I went out in the morning for a short time and came back to find a metal plug in my room lock. When I went down and questioned why, they told me I had to leave because I called the police when the security guy was only doing his job. Looking back now, I guess I over-reacted by going to the police, but I couldn't understand why this particular guard did this, because the guards knew me well from coming and going for a few years previous to that visit. I was always on \"hello\" basis with all of them because I was in and out often on my trips and sometimes they didn't even bother to check my ID any more when I went in and out. I guess I'd stay there again if I had to because the price is unbeatable, but on my visits now I stay at similar place just up the street.", "title": "Was great for a while, but a problem", "helpfulness": 2, "user": "TorontoEricLA", "date": "November 22, 2007", "detail_rating": {"service": 2.0}, "id": 10987675, "likes": {"liked": "— cheap price and downtown location", "disliked": "— problem I had with security"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled on business", "text": "After attending a function downtown, my friend and I decided to make a night of it and book a room at the Cecil. Having some initial reservations about the area, I must say that I was absolutely surprised in the most pleasant way possible by this establishment. The lobby was amazing - immaculately clean, tasteful, well-lit, and very inviting. The staff was so courteous and helpful, a real treat these days. Our room was clean and cozy, and management was exceedingly gracious even when we accidentally slept in after checkout time. And all this for an unbelieveably affordable price. Definitely recommend this place for anyone staying downtown!", "title": "Awesome Deal at the Cecil!", "helpfulness": 4, "user": "smagnew", "date": "November 6, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 10650809, "likes": {"liked": "— Price", "disliked": "— No pool"}}, {"rating": 5.0, "title": "Nice Time at the Cecil", "text": "My friend had a birthday party downtown in the Historic Core. There are a bunch of new bars opening up in this part of downtown so to make a night of it, we decided to book some rooms at the Cecil Hotel. We were impressed with the hip look of the hotel, the staff was courteous and the rooms were clean. We had a great time and I would definitely consider staying again. The price was right and it was walking distance from the bar so you can't beat that.", "helpfulness": 3, "user": "snino", "date": "November 1, 2007", "id": 10504362}, {"rating": 3.0, "stay_parameters": "Stayed September 2007, traveled with friends", "text": "I was downtown for an event and didn't want to drive back to hollywood. I stumbled upon the Cecil and was blown away by the lobby. The price was great and the people at the front desk were very helpful. The rooms were older and needed some remodeling but for what i paid i wasn't about to complain. I recommend this place to people who are interested in saving a little cash and need a place to crash for the night.", "title": "Great Place for the Price", "helpfulness": 2, "user": "Kidrzg", "date": "October 31, 2007", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 3.0, "cleanliness": 3.0, "value": 4.0, "location": 2.0, "rooms": 3.0}, "id": 10483921, "likes": {"liked": "— The location was perfect for where i was and the services was good", "disliked": "— I was not able to hook up to the internet only in the lobby and was an inconvience"}}, {"rating": 3.0, "title": "Clean, friendly staff & good value", "text": "This was my second time here. Last year it took some getting used to the area, like New York, But this time I Noticed a big improvement, both on the streets and, inside the Hotel.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "September 3, 2005", "id": 3839623}, {"rating": 1.0, "title": "AVOID!", "text": "The bottom line, for me, is anyplace that is clean, with free movie channels, for under 50 bucks a nite, IS For me.", "helpfulness": 10, "user": "Anonymous006", "date": "January 31, 2005", "id": 3102279}, {"rating": 4.0, "title": "Best deal in downtown LA", "text": "The lobby looks \"decent\", but in the entrance there are guards looking after people who enter and get out because the street is SCARY.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "January 17, 2005", "id": 3013586}, {"rating": 1.0, "title": "want to get mugged?", "text": "The elevator smells horrible (well, the hallways upstairs too) And when I was standing near the entrance waiting for a cab to pick me up (and leave) a big guy entered with a HUGE fridge box. The ___ dropped it and it nearly fell over me, he could have killed me.", "helpfulness": 11, "user": "A TripAdvisor user", "date": "December 3, 2004", "id": 2862298}, {"rating": 1.0, "title": "The Worst Place In Crack Land", "text": "At night, it IS even more scary. DON'T GO HERE!!!!!!", "helpfulness": 13, "user": "celeeib", "date": "November 10, 2004", "id": 2817564}, {"rating": 1.0, "stay_parameters": "Stayed January 2008, traveled on business", "text": "I pull up to the hotel in my rental car where I'm greeted by a hotel employee. I ask if they have parking. He says no, but I can park the car in a metered spot while I check in. The meter is broken, I look around for no parking signs, there are none, so I figure I'm good. I enter the lobby which looks ok enough, except there's a homeless guy slurping on a coffee in what appears to be some sort of automat like area which opens onto the lobby. OK, I'm from NYC, so homeless guys aren't a big deal, but certainly starts to raise a red flag.", "title": "Do Not Stay Here Under Any Circumstance.", "helpfulness": 10, "user": "nycwestvillage", "date": "March 16, 2008", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 2.0, "value": 1.0, "location": 1.0, "rooms": 2.0}, "id": 14317301, "likes": {"liked": "— Nothing", "disliked": "— Location, druggies on the street, feeling that security could be an issue."}}, {"rating": 1.0, "stay_parameters": "Stayed February 2008, traveled solo", "text": "I get to the check-in and the receptionist tells me the hotel does not have parking. But I'm welcome to park the car in one of the two lots surrounded by torn up chain link fences either across the street, or beside the hotel I think it was either 5 to 10 dollars, but no in and out privileges. Sounds weird, but I ask her where I can get some money to pay for the parking. She tells me there's an atm in that deli/automat where I saw the homeless guy, but by the afternoon, the atm is usually out of money. So my best bet is a bank a few blocks away. I ask her if my car will be ok outside, since I'll have to take my baggage up to the room to then go to the atm. She says don't worry at all, your car will be fine out there for the rest of the night if you like.", "title": "Un Professional People Trying To Look Busy/Working", "helpfulness": 1, "user": "spacetimewalker", "date": "March 12, 2008", "detail_rating": {"front_desk": 2.0, "service": 1.0, "cleanliness": 2.0, "value": 1.0, "rooms": 2.0, "location": 3.0}, "id": 14248963, "likes": {"liked": "— It has cable tv", "disliked": "— the bed bugs"}}, {"rating": 2.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "So I take the elevator up to the room where I'm greeted by open doors on the hallways of shared bathrooms. They looked clean enough I suppose, but still, that's not what you want to be greeted with, multiple shared bathrooms--it really gave the feeling of a flophouse. I get to the room a door so flimsy it looks like it couldn't stop a light breeze from entering. The room was clean enough, but small with an en suite bathroom, the mattress was cheap and the room smelled like smoke. I guess this is one of the few hotels in LA that still has smoking...", "title": "good for the price", "helpfulness": 1, "user": "2steps-ahead", "date": "January 17, 2008", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 3.0, "cleanliness": 3.0, "value": 2.0, "location": 2.0, "rooms": 3.0}, "id": 12733545, "likes": {"liked": "— price", "disliked": "— small room, location"}}, {"rating": 2.0, "stay_parameters": "Stayed December 2007, traveled with family", "text": "Anyway, there's no internet in the room despite the claim that there was wifi in the hotel, so having work to do for most of the night and internet being crucial, I decide combined with the smell of smoke and the general overall creepiness of the hotel, I can't stay there. I talk to orbitz about the situation, and they say the manager refuses to let me out of the reservation and will charge me for a night, despite the pretty much false advertising this place has given. That's when somebody asks if I'm the person with the rental car out front. I say yes, and they say, we were trying to get in touch with you because it was getting towed. I say, you're joking right? Nope, my car was towed. After 2 employees told me it would be ok. So now they agree to refund me my first night as well, but at this point I'm a tow ($150) and a ticket ($75) in the hole. So the only thing this manager can say is I'm sorry, then he kinda just acts like people do when they aren't really sorry they try and make themselves scarce. Not \"how can we help make this up to you\" or \"what can we do to help,\" no, just \"I'm sorry about that.\" To his credit he did find the number of the towing company for me so I could find out how much I was now in the hole thanks to their incompetence. While I'm at the desk by the way, the strangest cast of characters who stay there, or wanted to stay there came up. One guy was trying to decide whether paying 3 bucks more a night for a TV in his room was worth it. Flophouse.", "title": "If you are Asian, you will find it aceptable", "helpfulness": 2, "user": "Thriftytreats", "date": "January 14, 2008", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 4.0}, "id": 12600308, "likes": {"liked": "— Value for money", "disliked": "— No F&B outlet"}}, {"rating": 1.0, "stay_parameters": "Stayed December 2007, traveled with friends", "text": "So after I regain my composure, I say you telling me you're \"sorry\" isn't enough. Don't you think the hotel should share some of the responsibility of having my car towed? His response was \"no, if it's money you're looking for you won't get it, we already refunded you for the first night.\" Which was a joke since they really should have anyway considering how they advertised themselves. Finally I tell him this report is going to go on Trip Advisor and that's when he immediately changes his tune. Then he says he'll talk to management as see if they'll agree. I say, look just pay for half and show you're sharing some responsibility in this, and I'll feel much less anger toward your establishment which I thought was totally fair.", "title": "Horrible experience", "helpfulness": 2, "user": "jujucharm", "date": "December 18, 2007", "detail_rating": {"cleanliness": 3.0, "front_desk": 3.0, "value": 1.0, "service": 3.0}, "id": 11654118, "likes": {"liked": "— the lobby", "disliked": "— everything else"}}], "location": {"country": "United States", "city": "Los Angeles"}, "stars": 2, "variance": {"poor": 32, "average": 55, "very good": 54, "terrible": 73, "excellent": 14}, "aka": "Cecil Hotel Los Angeles", "slim_ranking": 0.666666666667}