{"user_rating": 3.5, "review_count": 97, "name": "Cedars Resort", "reviews": [{"rating": 5.0, "title": "Wonderful Weekend", "text": "My husband and I were so delighted with our stay at the Cedar's Resort. Our room had the most fabulous view. The creek below was tranquil and soothing. Our in room massages were excellent. We will surely make this a yearly trip.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "June 17, 2005", "id": 3571434}, {"rating": 4.0, "stay_parameters": "Stayed October 2004", "text": "First let me say that the Cedars Resort is NOT a resort. If you know that outright, you will not be disappointed. It is a two story motel that has been there for decades and was renovated with new carpets, drapes, etc. It has a refrigerator, coffee pot and a meager continental breakfast. They could also use new shower heads. But the view from the balcony and the peacefulness as you sit out there over babbling Oak Creek, gazing at the red rocks and the various birds soaring about (I actually saw a bald eagle flying through the canyon for the first time in my life!) makes this a place you will want to remember forever and return to again. It is also within short walking distance to shops, galleries & restaurants.", "title": "Location, Location, Location!", "helpfulness": 13, "user": "cydona", "date": "November 7, 2004", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 3.0, "service": 3.0}, "id": 2811362}, {"rating": 1.0, "title": "Yuck!!!", "text": "It is mid way between old town Sedona and Tlaquepaque which also has wonderful shops, galleries and restaurants (Oak Creek Brewing Bar & Grille....my husband & I both had AMAZING meals...and he loved the microbrews..chardonnay for me..and did I mention the VIEW?) So even though there may be more elaborate accommodations elsewhere, unless you want to pay hundreds of dollars per night (Enchantment...an actual Resort...at least worth a vist just to see Boynton Canyon..Wow), I would say you can't beat the Cedars Resort. One more thing, unless you have difficulty getting up about 12 stairs, I would request a room on the second floor.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "April 15, 2004", "id": 1786755}, {"rating": 4.0, "title": "Excellent view and location", "text": "So chintzy! So tacky! A Super 8 at 3 times the price! Choose somewhere else!", "helpfulness": 2, "user": "A TripAdvisor user", "date": "January 4, 2004", "id": 1537093}, {"rating": 5.0, "title": "Everyhing We Needed", "text": "Conveniently located for shopping and exploring!", "helpfulness": 3, "user": "A TripAdvisor user", "date": "October 23, 2003", "id": 1419492}, {"rating": 1.0, "title": "Cockroaches!!!!", "text": "We recently got married in Sedona, and the resort we rented out for the weekend couldn't accomodate all of our guests. I reserved two rooms at Cedars for 2 couples. When I called to cancel one of the rooms, ten days before our trip, the jerk who made the reservation told me that if he knew these rooms where being held for unreliable wedding guests, he would have told me to make reservations somewhere else! All I could hear as he so called cancelled the reservation was his pathetic sighs every 10 seconds while mumbling under his breath. Then he told me that I should cancel everything and let the guests make their own reservations. I cannot tell you how rude this man was. This is the only man you will ever get to speak to if you have a problem here-supposedly \"there is no one else..no other phone number\"-no anything!!! The place is no better than a Motel 6, and they have terrible service. The icing on the cake is this; HE NEVER CANCELLED OUR RESEVATION-I got charged almost $300 on my credit card and lost the dispute because he never gave me a confirmation number.", "helpfulness": 2, "user": "terryben", "date": "September 11, 2006", "id": 5791322}, {"rating": 2.0, "title": "No resort here", "text": "When I called to speak with him just 5 days later-he didn't remember our conversation, or the comment I made about him being a cockroach the last time we spoke-he must get that a lot!!!", "helpfulness": 2, "user": "A TripAdvisor user", "date": "April 30, 2006", "id": 5022640}, {"rating": 1.0, "title": "Terrible Customer Service", "text": "My family and I stayed in the Cedars for our first trip to Sedona. Although Sedona is an absolutely beautiful place, I would not recommend this hotel to others for the following reasons: (1) you will not receive a senior citizens discount if you use a travel agent (per the front desk staff), (2) the front desk staff do not like tourists and made it known to some in our group, (3) they do not accomodate for children (no roll aways,etc) and are very stingy with extra sheets and pillows, (4) the cleaning staff did not thoroughly clean our room every day and, (5) they provide a very limited contiential breakfast (they only provide enough food for about 15 people and once the food is gone they do not replenish it).", "helpfulness": 3, "user": "A TripAdvisor user", "date": "April 5, 2006", "id": 4939845}, {"rating": 4.0, "stay_parameters": "Stayed March 2006", "text": "However, on a positive note, the location of the Cedars is good and the views of the area are very nice...of course I do not know of a site in Sedona were there would be bad views.", "title": "Great Value, awesome views", "helpfulness": 6, "user": "ciaolele", "date": "March 18, 2006", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 3.0, "service": 4.0}, "id": 4690567}, {"rating": 5.0, "title": "Awewome!!!", "text": "The manager of this motel (not resort) was so rude at check in we wanted to go to a real resort but they were all full at that time. It's a privately owned motel so talking to the owner would be pointless. I would not recommend staying at this motel. Not sure why they call it a resort when it has nothing a resort would have. Getting in and out of the parking lot is very difficult. Breakfast was ok! If this web site would let me put my personal phone number for anymore info you may need on this place I would.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "December 11, 2005", "id": 4232265}, {"rating": 3.0, "title": "Overpriced", "text": "Stayed here 13th - 16th October. Initiall booked double room @ $99 per night, however the room was small and the bed was not a double, more like a 3/4. Supposed to be wireless but unable to connect. Stayed in this room one night and requested another room. The only room available was one @ $150 per night that some one had checked out early. This room was of a good standard with wifi and a proper bed.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "October 27, 2005", "id": 4066643}, {"rating": 3.0, "stay_parameters": "Stayed October 2005", "text": "In conclusion the location is good with good views of the redrocks provided you get the dearer rooms, but they are not good value.", "title": "Average room, above average price.", "helpfulness": 2, "user": "desertdog999998", "date": "October 24, 2005", "detail_rating": {"cleanliness": 4.0, "value": 1.0, "rooms": 3.0, "service": 3.0}, "id": 4049470}, {"rating": 4.0, "title": "Best Red Rock View", "text": "Hotel was okay, just okay, not a resort. You could hear the creek, and if you dared to climb down 77 uneven steps made of railroad ties you would find a nice little sitting area under the trees along the creek. The clerk advised us not to try this at night, and this is good advice. The room was average size, average amenities (tv, tub, 2 chairs, phone, etc), average, average, average. However, just like everything else in Sedona, the price was above average. Overall, a nice, decent, average place that, while convenient was not a good value. Also, beware that you don't get one of the rooms facing the very, very busy highway, other guests complained of the traffic noise.", "helpfulness": 6, "user": "ChrisBrennan", "date": "September 14, 2005", "id": 3903329}, {"rating": 5.0, "title": "Relaxing and comforable", "text": "From the minute we entered our room and saw the view from the balcony I knew we had picked the best hotel in town! Our 2nd floor room had a king bed and was very spacious and clean, with lovely soft bathrobes. The balcony practically hangs over Oak Creek no parking lots here, and the view from the large patio window is breathtaking! We looked at other hotels but decided we had found the best. The pool also overlooked the red rocks and was such a peaceful setting. The front desk staff were friendly and helpful. The location is great a very short walk up a gentle hill to the shops. There aren't a lot of amenities at the hotel, it's not a 'resort' at all and the continental breakfast is pretty basic, but we defy anyone to find a better location or view for the money. I long for the day we can return to Sedona and will definately book in Cedars Resort! Enjoy!", "helpfulness": 9, "user": "A TripAdvisor user", "date": "July 13, 2005", "id": 3664131}, {"rating": 4.0, "stay_parameters": "Stayed June 2005", "text": "Very relaxing, great views with the sound of the creek and the location, is the best, close to the finest restaurants, shops, and galleries, all just across the street. Yet, it is secluded. At the creek, you hear nothing but the water and sounds of nature. This place is very unique.", "title": "Great view, location and price", "helpfulness": 13, "user": "793Traveler1414", "date": "June 28, 2005", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 3616670}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled solo", "text": "Small hotel right on the \"Y\" in Sedona. Right in the middle of town walking distance to many great places and an easy drive everywhere else. Parking is sufficient and convenient, room is clean, warm, spacious and has a nice balcony. From my balcony (queen bed, lower rate) I could mostly see the back parking lot and second building, but to the southwest I had a great view of the red rocks.", "title": "HIghly Recommended -- Terrific Location, Price and very nice room!", "helpfulness": 3, "user": "MyWorldatPeace", "date": "April 3, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7278608, "likes": {"liked": "— Location"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "I would have extended my stay at this hotel, but they were booked up. Convenient use of internet in lobby and friendly staff made this a terrific place to stay.", "title": "Best Location", "user": "abayonet", "date": "March 17, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7179867, "likes": {"liked": "— Everything", "disliked": "— Nothing"}}, {"rating": 2.0, "title": "Not what it appears to be", "text": "What a great place to stay in Sedona. Right up town. Close to everything. Great views from the balcony and only the sound of Oak Creek below your feet.. I'll be back.", "helpfulness": 3, "user": "Aleccanonbie", "date": "February 9, 2007", "id": 6775523}, {"rating": 4.0, "title": "Not really a resort, but nice, clean, great views from the balcony", "text": "The reception was not \"customer friendly\" to begin with. The rooms are hardly resort classification. The rooms are very small and the traffic noise is very bad.I spent two nights at the Grand Canyon Best Western for less money prior to Sedona and there is no comparison. $89/night versus the $99 at Cedars. Now...as for the breakfast!!!! ...It is a disgrace to be called even a continental breakfast... Traveller beware!!!!", "helpfulness": 4, "user": "tennisjoanie", "date": "October 12, 2006", "id": 5947096}, {"rating": 2.0, "stay_parameters": "Stayed October 2005, traveled as a couple", "text": "Room was not large, but adequate. Very clean; nice balcony which overlooked the red rocks and Oak Creek; you could walk down the stairs and walk along the creek. Nice pool; nice heated spa. Continental breakfast included danish, bagels, etc. Great Italian restaurant, the Hideaway, just down the street, very reasonably priced, excellent pizza. Had an accoustical guitar player, outside balcony overlooks Oak Creek.", "title": "Really just a motel with beautiful views", "helpfulness": 3, "user": "sunnydac", "date": "September 13, 2006", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 1.0, "value": 2.0, "rooms": 1.0, "location": 4.0}, "id": 5797854, "likes": {"liked": "— Location"}}], "location": {"country": "United States", "city": "Sedona"}, "stars": 2, "variance": {"poor": 9, "average": 11, "very good": 34, "terrible": 16, "excellent": 27}, "aka": "Cedars Hotel", "slim_ranking": 0.866666666667}