{"user_rating": 4.0, "review_count": 283, "name": "Celeste Apartments", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed April 2008, traveled with family", "text": "Stayed in the Celeste Apartments in Costa Teguise in April, for 1 week, I must say that they are basic but clean and central, we stayed in a 1 bed apartment, which had a small kitchen area, seperate bedroom, and little loung area, balcony to front and off the bedroom a large sun balcony with loungers! the pool was small but you can use any pool in the three buildings, it is a 5 min walk to the beach, and in the centre of town, lanzarote is a nice island and would recommend hiring a car and getting out and about yourself, the fire mountains are worth a look as is playa blanca marina, everywhere is catering for the english so do not expect it to feel very foreign! but nice for some winter sun.", "title": "better than expected", "helpfulness": 1, "user": "SussexSmiths", "date": "May 18, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 16174038, "likes": {"liked": "— convenience", "disliked": "— basic"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "Celeste apartments were great, went with my boyfriend for a weeks break. We were worried by reviews saying they are a bit \"basic\" but we had a great apartment which was much better than you'd expect for the price! Really attractive white sugarcube buildings with green shutters and the costa teguise area isn't overdeveloped - there are some high rise complexes further down the coast but the area we were staying in was really nice! Really is a 2 minute walk (at most) to the beach which is clean and white and lovely! Costa teguise wasn't too \"britified\" although there are the standard ex pat cafes offering full english breakfast... we had a fantastic week and would definitely stay at celeste again!", "title": "celeste is great!", "helpfulness": 2, "user": "nandydashford", "date": "May 13, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 15983420, "likes": {"liked": "— Really attractive gated complex with trees and flowers growing outside the window", "disliked": "— no double bed"}}, {"rating": 4.0, "title": "Basic but clean", "text": "Overall all our stay was very enjoyable,the apartments were bacic but clean, what was very good was the security aspect of the apartments with them being gated so guests had there own keys to get in and out, when we stayed last week in feb the weather was quite changable so the pool was never going to be warm, the rooms were clean but the beds were hard and not very comfy, so sadly this meant having to have a drink or two to drop off to sleep! Talking of drinks best place was Christos (happy hour 7-10 big measures on shorts and cheap) also Bluebells on the same square only 1.5 Euros a pint all day long,Nice chill out bar with sofas was Orient Express also on same square happy hours San Miquil 1.5 Euros,Best place for breakfast by far was the Highlander huge plateful for only 3.0 Euros not bad for Karoke on a night time if you like that sort of thing. This was our first time to Lanzatote and would recommend hiring a car for 2-3 days to tour all of island,we found best deal with Direct Car Hire 45 Euros for 2 days (cheaper the longer you hire for)this included fully comp insurence others dont qoute this so what looks a good deal in the window soon adds up once inside.Food - best for us and most other people judging by popularity of restuarant was El Patio not the cheapest but was very good food and service, on the same square as the bars (square with bandstand in middle and market on fridays)", "helpfulness": 4, "user": "simonandlauraBristol", "date": "February 29, 2008", "id": 13931516}, {"rating": 3.0, "stay_parameters": "Stayed January 2008, traveled with family", "text": "We booked to stay in the Celeste Apts two days before we travelled, at the end of January.", "title": "Cheap price - great location", "helpfulness": 3, "user": "CathP", "date": "February 25, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 3.0, "value": 4.0, "rooms": 2.0, "location": 5.0}, "id": 13836748, "likes": {"liked": "— Location", "disliked": "— Dated apartment"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2008, traveled with friends", "text": "We just wanted some winter sun, and a nice break.", "title": "Pleasant and good location", "helpfulness": 6, "user": "Gladioli", "date": "January 31, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 4.0}, "id": 13140867}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "Mary Burke Kildare Ireland We stayed at the Celeste in Aug 2007. This was our 4th year in Costa Teguise and our 1st at the Celeste.We had our 3 daughters and 6month old granddaughter with us.Apartments were well looked after also hot water that we never had after 9a.m in other apartments we stayed in.Security was a major factor for us with the children but locked gates meant only guests staying had keys to get in.", "title": "Loved the Celeste GRRREat security", "helpfulness": 7, "user": "mollburke", "date": "January 30, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 13131273, "likes": {"liked": "— Security", "disliked": "— Hard Beds Sorry!"}}, {"rating": 3.0, "stay_parameters": "Stayed December 2007, traveled with family", "text": "We love Lanzarote and Costa Teguise we are coming back in Aug 2008 again.Weather excellent,Black Bull pub next to complex fantastic.", "title": "Julie & paddy", "helpfulness": 6, "user": "vonny41", "date": "January 5, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "location": 5.0, "rooms": 3.0}, "id": 12348669, "likes": {"liked": "— Price", "disliked": "— no pool bar"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled with family", "text": "Stayed in Celeste over xmas. Agree with a lot of comments basic but clean, had no problems with reception or security. Never used pool too cold but went to beach every day which was a 5 min walk away. I must highly recommend the Highlander bar which is 2 mins up road from apartments they really made you welcome. You get what you paid for in these apartments, i would deffo go back.", "title": "Basic but good value for money ...", "helpfulness": 5, "user": "HappyHartlepudlians", "date": "January 1, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "business": 5.0, "cleanliness": 5.0, "rooms": 3.0, "location": 5.0}, "id": 12216555, "likes": {"liked": "— Security", "disliked": "— Needed a higher maintenance spec"}}, {"rating": 3.0, "stay_parameters": "Stayed August 2005, traveled with family", "text": "Stayed at the Celeste Apartments between 23 - 30 December 2007. Like many other reviewers, we agree with the consensus that these apartments are basic but are functional and clean. We had a one bedroom apartment in the first block (room 119) and this slightly smaller blocks to the other 2, proved to be peaceful and quiet. There was no fighting over sunbeds and the few other holidaymakes in our block were very pleasant.", "title": "good area but basic", "helpfulness": 2, "user": "colin-2k8", "date": "December 21, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 1.0}, "id": 11884365, "likes": {"liked": "— area", "disliked": "— noisy"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled with family", "text": "Rooms: + - spacious, clean and had working microwave, toaster and 2 ring electric cooker. Even had teatowel, washing up liquid and dishcloth on arrival! Apartment had nice patio area, drying facilities and table and chairs for relaxing. Maid service 5 times in the week that we were there - with clean towels provided each time. Security excellent - locked outer gates gave peace of mind (probably just a UK phobia!!). Staff very very helpful and friendly.", "title": "bar breaks", "helpfulness": 3, "user": "grumpyBlackpool", "date": "December 20, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 11707939, "likes": {"liked": "— roof terrace and privacy", "disliked": "— the spanish bar below very untill 3am in the morning"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled with family", "text": "We arrived to met at reception by a friendly receptionist and check in was swift and we were in our room in no time. We dropped our bags off and headed striaght to the Highlander Scottish bar for a warm welcome and a refreshing drink!!!", "title": "Brilliant, clean apartments", "helpfulness": 4, "user": "Nicobobo", "date": "December 18, 2007", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 3.0, "location": 5.0}, "id": 11657023, "likes": {"liked": "— The location and cleanliness", "disliked": "— The pools were freezing!!!"}}], "location": {"country": "Spain", "continent": "Europe"}, "stars": 3, "variance": {"poor": 18, "average": 46, "very good": 148, "terrible": 8, "excellent": 63}, "aka": "Celeste Apartments Hotel", "slim_ranking": 0.45}