{"user_rating": 4.0, "review_count": 1680, "name": "Celtic Manor Resort", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed September 2013", "text": "When visiting back at Easter my partner won a free round of golf so we decided to come back to enable him to make use of it.", "title": "3rd visit in 18 months and still loving it", "user": "Sally67H", "date": "September 23, 2013", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 178248210}, {"rating": 3.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "this time I had the added bonus of being joined by 2 friends and making a girlie Spa weekend break of it too which has been fantastic, the hot stone massage with Chloe at the Ocius was lovely as was my Elemis facial the following morning .", "title": "OK ... BUT. You have to pay for parking", "user": "Violet V", "date": "September 22, 2013", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 178198920}, {"rating": 1.0, "stay_parameters": "Stayed September 2013, traveled with family", "text": "We had an amazing meal at The Lodge where the staff provided chocolates and candles as both friends were celebrating birthdays for me and didn't charge me for it, followed by lunch down at Rafters the following day whilst my partner played golf.", "title": "Very poor customer service", "helpfulness": 3, "user": "Saffa I", "date": "September 22, 2013", "detail_rating": {"service": 1.0}, "id": 178106285}, {"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "The room was lovely with a king sized bed I'd love to take home with me it was so comfy", "title": "Anniversary stay", "helpfulness": 1, "user": "Debbie W", "date": "September 21, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 178043939}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "At great time was had by all and the girls are already asking me about another return trip, maybe even for New Year !!", "title": "Very enjoyable visit", "helpfulness": 1, "user": "Juliet D", "date": "September 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 177753184}, {"rating": 3.0, "title": "Rooms need updating", "text": "This was our third stay at the Celtic manor. The doorman remembered my surname from he week before ! Impressive .", "helpfulness": 1, "user": "neilmaxbartholomew", "date": "September 18, 2013", "id": 177698586}, {"rating": 3.0, "stay_parameters": "Stayed September 2013", "text": "The hotel packages are good value .sadly the rooms are very dated .the bed although big affords no luxury or comfort The pillows are shabby .", "title": "Relaxing experience but missing the 5 star standards!", "user": "SallyP260772", "date": "September 18, 2013", "detail_rating": {"cleanliness": 4.0, "location": 5.0}, "id": 177661611}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "We had supper in the newbridge on usk. We were taken and picked up again by the hotel transport .the pub is about 15 mins away and well worth he trip.", "title": "A most enjoyable stay", "helpfulness": 1, "user": "bigtrippertoo", "date": "September 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 177644228}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "Excellent staff and good service .food very good indeed.good wine choice", "title": "looks much better from the inside", "user": "valdareeWestWales", "date": "September 17, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 177564060}, {"rating": 3.0, "stay_parameters": "Stayed September 2013, traveled with friends", "text": "Have just returned from a spa day and afternoon tea. Lovely venue, great forum spa, loved the pool area(helped that quiet so had the freedom to swim at leisure), sauna and steam room good. Yet on reflection a few niggles: jacuzzi not working, were told we had to fully change back into our clothes to take our afternoon tea, yet on arrival in club lounge other guests still relaxing in their robes and slippers which we would have preferred to do! On arrival at club lounge we found it to be locked so had to hover till a member of the team appeared. No atmosphere in lounge, a little back ground music would have gone along way! A delay on the service of the sandwiches. Not quite the right balance between savoury and sweet. When scones came they were cold and dry and we had to ask for cutlery to cut. Long wait for prosecco too. Service in lounge was a little soulless! Never asked if required further tea/coffee, no interaction at all.", "title": "Wont be staying again", "helpfulness": 2, "user": "Ray R", "date": "September 17, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 2.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 177563186}, {"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "Stayed here on a Sunday rollover dinner, bed and breakfast package to celebrate our first wedding anniversary. We arrived early to use the spa facilities. We used the pool, Jacuzzi and sauna together but there is also separate Jacuzzi, plunge pool, sauna and steam room in the male and female changing rooms. My husband said it was a shame that none of the showers or the plunge pool in the male changing rooms were working at the time. We had lunch in the Forum spa café which I was enjoying until I spotted a live caterpillar in my side salad. The manager was brilliant and couldn’t apologise enough and gave us a full refund and replacement food but still not what you expect from a 5* resort. When we checked into our room we received a lovely note and some Belgium chocolates from the hotel for our anniversary which I thought was a lovely touch and unexpected. The room was very nice although we paid extra for a room upgrade with king-size bed but was actually 2 (large) beds zipped together which we thought was a bit odd. Stayed at the CM before in a regular room and didn’t see a vast amount of difference for the price. The best thing about our stay was the amazing meal at the Terry M restaurant. The waiters were very attentive and the food the best we have eating for a long time. Breakfast buffet was also lovely so much food to choose from. If you go at peak time (we went at 9.45am) be prepared to queue to get seated!", "title": "Anniversary stay", "user": "ClaireandStu", "date": "September 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 178711815}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "Although I have mentioned some negative issues overall the experience was really good and we would definitely return and also dine again at the Terry M restaurant.", "title": "Brilliant Terry M restaurant", "helpfulness": 1, "user": "LoubyLouWales", "date": "September 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 178694784}, {"rating": 3.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "We stayed in a deluxe room recently for a birthday treat and booked in advance for the Terry M restauarant and we were so glad that we did. The staff, sommelier and waiters were exceptional, knowledgeable, polite and proffessional, this together with the superb taster menu that tickled every taste bud that we had made this a really memorable evening , one that we will be looking to repeat. It was lovely to be in a 3 roisette restaurant that wasn't stuffy and made you feel comfortable, the sommellier was great at recommending a good wIne that suited us both ( and that wasn't easy with our different tastes ) Not cheap , but worth every penny !", "title": "Smart interior, service OK but, noisy neighbours", "helpfulness": 1, "user": "Laura I", "date": "September 24, 2013", "detail_rating": {"service": 2.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 178390254}, {"rating": 3.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "Stayed here as a couple in August, gifted to us. There was some confusion over payment of the room, which was uncomfortable, but I was impressed by the decor and the ambience of the hotel. Room was fairly spacious and well stocked with tea/coffee etc, but the interconnecting room was a problem. We couldn't enjoy a quiet drink in our room at 10:30pm due to kids next door screaming and running around, which could be clearly heard through the connecting door.", "title": "Great facilities, just not the bed", "user": "MickMin", "date": "September 23, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 1.0, "rooms": 3.0, "location": 3.0}, "id": 178326174}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled with friends", "text": "We ate at the Lodge where the food was delicious, but service appalling. The staff clearly thought we didn't need a drink as it took them half an hour to ask us, and then trying to get another was nigh on impossible. Shame really because the wine was good, and I would have liked to stay there a bit longer. But the fact that they tried to overcharge us? maybe not.", "title": "Perfect for your girly break.", "user": "JJ_Dragon", "date": "September 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 178263078}, {"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "When you're paying for a luxury 4 or 5 star experience then I think that little details make a big difference and often hotels seem to forget this. Overall this is a nice place to stay and there is no denying it has great facilities.", "title": "Little things go a long way", "user": "JMuk", "date": "September 30, 2013", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 179166717}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "Our basic room was comfortable, had everything we needed and a great view. Comfy beds, robes, tea and coffee (no cafetiere or fresh milk but I am in the habit of taking my own). The Elemis in room products are only the basic shower gel and body lotion. Great service at reception and in the bar. Cheese sandwich and chips delivered to my door at 1am were delicious but should have been for the price!", "title": "Will be back again", "user": "iantoes", "date": "September 30, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 179158157}, {"rating": 3.0, "stay_parameters": "Stayed September 2013, traveled with family", "text": "But", "title": "Afternoon Tea", "user": "ann n", "date": "September 29, 2013", "detail_rating": {"value": 3.0, "service": 2.0}, "id": 179062540}, {"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled with friends", "text": "1) Pay parking.. expensive too.", "title": "Got it so wrong first time they invited us back again", "helpfulness": 1, "user": "ExplorerIIYorkshire", "date": "September 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 2.0, "location": 5.0}, "id": 178968196}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with friends", "text": "2) The Forum Spa area needs a bit of attention. On the day we visited both steam rooms were out of action. There is no steam room poolside so if you're visiting as a male/female couple you can't both go in the steam room together. No water machines pool side and on the day we visited the machine was out of order in the changing room as well. Lack of care and attention to the changing area too. Rubbish on the floor, towels and robes everywhere. The photos on the web site make the area seem much bigger than it is too. So it felt quite busy and crowded.", "title": "An excellent experience which I should like to repeat", "user": "Jenifer R R", "date": "September 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 178828897}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "stars": 5, "variance": {"poor": 143, "average": 274, "very good": 456, "terrible": 109, "excellent": 698}, "aka": "Celtic Manor Hotel Newport", "slim_ranking": 0.105263157895, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.5, "rooms": 4.0, "location": 4.0}, "description": "Host of the 2010 Ryder Cup golfing competition, this award-winning resort is set in 2000 acres of parkland in the Usk Valley. It comprises a 5-star hotel and a historic 19th-century manor house. There is the award-winning Forum Spa, as well as 6 restaurants and 3 championship golf courses. There are 2 adventure golf courses and the treetop adventure course Forest Jump. Clay pigeon shooting, fishing and mountain biking can all be arranged. The Celtic Manor Resort features a range of facilities to ensure the success of guests’ business events and special occasions. These include a comprehensive convention centre and exhibition hall, 31 function rooms and 6 restaurants. Rooms all have a TV with satellite channels, and there is a 24-hour front desk. Free Wi-Fi is available in public areas, and there is space for free private parking on site."}