{"user_rating": 4.5, "review_count": 157, "name": "Centennial Hotel", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed June 2008, traveled with friends", "text": "In choosing where to stay in Concord, I decided to pay the extra bit for this place which seemed to be quite popular amongst reviewers. I had high hopes to indulge myself and my traveling companion in a bit of luxury during our trip. Upon arriving, all seemed well. The place is clean, rather modern (too bad since the old architecture could have added character) and the night desk person was friendly.", "title": "Overrated", "helpfulness": 1, "user": "domotofu", "date": "November 4, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 1.0, "cleanliness": 3.0, "value": 2.0, "location": 5.0, "rooms": 4.0}, "id": 21550303, "likes": {"liked": "— Convenient location, quiet", "disliked": "— Cleaning service, price"}}, {"rating": 3.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "In the room, all was tidy and a robe was laid out on the bed with a plate of cookies as a welcoming hello. The bathroom was clean and modern but the water pressure was terrible! It was the most difficult showering I've ever taken as the water practically trickled out. The shower head had various options including a pulsing massage, but forget that. I was lucky to get the soap off.", "title": "Decent place, rude staff.", "helpfulness": 1, "user": "lauren1214", "date": "October 20, 2008", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 5.0}, "id": 21025690, "likes": {"liked": "— Location", "disliked": "— Staff"}}, {"rating": 1.0, "stay_parameters": "Stayed October 2008, traveled with family", "text": "While the bed is pretty comfy, the pillows were not for me. For those who love firm and high pillows, you'll love them. Neither me nor my companion slept well because the pillows were too uncomfortable. I tried not using the pillows at all, but something just wasn't right, and I slept poorly. The next morning I asked if they had any other types of pillows but not surprisingly, it was a no. Well, I've been to some places who have two types of pillows, one thinner, one thicker on the bed so I had to try and ask.", "title": "Horrible - Do Not Stay Here!", "helpfulness": 4, "user": "laineeb", "date": "October 14, 2008", "detail_rating": {"front_desk": 1.0, "business": 4.0, "service": 2.0, "cleanliness": 3.0, "value": 3.0, "location": 3.0, "rooms": 2.0}, "id": 20887232, "likes": {"liked": "— the Food Was OK", "disliked": "— Everything else"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "Anyhow, we had breakfast in the restaurant which was decent but a smidge overpriced for what we got. The waitress was nice but the kitchen is slow. We ended up being late for our scheduled morning event.", "title": "Wonderful small hotel", "user": "Haylow", "date": "September 5, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 3.0, "rooms": 5.0}, "id": 19788094, "likes": {"liked": "— Comfortable bed"}}, {"rating": 5.0, "title": "what a pleasant surprise!", "text": "The next night, my impression of the place plummeted. Returning after a long day, we found that the cleaning service never arrived to do their job in our room. We didn't request to be skipped either. According to the front desk, they have issues with their cleaning folks. Great. I shouldn't have been surprised as I found a very dead bug (as in long dead) on one of the pillows I didn't use. Yuck!! I also came to realize that they never bothered to replace the burned out bulb on one of the two lamps on the desk. I thought they'd just turned on one lamp when I'd arrived the previous night. No, they just can't be bothered to do their job. The front desk did apologize about the cleaning staff and gave me a $10 credit.", "user": "celebrationkim", "date": "July 23, 2008", "id": 18175237}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled on business", "text": "I recently stayed here never having been to NH before. I travel extensively for work and was unbelievably surprised at finding this beautiful space and restaurant. I was there for a week and ended up eating almost all my meals in the Granite restuarant. I honestly can't say enough about the rooms, the comfort, the variety of menu and the attention to detail the staff payed to their guests. If you are ever fortunate to be in this area, it is without a doubt one of the best places I've stayed and is worth it.", "title": "Oustanding service at a gem hotel", "helpfulness": 2, "user": "Alex33373", "date": "August 9, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 37167812}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled with family", "text": "The Centennial is a very nice hotel. Our room was on the 3rd floor and we were very pleased. The beds were comfortable and the room was clean. The bathroom was extraordinary for a hotel in this price range. It was large, with a raised sink and a beautiful glass enclosed shower. We did not eat at the hotel restaurant, although their menu was terrific and it looked very nice. We would definitely stay here again.", "title": "Very Nice Stay", "user": "fbce11", "date": "August 5, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 3.0, "rooms": 5.0}, "id": 36852471}, {"rating": 5.0, "title": "Exceptional hotel.", "text": "The only negative, if you can call it a negative, was the front desk staff was average at best. Again, not a bad experience, but not the greeting you get at many hotels. They were efficient and we had no issues at all, however, a tad more friendly would have been nice.", "helpfulness": 1, "user": "MadSkiers", "date": "June 14, 2009", "id": 32329319}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "My wife and I had an unexpected opportunity to get away for an evening (and sleep in), so we found and booked a room at the Centennial Inn for a very reasonable rate. We had previously dined at Granite, the fantastic restaurant that is located in the Centennial, and that made our selection much easier. This is one of the finest boutique hotels we have experienced, at any price in any location. Our room was very comfortable, and the things we really care about (bed, linens, bathroom, towels, etc. - who really cares about the drapes?) were first rate. Our room was huge, and well equipped for both business and leisure travel, with a ceiling fan that was exceptionally quiet. The bathroom was well appointed in a funky, post-modern style with tumbled marble tile, a granite vanity top and free-standing basin sink with a slick faucet mechanism. There was a nifty cutout in the glass shower enclosure for the shower controls so you could turn on the water without getting splashed. Our room was located near the top of the stairs from the hotel lobby and restaurant, and we were initially concerned that it might be noisy, but found that it was extremely quiet. We would highly recommend this hotel to anyone visiting the area for business or pleasure, particularly if innovative New American dining is on the priority list - Granite is easily one of the best restaurants in New Hampshire, and a great reason to choose the Centennial Inn. The location is convenient, and close to downtown, but far enough off Main Street that it's quieter than some of the chain hotel options in the area.", "title": "A bargain when it first opened after remodelling.", "user": "joseph62", "date": "May 30, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 31159662}, {"rating": 4.0, "stay_parameters": "Stayed October 2008", "text": "My wife and I stayed here for two nights during July 2007......the rate then was $109 for an attractive, clean, spacious, comfortable, modern room in a renovated old building. We were very pleased. We didn't dine in the restaurant and wished we had.", "title": "Don't be put off; its good", "user": "Riseholm", "date": "November 13, 2008", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 3.0}, "id": 21811595, "likes": {"liked": "— A well appointed, large and attractively decorated room", "disliked": "— The dowdy exterior"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "My husband and I stayed at the Centennial Inn during Fall Foliage season on our way towards Boston Logan from Vermont. The Inn is really a boutique hotel and is a gem to the downtown area of Concord (situated directly across from the Governor's Offices). The staff, especially Dave at the front desk, is warm and friendly. We were on a self guided New England Colors of Fall bike tour and Dave gave us excellent information on local ride routes and trails. He printed maps and checked into bike accessability for us.", "title": "Simply Fabulous! Don't stay ANYWHERE else if you are in the area!", "user": "SCG1234", "date": "October 15, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 46966663}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "We had a wonderful dinner at Granite (restaurant on site). Imaginative and tempting dishes made it difficult to choose our appetizers, first course, entree and desserts. Everything we had was really outstanding - very fresh and delicious. They serve local and seasonal beers and have their own cocktail menu specials. I had the antioxidizer which was muddled blueberries and raspberries, pomegranite syrup and Bombay Sapphire gin. DELICIOUS!! The only draw backs were one of the two servers was snotty verging on rude and the long wait for our entrees. The second server assigned to us was great and seemed to try and make up for his counter parts lack of desire for a decent tip. Dinner with tax and tip came to $100 and included an appetizer, a salad, a soup, a beer, my antioxidizer (yummy!) 2 entrees and a dessert. Being from Orange County, CA, this seemed very reasonable to us.", "title": "Good hotel and restaurant", "user": "GDB1", "date": "October 4, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 5.0}, "id": 45799869}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "The room (Superior King) and bathroom were spotless and newly renovated. The room was modern, but comfortable and included WiFi and large plasma TV, wood shutters and a small lounge area for reading or relaxing. The king size bed was very comfortable and included a down comforter if we desired it. The large bathroom has tumbled marble flooring and shower and granite counter under a raised bowl type sink. Every bath amenity was provided (qtips, cotton balls, make up remover cloths, shampoo, conditioner, soaps, lotion, shower gel, hair dyer, deluxe bath sheets). The shower is very large and glass enclosed.", "title": "Nice, comfortable, little inn", "helpfulness": 2, "user": "gillda", "date": "August 23, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 38590959}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "We requested a late check out which staff accommodated graciously and without charge. We were charged a total of $147 for the room which included all fees and taxes. Having stayed at many higher end hotels I would have guessed the room rate to be at least double what we paid.", "title": "Highly Recommended", "helpfulness": 1, "user": "WashDCFlyer", "date": "August 14, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 37626097}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "While you are in town check out White Mountain Coffee just down Pleasant St. GREAT coffee and pastries (Twice as good as Starbuck's or Pete's) and the owner is on hand to make sure you are happy with your order.", "title": "A shining, modern gem that is an instant surprise", "helpfulness": 2, "user": "piesie23", "date": "August 11, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 37428160}, {"rating": 3.0, "stay_parameters": "Stayed March 2010, traveled with friends", "text": "Stayed in room 304 for one night. Spacious room w/two double beds, large closet, plenty of workspace, flat screen TV, pullout sofa. Good-sized bathroom with good products, comfy towels/robes and good shower. No natural light in bathroom, very little natural light in the room. No coffeemaker. Hotel could use some signage in its parking area to direct visitors to reception - there are no signs indicating where to check in - not even on the front door. Front desk staff able and courteous. Had a lovely meal at the restaurant, good food, terrific service (only mini gripe: not many vegetarian options and meats aren't local or organic). Surrounding area isn't much to look at but feels safe enough. The little downtown area is several blocks from hotel. Room service overpriced ($20 for a pot of coffee and a granola/yogurt parfait) and delivery guy was curt and cranky. No charge for parking. Overall a good bet.", "title": "good room, great restaurant, nice front desk staff", "user": "MaineIzzy", "date": "March 2, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 57544382}, {"rating": 2.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "Just returned home after a weekend stay at the Centennial Inn. Contrary to their website, the beds are NOT pillowtop and are quite hard. There is not in-room coffee/tea maker which is surprising as this has become industry standard. You may get free coffee at the reception desks during the morning only. They promised a free newspaper delivered to the room. No. You must pick up a newspaper at the reception desk. Turn down service happened the first two nights with a nice snack . . . but you better eat it before they clean your room the next day, otherwise it disappears. The third day, NO TURN SERVICE. I guess they are not use to people staying more than two nights. There were four hangers and not enough drawer space. The people manning the reception desk range from somewhat friendly to not friendly at all. They boast large towels, nope, they are standard size. And, there are no bathtubs. Showers only. If you look at their website, you'll see 3 photos of the bathroom sink. Unless you can fit in that, you are taking a shower. The exercize room does NOT have the flat screen TV or any TV. Overall impression is that the hotel owner never stayed at another hotel that actually offers the amenities they claim to provide. Overall recoommendation, the nearby chain hotels charge 1/2 the price with in room coffee makers and more comfortable beds.", "title": "False Advertising", "user": "ammie401", "date": "November 30, 2009", "detail_rating": {"cleanliness": 5.0, "value": 1.0, "location": 5.0, "service": 1.0, "rooms": 1.0}, "id": 50332901}, {"rating": 3.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "I booked this hotel by phone and secured the rate of $139 for a Friday night. When my checkout receipt was slipped under my door, it gave me a rate of $275. I asked at the front desk, and they said that the rate was increased for St. Paul's School parents. Since I didn't have my confirmation with me, and I said that I thought I had secured a rate of $179, they made the adjustment, which I appreciated. Their normal weeknight rate is $119, but graduation will be over $300! Other local hotels offer a special and significant discount for visiting parents, which is certainly much more welcoming than feeling gouged.", "title": "inflated rates during local school event dates", "user": "itineraryjanie", "date": "October 25, 2009", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 4.0, "service": 1.0, "rooms": 4.0}, "id": 47717263}, {"rating": 2.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "Stayed at this hotel for 2 nights. First night the hotel had a black-out. After a number of hours in the dark everyone was required to leave. Major inconvenience - pack everything in the dark, no assistance in getting all our belongings down the dark stairway. Just as they were ready to find us other accommodations the lights came back on. We were supposed to be compensated - never happened. Not a complimentary breakfast, just lots of empty promises. No one ever responded to my many emails. Room was adaquate and nothing more - overpriced in this area of the country. Look elsewhere.", "title": "Overpriced with empty promises. Check elsewhere.", "helpfulness": 1, "user": "JAJDallas", "date": "October 23, 2009", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "location": 2.0, "service": 1.0, "rooms": 3.0}, "id": 47568925}, {"rating": 5.0, "title": "Fantastic food", "text": "The hotel was full, but the front desk was very helpful. Advised us to go to the Courtyard Marriott, whcih was perfectly adequate. Nevertheless, we went back to the Centennial for drinks and dinner. And felt we could have been in Boston or New York. Sophisticated adn buzzing room, great cocktails and fantastic and seasonnal food. \"gold Beet soup\", fantatisc seasonnal salad, etc... Very good and knowledgable service. A find in cord, which is nice but quite a sleepy town.", "user": "deanwood", "date": "October 22, 2009", "id": 47494421}], "location": {"country": "United States", "city": "Concord"}, "stars": 4, "variance": {"poor": 4, "average": 16, "very good": 36, "terrible": 4, "excellent": 97}, "aka": "Centennial Hotel Concord", "slim_ranking": 0.25, "description": "Offering 32 spacious guestrooms, each unique with the architectural distinctions found only in vintage buildings of the Victorian era; like third floor guestrooms with amazingly idiosyncratic ceiling lines, suites with lounges built into the twin turrets that provide the hotel its iconic presence, private porches and much more. Surprising touches can be found throughout, such as terry bathrobes, slippers and a special turndown that changes every evening of your stay."}