{"user_rating": 3.5, "review_count": 45, "name": "Cercle National des Armees Saint-Augustin", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "I had a great time in Paris, but would have been better in a nicer hotel. My wife and I would have a gerat night and when we came back to this hotel it would almost ruin our evening it was so disappointing.", "title": "Don't expect anything special", "helpfulness": 2, "user": "pcm_1983", "date": "March 17, 2012", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 2.0, "sleep": 2.0, "rooms": 1.0, "location": 4.0}, "id": 126243185}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled solo", "text": "We stayed in the standard room, which was way too small for us. My biggest complaint is the bath/shower did not have a curtain! So, I could either take a bath like I was 5 years old again or have a sitting shower to get get clear...not what I want to do when staying in Paris.", "title": "Great location", "helpfulness": 5, "user": "H1022", "date": "September 29, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 118737295}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "I asked for an upgrade and the staff told me I was staying in the best room - which I knew was not the case.", "title": "Many good points", "helpfulness": 5, "user": "patio53", "date": "September 21, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 118395189}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "Yes, the location was good but so are so many other hotels....do yourself a favor and spend a bit more money and stay in a better hotel!", "title": "Excellent venue and friendly, helpful staff", "helpfulness": 5, "user": "Steven Y", "date": "August 16, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116803435}, {"rating": 3.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "This was my third stay and was very pleased with the service and overall operation of the hotel. The location is at the Place St. Augustine which is within walking distance of many of the major Paris sites. Caveat- check the dress code. There is an enforced dress code for the public rooms.", "title": "Great location and price --- but be prepared for NOISE!!!", "helpfulness": 3, "user": "maconbartows", "date": "July 27, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 1.0, "value": 5.0, "service": 4.0}, "id": 115863839}, {"rating": 1.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "Surprisingly the people who run this place think it's special. We had a tiny room with back alley view- one double bed that filled up the entire room-one small desk with one straight backed chair- no closet-a small armoire to hold about 6 clothing items-no drawers in room, terrible lighting, no shower-not very clean bathtub, a tiny flat screen tv. -motel 6 would be a big improvement- inedible omelet for lunch in hotel restaurant. Manager and waiter could not have cared less. Do not stay here! Thankfully we only have 2 nights here. This is enough to make you hate Paris!", "title": "Poor room with no amenities", "user": "62redtag", "date": "June 29, 2012", "detail_rating": {"service": 1.0, "cleanliness": 2.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 2.0}, "id": 133048780}, {"rating": 3.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "Hotel Sainte Genevieve site can be accessed through Circle de Armes site cnaparis.com. It is located at 17, Rue Decartes in the 5h Arrondisement - one block to Pantheon. The rooms are no frills but large by Paris standards at the Ste. G. As a retired Navy officer, my husband had to provide his membership card to the Marine Memorial Club as a reciprocal member. The reception area at the St. G is minimalist but has 24-hour reception. The hotel is very clean. We booked a junior suite but it was just a pocket door to a small room with twin bed and 2 chairs which we never used. A standard room for our purposes would have been just fine.", "title": "Check sister hotel is price is too high at Cercle des Armes!", "helpfulness": 6, "user": "frequentsrtraveler", "date": "June 6, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 1.0, "rooms": 3.0, "location": 4.0}, "id": 131436385}, {"rating": 3.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "We thought the location was wonderful in the 5th Arr., a block from the Pantheon, a comfortable walk to Notre Dame and lots of fabulous restaurants along the way. Although the price was very good and the staff very helpful, it is unlikely we would stay here again. We like a bit more in the way of amenities and are willing to pay more but this was a quick 3 day French Open trip and we decided to give St. G a try. If you go, ask for the off street room. The revelers over the weekend with the Sorbonne two blocks away were excruciating throughout the night. The trash truck arrives at 7 am on Sat. & Sun and does not move out quickly. No a/c so we had to leave the windows open. Under no circumstances would we consider a revisit in July or August.", "title": "Good value for a central location", "user": "Jane S", "date": "April 23, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 2.0, "location": 4.0}, "id": 128465675}, {"rating": 3.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "There are no toiletries so better have your own shampoo. Soap provided. One hair dryer for the entire 40 room hotel. I would collect it at night and return it in the am. We paid $100.30 Euros per night. A real deal in Paris for a very clean room and great location. Although we did not do Petit de Jeunier, it is only 6.7 Euro. FREE Wifi in room.", "title": "Good location, overpriced", "helpfulness": 1, "user": "Ben S", "date": "April 8, 2012", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 1.0, "sleep": 3.0, "rooms": 2.0, "location": 5.0}, "id": 127462625}, {"rating": 3.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "There is no name on the outside of the hotel. You ring the buzzer and enter a courtyard at the building street number \"17\". Lots of restaurants close. We are 65 and 74 and walking is no issue for us. We made our way on foot one day to the Dorsay, Branly Museum and Eiffel Tower, dinner at Bistro St. Dominique and back to St. G. You miss lots when travelling the subway.", "title": "It will do", "user": "Katie L", "date": "March 30, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 126983198}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "This hotel is great if you're in the military (any military, not necessarily the French military) and want a nice hotel in Paris. The hotel does ask to see your military ID upon check-in and my understanding is that you do have to be an officer. However, we were visiting Paris with a group and reserved 4 rooms and they only asked to see my husband's ID since he's the one who made the reservation. So, if you're traveling with family or friends you may be able to all stay here.", "title": "Good value for a great location in Paris", "helpfulness": 6, "user": "mandi2doors", "date": "March 14, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 26161853}, {"rating": 1.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "Under NO circumstances should you EVER stay at the Hotel Saint Augustin (8 Place Saint Augustin, 75008, Paris). This is also known as the French Officers Club in Paris and \"Cercle National des Armees Saint Augustin\". We stayed there in a two bed room from 26-28 June 2011 and it was one of the worst experiences we have had in 28 years of active duty military travel (and we have been everywhere including 11 years living overseas). Upon our arrival at 1300 we were told the room would be available at 1400 as published and we could leave our bags and come back then. No problem, we left our bags in the store room and returned at 1400 only to wait in the lobby in front of the desk for almost another 30-40 minutes for our room \"to be cleaned\". A big surprise considering how dirty it was upon moving in. The only reason we did not leave immediately was that due to the on-going Paris Air Show we could not find another room under 300-500 Euro/night. The A/C in the room was broken and for two days/nights we sweltered in the heat. It was at least 90 in the room. When we arrived the first morning for breakfast I was turned away since I was wearing new tennis shoes, my wife was turned away for wearing open toed sandals and my son (on vacation) was turned away for wearing (very clean, presentable) shorts. In addition to the room being a dump, there was;", "title": "Never Stay Here!", "helpfulness": 4, "user": "soldierKentucky", "date": "July 2, 2011", "detail_rating": {"cleanliness": 1.0, "sleep": 1.0, "value": 2.0, "service": 1.0}, "id": 114954231}, {"rating": 4.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "- No fridge", "title": "Good Value for Money", "helpfulness": 7, "user": "J D", "date": "December 27, 2010", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 90834604}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "- No coffee pot", "title": "Wonderful Location & Great Value", "helpfulness": 4, "user": "TanyaM212", "date": "November 17, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 87342784}, {"rating": 4.0, "stay_parameters": "Stayed April 2010, traveled with family", "text": "- No notice of the breakfast dress requirements except at the entrance to the breakfast location (but more than happy to bring to room for 10 euro)", "title": "Good Value/Great location", "helpfulness": 3, "user": "CastleFam_4", "date": "April 22, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 62161141}, {"rating": 3.0, "stay_parameters": "Stayed September 2009, traveled on business", "text": "- No view (back alley)", "title": "Clean but...", "helpfulness": 1, "user": "hit-the-road_2009", "date": "January 6, 2010", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 4.0, "service": 3.0, "rooms": 3.0}, "id": 52750898}], "location": {"country": "France", "region": "Ile-de-France", "continent": "Europe", "city": "Paris"}, "variance": {"poor": 8, "average": 9, "very good": 17, "terrible": 3, "excellent": 8}, "aka": "Cercle National Des Armees Saint-Augustin Hotel", "slim_ranking": 0.689347462354}