{"user_rating": 4.5, "review_count": 755, "name": "Cerulean Tower Tokyu Hotel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed May 2005, traveled as a couple", "text": "The cerulean room was a little small but every hotel room in tokyo is small. The view from my room was amazing. We could see as far as the mountains and the wide expanse of tokyo. At night the views were magical. Then Shibuya is RIGHT THERE. You can walk to tokyu hands! You have the rail right there. Seriously I would never stay elsewhere...plus the service was impeccable. To this day, I have never stayed in a place that had that much attention to your comfort, We needed toothpaste and within 2 seconds there was a bellhop with toothpaste, an adapter, 2 minutes, a pen, anything and they were at our doorstep.", "title": "Best location", "user": "wunderlust2007", "date": "April 25, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 15336778, "likes": {"liked": "— Location and service", "disliked": "— Nothing really"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2008, traveled on business", "text": "So stay at the cerulean. They have everything you need and its in the heart of tokyo. And then take a walk through the love hotels and eat at Gonpachi. Truly memorable experience.", "title": "OUTSTANDING - Location and price fantastic", "helpfulness": 1, "user": "Grisgrisca", "date": "April 20, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 15175052, "likes": {"liked": "— The room and fantastic view", "disliked": "— Daily charge for use of pool and gym"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "For my third visit to Tokyo I decided to forego staying at a more expensive hotel where I stayed previously and asked the Embassy to try the Cerulean in view of its location as my 24 year old son was coming out to join me (on airline points). The location at Chibuya puts one within a short walk of an endless number of restaurants and all kinds of shopping. If one wants the high end stores then there were several department stores with all the high end possible.(Worth a visit just to see the quality of merchandise with men's shirts starting at $165 and ties at $100..and one of these great department stores even had a real theatre pipe organ where a young lady was giving a mid-morning performance). My son found a store (Ulo I think) nearby where he could not believe the deals and ended up buying so much I had to carry home a pile of t-shirts (at $19 each) and a linen sports jacket at $49. To visit Chibuya Square at 10pm and see literally hundreds lined up obediently waiting for the light to cross and then they come like a tidal wave of humanity...sit upstairs at Starbucks and marvel at the Times Square of Tokyo). And a tip with all the many restaurants, go to the top floor of the department stores..you will find a dozen restaurants and all reasonably priced with excellent food..in fact I have lived and travelled over much of the world over 35 years and have never eaten so well so reasonably.", "title": "Fantastic in every way.", "helpfulness": 1, "user": "4_outof_7", "date": "April 15, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 15059116, "likes": {"liked": "— The room's cleanliness and the hotel's location.", "disliked": "— It was too clean?"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "Now as for the hotel all I can say is outstanding. First the staff are so courteous and helpful..the concierge insisted in wallking me outside to show me the 711 which is in the hotel where there is an ATM and the chamber maid refused any tip..what a change from almost anywhere! As many other reviews point out the room is quite spacious, well and tastefully furnished, the internet at $10 a day worked perfectly on my laptop, but the bathroom is to write about...we loved the walk-in marble shower with glass separation so the bathroom does not get steamed up. Beds are very comfortable with European duvets and three types of pillows so I had my favourite down-filled. The fridge has room to add a few things of your own...(I was surprised that they did not provide an ice bucket or wine glasses, only regular drink glasses). The breakfast is excellent and well presented but like any top hotel at $30 for the buffet a little pricy especially when outside nearby the Starbucks or a myriad of other little coffee shops offer sufficient for less than $10...even $5. The hotel gave me a room facing away from the Square on the 27th floor but at my request moved me when my son arrived to a room on the 37th overlooking what I call Tokyo's Central Park with all the skyscrapers like the Hyatt in the distance..incredible view night or day and on top Mount Fuji as well became visible one weekend of my 2 week stay. The beauty of this hotel is that although next a major cross-city 6 lane roadway because the rooms are all on 20 or above floors with excellent sound-proofing there is absolutely no outside sound except an occasional helicopter. And finally it was well worth the price to have dinner in the bar on the 42nd floor..incredible view..(the French restaurant is one star Michelin but expect $100 a person minimum)...the only complaint about the bar is that the non-smoking is in a small area so we preferred to be in the smoking area with the incredible view and the ventilation system was so good despite the two men smoking cigars nearby we could not smell the cigars. With pre-dinner drinks, wine, a full three course meal for 4 persons and after dinner brandy plus the cover charge of $8 each the meal came to just under $300. On top of everything, I can only praise the excellent and very courteous helpful service at all times..wonderful.", "title": "Best hotel we ever stayed at!", "helpfulness": 3, "user": "violet37", "date": "April 5, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 14803696, "likes": {"liked": "— Cleanliness, comfort, feeling of luxury, food, views, location... you name it!", "disliked": "— If it was one block to the other side of Shibuya station it would be perfect!"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2007, traveled on business", "text": "Tokyo, Japan was the first of several stops on a 10-day Japan roller-coaster style vacation. After making it through customs, traveling on the N'EX to Tokyo Station, then hopping on the JR Yamanote line to Shibuya (as a travel tip, purchase a Japan Rail Pass in advance of your departure), we were ready for a brief period of relaxation at our hotel. The Cerulean, from the minute we steped into the hotel, was just what we needed.", "title": "GOOD VALUE but not in love", "user": "7DegreesOfWonderment", "date": "March 28, 2008", "detail_rating": {"front_desk": 4.0, "business": 1.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 14597929, "likes": {"liked": "— the view, price, value for money", "disliked": "— Impersonal, expensive facilities"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "Great location! Just across the road from shibuya station and the famous crossing.", "title": "Amazing hotel experience", "user": "Penny V", "date": "February 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 152610061}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled with family", "text": "The concierge helped with everything and had maps for every area! He even had a restaurant guide and helped look for places to eat for us. The room was decent, with an amazing view. Because we stayed on the tower floor we got free complimentary breakfast which was small but yummy and had a view overlooking the city.", "title": "Good location and big rooms", "user": "jaii13", "date": "February 18, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 152407718}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "The staff were so accommodating ! Definitely will be staying here again soon!!!", "title": "A great Japanese Experience!", "user": "Shaun B", "date": "February 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 152310677}, {"rating": 4.0, "stay_parameters": "Stayed February 2013", "text": "Stayed here (standard King City view) for 5 nights in Feb 13 with my wife and 2 kids aged 6 and 4. Hotel provided extra bed, and still plenty of space left in the room for luggages etc. Bath is spacious and quite luxurious. Good view from the room, on a clear day we can see Mt Fuji. TV selection was poor for English programmes, so the TV was rarely switched on. Room service was ordered for dinner and breakfast once. The quality was poor and prices was expensive. Easy to dine out as the hotel is 5 minutes walk away from Shibuya station, also behind the hotel there's a few eateries as well. Just to add, the hotel is located on a more 'quiet' and less busy part of Shibuya which was great! Staff were very accommodating and friendly. Loved our time there, will probably stay here again if I get the chance to visit Tokyo again.", "title": "Best Place, Warm Hospitality", "user": "kristupa", "date": "February 16, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 152268955}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled with family", "text": "Cerulean Tower Tokyu has an amazing location, being only a few minutes walk from Shibuya 5 Ways. There is literally days worth of wandering around the Shibuya Streets. If you're feeling energetic, you could easily walk to Harajuku, or if you're feeling lazy, catch the Yamanoto line anywhere! Cerulean Tower provides excellent service, and assistance to make Japanese bookings was happily provided by the hotel. Some here say wifi should be free for a 5 star hotel, but having a fee keeps all the leechers off it! For a minimal fee, you can have wifi for all your devices, lightning fast! Restaurant service was also exemplary. We had a few drinks on Level 40 to take in the view (expensive, but worth it) and also had dinner at the Italian restaurant on L2 (Must more affordable). Breakfast at the restaurant is very busy and generally involves a wait. For only a few dollars more, choose room service and have a table delivered to your room!", "title": "Cerulean Tower Hotel is an oasis of calm and service in busy Tokyo", "user": "BLACHFORD", "date": "February 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 152242773}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled on business", "text": "Absolutely the best hotel experience I've ever had, bar none.", "title": "Absolutely the best hotel experience I've ever had!", "helpfulness": 4, "user": "Evenhanded", "date": "June 27, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 17295650, "likes": {"liked": "— Eveything", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008", "text": "I travel frequently for business, and my experience at this hotel surpassed that of any other stay. When you get to the higher-end hotels, the minute details are what make the difference, and there were no shortage of those here. Since everyone else has spoken in general terms about the hotel, here are a few of the details.", "title": "Great hotel, amazing service", "helpfulness": 3, "user": "ixion", "date": "June 10, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 16827276}, {"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled solo", "text": "I came back from my day and tossed the business cards from my briefcase on the desk. The next day, after I returned to my room, the business cards were sorted into piles, by company, and stacked in perfectly square piles next to each other. I left my pants crumbled up on the bed. They were perfectly folded when I returned. Rather than disturbing where my things were in the bathroom, they moved the hand towels to the other side of the counter top.", "title": "Competent buisness hotel in fantastic location", "helpfulness": 1, "user": "NewYorker03", "date": "May 29, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "rooms": 4.0, "location": 5.0}, "id": 16502345}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled with family", "text": "Everyone wants perfection in a room but has to settle for second best. We all subconsciously accept defects in the room, like a handle that doesn’t work right, a scratch on the counter, or a dent in the fridge. But there wasn’t a single defect in the room that I could find, and the quality of construction was superb. The grout lines in the granite on the walls was so perfect, they were art. There were great details like the way the granite tile was rabbited where it came together, details that they didn’t have to do, but did. There were no scratches, dents, rips, smudges, in anything in the room.", "title": "Great business hotel in the hangout for Tokyo Youth", "helpfulness": 1, "user": "johnsmith47", "date": "May 14, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 16044189, "likes": {"liked": "— Attentive staff, location, impressive building design and well furnished room and bath.", "disliked": "— Except for eating out, not much to do for an adult in Shibuya."}}, {"rating": 4.0, "stay_parameters": "Stayed April 2008, traveled with friends", "text": "And the service was incredible. Others have described the quality of the staff. I’ll cite one example. My colleague and I were taking the 11:50 a.m. shuttle to the airport. We had been asked to be at the porter’s desk by 11:40 a.m. I was running late packing and hadn’t yet checked out. At 11:38 a.m., the phone rang: “Mr. <name>, are you still planning on taking the 11:50 p.m. train to the airport.” “Yes I am.” “Very well, you must hurry.” I got down to the checkout desk at 11:42 a.m. Two people were waiting for me with my bill already pulled. While I checked the bill, a porter came to me and apologized, but she needed to take my suitcase to the bus. She handed me a tag and whisked it away. Another person apologized, explained to me that they would call us in just a few minutes and motioned for me to sit in the lobby. In one minute a woman came through the lobby with a sign saying “11:50 p.m. Narita Bus”. I watched as simultaneously each bus passenger (ten or so people sprinkled about the lobby, intermixed with other people not waiting for the bus) was approached by a staff member and invited to follow the woman with the sign. The woman walked us to an escalator holding the sign and motioned us onto it. She then ran down the stairs next to the escalator (presumably out of respect), and directed us out to the bus. There was no way they could have made that experience better for me.", "title": "Perfect", "helpfulness": 2, "user": "Melbourneguy", "date": "May 3, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 15601024, "likes": {"liked": "— The design, location and service.", "disliked": "— No ironing board in the room and the excessive charge to use the pool. But its Japan."}}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "Very modern and sleek yet personnable hotel - just one word: for the price of another old-fashioned 4/5 star hotel, you are going to stay in a prime location coupled with top personnel and incredible views", "title": "Perfect combination - well above similarly priced hotels", "helpfulness": 3, "user": "cyrille_paris", "date": "December 19, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 11689033}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled on business", "text": "I stayed at the Cerulean for two nights in November, and was extremely pleased the entire stay. The room was large (especially for Tokyo standards) and the bathroom simply amazing. I booked a room with the bathtub in a picture window overlooking Tokyo, and would recommend it to everyone—it’s just a very cool way to relay after a long day. Bathrooms in Asia are exceptional anyway, and this one took the cake: washlet commode with seat warmer, great sound system, Molton Brown toiletries and a separate walk-in shower.", "title": "Great hotel in cool area of Tokyo", "helpfulness": 2, "user": "boston_tripadviser", "date": "December 11, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 11482437, "likes": {"liked": "— Just a great experience overall. Amazing staff and great service.", "disliked": "— The restaurants are extremely expensive"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled on business", "text": "The service was very good and staff more than helpful, and I did not have any problems communicating in English. Once you step off the airport bus or cab, your luggage is taken and appears in your room before you do.", "title": "Fantastic hotel and location - the best place to stay in Tokyo", "helpfulness": 3, "user": "missie22", "date": "November 28, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 11126222, "likes": {"liked": "— The panoramic views of Tokyo", "disliked": "— That water jet that takes you by suprise - that all Japanese toilets have!"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled solo", "text": "The hotel has a few good restaurants, and I had dinner at the French one overlooking Tokyo. Spectacular setting and very good food, but a bit steep at $137 for one person for the chef’s menu. Also had coffee and desserts in the Italian one, and I had one of the best tiramisus I have ever had—who knew I had to go to Tokyo for that. If you can, try the traditional Japanese breakfast through room service—it’s not cheap, but so worth it.", "title": "Great Hotel", "helpfulness": 2, "user": "sks120n", "date": "November 24, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 11030030}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "The hotel is very close to the major Shibuya metro and JR lines and the famous Shibuya intersection is a thing to experience. Thousands of people cross it at every light cycle—amazing. There are also a lot of upscale stores and department stores in the immediate vicinity.", "title": "Fantastic Hotel, in a perfect location!", "user": "strawberi", "date": "November 16, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 10850215, "likes": {"liked": "— The view from rooms is great !", "disliked": "— nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "Other than the hospitality, one thing that I love so much about this hotel is the spacious room. I stayed in the triple room, or double with an extra bed. And there's still space for our big luggage. I also love the big bathroom.", "title": "Spacious Room", "user": "SarskyLicious", "date": "April 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 156795204}, {"rating": 4.0, "title": "nice place, great staff", "text": "Very nice clean hotel with wonderful staff. The noise from Shibuya below drifts up, but is not horribly distracting. Easy walk to Shibuya Station and the Hachiko Plaza, along with all the Shibuya shopping.", "user": "Kaiserja", "date": "March 31, 2013", "id": 156192090}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled on business", "text": "I've stayed many times at this hotel and found it to be a very good hotel. Staff are always friendly and professional with a good level of English. It is well located to Shibuya Station (take south exit and use the above road pathways over the main road - no stairs if you can find the escalator just outside the station).", "title": "Quality hotel", "user": "DJC40", "date": "March 31, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 156126153}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled on business", "text": "The rooms are very nice and a good size by Japanese standards. The beds are very comfortable and the rooms are always clean and quiet.", "title": "Great business hotel!", "user": "D_C_Exp_Traveler", "date": "March 20, 2013", "detail_rating": {"service": 5.0}, "id": 155135402}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "All the restaurants around the hotel offer high quality food but if you can manage it there are many restaurants nearby which offer better value.", "title": "right choice", "user": "MaxRam", "date": "March 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 154583024}, {"rating": 5.0, "stay_parameters": "Stayed March 2013", "text": "This is my second stay here. I was fortunately upgraded and my room was terrific. Staff is really great and they make westerners feel very comfortable. You cannot beat the location to the train station but also just to walk around Shibuya.", "title": "Great place to stay in Tokyo", "user": "jake2771", "date": "March 10, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 154184649}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "We stayed at the Cerulean a few times throughout January 2013. It's lovely and close to Shibuya station and the crossing.", "title": "Good location, helpful staff, great views", "user": "Katie887", "date": "March 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 154150263}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled on business", "text": "The Cerulean staff are what really made our trip special - it was an absolute pleasure to deal with the concierge (Yoko and Naoko) even before we arrived they helped me to plan and book some unattainable restaurants, Sumo wrestling and the Kabuki. Without them our trip wouldn't have been nearly as special - thank you!", "title": "Nothing special - basic, with veneer of five-star", "user": "Stewart B", "date": "March 8, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 154043702}, {"rating": 3.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "The room service is also lovely at this hotel - great silver service. However, the breakfast downstairs in the morning is pretty average. They would do better to put it on a higher level like the Park Hyatt does. Would definitely recommend a drink upstairs at the bar for sunset - you can get great views to Mt Fuji when it's clear.", "title": "A solid hotel serviced by the airport shuttle bus", "user": "crouchie69", "date": "February 25, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 4.0}, "id": 153155416}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "Beware - book through Expedia as you get between 30-40% off the normal hotel room rate as we found out when we wanted to stay an extra day.", "title": "Still the best hotel close to Shibuya Crossing Tokyo", "user": "Mike7Riyadh", "date": "February 25, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 153033100}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled on business", "text": "I was on business and decided to stay at this hotel on a recommendation - it did not disappoint. Clean, spacious rooms with fantastic views of the city, faultless service and excellent room service (though I'd skip the tempura). The iced coffee at breakfast was the perfect way to beat the jet lag, with better pastries than you'd find in a patisserie.", "title": "Heart of Tokyo hotel with thoughtful touches", "user": "PandEKew", "date": "April 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 157441453}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "The concierge could not help me enough as I planned my day off in the city, writing phrases in Japanese, the price of tickets and idea on a route - fantastic.", "title": "Best location, room, and service", "user": "dxb67", "date": "April 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 157409335}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled solo", "text": "We stayed in this hotel for 5 nights in a standard room and it was great. Rooms are big and very clean with a great view of Tokyo. Service was excellent and you get a treatment of a 6 star hotel. Location was the best only 5 minutes walk to Shibuya station and shopping area. The other plus was the 7eleven convenient store just beneath the hotel. All in all I highly recommend this hotel.", "title": "perfect location, perfect room with a view", "user": "Yaboub", "date": "April 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 157326951}, {"rating": 3.0, "stay_parameters": "Stayed April 2013, traveled with friends", "text": "This is the hotel location you need to be in to experience the true pulse of tokyo. A couple of minutes walk from the famous shibuya crossing and heart beat of tokyo. The hotel lived up to my expectations, a true 5 star environment, great staff, and the best of it all, beautiful comfortable rooms with the perfect city views. I stayed on the 27th floor, I highly recommend this hotel if you are on holiday or business to this amazing city.", "title": "Good Location but limited services, read before booking!", "user": "Salim169", "date": "April 9, 2013", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 157147397}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "The Hotel is located in Shibuya just across the bridge from Shibuya station.", "title": "Great location, great service, great views of Tokyo", "user": "2012Toronto2012", "date": "April 7, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 156938795}, {"rating": 5.0, "title": "Yes! Stay Here!", "text": "GREAT room service. Nice rooms. Quiet. Very modern. Super location 4 mins walk from Shibuya station - although super hard to find if taking train from Narita (45 mins) then to town, switching to another train to then walk to hotel.....you MUST take the bus right ot the hotel! Easy peasy.", "helpfulness": 1, "user": "kiwi400", "date": "February 29, 2008", "id": 13946573}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "Overall hotel - killer. The bar at top is fantastic with awesome views.", "title": "A great find!", "helpfulness": 3, "user": "QueenTravel", "date": "January 28, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 13074920, "likes": {"liked": "— The large room size, convenient location, attentive service", "disliked": "— The cold temperatures in January!"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled solo", "text": "Stay here - a little more expensive but well worth it.", "title": "Love The Cerulean", "helpfulness": 3, "user": "Macinato", "date": "January 22, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 12894589, "likes": {"liked": "— View, spacious, Immaculate, wonderful bed and bedding, great bathroom, bath products, well placed safety deposit box, and very quiet.", "disliked": "— I have no complaints."}}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled with family", "text": "This hotel is amazing! From the service to the views to the location, this place will satisfy any traveler! Situated in the hip, exciting neighborhood of Shibuya there is a lot to do and see. And just steps away are two major lines of transportastion, the JR line and the Shibuya subway station. Travel sites offer better rates than booking direct- nearly 40% cheaper in the low season.", "title": "Great stay but pool is for adults only", "helpfulness": 1, "user": "shoonthego", "date": "December 30, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 12069608, "likes": {"liked": "— washrooms", "disliked": "— Adult only pool"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled on business", "text": "Expect heated seats and grand views in the bathroom, and a myriad of lounge options throughout the hotel. The Cerulean will exceed your expectations and satisfy your taste for the invigorating heart of Tokyo!", "title": "Great hotel, good location", "helpfulness": 2, "user": "Mark_from_Thailand", "date": "December 20, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 11708565, "likes": {"liked": "— Location", "disliked": "— Slightly regimented service. Try to order bar drink after 10pm"}}], "location": {"country": "Japan", "region": "Kanto", "continent": "Asia"}, "stars": 4.5, "variance": {"poor": 13, "average": 58, "very good": 302, "terrible": 11, "excellent": 371}, "aka": "Cerulean Hotel Tokyu", "slim_ranking": 0.142857142857, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}}