{"user_rating": 4.5, "review_count": 856, "name": "Chaaya Reef Ellaidhoo", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "The island is beautiful and peaceful. We stayed in the water bungalows which are on stilts over a shallow part of the reef. Snorkeling under the bungalows is to be recommended as that is where all the fish go to get some shade. Swimming around that area was perfect because you get to see a huge variety of fish and coral without going out of your depth (perfect for my girlfriend who is not a strong swimmer. She got to see baby sharks and octopus in 5 foot of calm water).", "title": "Perfect", "helpfulness": 2, "user": "st_and_ac", "date": "August 8, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 37075031}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "Rooms are well equipped with large LCD tv and DVD player, a balcony over the reef and an open air bathroom. The islands are all wifi'd up and you can buy vouchers for it from reception (works out about a pound an hour).", "title": "Amazing, tranquil bit of paradise", "helpfulness": 6, "user": "Sdvcooper", "date": "July 19, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 35133125}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "If you're all-inclusive then the free drinks are of good quality (the beer is san miguel) and the food at the fish restaurant (the restaurant for the water bungalows) is excellent. We mentioned early on that we were keen to eat the more spicy local food and from then on we seemed to get our own custom menu.", "title": "Several return trips later and it's still WONDERFUL!", "helpfulness": 7, "user": "pipmike", "date": "July 3, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 33824404}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "The main thing I would say about this resort is that, beyond all the facilities and food & drink, the thing that sets it apart from the competition is the staff. Everyone from the ladies sweeping the paths and the room boys to the restaurant managers and the head of resort made us feel like we were royalty. We would go back without a second thought.", "title": "Elliadhoo - Paradise!!!", "helpfulness": 3, "user": "Jackie_J63", "date": "June 28, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 33377518}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "It's very easy to be put off staying at a place when you start reading reviews on Trip Advisor, however, there are very few bad reviews of this place, and rightly so! We are very picky when it comes to holidays, and it took us a long time to settle on buying this holiday.", "title": "Great hotel and great staff.. had an amazing honeymoon..", "helpfulness": 7, "user": "D718", "date": "June 25, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 33118199}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "I'd been thinking of giving Ellaidhoo 4 out of 5 mainly because of the rather unsightly break-water wall that circles the entire island (more of which in a moment), but having thought about it some more I decided that on balance it deserves maximum points, because it IS an 'excellent' island resort.", "title": "Lovely island, great facilities. Highly recommended.", "helpfulness": 4, "user": "Jimbob72", "date": "October 27, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 47871125}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "PROS", "title": "Fantastic island & resort", "helpfulness": 4, "user": "rokut", "date": "October 21, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 47437208}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "- spacious, well appointed rooms with large bathrooms (many al fresco)", "title": "an absolutly amazing island- perfect for a honeymoon!", "helpfulness": 2, "user": "vikikismith", "date": "October 18, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 47127272}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "- genuinely great 360 degree house reef", "title": "...", "user": "steph_ryan_41", "date": "October 11, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 46580836}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "- high quality of service with friendly staff", "title": "Honeymoon was out of this world", "user": "KP-Bham", "date": "October 11, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 46566718}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "We were looking for a small, friendly, laid back island with good snorkelling, and after reading many reviews on trip advisor looking for the perfect place to relax, we decided on Chaaya Reef Ellaidhoo. We were not disappointed!", "title": "Loved It!", "helpfulness": 2, "user": "Chucklemonkey", "date": "October 10, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 46462938}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "The sea plane transfer was great fun, although we did a have a 3 hour wait due to technical problems with our plane which was a bit frustrating after an already long journey, but is one of those things which can't be helped.", "title": "Could this be heaven...??", "user": "jason1970London", "date": "October 9, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 46381644}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "We booked a beach bungalow and had planned to try and upgrade to a water bungalow while we were there, but decided against it once we had seen them. Athough the water bungalow rooms were brighter inside, they are all semi-detached, were no bigger than the beach bungalows and the people in the water bungalows would have to come down to the beach to find a sun lounger every day.", "title": "Fantastic - would go back in a flash", "helpfulness": 5, "user": "snappystitches", "date": "October 4, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 45817368}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "The snorkelling was amazing, we saw so many different species of parrotfish, trigger fish, surgeonfish, butterflyfish, pufferfish, wrasse, rays, reef sharks - the list goes on!", "title": "Great intorduction to the Maldives", "helpfulness": 1, "user": "Sanjaya_Wijeyekoon", "date": "September 25, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 44426167}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "At every meal the food was really fresh, well cooked and plentiful, you certainly won't go hungry! The service in the restaurant and bars was always fast and friendly, on more than one occasion our drinks were ready and waiting for us.", "title": "A fantastic piece of paradise - we wish we were still there!", "helpfulness": 10, "user": "evanzy", "date": "September 6, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 39921949}, {"rating": 5.0, "title": "an unforgettable holiday", "text": "6 of us visited Ellaidhoo from the 3rd to the 13th of August. The trip from Cape Town was a bit long but from the moment we arrived there we knew it was worth it. The island is perfect and the snorkelling (which was my reason for picking the island)is absolutely superb. They feed the stingrays every night at about 6:30 so if you snorkel from about 5pm onwards you can snorkel with them, we also saw a napoleon, lots of sharks and eels and got chased by a titan trigger while snorkelling. We were in the water every day and never got tired of it. The food was great and the staff were absolutely fantastic, everyone always had a smile especially the bar staff who we got to know very well considering we had booked all inclusive. the crab races and bingo are also lots of fun, Donald is in charge of the entertainment and he is brilliant, we left the island having made a new friend. The only thing i can possible complain about is the atitude of the woman running the dive centre, she was very unfriendly. We would love to go back.", "helpfulness": 5, "user": "sandy10144", "date": "August 26, 2009", "id": 38842990}, {"rating": 5.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "What a stunning place! Quite simply the most wonderful piece of paradise I've found so far. The atoll is an ideal place to stay if you're looking for a relaxing break in the sun, surrounded by white sands or if you fancy exploring the reef with its abundance of sea life. We stayed in a bungalow which offered that little bit of extra privacy and which had everything we needed for a comfortable stay. The food was stunning, everything freshly prepared from superb ingredients and Dennis (the restaurant manager) will bend over backwards to help you out if you have something special that you might want. Polite staff, who all seemed to speak very good English and the on-site dive centre made our break exactly what we wanted. We ended our week with a massage at the spa just to see if we could feel any more relaxed too! I'd recommend this resort to anyone because it was simply wonderful. My travel tip for any of the Maldivian atolls is to go all inclusive every time.", "title": "Paradise found", "helpfulness": 2, "user": "Lanky_lanky", "date": "August 21, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 38355867}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "I am not sure I can adequately say in words how much I loved our stay, how beautiful the island was and how friendly the staff were. We chose the island for the house reef and we were not disappointed. The reef was teaming with beautiful coloured fish going about their business. The diving was superb and to see the Napoleon fish and sting rays made up for the lack of manta rays and whale sharks. The food devine. We try not to visit the same place twice but will be hard pressed not to go back there soon. It was truly a holiday of a lifeime.", "title": "we loved every minute of our stay", "helpfulness": 2, "user": "andlin", "date": "August 18, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 38088887}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "We travelled with First Choice. Our trip went well and everything was on time. We arrived at Male and made our way to the sea plane departure area where we didn't have to wait at all as a plane was there ready. The only down side was we didn't have time to get a drink, so try to get one at the main airport. Also, don't forget a camera as all bags are stored on the seaplane. Our trip to Ellaidhoo took just 20 minutes, where we were greeted with a cold drink and flannel.", "title": "A tiny little piece of paradise", "helpfulness": 6, "user": "Leggy2008", "date": "August 13, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 3.0, "service": 5.0, "rooms": 4.0}, "id": 37597836}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "Even though we arrived early our rooms were ready. We had 2 interconnecting garden rooms to start with, as we travelled with our 2 teenagers. The rooms were a good size, clean and comfortable though a little on the dark side. We were later offered an upgrade to 2 beach front rooms. These looked out onto the water villas (rooms 313 + 314) and were much lighter. We were really pleased with these rooms as it was nice to see the sea when we woke up and to sunbathe in front of the rooms.", "title": "Lovely relaxing island", "helpfulness": 2, "user": "NthYorkSquashPlayer", "date": "August 11, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 3.0}, "id": 37334907}], "location": {"continent": "Asia"}, "stars": 4, "variance": {"poor": 24, "average": 63, "very good": 174, "terrible": 12, "excellent": 583}, "aka": "Chaaya Reef Ellaidhoo Hotel North Ari Atoll", "slim_ranking": 0.384615384615, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "Chaaya Reef Ellaidhoo, like all nature's wonders, is blessed with a spectacular offering for marine enthusiasts, is known the world over as the dive island in the Maldives.In the shade. Under the palms. On the Beach. Over the water. There are plenty of stylish types of living spaces to choose from at Chaaya Reef Ellaidhoo. The 112 rooms are delightfully designed to blend in with the tropical backdrop and its natural environment.A stunning location combined with star-class facilities and outstanding levels of service."}