{"user_rating": 4.0, "review_count": 43, "name": "Challaborough Bay Holiday Park", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed September 2012", "text": "Just returned from challaborough bay holiday park, hilltop 6. The caravan was excellent throughout, clean, dry, warm and well presented. The site itself is clean and tidy and well kept. Staff all seemed friendly and always acknowledged with a smile. The food in the waterside bar was first class. I am a fussy bugger and very picky and I found no fault, except maybe a little too much on the plate. Again everything in the bar was very clean and everyone helpful. The only fault any of us could level at challaborough was the lack of phone signal, which is a pain but not really that much of a problem.", "title": "Techno escape.", "helpfulness": 3, "user": "nullanv0id", "date": "September 14, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 140247513}, {"rating": 1.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "Just got back from the worst family holiday experience. Definately not 4* park, and definately wont be going back! Entertainment lacking in entertainment and very bitty, probably more suitable if you have kids under the age of 7 and want to have early nights, although dont expect to sleep if you have a caravan on the right hand side of the park as road noise makes it impossible to get a full nights sleep!", "title": "Never again!!!!!!!", "helpfulness": 2, "user": "Carol H", "date": "September 10, 2012", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 1.0, "sleep": 1.0, "rooms": 2.0, "location": 2.0}, "id": 139890215}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "Dont go here if you have been to good quality holiday parks before, as you will be disappointed.", "title": "Great Family Holiday by the sea", "helpfulness": 3, "user": "Sandra B", "date": "August 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 136415127}, {"rating": 3.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "The beach, sea and Friar Tuck takeaway are the only good things about the place sadly!", "title": "Do not stop in a \"cottage\"", "helpfulness": 2, "user": "Carrie H", "date": "July 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 4.0}, "id": 134613161}, {"rating": 4.0, "stay_parameters": "Stayed July 2012", "text": "Great location, great caravan, great staff, great entertainment.", "title": "Peace and quiet", "helpfulness": 1, "user": "lynxy72", "date": "July 8, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 133737353}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "We stayed at Challaborough Bay for 5 nights at the beginning of May. On arrival at the site, we found the reception staff to be very friendly and polite, and even though we arrived a couple of hours earlier than the check in time (4pm) we were given our keys straight away. We were allocated a caravan at the front of the site, near to the Waterfront Bar, entertainment venue and swimming pool. At first we were a bit worried about this, but we needn't have been as the location of the caravan turned out to be fantastic. We didn't hear any noise at night from either the bar or the entertainment venue, and were close enough to the front of the site so that we had a very short walk to the beach. The caravan itself was a new model for 2011 so it was only a few months old. It was very modern inside and quite wide, the bedrooms and bathroom were also a decent size. One day we did have a problem with the tap leaking in the kitchen, so we reported the problem to the reception and the tap was replaced within the hour - brilliant! The swimming pool and gym on the site were great and so was the children's indoor play room (our 16 month old daughter loved the ball pit!), however the outdoor play area, didn't seem that brilliant, it consisted of a wooden climbing frame in the shape of a pirate ship, with a slide at one end and a pole at the other, so it wasn't very toddler friendly, the play area could have done with some swings and maybe a smaller slide for the little ones. We didn't visit the entertainment venue, so cannot comment on that however the Waterfront Bar was nice, with a great view of the beach and lovely food. Overall we found Challaborough Bay to be a fantastic, clean and friendly site in a great location, with its own beach. The only downside being, as other reviewers have commented, is the lane leading down to the site, it is very narrow and quite steep with a couple of blind bends. There are however passing spaces, but you do need to take it very slow and be on your guard.", "title": "Brilliant site, great location", "helpfulness": 6, "user": "Strawberry78", "date": "May 23, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 109551379}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled with family", "text": "I have just returned from a Sun weekend at Challaborough bay. The caravan park itself is quite small but has everything you would need shop, park, swimming pool and the beach close by. We used the swimming pool which was good and the club house too, enetertainment was ok, exactly the type you would expect from a holiday park.", "title": "Good if you like Walking.", "helpfulness": 3, "user": "vankey", "date": "September 20, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 80255360}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "There a lots of coastal walks around, we walked to burgh island which was very nice. We experienced lovely weather, however if it had been a wet and windy weekend i think me review would have been very different, not a lot to do in bad weather. And not a lot to do in the immediate surrounding area!", "title": "Not bad at all!", "helpfulness": 2, "user": "sammypafc", "date": "August 22, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 76290356}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "We recently returned from a week at Parkdean Holiday Park, Challaborough having had an enjoyable time. It was a family holiday at the seaside for the first time in several years and proved a good choice. Two older sons with us and infant daughter and they all found plenty to do.", "title": "Seaside with views", "helpfulness": 1, "user": "195499", "date": "July 8, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 70195360}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "I have just returned from 5 days here with my brother and sister, all pensioners! I had read the reviews before leaving home and was a little apprehensive as some people had hated the place. The drive down to the caravan park was a bit hairy but that was because the sat nav took us down a very narrow, steep lane - we didn't use this route again and coped fine with the lanes. The caravan was great, very clean, roomy and comfortable. All the staff on site were very friendly and helpful and everwhere was kept very clean and tidy. The clubhouse area is a little tired and despite the best efforts of the entertainment crew we were not overly impressed with the evenings but that is a personal choice. We ate in the restaurant and had a very good meal and played pool and darts. We loved the walk along the headland towards Bigbury on Sea and went across to Burgh Island. This is a simply fantastic spot and I definitely want to come back here, it was so peaceful. We visited Salcombe which was lovely but parking is difficult. Dartmouth is well worth a visit and we took the ferry across to Greenway, Agatha Christie's holiday home (National Trust) which was lovely. We also visited Slapton Sands as we had seen it on television and it was the anniversary of the tragedy that happened in 1944 when 900 plus American serviceman lost their lives in a practice for the Normandy Landings. Slapton is a beautiful place with a huge lake and nature reserve plus some very nice looking pubs. A great holiday and although not one of Park Deans larger sites well worth another visit.", "title": "Wonderful views", "helpfulness": 1, "user": "Gemima", "date": "May 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 159596591}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "just returned from a week at this site, and its location was great for us with two small children as we spent most days on the beach either at Challaborough or over the top to Burgh Island. We used all of the facilities and various food outlets, can't complain about any as portions were good and food was tasty. The entertainment staff were excellent, most days there were only our two children in attendance at the Totstars sessions but Gemma and Kirsty still carried out the full programme for them and made us very welcome. I have to say every single member of staff that we came across was extremely friendly and always said hello and had a chat, they were all a credit to the company. Our caravan was a Skylark with central heating that came in very handy in April, and had everything we needed except a bottle opener. The only criticism is the mattresses were uncomfortable and we resorted to sleeping in the lounge for a couple of nights on the sofa bed but this too was very uncomfortable. We were very close to the clubhouse and bar but apart from the first night which was a Saturday we didn't notice any noise from there. Swimming pool was great, we used it several times, and the children's soft play and outdoor play areas were also good, but I imagine they get a bit cramped in summer as they aren't huge. Yes, the last leg of the journey through St Ann's Chapel and Ringmore was a bit hairy, but if you took your time it wasn't an issue and there are plenty of passing places. All in all we had a lovely relaxing week and can't wait to go again!", "title": "brilliant holiday 20-27th April 2013", "user": "Lynz1974", "date": "April 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 2.0, "rooms": 5.0, "location": 4.0}, "id": 159117389}, {"rating": 3.0, "title": "Ok but not Park Dean's best", "text": "Amazing views and expect it looks even better in the summer, but unfortunately let down by the park itself. Although clean accommodation, this park needs updating to the standard of other Park Dean sites. The location of our caravan was not the best, but have to say it was clean. If you want a quiet, off the beaten track break, then this location is ideal. Don't expect to go on a bike ride as the hills are pretty big and there's a pretty hairy car journey through the narrow lanes to get there. The nearest major shops are about 15 miles away. Head into Plymouth if need be, you'll find much more to do there if its abysmal weather.", "user": "Michael G", "date": "April 13, 2013", "id": 157599965}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "Stayed here in July 2012. Originally booked as a sun holiday and extended whilst there as the weather was fantastic. Were given a new caravan that had central heating and whilst we didn't have much of a view, just a 2 minute walk took you to the sea front.", "title": "Excellent holiday", "helpfulness": 1, "user": "tanyamjames", "date": "April 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 157307936}, {"rating": 1.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "The restaurant/pub overlooks the beach and we ate here every night/day. The curry night was very nice and the Sunday Roast was superb. Book a table or you may not get in! The chippy was awful, as had been on a previous holiday. Frozen chips and awful fish, avoid it.", "title": "NEVER AGAIN", "helpfulness": 1, "user": "staffordliz40", "date": "February 27, 2013", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "sleep": 1.0, "location": 1.0, "service": 3.0}, "id": 153315915}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "We have just returned from 4 nights at Challaborough Bay Holiday Park, as part of the Sun promotion, and we had a lovely time!", "title": "Great Week At Challaborough Bay!", "helpfulness": 2, "user": "Rachel V", "date": "June 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 132041580}, {"rating": 3.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "A few tricky roads getting to the bay but from what we'd read before we left, we were expecting this. Unfortunately we decided to trust tomtom a little too much, only to find ourselves stuck on very narrow tracks on several occasions. Its funny now we are looking back on it, but pretty daunting at the time!", "title": "Short break", "helpfulness": 2, "user": "fineshine27", "date": "May 27, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 1.0}, "id": 130686862}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "After a very quick check in, we pulled up at our lovely 3 bed caravan with lots of space which was ideal (there was only me, my husband and little girl yet its amazing how much 'stuff' you have with a little one!). It was very well equipped - I agree with another comment that some instructions for using the heating would have been handy, but we found out how to use it in the end.", "title": "Blissfully mobile-signal-free", "helpfulness": 4, "user": "Martine P", "date": "March 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 126934544}, {"rating": 5.0, "stay_parameters": "Stayed October 2011", "text": "The swimming pool was great - we used it everyday. Lovely and warm, very quiet due to the week we went which was a bonus. My husband also used the gym every day and said it had some good equipment. The onsite shop was suitable for picking up any odd bits you'd forgotten - nice and friendly staff, opportunity to order in fresh bread/croissants which was a nice touch.", "title": "Very relaxing place", "user": "Joasiaw", "date": "February 17, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 124723189}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "Lovely coastal walks nearby (the walk up the hill towards Burgh Island was ok for a buggy, I wouldnt recommend the walk up the hills on the opposite side). The beach at the bay was nice too. The restaurant over looked the sea and we had a nice meal here for a decent price. The chipshop on site was also good.", "title": "Superb!!!", "helpfulness": 4, "user": "mikeydSomerset", "date": "July 30, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 116015933}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "variance": {"poor": 2, "average": 4, "very good": 20, "terrible": 2, "excellent": 15}, "aka": "Challaborough Bay Holiday Park Hotel Bigbury-On-Sea", "slim_ranking": 1.0}