{"user_rating": 4.0, "review_count": 517, "name": "Champneys Forest Mere", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled solo", "text": "I booked a night's stay for myself and my room was fantastic, really clean and fresh with a massive bed and doors opening out to the garden, where I could sit in the sunshine with a cup of tea - lovely! The staff in both the Terrace and middle restaurants were warm and friendly so, although I was sat by myself for dinner, breakfast and lunch, I felt really comfortable with eating alone. There was the option offered to join fellow guests who were staying on their own, at a special 'Champneys' table had I wanted to. I have a dairy intolerance and the menu's were clearly marked to help me with ingredients. There was no suitable dessert after dinner but the chef made the effort to make me a special dish which was much better than the usual treatment I get in similar situations. I had a full body massage, thalassotherapy and cut & blow dry and for each treatment the staff were great - friendly without being intrusive, knowledgeable and offered a great service. Although I was only staying for one night, I really felt like I had been away for a longer break, as I was so relaxed and pampered! I can't wait to go back soon!", "title": "I cannot recommend Forest Mere highly enough.", "user": "NKL19", "date": "July 22, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115646749}, {"rating": 1.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "My partner and myself vistied forest mere for an evening and dinner. The spa was not what we were expecting AT ALL!! There were loose tiles on the floor in the ladies steam room, the mixed sauna had rubbish all over the floor (including a used plaster). The shower cubicles ceiling paint was peeling off and had black mould over it. The bottom of the towel bins were mouldy. The lack of clean dry towels in the mens room (plenty of wet dirty ones all over the floor though).I have witten a formal complaint to their head office as the evening cost us a alot of money. I am still awaiting a reply!", "title": "DIRTY!!", "helpfulness": 2, "user": "luvsunLondon", "date": "July 20, 2011", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "service": 1.0}, "id": 115585244}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "This was my first visit to Forest mere with my daughter.It was to be a time to relax and unwind and this is exactly what we found .Our room was very comfortable( we shared a 'Superior' room ) which looked out onto lake.The surroundings were great for walking and reflecting,all staff were attentive and those giving 'treatments' had an unhurried approach (which is commendable, given the number of clients being seen)Throughout the day we enjoyed food of a high standard(buffet style breakfast and lunch- table service in the evening) I appreciated the fact that I did not feel under pressure to buy additional products and hope that this policy ( if indeed it is one!)continues.I will certainly be visiting again", "title": "A place to be pampered", "user": "Jophet30", "date": "July 19, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 115542474}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "My daughter and stayed for a two night break. It was so relaxing, the staff are very friendly and helpful but balance this by not being intrusive. The food is wonderful too. We will certainly be returning.", "title": "We loved the relaxed atmosphere", "user": "JDB51", "date": "July 19, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115540660}, {"rating": 3.0, "stay_parameters": "Stayed July 2011, traveled with friends", "text": "Our sixth visit to this Spa. As Premier guests had a very nice room with a fabulous view of the lake. However, the sofa was so dirty we didn't feel like sitting on it!! The outdoor swimming pool itself was well kept and clean but the surroundings were nothing like the pictures on the website! The pavers were weedy and the steps down were surrounded by overgrown trees - very neglected.", "title": "Sixth visit - bit disappointed", "helpfulness": 2, "user": "vixmum7", "date": "July 19, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 4.0, "value": 3.0, "service": 4.0}, "id": 115530902}, {"rating": 1.0, "stay_parameters": "Stayed April 2008, traveled solo", "text": "had a four night stay booked premier £898.00, very late booking, arrived at 7.30pm, sp really lost a day!!!! on arrival was shown room and went straight into dinner in premier dining, very nice and the food was excellant, waitress charlie (charlotte) was so helpful being alone was welcoming and friendly, asked housekeeping for peppermint tea, and told would have to BUY teabags from spa cafe yes BUY amazing but true!!!! also not robe, slippers, welcome products or flowers on arrival had to wait until next day, after asking 4 times, then was given paper bag, inside a mix of splendid products one would expect at a spa NOT A SHOWER GEL anyway i set off to explore, had my premier treatment consoltation oh yes all of 5 mins and held in waiting you with other guests also waiting, the girl was uninterested i booked alot more extra treatments than was included in package for the 4 nights, unfortunately it was a total disappointment, had scrub which was over in less than 45mins the facial later was unreal, no hair band i have long hair, the therapist didnt have a clue, i did complain the next day people were complaining alot and i had to ask to discuss it in private than exposed agin in waiting room!! i was offered another treatment which i accepted, for next day, i had a fennel wrap which again disaster was back in my room by 1.55pm and was an 55 min treatment, all the girls are too young and inexperienced, it feels as though you are on a conveyorbely. i put in writing to day manager that i was cancelling allfurther treatments, no one bothered to contact my room or me to discusss this issue, i however wanted to try a be positive and enjoy rest of stay, the healing circle is amazing with patsy and enjoyed the pool. steam room was not working. walked alot, and the food was lovely, the lake terrace seems like a drap dirty area, shame as could be amazing, the rest of areas ok. i checked out 1st thing friday morning as didnt want to stay.... all the cancelled treatments were on bill and again was treated to silly girls at reception no knowing what to do, i asked to see manager but she didnt come just day treatment manager who wasnt apologetic just surley and after demanding the refund several time she refunded \"some\". i will not be going back to champneys a place to print money farm not health farm with customer care. the bath house in bath is amazing and whatley manor!!!!! go there", "title": "very disappointed quite disgusted", "helpfulness": 3, "user": "nanrosemar", "date": "April 21, 2008", "detail_rating": {"front_desk": 1.0, "business": 3.0, "service": 1.0, "cleanliness": 4.0, "value": 2.0, "location": 5.0, "rooms": 4.0}, "id": 15187004, "likes": {"liked": "— food", "disliked": "— spa and staff"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "My husband and I had a 3 night, 4 day stay at Forest Mere and had an enjoyable, relaxing stay.", "title": "A lovely time!", "user": "Blake100", "date": "March 30, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 4.0}, "id": 14654736, "likes": {"liked": "— Spacious and nice atmosphere!", "disliked": "— Long journey to get there!"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "We both enjoyed the combination of relaxation, exercise and good food; something we have been looking for from a holiday/break for a long time.", "title": "Relaxing Break!", "user": "Seamo", "date": "March 18, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 14362612}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled with friends", "text": "The food is of excellent quality, with plenty of choice for Breakfast and Lunch. In the evening, there is waiter service, which controls the food portions - to make sure there is no chance of overeating, before \"bedtime!\"", "title": "I want to stay for a week next time", "user": "lilythepink06", "date": "February 2, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 13212674, "likes": {"liked": "— food", "disliked": "— The carpark and road works on the A3"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled with family", "text": "There were no children, which was great; and limited access to alcohol; which was not an issue for either of us.", "title": "High Quality Spa Experience", "user": "Diane05", "date": "December 31, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 12152807, "likes": {"liked": "— Cleanliness, comfortable and classy"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "We have just returned from yet another lovely weekend at Champney's Forest Mere. This was my 4th visit, and as always, I had a great time. It is a lovely place just to relax and enjoy all the treatments that the spa have to offer or if you are feeling energetic, then there is a full excercise class programme that you can join in. The setting is beautiful, we stayed in a room overlooking the lake which was lovely. The food was wonderful but most of all the staff here are so friendly and helpful which made our stay even more enjoyable. I look forward to returning for my next visit!", "title": "Beautiful setting", "user": "Christine C", "date": "July 28, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115896153}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with friends", "text": "My friend and I stayed at Forestmere for 2 nights. The spa is fantastic, the room lovely, the pool fabulous, the staff very polite and helpful and the food amazing!", "title": "Fantastic!", "user": "SallyEdwards000", "date": "July 28, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115891416}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "We had a great time and I would recommend it to anyone looking for a lovely spa to relax in.", "title": "A really great experience", "user": "pathealscats", "date": "July 26, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115800111}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "Anybody who needs to be a little spoilt needs to go to Champneys - I only know the one at Forest Mere. I went there first and because I loved the experience, I have never tried the others - though I am sure they are just as good. The marvellous treatment that you can receive there are terrific. My special treatment is a full body massage but there are many more to be had if you can fit them with all the classes and swimming you will want to do - try it - it is worth it.", "title": "Champneys, Forest Mere, Liphook", "user": "Vivi1956", "date": "July 26, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115799035}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "Myself and my daughter stayed at Forest Mere 21st - 22nd July for a pampering break. My daughter is 34 weeks pregnant and it was her birthday also. From the moment we arrived, until we left, we had a wonderful time. The staff all around the building, from reception through to the restaurants were absolutely lovely. The room we had was perfect, with twin beds and a view looking into the garden. The food was devine! The treatments were devine! The facilities and treatments were excellent and we could quite easily have stayed for longer, but, we had the birthday celebration with family and friends in the evening of the 22nd July. We have visited before and would, without question, visit again in the future. Would definately recommend this to everyone.", "title": "Relaxing, Beautiful, Healthy, busy and missing treatments requested.", "helpfulness": 1, "user": "hb7", "date": "July 25, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 115742923}, {"rating": 2.0, "stay_parameters": "Stayed December 2007, traveled with family", "text": "My daughter and I have been going to forest mere now and then for about 10 years. Service and treatments gradually declining in quality. But having said that food has improved - if you want an ordinary diet as opposed to a lettuce leaf diet.", "title": "Will look elsewhere next time", "helpfulness": 1, "user": "beadyeyes1", "date": "December 4, 2007", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 2.0, "location": 4.0, "rooms": 3.0}, "id": 11248793, "likes": {"liked": "— Clean", "disliked": "— Service"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007", "text": "Champneys treatments - massage/facial - big price, poor value, amateurish (our young girls spent a lot of the time - at a cost to us of £80 an hour! - writing a prescription, so called - which included everything from bubble bath to Xmas gifts!! (some sort of commission scheme in operation resulting in - barely any attention to the treatment but a lot of attention to selling....)", "title": "Relaxing Stay, as always", "user": "cruella55", "date": "October 15, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 10081758, "likes": {"liked": "— Sheer relaxation", "disliked": "— Cold swimming pool"}}, {"rating": 1.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "Not happy, did complain to manager and did get a free treatment each, but won't go back - the whole ethos has changed - push them through fast and furious to maximise profits. Well that's about it I think!", "title": "Luxurious? I don't think so", "helpfulness": 4, "user": "al100", "date": "September 19, 2007", "detail_rating": {"front_desk": 1.0, "service": 2.0, "cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "location": 5.0}, "id": 8755845, "likes": {"liked": "— The location", "disliked": "— The food and lack of evening activities"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled with family", "text": "Just my opinion of course.", "title": "Wonderfully Relaxing", "helpfulness": 2, "user": "Han1", "date": "July 27, 2007", "detail_rating": {"front_desk": 1.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 8244948, "likes": {"liked": "— The lake and the relaxing emvironment", "disliked": "— Check in"}}, {"rating": 3.0, "stay_parameters": "Stayed March 2011, traveled with friends", "text": "Stayed in Champneys Forest Mere with 3 girlfriends on a 2 night package which included meals and 2 x 30min treatments.", "title": "Quite Disappointing", "helpfulness": 2, "user": "caitni2000", "date": "August 2, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 2.0, "value": 1.0, "service": 3.0}, "id": 116174309}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "I am a little spoiled by Irish spa hotels at home and generally stay in 4-5* hotels, so had been expecting a similar standard here. Many women seemed to thoroughly enjoy it and my English friend was not disappointed (my other 2 irish friends with us were). Everything is very clean, staff are helpful and friendly, but the quality of the fixtures and furniture is far from relaxing and feeling pampered. Food was like eating cardboard - but I guess this is to be expected in a health farm! My full review is below, but in a nutshell, this place is not worth the money. Central London spas are much more luxurious for the same price!", "title": "The place to be for a total relaxing stay!", "user": "Cattycat12", "date": "August 2, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116152279}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with friends", "text": "Fabulous setting, driving up the winding lake I felt like I was arriving in Mr Darcys Pembrokeshire. Reception is nice and bright and very 1990's décor. Bedrooms were incredibly disappointing. The corridors are carpeted in navy and red 1990s style. Our rooms had 2 single beds as requested. Pillows were basic, as was the light quilt with poor quality cover, and there was a basic cotton \"throw\" at the foot of the bed to add some green and yellow colour to match the green carpet and the green and yellow walls. There was one very thin and poor quality roller blind on the window. A little TV (from 1990) and the basic coffee set. The bathroom was standard with the sink in all in one form Formica. There was packets of soap, shampoo and body wash and standard toiletries from unknown brands and akin to 3* hotels. There was no water or fruit in the rooms.", "title": "Fantastic birthday treat", "user": "gina186390", "date": "August 2, 2011", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "service": 5.0}, "id": 116141831}, {"rating": 3.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "The robes and slippers provided were of excellent quality. Forest Mere is built off an old house. The old area has relaxation rooms which are furnished in the period décor, so not somewhere you can comfortably relax in your robe. This is the only relaxation area which is well set off from the spa. The pool is nice, but there is no hot-tub, only a whirlpool. Somewhere to lay and read magazines and books while dipping in and out of the facilities would have been very welcome. There was a \"relaxation room\" off the changing rooms which was like a living-room with garden sun loungers in it. The treatment rooms were upstairs. Treatments were good, but not memorable and trekking back downstairs, through the changing rooms to get to the relaxation room kind of defeated the purpose! There was an additional view room off the pool, but again it felt separated and furniture was uncomfortable.", "title": "Didn't Live Up to the Hype", "helpfulness": 1, "user": "Jamborock", "date": "August 1, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 3.0, "value": 2.0, "service": 3.0}, "id": 116124965}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "In summary, I would never return here and would never recommend it unless it gets a major facelift. It is clean and staff are helpful, but it has nothing to indulge relaxation and pampering.", "title": "Relaxing break", "user": "mimsnas1", "date": "July 30, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 4.0}, "id": 116012809}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with friends", "text": "An excellent place to relax and unwind. We return every year and sometimes twice a year and it really shows you a place is good when the same staff have been there for the 8 years we have been visiting Forest Mere! It great that it is a dedicated Spa and not attached to a Hotel where you have othere types of Guests. The facilities are excellent, the food is healthy and great and all the staff are friendly - what more could you ask for. We will be back again this year for more relaxation.", "title": "Very Relaxing Stay!", "helpfulness": 2, "user": "ktruckel", "date": "July 14, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115347935}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with friends", "text": "This was my fifth visit in just over a year and I couldn't wait to be back. Be prepared for lovely food, helpful staff and as much relaxation you want.", "title": "It was fabulous", "user": "pearlygran", "date": "July 12, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115285439}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled solo", "text": "Just returned from a 4 day break at Forest Mere. I can't praise it highly enough. The resort is set within beautiful grounds and even when fully booked, feels spacious and peaceful. The staff are just great - very friendly without being intrusive. One thing I did notice was that returning guests (of whom there were many) are given a really warm \"welcome back\". A great touch which is done with sincerity. Food is great and plentiful and treatments are professionally delivered. I felt totally at ease at FM, which is important when travelling solo. The stay was topped off with beautiful weather which made lounging by the outdoor pool all the more enjoyable. The only minor \"blip\" was a disturbed night on Saturday night thanks to other guests' rowdy behaviour but the hotel made amends graciously by extending my room booking. Top marks. I've already booked my next stay!", "title": "Totally relaxing, beautiful grounds, lovely staff", "helpfulness": 2, "user": "s2keygirl", "date": "July 6, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 3.0, "value": 4.0, "service": 5.0}, "id": 115096294}, {"rating": 1.0, "title": "Rip off", "text": "While I went to watch cricket at Lords my wife booked a day's spa break for herself and daughter---which was not cheap I can tell you!", "helpfulness": 1, "user": "Ianinwinchester", "date": "July 4, 2011", "id": 115014087}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with friends", "text": "On my return I expected them to be elated. Quite the opposite as the treatments were not as good as had been promised, it was not possible for them to use the hydro therapy area such as the swan neck water showers without paying extra, no loungers around the pool to aid the chill out process and the lunch was only exceptional in that it was underwhelming. Apparent;y there was a couple eating sausage rolls in the car park---not my wife and daughter I hasten to add!", "title": "WOW - PURE LUXURY AND FABULOUS SERVICE!", "helpfulness": 2, "user": "amybucket", "date": "July 4, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115007785}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "variance": {"poor": 32, "average": 70, "very good": 118, "terrible": 31, "excellent": 266}, "aka": "Champneys Forest Mere Health Hotel Liphook", "slim_ranking": 0.333333333333, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.5}}