{"user_rating": 4.5, "review_count": 22, "name": "Chambres le Grand Puits", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "One of the best places I have ever stayed, anywhere. Perfect location inside the medieval city's walls, and the rooms are gorgeous! Ours had room for four, a kitchenette area we were able to cook a stir fry in, a huge terrace for eating and relaxing. Nicole is so warm and welcoming, and had grocery staples available for the taking, as well as a library of books to read, teas, etc.", "title": "Amazing place--we never wanted to leave!", "helpfulness": 2, "user": "pricegayle", "date": "July 15, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115390047}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled with friends", "text": "Our room was decorated in beautiful fabrics, had wonderful light, was clean and cool after a day in the sun. I would definitely stay here again. And again.", "title": "A little \"Gem\"", "helpfulness": 4, "user": "LJ3007", "date": "April 11, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 103575907}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "We can only agree with most of the other reviews of this magical B&B. The location is superb (right in the centre of the medieval La Cité), the rooms we had were roomy and well appointed and the welcome we received was delightfully warm and friendly. One of our rooms had a charming courtyard and the other a rooftop terrace with an excellent view. Our tiny kitchenettes were well-stocked with all the necessary food and equipment. This is the very antithesis of a standard chain hotel. Our experience was thoroughly enjoyable and, indeed, unforgettable for all the right reasons. We look forward to our next visit.", "title": "A little gem", "helpfulness": 1, "user": "dg74", "date": "May 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 130356788}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "Our family of 5 thoroughly enjoyed our stay in the Orange room. Clean,well-equipped with everything we needed (including wifi ), great mattresses, a spacious shower and a priceless view, all in the heart of la Cite. A unique and thoroughly charming location, which allowed us to wander the almost deserted streets in the evening, without the daytime bustle. The very modest price makes this a real find for people who are interested in something other than generic chain motel accommodation.", "title": "Charming!", "helpfulness": 2, "user": "cgsailor66", "date": "March 13, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 126062564}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled with friends", "text": "We stayed in the Orange room for 2 nights and I was taken aback by how cavernous the room was. There are beds for 4 with a large bathroom, small kitchenette, dining area, and a lovely terrace with table and chairs. Our wonderful host, Nicole, keeps the kitchen stocked with basics so we could make our own breakfast. And in venturing down to the old town we found the wonderful bakery Croc en Stoc where we could pick up delicious quiches and salads to go for delightful little dinners on our terrace, as well as fresh croissants for our morning petit dejeuner -- at half the price and better quality than any of the sandwich shops within the old city walls. The room is basic and the whole place in need of a modern update, but it is clean and very comfortable and we thoroughly enjoyed our stay here. I would absolutely stay here again.", "title": "Spacious, cheap, and comfortable in an unbeatable location", "helpfulness": 3, "user": "copperhead71", "date": "October 2, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 118849470}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "Stayed with my partner and 2 sons for one night while driving back from Spain. We were given a warm welcome by Nicole on arrival and she is a wonderful host. The location inside the walls is fantastic and allows you to explore the Cite during the quieter times when the bulk of the day trip tourists have left. Nicole suggested a late night walk between the walls which is a must to absorb the atmosphere of the Medieval city. We stayed in the blue room which had its own little balcony. Wish we had more time but will return some day and will be calling on Nicole for accommodation when we do.", "title": "Wonderful", "helpfulness": 3, "user": "lavajelly01494", "date": "August 30, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117443485}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "We stayed here for two nights, over a weekend in July. Four of us (my wife and I, and our two young teen children) rented the Chambre Bleu, with annex, which provided us a comfortable bed for my wife and I, and separate beds for the kids. The petite kitchenette was an excellent addition to the room(s). The private terrace, with grapes growing around the edges, was beautiful.", "title": "Incredible location, cosy and comfortable", "helpfulness": 3, "user": "Cirrus2000", "date": "July 28, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115879625}], "location": {"country": "France", "region": "Languedoc-Roussillon", "continent": "Europe"}, "variance": {"poor": 0, "average": 0, "very good": 7, "terrible": 0, "excellent": 15}, "slim_ranking": 0.448275862069}