{"user_rating": 4.5, "review_count": 336, "name": "Chambiges Elysees Hotel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed August 2013", "text": "This hotel was really perfect for our short stay in Paris. It is in a beautiful location on a quiet street which is close to the Champs Élysées and an easy walk to the Eiffel Tower. The room was clean and relatively spacious given it is a small old hotel. The rooms were clean and nicely decorated. I had read reviews about the breakfast room being small but we really did not find that to be an issue. My husband, my ten year old son and I shared a triple room and there was a more than adequate pull out couch for my son.", "title": "Great location and good rooms.", "helpfulness": 3, "user": "suharbottle", "date": "August 12, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 171900422}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "We spent six days at this charming hotel. It is located blocks from the Champs Elysee, Eiffel Tower, Metro, Seine, RER - could not have been more convenient. The neighborhood has a range of strong dining options (although they are all expensive) and there is a market within close walking distance. The hotel staff was consistently warm, courteous and helpful. The property is in excellent condition - well-maintained and well-decorated in a classic style. It's a relatively small hotel which works to the advantage of the establishment - it's managed in a very professional way and no one crowds your space, but there is a human scale to the experience. We would recommend it highly and we would definitely return.", "title": "A Charming Hotel in a Great Location", "helpfulness": 4, "user": "Andrew S", "date": "August 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 171805841}, {"rating": 3.0, "title": "Good location but old hotel", "text": "This is a nice hotel as far as location goes. We were able to walk around to all of the major shopping the first afternoon we arrived (within an hour of the stores closing) then we walked seeing the Opera, Gallery, tunnel where Princess Di died and took pictures of the Eifiel Tower from across the river. Pretty good for the first afternoon! We took a quick cab ride the next day to the Hard Rock Cafe, where we had to pick up our on-off bus pass. By the way, it cost us 80? in a taxi from Paris CDG. The hotel staff said they could get us a car for 85? and a cab would be 60?, so she recommended a cab. Since it was so even we had the hotel get us a car for our return trip since we had an early flight.", "helpfulness": 4, "user": "angsamp", "date": "August 10, 2013", "id": 171648852}, {"rating": 3.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "As far as the hotel itself, we had a deluxe room. I dont know anything about hotels in Paris, but for the price we didn't feel that we got that much. The hotel and rooms are just really old, which was a disappointment to us. To some extent the charm was great, but new carpet would have been a major improvement. In order for the AC to work, you must keep the windows closed. It automatically turns off when you open the window. It took us awhile to figure that out! Like others have said, the toilet is in a separate room from the bathroom. I felt like it was in a closet. The shower was very nice and had plenty of pressure and hot water. In general, the room was very clean and housekeeping knew when they could come clean because whenever we left the hotel we were asked to return our room key \"for emergencies.\" I thought that was a little strange, but we did as we were asked by the reception desk and they gave our key back each time we returned. When you're in the room you have to put the room key (card) in a slot to run the lights. It's a great way to keep their electric clsts down, but don't plan on charging any electronics while you are gone for the day. We had our breakfast delivered to our room. It was prompt and served hot. The choices were so limited that continental breakfast shouldn't really be advertised.", "title": "nice place to stay", "helpfulness": 1, "user": "Carolyn J", "date": "August 10, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 2.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 171598800}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "The hotel really was okay, and I liked the location, but if I were to do it again, I'd definitely look around a little more. My travel agent found this hotel and I booked it based on Trip Advisor reviews + website pictures and expected a little more so I just want to share my thoughts for the next person. ?", "title": "Great gem in Paris", "helpfulness": 5, "user": "shadi74", "date": "July 31, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 170087634}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled solo", "text": "This lovely 4 star hotel is a great choice for Paris. The rooms are spacious and quiet. Laetitia on the front desk went out of her way to assist and was a great ambassador for the hotel. The hotel is 15 mins walk to the Eiffel Tower and 8 mins to the Champs Elysee and there are lots of restaurants and a supermarket nearby. The only suggestion for improvement I would make was to have modern hairdryers in the rooms, the wall mounted ones are not up to scratch. I would definitely stay at the Chambiges Elysees hotel again.", "title": "Excellent hotel in perfect location", "helpfulness": 3, "user": "tripellen", "date": "September 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 176699126}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "We had a lovely room (504) with a balcony that opened up onto the courtyard.", "title": "Charming boutique property", "helpfulness": 3, "user": "Ann D", "date": "September 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 176321991}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled with family", "text": "The location was perfect, close to everything and yet very quiet.", "title": "Great Experience", "helpfulness": 3, "user": "P J", "date": "September 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 176305199}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "Our room was very nicely decorated, and the staff were extremely friendly and helpful.", "title": "Feels like home, warm and inviting", "helpfulness": 3, "user": "Traveller13Calgary", "date": "September 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 175797466}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "No problem with language, as they spoke fluent English. We would highly recommend this property!", "title": "Outstanding Experience", "helpfulness": 3, "user": "Patrick E", "date": "September 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 175603404}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "Great little hotel with friendly and helpful staff. Located in a quiet street with plenty of good restaurants in the vicinity. It's not in a night life district but is easy walking to the main monuments! Quaint little bar area and beer garden.", "title": "A Gem", "helpfulness": 2, "user": "John_Swanbourne", "date": "August 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 174650932}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled with friends", "text": "This a boutique hotel not a big place. For individuals and familys that like this type of hotel, it is nice. The staff was friendly and we enjoyed the breakfast selection! The location was perfect, great shopping location and close to the metro station. It was a good find.", "title": "Great Place and Great Value", "helpfulness": 2, "user": "picazo31", "date": "August 23, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 173647118}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled on business", "text": "We chose it because of the location was promising. It turned out to be better that we could have ever expected. A short walk to the major tourist sites, a convenient taxi ride to the business centre, excellent dining options within a few minutes’ walk, and a convenient Metro station. The establishment is elegantly decorated. The rooms are tastefully appointed, large in the European context, and comfortable. Breakfast is generous. Yet all this pales in the light of the staff, it would be hard to pick an area that needs improvement. We were provided with assistance in every manner that would make our stay more enjoyable – restaurant options, booking reservations, and arranging airport transportation. It wasn’t just delivered, it was volunteered. The area is beautiful and quiet with excellent restaurants. Steps from the shaded river walk and Eiffel Tower. It might look pricey, but it is full value for the money. If you are seeking the complete Paris experience, look no further.", "title": "This hotel has everything", "helpfulness": 2, "user": "tomnpatti", "date": "August 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 172585934}, {"rating": 2.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "The price has gone up but the hotel is really dated. The value is no longer here which is why I rate this poor. But even at less than this price, it is merely adequate. This was one of our favorite hotels from 10 years ago and remains good in that it is a terrific location, easy access to many sites. As usual, the suite we had was large but the Asian theme bedspread matching wallpaper matching couch, was so old I didn't want to sit on anything.", "title": "It hasn't changed in 10 years, and I write this not in a good way", "helpfulness": 2, "user": "MSBall", "date": "August 15, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 172305242}, {"rating": 5.0, "stay_parameters": "Stayed August 2013", "text": "The washroom is tiny with a separate water closet for the toilet. Toiletries are poor quality, an ancient looking hairdryer fixed to the wall. There is a request to recycle but no recycle boxes provided. The AC was ridiculously loud - impossible to sleep with it on, impossibly stuff with it off.", "title": "Great", "helpfulness": 1, "user": "Daniel B", "date": "August 14, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 172287588}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "What a treasure. The perfect boutique hotel. Great location, very very clean, wonderful, friendly, and helpful staff. Start the day with wide assortment for breakfast then walk to the Seine to catch Bateaubus and you are on your way to seeing Paris!", "title": "Treasure in Paris!!", "helpfulness": 3, "user": "Susan209", "date": "September 3, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "location": 5.0, "service": 5.0}, "id": 175573094}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "My husband found the Chambiges Elysées quite by accident online and selected it for our Paris getaway. After our stay in August, I was tempted to keep this little gem a secret, but travelers really should know about how wonderful it is. The Chambiges Elysées is nicely situated on a quiet side street just off the chi-chi shopping of Ave. Montaigne (metro: Alma Marceau or FDR) in the 8th arrondissement. The hotel is tidy and well-appointed with a charming traditional interior, and a melange of colorful fabrics adorning walls and upholstery. The hotel staff is uber helpful and happily goes the extra mile for guests. Our standard room and bath were right-sized and very comfortable. The breakfast room downstairs had nice serve yourself café au lait and an array of continental breakfast items (plus cheeses, fruit, dried meats, and cereals) and the small bar a côté was nice for an apero before heading out for the evening. From the hotel, it was an easy walk to the Seine, Eiffel Tower, museums, shops and restaurants. I highly recommend this hotel for a fun Paris getaway, and plan to return as soon as time permits.", "title": "Sshh- is it too late to keep this one on the down low?", "helpfulness": 3, "user": "Baret W", "date": "September 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 175568400}, {"rating": 3.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "We stayed at this hotel last month. Overall experience was good..staff is very helpful. Rooms are very small and the hotel has this suffocating feel. Location is great.....hotel is definitely way overrated. If you want to stay here get ready for claustrophobic and warm hallways...they do not believe in having ac's in common area's except the lobby. Rooms are very small by any standard (we have stayed in three hotels in Paris in last two months). Just for everyone to know again a very overrated hotel...if you are going to stay here based on TripAdvisor reviews, get ready for a shock.", "title": "Average hotel...Overrated reviews", "user": "dreamschem", "date": "September 3, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 2.0, "sleep": 1.0, "rooms": 2.0, "location": 5.0}, "id": 175496186}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "We stayed here in August for two nights, and our experience was first rate. We had a nice greeting, and the room (for three) was spacious and clean. We had no problems at all during the stay. We breakfasted out so cannot comment on quality etc. Great location - 20 mins walk to Eiffel Tower and in the other direction Arc de Triomphe. Metro about 10 mins walk away.", "title": "Great location Hotel in Paris", "helpfulness": 2, "user": "batheyedoc", "date": "September 1, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 175155468}, {"rating": 5.0, "stay_parameters": "Stayed August 2013", "text": "We found this lovely, fairly small hotel through our travel agent. After a long overnight flight we arrived at the hotel late morning and our room was ready and waiting for us! A very easy check in, we quickly unpacked and set out for our first day in Paris! We found that we were staying in a perfect location. On a very narrow quiet side street but within walking distance to a very upscale shopping area including the likes of Dior, Jimmy Choos, Henry Winston and the list goes on! Had lunch overseeing all these stores and then had a lovely stroll to the Arc d'triumph! Going in a different direction that evening ate a little cafe facing the Eiffle Tower, watching it sparkle and light up before a walk along the Seine. Many little cages in every direction we walked!", "title": "Who said European hotel rooms are tiny ??", "helpfulness": 2, "user": "trudy s", "date": "September 1, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 175080631}], "location": {"country": "France", "region": "Ile-de-France", "continent": "Europe", "city": "Paris"}, "stars": 4, "variance": {"poor": 6, "average": 8, "very good": 76, "terrible": 9, "excellent": 237}, "aka": "Hotel Chambiges Elysees", "slim_ranking": 0.0217512548801, "description": "Pleasant 5-story Hotel, housed in a turn-of-the-century building."}