{"user_rating": 4.0, "review_count": 123, "name": "Chameleon Backpackers Hostel", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "We stayed here 3 times during a trip earlier this year. The place is very well run, with comfortable rooms, decent internet and all the facilities that a traveller would need, as well as a fantastic kitchen. Only thing I would say is that the drains smell a bit in a couple of the downstairs rooms (Kudu and the ones either side). If they haven't fixed this, then ask for an upstairs room - the smell became a little bit opressive when we were there! Despite that, this a great place and very good value too.", "title": "Reliable choice in WIndhoek", "user": "Dom-n-Lin", "date": "September 21, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 43298352}, {"rating": 5.0, "title": "The backpacker place to stay in Windhoek without question", "text": "Really great place to stay. Very friendly and knowledgable staff, who always go out of their way to help and make you feel welcome. It's also very secure and environmentally concious. It has good facilities and is very convieniently located near the city. I have stayed there a few times now for those very reasons. Infact the owner and staff treat you like one of the family. Highly recommended!!", "user": "JBStillalive", "date": "September 3, 2009", "id": 39657363}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled on business", "text": "We have been in Namibia and surroundings for almost 8 weeks performing work for our Swedish university. We have stayed at several different places and slept in everything from tents to, well at least semi-luxurious lodges. Our base during this time has been Chameleon in Windhoek and I can honestly say that no other place has been able to compare to the atmosphere we found there. Nice people, lovely staff, the rooms are great value for what you pay. Everytime we've come back from one of our field trips it has felt like we are really coming home when coming to Chameleon. I would recommend anyone coming to Windhoek to stay there.", "title": "A true home away from home.", "user": "JonnyStockholm", "date": "September 3, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 39651340}, {"rating": 5.0, "stay_parameters": "Stayed September 2009", "text": "I was here for 4 days and I really enjoyed my stay! The staff is extraordinary friendly and helps you with all problems/questions. The central location and a shopping center a few walking minutes away makes it even more attractive.", "title": "best place to stay in Windhoek", "user": "nana0701", "date": "September 3, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 39650192}, {"rating": 2.0, "stay_parameters": "Stayed October 2006, traveled with friends", "text": "I can definitely recommend the hostel!", "title": "Good Hostel - bad service", "helpfulness": 1, "user": "Mettigel", "date": "July 19, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 3.0, "service": 1.0, "rooms": 3.0}, "id": 35148416}, {"rating": 5.0, "stay_parameters": "Stayed December 2008, traveled as a couple", "text": "EXCELLENT PLACE... Great facilities, awesome fully-equiped comunal huge kitcken, beautiful swimming pool and cool bar, very useful parking space, etc, etc.They provide all the services the travellers need and the staff is so nice. They care a lot about the environment. And the Elephant Room is perfect! Also, CHAMELEON HOLIDAYS AND TRAVEL, the travel agency (which is into the hostel) offers a superb service. We want to thank very specially DALENE HANSEN for making things so easy for us... We had a perfect 10-day self drive trip into the country... Dalene put all the pieces together for us and everything went PERFECT. She, Jules and Nascimento make a great team! We couldn't be any happier with this trip :)", "title": "Highly Recommended!!", "user": "MarianaARG", "date": "January 13, 2009", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 23520547, "likes": {"liked": "— Everything.", "disliked": "— -"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2006, traveled with friends", "text": "I really enjoyed staying at Chameleon after the desert trip they organised. We had a large room, with two single beds and a large bathroom. It was all very convenient, with nice African design.", "title": "Nice backpackers hostel", "user": "Marlies84", "date": "November 17, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 21926751, "likes": {"liked": "— the nice large room"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled solo", "text": "The hostel is located quite close to the center of Windhoek, you can walk the distance.", "title": "Chameleon Rocks! Best backpackers in Windhoek by a longshot!!!", "user": "happylittlecamper", "date": "November 4, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 21536885, "likes": {"liked": "— Great atmosphere, cute dogs, clean and friendly"}}, {"rating": 3.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "As I said we also did a tour with them (to sossusvlei), that was really great! I can recommend staying with them and doing a tour with them.", "title": "Ok accommodation, so-so customer service", "user": "Dekoven", "date": "April 28, 2008", "detail_rating": {"front_desk": 1.0, "business": 2.0, "service": 1.0, "cleanliness": 4.0, "value": 2.0, "location": 4.0, "rooms": 2.0}, "id": 15431030, "likes": {"liked": "— It was cheap!", "disliked": "— Customer service."}}, {"rating": 3.0, "stay_parameters": "Stayed May 2007, traveled solo", "text": "I am doing an internship in Windhoek, and have been staying at Chameleon for a while now. Not to be too cliche, but it really has been a home away from home for me. This is by far the best backpackers in Windhoek, and I have tried them all!", "title": "Ok Place", "helpfulness": 1, "user": "Allan57", "date": "May 22, 2007", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 7673359, "likes": {"liked": "— clean and tidy", "disliked": "— the internet"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2004", "text": "This is one of the best backpackers I've ever stayed in. Nice people, great atmosphere and cute dogs :-) Clean rooms and good service. I stayed there for almost two weeks and if I ever go back to Windhoek, I'll defenitely stay at Chameleon again!! I went on their safari-tour in Etosha and that was also a lot of fun!", "title": "Home away from home", "helpfulness": 1, "user": "Lille-Ti", "date": "December 18, 2006", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6457518, "likes": {"liked": "— Nice staff, clean, reasonable price", "disliked": "— only one internet access"}}, {"rating": 2.0, "title": "Great rooms, bad service", "text": "This place has fantastic private rooms, very clean, very neat and beatifully decorated! Parking is a problem, so is directions to get there, in a city where the streets have been changed and staff cannot give directions over the phone. A pity also they employ rather incompetant front desk staff and that the female owner is rather unfriendly. A good backpackers to us need to have a good balance between clean, safe facilities and good, friendly staff. Making guests feel unwelcome and providing incorrect information is not a way to keep business. Untill this changes at Chameleons I would not recommend anyone to stay there. Getting hold of them by telephone also proved very difficult - we were told at arrival that we should have emailed them. This is Africa, the best place in the world to me, but a place where getting hold of reliable email is still difficult!! Come on, they should know that, you cannot run a business on email only. Especially if their own email does not even work well!! On our arrival several other guests were getting very irrated because the email at Chameleons was not working. The next morning I experienced the same problem and after struggling for 10minutes to try and get into google, gave up.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "June 15, 2006", "id": 5350001}], "location": {"country": "Namibia", "region": "Khomas Region", "continent": "Africa", "city": "Windhoek"}, "variance": {"poor": 6, "average": 11, "very good": 55, "terrible": 3, "excellent": 48}, "aka": "Chameleon Backpackers Hotel", "slim_ranking": 0.152173913043}