{"user_rating": 5.0, "review_count": 86, "name": "Chanticleer Guest House", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "My husband and I received a gift certificate to this establishment. Little did we know just how great it was. Beautiful, quiet, and serine. Two days was not enough. We stayed in one of the cabins that was like home. Decorated very tastefully and immaculate. The grounds are just beautiful. Darin and Bryon are great inn keepers very warm and attentive but not obtrusive at all. I could live in those cabins Breakfast was tremendous. Homemade every morning. Don't second guess this place. A must stay. We will be back.", "title": "Amazing destination", "helpfulness": 1, "user": "iceal", "date": "May 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 161742821}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "My husband and I stayed May 4-5, 2013, at the Chanticleer. I booked the reservation as a suprise gift for my husband's birthday. It was a wonderful stay as per usual!", "title": "Favorite B&B!", "helpfulness": 1, "user": "Melanie M", "date": "May 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 159790539}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "When I first booked the room, I accidentally reserved Saturday and Sunday instead of Friday and Saturday online. I sent an email and Darrin quickly replied and switched the dates for me with no problems whatsoever.", "title": "Absolutely perfect!", "helpfulness": 2, "user": "Marti-and-Tim", "date": "March 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 155097170}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "Because this stay was for my husband's birthday, I wanted to have something special waiting in the room for him when we arrived. Again I emailed asking about options, and Darrin responded with the list of packages they have available, but also mentioned that if none of those suited my needs, that he could work on something else for me. As it turned out, none of the options were quite right, so I did request a slight change. Darrin was more than happy to help out. He had champagne and several different types of fudge from a shop in Sturgeon Bay waiting for us when we arrived - yummy!", "title": "Still Amazing After All These Years!!!", "helpfulness": 1, "user": "David R", "date": "February 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 152556343}, {"rating": 5.0, "stay_parameters": "Stayed December 2012", "text": "When we checked in, Bryon promplty showed us to our room and scheduled our breakfast for the next morning.", "title": "Amazing weekend!", "helpfulness": 1, "user": "BuddyMom", "date": "December 15, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 147500585}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "My wife and I stayed here for our Honeymoon back in May 2011. Great place, nicest I think Ive ever seen. Breakfast was great, staff was helpful. Sheep grazing in the pasture! Just Gorgeous. I looked at a lot of places online to find that perfect atmosphere and I chose this one because they have a strict no child policy and was so secluded we knew it would be remote and quiet. It was great to get out of town, discover, then come back and chillax!", "title": "Super comfy and cozy", "user": "Yourflyisdown", "date": "September 21, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 140856806}, {"rating": 5.0, "stay_parameters": "Stayed September 2012", "text": "The Chanticleer is a gorgeous property. We stayed in the Stables Suite which was huge, and had an incredible view. All the details are thought of - warm, homemade cookies in the afternoon, fireplaces and jacuzzi tubs in the room, walking trails, gardens, and sheep pastures all around. Brian & Darrin were fabulous hosts - they made us feel very welcome and immediately secured dinner reservations at the Whistling Swan, upon our arrival. Our dinner was incredible - one of the best we've had.", "title": "Amazing property - very beautiful & relaxing", "helpfulness": 1, "user": "emilyhg", "date": "September 16, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 3.0, "service": 5.0, "rooms": 5.0}, "id": 140422455}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "The only downsides are the location - we spent a lot of our time further north in Fish Creek and Egg Harbor, so it would have been nicer to be closer to the action. Also breakfast was delicious but not as impressive or hearty as some other B&Bs I've been to.", "title": "A little piece of Paradise", "user": "wisconsinjamericans", "date": "September 4, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 139432727}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "Overall, I'd give this place 4.5 stars and would definitely return for a romantic, relaxing, weekend away!", "title": "Amazing", "user": "Kimberly P", "date": "August 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 138010438}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "We have stayed Chanticleer for the past 3 summers and we love it. We rent the 2 bedroom cabin that is so beautiful I want to live there...forever. From the cabin itself to the linens everything is top notch. Fully equipped kitchen if you want to bring some steaks and grill out on the deck. PEACEFUL! I can not imagine anyone not loving this place. Very close to Sturgeon Bay if you want to go shopping and into the Door as well. Yet this is a bit of heaven and a much needed weekend of relaxing. The breakfasts are great and if you are in the cabin you can request a time to pick up your \"basket\". I hate to tell people about Chanticleer, because I want to make sure there is an opening for me when I want to go!", "title": "Wonderful, relaxing stay", "user": "Readyfornexttrip", "date": "August 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 137833356}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "We were looking for a cozy and quiet two night get-away and we cetainly found it. The room was very cozy and having a whirlpool tub to relax in on a chilly off-season night was a welcomed change of pace. Chanticleer has very easy access to downtown Sturgeon Bay, just a couple of minutes away, and although it is at the south end of the peninsula, we did not find it to be a problem at all. Our stay was \"off -season\" and there was no traffic, so I imagine the experience may be a different one in the height of the summer. Every restaurant we went to had Wisconsin sized portions, but somehow I managed to also down a few of the freshly baked chocolate chip cookies that the hosts leave for guests, no matter how much I just ate.", "title": "Great way to spend a Holiday Weekend", "helpfulness": 1, "user": "BCRS", "date": "December 2, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 146653625}, {"rating": 5.0, "title": "Thank You!", "text": "Our bed was nice and soft - and comfortable, despite the fact that we prefer a firmer bed. We slept well. And the area is SOO QUIET! We were more concerned not being able to sleep in such silence without an occasional police siren screaching by as we are used to!", "helpfulness": 1, "user": "tammy g", "date": "November 18, 2012", "id": 145682251}, {"rating": 1.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "I would recommend staying here and would certainly return!", "title": "WARNING, Reservation fine print ripoff", "user": "GR F", "date": "November 12, 2012", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 1.0}, "id": 145234002}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "We just came home today from our weekend at Chanticleer. I just wanted to say Thank you so much for a great stay. We are already checking our schedules to come back in October. Darrin came to greet us when we arrived. He was so nice and made us feel right at home. We also got a chance to meet Bryon and he too was very personalble. We stayed in the Granary Suite and it was so cute and cozy! Our breakfast every day was delicious and was very neat to recieve it to our room in the basket. We for sure will be recommending a stay at Chanticleer to all our friends and family. Thanks again! We cant wait to come back!", "title": "Love this place during the Fall", "user": "Miki O", "date": "October 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 143492623}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "We did not stay at this Inn. We made reservations to stay for our anniversary, but were unable to follow thru on our reservations due to other events in our life. We made the reservation on a Saturday. We tried to cancel on a Monday but were told the fine print upon making the reservations would cause us to forfeit half of the room rate. What a scam this place is. I tried reversing the charge with my credit card but they had us dead to rights with there fine print on the web site. So we ended up paying half the room rate, they are not cheap, for nothing. We will never stay at a place that uses unreasonable tactics to scam customers. I will never recommend this place to anyone. WARNING go elsewhere.", "title": "Lovely", "user": "uwred1", "date": "October 7, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 142257444}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "This is the best bed and breakfast we have stayed in. The rooms are huge (we stayed in the stables) decorated in antiques and super clean! The property is huge where you can walk through the woods on trails that they have made, they have beautiful landscaping, and is so peaceful and relaxing. The breakfasts are hand delivered to your room in a beautiful wicker basket and are so delicious and all homemade. Bryon and Darrin have done a fabulous job, we can't wait to come back! Thanks for such a fantastic stay on our vacation!", "title": "Romantic, Awesome place to stay", "user": "Carla1782", "date": "August 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 137764212}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with friends", "text": "Large comfortable room, warm inviting atmosphere, exceptional breakfast and warm chocolate chip cookies in the afternoon. What more could one want for a relaxing vacation? Well maybe a stroll along one of the two wooded trails or a bike ride on a quite country road. Perhaps napping while floating in the heated pool or just laying pool side while being warmed by the sun. Whatever your idea of a relaxing vacation you will find it at Chanticleer. I can't wait to get back again next year.", "title": "Relaxation to the Max", "user": "CityNights", "date": "August 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 136892092}, {"rating": 5.0, "stay_parameters": "Stayed August 2012", "text": "Very nice private cabins. Everything was very clean. The gentleman running the place where very nice and helpful. We will definitely come back when we can stay longer. Interesting breakfast, just not my cup of tea though.", "title": "Wish we could have stayed longer", "user": "the2travlers", "date": "August 5, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 136311495}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "Wonderful property, stayed in the Tamarack cabin for our honeymoon and we were blown away. Absolutely loved the quiet, private, feeling in the middle of the woods the cabin provided. The staff was first class, available to help with any issues ( our key did not work when we first checked in!) and also give pointers are where to go to eat and see. Not being bed and breakfast people we were a bit leery on how the stay would be but, we cant say enough about private nature of the property. You can check in get your breakfast each morning and other then that be left alone to do your own thing. The cabin had a fully stocked kitchen and a gas grill on the porch we were able to dine out or make a home cooked meal depending on how we felt. Cant wait for our next visit!", "title": "Quiet Oasis", "user": "Brmech", "date": "July 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 134837310}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "Wow, booked our next stay already! Evergreen Cottage was spectacular. I am in love. Went here for 2 nights and we couldn't have wished for a nicer stay. The pictures of our cabin were nice, but when we got there, we were blown away.", "title": "First class vacation in every way possible.", "user": "Dudesmommy11", "date": "July 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 134517727}], "location": {"country": "United States"}, "variance": {"poor": 1, "average": 1, "very good": 6, "terrible": 2, "excellent": 76}, "aka": "Chanticleer Guest House Hotel", "slim_ranking": 0.190476190476}