{"user_rating": 4.5, "review_count": 3258, "name": "Chancellor Hotel on Union Square", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "My husband and I stayed at the Chancellor in December and had a wonderful experience! It was our honeymoon and they were nice enough to give us champage to celebrate! The location is fantastic and Union Square has so much to see and do. The beds were really comfortable and the service from all hotel staff was great. The only downside was one night we wanted to have a drink in the lounge but they had to close early. However there were plenty of other places close by so it was not a big deal. Overall this hotel is a great value and we will stay here again when we come back to San Francisco.", "title": "loved the Chancellor", "helpfulness": 3, "user": "jamimarie13", "date": "January 3, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 12298762, "likes": {"liked": "— location and staff"}}, {"rating": 5.0, "title": "excellent location, pretty quiet, nice staff", "text": "I've stayed at the Chancellor 2 or 3 times, and it has become the place I stay when in SFO. The attractions are in order of attactiveness: location, staff attitude, quietness. The location works for most of the Market/business dist area and I stay here for Moscone conferences as well. The place is consistently well staffed by people who notice you and ask if they can help in a proactive fasion. The rooms are a bit small, but that's what you get with an older property. And with an older property you also get more solid and quiet construction. I found most of the fixtures in the room of higher than average quality. Everything worked in my rooms there. There is no exercise equipment there, but I never care in SFO since it's a walkers paradise. While the property itself doesn't have some of the things I usually associate with an excellent rating, the location and value of this hotel combined with the consistent service level propels to this level.", "helpfulness": 5, "user": "casezz", "date": "December 31, 2007", "id": 12155623}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "My husband and I stayed here for 3 nights over the Christmas period and had an excellent stay. We originally booked on the strength of the previous reviews and the very reasonable price we got (including parking), not to mention the great location a stone's throw from Union Square, the trolley stop and loads of shopping. We were not disappointed.", "title": "Brilliant hotel!", "helpfulness": 5, "user": "JessV", "date": "December 30, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 12094874, "likes": {"liked": "— the location and comfy bed", "disliked": "— honestly can't think of anything - it was a great stay"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "The hotel itself is attractive, clean and recently renovated. Our room was on the small side, but this wasn't a problem - it was well appointed and had a very comfortable bed. The staff were extremely friendly and helpful and the little bar in the lobby was great to grab a quick night cap after a long day out! The free popcorn and freshly baked cookies were also a nice touch.", "title": "A little gem in busy Union Square", "helpfulness": 5, "user": "Brit_Abroad3", "date": "December 29, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 12046786, "likes": {"liked": "— location and price", "disliked": "— Nothing - got exactly what we were expecting (in fact slightly more)"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2007", "text": "All in all, a gem of a hotel and definitely recommended.", "title": "A wee gem", "helpfulness": 3, "user": "Belali", "date": "December 29, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 12031357, "likes": {"liked": "— Genuine staff and friendly atmosphere", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled on business", "text": "An excellent value for what it is - a three star hotel. Though the rooms are a bit small and showing their age and the lobby a bit utilitarian, the Chancellor works hard to provide four/five star amenities in the room (iron, safe) and lobby (cookies, concierge, etc.). Great location. I recommend the hotel room and parking 'bundle' - very convenient. Strictly self-service which I prefer. Check in, check out, delivery of the car all handled perfectly. I probably would not stay there with my family, but I would definitely stay there again on my own.", "title": "Excellent Value for Business Traveller", "user": "APM617", "date": "February 3, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 6738586, "likes": {"liked": "— location, price"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "With a selection of pillows, a great location, friendly staff and an amazing price, we were completely happy with everything about this hotel... except that it's in San Francisco. Ah well, you can't have it all.", "title": "Even Captain America and Spiderman would stay here", "helpfulness": 3, "user": "Quixotic", "date": "February 1, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 6726202, "likes": {"liked": "— The location", "disliked": "— Being surrounded by hippies once I left the hotel."}}, {"rating": 4.0, "title": "Wonderful Stay, Great Staff", "text": "My wife and I stayed their after a business meeting I attended in San Jose, CA. A friend suggested this hotel and she described it perfectly. Great Location, Clean Rooms, and Friendly knowledgably staff. We are not interested in getting caught up in the tourist traps of the city. The staff knew exactly where to send us for some Great Meals. Thanks", "helpfulness": 2, "user": "EndoEastProvidence", "date": "January 30, 2007", "id": 6717566}, {"rating": 4.0, "stay_parameters": "Stayed February 2006, traveled with family", "text": "T. Thompson, Rhode Island", "title": "Great!", "helpfulness": 8, "user": "travelbuggedtony", "date": "January 27, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 6705128, "likes": {"liked": "— Everything", "disliked": "— Nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2006, traveled on business", "text": "I have stayed at the Chancellor on 2 occasions, the last being Feb 2006. I would like to say that I think this hotel is really good. The rooms are kept very clean, nice and bright, beds are comfortable too. This hotel enjoys a great location on Union Square for everything. Very convenient to catch the cable car too. Yes this hotel is old and in my opinion its kept very well by all the staff. The breakfast is excellent in the restaraunt and I can particularly recommend the daily fruit shakes! waiter was also very friendly. There is really only one thing that was slightly annoying.. on my second visit there, after checking in we went to our room and after 45 mins our luggage did not arrive! I called the front desk and was told they were on their way... after a further 30 mins I went down to reception only to find them in the same spot that I left them, right by the front desk so I took them up to the room myself. A minor point I agree, however it was pouring with rain in San Francisco so we were wet and really needed a change of clothes, otherwise I would not have minded this but there was no apology given whatsoever. Besides this, I would have no hesitation in staying here again on my future visits to SFO. Thanks... manager and staff do a great job - keep it up!", "title": "Expect Some Quirks and You'll Be Fine", "helpfulness": 6, "user": "beastbelle", "date": "January 26, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "rooms": 3.0, "location": 5.0}, "id": 6699606, "likes": {"liked": "— Value", "disliked": "— Small room (but I knew it would be)"}}, {"rating": 2.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "While the location was fantastic and the hotel workers were friendly and helpful, the cleaning products they were using in the hotel rooms could strip paint off an aircraft carrier. Seriously, they were using some sort of scented carpet powder or the like when cleaning the rooms and it immediately caused headaches for the two of us. We really weren't in a position to search out another room in town so we opened the windows, turned the ceiling fan on full blast and kept up the \"don't make up this room sign\" our entire stay. I would easily recommend this hotel if it wasn't for the head-splitting experience.", "title": "Watch out for cleaning fumes", "helpfulness": 3, "user": "moneywrangler", "date": "June 19, 2012", "detail_rating": {"value": 4.0, "sleep": 3.0, "location": 5.0, "service": 3.0, "rooms": 2.0}, "id": 132310124}, {"rating": 5.0, "title": "Perfect location", "text": "When I reached out to the general manager, he said that usually they usually were able to deal with guest's idiosyncrasies...a term that I took offense with. No one should have to put up with obnoxious cleaning fumes in their rooms. Earlier I had approached the front desk for a solution, was offered none except for a quip by the desk clerk who said that her boyfriend would be unable to stay at the hotel because of the cleaning products.", "helpfulness": 1, "user": "J V", "date": "June 19, 2012", "id": 132284428}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled on business", "text": "Hotel accommodated our needs completely. Staff was very congenial and approachable. They greeted us each time we returned to the hotel and were extremely helpful and friendly. Room was comfortable and location made access to sights and BART very easy. Looking forward to our next visit. Will definitely stay at the Chancellor again.", "title": "very nice room & excellent value", "helpfulness": 2, "user": "walkerbob", "date": "June 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 132257574}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "This is a great hotel in almost every aspect. The location is excellent -- easily reachable from the airport on BART, convenient to Market Street, Union Square, and Chinatown, and with dozens of restaurants in close proximity. The rooms aren't large (think European) but very well furnished, with a small desk, table, and chairs. The bathroom has a nice set of amenities, and the walk-in closet is huge. Moreover, the room has free wireless Internet, and the lobby always has free coffee, tea, and cookies. Very nice room, and excellent value!", "title": "Excellent location", "helpfulness": 1, "user": "sophPerth", "date": "June 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 132145138}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "Very spacious room, with internet, complimentary water, coffee and tea and cookies in the lobby. clean neat and comfortable bed, we arrived midnight after a long flight of 26 hrs from australia and found front room on Powell street noisy. We asked to be moved and without any problem we were moved to a back room, our luggage moved for us when room was available, so we got on with our day. Lovely bath with bath salts as a bonus. Great margaritas at happy hour, however the breakfast can definitely be improved. We had a wonderful breakfast next door at sears restaurant, it is a must !", "title": "The Best Hotel in San Francisco!", "user": "bTucker93940", "date": "June 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 132060810}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled on business", "text": "We found many positive reviews of the Chancellor on Trip Advisor.com and, along with the price, this enticed us to skip out of the conference hotel (Nikko) and try this family-owned hotel. The location cannot be beaten being just a few steps north from Union Square and across the street from a cable car stop. The staff was very friendly and helpful. We especially enjoyed the bartender/server in the small but well-stocked bar. There seemed to be some local regulars that stopped in and despite the small space, it was a lovely place to have drinks before heading out to dinner. The drinks too were incredibly reasonable in price which brought us back each afternoon. We ate breakfast two of our three mornings and enjoyed delicious omlets and eggs benedicts for again a very low prices compared to other hotel breakfasts. The rooms were small (to be expected in an old hotel), not alot of excess space to move around in but it was clean and quiet. As we were on the go alot, this simple place to come back to from a day out sightseeing, shopping, and conferencing was just fine. Be sure, if you are used to chain or luxury hotels, the Chancellor might initally make you think you are going to be roughing it but rest assured, you'll enjoy your time there. We definitely will be staying there on future visits to San Francisco.", "title": "The Chancellor was friendly, convenient, and perfect for a visit to SF spent on the go.", "user": "foxhunterbear", "date": "March 21, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 101044370}, {"rating": 4.0, "stay_parameters": "Stayed February 2011", "text": "Stayed here 2 weeks ago, fantastic location of Union Square, booked thru Trailfinders, staying 5 nights but only paying for 4.", "title": "Fantastic location and value", "user": "SittingbourneOwl", "date": "March 5, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 98989792}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "Check in was very efficient and quick, stayed on 5th floor with a Powell Street view, didn't find it noisy , great view of Union Square saw the Chinese New Year parade.", "title": "Enjoyed our stay at the Chancellor hotel - good location, clean and comfortable.", "user": "Renata1947", "date": "March 3, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 98767320}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled with friends", "text": "Room was on the small size, maybe needs a lick of paint, but it was still good, bathroom was definitely bijou but it had the deepest bath I've seen!", "title": "A wonderful gem in an excellent location", "helpfulness": 1, "user": "blutoes", "date": "March 2, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 98723738}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "Staff were very friendly, even the overnight front desk staff who I bumped into every morning when I went running, the lobby didn't seem crowded, didn't use the bar and restaurant, but the gift shop was very helpful, it is where you can buy Muni ticket and also book your ride to the airport.", "title": "Classic boutique hotel and a great value.", "user": "oldteacherFl", "date": "March 1, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 98477690}, {"rating": 4.0, "stay_parameters": "Stayed February 2012", "text": "A great small hotel right in the centre of union square, close to all the great shops ,trams running past outside.I have never been to a hotel before which has a pillow menu or umbrellas in the rooms.the staff were exceptional here as we had to organise faxs and so helpful,wonderful free cookies and coffee in the mornings,great value for money,will have to come back", "title": "Great location", "helpfulness": 2, "user": "f00dmama", "date": "February 7, 2012", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 124275745}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled on business", "text": "I had the unique experience of staying at the Chancellor Hotel in San Francisco, California. All I can say is WOW! I was sent to San Francisco for training. I am not a traveler. I rarely leave home without my husband. SO it was quite a surprise to me when my Boss said I would be going away (by myself) for two weeks, possibly 16 weeks I know nothing about big City living and I was scared. I went to The Chancellor's website to see what was available. There was a link to contact the manager so I did. I mentioned that I would be in the City alone and that I was afraid. When I checked in I got a big surprise as I was upgraded to a SUITE on the 15th floor! The Room was beautifully charming. It is not a brand new hotel but a cozy and historic building from around 1914. The bed was comfortable. The pillows were wonderful. They even have a pillow menu where you can order up what ever type of pillow you are used to sleeping with!! Rooms are very clean and updated with new and trendy furniture. The bathroom has a very deep bath tub which was perfect for taking hot baths after a long days work. Shampoo, conditioner, lotion, cotton balls and even Q-tips are provided. For my second week at the hotel (I went home on the weekend) I did not have the SUITE.. However, I was given a room on the 15th floor that was equally as cozy and comfortable. Since I was staying for 5 days and wanted to have cold waters, I called down to the front desk and asked if they had a refrigerator that they could bring to me. They brought it up right away! Both rooms that I stayed in had a beautiful view of Union Square. I felt safe to walk around this area. This Hotel is in the Heart of things. You can easily catch a taxi or any other public transportation by just stepping outside of the building. The Staff was extremely friendly. The facility was very clean. The elevators were fast. The bar is small but I had a great time talking to other hotel guests and the Awesome Bartender named Alicia. She made me feel comfortable and even gave recommendations on things to do in San Fran as well as places to eat if I had craving for certain foods. They even have a plug underneath the bar to plug in your phone :) I thought that was cool!! Oh, there was a walk-in closet in both of my rooms. In the closet there was a safe where I kept personal items. Lastly I want to say that this hotel is VERY AFFORDABLE! I will be returning to San Francisco and when I do... I will be staying here at The Chancellor! If you want to experience the charm of San Francisco, you will stay here....", "title": "A True Gem! San Francisco Charm... WOW!", "helpfulness": 4, "user": "VivianMc", "date": "February 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124183890}, {"rating": 2.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "The Chancellor is rather tired looking, we asked for a quiet room and were on the top floor, 15th. Our room was in need of decoration and to get into the room we had to squeeze in and out of the bathroom which was just inside the door. At 3am every morning a strange knocking noise could be heard and at 5am there was a clanging noise which may have been a water or heating system. We mentioned these noises to the management who said nothing could be done. The staff in the breakfast room were offhand and not particularly helpful. My husband had a duvet cover with a hole in it. We booked a tour through the hotel to Yosemite which, for various reasons, was very unsatisfactory. All in all it was a very disappointing stay and we couldn't really recommend this hotel.", "title": "Disappointing", "helpfulness": 2, "user": "Llijyram", "date": "February 6, 2012", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 2.0, "sleep": 2.0, "rooms": 2.0, "location": 4.0}, "id": 124181655}, {"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled with family", "text": "Trying to find a hotel for our stay in San Francisco was a nightmare, I finally settled on the Chancellor Hotel, it was a good choice, it’s a little old fashioned and that gives it character, service was good, rooms clean. Here’s a tip, breakfast time the hotel provides coffee, tea and lovely soft cookies FOC in reception, that really helped get the day started. Location wise its right on Powell Street, walk to the bottom of the hill and you can get the tram to the piers, the tram does stop right outside the hotel, but you’ll be lucky if you can get on there with a family. Again, down the hill is Macys store with its roof top cheese cake restaurant/café which we visited twice LOL. The start of China Town is just up the hill to the right on California Street. There are a couple of eateries nearby on Powell Street, a couple of independents and two Lories Diner’s one up the hill, one down the hill, all were fine. When it came time to pick up our hire car, I’d pre arranged pick up one block away at the National garage on Bush Street. All in all it couldn’t have worked better and I’d stay at the Chancellor again without a moment hesitation.", "title": "Nice hotel, great location", "helpfulness": 1, "user": "martin_ebdon", "date": "February 5, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 124144168}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "The room was great--We were upgraded to a better room (at no charge). The rooms do not come with a fridge--but just ask! They were more then happy to get one for you. Huge bathtub and yes---there was a rubber ducky. Great value and location. A little noisy on the Union Square side. Jack hammers at 7 am sharp. :)", "title": "Honeymoon Getaway", "helpfulness": 1, "user": "leafygirl", "date": "February 4, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 124110808}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled solo", "text": "I booked the Chancellor Hotel when I decided to add 2 more nights to an already planned trip to San Francisco. I contacted the hotel directly and received a great rate.", "title": "Would Not Hesitate to Stay at the Chancellor Again", "helpfulness": 3, "user": "Mailgirl", "date": "November 25, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 88230009}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled with friends", "text": "I had a corner room on the 12th floor that overlooked Union Square. I had read the reviews of the Chancellor on here and was hoping it would live up to the hype. It did. I did not run into any employee who was not friendly or helpful. And they had answers for every question I asked about the hotel and the area.", "title": "Great location - Everything close by!!!", "user": "Allison062", "date": "November 25, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 88226531}, {"rating": 3.0, "title": "Good location", "text": "My room was very nice. The bed was comfortable and I really liked the tiled bathroom. It's not a modern an new place, it's quaint and historic. I expected the room to be on the small side, but there was plenty of room to move around. And the closet was so big, you could change inside it! And in there was a safe, an electric radiator, an umbrella, an iron & board and extra bedding.", "user": "SophiaDeen", "date": "November 25, 2010", "id": 88181827}, {"rating": 4.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "The first day I arrived, it was pretty warm. I just opened the window and turned up the ceiling fan and the room was quite comfortable. I even slept with the window open and the street noise did not bother me.", "title": "Chancellor Hotel - a great place to stay", "user": "Nathan076", "date": "November 24, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 88133491}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "The free wi-fi was a plus. I did not go to the restaurant or bar. (only because I was not there too long)", "title": "Fantastic location,price and service", "helpfulness": 1, "user": "jwj0909", "date": "November 22, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 87897515}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "I have stayed all over Union Square, and this is a gem! Very quaint and friendly hotel. Rooms with high ceilings, nice bath and great beds. everyone cant stay in a room with a view, but if you can, its a must. The rooms here are much better than the very popular hotel down the street and better than the one across the street. Those hotels have bigger bars and restaurants, but there is something about staying at the Chancellor. You can always walk down the street to the other bar or restaurant. You even get a drink token per day with your stay here. Very nice ;)", "title": "Best stay on the Square!", "helpfulness": 1, "user": "James D", "date": "February 13, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124553867}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "Only drawback is the spa and pool is at a remote place, used as a complimetary feature with health Club around the corner.", "title": "Lovely hotel", "user": "Stansmum4420", "date": "February 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124533355}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled solo", "text": "Stayed at this Hotel on a tour of the west coast of USA. really nice central hotel. A 2 minute walk from the Tram turn. Stones throw from union square, Maceys and Bloomingdales. The breakfast at this hotel was great, lots of choice, plenty of food. I would strongly recommend the steak & eggs, they were lovely. The room was very nice not huge, just right. The bathroom was very clean and the bed was comfy. We felt the price was very very good. two very satisfied customers.", "title": "Decent value", "user": "distractinwanderlust", "date": "February 13, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 124524500}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "Location is great if you want to stay downtown. It's across from the Sir Francis Drake Hotel (known for the Starlight Room). Safe area as it is a busy one, convenient to downtown and taxis, nice staff, reasonably priced (though I got a special deal through hotwire). It's rather outdated but still pretty cute, plus hopefully in SF you're spending more time outside than inside the hotel. Small bar with decent drinks (price and quality wise). Rooms and bathrooms are a bit small so if you have a large suitcase, think twice. 2 small rollers and 2 backpacks in a queen/king bed room were fine.", "title": "Impressive", "helpfulness": 2, "user": "celticolleen", "date": "February 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 124504487}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "I searched quite extensively to find a reasonably priced hotel in San Francisco. Finally decided on Chancellor. I was skeptical because the price was so reasonable, given its location. And I'm quite a picky person so I was prepared to be disappointed.", "title": "great hotel - room could be noisy", "helpfulness": 1, "user": "sun20", "date": "February 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 124340271}, {"rating": 4.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "My husband called the hotel when we changed planes in Las Vegas, and asked their advice re which restaurant we should choose for dinner that evening. They helped us make a good choice and they called and made us a dinner reservation. My luggage didn't make our connecting flight, but when we returned to the hotel that evening, my suitcase had been delivered and hotel staff put it in our room -- it was waiting for me there instead of downstairs at the front desk. Front desk was professional, helpful and competent. Soda, water and snacks were available for a reasonable price, and there were ice machines on every floor. The hotel feels classy and refined, with lots of brass and glass. Classic and tastefully understated decor. I rearranged the chairs in the room to give us a little more space -- but everyone says the rooms in SF are always tiny. Our room was small but not tiny. The bed was very comfortable. I didn't realize that they didn't have king beds, but the queen room we had (for a very reasonable price) was more than adequate. Great mattress and pillows. We didn't feel cramped. We are average sized people. If you are larger, you could request room with two twin beds and possibly put them together for a king? The bathroom was small, but very nice, and had a HUGE tub (no jets). They provided bath salts and I took advantage of a nice hot bath after we returned from walking all over SF for most of the day. No A/C, but we didn't need it. You can request a high or low floor, and you can request a \"quiet\" room. We were on the 10th floor on the back. It was perfect. We had a great view and no noise from the busy street on the front. This hotel is on the cable car line which runs up and down Powell Street. Very convenient. Just walk outside and there is a cable car stop -- you're on your way. The breakfast offered in this hotel was outstanding. Lots of great choices. I had New Orleans Eggs Benedict -- fantastic and fresh! Good coffee and service. Affordable and reasonable. Next door to Sears Inn, which has great swedish pancakes. Easy to get a cab to and from this hotel -- cabbies knew where our hotel was just by providing the name. I can't think of anything negative about this hotel. A great place to stay: great room, happy environment, very convenient location, safe area, close to great restaurants, stores and nightlife. All at a very reasonable price. You don't need to go through all the blind bidding on Priceline.", "title": "A Little Gem in the Center of it All", "helpfulness": 1, "user": "Cyndy305", "date": "February 28, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 98397658}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled on business", "text": "I had an excellent stay at the Chancellor. From the moment I arrived the staff was welcoming and very helpful, and every staff member I encountered during my stay was very polite. The Chancellor was located perfectly for me. A couple blocks from the conference I was attending, right on the trolley car line, close to many restaurants, and a block from the gym that they are connected with rather than having a small workout facility on site. The gym was a nice bonus, as it was close and the staff there treated me like I was one of their members, getting to participate in group excercise classes as well as have full access to the rest of the workout equipment and the pool. The room was comfortable, and I was able to get a good night's sleep each night, and enjoyed trying out some different pillows from their pillow menu. Staff was helpful with giving directions to anywhere I needed to go and they recommended a great restaurant upon request.", "title": "Friendly staff, Great location, Comfortable room, and linked to a full gym", "helpfulness": 1, "user": "S-J-M_93312", "date": "February 28, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 98317402}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled with family", "text": "I am a hotel snob! I was leery of staying at the Chancellor HOWEVER, it was one of the best hotels I have ever stayed in. The staff - fantastic. The location - could not have been better. The atmosphere - great.", "title": "FANTASTIC!!!", "user": "chimakuni", "date": "February 27, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 98292065}, {"rating": 4.0, "stay_parameters": "Stayed February 2011, traveled solo", "text": "We had adjoining rooms, facing Powell Street, on the fourth floor. I was concerned about the noise level from the cable cars - no problems. We were actually able to go out on the fire escape and watch the Chinese New Year's parade.", "title": "Lovely Boutique Hotel - great value and great location.", "user": "wrobbins", "date": "February 27, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 98234841}, {"rating": 4.0, "stay_parameters": "Stayed December 2010, traveled on business", "text": "The shampoo, conditioners and soap were replenished every day. They had souvenir rubber duckies to play in the (huge) tub with and then bring home, gratis.", "title": "All Good", "user": "Mike K", "date": "February 27, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 98169468}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled solo", "text": "Stayed for 6 nights in November in a top floor room away from Powell Street. The room was spotlessly clean, average size and reasonably appointed. Even with the window open there were no noise issues. Rooms have no airconditioning but do have effective ceiling fans which was fine for my stay - sometimes its good to get fresh air! I found the staff to be excellent, friendly and very helpful at all times. I didn't eat in the restaurant, so I can't comment on that.", "title": "Excellent older hotel in a prime location", "helpfulness": 3, "user": "wazbln", "date": "January 19, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 12779298, "likes": {"liked": "— location and the staff", "disliked": "— lack of in room tea/cofee making"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "Overall I have to say the Chancellor is exceptional value, especially given its prime location. I wouldn't hesitate to recommend it.", "title": "Awesome Location!", "helpfulness": 3, "user": "Froggie758", "date": "January 18, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 12767719}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled with family", "text": "We stayed here over the 4th of July after reading the reviews on Trip Advisor and were not disappointed! The location was awesome...close to shopping and great food, the trolley, and within walking distance of the bay. The staff was friendly and the room had just been redecorated and was great. They were still in the middle of renovating the other side of the floor, but we had no noise problems. I would definitely recommend this hotel to anyone!", "title": "Loved our stay at the Chancellor", "helpfulness": 2, "user": "MT1960", "date": "January 18, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 12754975, "likes": {"liked": "— Location, staff, value, charming ambience - everything", "disliked": "— Nothing!!"}}, {"rating": 4.0, "title": "Small rooms but good hotel", "text": "Stayed with family (incl 2 teenagers) for 3 nights in December - fantastic location near Union Square, amazing value and super friendly and helpful staff. Special mention to Susan who helped us with last minute city trip and airport transfer. The place has a really charming ambience and lots of character you will not find at other hotels. It was our best hotel experience during our 3 week trip around the US (and we stayed at more expensive and \"prestigious\" hotels in other cities). When we return to SF from Sydney some time in the future we'll be heading straight for the Chancellor. 5 stars.", "helpfulness": 2, "user": "JuliaMaddison", "date": "January 17, 2008", "id": 12736987}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "My wife and I stayed for four nights recently and found the hotel was good. It is advertised as all the rooms having been redocorated as recently as November '07 but the bathroom in our room looked only to have had a superficial makeover.", "title": "2nd time- Just as good", "helpfulness": 3, "user": "InvernessHighlander", "date": "January 14, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 3.0, "location": 5.0}, "id": 12617219, "likes": {"liked": "— Location- Cant get any better", "disliked": "— Rooms slightly small"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled on business", "text": "I stayed five nights in September as part of attending Oracle Openworld 2010. As such, I was interested in a hotel that was close to SOMA. My room was on the third floor and was very nice. The room was more than large enough for my needs.", "title": "Very Nice Place", "user": "joshaurora", "date": "October 12, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 83195298}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "What I liked: by far, the walk in closet was really, really helpful; the bathroom had cotton swabs--nice touch; the room was so quiet that I never heard anyone else except once, quite amazing; service was great--I got exactly what I asked for, usually quite quickly; real bathtub; variety and number of pillows; very friendly hotel staff; free coffee in the mornings was quite tasty; the fitness club was great!; ventilation was good, even on hot (80's F) days;", "title": "A really nice hotel in a great location", "user": "Medder", "date": "October 12, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 83161445}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled solo", "text": "What could have been better: shower pressure was too low (probably Californian regs); no ethernet connection in room;", "title": "Absolutely Fabulous", "user": "continuitygirl", "date": "October 10, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 82880519}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled with friends", "text": "I got the hotel through the Oracle convention and the rate was pretty good relatively. While I would not personally pay the going rate, I would recommend the hotel unreservedly.", "title": "Location, Location, Location", "user": "VancouverBertle", "date": "October 10, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 82857476}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled on business", "text": "My wife & I stayed at this hotel for our honeymoon. The hotel is located right in the heart of the city which makes it a perfect base for going out exploring. Union Square is literally about 50 yards away and the cable car runs right past the front of the hotel with 2 cable car stops within a stones throw of the front door. Open top tour buses run from Union Square and the cable cars are the perfect way of travelling around the city and to the Fishermans Wharf area.", "title": "Customer service is excellent; perfect location", "user": "zztip", "date": "October 8, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 82665734}, {"rating": 5.0, "stay_parameters": "Stayed December 2008, traveled as a couple", "text": "I lived in San Francisco for 11 years (25 years ago). I miss three distinctive sounds of the city, the foghorns, the barking seals and the clanging of the cable cars. Over this past holiday season I spent 3 lovely nights at the Chancellor Hotel with friends. From the moment my wife and I arrived we were met by a friendly, attentive staff and our check-in was a breeze. Our room had a queen size bed with a choice of different pillows, a safe, a flat screen TV, wireless internet, a large walk-in closet, a nice bathroom with plenty of towels and toiletries including a rubber duck for your bath(Nice touch). The room was very quiet and comfortable and at night I could hear the sound of the clanging cable cars. I can't wait to return!", "title": "Great hotel on Union Square", "helpfulness": 2, "user": "sndsfam", "date": "January 12, 2009", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 23504305}, {"rating": 5.0, "stay_parameters": "Stayed December 2008, traveled as a couple", "text": "We stayed at the Chancellor for 3 nights in December 2008 and loved our time in the hotel! We booked through Trailfinders so don't have an exact idea of the cost of the stay, but it seemed great value for such a perfect location. We had a fab view of union square from our room on 14th floor - this was obviously within easy reach, as was fisherman's wharf (a long-ish walk, but plenty of public transport options) and all the main san francisco sights, shops and restaurants. plus a handy walgreens pharmacy and starbucks practically next door.", "title": "Fantastic hotel, great service, ideal location - loved it!", "helpfulness": 2, "user": "jessandtony", "date": "January 12, 2009", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 23498484, "likes": {"liked": "— The friendly service and location"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "we arrived at the hotel after a long trans-atlantic journey and unpleasant immigration experience and found the staff incredibly welcoming. Nate (we think) checked us in and we felt acknowledged and remembered by him throughout our stay, which was a lovely touch.", "title": "Excellent Location", "helpfulness": 2, "user": "Renata_Tim", "date": "January 10, 2009", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 5.0, "rooms": 5.0}, "id": 23440767, "likes": {"liked": "— Location", "disliked": "— Room size"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2008, traveled as a couple", "text": "my husband had emailed the hotel in advance to advise we would be celebrating our first wedding anniversary there and we were very touched by the gifts waiting for us in our room. and being wished happy anniversary on check in and check out was a simple, yet lovely touch.", "title": "Simply the best", "helpfulness": 2, "user": "EileenPerthWA", "date": "January 7, 2009", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 23358571, "likes": {"liked": "— everything", "disliked": "— nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2008, traveled as a couple", "text": "really don't want to mention any negatives because we really loved the hotel, but just as a little warning...you might have a while to wait for the elevator if you are lucky enough to get a room with a view at the top of the hotel!! not sure what the previous heating issues were all about because our room was lovely and cosy - we had the ceiling fan on most of the time! also loved the walk-in wardrobe/closet and properly sized bath (don't tend to find too many of those in the US!).", "title": "super little hotel in super spot", "helpfulness": 1, "user": "littlemssunshine16", "date": "January 7, 2009", "detail_rating": {"front_desk": 5.0, "service": 4.0, "business": 4.0, "cleanliness": 5.0, "rooms": 4.0, "location": 5.0}, "id": 23335555, "likes": {"liked": "— The location", "disliked": "— small bathroom"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled with friends", "text": "We stayed here for two nights a few weeks ago. The location is great, right on Union Square. A bit of noise from the trams going past, but the sound of the bells being rung is part of SF. The room was fine, really liked the goose-down pillows and soft duvets. Didn’t try out the pillow menu, but a great idea as a pillow can make or break a good night’s sleep. The bathroom was okay, a bit in need of freshening up though. Scratches on the bath etc. overall a good stay, but nothing spectacular as I was expecting when I saw that it was rated 3rd in SF. I can’t comment on the service or food as we ate out all the time, but they were quite happy for us to check out at 6am due to a tour pick-up. Try the diner up the street. Real chrome and 50s kitsch. overall a nice hotel in a good location.", "title": "great location", "helpfulness": 3, "user": "KC-belfast", "date": "October 29, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 3.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 10425330, "likes": {"liked": "— location"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2007", "text": "Amazing hotel in a great location.", "title": "Superb", "helpfulness": 6, "user": "S_KLondon_England", "date": "October 28, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 10406831}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "This hotel should be 4 or 5 stars for the service and the quality of the room, and proves how flawed the whole star system can be as I have stayed in 4 and 5 star hotels which have been much worse than this one.", "title": "Great location, funky room, good price", "helpfulness": 9, "user": "fenboy", "date": "October 25, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 10321493, "likes": {"liked": "— The room"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "Firstly the location is second to none. You are staying right on union square in prime central location. You are staying right next to all the most expensive hotels, and the most expensive shops and restaurants.", "title": "Perfect Stay!", "helpfulness": 2, "user": "MelsLondon", "date": "October 25, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 10318501}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "To get there from the airport I would advise taking one of the shuttle buses which will cost only $14 plus tip, much cheaper than a taxi.", "title": "The Chancellor - A great little hotel", "helpfulness": 4, "user": "Reffie", "date": "October 24, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 10281618, "likes": {"liked": "— location", "disliked": "— nothing was wrong"}}, {"rating": 5.0, "title": "Great Location!", "text": "Check in was very efficient even though we arrived early the staff were very helpful and arranged for our luggage to be stored and for car parking for us.", "user": "Angela E", "date": "March 18, 2008", "id": 14357038}, {"rating": 5.0, "title": "My #1 in SFO !", "text": "The location was excellent - cable car right outside and with Sears opposite and Macy's down one block you couldn't ask for anything more!", "user": "freqtravmuc", "date": "March 13, 2008", "id": 14266859}, {"rating": 5.0, "title": "Fantastic Hotel", "text": "The room was big enough with a large comfy bed and they have a selection of pillows available (e.g. anti snoring!) but the pillows which were already on the bed were fine.", "user": "Jimers", "date": "March 11, 2008", "id": 14215114}, {"rating": 5.0, "title": "Perfect stay", "text": "The bathroom was quite small but clean and all you needed.", "user": "XeniaM", "date": "March 8, 2008", "id": 14134921}, {"rating": 5.0, "title": "The favorite of this frequent visitor", "text": "Our room was at the back so was quiet but I could imagine the front of the hotel could be a bit noisy.", "user": "john_northbay", "date": "March 7, 2008", "id": 14131251}, {"rating": 4.0, "stay_parameters": "Stayed March 2006", "text": "Rooms - good size, spotless but a little dated", "title": "Excellent Value", "helpfulness": 10, "user": "yvr->ewr", "date": "March 31, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 4824027}, {"rating": 5.0, "title": "AWESOME!!!!!! Just like the reviews said...", "text": "Location - at the center of everything", "helpfulness": 10, "user": "A TripAdvisor user", "date": "March 24, 2006", "id": 4731025}, {"rating": 5.0, "title": "Wonderful hotel", "text": "Service - very good", "helpfulness": 12, "user": "A TripAdvisor user", "date": "March 24, 2006", "id": 4728952}, {"rating": 5.0, "stay_parameters": "Stayed February 2006", "text": "My wife and I stayed at the Chancellor March 26-28. Arrived at about 11AM. Check-in was a breeze, even though we were early. We travel to SFO at least twice a year. We have stayed at several hotels in the area including the Westin St. Francis. For our money, we would choose the the Chancellor again for our next visit.", "title": "HIGHLY RECOMMENDED - Wow!", "helpfulness": 10, "user": "HBKreis", "date": "March 21, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4722975}, {"rating": 5.0, "title": "Wonderful Hotel -- Great Management Responses", "text": "The hotel is perfectly situated for everything a tourist would want to see and do in SFO. The cable car stops almost right upfront.", "helpfulness": 5, "user": "nycgeorgian", "date": "March 20, 2006", "id": 4707067}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "My wife and I stayed at the Chancellor for three nights and had a great experience. We stayed in a renovated room on the 8th floor overlooking Union Square. The room was small but comfortable, the new furnishings are great, the bed was comfortable and don’t forget the menu of pillows that are available for you... everything from a hypoallergenic, to a memory foam, to an organic something-other, to a snore-no-more type pillow (the isotonic is great). There is noise from Union Square, however the double-pane windows block 95% of the noise when closed. Everyone was friendly and helpful. We were able to purchase a Muni-pass in the lobby (a must-have when in S.F.), which was very convenient. Speaking of convenience, the cable car stop that is literally at the doorstep to the hotel is perfect. The Chancellor is so centrally located which makes it perfect for exploring the city. The area is nice. My wife and I both felt very safe. I don’t believe that there was any sort of continental breakfast, but there was coffee and cookies 24 hrs a day and a popcorn machine in the evenings.", "title": "Great experience at the Chancellor", "helpfulness": 10, "user": "Jessem23", "date": "August 24, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8497107, "likes": {"liked": "— The location, the value", "disliked": "— lack of a continental breakfast"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "We will DEFINITELY stay here again.", "title": "Great stay", "helpfulness": 8, "user": "Irish0711", "date": "August 22, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 8474527, "likes": {"liked": "— Cleanliness and comfort", "disliked": "— smallness of the room"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "Based on the reviews we read here on Trip Advisor we chose the Chancellor Hotel on Union Square for its location and the above average service. They lived up to all their reviews. The front desk staff, especially Rory and Mike, were outstanding. The hotel is an older property,well maintained and clean. The location is just great. I highly recommend this hotel.", "title": "Great starting point to a beautiful city", "helpfulness": 7, "user": "MargaretPonthir", "date": "August 20, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 8460055, "likes": {"liked": "— value for money and friendliness of staff", "disliked": "— Nothing comes to mind"}}, {"rating": 4.0, "title": "Wonderful Stay at the Chancellor!", "text": "I booked this hotel through Trailfinders and after researching it on tripadvisor.com . Excellent location-just off Union Square-close to not only cable car stop but also Alamo car rental a 5 minute walk away. Chinatown in close proximity too.Small lobby but well staffed efficient reception and very informative trip service desk with adjoining small shopping kiosk.", "helpfulness": 4, "user": "married4gd", "date": "August 17, 2007", "id": 8442664}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "Rooms were fine-don't be put off by the fact there is no air-conditioning-the ceiling fans were fine.Also we expected it to be quite noisy at night-not at all-no problems. No coffee/tea makers in the rooms but in the lobby coffee and teas available around the clock-just help yourself and no charge. Also mouth watering cookies and muffins as well ! A jar of sweets-replenished daily-was also in our room. I musn't forget there is even a pillow menu-you can try different pillows to aid your sleep !", "title": "Great Place to Stay", "helpfulness": 10, "user": "poppajoe42", "date": "August 17, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8441396, "likes": {"liked": "— Friendly Staff", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled with family", "text": "Stayed for 4 nights in two rooms over Christmas. Worked out really well for us. The bed was super comfy. The shower had plenty of hot water. The room was quiet for us. The room isn't large but has a couple of chairs and a desk. Free wireless internet too. San Francisco is one of those cities were if you are spending lots of time in your room, you just ain't doing the city right.", "title": "Great Value on Union Square", "helpfulness": 3, "user": "Henry F", "date": "December 28, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 12009941, "likes": {"liked": "— location, value, comfy"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "Our 3rd floor room faced Powell street which is where the cable car runs and they start at 6:30am. This didn't bother us but we also don't sleep late. I'm guessing if you are a light sleeper who wants to sleep in you should ask for a room either higher up or not facing Powell. BTW, our 19 year old teenagers had no problem sleeping late! (Based on my other reviews I seem to be a little more sensitive to noise than others.)", "title": "Great value, great location!", "helpfulness": 1, "user": "Brookelyn3", "date": "December 26, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 11964179, "likes": {"liked": "— Location, location, location", "disliked": "— Valet parking is pricey, but that's to be expected in San Francisco."}}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "The front desk was very helpful in recommending places to eat.", "title": "Great Hotel", "user": "chenga28", "date": "December 24, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 11935611}, {"rating": 3.0, "stay_parameters": "Stayed December 2007, traveled solo", "text": "Only complaint (and the GM seems to read these comments) -- more chocolate chip cookies and fewer cinnamon raisin! Wow, that should be the complaint about all hotels right?", "title": "excellent location", "helpfulness": 1, "user": "faiq8", "date": "December 21, 2007", "detail_rating": {"front_desk": 3.0, "business": 5.0, "service": 4.0, "cleanliness": 3.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 11884605, "likes": {"liked": "— the location", "disliked": "— bathroom"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "We rented a car for a few days to go north along the coast. We self-parked which is no big hassle -- just around the block.", "title": "The Absolute Best!", "helpfulness": 5, "user": "Petunia2", "date": "December 20, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 11716283, "likes": {"liked": "— The location"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "We stayed ay the Chancellor for 3 nights this week. We loved the historic charm of the hotel. Our room was very clean, had a HUGE walk in closet. The bathroom was small but it was fine. The bed was SO comfortable. We didnt take advantage of the \"pillow menu\" but it had some cool options. The hotel is right across from a cable car stop which was great. There are plenty of restaurants in the area and if you like to shop youre in heaven. We walked to Chinatown and down to North Beach. For breakfast we went right next door to Sears. I went here when I was about 6 and it looks the same. I highly recommend the oatmeal. Yes, the oatmeal. It was amazing. The husband had the \"famous\" pancakes but I honestly thought the waffle was much better. OK, back to the Chancellor. The staff at the desk was helpful with directions and gave us printed directions and a map to Golden Gate park. The park is out of the way but worth the visit. We spent the morning at the Japanese Tea garden and then walked to Haight Ashbury (overrated)", "title": "Location couldnt be better", "helpfulness": 5, "user": "lovesublime", "date": "November 10, 2007", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 3.0, "value": 4.0, "rooms": 3.0, "location": 5.0}, "id": 10740135, "likes": {"liked": "— location, room", "disliked": "— thin walls, step going up to the bathroom (stubbed toes)"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2007", "text": "The only bad thing I can say about the Chancellor was the walls were very thin. We heard the phone conversations and TV programs from the room next door. News, weather forecast, traffic, and stock woes all before 8am.", "title": "Fantastic!", "helpfulness": 5, "user": "321Blastoff", "date": "November 7, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 10671067}, {"rating": 5.0, "title": "Loved it!", "text": "Overall the location, price and service was great, the room was comfortable but not luxurious. I wouldnt recommend this hotel to elderly travelers because the walls of the tub are very high to step in and out of.", "helpfulness": 3, "user": "calimonkey", "date": "November 6, 2007", "id": 10655104}, {"rating": 4.0, "title": "great staff & great location;would stay again!!!!!", "text": "My husband and I travel to San Francisco 2 or 3 times a year, and like to try out a new hotel each time. We prefer the Union Square area, but always face a conundrum: The smaller, renovated hotels are convenient, but often a bit rough around the edges. Of all the area hotels we've stayed in, the Chancellor Hotel comes closest to getting everything right. For starters, the location really is ideal. It's between Borders Books and the venerable Sears Fine Food, just steps off Union Square. The attractive lobby is open and airy, and the employees are impeccably helpful and polite. Our room, on an upper floor, was very tastefully decorated, with high-end bedding and contemporary appointments. The bathroom was squeaky clean, with modern fixtures and period details. Yes, the room was a bit on the small side, and the soundproofing could have been better. But those are the realities of an older hotel. It was ideal for us. I can definitely count our stay at the Chancellor Hotel as one of the best we've enjoyed in many years of travel to the City.", "helpfulness": 1, "user": "kaibiganGeorgia", "date": "November 6, 2007", "id": 10651225}, {"rating": 4.0, "stay_parameters": "Stayed October 2007", "text": "Just returned from our 4th stay at the Chancellor. We wouldn't stay anywhere else. The staff are eager to help in any way possible and the location can't be beat. The rooms are small, but very clean. We ate breakfast in the restaurant 1 morning and enjoyed it very much. It is apparent that the General Manager cares, he was working the front desk at check out, not hidden in some office like General Managers of other hotels we have stayed in. Our only regret is that we will not be able to return until next January. We suggestg eating at Fior d'Italia if you are in the mood for Italian food. We love the Veal Parmigana.", "title": "Great location, nice friendly staff", "helpfulness": 4, "user": "Butcher.T", "date": "November 6, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 10637117}, {"rating": 3.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "We stayed here for four nights. We had a mixed experience here, with some very positive things and some less good.", "title": "Positives and Negatives", "helpfulness": 1, "user": "Henry J", "date": "June 9, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 131621868}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with friends", "text": "The positives: When we got to our room the hotel had given us two bottles of wine and chocolates to congratulate us, as it was our honeymoon. This was really appreciated and a lovely touch. The hotel has a fantastic location by Union Square and right on the cable car line, so it was very easy to get to all the tourist hotspots. We didn't eat here but we did have a drink in the bar, which was good and the staff were really friendly. There were no tea/coffee facilities in the room, but instead there was a constant supply of fresh coffee and cookies in the lobby, which was much nicer anyway. The activities desk were helpful, giving us good advice and helping us to sort out transport.", "title": "Returning to San Francisco & the Chancellor - we were not dissappointed", "helpfulness": 2, "user": "kaw118", "date": "June 8, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 131569826}, {"rating": 5.0, "stay_parameters": "Stayed June 2012", "text": "Negatives: The reception staff were quite poor. Not especially friendly, and didn't give us the correct information when we checked in about computer access, so we ended up wasting money trying to access the internet in our room. When we asked for help with this the receptionist (the same one who had checked us in) treated us like we were stupid. The housekeeping routine was quite odd - we were given new towels everyday but the old ones were never removed, so by the time we left there was a large pile of these on the bathroom floor. We also noticed that some of the bedsheets had holes in them. The room was also quite dated, although we weren't sure whether this was deliberate and so we didn't mind it too much. There was also quite a lot of noise from both other guests and the street (though the latter is inevitable given the location).", "title": "Great location, friendly staff", "user": "jvelez", "date": "June 8, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 131542309}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "Overall, we feel that this could be a really nice place to stay with some small improvements in a few areas. We realise that our stay may have been atypical, and we had been staying in an exceptional hotel just before this so our judgement may have been slightly clouded.", "title": "Absolutely great!", "helpfulness": 3, "user": "WBHameed", "date": "June 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 131518085}, {"rating": 5.0, "title": "Best location, very good breakfast, comfortable room", "text": "Having chosen to stay at the Chancellor some 3+ years ago, following Trip Advisor reports - we again were not disappointed. Simularly having a room on a higher floor - we had the window open, even though we had a front facing room, we did not suffer noise. The rooms are perfectly formed, although the step -up to the bathroom needs to be treated with care. Would I recommend it - well four other friends also visited!", "user": "RLL77", "date": "June 7, 2012", "id": 131516314}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "Stayed here for five days in May and was very impressed with the cleanliness of the rooms, the interior of the hotel, and the service we received. We choose offsite parking that is about a two minute walk around the corner to save some $$ which was not terribly bad as we only used our car twice during our stay. Regarding location, could have not been better. Hotel is about a six minute walk to Chinatown, 1/2 block from Union Square, and right on the main street for the Powell & Hyde cable car. Rooms were normal size, not too big or too small, bathrooms a little on the small side, and the water pressure in the shower was adequate enough for my taste. The only pet peeve I had while staying there was the air pressure in the hotel caused the main door in the room to rattle back and forth, but was easily remedied with a chair pushed up against it.", "title": "Great location and price", "helpfulness": 2, "user": "Jeff B", "date": "May 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 130247266}, {"rating": 4.0, "title": "perfect place to be \"bang in the midst of action\"", "text": "fantastic location across the Union Square. Very friendly service at the hotel, especially at the bar. Alicia - God Bless you !. Though the rooms are small they are well provided with. And the pillows, as all reviewers say - yes.. that is a treat !", "helpfulness": 3, "user": "A TripAdvisor user", "date": "May 19, 2012", "id": 130211113}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "Would definitely stay on our next visit too. Would have appreciated having a water heater flask in the room though !.Shuttle service to the Airport and sightseeing facilities at the Hotel are commendable.", "title": "Great Value!", "helpfulness": 3, "user": "bigredtraveler", "date": "May 18, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 130171937}, {"rating": 5.0, "stay_parameters": "Stayed May 2012", "text": "The rooms are small, but you simply cannot beat the location. Everything was clean and quiet. If you're planning on spending a lot of time in your room, then you might want to opt for something bigger, but when on vacation, chances are you won't be spending too much time at the hotel anyway. The Chancellor staff was great, breakfast downstairs was very good, and, while small, the rooms provided everything we needed.", "title": "Great location for conferences AND shopping!", "helpfulness": 2, "user": "isg2007", "date": "May 18, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 130170010}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled solo", "text": "Thank you Kevin (the manager) for accommodating my changing agenda.", "title": "Location location", "helpfulness": 3, "user": "rosypie", "date": "May 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 130141383}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "Having taken a long leisurely road trip from LA to San Francisco via Death Valley, Yosemite, Big Sur and the like, a few days in San Francisco staying at the Chancellor was the perfect end to a wonderful holiday. Everything about the hotel was excellent, the only downside was having to catch an early morning flight back home, but even at 6am the coffee and cookies in reception helped no end.", "title": "End of the line", "helpfulness": 1, "user": "Rex1702", "date": "October 20, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 84194088}, {"rating": 5.0, "stay_parameters": "Stayed September 2010", "text": "Hotel very comfortable & staff very professional and friendly! No air conditioning but fan in room, out the 7 nights, only felt hot & unfortable one night only! Bedding very comfortable, room big enough. Travelled with 2 others all stayed in separte rooms, two of the rooms had walk in wardrobe which was amazing. Location was fantastic with Union SQ right at your doorstep with transport at your reach if required. Will hope to stay there again when i return to San Francisco.", "title": "Home away from home", "helpfulness": 1, "user": "Mykeldaygar", "date": "October 20, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 84173869}, {"rating": 4.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "A nice hotel in a fabulous location in SFO. Bang next to the Union Square, this is a great place for a short stay in the city. Great kick off point for sightseeing as well as for some nice eating options. Rooms are unfortunately a tad too small but then you would just sleep over during a short stay. Breakfast at the hotel restauarant has some good options including some great Omlettes. A fabulous all American diner is also close by.", "title": "Location Location Location", "helpfulness": 1, "user": "vinzdagama", "date": "October 19, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 84133169}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "Do plan for a 40 min ride to and from the airport.", "title": "Beautiful hotel", "helpfulness": 1, "user": "blueglenn1954", "date": "October 19, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 84043555}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "We stayed here for 4 nights on our honeymoon. It was east to find only being a few blocks up from Powell Street BART station.", "title": "fabulous location, excellent staff!", "helpfulness": 1, "user": "janiem_10", "date": "October 18, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 83973751}, {"rating": 4.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "I planned a suprise trip to San Fran and then Pheonix for my boyfriend. I chose Chancellor for price, location, reviews and the fact that the manager responds to negative reviews himself on this site. I figured that would reflect on the hotel staff. We loved the Chancellor! The room size was slightly small, but its SF and was fine for us. The bed was VERY comfy. The location was great because although we had a rental car, in the city it is just convienient to walk everywhere. We did valet for only a few dollars more a day, HIGHLY RECOMENDED. We didnt have to worry about getting our car in that crazy city! We would just call about 20 min early (when we were at breakfast) and our car would be waiting right out front. We went north to the Muir Woods, absolutely beutiful, highly recomended. And also traveled south to pebble beach for a round of golf. Bathroom amneties were nice, and we stole the rubber ducky from our room for a little souvenier. The only reason Im giving it four stars was because of the service our last day before leaving for the airport. Our car was brought to the front.. but the bell boy who had been very helpful when we arrived just watched as I dragged all our luggage (inluding a large golf bag carrier) to the rental car. I was expecting some help as a female! Unfortunate, but overall the hotel was a great place and I would stay again.", "title": "Great stay in SF", "helpfulness": 4, "user": "usf86", "date": "January 19, 2009", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 3.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 23695546, "likes": {"liked": "— Old world hotel", "disliked": "— bell boy last day"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2008", "text": "Stayed here for 2 nights over holidays while visiting our son in San Francisco. I requested a high view of Union Square and that is exactly what we got. The hotel is great, very quaint with a terrific staff. Yes it is old but that is part of the charm. It is kept in great shape and we had no problems whatsoever. We didn't hear any noise from the street.", "title": "Second stay as great as the first", "helpfulness": 2, "user": "crjask", "date": "January 16, 2009", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 23615933, "likes": {"liked": "— Location.", "disliked": "— Nothing to dislike."}}, {"rating": 3.0, "stay_parameters": "Stayed December 2008, traveled as a couple", "text": "This was our second stay in two years. Last time I requested a quiet room and we had a room at the back of the hotel. Quiet.", "title": "Fab location", "user": "sarah_holiday", "date": "January 15, 2009", "detail_rating": {"front_desk": 3.0, "service": 4.0, "business": 4.0, "cleanliness": 4.0, "rooms": 3.0, "location": 5.0}, "id": 23582020, "likes": {"liked": "— Location", "disliked": "— Room"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2009, traveled with friends", "text": "The location is great and we plan to come back often.", "title": "The wonderful experience at Chancelor Hotel", "helpfulness": 2, "user": "LEXPOOKIE", "date": "January 13, 2009", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 23535819}, {"rating": 5.0, "stay_parameters": "Stayed January 2009, traveled as a couple", "text": "I loved the location of this hotel, if you are going to stay in San Fran, Union Square is the place to be, surrounded by shops and restaurants and right by the cable cars so very easy to get around.", "title": "Love the Chancellor Hotel", "helpfulness": 2, "user": "arsin696", "date": "January 13, 2009", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 23531588, "likes": {"liked": "— The intimate feel about it", "disliked": "— I liked everything"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "If you are looking for a great location, friendly service, and above average accomodations, this is your place. It is located right off Union Square and convenient to everything downtown. The rooms are a little on the small side and a little dated. They are however, comfortable and clean. There are also a few extras, some at a small additional cost, that make things nicer such as foot baths, tempur-pedic type pillow, aroma therapy type items. The beds were comfortable. They have an arrangment with a fitness center a block away that allows you free visits. The staff went out of their way to be helpful and friendly. All in all, this was among the best values I've found in many trips to San Francisco. As long as you're not looking for 5-star luxury, I would highly recommend the Chancellor. One last thought, like everywhere in SF, the parking is expensive. Check out some of their package deals that include parking.", "title": "Great for what it is", "helpfulness": 11, "user": "Tgreen", "date": "February 13, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 6787172, "likes": {"liked": "— Location, service", "disliked": "— Nothing of note"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2007, traveled with family", "text": "I stayed through the weekend of 2/3 and this was my first time in San Francisco. The Chancellor Hotel was a great start to a San Francisco visit. The hotel is centrally located: the cable car, streetcars, buses, BART and muni subway are all close by so you can go to any part of San Francisco. It is in the middle of a nice shopping area: Saks, Macy's, Borders, See's Chocolates, Walgreens, Starbucks and great stores and restaurants on Market Street are all nearby or just blocks away. Union Square Park is across the street, so there's a nice place to just sit and catch your breath during the day.", "title": "Central Location in San Francisco", "helpfulness": 4, "user": "ElNYC", "date": "February 12, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 6782682, "likes": {"liked": "— The room has high celings", "disliked": "— Smaller rooms than average"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled on business", "text": "The hotel itself is one of the older hotels so it has a lot of character and rooms have high ceilings. Although the hotel is older and rooms are smaller proportioned, the rooms are very prettily decorated and well-maintained and clean. All the staff people were very nice. A lovely touch was that coffee was available to the guests at the hotel at all times of the day. In the morning, the continental breakfast provided coffee, muffins and cookies. This hotel is all non-smoking, which is something that I really appreciated. The area around the hotel is pretty safe for a big city.", "title": "Great Hotel, Great Location, Amazing Value", "helpfulness": 6, "user": "B_R_Toronto", "date": "February 12, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6782676, "likes": {"liked": "— Location and price"}}, {"rating": 3.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "I would recommend this hotel to anyone; it's a pleasant place to stay, secure, clean, and centrally located.", "title": "Okay but could have been better", "helpfulness": 4, "user": "ZRacer", "date": "February 5, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 3.0, "rooms": 3.0}, "id": 6748994}, {"rating": 4.0, "stay_parameters": "Stayed May 2006, traveled as a couple", "text": "I stayed at The Chancellor Hotel for 7 days last week and could not have been more satisfied with my stay. The hotel is perfectly situated, well-maintained and very affordable given its superb location. The staff are very friendly and helpful. The extra touches (ex. cookies - those yummy cranberry ones!; rubber ducky in bathroom; pillow menu, etc.) are great too. I will be recommending this hotel to all my friends/colleagues who are planning trips to the Bay Area.", "title": "Perfect for SF getaway", "helpfulness": 1, "user": "zestytravis", "date": "February 4, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 6743024, "likes": {"liked": "— Location", "disliked": "— Parking"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled with friends", "text": "we were there the hottest weekend ever!!!! going there, we knew the hotel would be a small boutique hotel and would be w/o air conditioning. we didn't know how hot it would be tho. having said that, we were still comfortable enough when going to sleep. luckily, we had the quieter rooms in the back and were able to sleep with the windows open for fresh, cooler air. little city noise but didn't we mind that. we are after all in the heart of the city. our room didn't have a view but we were out all day so that didn't bother us at all. i love the fact that we were able to walk everywhere cuz trying to hail down a cab was not an easy task. bell guy, MATT, was able to hail a cab for us in front of the hotel, but to hail down a cab in the city was near to impossible. but with the central location of the hotel walking in any direction was safe and easy. the staff, from the front desk associates, to the bar tenders, to bell men, and to the nice lady at the tour desk, couldn't have been friendlier or more helpful.", "title": "small but comfortable", "helpfulness": 2, "user": "scoshi", "date": "May 19, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 3.0, "location": 5.0}, "id": 16201035, "likes": {"liked": "— location, friendliness"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "This was the second time we have stayed at The Chancellor, the first being in 2006. The rooms have been refurbished since our last stay which is lovely but we were more than pleased to find the service and staff had not changed...they were as attentive, professional and as helpfull as ever. The Chancellor truly is the place to stay in SF. Best location, best price, best staff and best cookies! ....we will be back again!!", "title": "Second Time Around - Even Better!", "helpfulness": 2, "user": "travelnorth", "date": "May 18, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 16160964, "likes": {"liked": "— The location in unbeatable and the staff are incredibly helpfull."}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "After much deliberation and going through the reviews on TA we decided upon the Chancellor and glad to say we weren’t disappointed. We decided that the Union square area was more suited to us as there was only myself and girlfriend travelling. The Chancellor exceeded our expectations within 10 seconds of check in as we were upgraded for free to a suite, which had two full separate bathrooms, separate living room, fridge, and the all important tea and coffee making facilities. We had requested a room on a high floor with a nice view if possible our suite didn’t have a view so perhaps they we unable to give us a normal room with a view so they bumped us up to the suite? This was just my thinking anyhow and I’d have taken the suite over a view anyhow!! We have very little interaction with hotel staff in general unless we have a problem-we had no problems in the Chancellor so our interactions were limited although all the staff were warm and friendly from the cleaners to the front desk staff. We booked our wine country tour via the tour desk in the lobby and our return transport to the airport she was very helpful. With our upgrade I can’t offer insight into the normal rooms but the suite was probably decorated as the un-refurbished rooms from the website my girlfriend preferred the look of the older rooms anyhow. There isn’t really allot I can add from previous reviews-the location is excellent with plenty of dinning options and everything you’d need in and about Union Square. To me the only problems people seem to have with the Chancellor are caused by them not doing their research! The Chancellor is a charming well presented Boutique hotel with great service, it doesn’t pretend to be luxurious or fancy and their rates reflect this! It’s a shame that the Chancellor and San Francisco are on the other side of the world from us otherwise we’d return sooner rather than later! Great hotel that I wouldn’t hesitate recommending to anyone.", "title": "Great Hotel in a great city!", "helpfulness": 3, "user": "Benjii", "date": "May 15, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 16051975, "likes": {"liked": "— Getting a free upgrade", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "First stop on our whistle stop tour of the USA.", "title": "Great City to visit", "helpfulness": 2, "user": "bsdlp", "date": "May 11, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 15934174, "likes": {"liked": "— Location", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "We arrived at the hotel late and not in the best of moods after a long flight from the UK and with all our luggage missing. The reception staff were very helpful and offered to look after our luggage during the night, should it arrive, and it did.", "title": "Perfect Chancellor", "helpfulness": 4, "user": "Mulherin", "date": "May 11, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 15929725, "likes": {"liked": "— Location", "disliked": "— Nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "I booked the hotel based on it's location and good reviews on tripadvisor. Its a nice hotel, great staff, I didn't know the hotel is 100 years old, but you can see it's a bit rough around the edges, the halls, and the elevators look like you've gone back in time. The bed was extremely comfortable and they had a list of body pillows you can request for free, which i thought was awesome! We were there in June when the weather was in the 80's and the room didn't have air conditioning only a ceiling fan which was uncomfortable for me because i need to sleep in the cold. I really liked Rory he checked us in as well as tended bar.", "title": "Pretty good", "user": "shawana80", "date": "June 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 132586068}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled with friends", "text": "First time visitors from New Zealand, so hotel choice is confusing. We relied on tripadvisor feedback. An old hotel [circa 1915] and the rooms and bathrooms reflected that. That said, the location is great and the staff were obliging. What we really liked was the ground floor lobby. A friendly comfortable place with complimentary coffee, cookies, fruit and water. The adjoining bar was great for a relaxing drink after a busy day. So, if you are not too fussy about your room etc, then this is a good place stay.", "title": "An oldie but a goodie", "user": "Brian W", "date": "June 23, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 132572510}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "We chose this hotel because of comments on this site. We were very pleased. Very central, helpful staff, and clean. OK the rooms are not huge, but who spends their vacation in their hotel room. More than adequate for a couple. Enjoyed happy hour!", "title": "Great hotel and location", "user": "LovelockAustralia", "date": "June 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 132570952}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "We got this hotel through Hotwire with the \"Secret Hot Rates\" feature, so we didn't know anything about it before we booked and paid for it, but it worked out perfectly for us!", "title": "Perfectly good hotel, great location, reasonable price", "user": "happy_traveler9787", "date": "June 20, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 132387847}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "First, the location is ideal for tourists. It's in Union Square, and within easy (downhill!) walking distance from the BART, the MUNI subway, and multiple bus lines (and even the free tourist trolley, should you choose to wait in a ridiculous line and ride that...) We love to walk, so we just walked everywhere unless we were short on time, but the Chancellor Hotel is perfectly situated for whatever neighborhood you want to visit. I've seen many other reviews complain that Union Square is plagued by homeless people, but really there's no escaping that in San Francisco. We felt safe the entire time, even walking around late at night.", "title": "great location", "helpfulness": 1, "user": "Carly H", "date": "June 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 132335449}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "Arrived at half past three in the afternoon to be told that the room was not ready, was not too put out as we had only came from Dallas, would not have been to happy if we had just gotten off a transatlantic flight. However soon forgot about the delay when we saw the room 1103. It was lovely with a great view of Union Square. Loads of room, great bathroom and huge closet. Lifts were great never had to wait long for them. Staff that we did speak to were pleasant and Susan at the tour desk was a great help. This hotel is brilliantly situated for everything and we will be rebooking when we return to San Francisco.", "title": "Great location", "helpfulness": 4, "user": "soloboy1", "date": "October 15, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 10082314, "likes": {"liked": "— tastefully decorated room", "disliked": "— nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "Being on our honeymoon and having just left the Bellagio in Vegas and heading for a stay in the Chancellor in San Fran we were slighly anxious to say the least. We were anxious for nothing and did not need worry. On arrival we had a complimentary bottle of sparking wine and a lovely photo frame waiting in our room. Lovely touch. The room was a fine size, clean with a very comfortable bed. A great pillow menu available if thats your thing!! A nice touch also was the tasty sweet jar in each room which was filled each morning. If you like cookies and coffee well then this hotel is your paridise. They have complimentary coffee, tea and cookies available all day in the lobby. The only but..... is that they put the cookies up by the reception desk later in the evening and you feel guilty taking them!!! Well probably only because we were we savages......Should be ok for most people.", "title": "Excellent value", "helpfulness": 1, "user": "bwalshe", "date": "October 13, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 5.0, "location": 5.0, "rooms": 3.0}, "id": 10074913, "likes": {"liked": "— Personal touches", "disliked": "— Food Menu"}}, {"rating": 4.0, "title": "Good hotel, great location - poor breakfast.", "text": "The staff were very friendly, the location was prefect, tram outside your door, and good value shuttle service to airport available. To sum it up and given the price you pay for this hotel you could not ask for better value. I would consider myself being very critical of service and value for money but COULD NOT FAULT THIS HOTEL. Thumps Up for the Chancellor. Brendan Walshe & Amanda O'Shea, Cork, Ireland", "helpfulness": 3, "user": "The40Watt", "date": "October 12, 2007", "id": 10069485}, {"rating": 5.0, "stay_parameters": "Stayed May 2007", "text": "As the last reviewer said we also booked this hotel on the recommendation of many on TripAdvisor. We haven't been disappointed.", "title": "Loved it!", "helpfulness": 2, "user": "Daffodil_Travellor", "date": "October 11, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 10066101, "likes": {"liked": "— Location and Service", "disliked": "— Nothing"}}, {"rating": 4.0, "title": "Fantastic Location", "text": "The location is superb, especially given the price. The cable car is right outside the door along with all the shops you could possible ever want. I've found the hotel staff friendly too and the wi-fi connection (which I'm using now) is a nice bonus (when it is working).", "helpfulness": 1, "user": "VVD_7", "date": "October 9, 2007", "id": 10059882}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "We stayed here in September, and I was initially worried because there was no air conditioner. However, although it would have been nice, it wasn't as bad as I expected. The hotel was nice, the rooms were small, but it was close to everything and an amazing location. Very good hotel for the price.", "title": "Very nice hotel and close to everything", "helpfulness": 3, "user": "Egordon12", "date": "May 18, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 2.0, "location": 5.0}, "id": 130139754}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "We stayed for 4 nights (Mon to Fri) in April. Lovely place to stay, staff are very friendly and helpful. Rooms are fine, some reviews say a bit small, but ours was just right, it had a couple of armchairs to sit in if the weather turns nasty and you need somewhere to sit and read and tuck in to the complimentary jar of candy. Added to this is the 24hr free coffee and cookies (and fruit on the front desk for the healthy) which they encourage you to take to your room. Try out the different pillows from the 'Pillow Menu'. The Tour desk in the lobby is great, same price as anywhere else for MUNI tickets for cable cars, trolley bus, bus. We were on the 9th floor, overlooking a corner of Union Square and there was no noise from the cable cars which run past the door on Powell Street. Would stay here again.", "title": "Lovely place to stay", "user": "silverfoxes1", "date": "May 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 130123132}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "Stayed at this hotel for 6 nights during first visit to San Francisco.On arrival at hotel all requests placed by travel agent at time at time of booking had been met, (high floor and frontal room location),also a nice touch of a complimentary bottle of champagne and birthday card.", "title": "Chancellor Hotel", "user": "Murdo_12", "date": "May 17, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 130109833}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "Complimentary tea,coffee and cookies available in the foyer 24 hours a day,room was very comfortable and of a good size.", "title": "Amazing Vacation!", "user": "lmstrad83", "date": "May 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 130062432}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "Hotel is in an excellent central location for all the top shops and restaurants and right beside the cable car route,staff were friendly and helpful all together a good experience I would highly recommend this hotel.", "title": "Why stay anywhere else?", "user": "oyvegas", "date": "May 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130056315}, {"rating": 5.0, "stay_parameters": "Stayed December 2010", "text": "This was my 2nd stay at The Chancellor, and it was just as amazing as my first visit! It was my birthday weekend, and we were welcomed with a lovely bottle of wine in our room. The decor is so pretty, and the location is ideal for holiday shopping. So nice to recognize a few of the employees from 2 1/2 yrs ago. That shows to me that management treats their people right, and it shows in their treatment of their guests. I highly recommend The Chancellor to anyone wanting a romantic getaway hotel location!", "title": "Delightfully, charmingly,adorably perfect.", "user": "Karen F", "date": "December 15, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 89936399}, {"rating": 4.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "We liked this cute hotel. Our room was \"smallish\", but spotless, featuring a very comfortable bed, plenty of pillows(hurray!), and enough room for two people to move around.", "title": "Swell time on our anniversary...", "user": "Marc019", "date": "December 11, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 89600751}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "We selected this hotel online, mostly because it featured discounted parking and was right on Union Square. We don't regret our choice. The only downside for us was the spotty availability of hot water for tea in the lobby. We missed having a microwave or a coffeemaker in the room to make getting hot water more convenient.", "title": "Comfortable and well located", "user": "loobs40", "date": "December 7, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 89238727}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "We stayed here for three nights as part of our honeymoon and we were delighted to find chocolates, a present and a bottle of wine waiting for us when we checked in ! We had a room on one of the higher floors (17th perhaps ?) and we had a view of Union Square from the window.", "title": "Cozy in the city!", "user": "RVanslot", "date": "December 6, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 89211634}, {"rating": 3.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "The location is fantastic, with the cable car running to Fisherman's Wharf, just outside the hotel door and large department stores such as Maceys within five minutes walk. The bed was extremely comfortable and the decor and furniture in the room was tasteful. Some may think the rooms are on the small side, but maybe because we are from Europe and have different expectations we found the room size perfectly adequate.", "title": "Over rated hotel in a great location", "helpfulness": 1, "user": "Stephen_301", "date": "December 5, 2010", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 3.0, "sleep": 2.0, "rooms": 2.0, "location": 5.0}, "id": 89041826}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "We ate breakfast most mornings in the hotel restaurant and the service was good. The hotel offers some dicount vouchers for both the restaurant and bar when you check in. Suzy on the Tour Desk was extremely helpful and pleasant.", "title": "Wonderful View, Great Serivce, and Excellent Value!", "user": "ndbrad", "date": "December 2, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 88881412}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "Overall we really enjoyed our visit to San Francisco (see my review of green Dream Tours also) and we intend to visit again, but for a longer holiday. I will certainly book the Chancellor again.", "title": "One of my favorite hotels", "user": "moniclio", "date": "November 30, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 88677280}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "My wife and I and our two teenage sons stayed at the Chancellor for 5 nights in August, 2007. We really enjoyed our stay and highly recommend the Chancellor to other travelers. Foremost, the hotel offers excellent value for the price in terms of its terrific location. We had connecting rooms on the 8th floor facing the front. While the rooms are not large, they are very comfortable and nicely furnished. The staff was consistently very helpful and the restaurant was great for breakfast. The hotel also offers nice extras like coffee and cookies in the lobby, free newspapers, free Wi-Fi access, and complimentary access to a health club a block away. The tour desk in the lobby is also very helpful. The only issue to keep in mind is that the hotel does not have air conditioning and keeping windows open at night could be a problem for light sleepers. We ended up closing our window overnight to cut down on the noise from the traffic below (the cable car goes right by the hotel).", "title": "Highly recommended", "helpfulness": 2, "user": "NJ_Thomas", "date": "September 1, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 8604078, "likes": {"liked": "— Great location", "disliked": "— Having to leave"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled with friends", "text": "I just have to say that a lot of these reviews are bizarre! Checking in was easy and simple. I flew in with my friend and check in wasn't until later but they put a rush on the room. We went to grab breakfast and when we returned, the room was finished.", "title": "LOVED it ALL!", "helpfulness": 3, "user": "d_cheng", "date": "August 30, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8560007, "likes": {"liked": "— Location. Service.", "disliked": "— Didn't stay long enough."}}, {"rating": 5.0, "title": "A Charming Hotel", "text": "The room had a great view of Union Square. The room was really beautiful and amazingly gorgeous. It was clean, everything was great. I can't even describe how wonderful it was. The furniture was amazing, dark and really great. The bathroom was somewhat small but it fit our needs. The closet was a large size and had a safe. The hotel gave options of spa amenities that we could use. They also gave the option of pillows from firm to softer and for legs, etc. It was much more than I expected.", "helpfulness": 2, "user": "UkCheerie", "date": "August 30, 2007", "id": 8548673}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled solo", "text": "There is also a bar and a restaurant and a complimentary computer that you could use whenever.", "title": "Great experience and location", "helpfulness": 1, "user": "darius77", "date": "August 30, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0}, "id": 8547924}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "The the two nights that we stayed there, it was comfortable and more than I really expected. It's near everything that we could have dreamed about. It's near the bars, shops, food, everything!", "title": "Perfect hotel for the perfect trip!", "helpfulness": 2, "user": "MissAmy", "date": "August 29, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8537419, "likes": {"liked": "— It's location at Union Square, complete with Cable Car stop right out the front door.", "disliked": "— Our view wasn't the best, but if we'd been just a few floors up I'm sure it would have been much better."}}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled on business", "text": "STAFF: Fabulous service from Kevin on reservations. Everyone we encountered was genuine, helpful & couldn’t do enough to help you out.", "title": "Highly recommended!", "helpfulness": 3, "user": "L0ve2Fish", "date": "March 25, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 101576083}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "CHECK IN: was seamless.", "title": "wonderful", "user": "herbnurse", "date": "March 23, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 101293662}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "ROOMS: quaint, compact and well appointed. Walk in wardrobe very practical.", "title": "The Chancellor is our home away from home & I wouldn't consider another place to stay in San Francisco!", "user": "Maniladuck", "date": "March 23, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 101267583}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled solo", "text": "LOCATION: fabulous – right on cable car line, near shops and restaurants.", "title": "A great hotel to stay at right in the heart of Union Square.", "user": "rsmith_328", "date": "March 21, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 101059923}, {"rating": 4.0, "stay_parameters": "Stayed February 2011, traveled on business", "text": "CABLECARS: we made great use of a 3day MUNI pass, clocking up 9x cablecar + 8bus + 3subway rides (not that I was counting).", "title": "Pretty good for the price", "user": "ndc121", "date": "March 21, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 101055627}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "My 71 year old mother and I stayed at The Chancellor Hotel on Union Square June 4-7. I had read nearly every review listed on Trip Advisor, and I felt secure in my decision to book my room. I was not disappointed!", "title": "Charming, perfect, adorable hotel!", "helpfulness": 2, "user": "Karen F", "date": "June 12, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 16886274, "likes": {"liked": "— The location and the staff", "disliked": "— Nothing!"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled on business", "text": "Our experience began with being greeted curbside by Matt, the Bell Captain. He was so nice, and helped us with our suitcases and shopping bags. Check in was quick and easy, and we were off to our room within minutes. I had previously requested a room away from street noise, based upon some of the reviews on Trip Advisor, and that was a great decision. Our room was on the back side of the hotel, and we heard very little noise. I also had requested a small refrigerator to be placed in our room, and within minutes of us arriving and settling into our room, the refrigerator was delivered without any problems. (And without a reminder about it!!) The parking garage the Chancellor uses is literally a block away, and even the fellows in the garage were very kind. Our room was adorable! The color scheme was up to date, with a vibrant kelly green and off white paint, with coordinating carpet and furniture. Our room was cozy, and was just perfect with two twin beds, perfect for my Mom and I. We had no issues whatsoever with not having air conditioning, as there was a fully functioning ceiling fan, and that combined with the open window allowed for adequate ventillation. (AND...it was in the 70's each day of our stay!!)", "title": "Excellent stay - a rare find in the heart of SF.", "helpfulness": 1, "user": "mh_traveler", "date": "June 9, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 16806058, "likes": {"liked": "— Friendly staff, clean rooms, good service"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "Every member of the hotel staff was friendly, especially Matt, as previously mentioned, as well as Michael, who works at the gift /transportation counter. One evening, I even went down to see if someone could \"cook\" some microwave popcorn for us so we could watch one of the in room movies. Michael was happy to do so, and came back in two minutes with my bags of popcorn for me. He was very friendly and informative regarding the location of Chinatown, and the cable car system. It was such a nice feeling to walk into the hotel each day, and have someone recognize us each time we came out of the elevator. The day before we left, I asked about using a computer to print our boarding passes, and the gal at the front desk simply said she would take care of it for me. Within a few minutes, I had my boarding passes in hand. Finally, on our last day, another bellman helped us with our bags to the lobby. While I went to pick up the car, he was summoned elsewhere. Not to worry though, as Michael came from behind his counter, and helped us load up our bags into the car.", "title": "Great Hotel", "helpfulness": 2, "user": "MaryCork", "date": "June 6, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 16739890, "likes": {"liked": "— everything", "disliked": "— everything"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled with family", "text": "All in all, not only would I recommend this hotel to anyone who will listen based on how we were treated, but also because of the location! We couldn't have picked a better hotel! Everything we needed was within walking distance. We only drove our car from the airport to the hotel and back! The cable car line goes right in front of the hotel, which takes you right down to Fisherman's Wharf. Chinatown is about 3 1/2 blocks away, as is Macy's, and other wonderful shopping. We never did eat in the hotel restaurant, however, Sears Fine Foods next door was delightful, with their delicious Swedish Pancakes. Lori's diner was 1/2 a block away, and the convienence of having a Walgreen's just up the block made the microwave popcorn a reality.", "title": "good old fashioned service", "helpfulness": 1, "user": "stephen g", "date": "June 6, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 16722571, "likes": {"liked": "— comfy bed"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled with friends", "text": "I want Wes, the hotel manager to know what a great hotel he has, and he should take pride in knowing his staff is truly amazing. Each person loves their job, and I know I wouldn't get that feeling from the people at the \"Big Name\" hotels down the street. This really is a \"Botique Hotel\", and I couldn't even make up something poor to say about this hotel. Everything was great, and I honestly thank you for helping to be part of a wonderful memory, not just a place to stay.", "title": "Loved the Chancellor", "helpfulness": 1, "user": "scopley", "date": "June 6, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 16713734, "likes": {"liked": "— Service and location", "disliked": "— Nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "Having read all the Tripadvisor reviews for the Chancellor Hotel, my wife and I booked 4 nights for our first ever stay in San Francisco. Having read many good things and being particularly impressed with General manager Wes Tyler's responses on this site, I am pleased to say that the hotel lived up to all our expectations. We had a friendly welcome upon check-in by Steve, the guy who dealt with us and the process was quick and very efficient. He also gave us a map and told us to come to reception with any queries. I had made a request to Kevin Vossen prior to travel for one of their reburbished rooms on a high floor with a good view of Union Square and they were able to fulfil this request so thanks very much Kevin!! Brilliant view of Union Square day and night and the windows did a great job of blocking the noise out. The room was nicely decorated and clean. It was more than big enough for our needs and the bed was very comfy! Bathroom was clean and maybe a little small for some but we were happy with it. Having complimentary coffee and tea available (along with the cookies) is a really great idea and gives the guests so much freedom and free use of their computer for internet access is an added bonus. One of the best things about the hotel must be it's location to Union Square, the San Francisco centre and everything else. It's fantastic! We could spend all day sight seeing and then spend the evening shopping with it being so easily accessible! Union Square is also close to all the main transportation routes so is ideal as a base. We were originally going to stay on Fisherman's Wharf but upon visiting it are very glad that we didn't. Too touristy for our liking and a bit further out. Our recommendation is stay around the Union Square area, you won't regret it! So, to get back to it, we throughly enjoyed our trip to San Francisco and our stay at the Chancellor Hotel. San Francisco as a city is really great and our stay was made all the more better with us staying at the Chancellor Hotel. Well done Wes and co. keep up the good work! We may not be heading back to SF for a while yet but we hope that when we next return, the hotel will still be keeping up it's high standards and we'll be staying there once again! One last thing! A nice and thoughtful touch is to have an umbrella in the room closet for us to use - came in handy on our last full day when it absolutely rained all day!!!", "title": "Great hotel in superb location!", "helpfulness": 4, "user": "terracotta_army", "date": "November 19, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 10912766, "likes": {"liked": "— Location & comfort.", "disliked": "— Nothing."}}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "First let me tell you that I spent a great deal of time reviewing hotel after hotel in Union Square before deciding on the Chancellor. I wanted this to be a picture perfect trip with my picture perfect girlfriend who had never visted the city. I could not have been more happy. The manager was wonderful, the staff friendly and helpful, and the location as perfect as you could get. The room was very clean, the extra little things done by the staff (ducky in bathtub, champange in room, frame as gift, pillow menu) made this the nicest hotel I have stayed in in San Francisco. I advise anyone to wants to stay in a clean hotel with a perfect location to stay here. And hey...those bathtubs are HUGE!! I LOVED IT!", "title": "Loved it, loved it, loved it!", "helpfulness": 6, "user": "Frankieitalian", "date": "November 19, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 10910279, "likes": {"liked": "— Location, cleaniness, and charm", "disliked": "— Could not stay longer"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2007", "text": "I have to tell you I was amazed at very few negative reviews that I read and their comments. \"Was noisy\"? Ummm maybe you need to stay in Ohio....see this is a city, and a city it well noisy, thats the glory of it all! Besides (and i stayed on the Union Square Side) with the windows closed I could not hear a thing.Or (this one was my favorite) \"Not enough TV stations\", let me tell you if you are coming to San Francisco and watching TV, you DEFFF need to not leave Ohio. (And I apologize for those people from Ohio who dont complain about these type of things).", "title": "The perfect City Hotel", "helpfulness": 4, "user": "deego", "date": "November 12, 2007", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 10771328}, {"rating": 4.0, "title": "Great Little Hotel", "text": "All in all, I dont think i would have traded in my room at the Chancelor for a room at the Sir Francis Drake next door (and to boot I saved a few hundred dollars a night). Thanks, and we will see you again next year. Also for the travellers who dont want to rent a car, great place to stay as well. Took the BART from the Airport to the Powell Street Stations, got on a trolly and got off 10 feet from the hotel. All for 10 bucks in transport costs. Enjoy SF and enjoy the Chancellor. And staff, Keep up the good work!", "helpfulness": 3, "user": "mishi2705", "date": "November 12, 2007", "id": 10766536}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "Frank", "title": "Experience the charm!", "helpfulness": 4, "user": "vinlin50", "date": "November 11, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 10751108, "likes": {"liked": "— Everything!", "disliked": "— Nothing!"}}, {"rating": 5.0, "title": "Wonderful Stay at the Chancellor", "text": "Just got back from our California coastal trip starting in San Francisco at the Chancellor. I chose our 4 different hotels, including the Chancellor, after reading great reviews consistently on all on Trip Advisor. The Chancellor was everything and more that we thought it would be - very clean, centrally located, with very friendly and helpful staff. After reading reviews on Trip Advisor, we knew the rooms were smallish, that there was no a/c, and that the hotel was an older boutique style establishment, none of which negatively impacted our stay in any way. I would recommend the Chancellor to everyone.", "user": "SuzanneE", "date": "March 23, 2008", "id": 14475509}, {"rating": 5.0, "title": "Oldie But Goodie", "text": "I have to echo the many other favorable comments about service and value. If you are staying in SF and need access to the business district this is the one. (I travel worldwide and stay in many expensive five star hotels.)", "user": "John_and_Marianne", "date": "March 22, 2008", "id": 14453530}, {"rating": 5.0, "title": "You did it again, Wes!!!", "text": "My colleague needed a razor after the hours of the small hotel gift store and the clerk immediately sent out for one and it was brought to his room.", "user": "Rob Mossack", "date": "March 21, 2008", "id": 14438986}, {"rating": 4.0, "title": "Very Satisfied", "text": "Although the clerks were not too knowledgeable when I asked about restaurants with specific cuisines both clerks offered to help with one handing me a Zagat book and the other looking up information on the computer.", "user": "Snakebit12", "date": "March 21, 2008", "id": 14430371}, {"rating": 5.0, "title": "Excellent base for all our needs", "text": "The waitress at the breakfast restaurant anticipated my needs perfectly.", "user": "Missylis", "date": "March 19, 2008", "id": 14382940}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "Just returned from staying three nights at the Chancellor Hotel and have to say that all the Trip Advisor reviews were right on the money. We enjoyed the above-par service, the clean and cozy room (yes, a little tight but workable), the coffee and cookies in the lobby 24/7, and cozy bar where we could enjoy a cocktail in a quiet atmosphere -- all at a very reasonable price. Best of all, the hotel is totally non smoking!! Location is perfect, right near Union Square and in front of a cable car stop, within walking distance of many fine resturaunts and shopping areas. Kudos to the Chancellor for making our stay in San Francisco most enjoyable!", "title": "Location, Location, Location -- and a great hotel", "helpfulness": 4, "user": "jigzmom", "date": "November 4, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 10601115, "likes": {"liked": "— Location, Service, Value", "disliked": "— Small room, but workable"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled with friends", "text": "We have just returned from 4 nights at the Chancellor Hotel, Union Square, San Francisco.", "title": "Can reccomend the Chancellor Hotel in San Francisco", "helpfulness": 5, "user": "imheath", "date": "November 4, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 3.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 10590688, "likes": {"liked": "— LOCATION", "disliked": "— NO AIR CON."}}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled with family", "text": "Whilst appearing to be quite a modest hotel compared to the looks of some of the others, we were impressed with the helpful staff and the superb location.", "title": "Fantastic stay", "helpfulness": 8, "user": "paulwheble", "date": "November 3, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 10573078, "likes": {"liked": "— price", "disliked": "— size of rooms"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled on business", "text": "We were immediatey made to feel welcome, and although the room was smallish, we had everything needed for our stay.", "title": "location, location, location only the beginning, beginning, beginning", "helpfulness": 17, "user": "dr__dawggy", "date": "October 30, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 10444212, "likes": {"liked": "— Attention to details--", "disliked": "— Can't think of a thing I did not like about this hotel."}}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "We spent 5 nights during Christmas week at the Chancellor. Staff, location, decor, comfort, value were all perfect. Our only complaint is that we purchased a package with a $25 per day \"dining\" credit that we planned to use for breakfast, but we could not use it on 2 of our 5 days because the dining room was closed on Christmas day (with no notice to guests) and was \"open\" but unstaffed from 7:00 to 7:15 in the morning the day before when we needed to have breakfast. So we had an unspent balance of $36 at the end of our stay. When I mentioned this problem at checkout, I was given a credit of $10, which to me seemed an inadequate response; I expected at least the $25 for the day the dining room was closed. I also mentioned this problem on my hotel comment card, but I've heard nothing back, so I assume there will be no further attempt by management to do better. Too bad. Nevertheless, we will certainly go back to the Chancellor; it is a great independent hotel.", "title": "nearly perfect", "helpfulness": 2, "user": "JuliaLaJolla", "date": "January 7, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 12423501, "likes": {"liked": "— staff", "disliked": "— dining room hours"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "Well its been said many a time but the location of this hotel makes it a winner, and the price is fab but its all the extra touches that give it an addtional edge the pillow menu, sweetie jar in room, umbrella to use (we didn´t need luckily!, free cookies, tea and coffee in lobby, they also laid on addtional breakfast items xmas day as the restaurant was closed, helpful friendly staff also contibute greatly to the winning package.", "title": "Its all in the details", "helpfulness": 6, "user": "Slewomen", "date": "January 6, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 12395541, "likes": {"liked": "— The attention to detail", "disliked": "— Noisy service room near our bedroom"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "If i had to be picky ( i work in the travel industry for a tour operator and part of my job is checking over properties before people arrive) the t.v reception was poor and the internet did not work in the room also i would have liked a fridge in the room. Our room was comfortable and warm with a great view of union square but i heard some guests were cold in the non south facing rooms. So i´d suggest requesting one when you book. We had some kind of storage cupboard next to our room too which was noisy early in morning with staff banging about", "title": "Pleasant Stay", "helpfulness": 4, "user": "sandysloop", "date": "January 5, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 12360711, "likes": {"liked": "— staff", "disliked": "— No bar scene, restaurant no open for dinner."}}, {"rating": 4.0, "title": "Excellent Hotel", "text": "These are minor things however and i would definately return and highly recommend to others", "helpfulness": 2, "user": "Travel_Luving", "date": "January 4, 2008", "id": 12321238}, {"rating": 4.0, "stay_parameters": "Stayed November 2007, traveled solo", "text": "San Francisco is a great city and this is a wonderful base", "title": "Best value in SF", "helpfulness": 3, "user": "doomster1980", "date": "January 4, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 12316293, "likes": {"liked": "— value for money", "disliked": "— interior decoration, small bath/shower"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "My wife and I stayed here over New Year's Eve and we were throughly satisfied. The room, although small when compared to most modern hotels, was very clean and very quaint. We were on the top floor with a nice view of Union Square. Note - If you don't care for traffic noise you may want a room not facing the street. The staff was very friendly and helpful and since it was New Year's Eve they had extra security measures to prevent \"unwanted\" guests into the hotel.", "title": "New Years In SF", "helpfulness": 6, "user": "TKH_21", "date": "January 12, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 12553246, "likes": {"liked": "— Location and cleanliness of the room", "disliked": "— High traffic area and lots of pan-handlers in Union Square area"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2006, traveled as a couple", "text": "The location of the hotel is EXCELLENT. If you are into shopping, Union Square is surrounded by big retail stores. Food-wise, we couldn't pass up Sears Fine Food (next door to the hotel) home of the \"little pancakes\". Note - get there early (before 8am), when we left there was a line out the door! We also had dinner across the street at Scala's Bistro. It was very busy so instead of waiting 30-40min we took a seat at the bar and had dinner there. The bartenders were nice and the food was good but nothing to write home (or TripAdvisor) about.", "title": "Great Hotel, recommended", "helpfulness": 2, "user": "ianst", "date": "January 12, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 12546025}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "The hotel is right on the street car line which is awesome! You can make it to most of the major tourist spots on this system. Also, the hotel is a few blocks away from the Powell street BART station which is great if you are flying in and not planning to rent a car.", "title": "Location Location Location", "helpfulness": 3, "user": "Panna", "date": "January 10, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 12498721, "likes": {"liked": "— Location, friendly staff", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "All-in-all, I would definately recommend this place and I would stay here again.", "title": "The Only Place I Will Stay Fram Now On!!", "helpfulness": 4, "user": "Sking4357", "date": "January 9, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 12474874, "likes": {"liked": "— location and friendly staff!!", "disliked": "— nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "Stayed for 3 nights in late april 06, highly recommended, helpful staff, clean, great location. No problems with temperature at all.", "title": "Value for money in SF", "helpfulness": 3, "user": "Achille C", "date": "January 9, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 12463584}, {"rating": 4.0, "stay_parameters": "Stayed January 2008, traveled on business", "text": "Stayed here for 2 nights in January 2008.", "title": "Great location, good value", "helpfulness": 4, "user": "TBUK", "date": "January 26, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 13009095, "likes": {"liked": "— Location and renovated room", "disliked": "— The lobby"}}, {"rating": 4.0, "title": "cozy accomodations, helpful staff", "text": "I had a \"renovated queen room\" on the 4th floor for $100 a night. Location-wise, the hotel is a few steps from Union Square, so perfect for shopping and dining, which was why I chose to stay here.", "helpfulness": 2, "user": "jessamyn", "date": "January 25, 2008", "id": 12971814}, {"rating": 3.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "First impression of the hotel isn't great - hopefully they plan to renovate the lobby and elevators soon. You also have to initial about 6 different clauses when you check in, whereas with most hotels a signature and a credit card suffices. This is a petty point, but the hotel logo is also outdated and needs to be something more modern, to go with the renovations.", "title": "Wonderful Location but Basic Hotel", "helpfulness": 19, "user": "ValerieMow", "date": "January 22, 2008", "detail_rating": {"front_desk": 3.0, "service": 2.0, "cleanliness": 3.0, "value": 4.0, "rooms": 2.0, "location": 5.0}, "id": 12892255, "likes": {"liked": "— Its location", "disliked": "— The staff were a bit unfriendly and the rooms were very basic"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "The room itself was great. The renovation meant the room had a modern lick of paint and new modern bedroom furniture...the green was a good choice. I slept well in the bed and could have chosen from a list of 10-12 special pillows to order to my room. There was a large walk-in wardrobe/closet which made up for the size of the room, a little on the small size, and an in-room safe, which was appreciated. The bathroom looked like it hadn't been renovated for 10-20 years but was clean and I appreciated having a \"proper\" bath tub, which for the non-Americans means a tub you can bathe in up to your shoulders. Much appreciated after a long flight!", "title": "Great location", "helpfulness": 4, "user": "cjvw", "date": "January 21, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 12842886, "likes": {"liked": "— Location and large, extremely comfortable bed", "disliked": "— Bar too small to be relaxing, but still priced well"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "With the current exchange rate, this was a very good deal for a hotel in a great location.", "title": "Perfect end to our Honeymoon.", "helpfulness": 7, "user": "Brandycat", "date": "January 20, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 12821936, "likes": {"liked": "— Excellent location, room and staff.", "disliked": "— Having to leave!"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "This hotel is located in the center of the San Francisco shopping district. For the location we expected this room to be priced higher. The room was spotless, modern décor, comfortable bed and courteous staff. We definitely recommend this hotel. Five star hotel for a three star price!", "title": "Great location", "helpfulness": 3, "user": "betanSanDiego", "date": "May 26, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 16398642, "likes": {"liked": "— Everything!", "disliked": "— N/A"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "We picked all of our hotels based on TripAdvisor reviews and this one was the best! The Chancellor is in a perfect location (unless you want to avoid shopping which is plentiful here) for all San Fran travel. Tons of food nearby, starbucks across the street if that's your thing.", "title": "Great Place - what a value!", "helpfulness": 4, "user": "restandrelax84", "date": "May 25, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 16396020, "likes": {"liked": "— location, price"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "The staff were great - saved us a place to unload, gave great directions to avoid horrible uphill climbs and were generally really pleasant. The cookies, always available tea/coffee and candy were a nice bonus.", "title": "Great Value", "helpfulness": 2, "user": "Colsers", "date": "May 25, 2008", "detail_rating": {"cleanliness": 3.0, "front_desk": 4.0, "location": 4.0, "value": 4.0, "rooms": 3.0}, "id": 16390825, "likes": {"liked": "— Location", "disliked": "— Warm room"}}, {"rating": 1.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "The rooms are smaller than some - but we don't spend much time in a room when we travel. The beds are super comfy and the room is well decorated. Water pressure and temp were good - often hit or miss in larger hotels.", "title": "For the birds", "helpfulness": 5, "user": "JandRK", "date": "May 21, 2008", "detail_rating": {"cleanliness": 1.0, "front_desk": 3.0, "location": 5.0, "value": 1.0, "rooms": 1.0}, "id": 16272275, "likes": {"liked": "— Location", "disliked": "— Dirty Room"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "So glad we stayed here and will definately return.", "title": "Chancellor is a great find - but not for everyone", "helpfulness": 4, "user": "bttravellerToronto", "date": "May 19, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 16223407, "likes": {"liked": "— Location", "disliked": "— Temperature control"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled with friends", "text": "My second visit to San Francisco and still like it. We picked this hotel because of the good reviews here and its very reasonable price. Cable car is at the doorstep and there are numerous great restaurants and shopping outlets nearby. We did not eat at the Hotel, though the menu looked good. Instead we have had breakfast twice at Boudin 5-minute walk down the street at Macy's and dinner at Sears Fine Food next door. Both are absolutely fantastic.", "title": "Perfect location, Small room", "helpfulness": 2, "user": "JJB", "date": "April 12, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 103704599}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "The hotel room is really small, though very clean and comfortable. We were given a room on the low floor (3rd or 4th) but we could not hear anything from the street (with windows opened). The bathroom is tiny and what came out from the shower head were nothing more than water powders. You certainly need patience, esp if you have long hair. Pretty understandable though for old buildings.", "title": "Excellent value for money", "helpfulness": 2, "user": "Lucky_Eddie", "date": "April 11, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 103560108}, {"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "The free in-room WiFi was great.", "title": "would stay here again", "helpfulness": 1, "user": "georgeybaby", "date": "April 10, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 103462664}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "For its price and convenience I would stay there again.", "title": "Old style charm with modern comforts and ammenities", "helpfulness": 1, "user": "Lemonfish8", "date": "April 9, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 103433457}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "Based on TripAdvisor reviews, choosing the Chancellor was a no-brainer. So I did, easily, on-line. In the meantime, a relative who visited SF 30 years ago had great memories of a hotel and went to check out which it was. You guessed it - this one. I'm sure a lot has changed since. Including the rubber duckie, which now carries an I-pad and cell phone. But a lot hasn't changed - it's clean, friendly, efficient and well-run.", "title": "Chancellor Hotel in a great location! Rooms are very small especially bathroom.", "user": "HarmonyGirl88", "date": "March 28, 2011", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 101966587}, {"rating": 4.0, "title": "Excellant Location, Excellant VFM - Staff great!", "text": "Fantastic location - on Powell - so next to the tram, easy to get about - main buses and streetcars at the bottom of the road. Close to the shops and Chinatown. Excellant value for money. Rooms were clean and tidy and had everything you could need - iron, safe, umbrellas, rubber duck - seriously.", "helpfulness": 6, "user": "WillowBristolEngland", "date": "February 27, 2007", "id": 6848779}, {"rating": 4.0, "stay_parameters": "Stayed February 2007, traveled with family", "text": "The only downside - didn't think much of the restaurant - but who eats in a hotel when you are somewhere like SF?!", "title": "Does what is says on the tin", "helpfulness": 9, "user": "max1304", "date": "February 24, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 6833894}, {"rating": 5.0, "title": "What a great location and a nice hotel!", "text": "My partner unfortunatly contracted food poisoning (from the restarant opposite, Scala) on the last night - the concierge was fantastic on calling out a doctor etc and were patient whilst I had to run around arranging flights etc and allowed us to stay in the hotel extra late. Unfortunatly the hotel was full so could not stay and extra night, but they arranged a room at the Cartwright round the corner - and the bellboy pushed our stuff up there - so excellant customer service.", "helpfulness": 8, "user": "fld23", "date": "February 21, 2007", "id": 6821220}, {"rating": 5.0, "title": "Chancellor: Amazing Hotel, Beautiful Suite, Perfect Location", "text": "The Valet parking was cool too (if a little dear - like $50)", "helpfulness": 11, "user": "erzeszut", "date": "February 14, 2007", "id": 6788777}, {"rating": 5.0, "title": "Loved it", "text": "Check out the Gold Dust lounge for a drink - down the road - the band in there played all the ol' faves and had a nice friendly atmosphere", "helpfulness": 12, "user": "smudg0r", "date": "February 14, 2007", "id": 6787864}, {"rating": 3.0, "title": "Great location - the hotel \"does what it says on the tin!\"", "text": "First class location in heart of San Francisco. Rooms adequate in size but certainly not large. Standards of cleanliness were OK. Staff friendly.", "user": "A TripAdvisor user", "date": "November 20, 2010", "id": 87684957}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled on business", "text": "I just returned from a five-night stay at the Chancellor and found it absolutely perfect. I am astonished at the review that said she had a horrible bed - we had one of the BEST beds we've ever slept in at a hotel. The location is perfect for access to Union Square, the BART, the cable cars, and there are lots of wonderful restaurants in the area. The entire staff was very helpful, remembering us by name, and doing everything they could to be of assistance (making dinner reservations, looking up BART departure times, getting us a cab, etc.). They provided a mini fridge to our room upon request too.", "title": "Best Value and Top Hotel in San Francisco!", "helpfulness": 2, "user": "CardinalsLady", "date": "November 19, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 87583271}, {"rating": 4.0, "stay_parameters": "Stayed October 2010", "text": "Some may comment on the smallish room and bathroom, but we found it to be more than adequate - and about the size of nice hotels in Europe. If you want to pay extra to say in a suite, fine - go for it. We didn't need air conditioning in November and found the overhead ceiling fan and open windows more than adequate. And our room (909) was incredibly quiet. NO street noise other than the occasional cable car.", "title": "Smiles all round", "user": "Evan_the_middle_one", "date": "November 19, 2010", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 87575118}, {"rating": 5.0, "stay_parameters": "Stayed February 2006", "text": "My husband and I just returned from spending our entire vacation week at the Chancellor. Yes, when we first walked into the room, it seemed small. But of course I've read everything on tripadvisor and we expected that. It would have been small, had we brought kids with us and tried to put a cot in there. But for the two of us, who used the room for a late-afternoon rest each day and then for sleeping each night, it was just perfect. The walk-in closet and drawer space meant we could truly unpack and get rid of our suitcases. The bathroom had plenty of shelving and great supplies. The tub was big enough for 2 to soak in. Plenty of hot water, and everything in the room and bathroom was very clean and pleasant.", "title": "We shall return!", "helpfulness": 5, "user": "geez1745", "date": "February 23, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 4498483}, {"rating": 5.0, "stay_parameters": "Stayed February 2006", "text": "We found the staff to be very friendly and helpful, offering good suggestions when we asked about restaurants and showing us exactly which buses would take us where. In a week, we never had to take a cab, and we explored every neighborhood in the city.", "title": "great location", "helpfulness": 4, "user": "fortwaynejerry", "date": "February 23, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 4498356}, {"rating": 5.0, "stay_parameters": "Stayed February 2006, traveled on business", "text": "We had specifically asked for a high floor, overlooking Union Square, and that is exactly what we got. We were blessed with warm, beautiful weather all week and had our room and bathroom windows open a few inches the entire time. There is also an overhead fan to help cool the room down when the sun streams in. The two elevators are new, very quiet, very fast...just excellent. We never heard a peep from our neighbors. If street noises bother you, just bring some of those little foam earplugs. Or walk a few steps up the block and get some at Walgreens.", "title": "Loved the Chancellor", "helpfulness": 7, "user": "Anniie325", "date": "February 23, 2006", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 4497197}, {"rating": 5.0, "stay_parameters": "Stayed February 2006", "text": "There are complimentary copies of the SF Chronicle, NYTimes and USA Today in the lobby each morning. Excellent coffee and tea, and always some cookies and fruit there for the taking at all times. Freshly popped popcorn many afternoons. Problem-free wi-fi in the rooms or in the lobby, free local phone calls...all these \"little\" things added to the comfort and economy of our visit.", "title": "great hotel", "helpfulness": 6, "user": "David H", "date": "February 14, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4460197}, {"rating": 5.0, "stay_parameters": "Stayed January 2006", "text": "The best restaurants are NOT in Union Square, but half the fun of being there is venturing out to other areas and finding new favorites. We found the absolute best breakfast in San Francisco several blocks away. The hotel's breakfast is very tasty too.", "title": "A True Gem in the Heart of San Fran", "helpfulness": 13, "user": "NickyG411", "date": "January 25, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4386238}, {"rating": 5.0, "title": "The best!", "text": "Not allot to add that hasn’t already been said on the Chancellor that hasn’t already been said before.", "helpfulness": 1, "user": "Benjii", "date": "October 16, 2010", "id": 83723799}, {"rating": 2.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "We stayed at the Chancellor first back in 2008 in a suite (complementary upgrade) so when we were coming back at the end of September we looked again but the rates were a little over budget as we were spending a total of 3 weeks touring California. The General Manager offered me the same rate I could get a much lower rated hotel so of course I took his hand off!", "title": "Appalling", "user": "CDN2", "date": "October 14, 2010", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 2.0, "sleep": 1.0, "rooms": 2.0, "location": 4.0}, "id": 83544164}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "And that about sums the Chancellor up really, they’ll bend over backwards for their patrons. It’s obviously not just for return customers either as the first time we were given the suite after we couldn’t get a standard room with a requested ‘good view’.", "title": "Nice place", "user": "craigmmorq4", "date": "October 14, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 83497461}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled with friends", "text": "This time around we got room 1500 on the top floor, a standard room with a killer view of Union Square. I was glad to get a standard room as I’m aware most of the Chancellors negative reviews relate to small rooms? By European standards I’d say it was above average in size, loved the décor and the bed was really comfortable. We arrived to the surprise of a bottle of wine and a gift in the form of a photo frame-nice touch. Can safely say that the weather was unseasonably warm when we arrived (three figures at times) and we never felt hot despite the lack of air conditioning.", "title": "Great hotel - fabulous location!!", "user": "Toni1012", "date": "October 13, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 83397929}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "I did want to try and meet Wes on this visit and commend him on the good work he and his team do but unfortunately never got the opportunity. But I’m sure he’ll read this as he seems to have his finger on the pulse of his customers.", "title": "I Can't Find Anything To Moan About!", "helpfulness": 1, "user": "Stabler12", "date": "October 12, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 83243151}, {"rating": 4.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "My husband and I recently had a 2-night stay at the Chancellor as part of a long weekend. This hotel is a serious bargain, located just off Union Square and near tons of restaurants and shops. The rooms weren't huge but they were certainly big enough, and the hotel was clean and pleasant. I didn't love the restaurant for breakfast, but head up the block to Lori's diner for a better one. Chancellor is well worth the money.", "title": "Great location, great price", "helpfulness": 4, "user": "linda528", "date": "February 11, 2009", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 4.0}, "id": 24475617, "likes": {"liked": "— Location and price"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2009, traveled as a couple", "text": "We stayed in The Chancellor in San Francisco as part of our Honeymoon in the USA. When we arrived in our room (lovely, comfortable and spacious) the hotel had left us a bottle of bubbly and a gift of a picture frame - we thought this was a lovely touch - esp as none of our other hotels had done anything like that or acknowledged we were on our honeymoon. The location is perfect - right next to a cable car stop and the atmosphere around Union Square in the evenings is great. The bellboy and bar man in particular were so helpful and friendly. could have stayed chatting all night! The hotel also provides tea, coffee in the lobby area (though unfortunately we only found out about it on our last night ) and even popcorn on the Saturday night. I would definitely recommend this hotel to anyone - its in a nice busy & atmospheric part of San Francisco but is still quiet and peaceful inside.", "title": "Great location & Lovely Staff", "helpfulness": 6, "user": "Liosdara", "date": "February 6, 2009", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 24310013, "likes": {"liked": "— Location and room", "disliked": "— the tiny lifts!"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2009, traveled as a couple", "text": "The location, on Union Square, is ideal. What's more, the twin-bedded room was spacious and well-appointed. The staff, from desk clerk to barman (and woman) to housekeeper were courteous and helpful. The endless supply of tea, coffee, cookies, and apples in the lobby was a treat. And the rate was most economical for the quality of service we received.", "title": "Location location location and more!", "helpfulness": 3, "user": "imatractor", "date": "February 2, 2009", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 24093481, "likes": {"liked": "— The service and the room", "disliked": "— There was nothing we did not like"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2009, traveled as a couple", "text": "We were here for our honeymoon and were so pleasantly surprised. It started with our welcome gift of champagne, glasses and a wooden picture frame. The location is safe and seriously right by the cable car stop. The hotel is also close to great restaurants like Sears (breakfast) and Uncle Vito's (Lunch/Dinner).", "title": "Perfect!", "helpfulness": 4, "user": "rondeau09", "date": "January 28, 2009", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 23979406, "likes": {"liked": "— Location, Location, Location", "disliked": "— We liked it all :)"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2009, traveled as a couple", "text": "The hotel is respectful of privacy. We left the \"Do Not Disturb\" sign out while we were gone for the day to skip the room cleaning. We came back to a polite note under our door saying that they acknowledged our sign but would be happy to bring us fresh towels if we would like.", "title": "a classy gem", "helpfulness": 3, "user": "dansaintpaul", "date": "January 22, 2009", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 23784279, "likes": {"liked": "— location"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "Great hotel, fantastic location and brilliant staff. What more could you ask for?!", "title": "Fantastic", "helpfulness": 3, "user": "cd1979", "date": "October 23, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "business": 4.0, "cleanliness": 5.0, "rooms": 4.0, "location": 5.0}, "id": 10248323, "likes": {"liked": "— Loction and staff", "disliked": "— Nothing!"}}, {"rating": 5.0, "title": "Small But Beautiful", "text": "I have stayed in a few hotels in San Francisco and this is easily the best value. Just off Union Square, it’s perfect for shopping and sight-seeing.", "helpfulness": 4, "user": "PandaScotland_UK", "date": "October 23, 2007", "id": 10247900}, {"rating": 4.0, "title": "Europoean Style Hotel", "text": "I would thoroughly recommend the hotel to all travellers.", "helpfulness": 7, "user": "Ajudes", "date": "October 18, 2007", "id": 10114104}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "I stayed at the Chancellor Hotel last month and was delighted with the service and accommodation. The rooms, although smaller than the usual American standard, were perfectly adequate and comfortable. The staff were extremely helpful and the extras provided made our stay at The Chancellor very memorable. The coffee & cookies, on tap 24/7, is a great boost, along with the apples and popcorn. I would certainly recommend this hotel, in fact I have been doing so back at work and to my friends. If I go back to San Francisco I will certainly be staying at The Chancellor.", "title": "Best Place I have Stayed", "helpfulness": 5, "user": "actual_al", "date": "October 17, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 10090090, "likes": {"liked": "— the staff"}}, {"rating": 5.0, "title": "Chancellor hotel a great stay", "text": "I have used Tripadvisor extensively for the past few years. I decided to give the Chancellor Hotel a try due to it's reviews. Hotels as a whole are expensive in San Francisco & this one seemed to be a bit more moderately priced. My expectations were not high but my hopes were. As we entered the lobby my heart sank as it is drab, dreary & dull! We continued up to our room in one of the tiny elevators. Following the narrow hallway to our room, it made me think of historical hotels we've stayed in in NYC & Europe. We were pleasantly surprised when we entered our room! Although the room was very small (no room for a roll away), it was tastefully decorated. It's bedding was excellent. It had 4 pillows (you can request a variety of options), a fiberfill mattress topper, as well as 2 duvets with excellent linens. The carpet was newish with a tasteful plaid. The windows had sheers plus black out drapes which allowed sleeping in. Ours looked out on Powell & since we were on the third floor, when the window was open, it was very noisy. However, when closed it was very quiet & did not cause us any problem. ( They should do commercials for the effectiveness of their windows.) You would not be able to sleep with it open due to the noise, however. The hotel is not air conditioned but a ceiling fan was very efficient & served our needs. The bathroom is so tiny two people can't be in it at the same time, unless one wants to stand in the bathtub. However, it has a nice makeup mirror, good shower head, & plenty of lighting. In the room we appreciated & took advantage of the suitcase stands & safe & ice machine down the hall. In the lobby we enjoyed the gratis coffee, cookies, apples & newspapers provided. All the staff we met were pleasant & accommodating. We were very impressed with Susan who books tours, etc, as she seems to work at least 12 hour days in little more than a closet. Other than the lifeless lobby, the hotel is lovely.", "helpfulness": 6, "user": "gopher40", "date": "October 15, 2007", "id": 10083796}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled with family", "text": "My young adult son and I stayed here for one night at the end of my birthday weekend, early February. Though a bit more expensive than deals at other boutique hotels in Union Square, the very positive reviews and ratings intrigued me and made me curious. The Chancellor's friendly, helpful staff, cozy charm, and clean old fashioned rooms were perfect. Watched the Super Bowl at the cute hotel bar, with elegant Irish bartender and other guests (all men except for me). Late dinner delivered, free of charge, from a nearby restaurant. Perfect stay!", "title": "Great, well maintained old fashioned charm", "helpfulness": 2, "user": "Dragonfly2", "date": "February 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124985374}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "So glad I chose the Chancellor, and look forward to staying there again.", "title": "Cozy hotel, ideal location", "helpfulness": 2, "user": "MongoSchwartz", "date": "February 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 124977508}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "Somewhat accidentally found this hotel after searching my \"regular\" hotel on Union Square bumped their prices from my previous stay there. A quick search on tripadvisor yielded this superb, economical find.", "title": "Great Hotel, Superb Location", "helpfulness": 1, "user": "hercapo", "date": "February 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124878249}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "The rooms are small, reflective of an \"older hotel,\" but well-appointed. The staff is extremely friendly and willing to assist as best they can--they even offer day/multi-day passes for the cable car/streetcar/bus lines which offers a tremendous value to travelers.", "title": "A quiet sanctuary off of busy Union Square", "helpfulness": 2, "user": "Jen C", "date": "February 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 124757626}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "Be aware, though, if you're looking for a late night bite, or a cocktail, the bar and smallish restaurant close early (around 9:30). But there are plenty of other walkable nearby options if the mood strikes you there. The \"business center\" such as it is, consists of a computer on a desk next to the reception desk. But it served my basic functional needs.", "title": "Fantastic location - perfect for the first time and repeat visitor", "helpfulness": 1, "user": "Shona-Charlie", "date": "February 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124727406}, {"rating": 3.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "I rate this hotel average only because the rooms were a little on the old side and had", "title": "LOCATION LOCATION LOCATION with a GOOD PRICE!", "user": "skylane9", "date": "May 22, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 130431166}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "that old smell to it. Kinda of a personal thing.", "title": "Perfect for short stay in San Fran", "helpfulness": 2, "user": "GromitDublin", "date": "May 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 130398302}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with friends", "text": "The bathroom was nice and clean but the bed was the best part of the room really very nice, we slept like a baby.The location was fantastic right at Union Square with all the shopping at a very very good price. We checked out the others and this was half the price at or around Union Square.The service was very good, the girls at the front dest were delightfull and very helpfull.", "title": "Location and price!", "helpfulness": 2, "user": "janao", "date": "May 21, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 130327190}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "The hotel restaurant you might want to pass on. Parking is avalible for hotel right around the corner at a price but its fare.", "title": "Great place, great treatment!", "helpfulness": 2, "user": "Ron P", "date": "May 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 130302077}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled on business", "text": "In terms of location, the Chancellor hotel couldn't get any better - (a) just a few minutes walk from the Powell St. BART station (which goes to / from the airport), (b) on union square so very near Westfield Shopping centre and also a nice enough area and (c) on the Fisherman's Wharfcable car route. It's also near a lot of the car rental companies.", "title": "Excellent Location", "helpfulness": 1, "user": "Robbin V", "date": "May 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 130249647}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "We stayed at the chancellor at the end of our roundtrip through california, arizona and utah. It was a really nice hotel with very friendly personel, who where ready to answer all of our questions at any time and gave us great tips on where to go and eat. Nice clean room. The lokation is great, central in the city on union square, from were you can get almost everywhere.", "title": "good hotel, nice lokation and very friendly personell!!", "helpfulness": 2, "user": "johnnyreggea", "date": "November 26, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 11066869, "likes": {"liked": "— lokation, friendly staff", "disliked": "— shuttle service"}}, {"rating": 3.0, "stay_parameters": "Stayed November 2007, traveled on business", "text": "The only thing we regret is the poor shuttle service, which we were shown at when we asked tot call for a cab to the airport. We were cramped in to small fan with 7!! persons, when we complained the driver just ignored us and said that it was'nt his responsibility.", "title": "Value but thin walls", "helpfulness": 2, "user": "peachesdad", "date": "November 25, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 4.0, "rooms": 2.0}, "id": 11057271, "likes": {"liked": "— service", "disliked": "— easily-heard neighbors"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "This was the only negative thing we experienced at our stay.", "title": "Exceeded our Expectations", "helpfulness": 2, "user": "Burbankre", "date": "November 24, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 11032555, "likes": {"liked": "— Price, quality and location", "disliked": "— Loud toilet, unable to control room temperature"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "I would like to recommend this hotel very much.......but don't use the shuttle service!", "title": "A great value in San Francisco", "helpfulness": 1, "user": "sadie05", "date": "November 21, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 10964045, "likes": {"liked": "— The great location", "disliked": "— Nothing!"}}, {"rating": 1.0, "title": "Don't Stay Here!", "text": "The Chancellor actually gets 5 on service/value & 2.5 on ambience. I got $100/night via Expedia-great rate for downtown SF on Union Square for an older but upgraded facility that had free and reliable wireless internet, free access to a health club 1 block away, free paper, coffee, cookies, immaculate, & excellent customer service. Comfortable bed but room small, dark, somewhat depressing, mournful-green decor. Real problem-thin walls. In my first room, my neighbor came in at 3 AM, loud conversation, easily heard, awful night. Not the hotel’s fault though they were more than gracious in getting me a room on the top floor, away from cable car noise, & with much better light. Also retrieved a couple of things I forgot in the course of the move. Could still hear conversation next door but not at all hours of night, an improvement. Bottom line-excellent value if you are a deep sleeper.", "helpfulness": 4, "user": "advocate73", "date": "November 19, 2007", "id": 10925466}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "We found the Chancellor Hotel on Trip Advisor - and were very happy we did.", "title": "I have recommended The Chancellor to friends", "helpfulness": 4, "user": "MIRay", "date": "September 4, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 8655198, "likes": {"liked": "— The location"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "The location is excellent – great shopping and dining all around the hotel. The BART, cable car, and street car are all within 3 blocks (do not rent a car - buy the MUNI pass).", "title": "Best Location, best place to stay and service", "helpfulness": 6, "user": "krissanthosh", "date": "September 4, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 8654845, "likes": {"liked": "— Everything"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "The rooms are small but very clean and nice - awesome bed and pillow menu.", "title": "\"Amazing!! From Liverpool with Love!\"", "helpfulness": 2, "user": "Timelessmelodys", "date": "September 3, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8614543, "likes": {"liked": "— Location, service & price", "disliked": "— nothing!"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled on business", "text": "The staff could not have been any nicer – from the front desk to housekeeping.", "title": "wonderful hotel wih great services", "helpfulness": 2, "user": "manny02", "date": "September 3, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 8613601, "likes": {"liked": "— great services; free internet connection; next to activities in the area", "disliked": "— No Air-conditioning; not enough plugs for electrical traveling stuff; furniture is too cluttered"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2007", "text": "All this being said – it must be the best value in San Francisco as the room rates were at or below most in the area. If we visit San Fran again, we will stay here again.", "title": "Good value hotel, great location", "helpfulness": 3, "user": "RedRose49er", "date": "September 2, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 5.0}, "id": 8605585}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled on business", "text": "This hotel is located near various transportation options. It was perfect for hoping on and off the cable car. We had a room overlooking Powell St., it was a little noisy but exactly what we had expected. If you must have it absolutely quiet to sleep don't stay on that side of the hotel. We enjoyed listening to the city below. Room was clean, small (but large enough for the 2 of us), nicely decorated. Staff was friendly. Would definitely stay here again!!", "title": "Great location!", "user": "jennobrn", "date": "December 19, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 90221838}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled solo", "text": "My 3rd stay here and it is a perfect fit. Stayed for 5 nights and this time was placed at the front of the hotel which I thought would be noisy. However once window closed there was only the faint noise of the cable car which if you on union square is a lovely sound. I like that you are in the centre of everything and able to use transit to get to all areas of the city and then be able to return to your cosy room at the end of the day. For a solo traveller the rooms are roomy and as stated the closet is very large. The bathroom is small and adequate and has lovely green tea bath products. Pillows and bed is very comfy and as stated the hotel is historical so the hallways are a little tight . Staff are very friendly and will store your luggage if you have a later flight so you can explore more. Free access to printer and internet in lobby. Had breakfast in restaurant one morning and was scrumptious. I was contemplating trying a different hotel on this visit. I am glad I didnt!!!", "title": "It Is A Treasure", "user": "gavve60", "date": "December 16, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 89994228}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "This isn't the first time I have stayed at the Chancellor and I'm certain it will not be the last.", "title": "Wonderful stay", "user": "lizone", "date": "December 15, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 89967257}, {"rating": 4.0, "title": "Great Location", "text": "Great location-right in Union square. Reasonable pricing. Staff was helpful. MUST DO --- eat @ Tommaso's in North Beach for good Italian", "user": "taddona", "date": "May 12, 2005", "id": 3462544}, {"rating": 5.0, "title": "Fantastic first stop on our trip", "text": "This was our first hotel on our trip to the USA. It was in a fantastic location right on Union Square, with a cable car stop to Fisherman's Wharf etc right across the street, and within walking distance of Chinatown.", "user": "n-and-k", "date": "May 8, 2005", "id": 3449219}, {"rating": 4.0, "title": "Great location on Union Square. Cozy Room", "text": "The staff were welcoming, very friendly and genuinely helpful (recommended restaurants, provided directions and bus advice).", "user": "spyderball", "date": "May 4, 2005", "id": 3437217}, {"rating": 5.0, "title": "Ambassadors for San Francisco and America……", "text": "The room, although it didn't have a view of Union Square, was quiet (considering its location), clean and airy. The room service was excellent, with plenty of clean towels and fresh linen, not to mention the little extras like the jar of sweets (no charge), choice from a menu of pillows (no charge) and being able to order a foot spa in the room after a long day walking round the city ($4 for 24 hrs) - very welcome!", "user": "A TripAdvisor user", "date": "April 28, 2005", "id": 3421031}, {"rating": 5.0, "title": "Hotel with Character", "text": "The breakfast in the hotel was fairly expensive, but the service and food was good. It's not a problem since there are dozens of places to eat within a few minutes walk (especially next door!)", "user": "A TripAdvisor user", "date": "April 26, 2005", "id": 3417335}, {"rating": 5.0, "title": "Clean & great location--plus wonderful apples, cookies, coffee", "text": "We stayed here 3 nights in February and really enoyed our stay. It's on the cable car line and right at Union Square where you can shop, take an on-and-off bus, etc. We loved the apples at the front desk and the coffee (or hot water for tea) and cookies near the elevator. OK, our room wasn't very big (although we had the biggest bathtub I've ever seen), but it was big enough and very clean. It had a huge closet where we kept the things that might normally have been kept out in the room. And though we had sunny days the whole time we were in SF, we were delighted to know that an umbrella was in the closet for use if needed. I'm not sure about this, but I think I read that this hotel is not air-conditioned, so you might want to check on that if you are staying in the summer.", "user": "heartimes", "date": "May 16, 2012", "id": 130044784}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "We were on the third floor, and I like to take the stairs whenever possible. The stair well is narrow and a bit twisty--an interesting reminder from this historic hotel that people weren't always the super-size we often are now. Anyway, because I used the stairs, I discovered a tiny wall-niche take-one, leave-one library (on the second floor, I think). Anyway, although I didn't end up getting a book, it was fun to look at all of the books in languages I don't read, certainly a commentary on the kind of international clientele served by the Chancellor Hotel. We would very definitely stay here again.", "title": "Great hotel and perfect location!", "user": "jaxgal", "date": "May 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130012308}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "My husband and I spent the last week at the Chancellor. What a great place! We had originally booked the Donatello but switched last minute due to the bad noise reviews, we are so glad we did. From the time we booked over the phone till the day we left, everyone is very nice and helpful! Be sure to buy your Muni pass from the tour desk, very convenient!! The room was always very clean. Yes it is a bit small, but who spends time in the room anyway?! We were on the 8th floor and noise was really not an issue. We would close the window at night and could barely hear the street cars and noises. Loved the location right next to Union Square, easy to find places to eat and transportation. Had a good time at the tiny bar one night, we just wish it was open later. Highly recommend this hotel even for a longer stay!", "title": "Great location!", "user": "EmAndAl2011", "date": "May 15, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 129982380}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "We stayed here in June 2011, really great location right in the heart of SF. Rooms were ideal, clean and average size. Great base to explore SF from! We drove a hire car from the airport and had to park a few blocks away in a secure carpark for a charge, was slightly inconvienient but you can't really expect more in such a big, busy city! Would definately recommend to other travellers!", "title": "Favorite place to stay in SF", "helpfulness": 2, "user": "julesofthesea", "date": "May 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 129954281}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "Love this place. Best possible location, 1/2 block off Union Square; great SF historic decor; spotless; terrific staff; intimate bar and healthy food.", "title": "Even better the second time around!", "helpfulness": 2, "user": "Harveysgirl", "date": "May 12, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 129837470}, {"rating": 2.0, "title": "Average", "text": "My wife and I stayed here for 3 nights after a wedding in Las Vegas.", "user": "vwman", "date": "March 7, 2008", "id": 14115434}, {"rating": 5.0, "title": "Great Affordable Location in San Francisco", "text": "First problem was unloading the car outside, there was nowhere to park.", "user": "julphil", "date": "March 3, 2008", "id": 14004777}, {"rating": 5.0, "title": "Great hotel, great price", "text": "Next problem was when booking in, we were informed there was a mistake in the price that we paid directly to the Hotel some 4 months in advance, we were told that it was an extra $160 to pay.", "user": "oldben", "date": "March 2, 2008", "id": 14001778}, {"rating": 4.0, "title": "No Question! If you have the chance, stay at the Chancellor", "text": "Why in the previous 4 months they could not have informed us is anyones guess, so paying the extra was a big let down.", "user": "dh4", "date": "March 1, 2008", "id": 13964563}, {"rating": 5.0, "title": "Hope to come back", "text": "Finally when we stopped off in the bar on our last night for a drink we were told the bar was closed, it was 10.45pm.", "user": "Hoff-dk", "date": "February 29, 2008", "id": 13937169}, {"rating": 5.0, "stay_parameters": "Stayed May 2008", "text": "I am so happy I consulted Trip Advisor before I booked this hotel last minute. It is in such a great location in Union Square, right next door to Sears -- a wondeful breakfast spot; rooms remind me of an old NYC apartment. So nice and tastefully done. Modernized for today's comfort but not modern. The old touches are still preserved. I can't say enough good things. Staff was very helpful. Would definitely recommend and stay again on our next visit to San Francisco.", "title": "A Gem!", "helpfulness": 1, "user": "justanothertourista", "date": "June 4, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 16664755, "likes": {"liked": "— the old world charm", "disliked": "— the lobby/restaurant area"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "As usual, I used Trip Advisor as my final decision when selecting a hotel for our long weekend getaway in San Francisco. Wonderful staff, great location, great room. There are so many options for public transportation within steps of the hotel. On our last day in town, it was raining and the complimentary umbrella came in handy. Of course, the rubber ducky was a cute touch to the room decor! I would stay at the Chancellor again, hands down!", "title": "What A Great Stay!", "helpfulness": 1, "user": "sfine", "date": "June 1, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "business": 5.0, "cleanliness": 5.0, "rooms": 4.0, "location": 5.0}, "id": 16581304}, {"rating": 5.0, "title": "Unbeatable Location and Service", "text": "We had a lovely 9 night stay at the Chancellor in May, thanks to Tripadvisor's accurate guest reviews. Thank you Chancellor staff, you're the best! Everything we were looking for in a smaller intimate hotel, about 100 years old: location, location, location, fine service, a charming place for an anniversary trip. We were also in SF for a family wedding at the ritzy St Francis across the street. After studying the different Union Square hotels, we emailed the most promising, requesting a special extended stay quote, and then wrote the Chancellor, asking could they improve on the best offer received, which they did. We were able to stay for 9 nights for less than $1,500. They even had a card & anniversary gift for us. My son and daughter in law also reserved for a shorter stay. They were also delighted & kept saying what a charming hotel (how did you ever find such a gem?). All in all, it was better than we had anticipated. Kudos to the fine staff, who responded promptly & courteously, even providing a small fridge on request. Susan, who effortlessly handles gift shop and concierge duties, arranged for terrific sightseeing trips: wine country, the redwood forest, Monterey and Carmel, Yosemite Natl Park, city sightseeing. We saved so much money on accomodations, we were able to do it all. Airport shuttle is just $14. (Don't forget SF can be chilly & windy even in August. Dress in layers, and Enjoy.)", "helpfulness": 3, "user": "maerose", "date": "May 30, 2008", "id": 16527937}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled with family", "text": "(This was a father/son get-away, booked by mom, reviewed by son, and entered by mom!) I found this hotel through T/A and choose it based on reviews. The first morning they were there, I received praise from both saying much they liked it, and that I had made a great choice. Whew! These guys were so impressed with the architecture, the rooms and the staff. Comments on the beds were positive - soft and nicely appointed. Views from the 13th floor were great. They were never hot. The days were pleasant; nights cool. They slept with the window open, with no noise from outside. The bathroom was not roomy, but served the purpose. (This room sounds much like a very special hotel we stayed in on a trip to Edinburgh, Scotland; small but tasteful.) We are so spoiled in this country by mega-motels, and they are nice for certain purposes, but when you want a comfy bed in a stylish environment, at a reasonable price, in a great city, the Chancellor fits the bill.", "title": "Recommended", "helpfulness": 4, "user": "ChattTraveler", "date": "May 28, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 16474752, "likes": {"liked": "— Architecture, comfort, location", "disliked": "— TV too large"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "The location was perfect - much better than the tourist trap of the Wharf. The staff was so helpful and friendly. They didn't eat in the hotel, so can't comment on dining. (A great coffee bar around the corner was Cafe La Taza, and for fine ($$$$) dining they went to Farallon, and had a spectacular meal.) The guys thank ya'll for a great weekend, Wes and staff!", "title": "Perfect for us", "helpfulness": 3, "user": "winelover50", "date": "May 28, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 16469433, "likes": {"liked": "— Architecurally interesting building, quaint, very clean", "disliked": "— Room wasn't ready at check in, had to wait, then got a different room"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "Old fashioned hospitality in a perfectly maintained hotel, at a great price, in a top notch area! The employees at this hotel are friendly, helpful and welcoming. Plus the hotel is attractive and clean. The manager should give himself a pat on the back as he obviously knows his job and does it well. Our room looked just like the web site. Starched white bedding against a nice green wall. Looking out our window we could see beautiful Union Square all decked out for Christmas. The elevator worked and was never overly busy. The free coffee in the lobby was better than the diner's next door...and always available (along with cookies and daily newspapers). The free internet in the lobby was helpful as were the people at the front desk who seemed glad to help you find restaurants etc. We didnt eat breakfast at the hotel's restaurant because so many tripadvisors raved about Sears which is next door...so wanted to try that...but saw a very intersting specials board when we got back, and wished we had eaten there instead. The hotel gave us free cable car tickets which we used to go to Fishermans Wharf where we took a boat to Alcatraz. The hotel is in a perfect location for shopping. Saks 5th Ave is across the street and there's a huge Macy's, and too many other stores to name them all...lots of designer shops too. Union Square is sort of in the middle of the city, so every area is within walking distance. We walked to China town, the Embacardo, and Nob Hill.", "title": "Great location, friendly staff", "helpfulness": 8, "user": "heqwerty", "date": "January 4, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 12315406, "likes": {"liked": "— Location and friendly staff & the rubber duck!"}}, {"rating": 4.0, "title": "Great Hotel!", "text": "Just returned from spending three nights at the Chancellor with my sister. Loved the location & found all the staff very friendly.", "user": "sunsettravel", "date": "February 29, 2008", "id": 13923135}, {"rating": 5.0, "title": "Excellent Stay at the Chancellor", "text": "The rooms are compact but perfect for a great nights sleep. Always felt safe in the hotel.", "user": "Sdelphinus", "date": "February 27, 2008", "id": 13897920}, {"rating": 1.0, "title": "Small with NO Air Con", "text": "The complimentary cookies/popcorn/coffee/tea was appreciated & added such a personal touch to the hotel.", "user": "boutiquee", "date": "February 26, 2008", "id": 13862592}, {"rating": 5.0, "title": "great location/sensational service", "text": "Would stay there again!", "user": "travelforsnow", "date": "February 23, 2008", "id": 13794815}, {"rating": 5.0, "title": "loved the Chancellor", "text": "Pam", "user": "bettina222", "date": "February 23, 2008", "id": 13793201}, {"rating": 5.0, "stay_parameters": "Stayed March 2005", "text": "I stayed at the Chancellor with my girlfriend from the 26-31 march. Our first impression of the hotel was great, excellent location, quick check in, friendly staff. Great coffee and cookies. And a very comfortable room. The bed was extremely comfortable, the bathroom very clean, great powerful shower. Down in the lobby you have a bar, gift shop/tour desk, free coffee, restaurant, internet access , what more could you ask for. TY and Alicia working behind the bar were very friendly and informative and great bar tenders. Susan working at the tour desk was very friendly and helpful. And the doormen were extremely efficient especially the guy who has been there for 30 years, Apologies for not knowing his name. Before we even got to the hotel I had exchanged E-Mails with the manager and another staff member Darla Snodgrass, I had requested if they could possibly get me tickets for a concert that I was hoping to see while I was there, this was dealt with efficiently and without fuss, It was just a shame the show was sold out. We read a lot of reviews on here with people going on about the lifts , one lift was out of action but waiting around a few minutes for the lift was not a huge deal , while we were there one of the new lifts opened and this was a lot quicker and held more people. What would help the lift situation would be people who are perfectly fit and healthy and staying on the 2nd 3rd and 4th floors to walk down the stairs rather that stopping the lift. I was staying on the 11th floor and managed to walk down in a few minutes.The location is excellent , right on union square, cable car stop on the corner, walgreen pharmacy open 24hrs on the corner. Within walking distance of all the top shops. All in all this was superb holiday , great hotel , great city and we will certainly return to this hotel.. Happy Holidays.", "title": "Excellent. You must stay here", "helpfulness": 9, "user": "woggle", "date": "April 3, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3325121}, {"rating": 4.0, "stay_parameters": "Stayed March 2005, traveled on business", "text": "We have stayed here on several occaisions this past year and were never disappointed. The staff is very attentive but low-key. The hotel is well maintained. The rooms are quiet and well appointed. The location is superb. Overall its a great value. It can take time to get your car if you want it between 10 and 11 AM. We look forward to the completion of repairs that will bring elevator #2 back on line. For those who complained about slow checkout, maybe the hotel should offer checkout through the TV like some other hotels do. Wes, you need to lighten up a little on your reaction to some of these reviews. You can't please everyone, but based on this website, you come awful close to it. Keep up the good work.", "title": "We are lucky to have this hotel in SF", "helpfulness": 3, "user": "sgoet", "date": "March 30, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 3312468}, {"rating": 3.0, "stay_parameters": "Stayed February 2005", "text": "we stayed their, 27-feb-05 for 4 nights and The hotel is gorgeous, our room was extreamley clean, the decor was nice and modern (plain/fresh looking) and the location is 2nd to none!! we had a brilliant stay in San Francisco only one night when we went out we had our Wallet stolen, which ment we had to cancel all of our credit cards and had very little cash on us, anyway as soon as this happened i went to the front desk to make them aware that if they have not yet already taken the money of off my card that now it will proberbly will not work as i had to cancel them all, basically the hotel people didnt ask if we were ok they just wanted to know how we were going to settle our bill, i think that this was most unconsiderable, as we were thousands of miles away from home with no food, no money and all the hotel cared about was me settling the bill, i mean its not like i couldnt of settled it at a later date. they had all my details so it was not like i was trying to get out of paying. i think that if you had thought more about the safety of your customers rather then there money you would be the best hotel ever. thanks for everything as i was a very nice stay, but i think you should take note of what i have said as this could happen to another customer and if they was not lucky like us, i mean getting money the next day then i dont know what we would have done as you didnt look like you wanted to help us at all", "title": "Lovely Hotel", "helpfulness": 4, "user": "bdf3077", "date": "March 23, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 5.0, "service": 2.0}, "id": 3296539}, {"rating": 4.0, "title": "Great Location, Wonderful staff", "text": "We spent 8 days at the Chancellor on Union Square during February. The hotel is perfectly situated for shopping and touring - there's a huge Macys right across the square. The cable car runs right outside the hotel and goes all the way down to Fisherman's Wharf where you can do loads of things - within the hotel there is a tourist desk where Susan will arrange pick-ups for you - to the airport, coach tours, the lot - she was extremely friendly and very very helpful! We did a tour to Muir Woods - excellent and great views of SF from across the bay in Sausalito!", "helpfulness": 9, "user": "Fdpm", "date": "March 17, 2005", "id": 3280542}, {"rating": 5.0, "title": "Fabulous Hotel", "text": "The hotel rooms are clean and although the beds are a bit small; we would have preferred Queens, the overall comfort is great for the price. We thought the little extras like the jar of sweeties and cotton buds in the bathroom were nice and made it seem very homely.", "helpfulness": 10, "user": "A TripAdvisor user", "date": "March 17, 2005", "id": 3280235}, {"rating": 5.0, "title": "Great Value", "text": "This may be the best value in the US for a hotel in the tourist center of a tourist city. The Chancellor has a 1920s feel. The rooms are nothing fancy and on the smaller side, but they have a lot of character. The bathroom, for instance, has a real high-sided tub with shower, not a modern shower. If you want luxurious and up to date, best go elsewhere.", "helpfulness": 20, "user": "northstartravels", "date": "March 3, 2006", "id": 4579632}, {"rating": 4.0, "title": "Wonderul Location, Wonderful staff", "text": "If you like an older feel and want value, this is the perfect hotel. I booked online and paid $89 (pretax) for my room-- not a special rate. The room had a partial view of Union Square. The wireless access was free-- I was on business and this was very useful. The hotel has an arrangement with a neighbor health club for free use. The staff was friendly and helpful. Everything was clean and well-kept. If I had paid $200 a night, I would have been satisfied. I was almost a little fearful of what I would get for the price, but wow...", "helpfulness": 15, "user": "ARTravelers", "date": "March 2, 2006", "id": 4570049}, {"rating": 4.0, "stay_parameters": "Stayed February 2006, traveled on business", "text": "This hotel is on the cable car line with stops just outside the door. The ride to Fisherman's Wharf is about 15 minutes and great fun. The hotel is across the street from high end shopping and within walking distance of some great restaurants. The staff was wonderful, they did everything possible to make sure our stay was enjoyable. I have two less than wonderful comments: 1. Our room, 1208, was in need of updating; sad carpeting and bedding. 2. Our room was not air conditioned. This was not a problem since temperatures were mild and we left windows open. However, even on the 12th floor, street noise often was distracting. That said, though small and dated, the room was clean with nice toiletries and two comfy chairs. We would definitely stay there again.", "title": "Great Stay!", "helpfulness": 8, "user": "okmac", "date": "March 2, 2006", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 4568719}, {"rating": 2.0, "stay_parameters": "Stayed February 2006, traveled on business", "text": "My wife and I got away for an extended weekend and we were quite pleased with the Chancellor. We booked it on advice from others here at Trip Advisor and we were not let down. The location is superb, the rates are excellent, the staff was friendly, nice and courteous and the rooms were clean (yes, and small). We stayed on the back side of the hotel, no view, but quiet! We loved the cookie tray, pillow menu and rentable room-spa items. Would stay again and highly recommend.", "title": "Reminds me of a sultry dorm room", "helpfulness": 13, "user": "schlmeil", "date": "February 27, 2006", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 2.0, "service": 3.0}, "id": 4559376}, {"rating": 5.0, "title": "Look no further, book it now!!!", "text": "I only stayed here for one night as a vacation day before a business trip. Since my company wasn't paying for the hotel on my day off, I choose to use a discount hotel website that doesn't tell you the name of the hotel before booking. Basically, it is a place to sleep that is indoors. I'm 6'5\" and the bed is 5'10\". The TV is the exact version my 87 year old grandpa has, except smaller. On a bright note, they had free cookies at the front desk - on a sad note, they were not good. The bathroom is clean, which is always a good thing. The room itself is very small - it reminds me of my dorm room from college, except with uglier carpet. That's about all.", "helpfulness": 10, "user": "A TripAdvisor user", "date": "February 27, 2006", "id": 4523403}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled with friends", "text": "A wonderful hotel, great location in a safe, CLEAN area near everything from great restaurants to shopping to public transit to tour starting points. The room was lovely & very clean. Room Service for breakfast (on my birthday) was wonderful.", "title": "Great place to stay", "user": "MadaleineB", "date": "November 17, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 87413954}, {"rating": 4.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "We asked the concierge for a restaurant recommendation and he seemed to know minute details of nearly every place in the city and we ended up at a great French place 5 minutes away. Would definitely go back to the Chancellor!", "title": "Awesome", "user": "Corey71", "date": "November 17, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 87391827}, {"rating": 3.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "You can't put a price on the history of the Chancellor hotel and surrounding area. The cable cars run right in front of the hotel and you are in easy walking distance of Union Square and tons of restaurants and rental car locations. Starbucks across the street is handy as well. Very nice!", "title": "Great Location-Bad Beds!", "user": "tabbi_traveler", "date": "November 15, 2010", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 87180900}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "On our Babymoon to San Francisco, we had a fantastic time considering I was 28 weeks pregnant. You literally cannot beat the location of the Chancellor Hotel, but be prepared for horrible beds and rude staff. The lady in the lobby (can't remember her name) who helps you with attractions was the best though! It was a mixed bag, but considering the price and value I'd stay there again...", "title": "Fabulous Location, Wonderful Staff, Will Definitely Stay Here Again!", "helpfulness": 2, "user": "RebeccaQuinn", "date": "November 15, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 87176526}, {"rating": 4.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "We stayed at the Chancellor Hotel on Union Square for 4 nights. Everyone we encountered was very helpful and nice. We always felt safe and comfortable.", "title": "What a Lovely Place to Stay", "helpfulness": 1, "user": "ShantiGohil", "date": "November 14, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 87037353}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled on business", "text": "Booked one night at the Chancellor after reading all the positive reviews and walking past it (to get to Sears for breakfast) for years. A good choice - it was clean, it was pretty modern in terms of amenities, the shower was hot & strong, the bed was comfy, and the cable worked. Loved the free wifi option. Rec'd a nice 2 for 1 voucher to the lobby bar with check in, so I had to give that a try - and it was during my second glass of merlot that I realized the lobby was just like a living room. The bartender knew many of the guests and asked how their day went. The reception area offered cookies & fruit, and the comfy sofas offered a good view of the eclectic SF pedestrians. It's right off of Union Square and the shopping opportunities abound. Loads of decent restaurants within walking distance. A bit of a hike to/from BART, but since it was the only exercise I got during this last business trip, it was fine. (I may not have been as pleased if it was raining!) I think I'll stay here again on my next trip...", "title": "Lobby is like your living room on Union Square", "user": "TuckerCA", "date": "October 28, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 85173346}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "This is a very cool hotel in a perfect location. The staff handled a reservation issue very quickly and without hassle - the way problems should be solved! The rooms are on the small side, but it's not a problem for 2 people. My only complaint was how warm the room got. I'm not sure why it was so warm in the room since it was late October, the heat wasn't on, and it was fairly cool outside. There is no AC so the only way to cool down is to open the windows and turn the ceiling fan on - neither helped much. Once we opened the windows it was quite noisy (it is union square after all). So, between the heat and noise, we didn't sleep well. I would try for a room on the \"quiet side\" on a higher level to reduce noise if you have to open the windows. Overall, it is a good value and I would recommend it for someone looking for a good value in Union Square.", "title": "Quiant Rooms - Great location - Excellent Service", "user": "snodallion24_com", "date": "October 25, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 2.0, "rooms": 3.0, "location": 5.0}, "id": 84763366}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "My husband and I came from Israel for a 3 day stay in San Francisco before a wedding. The hotel is clean, the staff is excellent-helpful with every detail needed. There is free coffee, cookies and apples 24/7-just a small friendly part of the general friendly hospitality. The location is perfect- we really loved this hotel and the price was perfect.", "title": "Great hotel", "helpfulness": 1, "user": "Tinamenashe", "date": "October 24, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 84599190}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "My wife and i stayed here for 4 nights at the end of september for our 10 year wedding anniversary. We were on a road trip down to LA via the big sur and needed a good start in San Francisco to set us on our way. Booked with trailfinders and were very pleased with the hotel choice. Good service all round, checking in was a breeze , lovely room with a view of Union square , comfortable bed , small yet adequate bathroom. Shower was powerful and considering that it was very warm during our stay the lack of air con was not a problem as the fan above the bed was nice and cooling.", "title": "Charming Cosy Hotel in Great Location", "helpfulness": 1, "user": "AjayP", "date": "October 21, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 84359895}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "Loved the free tea and cookies in reception.", "title": "Small but friendly and a great location", "helpfulness": 1, "user": "rosiepDorset", "date": "October 20, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 84205207}, {"rating": 5.0, "stay_parameters": "Stayed March 2006", "text": "Great hotel great location! We stayed at the chancellor in Dec of 2005 we booked five rooms for three nights,there was alittle mix up on the rooms.", "title": "Great Hotel", "helpfulness": 7, "user": "IslandGuy777", "date": "March 19, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 4694156}, {"rating": 4.0, "title": "Excellent experience, couldn't be better", "text": "But it was all good Wes Tyler steped up to the plate and the stay was great as was the staff. They looked after our every need and all five couples had A wonderful time. This was the third year at the Chanceller for dec trip and we will be back in Dec of 2006. Thanks again Wes and thanks to your wonderful staff.", "helpfulness": 10, "user": "A TripAdvisor user", "date": "March 13, 2006", "id": 4606755}, {"rating": 5.0, "stay_parameters": "Stayed March 2006", "text": "R.H. Stkn Ca.", "title": "Great Hotel", "helpfulness": 12, "user": "IslandGuy777", "date": "March 12, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 4601431}, {"rating": 5.0, "title": "Chancellor value", "text": "We where four, my husband and I and two daughters, the two rooms where connected, Excellent location, excellent staff very helpfull. The rooms where not big and no refrigerator in it but clean carefully every day and have nice decoration. We LOVED our stay, from far the BEST deal in San Francisco if you are going to SF don't miss it.", "helpfulness": 11, "user": "hadawayman", "date": "March 7, 2006", "id": 4592010}, {"rating": 5.0, "stay_parameters": "Stayed February 2006", "text": "Great Hotel, Great Location. Only complaint were that the bed was a little worn and tired. Staff was great, location great. Nice little hotel, and best value I have seen in San Francisco.", "title": "A+", "helpfulness": 29, "user": "unusedscreenname", "date": "March 6, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 4588509}, {"rating": 5.0, "title": "Great Location Great Value", "text": "We stayed at this hotel for three nights in March 2007 after reading reviews by others on Trip Advisor. The hotel was really good value and in a superb location just minutes away from Union Square. The staff were friendly and helpful and the room was small but decor was good, bed very comfortable and bathroom fine. A 'walk-in' cupboard was useful for stashing cases and had a safe, ironing board and iron and a portable heater for chilly nights. Just a few yards away was Lori's Diner which was fun and inexpensive and the Sears restaurant with", "helpfulness": 5, "user": "AdaptableAnn", "date": "March 12, 2007", "id": 7147425}, {"rating": 4.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "the 'world famous l8 pancake breakfast'! Great shopping in the area and the new mall Westfield had an elegant Nordstrum store with a curving escalator right up to the lounge beneath the dome on the 4th floor with comfy seats for a rest between shopping. For those with less to spend try Ross a few stores along for real bargains - also Kaplans govt. surplus store which sells genuine Levi 501's for $27. Don't miss a short walk to Maiden Lane to see a fabulous Frank Lloyd Wright building, and a walk around Chinatown - choose the 'gift supermarket' to buy your souvenirs at rock bottom prices with nobody hassling you.", "title": "Fully Satisfied with The Chancellor", "helpfulness": 13, "user": "Terry M", "date": "March 11, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 7013586, "likes": {"liked": "— Clean, tidy and quiet", "disliked": "— Nothing"}}, {"rating": 3.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "Keep a few dollars available for the homeless beggars who sell the newsheet on the streets in this area.", "title": "Overrated, but not horrible", "helpfulness": 5, "user": "Tennis_JD", "date": "March 9, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 7007465, "likes": {"liked": "— Location was the best aspect.", "disliked": "— Room was not as comfortable and spacious as other hotels."}}, {"rating": 5.0, "title": "Highly Recommend the Chancellor Hotel on Union Square!!!!", "text": "We are middle aged Australians who have travelled extensively. This is for other Aussies who may be visiting San Francisco in the near future and who have an appreciation of the impact of the currency exchange rate. This hotel is excellent value for money. It deserves all of its positive reviews.", "helpfulness": 7, "user": "DarleneT", "date": "March 3, 2007", "id": 6907896}, {"rating": 5.0, "stay_parameters": "Stayed February 2007", "text": "We stayed four nights in mid Feb after New York and Las Vegas. We had made our booking some months ago using the hotel website and by doing so organised Lorrie's shuttle from the airport which was very easy. Going by other comments on TripAdvisor we requested a queen without connecting door, non smoking and elevated. We received a room on level 15 at the back of the building. Not a great view (had no expectations) but quiet and comfortable, with access to latest movies on the TV system. Free popcorn from the foyer to go with them. You will have heard of the complimentary coffee and tea as well.", "title": "It was perfect", "helpfulness": 8, "user": "CleoToo", "date": "March 1, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6894639}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled with family", "text": "Our French family wanted to visit San Francisco so we booked 3 rooms for 2 nights. The room rate was great for San Francisco and included free parking half a block away. You cannot beat the location on Union Square. The rooms were stylish, clean and very comfortable with a choice of pillows. A family member forgot some clothing in the room and they arranged to have it shipped. We will no doubt stay at the Chancellor again.", "title": "Fantastic location", "helpfulness": 1, "user": "Vbg", "date": "December 29, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 91044845}, {"rating": 4.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "The hotel's location is as good as it looks, right at Union Sq with cable cars passing outside, the bart/muni within one - three min walk and major shopping stores within one! The rooms are NOT at all tiny, they comfortably sleep two with room enough to accommodate suitcases, shopping etc. They come with free wi-fi, modern flat-screen tvs, plenty of green tea toiletries, bath, shower, in-room safe, large closets, pillow menus, and in our case we were presented with a card and complimentary bottle of bubbly to help celebrate. It's the small touches that count and this hotel has them all. Free tea, coffee & cookies are available in the lobby all day, there's a starbucks on the corner if you prefer something else. Chinatown is about four mins away, there's so much to see close by that we walked everywhere. I wouldn't hesitate to use the hotel again or recommend it to friends; it's clean, warm, charming, staffed with helpful & friendly people and reasonably priced. What else do you need??!!", "title": "Excellent Location, Very Comfy Beds", "user": "Ohjustpeachy", "date": "December 29, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 91009525}, {"rating": 4.0, "stay_parameters": "Stayed December 2010, traveled with family", "text": "The Chancellor gives you fantastic service, terrific location, and very clean and comfortable rooms. With the parking package, it's the best deal in the city!", "title": "Great value!", "user": "CandGSLO", "date": "December 27, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 90855885}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "We started our US/Europe trip here and it was a great city to start in and the hotel was a bonus as well. It is in the middle of the city but is quiet and efficient and friendly. Close to Macys and Bloomingdales, but not too far from anywhere. We did a lot of walking: to Haight/Ashbury, North Beach etc and it was always a pleasure to return to the hotel where the service was discreet and helpful. We ate breakfast in the dining room whre the food was very good and affordable. Great value for money!", "title": "Oustanding value in a lovely city", "user": "Johnnio", "date": "December 24, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 90635245}, {"rating": 5.0, "stay_parameters": "Stayed December 2010", "text": "My sister and I stayed at The Chancellor for 4 nights and found the hotel to be fantastic. However, we didn't spend much time in our room! The beauty of the hotel is its convenience to the transport, the shops and all of the action of Union Square. You will not believe how close you are to everything - brilliant!!", "title": "So close to everything!", "helpfulness": 1, "user": "imasecretagent", "date": "December 23, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 90582991}, {"rating": 4.0, "stay_parameters": "Stayed March 2005", "text": "I stayed here with my wife in late March for 8 days. I was lucky to read the revies beforehand and book this hotel. The location could not be better as it's said here. The standard room was also big enough for a couple. Maybe because there was big closet for your luggage and clothes. I read from other reviews that tho bathroom would be cold, but I didn't realise that it would be freezing! It was really cold in there and we had to keep the floor covered with towels that we could stand in there. There is no heating in the bathroom at all.", "title": "Worth every cent", "helpfulness": 6, "user": "Kantsi", "date": "April 26, 2005", "detail_rating": {"cleanliness": 3.0, "value": 5.0, "rooms": 3.0, "service": 4.0}, "id": 3416154}, {"rating": 5.0, "stay_parameters": "Stayed March 2005", "text": "I wrote to the hotel beforehand and asked for a view to Unions Square and also a room from upper floors. We got what we asked for. Our room was in the 12th floor and we had the view we asked for. I also asked beforehand if I could book a car through the hotel or if they had any special deals with any car rental companies, but the answer was simply no. So I booked a car from AVIS, but I was quite suprised when I arrived to the hotel and found a big sign on the concierges desk which said \"Dollar car available here\"...", "title": "Perfect-Perfect-Perfect", "helpfulness": 6, "user": "TexasGal67", "date": "April 17, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3369637}, {"rating": 5.0, "stay_parameters": "Stayed April 2005", "text": "Otherwise the service at the desk was fine. We even got a late checking out when we asked for that. The room was kept clean all the time. Well, as clean as one can keep that kind of mattress. The maid also kept our candy cup filled all the time. Only problem with a service was in the restaurant. One mornig we decided to try hotel's breakfast, but didn't do it again. We were in a bit of a hurry to catch a bus and asked the waiter to hurry up. He said no problem. There was only three more couples having breakfast (and two waiters) so it wasn't too much to asked for. We got our breakfast (beside the toasts) and I immediately asked the waiter to bring the check when he could. After 10 minutes we hadn't got our toasts yet (and hadn't got the waiter) and one supervisor (I think) walked by and I asked her for the toasts and she replied that the waiters were only trainees, so it could take a while. So, she did absolutely nothing about that. After 15-20 minutes we had finished our brakfast besides those toasts and finally got our waiter, but no toasts and no check. He didn't apologise when I mentioned about the missing toasts and asked again for the check. He only left for them. Soon we got toast and the check, but we didn't have time to eat the bread anymore.", "title": "Believe the good posts!", "helpfulness": 14, "user": "mach2point0", "date": "April 17, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 3369296}, {"rating": 5.0, "stay_parameters": "Stayed March 2005", "text": "As for the brakfast itself, don't bother. For that price you don't have to chew those reheated bacons, but you can go and que to the next door at Sears Fine Food and you'll get a fabulous breakfast! It's really worth to wait 10 minutes in a que. Or maybe you can go to Lorrie's next block, which is good too.", "title": "Exceeded my expectations and I expected much.", "helpfulness": 16, "user": "Ford_Consul", "date": "April 12, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3353542}, {"rating": 5.0, "title": "Surprisingly Wonderful!", "text": "Because so many have told all the good sides of this hotel I'm not going to repeat them. I only say that this hotel is good value for your money. I would stay here again for certain.", "helpfulness": 16, "user": "A TripAdvisor user", "date": "April 4, 2005", "id": 3329169}, {"rating": 5.0, "stay_parameters": "Stayed December 2008, traveled as a couple", "text": "We stayed three nights at the Chancellor in mid-december, and it was perfect for us. The location is excellent, the hotel staff was extremely helpful and the room as advertised.", "title": "Great hotel in the perfect location", "helpfulness": 4, "user": "TGS-DALLAS", "date": "December 17, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 22806996}, {"rating": 3.0, "stay_parameters": "Stayed December 2008, traveled as a couple", "text": "The room was small by U.S. standards, but larger than many rooms of comparable quality that I have stayed in in Europe. The room was funished nicely and kept clean by the staff. And anyone who reads reviews on this site or the hotel's website should not be surprised by the small size of the room, as they seem to go out of their way to make sure people understand what type of hotel they are.", "title": "A Rough Start...but Recovered", "helpfulness": 3, "user": "NeaLinda", "date": "December 16, 2008", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 2.0}, "id": 22789310, "likes": {"liked": "— location", "disliked": "— COLD"}}, {"rating": 3.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "Overall, we found everyone at the Chancellor to be very nice and the hotel to be an excellent value. We will stay here again.", "title": "Nice Hotel", "helpfulness": 1, "user": "GirlyDublin", "date": "December 16, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 22778994, "likes": {"liked": "— location"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "Everything we could say has been said...", "title": "Lovely Hotel. Great Location", "helpfulness": 2, "user": "Tokyo08", "date": "December 15, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 3.0, "value": 5.0, "location": 5.0, "rooms": 3.0}, "id": 22757758, "likes": {"liked": "— Location", "disliked": "— Small Bathroom"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2008, traveled on business", "text": "This hotel is a good value for the location.", "title": "Good value at the Chancellor", "helpfulness": 2, "user": "JaneKirby", "date": "December 15, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 4.0, "location": 3.0, "rooms": 3.0}, "id": 22738297}, {"rating": 5.0, "title": "Wonderful stay", "text": "We spent two nights at the Chancellor and thoroughly enjoyed our stay. The front desk staff was exceptionally friendly and helpful (special thanks to Olga!). Our room was spotless, with contemporary furnishings, flat screen TV, complementary wi fi, and the Union Square location can't be beat. Breakfast at the hotel's restaurant was delicious, and well presented. We will certainly stay here again when we visit SF.", "helpfulness": 2, "user": "martydinah", "date": "June 13, 2012", "id": 131924894}, {"rating": 3.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "Location, location, location. We used public transport from the airport to the hotel, a very short 30 min trip and 5 mins walk up the hill. Cable car stops right outside the hotel and the supermarket next door sells supersaver Muni passes for the public transport (inc cable cars). Breakfast next door at Sears, which was excellent.", "title": "Excellent location, Good hotel", "helpfulness": 4, "user": "AjkaR", "date": "June 12, 2012", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 131854020}, {"rating": 3.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "The hotel is convenient for shorter stays. It is slightly dated but clean. Furniture is visibly used, marked & scratched heavily. Bathroom was a major let down. Bath was very dated and marked. On the other hand beds were very comfortable and pillows absolutelly excellent. We had a room at the back so not much noise from outside; however there was noise from other rooms, although neighbours didn't bother us too much.", "title": "3 Stars because of the location!", "helpfulness": 3, "user": "JPiworld", "date": "June 11, 2012", "detail_rating": {"cleanliness": 4.0, "sleep": 3.0, "location": 5.0, "value": 3.0, "rooms": 2.0}, "id": 131765325}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "Overall, it took me about 3 months of reading reviews prior to booking Chancellor, and I think it was a good value for money. Although if we were to visit San Francisco again I think we would try the Fisherman's Wharf.", "title": "Excellent Boutique Hotel in GREAT area! (Part 2)", "helpfulness": 1, "user": "geewalt", "date": "June 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 131742789}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "Overall a relatively pleasant stay, with good location that made it easy to travel around San Francisco and a friendly staff, there is also free coffee and tea at the lobby for hotel guests.", "title": "Great location, not great hotel.", "user": "heeelllooo", "date": "June 10, 2012", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 131700543}, {"rating": 5.0, "title": "Excellent!", "text": "I've just returned from a 9-night stay at the Chancellor, and I must state that it was fantastic! Before booking the hotel, I read reviews on Trip Advisor, and thought \"everyone is going over the top on this one\", but having stayed there, I'm joining in the praise-giving!", "helpfulness": 7, "user": "A TripAdvisor user", "date": "March 16, 2005", "id": 3277041}, {"rating": 4.0, "title": "good value for money", "text": "The best bits? It's CHEAP, but you wouldn't think so with the service they provide! The location is out of this world...right on Union Square, on Powell Street (so you can easily get a cable car to Fishermans Wharf) and within walking distance (15-20 mins max) of places like the Moscone Convention Center south of Market. The room was perfectly sized for me - I can't understand why people were saying it was too small, but maybe it would be a stretch with 2 people staying, I don't know. Nice touches included the jar of sweets and the rubber duck - a coffee machine would have been great, if only to wake me up in the morning (as the bed was too comfortable!), but that's only a minor issue as there was coffee available in the reception area. It was also really quiet - despite being in a busy area, I never really had a problem sleeping, and it was certainly in a safe location.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "March 14, 2005", "id": 3271817}, {"rating": 5.0, "stay_parameters": "Stayed February 2005", "text": "Thanks also go to the lady on the Tour Desk, who I probably annoyed too much with my requests for bus tours, sweets, drinks, transfers to the airport etc...but she carried out these requests with no fuss at all.", "title": "Value & Location, Location, Location", "helpfulness": 6, "user": "SOTS", "date": "March 9, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 3.0}, "id": 3261847}, {"rating": 3.0, "title": "it was okay", "text": "Problems? Nothing major, and certainly nothing to reduce the review by 5 stars to 4. I think most have commented on the fact only one lift works - although on the 11th floor, I never found this a problem at all (no more than 5 minutes waiting), and while I was there, it was clear that everything was being done to accomodate this (e.g. notifying residents), so I can't really call this a problem. However, I did once try to walk to the 11th floor (of 14, I think) and, even as a fit(ish) 20-something, I was really tired by the time I got to the top! Also, room service in the evening was only provided Wed - Sat: I would have liked this to have been provided on other nights, as (travelling alone) I found it really awkward walking into restaurants and asking for a \"table for one\"...however, there were PLENTY of local restaurants only steps away from the hotel, so I guess it's a business decision - I normally ate my food at the bar, and it didn't appear that the service was over-subscribed, so I guess most people would prefer to eat out at a local restaurant instead. Finally, I wouldn't really book here if you're a smoker (the hotel is completely non-smoking), or if you're looking for a party atmosphere (e.g. a stag night/bachelor party) - go to a cookie-cutter hotel for that!", "helpfulness": 3, "user": "A TripAdvisor user", "date": "March 2, 2005", "id": 3240484}, {"rating": 5.0, "stay_parameters": "Stayed February 2005", "text": "Overall, great! If I return to SF, I'll certainly return here.", "title": "A *MUST STAY* hotel", "helpfulness": 21, "user": "trebornozel", "date": "March 2, 2005", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 3240043}, {"rating": 5.0, "title": "CHARMING", "text": "This hotel scored excellent in every regard...The staff, especially Rory at the front desk and OJ were great!!! Valet parking made it especially easy to check in and out...Great food in the hotel too!!", "helpfulness": 2, "user": "4Runner61", "date": "August 28, 2007", "id": 8525990}, {"rating": 5.0, "title": "Very Satisfied", "text": "I'll stay there again and again and have already referred some SF regulars from my home town, Monterey. Good value!!!", "helpfulness": 3, "user": "cbspuches", "date": "August 25, 2007", "id": 8505339}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled with friends", "text": "A. Krusee", "title": "A Great Place on Union Square", "helpfulness": 8, "user": "buffymom", "date": "August 25, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 8505164, "likes": {"liked": "— location, amenities, friendly, helpful staff", "disliked": "— size of room, but that was expected, so its okay"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "Perfect location, updated rooms, and a great staff. They knew it was my anniversary and I got a bottle of champagne on our arrival. Value-wise this hotel can't be beat. The lobby is a bit schmaltzy, but the room was very comfortable. Perfect wi-fi too. I have no complaints and would definitely stay again.", "title": "Great location for shopping!", "helpfulness": 7, "user": "MrsGWolverhampton_Uk", "date": "August 24, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 5.0, "rooms": 5.0}, "id": 8498454, "likes": {"liked": "— Location", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "Our recent stay at the Chancellor turned out to be a very pleasant experience and a great value for the money. The reservation clerk at the hotel built a custom package that met our needs perfectly. The room was on a upper floor and faced Powell St., as requested. The rooms here are small (as expected, but it doesn't rain in S. F. in the summer, so who stays in their room!) However, there were multiple amenities, even the promised rubber ducky, the beds were comfy with upgraded linens, the bath was also small, but well-equipped with multiple mirrors, hair dryer, extra towels, etc. and there was a huge closet ! We had a food credit, which we used at the on-site restaurant for breakfast, delicious food and a great server at 7AM in the morning! The desk clerks were exceptionally helpful, always cheerful, and the cookies, tea and coffee were always out. This hotel has free internet service for guests, so we we were able to print out boarding passes very easily and check email too. This hotel is also a short walk/bus/BART to just about anywhere you want to get to and the desk clerks will help you figure it out! We also had a car for part of the stay, the in-and-out was very convenient and the parking garage attendants always pleasant and helpful. I have stayed in several other hotels around Union Square and this one beat them out by a mile!", "title": "Highly Recommended!", "helpfulness": 6, "user": "dennisdster", "date": "August 24, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0}, "id": 8498138, "likes": {"liked": "— Location"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "The staff was excellent. We were in our room less than 15 minutes after arriving at the hotel. We had a couple of drinks in the small lounge. We had two different bartenders. Both of them were very helpful. Told us cool places to go for food and drink. The room is small but very cozy. Plenty large enough for a couple on vacation. The bed was very comfortable. The room had a huge bathtub. Now my girlfriend wants one that size at home. Location is perfect for whatever you want to do in the city. We will definitely be going back to The Chancellor.", "title": "great place, great location", "helpfulness": 2, "user": "Justin R", "date": "February 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 124721523}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "The Chancellor was a wonderful hotel to stay at for many reasons. The people there were very friendly and helpful. The location, right near Union Square, was perfect for us. It's an older hotel and although it doesn't have all the amenities of a larger hotel (room service, gym), the small rooms were clean and very comfortable. The price was very reasonable, which included garage space for our car.", "title": "Perfect Place", "helpfulness": 4, "user": "Jayala1", "date": "February 16, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "location": 5.0, "service": 5.0}, "id": 124662320}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled solo", "text": "I stayed here for two nights, the staff were efficient & friendly. The apples, water, coffee & cookies are nice touches. The room was a bit worn round the edges but the furnishings & bed were quite stylish & comfortable. I had an adjoining room & the first night was very noisy, the second was fine. The cable cars go past the front windows so it is not peaceful but it is very well situated, close to Union Square & public transport. I would definitely come here again.", "title": "Good & comfortable hotel", "helpfulness": 2, "user": "DorothyUgchelen", "date": "February 15, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 124601842}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "Cannot praise this hotel enough. Staff, Location, Rooms all excellent. The Tour desk was first class for information and booking trips and airport transfer etc. Spent 7 nights here and did something different every day. Right by Cable car stop. Was very sad to leave San Francisco.", "title": "Best Hotel in Union Square", "helpfulness": 3, "user": "lena456", "date": "February 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 124562532}, {"rating": 3.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "We were not really familiar with the area but relied on some of the previous reviews. Most were spot on. My wife and I spent a long weekend at the Chancellor Hotel and were pleasantly surprised at being able to get just about anywhere within the city without having to depend on a car. We were able to get to where we wanted to go in the city using just about every mode of transportation within walking distance of this hotel. The room was small but clean, comfy and well maintained. Would have given it a better rating if the room was a bit larger. Everything in the hotel seemed undersized compared to some of the other hotels I have visited, but that's what gives this hotel it's character. Staff was knowledgeable and friendly. Was a plus to be able to buy tix for the cable car, trains, and buses from the lobby. Being downtown, and hopefully not sounding too insensitive, but be prepared to be hit up for change by the local hobos at least three times on every block. Overall we had a very positive experience and probably would stay here again on our next trip to SF.", "title": "Nice comfy hotel", "helpfulness": 2, "user": "castruml", "date": "February 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 2.0, "location": 5.0}, "id": 124557310}], "location": {"country": "United States", "city": "San Francisco"}, "stars": 3, "variance": {"poor": 42, "average": 200, "very good": 1154, "terrible": 19, "excellent": 1843}, "aka": "Chancellor Hotel San Francisco", "slim_ranking": 0.0382978723404, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.0, "location": 5.0}, "description": "The BEST LOCATION at the BEST PRICE...The Chancellor Hotel on Union Square is a historical, boutique hotel located in the heart of San Francisco where the Cable Car stops at the door step. Experience the best service and thoughtfull amenities while being surrounded by world class shopping, dining and theaters. From Union Square, ride the Powell Street Cable Car over Nob Hill, past Chinatown and North Beach, to Fisherman's Wharf."}