{"user_rating": 4.0, "review_count": 182, "name": "Charlotte House", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled on business", "text": "I initially intended to stay at the sister bailhouse hotel but was disappointed to find it fully booked. instead i enjoyed a midweek stay at Charlotte house. The nearby lawn area enjoyed some rare sunshine on my trip and the bar with patio enabled me to while away the evenings while staff brought drinks to my table.", "title": "even brought the weather", "user": "NakamuraSheffield", "date": "May 30, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 16517873, "likes": {"liked": "— The relaxed ambience, watching the sunset on the patio"}}, {"rating": 2.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "I enjoyed the time immensely, the hotel is exceptional and room 12 (a double) tastefully furnished and decorated, the staff are eager to please and the whole experience felt more like a holiday than a business trip. on the third night my wife came and we enjoyed a romantic stroll past the nearby cathedral, the castle and the quaint streets of Lincoln. i would recommend this hotel to all my friends.", "title": "What a pity", "user": "TravellingHeavy", "date": "May 28, 2008", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 5.0, "value": 2.0, "rooms": 4.0, "location": 3.0}, "id": 16457148, "likes": {"liked": "— The bedroom.", "disliked": "— Being misled about the rating."}}, {"rating": 2.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "Charlotte House advertise themselves as a 5 star hotel but we could not believe that this was in any way a 5 star hotel and so telephoned the AA who confirmed that it was not a 5 star hotel but classified by them as 5 star guest accommodation i.e. a bed and breakfast place.", "title": "shocking!!", "user": "harumas", "date": "May 13, 2008", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 2.0, "location": 5.0, "rooms": 3.0}, "id": 15982871, "likes": {"liked": "— the building and location", "disliked": "— the lack of 5* service and facilities"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "The room we were given was excellent as a bedroom but the rest of the premises left a lot to be desired being a converted industrial building. It felt like being in an old factory albeit with nice furnishings.", "title": "Excellent", "user": "LKeel", "date": "May 10, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 15883368, "likes": {"liked": "— Staff", "disliked": "— Nothing"}}, {"rating": 2.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "It is now over weeks since I wrote to the hotel following our stay with them, and I am yet to hear a response to our stay.", "title": "Faulty Towers of Lincoln", "helpfulness": 1, "user": "BluebearSW1", "date": "July 12, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 1.0, "cleanliness": 2.0, "value": 3.0, "location": 3.0, "rooms": 3.0}, "id": 17803983, "likes": {"liked": "— Attention to the rennovations of the building (Dr's names for room names)", "disliked": "— Lack of double glazing to bedrooms (noisy when functions downstairs or in grounds)"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2008, traveled on business", "text": "My partner and I made a reservation to stay at Charlotte House Hotel on the nights of the 27th and 28th of June having being impressed with the website. I am writing as we were thoroughly dissatisfied both with the experience and due to lack of any management on the premises at the time of check-out. The experience verged on paying London prices to stay at what only can be described as Lincolns ‘faulty towers’.", "title": "Must Do Better", "user": "LondonBranners", "date": "June 25, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 17213277, "likes": {"liked": "— THe hotel parrot.", "disliked": "— Braekfast"}}, {"rating": 4.0, "title": "Still finding its feet...", "text": "On arrival on Friday the 27th we asked at reception about a restaurant in the area for a meal. Enquiring initially about the Westgate. We were told that the Westgate was fully booked and then informed that Thai On One was recommended and that a taxi would be arranged to collect us and pick us up.", "user": "cmkline1", "date": "June 8, 2008", "id": 16780148}, {"rating": 5.0, "title": "Home Away from Home", "text": "Not knowing Lincoln at all we were very impressed with this and happy to be directed. The Thai was located at the side of one of Lincoln’s main roads in part of the cinema complex. Whilst the meal was acceptable, it was not in particularly nice surroundings and was in an almost empty restaurant. Initially we thought that this was probably the best that Lincoln had to offer if we had been directed here by the Hotel. On Saturday, following a walk around Lincoln, we found that in fact the city has a wealth of good restaurants within a five minute walk from the Hotel, and so do not understand why the Hotel staff would be directing its guests to this particular restaurant (we noted that the restaurants cards were also placed in the pages of each hotel guide as a place stop for the page on Charlotte House Hotel).", "user": "daus2000", "date": "June 2, 2008", "id": 16624270}, {"rating": 1.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "On Saturday our friends arrived, with whom we were all attending a wedding in Girton. We requested drinks at the bar at about 5 pm (once we had located a barman). We ordered Bloody Marys and Pimms. The Bloody Marys were served in martini glasses. The Pimms tasted flat and bitter and the fruit seemed past its best, when I asked when it was made I was told it had been made in the morning.", "title": "Warning noisy at night", "user": "Kittywren", "date": "May 31, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 1.0, "location": 1.0}, "id": 16546437, "likes": {"liked": "— you own lounge area", "disliked": "— noise for the boiler room"}}, {"rating": 2.0, "title": "A rip off", "text": "I booked an overnight stay in this hotel for my husband and I. It was a reward from work and I am exceptionally pleased that I didn't end up footing the bill for what was possibly the worst hotel experience I've ever had.", "user": "CLM78", "date": "October 11, 2008", "id": 20803229}, {"rating": 1.0, "title": "worst nights sleep I've ever had", "text": "I booked a junior suite and when we arrive there, it was the most unromantic room I've seen. Having stayed in numerous suites previously this was so austere and impersonal and felt more like a doctor's waiting room than a location for a romantic night away. To our bemusement there was only one towel in the bathroom. We tried to ring downstairs to ask to be moved but the phone wasn't connected so my husband had to use his mobile to ring the reception!", "user": "saint-emilion", "date": "September 28, 2008", "id": 20447664}, {"rating": 2.0, "title": "Not a \"five\" star hotel!", "text": "To the hotel's credit they did offer to move us to a different room although still charged us the same price as a suite even though we were now in a standard room. The room we were in was actually very nicely furnished although lacked basics like a coffee making machine - little touches that are so important when you are paying to much money. Again there was only one towel in the bathroom - so we had to ring down to have another brought up.", "user": "A TripAdvisor user", "date": "September 19, 2008", "id": 20190827}, {"rating": 5.0, "title": "Guest review", "text": "When I booked the hotel I also asked to book a table in the restaurant and was told that it was shut on Sundays. When we arrived we were then told it was open due to a last minute decision, thankfully we had booked another restaurant but it did raise concerns over the lack of organisation.", "user": "agregory962", "date": "August 30, 2008", "id": 19550030}, {"rating": 5.0, "title": "lovely", "text": "Getting ready the nightmare continued when another guest walked into our room having been given our key. This was like we were in Fawlty Towers not a 5* establishment. We then ventured downstairs for a drink and found there was no bar man. The owner arrived and said he would send somebody who I could only assume to be his friend because he didn't have a clue what drink was what. I fancied a cocktail but decided it was much safer to stick to a gin and tonic. Again, you just don't expect this from so called luxury hotels.", "user": "tigger2008", "date": "August 24, 2008", "id": 19297035}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "variance": {"poor": 23, "average": 19, "very good": 37, "terrible": 19, "excellent": 84}, "slim_ranking": 0.520833333333, "description": "At Charlotte House Lincoln you're more than just a customer - you're our guest. Our warm welcome is extended to all our guests whether travelling on business or leisure, Charlotte House is located opposite Lincoln Castle and Cathedral. Surrounded by 8 acres of landscaped gardens, the lawn complex also houses the Sir Joseph Banks tropical conservatory with its extensive collection of exotic plants and water features, and John Dawber gardens. With 14 unique rooms and suites and a choice of contemporary or traditional to choose from there’s something to suit everyone’s taste. We specialise in events and weddings, but ensuring a good night sleep is our main priority. We look forward to welcoming you soon."}