{"user_rating": 4.5, "review_count": 125, "name": "Charter Inn & Suites", "reviews": [{"rating": 4.0, "title": "Now called Charter Inn & Suites", "text": "Very pleased with the pleasantness of the facility. Our room was spacious and they even charged less than what I reserved the room for. Robes, Microwave and Fridge in each room was a nice touch. So was the free breakfast. The only thing was they charge $9.95 for wireless internet. Comfort Suites offers it for free. I'm going to try Comfort Suites next so I can compare. Regardless, if you stay here, you will enjoy your stay.**** four stars for great room and service.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "April 26, 2004", "id": 1839361}, {"rating": 4.0, "title": "Great place to stay", "text": "We stayed at the Charter Inn & Suites for a one night stay while visiting family in the Central Valley. I booked this hotel because of the great reviews and I was not disappointed. Everything was great. Clean room w/ frig & microwave and a good size bathroom. Hotel is off Hwy 99, close to restaurants, a Starbucks and some convenience stores. Overall this is a nice place to stay and I would definitely stay again.", "helpfulness": 2, "user": "Catlover4", "date": "July 21, 2006", "id": 5494719}, {"rating": 4.0, "title": "A wonderful atmosphere", "text": "Recently I stayed at the Charter Inn and Suites in Tulare, CA (last week of April 2006). From checkin to checkout, my stay was pleasant and uneventful (which is a good thing). Breakfast in the morning was hot and changed daily. To my surprise, there was a barbecue on a Tuesday night that was hosted by the General Manager, Mr. Kevin Gann. My partner and I enjoyed this thoroughly for we didn't have to go out looking for a restaurant for dinner (Tri Tip was wonderful, Mr. Gann). With the beer and wine lounge being attended by another gentleman, the two of us enjoyed that evening for they made us feel at home instead of a hotel.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "May 9, 2006", "id": 5045420}, {"rating": 4.0, "title": "Pleasantly Surprised", "text": "Unfortunately, Mr. Gann will no longer be there but I do hope that they carry on his tradition of barbecuing for it brings out hotel guests that you might not see or talk to.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "August 7, 2005", "id": 3742429}, {"rating": 3.0, "stay_parameters": "Stayed July 2005", "text": "A wonderful experience and I am looking forward to our next business visit in Tulare.", "title": "Decent Hotel", "helpfulness": 3, "user": "Enya", "date": "July 5, 2005", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "service": 2.0}, "id": 3637934}, {"rating": 5.0, "title": "Luxury hotel at an affordable price", "text": "Very clean, well kept facility. Rooms were decent sized with frig & microwave.", "helpfulness": 4, "user": "sundrops", "date": "February 4, 2005", "id": 3161059}], "location": {"country": "United States", "city": "Tulare"}, "stars": 2.5, "variance": {"poor": 4, "average": 7, "very good": 27, "terrible": 5, "excellent": 82}, "aka": "Charter Hotel Tulare", "slim_ranking": 0.307692307692}