{"user_rating": 4.0, "review_count": 464, "name": "Charleston Marriott", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed March 2012", "text": "Over priced small room and I was turned off by the irritation the girl at the front desk expressed to every especially when she answered how may I be of service and treat a simple request for towels as if we had asked her to grow the cotton and make them herself. The rooms were very small and the bar in the lobby over priced. Considering the amount of money we paid we also had to pay 6 dollars a day for the shuttle that travels 2 miles to the historic district. The shuttle drivers seemed tired and didn't offer the best reccomendations. If im ever in this town I will stay elsewhere.", "title": "Not worth it", "user": "bearittack", "date": "March 26, 2012", "detail_rating": {"cleanliness": 5.0, "value": 1.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 126660963}, {"rating": 3.0, "stay_parameters": "Stayed March 2012", "text": "Last minute reservation while traveling home, stopped for the night. First two rooms quite musky, third room had ac problems, fourth room ok. Staff were understanding, pleasant and tried to help satisfy us. Tried to give us an upgraded room which we didn't need or want, but it was very kind of them. Went to their rooftop bar which was a fabulous spot on the third floor. Then bartender/waitress was quite nice and left a lasting impression of her service, professionalism, friendliness, and attitude. Although we did have some problems, they were resolved and eventually we had a pleasant night's stay!", "title": "Outstanding customer service, minor issues eventually resolved, and did I mention the staff?", "user": "Eliot_in_LARGO", "date": "March 18, 2012", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 3.0, "service": 5.0, "rooms": 3.0}, "id": 126256411}, {"rating": 5.0, "stay_parameters": "Stayed March 2012", "text": "My stay was great, the hotel grounds are scenic and relaxing. The only time we had down time on our business trip was at the hotel, so we were lucky we picked this location.", "title": "Laid back hospitality .", "user": "mont0307", "date": "March 13, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 3.0, "service": 4.0, "rooms": 5.0}, "id": 126039929}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "I travel to lots of Marriotts and i have to say that John is hands down the niciest individual i have met. Not only does he remember your name, but also what you were drinking and why you are even here in the first place. I highly recommend visiting the concierge room if you have the opportunity. BTW, the food is good as well.", "title": "Concierge Service", "user": "John L", "date": "February 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 125420873}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "The hotel staff knows me by name, and treat me like family.", "title": "Marriott continues to impress", "helpfulness": 1, "user": "Bill H", "date": "February 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 125337760}, {"rating": 3.0, "stay_parameters": "Stayed April 2012, traveled with friends", "text": "Say what you will about this hotel, average, great, old, or remodeled however one thing you cannot say is that it's in downtown Charleston. I drove to Charleston Easter weekend for a friend's birthday and thought I would save money by staying at the Marriott. I did save approximately $50 a night however I lost all the convenience of staying in a beautiful and walkable city. The rooms were very much to Marriott quality however the charge of $10.95 for internet access seemed a bit high. Next time I'll spend a bit more and stay in \"true downtown\" Charleston.", "title": "Not in Downtown Charleston", "helpfulness": 1, "user": "BFMCharlotte", "date": "April 23, 2012", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "location": 3.0, "value": 3.0, "rooms": 3.0}, "id": 128491899}, {"rating": 4.0, "title": "10 minutes from downtown Charleston, free shuttle for guests", "text": "Having stayed in the French Quarter for the previous couple of nights, we were concerned the Marriott would lack convenience to old Charleston. We were pleasantly surprised. The hotel appeared to be an older Marriott from the outside, but it was beautiful inside. It obviously had a recent facelift. The rooms were spacious. The staff was friendly and helpful. The rooftop bar was delightful. The hotel provided a free shuttle for guests to Waterfront Park in the heart of old Charleston. It ran frequently and it was only a 10 min ride. The banquet food we had was marginal and the bar food satisfactory. Save your appetite for the great restaurants in Charleston.", "helpfulness": 2, "user": "cajFlorida", "date": "April 20, 2012", "id": 128216956}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "Fantastic hotel and staff. I would highly recommend this property!", "title": "Excellent property in a great location", "helpfulness": 1, "user": "Rclclmr", "date": "April 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 127858431}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "We loved this hotel! Amazing room, amazing view, amazing service! A little far from the historic district but the shuttle was fantastic.", "title": "Loved it!", "user": "raejc", "date": "April 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 127838249}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "We had 2 rooms/quick stay but beautiful rooms. Nice patio with chairs overlooking pool.Great decor. We had 14th floor with high ceilings and consierge level. We wanted something close to the airport and it was perfect (20 min)", "title": "very nice hotel", "user": "EMSSPERR", "date": "April 12, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 127778790}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "We had a room on the 9th floor. The room was nice and the beds very good. The aircondition worked well, but the air was a bit damp - so all of my clothes felt damp as well... The fitness room was very good and spacy and the pool area was nice.", "title": "Nice room - a bit far from the historic district", "user": "EllenChr", "date": "April 11, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 127703540}, {"rating": 3.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "You have to pay extra to access the internet.", "title": "Certainly expected better", "helpfulness": 1, "user": "adventuretravelernc", "date": "April 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 2.0}, "id": 127613059}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled on business", "text": "The location is a bit away from the center of Charlestone, so you have to use your car to get into the historic district. The parking is free, which is nice.", "title": "Concierge Lounge on Penthouse Level", "user": "Justin S", "date": "April 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 127335756}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "We went to Charleston for a weekend getaway. We choose the Marriott because of the brand. There was a conference at the hotel during our stay, so the hotel was very busy. Despite this, the check-in process went smoothly. Front staff was professional and helpful. We were delighted to be given a high floor room with a view of Charleston. Unfortunately the room was uninhabitable with a strong musty odor that was attempted to be covered up with heavy fragrance. We were promptly changed to a different room. Because we were tired, we accepted the 2nd room, which still had a musty odor. The room was standard Marriott, but showed signs of wear and didn't feel as clean as it should have been.", "title": "This will do", "helpfulness": 1, "user": "BEonVacation", "date": "April 2, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 2.0}, "id": 127125921}, {"rating": 1.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "The other downside of the hotel is location. Though it is advertised as in Charleston, it is quite distant from the historical district, a long walk at best. There is not much in the immediate area. Unless you need to be in close proximity to the Medical University of South Carolina, there are better choices in the area.", "title": "Visit bordered torture", "helpfulness": 6, "user": "Don F", "date": "March 29, 2012", "detail_rating": {"service": 2.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 3.0}, "id": 126910444}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "Check-in was good. Furniture was too large for the size of the room. Good comfortable beds. Nice having a balcony with a view of the water and surrounding building and bridges.", "title": "Very Nice", "user": "jack c", "date": "February 24, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 125136183}, {"rating": 3.0, "stay_parameters": "Stayed March 2011, traveled on business", "text": "The heating system was problematic. They could not seem to adjust to the proper temp for whatever area.System needs work.", "title": "Not a bad hotel, unless you have a bad room!", "user": "Jessica R", "date": "February 21, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 2.0, "rooms": 4.0, "location": 4.0}, "id": 124996898}, {"rating": 3.0, "stay_parameters": "Stayed February 2012, traveled with family", "text": "Personel were all pleasant but especially in the Concierge. Both Melissa in the AM and John in the evening did an excellent job of doing what they could to make our stay a pleasant one.", "title": "Nice view of a parking lot", "helpfulness": 3, "user": "OhioGoneSouth", "date": "February 20, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 124918048}, {"rating": 3.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "Overall it was a good and relaxing stay.", "title": "Average", "helpfulness": 2, "user": "Ahk13d", "date": "February 16, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 124688737}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled with family", "text": "This hotel is very nicely renovated, has good parking and the rooms are beautiful. There is a great view, although you are a ways from the historic district (not terribly far, but you would have to drive/cab, can't walk). The hotel is very clean, I've stayed here several times on business. The internet is terrible if you aren't near the elevator. If you're in a corner room, forget any connection. There are some weird noises in this hotel, I've been told it's the AC. If you're in a room with a bad AC, or that's making a lot of noise, ask to switch IMMEDIATELY. It will not get better and it will keep you up all night. As long as you're not in one of those rooms, it's a great hotel! Very nice executive lounge with a beautiful view of the city!", "title": "5 stars!", "helpfulness": 1, "user": "Chrissy M", "date": "February 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124541405}], "location": {"country": "United States"}, "stars": 3.5, "variance": {"poor": 45, "average": 80, "very good": 171, "terrible": 15, "excellent": 153}, "aka": "Charleston Marriott Hotel Charleston", "slim_ranking": 0.685185185185, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.5}, "description": "Experience Southern comfort at the finest hotel in Charleston, SC, Charleston Marriott. Our downtown Charleston hotel’s beautifully redesigned guest rooms and suites are coupled with excellent service and sophistication. Conveniently located on the Ashley River, we boast easy access to Charleston International Airport and many historic neighborhoods. All of our hotel's Charleston, SC, rooms are spacious, stylish, and alive with color and energy, and feature high-speed Internet access and shuttle service. Enjoy a sensory dining experience at Saffire Restaurant & Bar, serving innovative American-fusion cuisine for breakfast, lunch and dinner. Visit Aqua Terrace, a rooftop lounge offering cocktails with brilliant views of Ashley River. Relax in our landscaped courtyard or workout in our modern fitness center. Our accommodations measure up to the best hotels in downtown Charleston and feature 50,000 square feet of event space, ideal for social events, including unforgettable weddings and gatherings."}