{"user_rating": 4.0, "review_count": 444, "name": "Charles Hotel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with friends", "text": "This hotel is very easy to get to from Memorial Drive/I-90 and parking is right below. Then you can just walk out your door to the shops and restaurants of Cambridge or the trails along the river. Rooms are very comfortable and luxurious in a New England way. Also rooms are quiet and you can control the temp or open the window. I liked the natural bath products. Hotel has very good restaurants, bars and outside dining- not just for tourists- locals actually go to these places! I didn't use the gym, but it's nice. Good spa. I would definitely stay here again.", "title": "Convenient in Cambridge", "helpfulness": 1, "user": "Twograycats", "date": "May 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 129914984}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "Even if you dont have a reason to travel to Boston/Cambridge a stay at this modern/hip hotel is reason enough! Forget the Ritz-Carlton or the Taj Boston. Drive a few miles over into Cambridge and experience something fresh and unique that you wish you could take back with you.", "title": "Idealist Concept", "helpfulness": 2, "user": "princeadnan", "date": "May 13, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 129858094}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled on business", "text": "I think the uniqueness is in the simplicity of design/furnishings/delivery of this remarkable hotel. Rooms are comfortable, well=lit, wifi connectivity and adequately equipped for both business or leisure travellers. Bathrooms are efficient and bath amenities are blissful.", "title": "Excellent hotel experience.", "helpfulness": 1, "user": "Henry J", "date": "May 5, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 2.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 129391807}, {"rating": 4.0, "stay_parameters": "Stayed October 2011", "text": "The check-in/out was quick, staff was helpful, and location was ideal. A copy of New York Times in the morning was just one of the added benefits!", "title": "Lovely hotel, great location, but not inexpensive", "helpfulness": 1, "user": "Sinaj9", "date": "April 29, 2012", "detail_rating": {"cleanliness": 5.0, "value": 2.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 129058572}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled on business", "text": "I never tried the dining options in the hotel, except the room-service which was uneventful. The hotel is located in Harvard Square and there are plenty of options within walking distance.", "title": "Good overall but expected better for the price", "helpfulness": 1, "user": "misplacedmidwestern", "date": "April 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 3.0, "location": 4.0}, "id": 128531970}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "I stayed here only one night. I was one parent with 3 kids. We were treated well. It wasn't crowded when we were there. The room we had was spacious with well above average attractive interior design. The beds were incredibly comfy. There was a TV in the mirror in the bathroom. Hello George Jetson! How cool is that? They had snacks and a kid fun pack in the room for the children. The location is perfect. It's got a great restaurant downstairs, which had sketchy service. It's next to Legal Seafood restaurant. It's within easy walking distance to Harvard Square. The hotel is easy to navigate. Our experience at a non-peak time was very pleasant. I will stay in this hotel again and again.", "title": "Great! Up to date, well located and very cushy!", "helpfulness": 1, "user": "numberoneGonzo", "date": "May 30, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130939949}, {"rating": 3.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "We've been staying at the Charles Hotel for the past 4 years, as our youngest child was a student at Harvard. From a location point of view, it couldn't be better. The hotel management seems to apply the priniciple of \"location, location, location\" and does little else to justify the exorbitant, big city prices it charges for so little extra in return. The real kicker with this property is the dichotomy of price and quality. This may be all about the economics, stupid, because the other hotels in the Harvard Square vicinity are not terrific. It is, however, painful to be paying top dog prices for what is clearly middle of the road. It seems that free cookies and coffee, available during the Harvard graduation, are management's idea of going the extra mile. The staff are not long on smiles, and at the prices we paid to be close to Harvard Square for the graduation, I want friendly. The check-in clerk, Hiyat, was particularly disagreable. This being said, the manager of the business centre was exceptionally helpful, as was the concierge. Rooms at the Charles have not changed for the past 4 years, and they are showing their age. The furniture is worn, and could use an upgrade. Water pressure is an issue, and the lighting in the bathroom has been a consistent issue for many of our stays here (ie the sconces on either side of the mirror don't seem to work). While Wifi is complementary, it is exceptionally slow. The one major positive aspect of this hotel is its association with a great health club facility, Wellbridge. Surprisingly, access for guests is free. All in all, if you want to be able to walk to the Harvard campus, this is your best choice, but be prepared to have a hole burned in your pocket.", "title": "good location and very overpriced", "helpfulness": 2, "user": "voyageur à paris", "date": "May 26, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 130625606}, {"rating": 3.0, "stay_parameters": "Stayed April 2012, traveled with friends", "text": "I do not understand the hype for this place. Other than location, which is fantastic, I found service to be sub par given the price charged. There was no newspaper provided in the mornings, and I did not find out until too late that the only way to get your room cleaned is to request it to be cleaned. Without explanation, there were no pay movies available during my stay. Prior to coming to this hotel, I stayed at the Boston Battery Wharf: though considerably cheaper, service was outstanding.", "title": "Very disappointing", "helpfulness": 3, "user": "raclaw", "date": "May 23, 2012", "detail_rating": {"service": 2.0, "cleanliness": 5.0, "value": 1.0, "sleep": 5.0, "rooms": 1.0, "location": 4.0}, "id": 130487833}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "Excellent location right in Harvard Square. You can easily street park your car (or there's a garage available across the street) and not use it again, as all the shops and restaurants of Harvard Square are within walking distance. Just hop on the #1 train to get to MIT & Back Bay in Boston or jump on the T to get to downtown Boston - it's all right there. I grew up and went to college in Boston and this is where I want to stay when I come back. Rooms are comfortable and spacious and the restaurants - Rialto & Henrietta's Table are fantastic. The hotel is expensive, but so are most of the other hotels in and around Boston and this one has a location that can't be beat.", "title": "Perfect Location, Nice Rooms", "helpfulness": 1, "user": "chillertracks", "date": "May 23, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 130465232}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "This is a great alternative to downtown Boston. Solid 4-star quality. Quiet rooms. Close to subway and all the activity and convenience of Harvard Square. The only downside was no coffee in room, but you can stumble down to Henrietta's for free coffee in the mornings.", "title": "Convenient and Quiet", "helpfulness": 1, "user": "Timoan", "date": "May 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130416319}, {"rating": 3.0, "title": "Quiet, tasteful, convenient; not for allergy sufferers", "text": "Pros:", "helpfulness": 1, "user": "Frequent_Flier_Girl", "date": "June 13, 2012", "id": 131930716}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled on business", "text": "- convenient to Harvard & green line T stop", "title": "Extraordinary facility and staffing", "helpfulness": 1, "user": "Dick S", "date": "June 4, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 131240226}, {"rating": 3.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "- quiet", "title": "Staff-A+; Accessability-B-;Cost/Value-C", "helpfulness": 1, "user": "ZannVermont", "date": "June 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 131222735}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled on business", "text": "- wifi included", "title": "People makes difference", "helpfulness": 1, "user": "Nana b", "date": "June 2, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 131162665}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled solo", "text": "- soothing decor (tasteful furnishings & quilts in the halls seem very New England)", "title": "Perfect location and great customer service!!", "helpfulness": 1, "user": "John S", "date": "May 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130983722}, {"rating": 4.0, "title": "Try to upgrade....", "text": "I have been a customer of the Charles Hotel for years, and I really like the experience there. From the views out over Harvard, to the buzzy Henrietta's Table for breakfast, it is a very fun and stylish place to stay. At my most recent stay, however, I did get one of their standard double rooms for the first night, and frankly, it seemed kind of cramped and not as nice as I expected. So I have to say, to make this hotel a really wonderful experience, upgrade your room category. The next night I was able to upgrade to a Charles Suite (really just one large room with a dining table), and that made so much difference. I had space, and three windows overlooking Harvard. Well worth any extra expense!", "helpfulness": 1, "user": "kingsroadgal", "date": "July 9, 2012", "id": 133888748}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled on business", "text": "The hotel is well situated in Harvard and as you arrive there is a smile, quick check in and responded immediately on a late check out as my flight was early evening. The room was a good size and very comfortable. The bed was extremely comfortable and with 180 degree view of the area, the restaurant fir breakfast is a delight. Good food and great service with a very preppy feeling with the mix of customers from the Harvard area.", "title": "Feels like a boutique hotel but with extras", "helpfulness": 1, "user": "denniscasey", "date": "July 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 133390729}, {"rating": 2.0, "stay_parameters": "Stayed June 2012, traveled solo", "text": "The toiletries and room amenities are excellent of high quality. On leaving the check out and catching a taxi was seamless...I would certainly return.", "title": "A grand Hotel, a Grand room rate and on top a grand explosion! Not recommended", "helpfulness": 1, "user": "Franzdorette", "date": "July 1, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 1.0, "sleep": 3.0, "rooms": 1.0, "location": 3.0}, "id": 133182431}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled with friends", "text": "This hotel on the banks of the Charles River in Boston is within easy walking distance of the Harvard Business School campus. I stayed at hotel in a room costing $ 850 per night. On my first night in my room, I discovered a wet water soaked carpet at the door ofthe main bedroom. Upon investigation by an engineer, it was discovered that the air conditioner exploded and that caused the water soaked carpet. I was given a choice to stay or move to a similar room in another part of the hotel. I chose the latter. The soaked carpet was not the only reason for me to move. I dared to touch the door knob of the interconnecting room and it fell off the door it was mounted on. The third reason I moved was the quality of the desk in my room was old, damaged and had stain marks on it.", "title": "Great location in Harvard Square", "helpfulness": 2, "user": "jj1837", "date": "July 1, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 133157193}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled solo", "text": "With assistance from the hotel I moved. After two days in my new room the card board boxes I was given to move my stuff were still in entrance hall of my new room!", "title": "Fabulous Staff Make the Difference", "helpfulness": 1, "user": "ssilcg", "date": "June 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 133140477}], "location": {"country": "United States", "city": "Cambridge"}, "stars": 4, "variance": {"poor": 26, "average": 46, "very good": 139, "terrible": 21, "excellent": 212}, "aka": "Charles Hotel Cambridge", "slim_ranking": 0.3125, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "Located just minutes from downtown Boston and a variety of world-class attractions, The Charles is a AAA Four Diamond Hotel and a proud member of Preferred Hotels and Resorts.Reflecting the eclecticism that is Cambridge, The Charles Hotel is a modern interpretation of New England hospitality with a thriving jazz club, the Regattabar, two signature restaurants, ice-skating rink (winter months only), state of the art conference facilities, Corbu Spa & Salon, and a central location in the heart of Harvard Square.The Hotel is home to Henrietta’s Table, featuring “fresh and honest” home cooking, and Rialto, recognized by one of the best restaurants in America by Gourmet, Food & Wine and Esquire. Noir, the hotel’s chic, cozy bar, serves classic cocktails mixed to perfection and sultry signature drinks. Since its opening in 1985, The Regattabar has established itself as the leading jazz and world music club in Boston and the New England area. Corbu Spa & Salon is named after famed architect and designer, Le Corbusier and offers a harmonious escape from the stresses of urban life. A French influenced menu offers seasonal treatments with locally sourced ingredients. Open daily.Catering to internationally renowned business leaders, government officials, entertainment executives and leisure travelers alike, it’s no wonder that the New England Travel Guide has designated The Charles as the best hotel to “stay put in” when visiting Boston."}