{"user_rating": 3.5, "review_count": 403, "name": "Chateau Impney Hotel & Exhibition Centre", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled on business", "text": "We were so pleased with our works meal there last year, that we were only too glad to go back again.We emailed the chateau and got an instant reply with menu and prices and told to email them the starters a week before the meal. The administration dept deserves a medal , very courteous and prompt, a delight to deal with in these times .", "title": "Another superb meal at a wonderful location.", "user": "stiavnik", "date": "December 12, 2012", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0}, "id": 147309554}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "The chateau is an amazing building and just the drive up to it gives off a feeling of going somewhere special.", "title": "Beautiful Hotel", "user": "Kate H", "date": "December 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 2.0, "rooms": 4.0, "location": 5.0}, "id": 147070615}, {"rating": 3.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "We were shown into the bar by the doorman and offered drinks from the bar, a pianist was playing creating a feeling of decadence. once all our group had arrived (19) we made our way into the eating area, and shown our tables , we were offered rolls and butter and then asked for our starter orders, We,d pre booked these , so they came very quickly. The xmas meal was then shown to us at the carvery table and we were attended to by 3 members of staff. The meal was lovely, well cooked and the vegetables just right, The meat was lean and cooked to perfection, all of us remarked on how well the food tasted. The waitresses very attentitve , After puddings we were shown back to the piano bar and given mince pies, coffee and sparkling wine and served from the bar, The pianist was still playing . I d certainly recommend the Chateau for a meal , we had the xmas luncheon and it was £17 , we will going again next year.", "title": "Disappointed", "helpfulness": 2, "user": "Shaun D", "date": "November 23, 2012", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 2.0, "sleep": 2.0, "rooms": 2.0, "location": 3.0}, "id": 146029900}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled on business", "text": "My partner and I stayed at the Chateau this weekend for my birthday celebrations and we absolutely loved it.", "title": "Unique Luxury", "helpfulness": 1, "user": "ColinBainRPh", "date": "November 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 145687408}, {"rating": 3.0, "stay_parameters": "Stayed November 2012, traveled on business", "text": "The hotel itself is absolutely beautiful as are the surrounding grounds. We found the staff very friendly and helpful upon check-in and check-out.", "title": "A blast from the past", "helpfulness": 1, "user": "SusanK1951", "date": "November 18, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 2.0, "location": 2.0}, "id": 145664421}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "Stopped the one night in a feature double room (406) as a surprise for my husband’s Birthday. We have celebrated Birthdays with a meal in Jason’s Carvery for 10 years but we had never stopped over before. After reading the reviews on here I was very sceptical about booking but I’m so glad I did. Yes, the hotel has recently been sold, yes it needs a substantial amount of money spending on it, yes the room had a very shabby and stained carpet, chipped woodwork and the décor was very dated. Now on to the positive points. The room was huge (as was the bathroom), was well furnished and best of all absolutely spotlessly clean. All the furniture was highly polished and there wasn’t a speck of dust anywhere (I even scrutinised down the side of the armchairs, very sad I know!). The bathroom was cleaned to the same high standard. Hats off to the housekeeping staff for doing such a good job.", "title": "Very Pleasant Stay", "helpfulness": 1, "user": "Cakesy", "date": "January 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 148962442}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "We ate in Jason’s Carvery and had (as usual) an excellent meal, attentive waiting staff and a very pleasant chef serving the carvery. Afterwards relaxed in the bar. Just one minor gripe here. Previously we used to sit back and listen to someone playing the piano, now they have installed a flat screen tv. Not my cup of tea and something I felt that ruined the ambience of the place but obviously this is just personal choice.", "title": "A glorious old lady brought back to life!", "user": "TrickyTrevLongEaton", "date": "January 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 148791377}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "Breakfast was amazing, huge, delicious cooked breakfast and far bigger portions than we had been expecting.", "title": "excellent yet again!", "user": "Aimee R", "date": "January 3, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0}, "id": 148747432}, {"rating": 1.0, "stay_parameters": "Stayed December 2012, traveled on business", "text": "Check-out (and check-in) was done both friendly and efficiently.", "title": "Truly dire room", "helpfulness": 3, "user": "XseniaX", "date": "January 3, 2013", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 3.0, "sleep": 1.0, "rooms": 1.0, "location": 5.0}, "id": 148681678}, {"rating": 1.0, "title": "The Land That Time Forgot!", "text": "So, to sum up, we certainly weren’t disappointed. The staff are amazing, the place is spotlessly clean, the food is excellent and there is something very magical about stopping here. The grounds are beautiful and we had lovely views from the room over the gardens. However, if you are expecting immaculate décor to a 4 star hotel standard then at the moment this hotel isn’t for you. Hopefully in the future it will be. People just need to accept that the new owners are refurbishing it as quickly as they can but it is a big job.", "helpfulness": 2, "user": "Ljbl12", "date": "December 23, 2012", "id": 147966605}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled with family", "text": "My family and I have just returned from the Midlands and another wonderful stay at The Chateau Impney, Droitwich. I have visited this hotel over the years, as a child my parents used to take me there so I have seen many, many changes over the last sixty years - yes 60 years.", "title": "Return visit to The Chateau Impney Droitwich", "user": "Pauline S", "date": "November 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 145641159}, {"rating": 3.0, "stay_parameters": "Stayed September 2012, traveled with friends", "text": "This building is a piece of Worcestershire history and yes it does need some updating but for the price it charges the value is exceptional.", "title": "Carpet in the bathroom!", "helpfulness": 1, "user": "joma09", "date": "November 14, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 1.0, "location": 2.0}, "id": 145360965}, {"rating": 1.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "However, the hotel has just been sold and there are plans to really update it and work is about to start. New carpet has been laid in the main reception, ballroom and staircase and looks great and in keeping with the opulence of these areas.", "title": "Worst place I have ever stayed", "helpfulness": 1, "user": "Colin1968", "date": "November 10, 2012", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 4.0}, "id": 145106724}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "We did express concern that hopefully renovations will be in keeping with the period of the hotel and that it is not turned into an upmarket hotel that only corporate clients can afford.", "title": "Enjoying that special night out", "user": "WorcesterRoyal", "date": "November 5, 2012", "detail_rating": {"value": 4.0, "service": 4.0}, "id": 144563318}, {"rating": 1.0, "stay_parameters": "Stayed October 2012, traveled with friends", "text": "Four generations of my family have stayed in this lovely place and my grandson was so thrilled that we were going there this weekend as he loves to walk around the gardens and to see the animals in Impney Park.", "title": "If I could give 0...AVOID!", "helpfulness": 2, "user": "Haym", "date": "October 25, 2012", "detail_rating": {"service": 3.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 3.0}, "id": 143683837}, {"rating": 2.0, "title": "Watch the \"security\" - or shall i say what security", "text": "I will be brief asi do not wish to bore you. I went on a conference at the Chateau Impney last week, as we had activitivities i left my hand bag in the room, thinking it will be safe. Myself and other six collegues of mine had our credit cards stolen and some also had their driving licence taken. As we contacted the hotel no great deal of urgency was taken, just \"we'll try to look into it\".", "helpfulness": 3, "user": "A TripAdvisor user", "date": "October 23, 2012", "id": 143542343}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "what else can i say.......i will definately never step into this hotel ever again!", "title": "Beautiful building . Just needs a little makeover", "user": "Loppylugs", "date": "October 23, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 143519907}, {"rating": 4.0, "stay_parameters": "Stayed October 2012", "text": "We attended a 60s 70s and 80s Dinner Dance on the 13th October 2012 and stayed overnight for Bed and Breakfast.The Dinner Dance for £30 including a live band and excellent 3 course meal with several choices was excellent value. Staff at the hotel were friendly and efficient throughout. The Chateau is a wonderful building set in beautiful grounds and the restaurants conference rooms and bars are all impressive . It is true that the decor throughout needs a general brightening up and this has begun, but hopefully they will avoid making any substantial changes to the original layouts. The bedroom was clean if a little dated and the same was true of the bathroom but again just in need of a little cosmetic touches to brighten the decor up.The venue would still make an excellent choice for a wedding and I will certainly stay here again in the future and look forward to see how the redecoration progresses.", "title": "Great building and location. Needs updating.", "user": "Fine-fun", "date": "October 22, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 143462168}, {"rating": 1.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "A large number of us stayed following a wedding which was held locally. Have always wanted to stay as it is a brilliant building. The main areas are very impressive. An amazing staircase and stained glass. Our room was comfy beds and pillows great but as many have said needs to be updated and sound proofed. We had connecting doors which allowed us to hear next door make a cup of tea. I was impressed with the quality of the food at breakfast the bacon was great. A sign on the way into the dinning room asking guests to wait to be seated would avoid much of the confusion that occurred while we had our breakfast. Overall value for money. Would love to see what the rooms could be like once they are updated.", "title": "Greyfort Properties, turn this place into flats - Fawlty Towers could do better", "helpfulness": 2, "user": "DeborahmCox", "date": "October 21, 2012", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 4.0, "service": 1.0}, "id": 143350651}, {"rating": 1.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "October 20th 2012", "title": "Someone have a word!", "helpfulness": 2, "user": "Alexa H", "date": "October 20, 2012", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 3.0}, "id": 143294871}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "stars": 3, "variance": {"poor": 36, "average": 73, "very good": 139, "terrible": 51, "excellent": 104}, "aka": "Chateau Impney Hotel", "slim_ranking": 1.0, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.5, "rooms": 3.0, "location": 4.5}}