{"user_rating": 5.0, "review_count": 311, "name": "Chateau de Vie Bed and Breakfast", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "Wished we could have enjoyed more time with Philip and Peter, perfect hosts. We arrived late afternoon and Peter helped us settle into our room, nicely decorated, beautiful furniture. We were treated to a plate of nice cheese, fruit and crackers. Also Peter told us to enjoy the complementary wine, what a nice touch and very unique of a B&B. Wish we could have enjoyed the pool and hot tub, very clean and inviting, oh yes and what a nice breakfast, we hope to return!", "title": "Wonderful find", "user": "N2nature", "date": "July 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 133696796}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "My husband and I are frequent travelers to Napa and Sonoma. We have stayed in many different places in the 12 years we've been coming to the wine country and hands down, Chateau de Vie is the absolute best. Peter and Phillip are the consummate hosts, genial and gracious, and there isn't a single detail they've missed in creating the perfect vacation atmosphere.", "title": "Peter, Phillip and Marcel: Best Hosts Ever", "helpfulness": 1, "user": "floridajo", "date": "July 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 133195578}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "The Chateau is nestled in a vineyard on the quiet side of Calistoga and the tranquility of this place is unparalleled. The quiet at night was astounding. It was as if you'd shut the door on the noisy world and walked into this serene stillness with just the sounds of nature to lull you to sleep.", "title": "Wonderfully relaxing and serene atmosphere", "user": "ginamg", "date": "June 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 133084733}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "Phillip's breakfasts are gorgeous, ridiculously delicious and big, so very big! I ate like a truck driver every morning because I had to eat every scrumptious bite. His sunny side egg was perfect. They say the sign of a good chef is how well they cook an egg and I am very finicky about my sunny side eggs. I miss Phillip's perfect eggs along with all his other extraordinary dishes.", "title": "Cannot be better!", "helpfulness": 1, "user": "Olga R", "date": "June 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 132900151}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "One of our reasons for this latest trip was to look for real estate. We are planning on buying a home in the area and we had appts to see various properties. When Peter heard this, he was a great help to us. He and my husband pulled out their iPhones and real estate apps and started scouring the area for places. Peter is well versed on the valley and he pointed us in the direction of some homes he knew about and his favorite areas. When Peter told us he'd remodeled and built some buildings of the Chateau himself, we peppered him with questions on building and California code law. In fact, I'm afraid we kind of hogged Peter the whole time, most likely keeping him from his host duties and the other guests. But he was an invaluable help to us, a great source of information, not only in the real estate department, but restaurants, wineries, everything.", "title": "Charming Bed & Breakfast in Napa Valley", "user": "MikiJuli", "date": "June 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 132131328}, {"rating": 5.0, "stay_parameters": "Stayed July 2012", "text": "If you could ever imagine a perfect little cottage in Provence, this is THE place, except cleaner, bigger, better plumbing, closer to home, and awesome service. Of course, as I'm writing thus review, I'm laying by the poolside in 75 degree temperature with a glass of napa's finest Chardonnay with a view of their own vineyard to kill... This is my second visit and will not be my last. The service is attentive without being intrusive. The breakfast was creative and plentiful.. And complimentary wine service and the beautiful ambiance makes you not ever want to leave.", "title": "Out of this world", "user": "catseattle1", "date": "July 20, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 134935134}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "My husband and I stayed at the Chateau de Vie for our 32nd wedding anniversary and there couldn't have been a more perfect place to spend it! Philip and Peter are the best hosts! The atmosphere, service, food, vino and accomadations are 5 start plus! We will definitely be staying there again!! Love! Love! Love!", "title": "Chateau de Vie is Incredible!!!", "user": "khofftrips", "date": "July 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 134545392}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "I spent so much time looking for the perfect B&B for my husband and I to stay at for our one night \"get away\" in the middle of a see-the-family trip home to the Bay Area. I wanted so much more than what our budget was! And then I read the reviews of Chateau de Vie and there was everything I wanted. And in our budget! When we got there, it was even better than I had anticipated. Peter and Philip were so great. The grounds are beautiful and we sat in probably six different spots in the first hour we were there while we had our fruit, cheese and nut plate (yum!) and a glass of wine. The food was amazing. We went for a walk in the morning through the vineyards and I almost started crying it was so beautiful and perfect. The bed was fantastic - it was really cruel to have to leave to go to family and sleep the next night on an air mattress. But, we are grateful for our getaway and next summer we are going to stay at Chateau de Vie for longer than one night.", "title": "The reviews are absolutely correct!", "user": "cruznmel", "date": "July 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 134063652}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with friends", "text": "Our second stay at the Chateau, and it was as good as the first. Peter and Philip are the consumate hosts. A beautiful setting in the middle of their own vineyard about a mile north of the town of Calistoga in northern most Napa Valley. Very serene and the way Napa used to be--a very good thing. The chateau and rooms are beautiful and well appointed--like staying in a well to do friend's home. The daily gormet breakfasts served on the deck overlooking the vineyard and distant mountains are superb. Wine and cheese are put out every afternoon. There is a small pool and hot tub for relaxing. The hosts are available to recommend wineries and restauraunts and help with reservations. You will throughly enjoy your visit here. Highly recommended.", "title": "Charmed Napa Chateau", "user": "TexTraveling", "date": "July 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 134024618}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "This is a great place to stay while visiting the Napa area. It is tasteful, elegant, and understated. The food here is superb, the setting is peaceful, the amenities unbeatable, and the service top notch. Philip and Peter are great hosts: gracious, warm, but not intrusive. We had a wonderful time here and will definately stay here again.", "title": "Best B&B, wonderful place to stay", "user": "seattlenikkita", "date": "July 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 133898069}, {"rating": 5.0, "stay_parameters": "Stayed May 2012", "text": "Great place to stay to experience wine country. Wonderful environment with great wine to sip while relaxing at night. Just a couple of miles outside of Calistoga. Peter and Phillip are great to talk to and serve an amazing breakfast. Rooms are very nice as well.", "title": "Amazing", "user": "roadtraveler123", "date": "May 27, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 130685854}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "We prefer staying in the North End of the Valley, more woodsey and a little less touristy. Chateau de Vie fit all of our requirements and then some. Just off the highway, but seems quite all to itself, surrounded by beautiful gardens, fountains, piped in music, and of course the vineyards at your back door. The proprieters Peter and Phillip, were very friendly and seemed genuinely interested in making our stay a pleasant one. They succeeded. We had the top floor suite and unless you are very tall (angled roof) this is a good choice. The king bed had lots of excellent pillows (sometimes not the case) and the mattress was very, very comfortable. The biggest selling point here however, is the charm of the owners and the effort they have put into the decor and the beautiful outdoor space. There is a spa and a small pool of which we took advantage. Sitting by the pool, reading a book, looking out over the vineyeards with the mountains in the background....that works. Breakfast is on the gourmet side and Phillip puts a lot of work into his dishes. A Spinach, Artichoke and Sun Dried Tomato Fritatta one morning and Scrambled Eggs with Cheese, Taragon, and wonderful mushrooms the next. An Orange Zest Coffee Cake with Creme Fraiche was very tasty as were his Berry Filled Muffins. Chardonnay with breakfast in addition to juice and coffee, OK by us. Wish we could have stayed longer to what more he had in his repotoire. We had friends come over to visit our place before we went out to dinner one evening and Phillip was quick to offer us all a gourmet cheese plate with his Sun Dried Tomato dip and a bottle of their own signature Cab, which was quite good. Phillip's hospitality was overwhelming and our friends were quite impressed. We all chatted about our world travels for sometime. If you prefer a classy, tranquil retreat with gourmet food and personal service over a big resort, then this is your place. We hope to have the chance to return again.", "title": "A Warm and Welcoming Choice in Calistoga", "user": "Mrbstar", "date": "May 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 130374954}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "Wow what an amazing place, it was exactly how I wanted to experience the Napa wineries, in the heart of wine country overlooking a vineyard and within walking distance of several others.", "title": "Perfect place to experience Napa wineries", "user": "kells277", "date": "May 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130200229}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "Peter and Phillip offer amazing hospitality with a heated jacuzzi and pool, great rooms, a homemade gourmet breakfast, all surrounded by a beautiful landscape and vineyard. We tried to get it all in as much as possible, went to the wineries, came back to a glass of wine by the pool, went to dinner in Calistoga, came back and enjoyed the jacuzzi tub under the stars. The stars were amazing by the way because there is very limited light pollution there. For breakfast we had an amazing eggs dish, Eggs Balsamic, with eggs, wheat toast, arugula, leeks, and some fried prosciutto on the side....sooooo good, comparable to a gourmet brunch that you'd have to pay $20+ for.", "title": "Outstanding", "user": "NYSue1025", "date": "May 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130171432}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "I would stay here again in a heartbeat and hope we can get back sometime soon. I will definitely recommend to anyone I know heading to Napa.", "title": "Perfect", "helpfulness": 2, "user": "GR8PNUT", "date": "May 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 129810341}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "We traveled to the Napa area and stayed at our first B&B the week before Memorial day. You cannot go wrong booking a room at Chateau De Vie. Philip and Peter are extremely gracious and accommodating.", "title": "Wonderful experience", "user": "cruizinjunkie", "date": "June 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 132095912}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "Our room was the smallest room they had (no others were available at that time), but it was immaculate and the bed was very comfy. Extra amenities are provided for you in your room, which was very nice.", "title": "If the French Laundry were a B&B, it would be the CDV.", "user": "Mary P", "date": "June 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 131342072}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "The room has no Television, but Wi-Fi is available. This is a very relaxing setting.", "title": "4th time is a charm", "user": "RenoDad", "date": "May 31, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 131012548}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "The grounds and view are beautiful and the house is very inviting.", "title": "Beautiful, Relaxing, perfect get away, worth the price.", "helpfulness": 1, "user": "IsaacsMom", "date": "May 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130880564}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "The B&B is close to many wineries, which make it convenient in the event you do too much wine tasting!", "title": "Relaxing, great location, and wonderful hospitality", "user": "Alex E", "date": "May 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130708675}], "location": {"country": "United States"}, "variance": {"poor": 2, "average": 2, "very good": 7, "terrible": 0, "excellent": 300}, "aka": "Chateau De Vie b&b", "slim_ranking": 0.103448275862, "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "description": "Just minutes from downtown Calistoga, surrounded by acres of vineyards, Chateau de Vie welcomes you into a world of understated elegance. As you enter our gates, lush formal gardens of lavender and quiet sophistication greet you. Built with old European charm, the Chateau has been enhanced with rich earth and jewel tones. Influenced by California unique heritage and the Napa Valley’s beauty, the Chateau has been furnished with your comfort in mind. Comfortable queen and king size beds, lush towels, oversized robes and the finest in linens.Quiet personal attention… magnificent views."}