{"user_rating": 4.5, "review_count": 446, "name": "Chateau Monfort", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "We stayed here because it is vey close to our friend's home and was pleasantly surprised that it was a new small R&C hotel so convenient for us as we are R&C members. When I booked online directly with the hotel, they responded immediately and offered a rate including breakfast and tax to make it easy for us. The communication in English was perfect! I wanted tickets to the Last Supper tour and Dariana stayed on top of the online site and alerted me, and arranged for the purchase! This was 5 star service and I hadn't even arrived yet! When we arrived, everyone of the staff greeted us kindly, professionally and welcoming! We were a bit earlier than normal check-in, but the room was ready in about 30 minutes after we arrived. We had a delicious, nicely served lunch as we waited. The room was very comfortable, tall ceilings, very comfortable bedding and a beautiful bathroom. The water pressure is great, the bathtub is comfortable and they read our requests of extra pillows and a clock and they were already in the room! It was quiet with our big windows looking into a courtyard but still bright. Most of all, the Air-conditioning worked great and was extremely quiet....this is an important thing for an American! I will stay here every time I come to Milan, hands down! BTW, the breakfast is beyond great!!", "title": "Great New Hotel in a nice quiet setting but close to Milan center", "user": "jmandak", "date": "April 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 158094334}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "My husband and I stayed here during our visit to Milan. The hotel is beautiful and we loved everything about it. The location is perfect, just outside the main tourist area, but only a short 10 min walk to most things. The staff were friendly and helpful with dinner reservations and recommendations. The room, although small for a suite, was very well appointed. The room and bath were updated and high quality with all the amenities I look for while at a hotel-, robes, slippers, towel warmer, water bottles, and weather report to name a few. We liked all the different lighting options in the room, so you could set the mood exactly how you wanted. It was so nice to come to Europe and enjoy a comfortable bed and pillow! We normally stay at nice 4 star hotels, but it is so difficult to find ones with comfortable beds in Europe. I actually got some sleep in this hotel. Lastly, we enjoyed a few drinks in the hotel bar. The drinks were good, but the snacks provided with drinks were even better. All around, great place to stay.", "title": "Love this hotel", "user": "madiolosa", "date": "April 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 157513806}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled with family", "text": "We have been at this hotel in February 2013. We simply loved it. They are child-friendly, chic and provide excellent service. Our 3 year old son loved this experience too.", "title": "Wonderful Experience - Loved it!", "user": "MCCMalta", "date": "April 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 157404343}, {"rating": 5.0, "stay_parameters": "Stayed April 2013", "text": "The food is excellent - breakfast is really nice and you are never rushed (even if you go down somewhat late). Dinner is also lovely. Prices are not low, but to be honest, that is our experience on the whole of Milan.", "title": "I want to plan my wedding here!", "user": "susansun3636", "date": "April 10, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 157339422}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "Wonderful new hotel. Relative central in Milan. Wonderful staff that were very friendly. Breakfast was good, even though it was the same selection every day. Excellent coffee!", "title": "Fancy and Friendly!", "user": "docmm_76", "date": "May 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 160090585}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "Rooms have a lovely pastel modern decor. Very clean. Very pleased and would definitely stay here again!", "title": "Great time!!", "user": "alexia b", "date": "May 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 159875229}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled on business", "text": "We'we spend one night in this hotel, and it was a great great time. Everybody there was very nice. The room was nice and calm. It is situated at 5 mins walk from the city center, and from all the boutiques. Even the Spa was perfect. A beautiful and modern \"Relais&Chateau\".", "title": "Dreamlike", "user": "GunesUysalefe", "date": "May 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 159863478}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "I had the great pleasure of staying at Chateau Monfort in Milan and I must say, unfortunately it was just for two nights. The fairytale concept reigned from Do Not Disturb sign to the decorations of the restaurant and even to the uniforms of the staff. In addition to the looks of the hotel's atmosphere, the service was also impeccable and the food was delicious. Looking forward to my next trip to Milan and the Chateau Monfort...", "title": "Wow", "user": "Y T", "date": "April 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 158881999}, {"rating": 5.0, "stay_parameters": "Stayed April 2013", "text": "Me and my girlfriend stayed in a superior room 401 from April 22 to April 25 and, I have to say, enjoyed the hotel in almost every aspect. The hotel is brand new - at reception we learned it opened in 2012, and you can see everything is working and in mint condition. Some of the most romantic places you can imagine, you feel like Alice in the Wonderland with shapes of owls all around the room, cute rabbit shapes applied to different things and even colorful chairs with heart-shaped backs and curved legs. Location looks fine - 10 mins by car to Milano centrale, 20 mins by foot to Duomo and 20 mins by foot to some of the main shopping streets (like Della Spiga). Personnel is extremely friendly, so feel free to bug them with any questions you happen to have. Breakfast selection is quite sufficient, highly recommend to try prosciutto and cheese selection. Restaurant is good as far as food is concerned but with lots of imagination from the cook and rather pricey, in my view, - but make sure you try the foie escalope antipasti, it is exceptional. All in all, truly a 5-star experience, will definitely consider staying there again in Milano.", "title": "Great stay in a beautiful city", "helpfulness": 3, "user": "Mahulu", "date": "April 21, 2013", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 158427371}, {"rating": 5.0, "title": "Special Hotel", "text": "Just back from a four night stay here and loved the hotel, really nicely decorated soft pastel colours throughout the hotel, top quality furnishings throughout, staff were really helpful with recommendations for places to eat and give advice. Breakfast was a good selection, hotel bar very nice place to relax after a meal out. Would certainly return.", "user": "msav1975", "date": "May 15, 2013", "id": 160829516}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled solo", "text": "I stayed here for a weekend in Milan (my first time to the city). The colour scheme of the hotel was fairy tale-like, lots of pastels, almost like a fancy cake. Very comfortable rooms with cool lighting and very comfy bed to rest after a busy day touring. I skipped the breakfast each morning, but you could walk outdoors and go left or right to find a terrific cafe for morning coffee and pastry. Location is ideal, just outside of busy tourist zone but still walking distance.", "title": "Spot on Italian Hotel", "user": "Trvlr_USUK", "date": "May 11, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 160356614}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "We stayed at the hotel for 7 days and 6 nights with our 4 year old and 8 month old and loved it!", "title": "Unforgetable Stay", "user": "babahadi", "date": "May 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 160348590}, {"rating": 5.0, "stay_parameters": "Stayed May 2013", "text": "The staff were very professional and friendly, they always helped with the kids and remembered names, preferences etc.", "title": "A fairytale fantasy with exceptional service!", "helpfulness": 1, "user": "lagarro", "date": "May 10, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 160305056}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "The rooms were beautiful, well maintained and the maid service was very good and rooms were kept extremely clean.", "title": "Good +", "helpfulness": 2, "user": "sarakz", "date": "May 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 160260161}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "Two night stay end of May 2013. Very clean, impressive hotel, comfortable beds, quality bed linen and toileteries. Excellent location, just a 10/15 minute walk to the Duomo, and a tram stop virtually outside. Staff very friendly and helpful. We didn't eat as found it more convenient elsewhere, so can't comment.", "title": "First class and recommended", "user": "NigeH", "date": "June 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 162715097}, {"rating": 3.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "We booked two rooms at this hotel in May 2013 for an overnight stay. We called the hotel to confirm our reservation prior to arriving and they were well aware that we had a family reservation including an extra child bed and yet they did not disclose to us that the type of room we had booked online had no door to the shower!!! There was just a curtain separating the room from the shower. The front desk staff were polite and helpful. We arrived at the breakfast room at 10:30am, breakfast was served until 11:00am. The staff there (except for the Japanese gentleman making eggs, who was very nice) were extremely rude. At 11:00am, we were wrapping up and they began stacking plates and dishes very noisily in front of us, literally clanging silverware. They behaved as if they were doing us a favor by waiting on us!!! We are discerning and frequent travellers; this hotel was a major let down on the last night of our trip. The attitude of the breakfast staff made the experience that much worse!", "title": "Weird Bathrooms!", "user": "PAC304556", "date": "May 31, 2013", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 2.0, "sleep": 2.0, "rooms": 3.0, "location": 3.0}, "id": 162505253}, {"rating": 5.0, "stay_parameters": "Stayed April 2013", "text": "I stayed at the hotel for a weekend as I came to Milan to visit La Scala and for the shopping. In general I had an excellent impression though the room and facilities reminded me more the 4stars hotel while the service was the way better than in Hayatt I stayed several times before. The only complaint is the breakfast - the coffee is a bit terrible but you have a great choice of the brasseries and restaurants just around the corner so it's a great opportunity to explore the perfect neighborhood. It is also well located - just 10-15 working distance from the main shopping streets and just the best building to the trendy D&G Gold restaurant. Will be happy to return here as well. And it is important to mention the convenient valet parking and comfortable area for the car approaching.", "title": "Perfect alternative to Hayatt and Bvlgary", "helpfulness": 1, "user": "Belki", "date": "May 28, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 3.0}, "id": 162087849}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "Fantastic hotel.", "title": "Excellent but watch for the extra costs", "user": "ChrisCorrigan", "date": "May 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 162024521}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "Great location only 15-20 mins walk from The Duomo. Room was excellent (even though we had a huge hanging rail but no shelves or drawers!) and all the staff were first class.", "title": "PRETTY ROOM", "user": "RICHSHAR", "date": "May 17, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 161029149}], "location": {"country": "Italy", "region": "Lombardy", "continent": "Europe", "city": "Milan"}, "stars": 5, "variance": {"poor": 7, "average": 25, "very good": 91, "terrible": 1, "excellent": 322}, "slim_ranking": 0.016091954023, "description": "Château Monfort is the new 5 star hotel located in the heart of Milan, just a few minutes walking from the famous Duomo Cathedral and the main fashion District. Its 77 rooms, with 5 Junior Suites and 5 Suites, are overwhelmed by a charming atmosphere, some retrò style details and a special glamour touch. Château Monfort offers a new philosophy of hotellerie based on fashion, music and art and to recapture a sort of childhood fairytale. The “Rubacuori” Restaurant is an enchanted place where an ensemble of art and passion are turned into a poem by mediterranean savours. Located in the heart of our lobby area under a stunning dome ceiling, our Lounge Bar Mezzanotte plays the landlord role with charms and luxury.Fantastic atmospheres are reserved to the areas dedicated to relax, conferences and events. A dedicated area for meetings, “Le Segrete”, a spacious ballroom “La Sala dell' Incantesimo” and a wine cellar “La Cella di Bacco” offer guests exclusive moments to experience. Free your Senses in our unique SPA “Amore & Psiche”."}