{"user_rating": 5.0, "review_count": 82, "name": "Chateau Clement", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "My husband and I had the most wonderful two night stay here in July. It is the smallest chateau I have ever visited, with four guest rooms in the house where the family also lives (plus a couple of apartments in the grounds). The husband and wife team that lovingly and tastefully renovated the chateau some years ago are now a charming pairing of hostess and chef.", "title": "what a wonderful visit", "user": "AlYorks", "date": "October 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 181239220}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled with family", "text": "We had the white room which was lovely and spacious.", "title": "Wonderful Experience", "helpfulness": 1, "user": "Leslie V", "date": "September 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 177424272}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "We spent time by the attractive pool, admiring our surroundings and the great view. Then the dinner was superb and we particularly enjoyed canapes and aperatifs on the terrace. I didn't personally love the format of all the guests eating together and with 3 sets of guests with different first languages it didn't feel hugely sociable but that may have been unusual. It wasn't a negative though as it was lovely to talk and compare holidays and did fit with the fact this isn't really a hotel - it's an experience - just not my preference really. The breakfast was delicious - light, with yoghurt, cheese and pastries - a perfect French start to the day on the terrace in nice weather. Marie Anntoinette was a lovely hostess, happy to make recommendations for visits to other towns and restaurants and to talk about her stunning home. We don't know when but we do hope to go back. It was a perfect treat to ourselves.", "title": "A little paradise and out of this world experience", "helpfulness": 1, "user": "Advocate7", "date": "August 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 172011996}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "We recently spent 5 nights at Chateau Clement. It was supposed to be a stopover between Italy and the Aveyron and turned out to be the best part of our trip...so we stayed several extra nights. The chateau is beautiful and perfectly maintained. The decor is absolutely perfect. Nothing is overdone and nothing has been overlooked. Marie Antoinette and Eric have put their hearts and souls into the building and the hospitality. Best of all, they make you feel comfortable and pampered. The breakfasts and dinners were all delightful and aperitif hour was a great way to meet lovely, interesting people from all over the world.", "title": "A gem in the Ardeches", "helpfulness": 1, "user": "Jonathan B", "date": "August 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 170950229}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "Having travelled in all corners of the world, I was truly impressed and overwhelmed by the beauty of Chateau Clément, by our spacious, artfully decorated room, by the extraordinary kindness and helpfulness of Marie-Antoinette, by the sumptuous dinner prepared by her husband Eric and by many more major and minor features of this small hotel (see the other reviews on TripAdvisor, most of which I share). But to me, the most attractive feature of Chateau Clément is that it is not a genuine hotel. From the moment of our arrival to the moment of our departure, we were treated as good, old friends. There are many hotels which give you a kind, professional reception. Here we received a truly warm and spontaneous welcome throughout our stay.", "title": "Magnificent and Great Hospitality", "helpfulness": 1, "user": "Rutger P", "date": "June 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 165044530}], "location": {"country": "France", "region": "Rhone-Alpes", "continent": "Europe"}, "variance": {"poor": 0, "average": 0, "very good": 2, "terrible": 0, "excellent": 80}, "slim_ranking": 0.142857142857}