{"user_rating": 3.0, "review_count": 52, "name": "Che Lulu Guesthouse", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "Harsh title, I know, and I rarely do this. But Che Lulu Trendy Hotel was a big miss - luckily the only one of our honeymoon. We were trying to save money... and in most cases we lucked out. Not so much here.", "title": "Nothing accurate about the name: not Che, not Lulu, and not guest friendly.", "user": "TuckerCA", "date": "January 13, 2011", "detail_rating": {"service": 4.0, "cleanliness": 2.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 2.0}, "id": 92786665}, {"rating": 1.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "Cons - The old house that it is located in has been haphazardly decorated in a bohemian manner, however it doesn't quite make it to boho, instead it looks like Grandma's attic and Palm Springs had a love child. The entrance is awkward to say the least - guests must squeeze past old suitcases in order to navigate between a tight corner and 2 locked doors. The room was hot, stuffy, and only slightly helped by the addition of a floor fan at 11 PM. Couldn't leave the windows open due to mosquitoes. The shared bath was hot pink, and I didn't feel comfortable walking in the shower without flip-flops (not the case at a previous hotel where we also had a shared bath, so I don't consider myself terribly squeamish). Never did figure out how to get hot water. My husband doesn't usually mind poor accommodations, but even he announced that we'd only be spending one night here. I was shocked, then jumped onto TA to find a new hotel!", "title": "Do not stay here - overpriced and unclean", "user": "geordie067", "date": "December 20, 2010", "detail_rating": {"service": 2.0, "cleanliness": 1.0, "value": 1.0, "sleep": 2.0, "rooms": 1.0, "location": 3.0}, "id": 90298192}, {"rating": 1.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "Pros - breakfast was nice, with toast, fresh juice, fruit, etc. Owner seemed nice.", "title": "Do NOT stay there!!", "user": "ladyDoha", "date": "September 20, 2010", "detail_rating": {"service": 3.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 3.0}, "id": 80333160}], "location": {"country": "Argentina", "continent": "South America", "city": "Buenos Aires"}, "stars": 3, "variance": {"poor": 11, "average": 5, "very good": 10, "terrible": 15, "excellent": 11}, "aka": "Che Lulu Guesthouse Hotel", "slim_ranking": 0.702127659574}