{"user_rating": 3.5, "review_count": 413, "name": "Chelsea House Pool & Gardens", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "We spent a great time in the Keys, and what added to our time was the wonderful room we had at the Chelsea House. The staff was very responsive and attentive to our needs. The location is prime to all areas of the final key and we just can't say enough about how wonderful the place was. We went to a wedding at the Light House Point Inn and the setting there was so tropical and romantic. We will absolutely be returning.", "title": "Key west wedding", "user": "debgeoff", "date": "August 3, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 36628602}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "We recently stayed at this hotel on road trip through southern Florida and it was the nicest place we stayed. The people who worked there were very friendly and upgraded our room for no reason. The room was very spacious and had everything you could want in a hotel. There were beautiful tropical plants everywhere and a nice balcony. We were only two blocks from Duval Street so we were able to walk everywhere. I highly recommend this hotel.", "title": "Great Hotel in a Great Location", "helpfulness": 1, "user": "kdevaul", "date": "July 24, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 35705569}, {"rating": 2.0, "stay_parameters": "Stayed June 2009, traveled with friends", "text": "Let me start by saying that this is the second time I have stayed at the Chelsea House. I returned with friends because my first stay was amazing. I must have stayed in the best room in the place on that trip (and it was even the dog room - the only room you're allowed to have an animal). This trip and room was a completely different story.", "title": "The musty smell hits you in the face when you open the door.", "user": "beckfordm", "date": "June 30, 2009", "detail_rating": {"cleanliness": 1.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 2.0}, "id": 33558465}, {"rating": 3.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "The service was great. Front office lady was friendly and we had fresh towels each day. The bed was straightened each day as well. The pool was also great. The temperature was perfect and we had fun. However, the room was not so great. The bed was worse than sleeping on the floor. The room smelled like wet wood. The musty odor hit you in the face when the door opened. We had asked about a different room upon arrival (just one with two beds) and the lady stated that they were completely booked. So we didn't bother going back after we smelled the room. I found it odd though that the vacancy sign stayed up the whole time we were there. Nothing in the room dried - not bathing suits, not towels, and not even our hair. It was just damp in there.", "title": "Dissapointed", "user": "tscteach03", "date": "June 28, 2009", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "location": 4.0, "service": 4.0, "rooms": 2.0}, "id": 33359716}, {"rating": 3.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "Upon checkout, we mentioned the smell in the room and asked if anyone had ever complained before and she stated no, but she would let someone know. Not sure if that will ever happen. I feel so bad because I recommended this place to my friends, and they had a bad room too. I won't make that mistake again.", "title": "Fine but once is enough", "helpfulness": 1, "user": "Joy82", "date": "May 25, 2009", "detail_rating": {"cleanliness": 2.0, "value": 3.0, "location": 4.0, "service": 4.0, "rooms": 2.0}, "id": 30755425}, {"rating": 2.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "Just wasn't up to par. Someone different at the front desk every time you called or stopped by, seemed that no one really knew what was going on. The railings on the balcony of our second floor room were rotted and falling out. Tree branches were growing over one side of our balcony. The bed was not level so your feet were higher than your head and and you rolled to one side. There was what appeared to be pet hair all over the carpet. This was supposed to be a free upgrade to one of their better suites, I would hate to see what it would be without the upgrade. Wifi does not work in the room that we were in.", "title": "I wouldn't stay here again", "helpfulness": 1, "user": "bigdaddyroks", "date": "November 6, 2009", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 3.0, "service": 2.0, "rooms": 2.0}, "id": 48663241}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "My wife and I really enjoyed our 3 night stay at this charming little B and B. We found it quiet and comfortable. It was close enough to Duval Street where all the action is to be able to walk there in about 5 to 10 minutes, yet it was far enough away to give us peace and quiet when we wanted it. The hotel and grounds were all beautifully maintained and our hosts were very friendly and helpful. It was great to be able to leave the car behind at their parking area and not have to fight it out down in old town for parking. Was it the Ritz-Carlton?, no, but in my opinion this is the way Key West is meant to be. Highly recommended by this Mid- fifties couple.", "title": "The way Key West is meant to be", "user": "JustplanecrazyP51", "date": "November 2, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 48368845}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "We both loved the luxury of the room, the large space and lovely old - fashioned feel of another time, and lived in the pool. The little breakfast area and pool were perfect for both sun and shade and the privacy factor in the house and pool were very important to us. Easy access to everything and nice to return to after a day in the heat.", "title": "A place to feel special as long as you need and want to!", "user": "Seaweed_Sister", "date": "October 29, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 48024409}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "Had a wonderful stay at Chelsea House for I week in Key West. Renting bikes( Eaton Street Bikes) was the way to go. They dropped off the bikes and picked them up at the Chelsea House. The staff helped with all our arrangements, snorkeling, dining, transportation etc. Don't miss cafe con leche at Sonnys Deli 2 blocks away. All of Duval Street is within walking Distance, that is where we went at night. Best beach is Fort Zachary Taylor Beach. There is a minimal charge but well worth it Food, restrooms, snorkel gear rental available", "title": "Home away from Home while in Key West", "user": "Muse54", "date": "October 28, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 47980450}, {"rating": 4.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "Went here upon recommendation of friends. Got a great deal during the summer season. We were able to bring our dog which was fantastic. We had a small room but did not feel cramped. It was very clean. Did not wake up for breakfast so can't comment on that. Love the quiet pool area - so relaxing and laid back! Hope to go back again and I recommend to my friends.", "title": "Lovely, Relaxing Stay", "user": "NikM13", "date": "October 18, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 47177861}, {"rating": 5.0, "title": "Quaint, Romantic, Historical", "text": "This historical b & b is located three blocks from Duval Street. The front desk clerk was very pleasant and efficient. We stayed in a room with a king sized bed and a sitting room with a nice flat-screen TV. The bathroom was a bit small, but this did not detract from our enjoyment of the room and its overall quaintness. There is a swimming pool and a satisfying continental breakfast is served each morning at poolside. This is a nice, romantic bed and breakfast. :And as an added bonus, a friendly cat roams the grounds to greet guests.", "user": "daverrco", "date": "January 5, 2010", "id": 52696669}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "My husband and I stayed 4 nights at Chelsea House in July (before moving on to a townhouse we rented for the next 2 weeks). We picked Chelsea House because of its location and reasonable rates. We had a standard room which was on the second floor of the annex building. It had a nice (shared with 1 other room) balcony that overlooked the pool area (and the \"clothing optional deck\" which thankfully was not in use!). Although very old, our room was very clean and the bathroom appeared to be recently remodeled with nice tile and an excellent shower. The sink was in the bedroom, not the bathroom, which we liked. It also had a wine cooler which we also kept fruit and water in. The bed was OK. The a/c worked almost too well in the room, but the hallways were not air-conditioned, which made for a sweaty time carrying our stuff up and down the stairway to our room. There were other rooms using the same hallway as ours and they were occupied by a group of friends that were very noisy and spent a lot of time talking in the hall right outside our door which got on our nerves. In fact the noise level (talking, doors slamming, etc.) was probably the one most negative thing about our stay. Breakfast down at the pool was very nice. And the pool itself was a great amenity in the HOT July weather and the grounds are beautifully landscaped. It also had plenty of free off-street parking - we parked our car and walked everywhere. The good far outweighed the bad about Chelsea House - if the price was right we would stay there again.", "title": "We enjoyed our stay", "user": "ChicagoPokerGirl", "date": "December 28, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 52015215}, {"rating": 4.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "we stayed at the chelsea house for two day and loved it. great location, quiet and a wonderful value. we got the deluxe room with the king size bed. very comfortable and it came with a very sweet pet cat. we would stay there again. the only improvement could be a jacuzzi.", "title": "great location, nice room, good price", "user": "glorbegozo", "date": "December 20, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 51537890}, {"rating": 2.0, "stay_parameters": "Stayed November 2009, traveled with family", "text": "not far from Duval main street, rent comes with parking, rooms are basic, downturn is small bathroom, old and poor beds, very disappointing breakfast, nice backyard with swimming pool. Overall not worth the money we paid for.", "title": "good location, nice setting, too expensive for value", "user": "globtrotter4ever", "date": "December 17, 2009", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "location": 5.0, "service": 2.0, "rooms": 1.0}, "id": 51418506}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "We really enjoyed our one night at the Chelsea House on October 26, 2009. My husband and I had traveled to Key West for a short trip away from Minnesota before winter brought snow and cold weather. We only stayed at the Chelsea house one night when we couldn't cancel our other hotel reservation that was farther away from Duval. The service at check-in was great and our room was ready at the time that it was supposed to be. We were in the Butterfly Room on the second level. The room was spacious and comfortable. The shower was a little small and wasn't someplace you wanted to spend a lot of time in - get in and get out, but the bathroom did the trick. The pool was small, but small in a cute way. The breakfast was also very good and hit the spot after a night out of drinking on Duval. Will consider staying here again on our next trip to Key West!", "title": "The Chelsea House is an adorable place to stay!", "user": "JamB57", "date": "November 13, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 49130715}, {"rating": 5.0, "title": "Great B&B that's pet friendly", "text": "Enjoyed our stay here for 1 yr anniversary. Pet friendly so we could take our doggy :)", "user": "JamieLeighB", "date": "October 12, 2009", "id": 46699949}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled solo", "text": "On of Key West's heritage inns this was an oasis of calm right on the edge of Duval Street with excellent old-fashioned rooms, a small pool and sun-deck and a free breakfast of juice,cereals,fruit an toast and muffins.", "title": "Fine old boarding house on the edge of the action", "user": "Wahaay", "date": "September 29, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 45439980}, {"rating": 2.0, "stay_parameters": "Stayed December 2008, traveled as a couple", "text": "Great location and a good place to take a breather before plunging back into the party-scene,", "title": "Poky rooms, rude staff and overpriced", "helpfulness": 1, "user": "LondonJohn1971", "date": "August 31, 2009", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "location": 4.0, "service": 1.0, "rooms": 1.0}, "id": 39386699}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled with friends", "text": "Staff were very helpful an overall this was an excellent place to stay.", "title": "Nice Cozy Victorian Style Hotel", "user": "dounda_19", "date": "August 24, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 38628708}, {"rating": 2.0, "title": "We'll go somewhere else next time", "text": "Apart from the location this place has nothing going for it. The staff are amongst the worst I have come across in the United States - rude, incompetent and poorly trained. We were supposed to stay for 4 nights but left after 2.", "helpfulness": 1, "user": "Tootchmcgootch", "date": "August 9, 2009", "id": 37117459}], "location": {"country": "United States"}, "variance": {"poor": 59, "average": 66, "very good": 149, "terrible": 22, "excellent": 117}, "aka": "Chelsea House Pool & Gardens Hotel", "slim_ranking": 0.85, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.5, "location": 4.5}, "description": "Chelsea House Pool & Gardens is one of five hotels in the Historic Key West Inns collection and is centrally located in the Old Town area of Key West. Just two blocks from Duval Street, you can walk to Key West restaurants, nightlife, and attractions. This former estate property includes two grand Victorian mansions dating from 1888 and 1906 that stand on an acre of tropical gardens. Within the expansive grounds there is a large heated pool and many comfortable lounging areas. Whether you seek sun, solitude, or a gathering spot for friends, Chelsea House offers a perfect spot for your next Key West vacation."}