{"user_rating": 4.0, "review_count": 339, "name": "Cherry Court Hotel", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "We come through London often and we hate to pay London prices for accommodation because we really do spend so little time in our room. This is why Cherry Court is pretty much perfect for us. Great location, friendly service and everything we needed for our stay.", "title": "Fantastic Value for London", "helpfulness": 2, "user": "LagunaGrrl", "date": "March 25, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 126650532}, {"rating": 1.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "Yes - the rooms are tiny. I'd say our room itself was probably the dimensions of a king-size bed (with room for a double bed and side table near the large window). The bathroom is also very small - \"one person at a time\" small.", "title": "Beware the family room", "helpfulness": 3, "user": "Edinct", "date": "March 25, 2012", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 2.0, "sleep": 1.0, "rooms": 1.0, "location": 4.0}, "id": 126616999}, {"rating": 1.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "Ok. So it's small. If you want big, go somewhere else. If you want value, stay at Cherry Court.", "title": "Not a good experience!", "helpfulness": 3, "user": "joanc1992", "date": "March 16, 2012", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 5.0}, "id": 126170589}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled with family", "text": "The very friendly Mrs. Patel helped us to check in and rang us later to make sure we had everything we needed. All the rooms at Cherry Court have been recently renovated. I was surprised at how nice everything was given the low nightly price. I expected worn and dated, but what we got was fresh and updated.", "title": "Clean and quiet in central London", "helpfulness": 5, "user": "SophieJCW", "date": "January 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 123071602}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "The hotel is about 5-8 minutes walk from Victoria Station. There are pubs close by and you'll find yourself pretty much in the center of everything once you walk out the door. The neighborhood is safe and I would stay here as a solo female traveler without a doubt.", "title": "Good value for budget traveler.", "user": "J3Othon", "date": "January 13, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 123033056}, {"rating": 4.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "Stayed here for 1 night in mid-November - clean but small rooms, friendly and helpful owners (Mr and Mrs Patel), free internet in the lobby, and well located near Victoria Station and also the Apollo Theatre (where we saw 'Wicked' - can highly recommend this musical!). For the price we paid, it was excellent value, and the breakfast basket was basic but sufficient.", "title": "decent budget hotel very close to Victoria station", "helpfulness": 7, "user": "SydneyNik", "date": "November 23, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 11014881}, {"rating": 4.0, "stay_parameters": "Stayed September 2007", "text": "We got 'upgraded' from the double to a triple room - it was more spacious, but it is also the room at the front of the hotel, and at street level, so we did have a problem with some street noise around midnight. We were there only 1 night so we could put up with it, but if you were staying longer, I would definitely suggest asking for a room that overlooks the courtyard at the back.", "title": "Great spot", "helpfulness": 7, "user": "SargeCalgary", "date": "November 18, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 3.0, "location": 5.0}, "id": 10896138, "likes": {"liked": "— Clean, great location for a great price", "disliked": "— Small room"}}, {"rating": 1.0, "stay_parameters": "Stayed June 2004, traveled solo", "text": "Great place to stay especially for the price. Fabulous location. Very clean. Charming room. Pleasant and accommodating owners. Breakfast basket was a bonus. Rooms are small but who needs a bunch of space when you're in London.", "title": "This place gave me the creeps!", "helpfulness": 1, "user": "lovescotlandColorado", "date": "October 2, 2007", "detail_rating": {"front_desk": 3.0, "value": 2.0, "location": 3.0, "service": 3.0, "rooms": 1.0}, "id": 10030950}, {"rating": 3.0, "title": "Great London Location", "text": "Skimming through some of these reviews, I have to keep asking myself if maybe I stayed in a different hotel entirely! My stay was three years ago, but I still shudder whenever I think of my ONE night in this hotel. After a trip to Scotland, I met up with a friend of mine from the States who had been visiting her family in Germany. We spent the day together in London before heading home. We decided on this hotel because it was recommended by Rick Steves, even though I had been to London twice before and had stayed in a hotel that was a little pricier, but very nice. Although Mrs. Patel was friendly, I found the hotel to be shabby, dark, and dank. The room my friend and her son stayed in was the size of a postage stamp...one had to basically leap from door to bed to sit, as their suitcase took up all the floor space. The bathroom was beyond tiny and had a horrible smell that permeated the whole room. My room was on the very top floor, and since it was impossible to drag my suitcase up the many flights of very narrow stairs, I had to leave my suitcase in the office and carry up only what I needed for the night. My bathroom had recently been redone, so was passable, but totally incongruous with the nasty attic room. The bottom part of the bed was horribly stained with God knows what, along with many other disgusting things too numerous to mention here. At least my room had enough space to walk about a bit, and my friend could sit on the one metal folding chair. I stayed awake all night, terrified I would miss my airport shuttle in the morning and have to stay an extra minute in this horrid place. I have been to London before and since, and believe me, Rick Steves got this one wrong. Spend a little more and stay in a decent hotel.", "helpfulness": 2, "user": "hokie-traveler2", "date": "September 29, 2007", "id": 10018175}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "With the right expectations of Cherry Court, it was fine. It wasn't a posh ritzy place, and it wasn't a cozy B&B. It is an urban mini-hotel that's right near Victoria Station and a steal of a price for London. The accommodations were good enough for a place to crash. The place was kept very tidy. It is small and tight, but it's location was great. Our bathroom was a bit old and there were some disappointments with that, but again -- it worked. The service at the front desk was fine, but check-in and check-out is about all that you see of customer service. The fruit basket breakfast in the room was actually a nice break from the heavy English breakfasts, and it was easy enough to get something later in the morning if we got hungry!", "title": "Enjoyed our stay", "helpfulness": 5, "user": "LauraMarie79", "date": "September 17, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 3.0}, "id": 8736654, "likes": {"liked": "— Location, price"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled solo", "text": "Stayed here three nights. Small but clean room with modern bathroom fixtures. Quiet and very well located for public transportation. Friendly staff. Breakfast basket provided each evening was very handy for carrying into town for those times when finding a place to eat was not practical. Room also had t.v. and hot water kettle with tea and coffee. I would definitely stay here again.", "title": "Good budget option", "helpfulness": 1, "user": "Joe A", "date": "October 17, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 119385518}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "As other reviewers have mentioned, the rooms are very small and ours (Room 4) seemingly still in the process of refurbishment. Very quiet at night despite the pub being only a few doors down. You can't beat the location, only about 5 minutes or less from the Coach Station and the Underground. Plenty of shops and restaurants in the area, so you can get anything you need. My wife came down with a severe case of food poisoning while we were there (avoid the all-you-can-eat buffet at the pizza place at the Victoria shopping centre) and we found the proprietor, Mrs Patel, to be genuinely helpful in finding a medical practice to get it sorted out. One reviewer mentioned the dodgy TV reception and our room was the same. I rewired the plug on the antenna cable and problem solved - full reception. Also the toilet tank kept thumping all night due to leak/refill routine, but I re-jigged the internals and fixed that, too. Apart from those minor issues, Cherry Court is a pain-free, no-frills and inexpensive London accommodation option.", "title": "Cherry Court great value", "helpfulness": 2, "user": "ptwhite", "date": "October 6, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 119005606}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "Very small room in Victoria Station area. Close to the station,very convenient. Affordable price.The owner was very helpful.Some great restaurants about one block away. For convenience to Victoria & cheap rooms you can't beat Cherry Court.No breakfast buffet but a fruit basket in room.It suited my needs well.If looking for elegance & ambiance look elsewhere. The only negative thing was the TV only had one channel that was watchable.", "title": "Bare Bones But Did The Trick", "helpfulness": 1, "user": "BlueFiddler", "date": "September 29, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 118720499}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "While the rooms are small as previously mentioned, the hospitality is fantastic, the rooms are spotless and the location is hard to beat. We switched rooms in the middle of our trip (based on availability) and while our first room was larger, it was on the top floor and the Wifi would not work. Our next room on the second floor was smaller but had a good connection. A huge thumbs up to Mrs Patel!", "title": "Great, affordable location", "user": "Sweetaura", "date": "September 29, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "location": 4.0, "service": 5.0}, "id": 118720302}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled with friends", "text": "We've stayed at Cherry Court for 10 years or more. It's still a great place to stay in London even though the rooms are very small. The Patel’s are great hosts and you can’t beat the location & price. Only 2 blocks from the Victoria Coach station, Victoria train station, & Victoria tube stations. The St. George’s Tavern is only 50 yards away for drinks & good pub food.", "title": "Great Place in London", "helpfulness": 2, "user": "bobe2", "date": "September 27, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 118673903}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled with friends", "text": "I love this place! Clean rooms, clean bathroom and the fruit basket is exactly perfect if you've been out late/early at the clubs. I felt completely safe - the street is close to Victoria but doesn't feel as if it is in the center of a major city. The pub at the corner has amazing food and there are several others within a few blocks. The staff is excellent: polite, helpful and kind. Yes, the rooms are small, but for the price, it is well worth it.", "title": "Finally a London hotel I'll stay at again!!!", "helpfulness": 2, "user": "deadlghts", "date": "March 12, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 14237538, "likes": {"liked": "— The owners are wonderful", "disliked": "— Missed my wifi"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2008", "text": "I stayed at the Cherry Court for 6 nights. It was my first trip to London and as a solo female traveller I wanted to make sure I was in a safe local. It was perfect. Although it is near a major hub of transport, it is central and quiet. In fact, at night, when it's very quiet you can hear Big Ben striking the hour (despite it's distance from the hotel). An unexpected perk of the location! Rooms were clean, efficient, nice fruit/cookie baskets each morning, great water pressure and temperture in my private bathroom. The internet access was very, VERY helpful in order to keep touch with family & friends back in the states.", "title": "Great Budget B&B in central location", "helpfulness": 3, "user": "filmstarco", "date": "February 15, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 13576986, "likes": {"liked": "— How clean, safe and convenient it was to everything."}}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "Two small issues (and i mean small):", "title": "Perfect for Budget Travellers", "helpfulness": 4, "user": "maroongiraffe", "date": "January 31, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 3.0}, "id": 13143604, "likes": {"liked": "— Fantastic location", "disliked": "— Pokey bathroom!"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled with friends", "text": "1) The internet PC is located right next to the reception desk. Although I appreciate friendly staff there was a young man (perhaps the owners' son?) who became increasingly talkative everytime i'd appear to use the PC. I'd try to send emails and he'd come out from behind the desk and ask all sorts of questions. I have no issue with friendly chat, but by the end of the trip my emails had gotten shorter and shorter just to avoid having to answer personal family questions.", "title": "best bet for london on a budget", "helpfulness": 1, "user": "cartmanCanada", "date": "January 16, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 3.0}, "id": 12695143, "likes": {"liked": "— location"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "2) I have friends in London and stayed out after 9pm on a few nights. Although I had 24hr access with my own keys, they shut the outside lights off and the street is a little dim. I found it a bit disappointing that no lights illuminate the outside the B&B after 9pm.", "title": "Great bargain for London", "helpfulness": 6, "user": "MlleLarisa", "date": "January 12, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 12546195, "likes": {"liked": "— Location! Good price (for London!)", "disliked": "— Lack of space and privacy within the room"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "We booked a double room with an ensuite at Cherry court hotel. It is a short walk from Victoria Station, which is exceptionally handy. It is a nice and safe neighbourhood. The staff was very helpful and there is free internet you can use. The room is quite tiny and the ensuite is very small, but for 55 pounds a night in a nice and safe neighbourhood, what else can you ask for?", "title": "Great location", "user": "chellilee", "date": "May 30, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 3.0}, "id": 16506384, "likes": {"liked": "— The location"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "They provide a basket with fruit, nutbars and juice.. so you can take it with you.", "title": "Tiny rooms, but great value for the price", "helpfulness": 1, "user": "ssibayan", "date": "May 8, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 15823420, "likes": {"liked": "— Friendly hotel staff", "disliked": "— Room size"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "Definitely recommend it if you are on a budget and want to stay in a central location.", "title": "Clean, Friendly, Convenient", "helpfulness": 1, "user": "Claireincognito", "date": "May 6, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 15709207, "likes": {"liked": "— Very convenient for transport links", "disliked": "— Bathroom door!"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2007, traveled with friends", "text": "We stayed two nights at the Cherry Court Hotel. Although the room was incredibly small, I still give this hotel 5 stars for several reasons:", "title": "helpful staff, good location", "helpfulness": 1, "user": "crwnjlz", "date": "April 24, 2008", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 15312668, "likes": {"liked": "— location, friendly staff", "disliked": "— none!"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "- I challenge you to find another clean hotel in such a fantastic (yet strangely and wonderfully quiet) location at 55 pounds per night.", "title": "A Decent Budget Hotel in Central London", "helpfulness": 1, "user": "Imbellydancer", "date": "April 15, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 15049158, "likes": {"liked": "— Location", "disliked": "— N/A"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "What really makes this hotel a 4 star is the location for the price. The rooms are small, just fitting your beds and a bathroom, but clean. The owner seemed very nice. What we loved was the location -- it took us about 15-20 minutes to walk to Buckingham Palace, Big Ben or Westminster Abbey. On most of our days we didn't have to take the tube once, we just walked to our different destinations. For around £80 for a triple, you really can't beat the Cherry Court for a hotel in central London. True, it was a bit cramped for the three of us to be moving around the room at the same time, but how long are you going to stay in your room when you're that close to the sights? I would definitely recommend this hotel, mainly because of its excellent location.", "title": "Average Hotel with Fantastic Location", "helpfulness": 2, "user": "dogbone1002000", "date": "July 31, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 18445886, "likes": {"liked": "— Location, Location, Location", "disliked": "— The size and condition of the rooms -- even though they were clean, they seemed a bit aged, and the rooms were small even for Europe standards"}}, {"rating": 3.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "Overall very tiny, not enough space to move around especially for 2 people; 10 min walk from Victoria Stn., hot water takes time, bed ok, free internet; very budget ok; no use of phones; free fruit basket containing juice, granola bar, apple, banana; no elev; able to leave bags in lobby to sight-see; reception (Mrs. Patel) was very helpful, nice.", "title": "Small, very budget", "helpfulness": 1, "user": "viscountesslily", "date": "July 5, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 4.0}, "id": 17562067, "likes": {"liked": "— the price, reception was helpful, accommodating", "disliked": "— size of room"}}, {"rating": 3.0, "stay_parameters": "Stayed June 2008, traveled solo", "text": "The overwhelming reviews sound a bit strange to me because the Cherry Court is for sure not a Luxurious Spa Ressort...", "title": "Fair place to stay", "helpfulness": 1, "user": "magyar_lany", "date": "July 3, 2008", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 17485614, "likes": {"liked": "— Location, Room Rate, quiet neighbourhood", "disliked": "— No space in the bath corner, no chair"}}, {"rating": 3.0, "stay_parameters": "Stayed May 2008, traveled solo", "text": "It is a very simple accommodation in Central London. Be aware that the house in general and especially the rooms are really very very tiny, actually there was a small double bed and a small gap on two bed sides to walk or better to put the suitcase somewhere. No chair, no table, nothing similar. Also in the tiny bath corner there was not really space to put something somewhere. Be informed what to expect !!", "title": "Nice", "helpfulness": 2, "user": "Ronnie18", "date": "June 17, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 5.0, "rooms": 4.0}, "id": 17004335, "likes": {"liked": "— Location and managment was helpful"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "I knew that very well and was not surprised. We stayed the whole day outside therefore it was ok for us. We went for the good price and for the very good location. Victoria Station is almost around the corner, in the ensuite Victoria Shopping Arcade are shops, a Starbucks and also a supermarket which is open until 11 p.m. every day. The owners were also friendly to us and answered all our questions concerning London.", "title": "Loved it!", "helpfulness": 1, "user": "kutri", "date": "June 11, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 16845063, "likes": {"liked": "— Clean and friendly"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "If you are spending your days in London to experience London and aren't concerned with having a luxurious hotel room which you're probably not spending alot of time in -- the Cherry Court Hotel is for you! Its a 5 minute walk from Victoria underground and Rail station. Since you are soo close to the train station -- you are central to EVERYTHING IN LONDON! If you are a walker you can even walk to Buckingham Palace (10-5 minute walk), Westminster Abbey, etc", "title": "Great Location. Great Price!", "helpfulness": 3, "user": "tbpusa", "date": "November 30, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 121257988}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled with family", "text": "The room is compact though -- the website says that and its true. The room is a little bit bigger than the queen size tbed that's in it. You do have an ensuite bathroom. Plus you get a nice llittle basket of goodies every morning to get you started on your day. My husband and I stayed there for 3 nights and would do it again in a heartbeat! Also - there is FREE internet service in the lobby which was a godsend!", "title": "Best location for the price-clean and safe.", "helpfulness": 2, "user": "cheaptravel_10", "date": "November 19, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 120798511}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "We have stayed here several times, but this time they have upgraded the rooms and it is even better. Only a block from Victoria Station we walked to Buckingham Palace, Trafalgar Square and Big Ben (but we like to walk). The beds are narrow and rooms are tiny, but we feel it makes up for it with the cleanliness, safety and location. They leave a basket of fresh fruit and granola bars for breakfast which we take to eat on the way to our first destination. There is a computer to use in the entry, blow dryer on request and TVs in every room. No elevator, but they accomodated me by giving a first floor room with my bad knee when set up ahead of time. They like to be paid in cash. There is a pub less than a block away, but the food is pricey.", "title": "Good Position, confortable for maximun one night", "helpfulness": 3, "user": "Yuza77", "date": "November 17, 2011", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 120694658}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled solo", "text": "The Hotel is less then 5 minutes on walk from Victoria Station and Bus Stops.", "title": "Nice little place", "helpfulness": 2, "user": "petz79", "date": "November 9, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 120382513}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "The room is very very little but for one night is fine.", "title": "Great Little Place!", "helpfulness": 2, "user": "catch242", "date": "November 8, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120355652}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled solo", "text": "I was in London just over a year ago. for two week. and stayed at Cherry Court Hotel. (sorry it took so long to wright a review.) Sept.23rd - Oct.7th. Room #6. This little Hotel is right in the middel of it all. 2 blooks from Victora station and bus lines. less than a 15 min. (good paced) walk to Buckingham Palace. there is a pub at the end of the street that has great food. The rooms are small but very clean and tidy and if you are just sleeping there at night its all good. While i was there my room got a new T.V. Very nice i have to say. Hugh Street is quiet well lit at night and clean. The staff answered every question about where things where and how to get there. i got there early (Fight was ontime) and they let me check in early. so nice of them. When i go back this year i will be staying there.", "title": "Small & very cute a Great location.", "user": "Timothy B", "date": "January 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 122744109}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "This hotel is ideally placed close to Victoria station, on a very quiet side street. The room was clean, neat, and quiet, if a bit small. The price was very reasonable. The fruit basket makes breakfast very convenient because you can get up whenever you feel like it. The owner is a very helpful woman who even offered to move her car so that I could park directly in front of the hotel (no need, I parked half a block away.) I will definitely be staying here on my next visit to London.", "title": "it was perfect", "helpfulness": 2, "user": "Ivebeeneverywhere99", "date": "January 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 122582974}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled with family", "text": "Needed a place to stay near Victoria, and we weren't disappointed.", "title": "Nice Little Find....", "helpfulness": 8, "user": "Bill_684", "date": "January 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 122484057}, {"rating": 4.0, "stay_parameters": "Stayed December 2011", "text": "Nice sized room with air conditioning, and small clean bathroom and very reasonable", "title": "Very good value in superb local", "helpfulness": 2, "user": "TCAC1", "date": "December 20, 2011", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 3.0}, "id": 121922612}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled solo", "text": "Breakfast basket was a lovely touch", "title": "Close to ideal, except for the fruit basket", "helpfulness": 2, "user": "Linas55", "date": "December 3, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121361007}], "location": {"country": "United Kingdom (UK)", "continent": "Europe", "city": "London"}, "variance": {"poor": 16, "average": 45, "very good": 167, "terrible": 9, "excellent": 102}, "aka": "Cherry Court London", "slim_ranking": 0.193308550186, "description": "Minutes walk from Victoria tube, rail and coach station, located on quiet residential street. Within walking distance to many sightseeing sights of central London. Run by a friendly small family providing a personal touch for over 25 years, with much information and knowledge of local area."}