{"user_rating": 5.0, "review_count": 139, "name": "Chestnut Lane Cottage", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "My husband and I stayed at Kathleen and Jim's cottage in February and loved our stay. The surrounding scenery was peaceful and enjoyable, Kathleen's fresh baked scones were delicious, the warm breakfast was fantastic, and everything was just perfect. We had a great time and wished we could have stayed in the cottage for our entire trip. If you can only stay in one B&B while in New Zealand, pick the Chestnut Lane Cottage!", "title": "Wonderful Visit!", "user": "Esther W", "date": "April 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 156728510}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "Chestnut Lane Cottage was the first stop on our two month trip to New Zealand. We arrived after a 30 hour trip and drove the last two hours from Auckland. Kathleen's warm greeting and some homemade banana bread were just what we needed. The separate cottage is sparkling clean and comfortable and wonderfully quiet. We slept soundly and woke to the beautiful cottage and sunny yard.", "title": "Beautiful cottage, wonderful hosts", "user": "Khootie", "date": "April 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 156509648}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "We stayed for two nights and Kathleen made us a fantastic hot breakfast each morning. We enjoyed her company as she sat and chatted with us as we ate. She filled us in on the town of Matamata and things to see and do.", "title": "Hospitality at it's best", "user": "ShaniCognac", "date": "April 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 156463297}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "We toured Hobbiton during the day and it was a quick and easy drive. In the evening we enjoyed happy hour with John, Kathleen and two other guests from England. John and Kathleen made us feel like family and we really enjoyed their company. We wished we had more than two nights at the cottage. If we are lucky to return to New Zealand, we will definitely retun for a longer stay.There is a lot to see in the area, besides Hobbiton.", "title": "Tranquility after a long day", "user": "katharine b", "date": "April 1, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 156315508}, {"rating": 5.0, "title": "Comings and goings", "text": "Our stay here will always be one of our best memories. We highly recommend a stay at Chestnut Lane Cottage.", "user": "traveler25_11", "date": "March 30, 2013", "id": 156067967}, {"rating": 5.0, "title": "Lovely Experience", "text": "We stayed overnight at Chestnut Lane (not the cottage, but the two rooms in the house) before visiting Hobbiton the next day. Kathleen and John were very welcoming, took care of everything - including setting out homemade biscuits for us the night we arrived! Everything was provided - including heated blankets, toileteries, towels and a sumptuous breakfast the next day. Plus we love to tell our friends that we stayed at the property where some of the cast of \"The Hobbit\" did :D", "user": "Travelm0m007", "date": "April 30, 2013", "id": 159304805}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "Stayed only one night here to be on the early morning tour of Hobbit-town.", "title": "Brand new and spacious luxury on perfect location", "user": "huys25", "date": "April 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 159015318}, {"rating": 5.0, "title": "A peaceful and friendly place to stay", "text": "Relative new housing development area with still a number plots for building. Spacious, tasteful house and decoration in very quiet location and very clean. We had the room in the house (14m2) and the sole use of the spacious bath and shower room (7m2) with separate toilet right next door. We did not stay in the separate cottage. From all 25 B&Bs in NZ this was about the largest living-kitchen area, but we spend a nice evening on the very spacious terrace (30m2) with outlook over fields. Plentiful and cooked breakfast and lots of chatting with owners.", "user": "Stratocasta", "date": "April 26, 2013", "id": 158899208}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "I personally thought the polyester bed sheets were sweaty, but my wife liked their smooth texture.", "title": "one of the best", "user": "mjs747", "date": "April 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 157886897}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "We stayed at Chestnut Lane Cottage last night. It was perfection! Everything was spotlessly clean and modern. Kathleen and John were the perfect hosts. The bed is very comfortable and as we slept the only sound we could hear was the cows mooing in the distance. We woke to a loverly view of the mountains. Kathleen prepared a wonderful breakfast and considered our dietary needs. If you are in the north island make sure you stay at Chestnut Lane Cottage, you will love it!", "title": "Sweet As", "user": "Jantastic", "date": "April 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 156787073}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "My wife and I started our anniversary trip to New Zealand by staying with Kathleen & John at Chestnut Lane Cottage (CLC). It exceeded all expectations from the reviews of fellow travelers. The cottage itself is a wonder. Lots of fresh air; a deck perfect for star gazing (especially great for us Northern Hemisphere-types); and all modern conveniences in a tranquil setting.", "title": "The Last Homely House West of the Mountains", "user": "travelingnorm", "date": "March 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 155544542}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "Our hosts could not have been lovelier. Kathleen & John: thanks for the anniversary champagne and the spectacular homemade scones that made our drive from Auckland worth the effort to arrive in time for tea.", "title": "The place to stay for a visit to Hobbiton", "user": "Toffeeman66", "date": "March 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 155216856}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "The location is perfect if you are LOTR/Hobbit fans like ourselves. CLC is a short, picturesque drive to the Shire/Hobbiton filming location. And, hey, Bilbo Baggins slept here. It was also a nicely central location to drive to Rotorua (West) and Raglan (East) for further exploration of the region.", "title": "Mind over Mata", "user": "Brian F", "date": "March 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 155132323}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "Suffice to say, when we drove away from CLC, we were wistful that our stay was only two nights. As Tolkien might call it, the cottage is \"the Last Homely House west of the Mountains.\" Brilliant.", "title": "Completely true", "user": "adehoek", "date": "March 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 155112939}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with friends", "text": "This is a fabulous place. Kathleen and John have a beautiful modern house with a separate cottage for the b&b. We were welcomed with drinks and home made cakes. We enjoyed a BBQ with a few beers on their patio. The modern cottage was beautifully appointed and we had a great night's sleep. The breakfast in the main house is outstanding. Our eggs came from their own chickens that very morning! And all at a great price. If you are going to Hobbiton stay here. Apparently Martin Freeman and his family did when filming The Hobbit.", "title": "Great place to stay with fantastic host.", "user": "Dennis_Poh_82", "date": "March 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 154715152}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "A great B & B. Creme del a Creme.How else can you describe this lovely place.", "title": "Wow & Superb", "user": "Barry-Jang", "date": "May 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 161854593}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "We were in the separate cottage,everything was spotlessly clean and modern.Really quiet and peaceful, definitely Wow.", "title": "Wonderful Service and Comfort", "user": "Polarkai", "date": "May 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 160845498}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "Plus Kathleen and John were the most lovely couple,who went out of the way to make it really special. ( It was for us ) We were fortunate to have 2 lovely evenings together chatting over some lovely wine ( I always carry it in my car in NZ ) This and a lovely BBQ. This to me makes it ''Special,'' To relax and hear other peoples views of life,this from another part of the world.", "title": "Luxury cottage - the perfect stopover", "user": "lyntosh", "date": "May 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 160836608}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "Kathleen made us most welcome ,even though we arrived early. We needed to drop off our luggage,on our way to ''Wairere Falls'' (Well worth a visit. see separate review.)", "title": "Hospitable hosts and spacious luxury BnB", "user": "david_grimbichler", "date": "May 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 160768736}, {"rating": 5.0, "stay_parameters": "Stayed April 2013", "text": "Most, if not all visitors come to Matamata to go to Hobbiton, which we did , Recommended ( see separate review ) It is a small town/village with a Hobbiton style information centre.", "title": "Lovely cottages with great hosts", "user": "Enchante12", "date": "May 1, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 159397129}], "location": {"country": "New Zealand", "region": "North Island", "continent": "South Pacific", "city": "Matamata"}, "variance": {"poor": 0, "average": 0, "very good": 1, "terrible": 0, "excellent": 138}, "slim_ranking": 0.25, "description": "This brand new self-contained cottage, with beautiful country views, is five minutes drive to Matamata town centre and 10 minutes drive to Hobbiton.Your private cottage has a lounge and kitchen that open out onto a deck with stunning views. The bedroom has a queen size bed, walk-in wardrobe and ensuite.A large cooked breakfast is included. Home cooked lunch and dinner on request. Free WiFi. DVD player. Your friendly hosts Kathleen and John welcome you."}