{"user_rating": 4.5, "review_count": 363, "name": "Chester House Hotel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "Just stopped 3 nights over Easter. Hotel was wonderful, room was spacious, clean and well equiped. We ate in The Croft Restaurant every night (in a separate building just across the road from the hotel). Food was delicious and service excellent. You do need to book a table in advance as it does get very busy. Breakfast was taken in the main hotel and again the food was very good and service very efficient. Throughout our stay we found every member of staff to be extremely pleasant and helpful and you got the impression that they all loved their jobs and they all got on extremely well together which does create an excellent atmosphere which, as guests, we picked up on. Location is ideal. We were lucky to get a car parking space as these are limited, however, once we had parked the car we left it there until we checked out. Plenty to do in Bourton on the Water and it is a pleasant walk to nearby Lower Slaughter. This is definitely the hotel we will stop in next time we visit the Cotswolds.", "title": "Wonderful Relaxing Break", "user": "Cakesy", "date": "April 6, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 60503525}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "Cute hotel in a beautiful location. However, the staff were a little disinterested. It appeared as though the owners were away for the weekend and they had left the kids in charge. Clumsy waiters at breakfast and felt like they were doing us a favour getting us a table in their restaurant for dinner. The restaurant was very nice, but again you sort of felt like they were doing you a favour letting you eat there - and lets face it, for the cost of both the room and the restaurant I think we were the ones providing the favour!! Couldn't fault the room though, lovely view of the garden and very spacious. Bourton-on-the-Water is however hugely over populated with tourists!!!", "title": "Very nice, but totally over priced", "user": "TravelAide", "date": "April 5, 2010", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 60460947}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "We chose this hotel as result of its TripAdvisor rating and weren’t disappointed. We had no problems with our room (29 - in the Coach House) or the plumbing. The room was clean and spacious, the bed very comfortable. The staff were very friendly and helpful. The restaurant was fully booked on our first night, so we had a good ‘pub grub’ meal at the Kingsbridge, just over the road. We had a lovely meal in the Croft on the second evening. Breakfast was delicious and freshly cooked. I’m not a great one for fruit in the morning, but couldn’t resist the bowl of fresh fruit salad! Chester House has an excellent position in the village - everything is just a short walk away.", "title": "Great Place to Stay", "user": "Maggie200", "date": "April 5, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 60425840}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "Bourton on the Water is a good centre from which to explore the Cotswolds. It is a pretty village with a choice of pubs, restaurants, attractions and shops.", "title": "Wonderful Hotel - Excellent Service", "helpfulness": 1, "user": "bridge1", "date": "March 23, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 59305427}, {"rating": 4.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "Visited in March for a weekend break with partner. Wonderful hotel and excellent service by the staff. We stayed in the coach house, which is accessed through its own entrance. Very Good Room and had everything that we needed. The main hotel has a breakfast room, seating area and bar. Main restaurant is outside the main hotel, 1 minutes walk across the road. Food was very good and service excellent.", "title": "Very pleasant stay, friendly staff and delicious breakfast!", "helpfulness": 1, "user": "Traveller1704", "date": "March 14, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 1.0, "rooms": 4.0, "location": 5.0}, "id": 58568664}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled with friends", "text": "I stayed at Chester House for 3 nights during a relaxing girlie weekend. It is ideally situated in the middle of the village, with its own carpark. The village amenities are all in an easy level walk - lots of gift shops, pretty river, restaurants etc. It was lovely wandering around the village after breakfast, and after a busy day just to walk up the road for an evening meal.", "title": "Great for relaxing girlie weekends", "helpfulness": 2, "user": "PotDoodle", "date": "February 25, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 57052207}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled with friends", "text": "The Croft restaurant is owned by the Chester - I returned with my family last weekend for a very pleasant lunch.", "title": "Fantastic find in the centre of a gorgeous village", "helpfulness": 1, "user": "Katy056", "date": "February 21, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 56653664}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "The staff were very friendly. Breakfast was lovely, and we relaxed late into the evening on the cosy sofas in the bar area.", "title": "Honeymoon stay.", "helpfulness": 2, "user": "madelaine4", "date": "February 19, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 56472681}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "Bourton is within easy driving distance of various tourist attractions - we visited Studely Castle and Hidcote Manor gardens during our stay.", "title": "my favourite hotel :)", "helpfulness": 1, "user": "featherfusions", "date": "December 29, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 52132180}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "I would certainly recommend Chester House to family & friends, and hope to return again soon.", "title": "Perfect in every way.", "user": "sugarplumfairy100", "date": "December 15, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 51316470}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled with friends", "text": "The Chester House Hotel was an absolute delight in the most beautiful little village Bourton-on-the-Water. Let me start off by congratulating Donna who took us under her wing( and mind you we were 14 people) and gave us an excellent weekend in the Cotswold.", "title": "COULD NOT HAVE ASKED FOR ANYTHING BETTER", "helpfulness": 2, "user": "tabch2001", "date": "September 8, 2009", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 40090211, "likes": {"liked": "— The People at the Hotel, as well as the location", "disliked": "— Nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2009", "text": "The Hotel has some excellent rooms some larger than the others but none the else had its own distinctive character. The restaurant Croft served us some great food. The staff was so obliging and went out of their way to make us feel welcome.", "title": "super hotel awsome town", "user": "leepop", "date": "August 29, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 39137725}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "I would strongly advice all to go the this hotel and cannot understand how any one can come away disappointed.", "title": "Warm Welcome and Fantastic Stay!", "helpfulness": 1, "user": "MB123England", "date": "July 12, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 34564052}, {"rating": 2.0, "stay_parameters": "Stayed May 2009", "text": "And lastly thank you Mary.....", "title": "Disappointing", "helpfulness": 1, "user": "1947WesternAustralia", "date": "June 27, 2009", "detail_rating": {"cleanliness": 2.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 2.0}, "id": 33295767}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled with friends", "text": "We stayed in the triple room", "title": "Absolute hospitality in a beautiful part of the world", "helpfulness": 1, "user": "elizabethalice73", "date": "March 21, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 26543095}, {"rating": 4.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "Recently spent a weekend at The Chester House Hotel. The hotel is ideally located in the middle of the village with most places within walking distance. The hotel has a resonable sized car park compared with others nearby but it can get busy so try and arrive early. The staff were friendly and helpful and the room clean and well laid out. We stayed in one of the 4 poster bed rooms which cost £120 per night B&B. The breakfast was good, although not huge. The hotel's restaurant is called \"The Croft\" and is located opposite the hotel. We ate there the first night and were so impressed with the food that we returned the second night. There was a good selection on the menu, fair prices, and the food was of excellent quality with a lot of local produce appearing to be used.", "title": "Ideal location and good food", "helpfulness": 2, "user": "DandSBerks", "date": "November 30, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 50344727}, {"rating": 4.0, "stay_parameters": "Stayed November 2009", "text": "I stayed at The Chester House Hotel for 2 nights in a (huge) twin room with my mum. The hotel is lovely and all the staff very friendly and helpful. It's in a great location for exploring Bourton which is busy all year round. No problem at all parking in the car park. Breakfast was tasty and plenty of choice. We also ate in The Croft restaurant where I had the most delicious burger I've ever tasted - oh and the puddings are delicious and huge! The one thing that could be improved with the room we stayed in was the bathroom. It was spotlessly clean, but very dated. A new white bathroom suite would make all the difference! We would definitely stay here again.", "title": "Highly Recommended!", "user": "sarah-louise", "date": "November 21, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 49719347}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "Chester house is a great place to stay on Bourton as its so close to the centre of the village and yet not right at the front of the tourist route. We were able to park in the car park on every occasion. The staff were all so very friendly and helpful too. Our room was great and we had lots of storage space so that all our luggage was tucked away from view. We liked the two sinks in the bathroom too ! We only ate at the restuarant on one occasion and the service and food was good. We are certainly planning to go back again in Feb and next time we will take the dog and stayb in the pet friendly room.", "title": "Great 3 day stay", "helpfulness": 1, "user": "jethro99", "date": "November 8, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 48771175}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled with family", "text": "Having stayed with family including children the hotel was perfect. The location was excellent and we didn't use the cars at all. The staff were extremely friendly with a special mention to Nick in the bar who went out of his way for all of us. Will definitely be returning.", "title": "Superb friendly hotel", "helpfulness": 1, "user": "Tescocat", "date": "September 28, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 45278268}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "The hotel is very central, very clean, and the staff courteous and helpful.Breakfast is taken in the hotel and is freshly prepared and excellent.We had dinner in their Croft Restaurant just opposite , and that was very good.And good value.", "title": "Well run and good value", "user": "DinerHerts", "date": "September 10, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 3.0}, "id": 40649928}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "stars": 3, "variance": {"poor": 12, "average": 24, "very good": 116, "terrible": 4, "excellent": 207}, "aka": "Chester Hotel", "slim_ranking": 0.5, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.0, "location": 5.0}, "description": "Non-smoking throughout. Disabled/wheelchair facilities. Residents lounge/bar. Residents Restaurant. Families welcome, cots and baby monitors available. Large bookings welcome. Beauty therapist available."}