{"user_rating": 4.5, "review_count": 190, "name": "Chewuch Inn and Cabins", "reviews": [{"rating": 4.0, "title": "Great Escape From Stress", "text": "You will be met by either Dan or Sally, two of the warmest people you will ever meet. After selecting which theme room you like, or a cabin for privacy and a roomier more luxurious feel, you know your visit will be enjoyable. They know the valley and all the amenities available to you and often have packages with some merchants for adventures. You cant go wrong staying at the Chewuch Inn.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "May 1, 2003", "id": 986483}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "My husband booked this place through a central reservation agency for Methow Valley.", "title": "Nice Bed & \"BREAKFAST\"!", "user": "Fortwood", "date": "January 4, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "cleanliness": 3.0, "value": 4.0, "rooms": 3.0, "location": 3.0}, "id": 12324539, "likes": {"liked": "— Breakfast", "disliked": "— No snow removal in the back parking lot/entrance"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "We got one of the basement rooms with no windows, but the space compensated for lack of view. Since we spent most of the day light hours outside, it did not bother us too much that we didn't have a view. Our room came with two queen beds and a twin in a small alcove. Also, the wireless internet connection did not work from our room (probably because we were in the basement), but there is a computer in the dining room everyone can use at anytime.", "title": "Wonderful experience", "user": "Dayle F", "date": "July 22, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8216295, "likes": {"liked": "— Comfort, cleanliness, charm, location, and breakfast", "disliked": "— Nothing at all...The room was small, but that was part of it's charm, like a treehouse."}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "The best part about this Inn is the breakfast. We spent three nights there, and every morning they prepared different versions of scones and quick breads, and egg dishes along with other breakfast staples like cereal and fresh fruit.", "title": "No need to continue up the road", "user": "slugger_jt", "date": "July 3, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 8050531, "likes": {"liked": "— The whole experience"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled with family", "text": "While the place may not be as good of a value for the folks who do not care for large breakfast, my husband and I were very happy with our stay at this Inn. We will difinitely stay there again when visiting the area.", "title": "Great escape", "user": "BoogaBear", "date": "May 23, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 7684349, "likes": {"liked": "— Service & staff", "disliked": "— too far away!"}}, {"rating": 5.0, "title": "Excellent Stay!", "text": "A great beginning of a 2-week road trip. Our room, one of the least expensive (no tv, a plus in our opinion), was small, but cozy, comfortable, and charming. A peaceful night in an especially comfortable bed. Our hosts were friendly and the breakfast was fabulous. They take pride in the place and are doing a great job.", "user": "A TripAdvisor user", "date": "August 14, 2005", "id": 3761368}, {"rating": 5.0, "title": "super place to stay!", "text": "I called to make a reservation at the inn and spoke to Sally K. Very pleasant on the phone. She inquired as to the time of arrival and I told her it could be as late as 8pm. When I got there they where still open. I checked in,went to my cabin to find the lights on and my bed turned down! Impressive! I have styed in some high priced places and never had my bed turned down let alone the lights on.I found their desk helper Sabrina very outgoing as she took the time to show me ALL of the theme rooms that are available (so when I take the wife on the next trip I can impress her with the best room). I Would HIGHLY RECOMMEND this inn to anyone!!!!!!!", "helpfulness": 1, "user": "A TripAdvisor user", "date": "December 30, 2004", "id": 2964861}, {"rating": 4.0, "stay_parameters": "Stayed June 2004", "text": "We stayed in one of the cabins, situated slightly away from the main property.", "title": "Worth a few dollars more...", "helpfulness": 1, "user": "RichB4Kids", "date": "August 18, 2004", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 3.0}, "id": 2457585}, {"rating": 5.0, "title": "Great lnn in Great Location", "text": "The cabin was well equipped with a mini kitchenette including microwave and fridge and a small dining table. Rear doors opened up onto a verandah with gas barbecue (which we didnt use).", "helpfulness": 1, "user": "KathyDarrow", "date": "February 10, 2004", "id": 1644179}, {"rating": 5.0, "title": "Great luck at the Chewuch", "text": "Price for the cabin was room only but you could pay a few dollars more to have breakfast included in the main building.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "November 13, 2003", "id": 1484876}, {"rating": 1.0, "title": "Disapointing and overpriced", "text": "Room price was slighlty over the odds compared with other cabins we stayed in on this trip, but to be honest, was slightly better equipped and had a great bathroom so probably justified the additional cost. Watch out for minimum stays requirements over weekends and holidays!", "helpfulness": 11, "user": "A TripAdvisor user", "date": "May 13, 2003", "id": 995162}], "location": {"country": "United States", "city": "Winthrop"}, "variance": {"poor": 0, "average": 6, "very good": 35, "terrible": 1, "excellent": 148}, "slim_ranking": 0.0909090909091, "description": "Chewuch Inn & Cabins lies in the beautiful Methow Valley in the town of Winthrop Washington. We offer lodging with a hearty breakfast and an outdoor spa. Cross Country skiing, mountain biking and other outdoor recreation is nearby."}