{"user_rating": 4.0, "review_count": 57, "name": "Choctaw Lodge", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed December 2013, traveled as a couple", "text": "Stayed here recently to attend a concert at Choctaw and enjoy the casino. First off the signage to find the place in the dark was highly lacking. We found the Inn at Choctaw and had to be redirected.", "title": "Nice rooms, but paper-thin walls", "user": "ljthumper", "date": "December 17, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 1.0, "rooms": 4.0, "location": 4.0}, "id": 187901442}, {"rating": 1.0, "stay_parameters": "Stayed November 2013, traveled with family", "text": "The staff we dealt with were all very nice. The room, though small, was very nice and had all we needed. Would like to see the comfort height toilets installed. They provide a shuttle to the casino, but we didn't use it. Breakfast was good to get us started.", "title": "Holding my money hostage!!!", "helpfulness": 1, "user": "Lindsey V", "date": "December 3, 2013", "detail_rating": {"value": 1.0, "service": 1.0}, "id": 186657321}, {"rating": 4.0, "stay_parameters": "Stayed November 2013, traveled with family", "text": "The downfall is the paper thin walls. Our neighbor had the tv on all night and we couldn't sleep. We could also hear the neighbors on the other side when they were talking. The A/C didn't have a fan only setting to keep it running al night. If it did, it would've drowned out the neighbor. We maybe got 2-3 hours of sleep. We were just exhausted for the trip home. We did well playing at the casino so that was the saving grace. Next time, we'll plan on staying somewhere else.", "title": "A night away", "helpfulness": 1, "user": "Laura C", "date": "November 14, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 184686067}, {"rating": 4.0, "stay_parameters": "Stayed October 2013", "text": "My mother and I had a girls night at the casino on November 29th. It was a busy weekend because of the Thanksgiving Holiday and the place was packed. We had managed to book a room at the Choctaw Lodge and were looking forward to staying there for the first time (we are already frequent guest of the Tower & Inn).", "title": "Excellent service & Great breakfast!", "helpfulness": 3, "user": "Kelley31", "date": "October 19, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 3.0, "service": 5.0, "rooms": 5.0}, "id": 181605653}, {"rating": 3.0, "stay_parameters": "Stayed October 2013, traveled on business", "text": "When we checked in, the front desk lady whose name I did not catch was very nice/friendly but distracted. I told her I had a free room coupon and she took it and checked us in. She asked for a debit or credit card for the $50.00 incidental fee that would be \"authorized\" on my card but would be returned to the card once we checked out. Since we have stayed at the tower many times before I knew the drill. I handed over my card and signed the paperwork.", "title": "Affordable, pet friendly, clean", "helpfulness": 2, "user": "jeeyol", "date": "October 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 181566186}], "location": {"country": "United States", "city": "Durant"}, "variance": {"poor": 3, "average": 9, "very good": 9, "terrible": 2, "excellent": 34}, "aka": "Microtel Durant", "slim_ranking": 0.222222222222, "description": "The Choctaw Lodge is located less than 400 feet from the Choctaw Casino, Durant. Near Southeastern Oklahoma State University, Lake Texoma, Eisenhower State Park, Red River Railroad Museum and the Johnson Creek Recreation Area. The Choctaw Lodge offers guests free buffet breakfast served from 6:30 am to 10 am, free shuttle to Choctaw Casino, free high-speed wireless Internet access, guest laundry, free parking with room for large vehicles and small pets are accepted with additional charges. Guest rooms offer cable TV with extra stations, free high speed wireless internet access, coffee maker, microwave, mini-fridge, hair dryer, free local calls, air conditioning, alarm clock/radio, iron/board, sofa bed and electronic door locks. Requests are not guaranteed, and will be granted based on availability at check-in."}