{"user_rating": 3.5, "review_count": 1142, "name": "Chula Vista Resort", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed October 2006", "text": "Reading through the reviews, it seems each reviewer has his/her own personal scorecard for hotels.", "title": "Very good", "helpfulness": 1, "user": "Bualabus", "date": "December 18, 2006", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 6470742, "likes": {"liked": "— Accomodation and waterpark", "disliked": "— crummy fitness facility"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled with family", "text": "Here is mine:", "title": "Beautiful", "helpfulness": 2, "user": "angeleyes62903", "date": "December 4, 2006", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 6330196, "likes": {"liked": "— Waterparks for both young and old", "disliked": "— nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2006, traveled with family", "text": "Room: Excellent - it really blew me away: reasonably priced and brand spanking new. Everything worked smoothly, and we had a nice view of the river. Very few TV channels, but who wants TV when you have a honking big waterpark a few minutes away.", "title": "Fine Resort, but avoid North Tower", "helpfulness": 4, "user": "chicagosean", "date": "November 27, 2006", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 2.0}, "id": 6182227, "likes": {"liked": "— Large, well-maintained property", "disliked": "— North tower occupants forced to walk through cigarette smoke / Howler's Sports Bar"}}, {"rating": 3.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "Location: Bucolic and idyllic- on the river, maybe 5 minutes by car from the town, so not really within immediate walking distance of any of the other attractions.", "title": "Probably won't be back.....", "helpfulness": 4, "user": "Kelly326", "date": "November 19, 2006", "detail_rating": {"front_desk": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 2.0, "rooms": 4.0, "location": 4.0}, "id": 6153695, "likes": {"liked": "— The themed room was beautiful.", "disliked": "— long walking distance to waterpark"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled with family", "text": "Waterpark: Also excellent. Lots of exciting slides. I went up so often that I was limping by the end of my stay. Also, there was a little poolside bar for the parents. The snack bar served the usual stodge one comes to expect where there are lots of kids and their parents.", "title": "Great...for the price", "helpfulness": 2, "user": "cdietz19", "date": "November 5, 2006", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 2.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 3.0}, "id": 6061226, "likes": {"liked": "— The waterpark", "disliked": "— The bee nest in the room"}}, {"rating": 4.0, "title": "Loved Chula Vista", "text": "We had 3 families that came to Chula Vista. We all loved the facility. We stayed in the Golf Villa's. We were amazed when we opened the door to your rooms. The rooms were tastefully decorated. It was nice to have a full size stove and refrigerator. The dishwasher was great! The rooms were very clean. We could not hear any noise coming from the rooms around us--extremely soundproof. The beds were so comfortable. We slept like babies!! We found a great deal on the internet called Cabin Fever so we saved a ton of money. Housekeeping was great about restocking the room while we were at the water park. The water park was a lot of fun. I do wish that we would have been allowed to take in a cooler for juice or soda's. The bar in the water park was kind of pricey but they do make a good Bloody Mary.", "user": "2012RoadGlide", "date": "February 26, 2008", "id": 13874829}, {"rating": 5.0, "title": "Great Place", "text": "The first night (Friday )that we were at Chula Vista, there were shuttles whenever we needed one. On Saturday and Sunday, we had a hard time getting a shuttle. The sidewalks and parking lots were not plowed very well so walking with the kids was very difficult. We also had to park pretty far away from our Villa. The pots and pans in the rooms were not no stick so we had to scrub the heck out of them to try to get them clean. We did not have a frying pan in our room.", "user": "hinkgen", "date": "February 18, 2008", "id": 13654704}, {"rating": 4.0, "title": "We Will Be Back! But Here Are A Few Tips For You...", "text": "All in all, our whole group was very impressed with the hotel and would definitely go back.", "user": "ChicagoPenny", "date": "February 17, 2008", "id": 13634741}, {"rating": 4.0, "title": "The Good And The Bad", "text": "We booked a Fri. night in Feb. after seeing an advertised special on the Chula Vista website ($139). The first employee I spoke w/ would not honor the advertised special, claiming it was just a weeknight deal. When I told him it was billed as a Fri. night bargain on their website, he wouldn't believe me. Obviously, when I called back the next day, I got an employee who had been better informed. The Chula Vista was a gorgeous place. We had a 2 bdrm. condo w/ 1,500 sq. feet. The ceilings throughout were about 20 feet high, and gave the place a very spacious feel. Everything was tastefully decorated and put together beautifully. We especially had fun w/ the hot tub in the \"four season room\" which overlooked a beatiful wooded ravine. The waterpark was lots of fun, with a variety of activities for all ages. The walkway between the condo and the waterpark was a long hallway which was plenty warm, allowing you to wear your swimsuit from the condo to the park and back.", "user": "WisconsinJen", "date": "February 11, 2008", "id": 13475882}, {"rating": 4.0, "title": "Truly all-inclusive!!", "text": "The only downfalls (besides the poorly informed employee) were a rather cheesy looking set of rocks at the check-in/registration area...even my 11 yr. old daughter noticed how bad they were. Also, the condo wasn't equipped with any real \"barware\"...I would have liked a real glass for my drink.", "user": "PhinPhan12169", "date": "February 5, 2008", "id": 13303792}, {"rating": 5.0, "title": "All-inclusive IS ACTUALLY all-inclusive!", "text": "My boyfriend and I stayed at Chula Vista Resort for spring break. We got the All-inclusive package. We were extremely impressed with the all-inclusive package. We were sure that there would be \"fine print\" and that a lot of things wouldn't be included, but we found out that literally EVERYTHING was included. Every meal, no matter what we ordered, was included, and all of the drinks (alcoholic and non-alcoholic) were included- even the pricey specialty ones!", "user": "organicchemist", "date": "April 9, 2008", "id": 14916584}, {"rating": 5.0, "title": "Incredble Vacation Destination", "text": "Our room was fantastic! We had a presidential suite with a fireplace and two balconies. The view was gorgeous, and the room was so spacious with a very modern bathroom.", "user": "LeenieWhiteBearLake", "date": "April 3, 2008", "id": 14772034}, {"rating": 3.0, "title": "waterpark very LOUD", "text": "The fitness facility was okay. We liked the fact that it had free weights and weight-machines (so many hotels just have cardio equipment), but the space was very small.", "user": "Dude_Jerry", "date": "March 31, 2008", "id": 14696854}, {"rating": 4.0, "title": "Had a great time, will go back.", "text": "We had so much fun at the resort that we only left it once during our stay! We are going back to celebrate both of our birthdays, and with the new, huge indoor waterpark addition, I'm sure we will have even more fun!", "user": "twobusykids", "date": "March 31, 2008", "id": 14684069}, {"rating": 3.0, "title": "Fun for a short stay", "text": "My daughter and I love to come to this resort when we need a break. They have everything we could want in a resort. Excellant food, full service Bar, outdoor Hot Tub, incredible water park. The check in service is fast and they are very helpful. Our rooms were awesome junior suites with Fire Places nice TV, Queen Beds. We haven't tried the Spa Del Sol there yet but maybe this next time, we're going again the end of the month. We've come back here several times and have never been disappointed. I would highly reccomend this Resort especially for familes. We like it because it's just a little off the beaten path the views from the rooms are spectacular expecially the ones facing the river.", "user": "RCNC4", "date": "March 27, 2008", "id": 14572707}, {"rating": 3.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "The hotel was clean and the service was great (we asked to be switched from a parking lot view to a river view....no problem). We loved the water parks, but spent most of our time in the hot tub. The smaller indoor water park was our favorite, since we didn't have kids with us, and it was less crowded.", "title": "Glad we didn't do all inclusive", "helpfulness": 5, "user": "madisonkathy", "date": "September 13, 2006", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 4.0}, "id": 5798372, "likes": {"liked": "— The service", "disliked": "— The food"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "The only negative was the food. The prices at the upper end restaurant (Kaminsky Bros.) are out of line for the area and what you get. The 'all you can eat' buffet was poorly handled. I didn't see one food service employee check or refill the steam table during our dinner. The beef was dried out, the crab legs were tasteless and over steamed. The only positive at the entire buffet was the peel and eat shrimp.", "title": "We still Love the Chula Vista", "helpfulness": 5, "user": "BOZO1989", "date": "August 22, 2006", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 5694090, "likes": {"liked": "— The Indoor water park", "disliked": "— Nothing"}}, {"rating": 1.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "I also didn't care to spend $3.50 every time I wanted a cup of coffee (Starbuck's), so we bought a pound of coffee, milk and sugar, and made our own.", "title": "BUFFET AND CUSTOMER SERVICE FOR HORRIBLE", "helpfulness": 5, "user": "littleuglyhouse", "date": "August 16, 2006", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "location": 1.0, "rooms": 3.0}, "id": 5618019, "likes": {"liked": "— price and the concern for the customer", "disliked": "— don't go to this hotel"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "It was fun, we had a good time, but I'd suggest going into town to eat.", "title": "Fun weekend", "helpfulness": 2, "user": "markmoose1", "date": "August 15, 2006", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 5615121}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "We have been staying at The Chula Vista for years, the reason we started going there, was for the Beautiful view of the River, very secluded place, you are out in the Country. They have greatly improved on the Waterpark Outdoor and Indoor, they just opened a Multi Million Dollar Indoor Water Park, we ranged in age of 12 to 84 years old, even Grandma had fun on the Lazy River Water ride, which is you take a inner tube, hold on, and lazily float along :) The 12 year old loved the slides, and everything in the Water Park. We stayed in a Studio Condo, with a Riverview and Balcony, when we first checked in they did give me a room right next to ongoing construction (they are still building some of the Condos, I asked to be moved, and we were moved to the other side of the building, why we were not given that room in the first place, I dont know. We ate at the Buffett for Breakfast 3 adults 1 child, we thought it was reasonable enough at 7.95 per adult, most places charge 9.95 for Breakfast Buffett. Overall we will definetly go back to Chula Vista PS: I dont think they let anyone who is not a guest into the pool area, I hope it stays that way !!!!", "title": "Enjoyed the Chula Vista Resort, New Indoor Waterpark", "helpfulness": 5, "user": "IowaVacationer", "date": "August 15, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 5614426, "likes": {"liked": "— Indoor Waterpark", "disliked": "— Starbucks Coffee"}}, {"rating": 5.0, "title": "Great Deal, Great Place!!", "text": "We purchased their All-Inclusive Special for $99 a night for 2 nights, 2 people. My 2 year old son was free!", "user": "Timsueshd", "date": "May 5, 2008", "id": 15663634}, {"rating": 4.0, "title": "Great Place", "text": "The nights we went were a Wednesday 4/30 - Thursday 5/1. It was not busy at all, we did not have to make reservations for dinner and the waterpark did not seem busy at all. I thought what a great time to go.", "user": "havingfun42", "date": "April 20, 2008", "id": 15173180}, {"rating": 3.0, "title": "Not so great this time", "text": "What a great time we had, I booked a two-queen Jr Suite with a view and we received a nice room on the 5th floor that had a balcony facing the Wisconsin River, with tall pine trees. Our room was clean and did not have any odor of any kind.", "user": "kimmie375", "date": "April 14, 2008", "id": 15017011}, {"rating": 5.0, "title": "Wonderful family getaway", "text": "The food and drinks were all included in the all-inclusive, we had the buffet for breakfast and dinner, both were very good, nice selection and hot. Our lunch we had in the bar, they had tables, so I didn't have to set my 2 year old up at the bar to eat lunch. The bar food was very good as well, beef sandwich, chix tenders and cesear salad. We had ice cream and snacks from the snack bar in the waterpark area, plus frozen drinks that included strawberry daquiris and pina coladas, all very good.", "user": "northwoods6pack", "date": "April 12, 2008", "id": 14992829}, {"rating": 5.0, "title": "Wonderful!", "text": "The waterpark was perfect size for my 2 year old son.... He was too small for the larger slides, but that is okay... We were able to do the lazy river and he utilized the kiddie pool and slides for a good 2 1/2 hours on one night, I don't think he ever got out of the water. The kiddie area starts at zero depth and goes up to 2 ft. It has buckets that dump, and water guns. My mom and I were able to sit on the side of the kiddie area and just watch him play. I have read about the water park being loud... I didn't really notice.", "user": "celtic1950", "date": "April 12, 2008", "id": 14992135}, {"rating": 2.0, "stay_parameters": "Stayed October 2006, traveled with family", "text": "I just checked out of the Chula Vista today, and for once I was pretty excited to get home. True, they do have a large indoor waterpark, however, you must walk nearly a mile to get to it, and I had one of the closest rooms you could get! The first room I had was in the \"north tower\". When booking, make sure that you are not in this area. The North Tower is by the old waterpark that wasn't even open. It has a eerie old feel to it. So I changed my room for one in the \"South tower\". The view from the room was very nice. The room itself was clean but it did need updating. The wallpaper was peeling, and the beds were very uncomfortable. The pillows were terrible. The bathroom was clean, but the toilet was very old and there was a broken soap dispenser in the shower. Avoid eating at any place in the hotel. The prices are sky-high. The hotel isn't too far from downtown dells, but it isn't close either.The arcade also was terrible What a rip-off. I put 1.00 into the machine to get tokens, and it only gave me 3. My kids hit the jackpot on a machine twice, and it falied to give the correct amount of tickets. You also need a ton of tickets to even get the bad prizes. They also advertised a \"bonfire\". We walked very far to the bonfire area, just to find an empty pit and 3 other families who were also disappointed. Things are not clearly marked here, and it is alos easy to get lost. The staff was very friendly here, especially Ed, who saw me struggling with my luggage, and dropped everything to carry it to my car & put it in my trunk for me. Overall I don't think I would stay here again, it's just not set up very well.", "title": "Not that great", "helpfulness": 4, "user": "nosilla", "date": "October 14, 2006", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 3.0, "rooms": 2.0}, "id": 5955811, "likes": {"liked": "— The staff & the view from my room", "disliked": "— How far the Waterpark is from all the rooms & The arcade"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "We stayed at Chula Vista one night on a driving tour of the US. My family of four (two girls 10 and 8) thought it was very good. We have been to several outdoor water parks and have stayed in Great Wolf Lodge in Traverse City MI and in Sandusky Ohio and thought this was as good as GW but much cheaper with an internet special. The large outdoor water park area kept us busy our first day and the large indoor water park kept us busy until late that night and until late the next afternoon when we hit the road. There are a few rides in the indoor water park we had never seen before: a large two person funnel ride that felt like you were going down a drain and a water roller coaster that ran near the ceiling, above most of the slides. Both were so fun that I found myself laughing out loud on them.", "title": "Nice water park!", "helpfulness": 3, "user": "Whistler'smom", "date": "October 10, 2006", "detail_rating": {"cleanliness": 4.0, "front_desk": 4.0, "location": 4.0, "value": 5.0, "rooms": 4.0}, "id": 5935686, "likes": {"liked": "— The water park", "disliked": "— The dead animal heads on the wall that upset my children"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled with family", "text": "This is a big resort, although it really was not crowded when we were there in mid-August. Besides the large indoor and large outdoor areas, there is another indoor area that looks like it was once a small hotel pool area with smaller slides and a cute baby pool. This area would be perfect for toddlers and younger kids (we had it to ourselves for the hour we were there) . There is also an outdoor area designed just for for younger kids too. I would not hesitate to come here with toddlers, they would have these two areas nearly to themselves since the bigger kids go for the bigger parks. There is also a (too small) wave pool near the back of the resort, over looking the river. The view from here and from the rooms that face the river is beautiful.", "title": "Will Return", "user": "InnyJ", "date": "October 9, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 5933231, "likes": {"liked": "— Big, spacey room", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "Overall, the rooms were decent and the water parks were very nice. We did not eat dinner there as there were so many better choices in the Dells and we wanted to see the Tommy Bartlett show anyway (well worth doing). However, there were three problems. First, the resort had been full the weekend before our Monday arrival and they were slow cleaning up rooms for all the arriving guests. To be fair, we did arrive long before check in time and we had no trouble getting water park passes to use before the room was ready, but it was late in the day before people got rooms and there were always long lines of people checking on the status of their rooms. However, Carrie at the front desk was very nice when I kept showing up and asking about getting our room. She finally got us one after lunch. She was great!!!!!! Thanks!!!", "title": "Superb!!", "helpfulness": 1, "user": "wisconsinwiz", "date": "October 3, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 5905755, "likes": {"liked": "— Extremely well kept and squeeky clean...", "disliked": "— Nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "The second problem is that the mini-golf was dull. We love playing mini-golf but this course was so dull (not sure why) that my kids quit before the game was over which has never happened before. This activity needs some help!!", "title": "Great Water Park", "user": "Duke3", "date": "September 27, 2006", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 5881832, "likes": {"liked": "— Our room was brand new,very nice and the water park was great.", "disliked": "— The staff was forgein, hard to understand."}}, {"rating": 4.0, "title": "New Condos are Amazing", "text": "We just stayed in one of the new three-bedroom condos at Chula Vista and loved the property. While the hotel check-in was backed up, condo check in was quick and the staff was very helpful.", "helpfulness": 5, "user": "sdski", "date": "August 15, 2006", "id": 5611905}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled with family", "text": "The condos are huge (and expensive, of course), but our family of 11 fit in just fine. It's away from the action of the Dells, but we didn't have much time to go elsewhere anyway and was quiet compared to the traffic and tourist traps in town.", "title": "Terrific stay, will definitely go back", "helpfulness": 4, "user": "kcccmom", "date": "August 14, 2006", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 5610004}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "The outdoor and new indoor waterparks were great and the family loved the whole experience.", "title": "Condos are Awesome!, Waterpark is Awesome", "helpfulness": 2, "user": "ssumms", "date": "August 14, 2006", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 5609243, "likes": {"liked": "— Nice condos", "disliked": "— Some staff had limited English skills"}}, {"rating": 4.0, "title": "Indoor waterpark is wonderful", "text": "The condos have a late check-in (4 p.m.) and an early checkout (10:30 a.m.) which does cut down on your time there...our two days went very fast.", "helpfulness": 4, "user": "MommyTess", "date": "August 12, 2006", "id": 5604477}, {"rating": 2.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "The construction work continues, but the last condo building is mostly done and, other than some closed pathways and a lack of parking near the condos, everything was great.", "title": "Not For Small Children!!", "helpfulness": 3, "user": "Luv2Go2Duluth", "date": "August 9, 2006", "detail_rating": {"front_desk": 4.0, "service": 2.0, "cleanliness": 4.0, "value": 3.0, "rooms": 2.0, "location": 3.0}, "id": 5593167}, {"rating": 3.0, "title": "Extras cost $$, cold waterpark, dirty", "text": "Our experience at the indoor water park did not meet our expectations. The noise level in there was deafening. I couldn't hear my 3 year old talk even if he talked right into my earl. And it was COLD. Air was cold, water was cold. We ended up leaving after an hour because the kids where shivering.", "user": "MN_Mom22", "date": "March 24, 2008", "id": 14484515}, {"rating": 2.0, "title": "Maybe More?", "text": "Our golf villa loft was a nice size room (but a dishwasher would of been nice). Housekeeping was below standard. All the light fixtures had cobwebs on them. The bathroom fan had so much dust built up on it I was surprised it moved any air. The edges of the carpet had 1/2\" of dust built up.", "user": "TheJendos", "date": "March 19, 2008", "id": 14400861}, {"rating": 1.0, "title": "Horribly disorganized", "text": "I requested a bed rail for our toddler and we never received it. I had called the morning before we arrived and was told they had a rail for us. I asked shortly after check-in and was told they would send it up. We never got it.", "user": "ryannee718", "date": "March 13, 2008", "id": 14268478}, {"rating": 3.0, "title": "Needs Help", "text": "And everything extra was expensive. Eat at the buffet? $23 /adult for dinner! Locker at the water park? $5; Bottle of water in your room? $4.", "user": "coonvalley", "date": "March 3, 2008", "id": 14016110}, {"rating": 4.0, "title": "Going During a Tournament", "text": "We'll try a different resort next time.", "user": "WindyCityWomen", "date": "February 27, 2008", "id": 13882894}], "location": {"country": "United States", "city": "Wisconsin Dells"}, "stars": 3.5, "variance": {"poor": 174, "average": 216, "very good": 364, "terrible": 145, "excellent": 243}, "aka": "Chula Vista Hotel", "slim_ranking": 0.533333333333, "detail_rating": {"service": 3.5, "cleanliness": 3.5, "value": 3.5, "sleep": 3.5, "rooms": 3.5, "location": 3.5}, "description": "Chula Vista Resort and Waterpark is a complete resort experience in Wisconsin Dells with over 200,000 square feet of indoor and outdoor waterparks. Luxury comes standard in all of our guest rooms, suites and condominiums. Bring your clubs and challenge yourself on our 18-hole golf course. At Chula Vista, we invite you to laugh harder, splash bigger, stay longer and vacation better at Wisconsin Dells' most complete family resort!"}