{"user_rating": 4.5, "review_count": 141, "name": "Cill Bhreac House B & B", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "Angela and John were very accommodating and helpful in making plans for our activities. We were all pleased with their recommendations. The house is in a quiet setting with beautiful views of the bay. Breakfast was very good with very attentive service. The walk to and from town is very manageable as long as someone can do the return uphill walk. Otherwise, staying closer to the town center would be better. A really good base for Dingle.", "title": "Knowledgeable and helpful hosts.", "user": "travelfan115", "date": "June 18, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 132226131}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "Cill Bhrea House is a lovely B&B and a great base for exploring the Dingle Peninsula. The house is located right on the lovelly Slea Head Drive and is very convenient to town - a nice 15-20 minute walk into Dingle Our room was lovely and the views of Dingle Bay were awesome. Angela and John were perfect host and hostess and our breakfast were delicious. I must say a kind word about one of their employees - Maria - who tended our room. She is a lovelly lady - very sweet and attentive.", "title": "Cill Bhreac House is a lovely B&B for Dingle Town!", "user": "DestinDonna", "date": "June 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 132143928}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "I was having a little look through these reviews as my partner and I stayed here last October half term and I have just joined TripAdviser. After reading one particular review, I felt I needed to write this as I notice someone has complained about the reaction they got on cancelling a booking. This could not be further from our experience as, after being stuck on a ferry in terrible seas for 26 hours (Swansea to Cork - boat forced to hide in a bay after hitting awful storms), we were unable to make it for our first nights stay at Cill Bhreac House. Despite the fact that it was very, very late notice, Angela was kind and concerned and would not hear of us paying for the night as part of our three night stay. It was a reaction we sorely needed and appreciated after our horrific experience on the boat and we were very grateful.", "title": "Kindness goes a long way ...", "user": "BentleyHope", "date": "June 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 132117084}, {"rating": 2.0, "stay_parameters": "Stayed May 2012", "text": "The hospitality was great and the view spectacular. The breakfast was also very good with attentive service. The house and room were clean but the bathroom was quite dated circa 1970s. The shower needed to be caulked and the toilet seat looked dirty on the hinges or perhaps just looked as if it was due to it being older. Our biggest complaint was there wasn't any hot water to shower! This was very disappointing.", "title": "No hot water...", "helpfulness": 4, "user": "Gc1123", "date": "May 29, 2012", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 130833193}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with friends", "text": "Saying that we were very pleased with Cill Bhreac B&B would be a huge understatement :) As we are quite used to the state of various B&Bs across Ireland, we didn't expect much when arriving, but we were pleasantly surprised. The hosts were very forthcoming to all our needs, took care of our transportation from/to bus station. The rooms are very clean, well equipped. Our room had a great view over the Dingle bay! Breakfast is excellent, and they cater for special dietary needs.", "title": "Excellent little B&B on outskirts of Dingle", "helpfulness": 1, "user": "Andrej B", "date": "April 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127971654}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "What a great place. The locale was very central for visiting the Dingle Peninsula and Dingle town. Our room was a bit small, but was comfortable and restful. The reading room was a great place to sit, read, rest, and socialize. Breakfast was outstanding, especially the smoked salmon. Angela was a wonderful hostess. My wife and I were planning a return to Dingle as we were leaving after two wonderful days at Cill Bhreac House.", "title": "I want to go back now!", "helpfulness": 1, "user": "wwhughesjr", "date": "November 16, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 120686669}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "From the moment I got back from my Ireland trip last April, I have been meaning to fill out my reviews on TripAdvisor, and mostly because I've wanted to share with the world how much I loved my stay at Cill Bhraec House.", "title": "Adorable Spot in Dingle with Spectacular Views", "helpfulness": 2, "user": "Carybear21", "date": "November 1, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 120023282}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "I had initially found this adorable B&B online, and for some reason had my heart set on staying here. (Maybe it was the porridge with Bailey's listed on their menu that had me sold.) Either way, I'm so glad we chose to stay here! Angela is the sweetest lady you'll ever meet, and she made us feel right at home.", "title": "Beautiful Spot outside of Dingle", "helpfulness": 1, "user": "Deborah W", "date": "September 25, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 3.0, "location": 3.0}, "id": 118575726}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled with friends", "text": "And the view from our room was spectacular.", "title": "Great Little Spot in Dingle", "helpfulness": 1, "user": "Deirdre118", "date": "September 23, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 118483017}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "While some might complain that this B&B is slightly outside of town, I thought the location was perfect. It was away from the hustle and bustle of Dingle town - but close enough that we were able to walk there one night. (And a 2-minute drive the night we didn't feel like walking).", "title": "What I'd give to be back at Cill Bhreac House", "helpfulness": 1, "user": "NancyA71", "date": "September 2, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117598749}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "It is always a pleasure staying at Cill Bhreac House with Angela and john McCarthy. I've stayed in their charming B&B many, many times and it is always a warm homecoming. They are not only gracious hosts but their B&B is warm, welcoming and wonderful. The breakfasts are fantastic and Cill Bhreac House is a perfect location for visiting all around the Dingle. The rooms are spacious and airy and have a lovely view, not to mention spotless. There is no other B&B on the Dingle that I would consider visiting and I look forward to visiting with them again soon.", "title": "Always a Pleasure!", "user": "TheFeyFox", "date": "June 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 133123361}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "Our whole family (10 of us) stayed 3 nights at Cill Bhreac House, and we all wish we could have stayed longer. Angela was delightful. Our rooms were clean and comfortable, and the sitting room with its deck was the perfect place for us to gather between excursions. Our room windows looked out over the mountains of the Dingle Peninsula, and the front looked over the bay and town of Dingle. We went fishing and horseback riding, visited ancient sites, and had a great time at local pubs. If we are fortunate enough to return to Ireland, we will happily return to Cill Bhreac House.", "title": "Home in Dingle", "helpfulness": 1, "user": "lilybramble", "date": "June 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 133076466}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with friends", "text": "We stayed here in May and it was a lovely overnight. We were warmly greeted by the owners and the House is lovely and clean. We went upstairs to the deck which has a beautiful view and had a glass of wine and watched the sun set. The food was great. We had crepes with bananas. Many different choices of breakfast foods. We thoroughly enjoyed our stay here and would recommend it.", "title": "Wonderful B and B", "user": "Irene P", "date": "June 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 132761752}, {"rating": 4.0, "title": "A great choice of B&B for Dingle", "text": "We recently completed a 3 week vacation during which we drove around the entire island of Ireland. Over 20 nights we stayed in 18 different Bed & Breakfasts, paying between €50 to €80, and £60 to £65 in Northern Island. This review is based upon the relative merits of Cill Bhreac House with respect to other B&Bs that we visited.", "user": "Enyedy00", "date": "June 24, 2012", "id": 132666635}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "We picked Cill Bhreac House because it sounded like a nice place (good reviews) for a very reasonable price. We paid €65 for the one night of our stay, including breakfast. Payment was requested in cash; apparently the phone companies in Ireland charge an exorbitant fee to maintain a phone-line for processing credit card transactions. We stayed in the “Lord Ventry Estate” Room, which was pretty nice.", "title": "A jewel in Dingle", "user": "barbaradanin", "date": "June 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 132252663}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "Great B& B. Angela was very welcoming. Lovely clean, quiet rooms. A lovely sitting room with gorgeous view where you can sit and have a few drinks. Beautiful breakfast. Would thoroughly recommend this lovely B & B.", "title": "Great B & B", "helpfulness": 3, "user": "Kathy C", "date": "September 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 139082355}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with friends", "text": "I've been at the Cill Bhreac in august with friends. It's a lovely B&B, with spacious rooms and clean bathroom. Angela and John (the hosts) are very friendly and kind and they'd do everything to help you enjoying the Dingle peninsula. Breakfast is included and you can choose between irish breakfast, salmon, eggs, pancakes, cereals, fruit and many other things! I will definitely return there in the future! Thanks Angela & John!", "title": "Lovely!", "helpfulness": 1, "user": "FrancescaM84", "date": "August 28, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 138641329}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "Cill Bhreac House B&B is a great place to stay in Dingle. Angela and John were super helpful with local places of interest and dinner ideas, where to go for a run, with train schedules/reservations, etc. Their B&B is very clean and quiet and in a perfect location. Delicious breakfast options as well. We would certainly stay there again!", "title": "Wonderful B&B!", "helpfulness": 2, "user": "Kim S", "date": "August 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 138568738}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with friends", "text": "We stayed here for two nights at the end of a 2-week trip through Ireland. It was a nice quiet location. Just a couple minutes drive from Dingle or a 15-20 minute easy walk. There was a glassed-in lounge on the first floor that would be great on rainy days, and an upstairs lounge that was very comfortable. Rooms clean and quiet. The breakfast great both days, and a lot of choices available. Angela had wonderful suggestions for dinner and was welcoming and friendly. I would definitely stay again.", "title": "Quiet, clean rooms, nice sunroom", "helpfulness": 3, "user": "emmy r", "date": "July 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 134226818}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "Angela and John make you feel at home a soon as you step over threshold.", "title": "Peace and Tranquility Superb views", "helpfulness": 2, "user": "John K", "date": "July 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 133934448}], "location": {"country": "Ireland", "continent": "Europe"}, "variance": {"poor": 6, "average": 5, "very good": 27, "terrible": 2, "excellent": 101}, "aka": "Cill Bhreac House Bed And Breakfast", "slim_ranking": 0.222222222222, "description": "Located in one of Dingle's most desirable areas due to the expansive views that it boasts over Dingle Bay and of the mountains that encase Dingle Town, Cill Bhreac House is a charming and friendly, family-run bed and breakfast that is a popular destination amongst visitors to Dingle. Located on the Slea Head Drive and at the start of the Dingle Way walking trail, Cill Bhreac House offers guests a scenic and tranquil place to stay that is a mere 1km (10-15 minute scenic waterfront walk) from the hustle and bustle of Dingle town centre."}