{"user_rating": 3.0, "review_count": 126, "name": "Citadines Bordeaux Meriadeck", "reviews": [{"rating": 1.0, "title": "Terrible!! We felt unsafe.", "text": "This hotel was IMPOSSIBLE to find, on the way there we walked through an abandoned business park where we were approached and harrassed two different times within 10 minutes. DO NOT stay here if you are traveling alone particularly if you are a woman (or even two women, for that matter, which we are). We barely ventured out of the hotel and did not dare to come back after dark. The hotel itself has free internet, which is good, and a mall closeby with a grocery store for shopping. Terrible location.", "user": "boonyc", "date": "August 5, 2006", "id": 5557773}, {"rating": 1.0, "stay_parameters": "Stayed September 2004, traveled on business", "text": "I stayed at this place a few times because a friend in Bordeaux often books people into it - mainly because of the price. It is a very depressing experience, mainly because it is dark and dingy, and it has a strange smell of (presumably) people cooking in small rooms without extractor fans. It was an unpleasant reminder of student dorms at University. It is also in a charmless part of Bordeaux, close to a large and not very interesting modern shopping centre. Bordeaux surrounds are beautiful, however, there are not many good hotels there - maybe the Majestic - the Burdigala looks sterile and is expensive. My advice would be to try one of the older more charming hotels and avoid the Citadines at all cost!", "title": "Smells like a student dorm", "helpfulness": 5, "user": "iad11", "date": "April 18, 2005", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "service": 3.0}, "id": 3375033}, {"rating": 1.0, "title": "Avoid at all costs!", "text": "This was a terrible experience. Not only was it near impossible to find, you could only get into the hotel itself during certain hours of the day. It was freezing cold, dirty, the wall was stained by the heater that used to work. They reception desk would not even bring us more blankets. The parking garage was one of the most stressful driving experiences ever. You could see on the wall the numerous cars that had scraped exiting. Not worth the money and certainly not a 3 star hotel.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "December 12, 2004", "id": 2876900}, {"rating": 1.0, "title": "Disgusting", "text": "Do NOT stay in this hotel! The service is horrible, the sheets were hairy, stained, and full of holes, the heat was an issue, and the parking was a nightmare (and of course, you pay 7 euros a day to put yourself through the hell of getting your car down the narrow exit without scratching it). I do not know how this hotel possibly earned three stars - it is no more than a 1 star hotel. It was a waste of our money and we were not able to cancel because of the tricky online policy. Bad experience!", "helpfulness": 3, "user": "A TripAdvisor user", "date": "December 9, 2004", "id": 2873527}, {"rating": 1.0, "stay_parameters": "Stayed January 2005", "text": "i simply can not think of one good thing to say about this hotel except to say it has an exit which we used after one night.i even took the time to report the foul conditions to bordeaux tourist office.", "title": "citidines never again", "helpfulness": 4, "user": "dublinjim", "date": "August 22, 2004", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "service": 1.0}, "id": 2481933}, {"rating": 1.0, "title": "Don't go there !", "text": "This hotel is in no way a 3 stars hotel. It barely makes a 1 star. We had to sleep on an uncomfortable sofa bed. They don't even have a real bed. The mattress and the pillows were smelly. The next morning my pillow had two oily stains on the side in contact with the bed. We were so disgusted that we decided not to visit Bordeaux and went to the next town on our itinerary.", "helpfulness": 10, "user": "A TripAdvisor user", "date": "September 24, 2003", "id": 1355032}], "location": {"country": "France", "region": "Aquitaine", "continent": "Europe"}, "stars": 3, "variance": {"poor": 21, "average": 34, "very good": 40, "terrible": 20, "excellent": 11}, "aka": "Citadines Bordeaux Meriadeck Hotel Bordeaux", "slim_ranking": 0.6}