{"user_rating": 4.5, "review_count": 1185, "name": "citizenM London Bankside", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled on business", "text": "We stay in London very regularly for both business and pleasure and this trip combined both. We wanted to be around the London Bridge area for my commute. This hotel lives up to its billing. Very cool reception / bar / canteen area (and bookshop). Slick self service check in with staff nearby to help. Rooms are like most London hotels, small, but very very well designed. Huge bed for a small room (I'm over 6'3\" and I could sleep in any direction on it). Everything in room is controlled by samsung tablet which offers web browsing on the free wifi. Bathroom is small but well designed wet room with large showerhead. 5 minutes walk from Borough Market, London Bridge train station, london bikes very near, handy for tate modern, oxo tower, waterloo station. Highly recommended and we will be back.", "title": "Brand new hotel in great location with excellent facitilities. And cool.", "user": "DublinEoin", "date": "January 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 149165045}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled on business", "text": "I was searching for a while around London for a hotel for a business trip; my main requirements being in zone 1, wifi and comfortable but within a budget. I can't recommend this enough.", "title": "Everything I needed and nothing more. Perfect.", "user": "Melissa C", "date": "January 7, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 149084437}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "The location is great - right on Bankside, a sneeze away from the Tate Modern and a wide variety of restaurants.", "title": "Great value, technology & nights sleep", "user": "ManiacsOnTour", "date": "January 5, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 148904343}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "Well-designed, perfectly proportioned rooms with enough room for an ENORMOUS bed, desk, chair and RAIN SHOWER(!!!)", "title": "Brilliant", "helpfulness": 1, "user": "THE_LAMINGS", "date": "January 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 148823436}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "An amazing lobby/bar which is open 24hrs and such a great place to meet friends in. I will be going back to this even if I'm not staying here in the future.", "title": "Wow!", "helpfulness": 1, "user": "Nicola R", "date": "January 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 148810131}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled on business", "text": "Yes, this was an experience. Superbly trained staff an amazing public space that has been extremely thoughtfully designed and fascinating rooms where everything, absolutely everything, is controlled by a tablet. That means curtains, lights, television, you name it...................", "title": "Thank God for the Tablet", "user": "Lemniot", "date": "January 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 149535585}, {"rating": 5.0, "stay_parameters": "Stayed January 2013", "text": "However, in order to get the best value for money here you must do a lot of research as room rate varies from one source at £69 a night, to a rack rate of just under £200.", "title": "Highly recomended", "helpfulness": 1, "user": "gailh1961", "date": "January 12, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 1.0, "service": 5.0, "rooms": 5.0}, "id": 149479715}, {"rating": 5.0, "stay_parameters": "Stayed January 2013", "text": "Buoyed by the extremely helpful and intelligent staff we spent a lot of time downstairs at this upmarket very clean very attractive hotel - with its banks of desktop PCs and very attractive and comfortable seating. In Bank Side situated near London Bridge Station and the Shard you are well placed for the Design Museum and the National Theatre, Globe, Old Vic, Royal Festival Hall and other South Bank attractions.", "title": "Groovy hotel with excellent service", "user": "fi0nac", "date": "January 11, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 149405642}, {"rating": 5.0, "stay_parameters": "Stayed January 2013", "text": "The bedrooms will not be to everyone's taste with beds the width of the room but extremely comfortable and a minimal approach to design that reminded me of some of the newer boutique hotels in SE Asia. We loved it and will return for a long weekend soon.", "title": "Something different for a stay in London", "user": "GS33", "date": "January 9, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 149272637}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "Clean comfortable and very relaxing. The whole atmosphere is just awesome. Would definately stay here again. Highly recomended. Staff very helpful. Good location. My stay was very special. Will definately stay here again.", "title": "A one night quick stop on the way to Paris", "helpfulness": 1, "user": "Technical_Terry", "date": "January 9, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 149263618}, {"rating": 5.0, "title": "Still the best value for money in London", "text": "I stayed at the Citizen M in Amsterdam last year and was quite blown away by the style and value for money. The London hotel goes one better. It's spacious, funky, and a really laid back place to unwind after a day out in London. In my case it was work, but nonetheless, Citizen M has set a new benchmark for low cost short stay hotels others will struggle to match. My favourite place to stay overnight in London, bar none!", "user": "ComptonScotty", "date": "January 4, 2013", "id": 148766745}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "My husband and i really enjoyed our new years eve nite, in what was a Compact, Contemporary,comfortable, room and in an overall stylish hotel. The hotel was good for us as cyclists as they had their own secure cycle parking area which I think every hotel should cater for! The room had a bed which was very large and comfortable but unfortunately being old fashioned I am used to getting into a bed which is actually made for us, rather than havin 2 pillows & a duvet piled in the middle of the bed for us to actually make it ourselves!? The other thing which was missing in the room and I'm probably being old fashioned again but I love a kettle so that Im able to make myself a nice cuppa....We were on the 5th floor which had a good view of the city although we found that the windows were not very soundproof even at the height we were!", "title": "great hotel in great position", "user": "elliemay22", "date": "January 2, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 148640420}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "We did love the idea of using the tablet to operate the lights, blind/curtain, temp, tv, internet(which was free :-)) so for us this was a very new and a great inovative way to please urselves with how we wanted the room to feel & enterntain. We would definitely stay here again and would recommend it to everyone who wants a good position in london as this was only a 5 min walk to the Tate modern & the embankment....The staff were nice and friendly and helped with check in & out which u do yourselves via computer! oh so modern! and even the lifts took a few minutes to work out how to use...with the aid of the card you are given when you check in! We cannot wait to go back again which we are planning to do new years eve again...", "title": "Way cooler than I am", "user": "ParcyWiltshire", "date": "January 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 148575314}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "Convenient location for the eastern end of Central London, We just needed a room for a night so we could see the New Year's fireworks. The hotel was actually part of the fun rather than just a place to shower and sleep. Easy check in. Throughout the hotel they have gone out of their way to make it just a little bit different, the decor I think you would describe as \"retro\", but check out the pictures and decide for yourself. The room we stayed in was small but had all we needed. A big comfy bed, and lots of toys, We enjoyed playing with the lighting options. The shower/toilet pod is a little strange and.....how to put this delicately....it would be good to stay with someone you know well as it is not totally private. Moving on, Breakfast was excellent - buffet style. We only had a quick snack the day before that was good too, I enjoyed the Sushi. All in all good fun. Top tips? Car parking is expensive and limited, so public transport maybe better. Don't forget to press the button to lower the blinds - New Year's Day hang over's are not improved by bright sunlight. .", "title": "Wonderful Hotel", "user": "chrisehb", "date": "January 1, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 148513427}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "We booked the citizenM for New Years Eve on a special offer. We arrived around 4 and was greeted by a helpful host who guided us through the simple check-in process. We entered the room and were amazing by the cleanliness, style and features. The room had a tablet which was wonderful to set the mood and control the room. The room also came with a power shower, free wifi and movies, the hotel in general was a read breathe of fresh air. The hotel is located around 10 minutes walk from London Bridge and has many shops around it for anything you may have missed.", "title": "Amazing new years stay", "user": "catchr321", "date": "January 1, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 148502908}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "Stayed at CtizenM for our anniversary weekend. on arrival you check into your room through self check in computers where staff are always on hand to help and answer any questions which was good. walking up to our room we were amazed at how high tech and modern everything was, with TV's in the lifts and modern art splashed everywhere throughout the hotel. our room was like nothing i had ever stayed in before, the shower was surrounded by perspex that changes colour and lights up the whole room. A samsung tablet controlled all of the room functions from the mood lighting, to the television and even the blinds. We had breakfast in the hotel which we payed £10 each for, breakfast was more like a free for all where you just get your food from the buffet and sit wherever you like. The food however was very nice. we did feel like we were the only English people in the hotel which was odd being in England but we didnt mind too much as we didnt send too much time in the hotel grounds itself. the hotel is a 15 minute walk to Waterloo station so it was in a good location, and we were able to leave our bags in the hotel when we checked out so we didnt have to carry them around with us all day which was really nice. overall i would stay in this hotel time and time again!", "title": "Amazing rooms!", "user": "KerryLeyland", "date": "December 31, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 148412369}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled solo", "text": "It is a really nice hotel and stay was wonderful. They are all nice and hotel is full of details that are tought to have a pleasant stay. Price is reasonable so I highly recommend it.Best things: King size bed, a little fridge in the room, light possibilities and a huge range of films, new ones, to enjoy watching in the big screen.", "title": "Really good", "user": "Amparo M", "date": "December 28, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 148228501}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "Citizen M is a great hotel! Once we entered the room I didn't want to leave. The lighting and the tablet control is awesome and makes the hotel a lot of fun. The rooms are small but still comfortable. The price was perfect for us and didn't break the bank so we're hoping that it stays that way because it'll be our go to place to stay in London. We did have some issues with the lighting not working for a majority of the stay but were told that the hotel systems were having issues and since technology goes haywire we understood. The staff was very nice about the issue and tried to help out as best they could. We hope to return soon!", "title": "Swank But Welcoming", "user": "KiwiandCheese", "date": "December 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 148224926}, {"rating": 5.0, "title": "Modern, quality and friendly staff", "text": "We had Christmas in London this year and this was a great place to stay!! Staff were very friendly, mod cons in the room made it fun to play with the lighting settings etc, very clean and there's a lift to all levels!!! Not just stairs, yay!! Rooms are very small, but we knew that , however it really wasn't an issue, they were perfect for us. The living room in the foyer/lobby area are great to hang out after a long day of sightseeing. All in all, I highly recommend this place for couples and would definitely stay here again :)", "user": "Jess J", "date": "December 28, 2012", "id": 148179761}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled solo", "text": "it was such a fantastic experience in heart of london. very stylish interior with all automatic mode cons. it's amazing to stay in changing room light colours as rainbow!!", "title": "fantastic room with rainbow lighting control", "user": "keeewi", "date": "December 26, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 148064535}], "location": {"country": "United Kingdom (UK)", "continent": "Europe", "city": "London"}, "variance": {"poor": 15, "average": 28, "very good": 321, "terrible": 4, "excellent": 817}, "aka": "CitizenM London Bankside England", "slim_ranking": 0.0278810408922, "description": "Located in the buzzing Bankside in the heart of London, citizenM is just minutes away from the Tate Modern and Millennium Bridge, within walking distance from Southwark tube station (Jubilee Line) and London Bridge (Jubilee & Northern Line). Find here Vitra chic living rooms, free Wi-Fi & free movies on demand, rooms with a tablet moodpad to control everything from mood lights to temperature, tv and blinds. There is also canteenM food & beverage outlet."}