{"user_rating": 4.5, "review_count": 225, "name": "City Living Hotel", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled solo", "text": "As I was travelling solo in Tromso, I booked this hotel to give me the option of eating in - I was also not entirely sure how much veggie food would be available locally. It is a good central location, clean and with friendly staff on reception. My room looked out the back so there was no view, but I wasn't expecting one in any case. The free wifi was great and fast enough to allow skype video chat.", "title": "Did exactly what it needed to.", "user": "SarahAR19", "date": "November 26, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 146209958}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled on business", "text": "There are a couple of small supermarkets close by and also some 7 day opening convenience stores if you run out of stuff.", "title": "Clean and pleasant", "user": "CygnusBergen", "date": "October 31, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 144134211}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "The kitchen was reasonably well stocked, although I wouldn't have minded a toaster and also something to make fresh coffee in, but overall a couple of rings and a kettle were enough to keep me happy. I'd happily stay here again.", "title": "faultless hotel", "helpfulness": 2, "user": "lyndublin", "date": "October 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 143724434}, {"rating": 5.0, "stay_parameters": "Stayed October 2012", "text": "I stayed at City Living in a small room/apartment, and was favorably impressed by the cleanliness of the place. The hotel is very centrally located, and since my room was on the 5th floor, I also had a room with a view! Since there was a small kitchen, I did fix myself dinner one evening, but there were many restaurants in the vicinity. One drawback is that unlike 'real' hotels, the room is cleaned only once a week!", "title": "Fantastic hotel, highly recommended!!", "user": "emsiebabe2105", "date": "October 24, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 143593741}, {"rating": 3.0, "stay_parameters": "Stayed October 2012, traveled solo", "text": "What a brilliant place to stay . Spotless clean , great location. Stayed here foe six nights and not one complaint and believe me i can complain. Nothing was of trouble for the staff at reception. On the night we were going chasing the lights we asked at reception for a lent of a flask to take with us , they had said the did not have one but will get us one and just before we went out there was a new flask at the reception for us to take as long as we wanted . Loved that we could help ourselves to clean towels and sheets as often as we liked on the 2nd floor would recommen this place to everyone .", "title": "Reasonable stay, convenient location.", "user": "Rockflight", "date": "October 22, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 143410646}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled with friends", "text": "Spotlessly clean room and extremely helpful and friendly receptionist.", "title": "A good choice", "user": "Wendy G", "date": "December 30, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 148344881}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with friends", "text": "I opted for apartment style accommodation as I didn't not want to be disturbed by cleaners in the morning after late nights on Northern Light hunts.", "title": "I really recommend", "helpfulness": 1, "user": "Traveling303631", "date": "December 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 147815225}, {"rating": 5.0, "title": "Great comfy stay", "text": "The rooms are only cleaned once a week, however, the lovely cleaning lady showed me where the bedding and towels were kept and said to help myself and that if I wanted my room cleaned, she would do so.", "user": "SoonHoe", "date": "December 15, 2012", "id": 147473353}, {"rating": 4.0, "stay_parameters": "Stayed December 2012", "text": "I wish there were places like this in all tourist destinations.", "title": "Brill stay for the lights", "user": "UK007agent", "date": "December 10, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 3.0, "rooms": 5.0}, "id": 147101263}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled with friends", "text": "One good point, which is very important to me, is that the room's heating was able to be regulated, even turned off and windows were easily opened to let in some of that lovely fresh arctic air!", "title": "Chasing the lights trip", "helpfulness": 1, "user": "JaneGibraltar", "date": "December 1, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 146587397}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled on business", "text": "Rooms very well equiped and comfortable. You can even buy food in the supermarket and cook a light meal if you wish.Very good relation quality / price. Very central, you can walk everywhere in the city of Tromso. Despite being a very central hotel it is located in a quite quiet road.", "title": "Economic and Very well located", "user": "Crisque", "date": "October 9, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 142381343}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "It 'a good hotel with apartments, very clean apartments, central location, professional staff, laundry for guests, easy check in, LCD TV. Very comfortable bed. The photos and description match reality. I hope to return soon.", "title": "great apartments", "user": "Emiliano G", "date": "August 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 138781551}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "Large modern and clean room with cooking facilities and free laundry in basement. Courteous, helpful staff. There was also a sofa and two chairs in the room. Supermarket and restaurants downstairs. the staff was never too busy to give advice and help. Close to the main shopping street and buses.", "title": "Comfortable, affordable and convenient", "user": "Ronerta G", "date": "August 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 138248824}, {"rating": 3.0, "stay_parameters": "Stayed August 2012", "text": "The location of this hotel is good. Polaria is about 700 mtrs, the northern most brewery is 500 mtrs. City center is just 2 blocks away.", "title": "Average. Nothing great about it", "user": "naviarora", "date": "August 7, 2012", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 4.0, "service": 2.0, "rooms": 3.0}, "id": 136513634}, {"rating": 5.0, "stay_parameters": "Stayed August 2012", "text": "Hotel room was average. It had a tiny kitchen, with nothing provided. No tea bags or coffee or sugar sachets. It was funny. Normally you get at least these basic items.", "title": "Very comfortable", "user": "Abhishri", "date": "August 7, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 136497820}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "We arrived around 8pm in the evening and unfortunately there was no-one on the front desk to let us in! It wasn't a great start! We didn't wait too long - about 10 minutes - before a member of staff appeared and made us welcome. However, we were advised that the only rooms they had available were standard rooms - not what we had booked! Upon seeing the confirmation that we had printed and brought with us the receptionist said the only rooms they had available were suites and they would have to ring their boss to see if we could have one. This they did and we got the larger room right at the front of the hotel on an upper floor. The room consisted of a living area with tv (only 1 english speaking channel) a small bedroom, a well set out kitchenette and a large bathroom with underfloor heating. As it didn't get above -6 or so the heating was fantastic. The bed was quite solid, but thats the luck fo the draw! The hotel is really well situated very close to the harbour and close to a few supermarkets. As other reviewers have mentioned, Norway is extremely expensive - nealy £10 for a pint of local beer. This hotel was very clean and the staff that we seen were very nice and helpful. You can also buy breakfast from the hotel to eat at a Thon hotel opposite - this was the only good value meal we had. Buffet style, including cold and hot food, costs about £8 per person. There are some lovely restaurants in Tromso and the food was good but you are really paying an awful lot", "title": "Lovely", "user": "Something-Different!", "date": "January 8, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 149178542}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "of money. The trip overall however was fantastic! Really strange to be in pitch darkness at one in the afternoon. Overall we woudl go back and stay in the City Living Hotel.", "title": "Excellent base for seeing the lights.", "helpfulness": 1, "user": "Piggle1", "date": "January 4, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 148840668}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "Overall we enjoyed our stay at city living. The location was great, only a very short walk to the airport bus stop and shops. The room was a good size and the kitchenette although basic was great and reduced our costs significantly as eating out is very expensive. The under floor heating in the bathroom was a bit of a treat. Room was clean and although wasnt cleaned during our stay was not a problem for us.", "title": "City Living Hotel - a nice & cosy place to live in a city", "helpfulness": 1, "user": "hongchep", "date": "January 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 148604661}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "Bed wasnt particularly comfortable but ok.", "title": "Good value, well equipped, great location", "helpfulness": 1, "user": "Jacqnfra", "date": "January 2, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 148571667}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled solo", "text": "We, a group of 4 adults, came to Tromso, hopping to see the Northern Lights. As part of an airfare (2 ways) + hotel package that cost us US$921 per person, we had 3 nights' stay at City Living Hotel. After our flight from Bergen via Budo (hope I got the name right) and a short taxi ride from Tromso airport, we arrived at City Living Hotel at about noon on 15th Dec 2012. It is situated right in the city. We discovered later that the hotel was close to the post office, supermarket, harbour, shops, church, etc, etc. In short, it was a very convenient location.", "title": "Well-equipped and located", "helpfulness": 1, "user": "Taridzo C", "date": "December 31, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 148458462}], "location": {"country": "Norway", "region": "Northern Norway", "continent": "Europe"}, "stars": 3, "variance": {"poor": 3, "average": 16, "very good": 79, "terrible": 0, "excellent": 127}, "slim_ranking": 0.125, "description": "Right in the heart of Tromsø. City Living is located in Grønnegata approximately 80 m from Strandtorget. Facilities include 46 high standard rooms and apartments, ranging in size from 14.5 sqm to 52 sqm. All rooms have en suite bathrooms, kitchen facilities, fridge, TV and free internet access. The larger rooms also have dishwashers. There is a guest laundry with a washing machine and clothes dryer. Service: Through limited service, we are able to offer low room rates. Opening hours for reception are 8am-8 pm Monday to Friday. Breakfast is not included. All rooms having cooking facilities. Breakfast may be purchased from our collaboration partner."}