{"user_rating": 3.0, "review_count": 37, "name": "Clarion Inn & Suites University Center", "reviews": [{"rating": 1.0, "stay_parameters": "Stayed November 2007, traveled on business", "text": "This is the worst hotel I have ever been booked into, The room was so poor I didn't stay and drove down the road and found another that was cleaner and much better maintained.", "title": "This place is beyond poor", "helpfulness": 1, "user": "Dongab", "date": "November 27, 2007", "detail_rating": {"front_desk": 2.0, "service": 3.0, "cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "location": 2.0}, "id": 11091874, "likes": {"liked": "— Nothing to like", "disliked": "— Don't know where to start."}}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled with friends", "text": "I stayed at the Hotel last week and absolutely loved it! I stayed there about two years ago at my brother's graduation and found the place very spacious and nice. This time, however, I felt the property", "title": "Loved the Best Western", "helpfulness": 1, "user": "post123", "date": "April 10, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 7307275, "likes": {"liked": "— location-spacious", "disliked": "— nothing!"}}, {"rating": 1.0, "title": "This Hotel has many problems.", "text": "was looking in even better shape. The landscaping was beautiful and the property was near spotless. I highly recommend staying here!", "helpfulness": 1, "user": "coach323", "date": "March 4, 2007", "id": 6911284}, {"rating": 1.0, "title": "Hated this place, don't stay here.", "text": "I stayed at this hotel because it was the location of a convention. Several members of our group had problems with their rooms. The toilet had no cover over the tank, just a piece of piece of hard plastic. The handle was not connected to the sink, it came off with each use. Another group had four rooms reserved at the hotel for the convention. When they arrived the front desk informed them that they had no more rooms. Every time we were in the lobby there were people at the front desk with some type of complaint. I will never come back to this hotel.", "helpfulness": 8, "user": "A TripAdvisor user", "date": "August 10, 2005", "id": 3752275}, {"rating": 4.0, "title": "Great Staff, Service, and Overall Comfort", "text": "Me, my husband and our soon to be college student daughter, stayed at this hotel while visiting Auburn University. I can only say that this is the worst hotel/motel that we have ever stayed at. We had to pack our things in the middle of the night and find another room at the Hilton Garden Inn and Suites. We were booked for 2 nights and only stayed 1. The rooms were filthy. Lights didn't work, phone didn't work, toilet ran for at least one half hour after flushing. However, we decided to stay since we were only there for 2 nights. The final straw was Friday night, the night before we were supposed to be leaving for our drive back to Pittsburgh the next morning. There was a huge party in the parking lot outside our door. I'm talking a ton of people. Driving in and out of the parking lot with their souped up basses blaring!! Apparently, they frequent the nightclub Benji's at this motel. When my husband went down to complain at the front desk, he was told that there was nothing they could do. He asked for a refund which was given but not gladly, and their reply was they make 1500.00 on a Friday night which was nothing compared to our 75.00. My husband told them that they should warn travelers that they will not get any rest here and you won't, at least on the weekends.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "January 4, 2005", "id": 2974403}, {"rating": 3.0, "stay_parameters": "Stayed March 2009, traveled solo", "text": "This is a former Days Inn. It was while I was at college at Auburn (2000-2004) and must have just recently changed hands as the hotel room cards still had the Days Inn logo on them.", "title": "Average", "user": "codelemur", "date": "April 19, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 2.0, "rooms": 2.0}, "id": 28363829}, {"rating": 3.0, "stay_parameters": "Stayed May 2008, traveled on business", "text": "If you book on the website, be prepared for some issues. I booked a single room and somehow ended up with a reservation for two rooms. The staff seemed totally unsurprised by this.", "title": "OK, but can do better", "user": "Father_of_Five_Kids", "date": "May 24, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 2.0, "value": 3.0, "location": 5.0, "rooms": 2.0}, "id": 16367161, "likes": {"liked": "— Location", "disliked": "— Cleanliness, no fridge"}}, {"rating": 3.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "The room was not ready when I arrived (even though it was well after check in time). I, along with several others, had to wait more than an hour for our rooms to be ready.", "title": "Decent", "user": "clh22", "date": "May 20, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 4.0}, "id": 16263553, "likes": {"liked": "— Decent", "disliked": "— Noise"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled on business", "text": "Hotel advertises free wireless internet. While it is true that there is wireless and it is free, the signal strength (at least in my room) is so low as to be totally unusable. The only place in the hotel that had a sufficiently strong signal was the lobby.", "title": "Very Nice Property", "user": "Ozcfied", "date": "May 12, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 3.0, "rooms": 3.0}, "id": 15942573, "likes": {"liked": "— The grounds are quite nice", "disliked": "— No complaints"}}, {"rating": 3.0, "stay_parameters": "Stayed January 2008, traveled on business", "text": "The room quality is what could best be described as typical for a motel built in the 70s. Maintenance needed some work; my toilet ran nearly constantly for the weekend.", "title": "great friendly staff", "user": "kwr77", "date": "January 23, 2008", "detail_rating": {"front_desk": 4.0, "business": 1.0, "service": 4.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 2.0}, "id": 12937537, "likes": {"liked": "— The friendly and helpful staff", "disliked": "— Not able to conduct business due to things not working"}}, {"rating": 3.0, "title": "Nice Place", "text": "This is a nice motel with a well kept pool area and good restaurant. It is an older property (formerly Quality Inn and Best Western again before that), but has been well kept over the years. The rooms are clean and comfortable. It is a good place to stay at a good price. Auburn University is just a couple of miles down the street.", "helpfulness": 1, "user": "deskclerk102", "date": "May 11, 2004", "id": 1925061}], "location": {"country": "United States", "city": "Auburn"}, "stars": 2.5, "variance": {"poor": 2, "average": 9, "very good": 9, "terrible": 8, "excellent": 9}, "aka": "Lexington Hotel University Auburn", "slim_ranking": 0.769230769231, "description": "The Clarion Inn & Suites University Center in Auburn, AL offers easy access to Auburn University and Jordan-Hare Stadium. This Auburn, Alabama hotel is also convenient to the Jules-Smith Art Museum and the Robert Trent Jones Golf Trails.Guests of the Clarion Inn University Center hotel are invited to relax in the outdoor pool, utilize the Business Center and work out in the exercise room. Boasting 9,000 square feet of conference space and one of the largest ballrooms in the area, there are 5 meeting rooms, with the hotel able to accommodate 400 people for banquets and 900 people for conferences. Additional amenities include: Free continental breakfast, Free wireless high-speed Internet access, Free coffee, All guest rooms offer a flat-screen television with cable, refrigerator, microwave, hair dryer, alarm clock, iron and ironing board. Some rooms feature a sofa sleeper. Its perfect location and convenient access to area attractions make the Clarion Inn & Suites University Center a great place for business and leisure travelers in the Auburn, AL area."}