{"user_rating": 4.5, "review_count": 143, "name": "Clarion Hotel at the Century House", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled with family", "text": "Our only complaint was that our bed was too soft and unsupportive for our liking. However, it was tolerable for one night. All the staff was friendly and quick with their duties, and the breakfast buffet was at least a step or two above the usual. The hotel takes many steps to be \"green\". There is a half mile long, accessible, nature trail in the back which is good for dog walking.", "title": "Would stay here any time", "helpfulness": 1, "user": "DanC04102", "date": "February 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 125205058}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "This New Year's weekend we returned to this welcoming hotel to celebrate significant birthdays of our daughter and her husband. It was the storybook setting for their wedding reception in 1999. If anything, our stay seemed even better this time. The beds were extremely comfortable; the bath perfect for bubble baths and steamy showers. The complimentary breakfast included everything from french toast or pancakes to sweet rolls, oatmeal, fresh fruit, yogurt, scrambled eggs, bacon or sausage, corned beef hash, home fries and fresh-made waffles. Charming waitresses poured mugs of hot coffee and goblets of cold water in a pub-style room we didn't want to leave. We exchanged late Christmas presents there, read the New York Times for a couple of hours New Year's morning, and generally made this comfortable inn our home. Taking advantage of the mild weather, we took a winter walk with our grandson on the hotel's nature trail. On New Year's Eve, we joined friends and family for a 40th birthday dinner in an intimate dining room of the Century House restaurant. Instead of birthday cake, we ate Baked Alaska and the moistest, richest chocolate cake ever.", "title": "You Can Go Back", "helpfulness": 1, "user": "LoftLover", "date": "January 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 122653239}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "Booked in at the last minute as we were staying for a new year's eve celebration in Saratoga. We were very happy with our choice. The room was clean, beds very comfortable, and the breakfast was excellent. We stayed on the first floor, and were surprised at how quiet it was.We would definitely return to this hotel.", "title": "very satisfied", "user": "marion b", "date": "January 3, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 122462705}, {"rating": 3.0, "stay_parameters": "Stayed November 2011", "text": "Good: bed was comfortable, friendly service.", "title": "Comfortable beds, good service, in poor repair and housekeeping leaves something to be desired.", "user": "Sambo1976", "date": "November 25, 2011", "detail_rating": {"cleanliness": 2.0, "value": 3.0, "location": 4.0, "service": 4.0, "rooms": 3.0}, "id": 121018047}, {"rating": 3.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "Bad: smell: room 116 had probably been a smoking room at some point, but the wallpaper, drapes, etc. still carried the smell...unpleasant. Stained and peeling wallpaper, cobwebs at the ceiling, lots of dust at baseboards and carpet around furniture. Lots of dust built up in air conditioner. Bathtub filled with water when showering. Floor of shower stained and peeling no-slip stickers.", "title": "Somewhat disappointed", "user": "LindaDoc12", "date": "November 19, 2011", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 120801637}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "We arrived very late on a Sunday night and were greeted by courteous staff members who helped us get a cot into our room quickly so we could crash. The room was on the small side but very well equipped. We were touring colleges in the Northeast, mostly staying at chain hotels, and this one had the best breakfast buffet by far and we also had a the best rate here. Free internet was a plus. I would recommend to anyone staying in the area for business or leisure.", "title": "Nice base for college tours", "user": "StJohnFan", "date": "April 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 127701890}, {"rating": 3.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "This is definitely a hotel that caters to its surroundings. New England motif decorated with antique/classic items and much horse and hunting imagery.Saratoga Springs is nearby. This is a hotel which has an odour of vanilla in the main downstairs hallway and the ground floor room we stayed in smelled very 'closed' and needed a good airing out. The ceiling of the this hallway needs some maintenance. Athough it was evident that management had made improvements to the room,it (the room) looked tired and needed refurbishing. The ac was modern, quiet and efficient, and the bathroom had been updated and was quite acceptable, however, wall paper is always a bad choice for bathrooms, and some of it needed to be rehung. The bathroom was acceptably clean, with good thirsty towels. Again, the maintenance issues,in this case rough grout and caulking, makes pristine results very difficult. The beds were comfortable, dressed in a modified European style of sheet and comforter. This not a bad system, but the comforters must be reversed every couple of days, or all the feathers end up at one end,in our case the feet, leaving nothing for the shoulders. It also makes even a well made bed look untidy. The furniture was New England style and showed evidence of much use.", "title": "Hotel with character and some nice touches", "user": "tedhanneman", "date": "April 5, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 127332529}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled with friends", "text": "The front desk staff were very welcoming and attended cheerfully to our requests. The breakfast was excellent buffet style with beverage service, and included eggs, hash, seasoned potatoes, and breakfast meats, as well as the usual fruits, cereals, and bakery items. This and the free parking was definitely value plus. The gardens are well kept and the property is well away from the road.", "title": "Excellent value", "user": "cityside", "date": "March 29, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 126919691}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "I walked around upstairs (this is a two storey building) and the air seemed to be much sweeter. Internet was free but not very fast", "title": "Nice Hotel for a Conference", "user": "oompahdave", "date": "March 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 126806707}, {"rating": 3.0, "stay_parameters": "Stayed March 2012", "text": "This is a good value property which could be made much better with attention to maintenance.", "title": "Not bad, but a little disappointing", "user": "ICTS1", "date": "March 26, 2012", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 4.0, "service": 3.0, "rooms": 3.0}, "id": 126695904}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "This hotel is a pleasant little gem. Staff is friendly and always helpful. This hotel has an outdoor pool, tennis courts, even a hiking trail. Includes a great free breakfast. Nice rooms and super comfortable beds!", "title": "Nice hotel..wonderful restaurant", "helpfulness": 1, "user": "Ornell52", "date": "October 8, 2011", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 119075259}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "My family had a wonderful stay at the Century House this August during Travers week. Hurricane Irene arrived while we were there and the staff at Century House did an outstanding job of taking care of their guests. The restaurant stayed open even though only a limited number of staff members were able to make it to work during the storm. Other restaurants were closed in the area, but we were well taken care of by everyone at Century House.", "title": "Excellent Service", "helpfulness": 1, "user": "Irene d", "date": "August 30, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 5.0, "service": 5.0}, "id": 117460088}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "Very nice rooms, very nicely landscaped grounds, very nice staff,great breakfast food and room. Very Green Ecologically Friendly Hotel. Would surely stay again and recommend to anyone. Yes it should be rated #1 in Latham.", "title": "Better than average Clarion Inn", "user": "NYAnge53", "date": "August 13, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 4.0, "service": 5.0}, "id": 116681654}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "On our drive from Cape Cod back to Canada we had reserved this hotel because of it's location just off the expressway north of Albany. We were very pleasantly surprised. Clean and superbly comfy beds with duvets in a quiet location away from the highway. Also the restaurant associated with the propery was excellent and service was very attentive. To our surprise, guests receive a free shrip cocktail.", "title": "Pleasant surprise and great restaurant", "user": "Bonjours", "date": "August 5, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116322876}, {"rating": 5.0, "stay_parameters": "Stayed August 2011", "text": "Well worth the small detour.", "title": "Anything but ordinary", "user": "BNT12659", "date": "August 5, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 116322205}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled solo", "text": "I gave the Clarion Hotel an excellent review, because the beds were very comfortable, the service was excellent and the complimentary full breakfast buffet was excellent. I have family in Albany and will definitely stay at this hotel again. Please note: I am particular about the hotels I stay at. Number one being, \"Do I feel safe here\" are the rooms clean and how is the service and food. Stayed here for my brother's wedding.", "title": "Best place to stay near Albany Airport", "user": "luv2vacationtorelax", "date": "November 8, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120349474}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled with family", "text": "Visited here in early November on a stopover from Ontario to the Canadian Maritimes. While I use Choice hotels extensively I havent visited many Clarions. The last one in Orlando was no great place, but this one was a very pleasant surprise. Ambience in the rooms was very nice.... nice beds, nice trim, nice bathroom, very clean. The only thing was little but it stuck out like a sore thumb.... the wallpaper in the bathroom around the toilet was ripped and missing... seems like a simple repair to me.... What a wonderful breakfast in the morning, with an immaculate young hostess looking after us.", "title": "Very nice with just a couple of suggestions", "user": "nsbil", "date": "November 6, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 120238157}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled with friends", "text": "One thing I thought a bit confusing is that due to this being part of a complex that may or may not have other hotels associated I was uncertain when I arrived that I was at the right location. The Clarion sign is up at the street but you have to drive down and around connected builidings to the back, at a lower level to reach the hotel. Down there the sign says just The Century House Hotel... and doesnt mention it being the Clariion. We in fact drove around looking for the Clarion, not knowing we had reached it. A simple little Clarion sign near the historic hotel name would be nice.", "title": "123", "user": "Tracy V", "date": "October 24, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 119665644}, {"rating": 3.0, "stay_parameters": "Stayed October 2011", "text": "For sure this will be a hotel that we will return to!", "title": "Could be better", "user": "ptk21044", "date": "October 14, 2011", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 2.0, "service": 2.0, "rooms": 3.0}, "id": 119309815}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "Great friendly and pleasant atmosphere. Excellant free breakfast. The restaurant was fabulous with friendly staff. Food was decicious! Rooms clean and comfortable. We enjoyed the 1/2 mile nature trail. We were there for a wedding which was perfectly arranged and more than met our expections. A good time was had by all!", "title": "Great pet friendly hotel", "user": "MollyPaws1", "date": "October 10, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 119156732}, {"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "I got married at the Century House and was given a complimentary bridal suite to stay in after the wedding. The room was right off of the main lobby but you wouldn't know it because it was so quiet in our room! The beds are so comfortable and that was very important to me because my husband and I were exhausted! The suite consisted of a large king bed with a dresser and a television and a sitting area with a couch, another tv, a desk, and a comfy chair. The bathroom was a pretty standard bathroom, no hot tub :o(", "title": "Wonderful wedding suite", "user": "Sunrayz83", "date": "June 5, 2008", "detail_rating": {"cleanliness": 3.0, "front_desk": 3.0, "location": 3.0, "value": 4.0, "rooms": 4.0}, "id": 16707586, "likes": {"liked": "— Comfortable beds and the breakfast", "disliked": "— Water temperature in shower"}}, {"rating": 5.0, "title": "Will Never Stay Anywhere BUT Here", "text": "The only problem that I had with this room was that the water temperature in the shower was very spotty. It kept switching from extremely hot to luke warm. My parent's also stayed at this hotel and didn't have the same problem as us so i'm not sure if this is a problem in every room.", "helpfulness": 2, "user": "Layover", "date": "April 12, 2008", "id": 14983882}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled solo", "text": "The breakfast that was provided in the morning was delicious and they were many different breakfast foods to choose from (eggs, bagels, home fries, french toast, etc.). The cups that they provided for the juice were incredibly tiny so since I don't drink coffee I just poured the juice in my coffee cup :o)", "title": "Loved It", "user": "tooluser", "date": "October 6, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 10047570, "likes": {"liked": "— Nicely managed, great breakfast", "disliked": "— Other people said the hallways had some late night noise."}}, {"rating": 1.0, "stay_parameters": "Stayed May 2007, traveled on business", "text": "Enjoy your stay!", "title": "Smokers should avoid this place.", "helpfulness": 1, "user": "Grafschafter", "date": "May 18, 2007", "detail_rating": {"front_desk": 1.0, "business": 3.0, "cleanliness": 3.0, "value": 1.0, "rooms": 4.0, "location": 4.0}, "id": 7638598, "likes": {"liked": "— Non smoking policy"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2006, traveled with family", "text": "Someone else nailed the staff on the head: every SINGLE one of them was exceptional. Rooms were quiet and the beds were great. I loved the non-chain feel to it. It was simply exceptional. And the restaurant? Are you kidding me? I ate there three nights, had three different entrees and each one was maybe the best of that genre, I'd ever had. Good prices too. I just got poached for a $40 steak (that sucked) at an airport Hilton last weekend. This was $28 and amazing.", "title": "Great spot for the Family", "helpfulness": 2, "user": "Kennebunk4", "date": "January 19, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 6622805, "likes": {"liked": "— The rooms were very clean and the bedding was top quality.", "disliked": "— There was not an indoor pool for the children ."}}, {"rating": 3.0, "stay_parameters": "Stayed December 2008, traveled on business", "text": "Stayed here for 1 night while in town on business. The hotel seemed very down-home and comfortable. The rooms were clean and beds were comfortable. Free wireless internet was great and the free hot breakfast in the morning very good. Dinner in the tavern next door was good as well. Perfect place to stay for business.", "title": "Nice Stay-Good Business Hotel", "user": "mainetoday", "date": "December 4, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 4.0, "location": 3.0, "rooms": 3.0}, "id": 22457181, "likes": {"liked": "— comfortable beds, free internet & free hot breakfast"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled solo", "text": "Nice room & a very good value. Recommended!", "title": "very good hotel!", "user": "ell2000", "date": "October 16, 2008", "detail_rating": {"front_desk": 3.0, "business": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 3.0}, "id": 20946245, "likes": {"liked": "— Nice rooms, Internet connection, low price"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled on business", "text": "Although we chose this hotel primarily because we were attending a wedding reception at the Century House, we also were thrilled to find out that they are a pet friendly hotel. We decided to bring our 5 month old ShihTzu to test it out. We were not only pleased with our experience, but had a wonderful celebration as well. Food was excellent, room was spacious and clean. Only one set-back was after being settled in our room for 4 hours, the front desk assigned our room to another traveler who showed up entering our room with their valid key card entry. Thankfully, we were in the room, although a bit startled that another party could walk right in, but after straightening it out at the front desk, we enjoyed the rest of our stay. Anyone with pets that travel would find this a superb hotel to stay in.", "title": "Wonderful experience (bring your pet too)", "user": "MaggieChew", "date": "September 16, 2008", "detail_rating": {"cleanliness": 5.0, "front_desk": 2.0, "value": 3.0, "rooms": 5.0, "service": 5.0}, "id": 20125435, "likes": {"liked": "— pets welcomed", "disliked": "— n/a"}}, {"rating": 2.0, "title": "Disappointed", "text": "Based on th other reviews and photos I was expecting a very nice hotel. What I found was a hotel that was very tired. The photos certainly made it look much better than it is. Even worse, the room was to be non-smoking (we even had to sign a statement that if we smoked in the room we would be assessed a $20 fine) but it stunk of stale smoke. Also contrary to other reviewers we found the staff to be unfriendly and not the least bit warm. I can't say I would recommend staying here again.", "user": "cocoawoman", "date": "September 3, 2008", "id": 19721209}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "We arrived in the middle of the night on bicycles in a driving rain storm. The staff welcomed us with great friendliness and met our needs for a first floor room into which we could roll our bikes. The bed was one of the most comfortable ever. The breakfast was terrific. I would not hesitate to recommend this property and will stay there again if we are in the area.", "title": "Outstanding lodging", "user": "mss289r", "date": "July 27, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 18322603, "likes": {"liked": "— The bed", "disliked": "— The restaurant recommendation in the hotel folder"}}, {"rating": 5.0, "title": "Above expectations", "text": "The hotel was clean and comfortable. They offer many ameneties for no extra charge. In particular, we took advantage of the exercise room and the free crib. The breakfast was very good. The rooms were very clean and comfortable. We got an excellent price by booking through their web site. We would definitely stay there again.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "November 16, 2004", "id": 2829008}, {"rating": 4.0, "title": "Good!", "text": "My stay went very well at the Century house Inn. We could check-in early, the room are clean, the service was good. The ballroom is a very warm place, I would recommand those ballrooms for every wedding!!!", "helpfulness": 2, "user": "maitre27", "date": "November 9, 2004", "id": 2815005}, {"rating": 5.0, "title": "Century House was wonderful", "text": "I came to the Albany area on business a month ago and I stayed at the Century House Inn. I had one of the best hotel experiences ever. They have a tennis court, a fitness room, and a nature trail for a great price. Included with my stay was a full buffet breakfast in a lovely breakfast room. I had a great time and I will definititely stay there again.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "October 12, 2003", "id": 1385144}, {"rating": 4.0, "title": "The nicest hotel staff I've ever encountered!", "text": "Our group spent 2 nights here and had no complaints at all. The food is tremendous. The hotel is quaint and quiet. Most striking however was how very pleasant the entire staff was.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "June 2, 2006", "id": 5292437}, {"rating": 4.0, "stay_parameters": "Stayed March 2006", "text": "My wife is handicapped, so our viewpoint is somewhat different from most. The inn itself, is adequate, if not somewhat tired. There are signs posted, indicating renovations are in process (nothing major noted). We were told wheelchair access was from a door at the opposite end of the building from our accessible room. Kind of strange, since when we left, we noted a ramp at the front, very close to our room. The room itself was fine, but with a tub (not great for handicapped people). We took the meal package, so were committed to eating there. In order to get to the restaurant, there is no way to get there from inside, so we drove up the hill, where access was fine. Here's the best part. Expecting a limited menu to choose from, we were informed we could order any appetizer, entree & desert from the menu. Food was excellent, as was the service. Breakfast, in a room easily accessible from our room, was average. In closing, staff was pleasant & helpful. We would definitely choose this Inn over the 'chain' hotels.", "title": "Good value when meal package taken", "helpfulness": 2, "user": "1river9", "date": "March 10, 2006", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "rooms": 3.0, "service": 4.0}, "id": 4599491}, {"rating": 4.0, "title": "A very comfortable stay", "text": "Stayed for 3 nights while visiting my daughter at SUNY. The reviews for this hotel are absolutely correct. It is a very comfortable hotel with an efficient front desk. Breakfast is a full buffet with an excellent choice. Good value for money especially through Expedia", "helpfulness": 3, "user": "bryanll", "date": "November 16, 2005", "id": 4121452}, {"rating": 4.0, "title": "Very nice experience", "text": "This was our second visit to the Century House Hotel. It is a very pleasant hotel with a beautiful restaurant. Also the hotel accepts pets - and for that we are most grateful. Also it is located adjacent to a 1/2 mile nature trail which we walked in the morning. Lastly a wonderful hot breakfast in the morning makes this a great place to stay.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "September 25, 2005", "id": 3938056}, {"rating": 5.0, "stay_parameters": "Stayed July 2005", "text": "We stayed at the Century House for one evening on our way from Burlington, Ontario to New Hampshire. The Hotel, dinner and staff was the highlight of our trip, and it was only to be a quick stop over. The rooms are beautifully decorated in a colonial styling, neat and clean. We stayed in room 249 and my in-laws were in room 109 both were decorted differently and both beautiful. My sons aged 3 & 6 enjoyed the pool, and the staff went out of their way to let them know they were special guests at the Hotel. We took advantage of the Business traveler special that included a dinner at the Resturant and breakfast in the morning. First, dinner was over the top, every item brought to the table was outstanding and given a perfect 10 for both presentation and flavor. This was one of the finest meals I have ever had, and the service & decor in the resturaunt complemented the perfect meal. Lastly, breakfast a hot buffet with everything you could think of including my families favourite fresh fruit. The Century House is an absolute jewel and if you happen to have to pass through Albany NY make time to stop for a night, the whole package will leave you very pleased and satisfied.", "title": "Absolutely stunning rooms, with exceptional service", "helpfulness": 2, "user": "realfundad", "date": "July 31, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3726141}], "location": {"country": "United States", "city": "Latham"}, "stars": 3, "variance": {"poor": 3, "average": 22, "very good": 37, "terrible": 2, "excellent": 79}, "aka": "Clarion Latham", "slim_ranking": 0.117647058824}