{"user_rating": 4.0, "review_count": 182, "name": "Clarion Inn Grand Junction", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled solo", "text": "I had been flying in to Salt Lake City and taking the train to Grand Junction just to see the view. I arrived in Grand Junction having no idea how to get around. The hotel has free shuttle that runs from airport, train, and \"downtown\" area.", "title": "great transportation if you don't have a car", "user": "menacingpickle", "date": "September 16, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 79835600}, {"rating": 3.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "They sent Randy to come get me, he was incredibly friendly and gave some recommendations of what to see and do. I ran into Randy a couple times during my stay and he was always really accommodating, as were all the staff.", "title": "Not the best hotel if traveling with dogs.", "user": "mitymodenver", "date": "September 1, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 77842506}, {"rating": 3.0, "title": "Guaranteed room wasn't really guaranteed.", "text": "They let me check in early without fee since I arrived at 11am and was exhausted. The bed was really comfortable with a choice of a lot of pillows. The sheets were clean and the room freshly vacuumed. For the price, I was very satisfied with what I got. I didn't hear any noise from the other rooms, the hallway or the parking lot as others complained about. The hotel is not walking distance to downtown, but with the free shuttle, who cares? It was a drive of about 8 minutes to downtown area. There was plenty to do within walking distance of the motel. Many of the other hotels have restaurants as well as this one, plenty of food choices. Fast food and sit down. Taco Bell, Subway, Burger King, a grocery store, some diners. I walked to subway one night to bring some food back to the room. I had lunch at the Village Inn right next door and the club sandwich was reasonably priced and really good fresh turkey.", "user": "ColoTraveler0", "date": "July 11, 2010", "id": 70448676}, {"rating": 1.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "There were a number of foosball tables, pool tables and an indoor pool in a very clean common area. I didn't check out the outdoor pool so I can't comment on it. My only complaint was the internet was wired and tethered to the desk. I am lazy, I like to lounge in bed and be online. The internet was fast and worked without an issue, just wired. I would definitely stay there again if I had a reason to go to Grand Junction.", "title": "horrible service", "user": "easytraveler044", "date": "July 10, 2010", "detail_rating": {"service": 1.0, "cleanliness": 2.0, "value": 1.0, "sleep": 2.0, "rooms": 1.0, "location": 5.0}, "id": 70388976}, {"rating": 4.0, "stay_parameters": "Stayed May 2010, traveled with family", "text": "I noticed a couple comments about the condition of the bathroom. The water pressure was great (I have waist length hair) but it is NOT a designer hotel. It's not a granite vegas style bathroom. It's a convenience motel. The shower was clean. I will say I found a stray short hair in the bathroom that was not mine, but if you are expecting a hermetically sealed room, stay somewhere pricier. The house cleaning service had clearly attended to this room, people shed a little, accept it. It was one stray hair. There was no hair in the sleeping/living area. The ceiling of the shower had a water spot on a tile, which doesn't bother me. It's a bathroom...it gets moisture.", "title": "Easy to find", "user": "ronismom", "date": "June 17, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 67813949}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "Stayed at this hotel for 4 nighs. This is quite a large hotel with a large indoor swimming pool and a adjacent Italian restaurant. Rooms are nice and comfortable and include a small refrigerator.", "title": "Great hotel, comfortable rooms and a reasonable price", "helpfulness": 1, "user": "Mano40", "date": "July 1, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 4.0}, "id": 114946783}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "We reserved a large block of rooms for a wedding. Everything was beyond our expectations. Good mattresses, breakfast, lots of space for our large family to visit into the evening. The only downside would be we were spread out around the hotel, but all had inside corridor as requested. Very Pleased.", "title": "Met all of our expectations", "helpfulness": 1, "user": "jOy123499", "date": "June 29, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 114888305}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "just read the review beneath mine (deb) and didn't want to duplicate it. The only problem I had was at check in where I arrived after 2pm and the person didn't even check to see if a room was available, she just told me to come back after 4pm. I thought that was quite rude. However when I came back after 5 I was greeted by a very friendly staff.", "title": "nice hotel but no elevator", "helpfulness": 1, "user": "mtebor", "date": "June 29, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 4.0}, "id": 114861943}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "The breakfast was probably one of the best included breakfast I had a choice hotel.", "title": "excellent hotel and price", "user": "debk68", "date": "June 20, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 114587264}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "On the downside, I noticed hotels out West sometimes dont have elevators which can be a pain dragging everything up a flight of steps.", "title": "Very friendly staff and great amenities", "helpfulness": 1, "user": "groovepuppetfan", "date": "May 31, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 4.0}, "id": 110777409}, {"rating": 4.0, "stay_parameters": "Stayed May 2011", "text": "Very good location, great service. Nice place. Outdoor pool closed but still had indoor one.", "title": "Great", "user": "2vrods", "date": "May 30, 2011", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 110562712}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled on business", "text": "This place is the best for us as dog owners. There is a HUGE field for the dogs to play, poop bags to clean up after them, great sugguestions from the staff, free shuttle to the conference center, I could go on and on. It's right on the interstate so convenient to the airport (we didn't fly) but a few block from downtown.", "title": "Best Dog Friendly Hotel ever!", "user": "jumbojimboPeoa_UT", "date": "May 26, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 109959501}, {"rating": 5.0, "stay_parameters": "Stayed May 2011", "text": "We are from the denver area and needed a place in grand junction close to our daughter to have her wedding! We ended up choosing the Clarion Inn and now am so glad that we did. The greatest service ever and the best staff we have ever had. Don took care of everything that we needed on the wedding day. Heather made sure all details were in place before we even showed up for the weekend. The rooms were great and the prices were very resonable. There were no hidden charges and we paid 1/4th the price for this wedding then for our oldest daughter and received better service.", "title": "Greatest Place To have a Wedding!!!!", "helpfulness": 1, "user": "cwamboldt", "date": "May 18, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 108787414}, {"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled on business", "text": "Since my husband was formerly the director of engineering for a 250 room resort hotel, I tend to notice things many people don't, hence my rather long review.", "title": "For the Business Traveler on a Budget", "user": "Dustyboots", "date": "May 3, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 106689068}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled on business", "text": "Spent five days here for a business workshop, and was mostly pleased with my room and the facilities. My room was part of a block of rooms that was older, but very well remodeled. The room was very, very clean. Beds were comfortable, although I only had a double bed - thought I was getting a queen. Room size was adequate, desk was a little small to spread out my work. Heater worked well and was relatively quiet.", "title": "Best place to host your conference or event!", "helpfulness": 1, "user": "NanciAnn1", "date": "May 2, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 106575780}, {"rating": 5.0, "stay_parameters": "Stayed December 2010", "text": "Spent three nights here with my daughter in dec 2010. Came out on the California Zephyr to sight-see and relax. The Clarion Inn was great for us! After a beautiful train trip thru the Rockies, we were met at the train station by their house driver, who even stopped so we could pick-up something we forgot. Easy check in by a great staff. Wanted to stay in that first night, so we ate at the on site restaurant. Glad we did, the place was excellent, and is pretty new to the hotel. Our room was right where we wanted, and nice, with good parking for our monday rental. Must say again how good the staff was, and 5 stars to Amy!!! Easy access to I-70 or a short drive downtown. Would recommend I-70 west to Utah hwy 128 to Moab, Utah, beautiful drive. Hope to return to Grand Junction someday, and will stay at the Clarion Inn again!!!", "title": "like home", "user": "traveltrain11", "date": "January 26, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 94490936}, {"rating": 5.0, "stay_parameters": "Stayed October 2010", "text": "We were a high school marching band. The rooms were perfect, clean and comfy. The location is great - just off Interstate 70, and within fifteen minutes of pretty much anything in Grand Junction.", "title": "Fun place for families or groups with a very accommodating fabulous staff!!!", "user": "muck605", "date": "October 26, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 84969270}, {"rating": 1.0, "stay_parameters": "Stayed August 2010, traveled solo", "text": "The hotel has a large atrium with ping pong tables, pool tables, sitting area, a large POOL and HOT TUB. So our entire group could congregate and have fun together with out being in anyones way. And with the layout of the hotel, we didn't seem to bother other guests because the rooms are in a different area down hallways (ask for a room away from the atrium if you want peace and quiet.....ask for a room on the atrium if you want sliders to watch your kids while they play). We were hardly in our rooms!!", "title": "Filthy Room!!! BUGS IN BED and not BED BUGS!!!", "helpfulness": 2, "user": "DEBBYB_10", "date": "October 23, 2010", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 4.0}, "id": 84550039}, {"rating": 3.0, "stay_parameters": "Stayed August 2010, traveled with friends", "text": "Best of all was the wonderful hotel staff, who were accommodating to our large group and helped us coordinate meals and practice etc. They have tables in the atrium to \"hang out,\" and an upstairs loft for a \"team meeting\" etc.", "title": "nothing special", "user": "up-in-the-air13", "date": "October 2, 2010", "detail_rating": {"service": 2.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 81848739}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "The included breakfast was very good with some protein choices in addition to the standard bagels, cereal, begian waffles, and a good sized seating area.", "title": "Better than we thought it would be", "user": "itsruff", "date": "September 22, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 80635897}], "location": {"country": "United States", "city": "Grand Junction"}, "stars": 3, "variance": {"poor": 13, "average": 35, "very good": 63, "terrible": 7, "excellent": 64}, "aka": "Clarion Inn Grand Junction Hotel", "slim_ranking": 0.407407407407}