{"user_rating": 4.0, "review_count": 654, "name": "Claris Hotel", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "Fantastic hotel for the price. Great location and service, and a lovely breakfast. The rooms are well-furnished and impeccably clean. The bathroom is great, tho the shower was a little awkward to use. We enjoyed the rooftop pool and terrace to relax and for the views.", "title": "Great value and location", "user": "Joe H", "date": "November 28, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 121133646}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "Lovely location, beautiful and stylish hotel but the worst bit was the breakfast room and the low-ish quality of the overpriced food. Rooms were not on a par with the rest of the hotel but I didn't feel they were as bad as some reviewers wrote. The pool was nice but not really big enough to accomodate more than 2 or 3 guests at a time. And that's all the sun-loungers they've got anyway. Overall, good enough service, but I wouldn't go back to it when I go back to Barcelona.", "title": "Good hotel but slightly pretentious", "helpfulness": 1, "user": "DoctorDebs", "date": "November 28, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 121128164}, {"rating": 3.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "We just stayed 5 nights at Claris Hotel. The diappointments: The rooms were the worst part of our trip as they were dark and cramped. They are kind of depressing to be in. You won't find a worse bed anywhere as they are hard and short to the floor. The bathrooms are luxurious yet dated and it's hard to get in shower easily. Eating in the basement for breakfast was not ideal...again, it felt dark and cramped. The positives: The hotel itself was very modern and you can't beat location...taxis are waiting across street 24/7. The staff is extremely accomodating. The rooftop is beautiful and a great place to relax at night with wine or anytime.The price was right but this really isn't a 5 star hotel...it goes downhill after lobby and friendly staff. More a 3-4 star.", "title": "You Can Do Better...But Location & Staff Are Excellent", "user": "Thomas S", "date": "November 22, 2011", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 4.0, "sleep": 1.0, "rooms": 2.0, "location": 5.0}, "id": 120928991}, {"rating": 3.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "We recently stayed at the Claris Hotel in Barcelona. Convenient location, beautiful lobby, but rooms and amenities are not 5-star quality. Only hotel we stayed in during our 2-week, 6-city vacation in Spain and Portugal that charged for wifi. Bright lobby but rooms are dark. Noisy--could hear adjoining rooms and halls. Bathroom with 2 sinks but shower floods bathroom. Heat did not work--staff had to bring us a space heater. Disappointing for a 5-star hotel.", "title": "Disappointing", "user": "Susan M", "date": "November 15, 2011", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 120641385}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled with friends", "text": "Just returned from our 4 day stay in Barcelona and at the Claris. Couldn't be happier with the service of the more than accomodating staff, particularly Bilianna, the concierge. She went over and above in helping us to make the most of our limited time in the city. The hotel was very conveniently located just a block from a major street, but without the noise and hustle, bustle that would accompany such a location. The room was clean and spacious and offered a window that actually opened! The morning buffet breakfast was more than adequate with choices of hot meals prepared per your request. In all, a wonderful hotel in a exciting city.", "title": "CONVENIENT LOCATION", "user": "JRM1860", "date": "November 14, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120586926}, {"rating": 5.0, "stay_parameters": "Stayed September 2008", "text": "We stayed at the Claris before doing a Butterfield & Robinson bicycle trip in Barcelona.", "title": "Best of Barcelona", "helpfulness": 2, "user": "Paud", "date": "October 12, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 20825554, "likes": {"liked": "— location and the staff", "disliked": "— nothing!"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "We found the location and the ambience sensational. Breakfasts were lovely. The concierge, Emma del Valle, was terrific in making dinner reservations and suggestions. It was truly a memorable experience.", "title": "A special experience", "user": "SydneyBessie", "date": "October 4, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 20607272, "likes": {"liked": "— The special decor", "disliked": "— the breakfast room"}}, {"rating": 1.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "This is a very unusual hotel - full of beautiful and atmospheric antiquities in an artistic and comfortable modern interior.", "title": "Oh dear........................", "helpfulness": 4, "user": "Liam O", "date": "September 9, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 3.0, "value": 2.0, "location": 5.0, "rooms": 1.0}, "id": 19913737, "likes": {"liked": "— Staff and location", "disliked": "— everything else"}}, {"rating": 3.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "It was very special to stay in a spacious suite and share this with a large ancient Thai sculpture.", "title": "5 star?????", "user": "freqtraveller29", "date": "August 20, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 5.0, "value": 3.0, "location": 5.0, "rooms": 3.0}, "id": 19147326}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled with friends", "text": "The rooms are in need of refreshing a little but are very comfortable as they are.", "title": "Fantastic Hotel +++++", "user": "Littlesean", "date": "August 19, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 19109099, "likes": {"liked": "— Everthing", "disliked": "— Nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "Stayed 5 days 6-11 july -08 in a Duplex Suite. It's my 4th stay at this hotel but unless there is an overall improvement I doubt will be a 5th time. The décor is not bad, art deco style, and rooms are comfortable. Bathrooms are bit run down but they are good in size. I’ve previously stayed in Duplex Suite and been satisfied but unfortunately this time had a room towards c/ Pau Claris and noise was disturbing. All Duplex suites are on 2nd floor. Agree with previous comments it is really poor the hotel charge for use of wireless internet. Previous occasions front desk staff including concierge have been helpful and service-minded, but this time must say they all seemed dull, tired, uninterested and not motivated (except the concierge Monday evening). The roof top terrace is very nice with its swimming pool although not enough sun chairs and, again, service is pretty poor (used to be much better). The gym is a joke. Machines which are out of date and useless.The air-condition didn’t do any help so it became impossible to stay in the room. Food and drinks at the hotel are ok, but I don’t think worth the price. Location is pretty good for shopping but not so good for the beach which is far away. This hotel needs to shape up in order to compete with the rising stars in Barcelona!", "title": "Need to improve!", "helpfulness": 2, "user": "pelun", "date": "August 18, 2008", "detail_rating": {"front_desk": 2.0, "business": 1.0, "service": 2.0, "cleanliness": 3.0, "value": 4.0, "location": 3.0, "rooms": 4.0}, "id": 19066108, "likes": {"liked": "— Room and terrace", "disliked": "— Street noice and service"}}, {"rating": 3.0, "stay_parameters": "Stayed July 2008, traveled with friends", "text": "I share the view of someone else who noted this was the least favorite hotel on a two-week stay in Spain. We spent the longest time in Barcelona, and we loved the city. But we were really disappointed with the Claris. The location is great and the public spaces ok, but we had booked a junior suite to get more space, and it was really dark (inner room) and the furniture was definitely showing its wear. We asked to be moved but apparently nothing else was available the first two nights and after that it was too much trouble to move. While the staff was pleasant, they had a bit of attitude and were pretty bad on directions or recommendations. They did send us to a fabulous tapas bar the first day, just a few blocks away.", "title": "A disappointment", "helpfulness": 1, "user": "luxlovernyc", "date": "August 14, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "location": 5.0}, "id": 18965342, "likes": {"liked": "— Location", "disliked": "— Dark, somewhat dingy room. Lack of seating and shade around pool."}}, {"rating": 2.0, "stay_parameters": "Stayed August 2008", "text": "As for the pool, although small, it was adequate for cooling, but the main problem, as with every hotel we stayed in, was that the seating was lacking and there was NO shade, a real problem in July when the sun was brutal.", "title": "Wanted to enjoy the Claris but didn't", "helpfulness": 2, "user": "arutun", "date": "August 8, 2008", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 3.0, "cleanliness": 3.0, "value": 2.0, "location": 3.0, "rooms": 3.0}, "id": 18744610}, {"rating": 4.0, "title": "Eixample location is great", "text": "Overall, it was not a five star experience, and if I went back (as I hope to), I will choose a different hotel.", "user": "bkmiamibeach", "date": "July 5, 2008", "id": 17551824}, {"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "Do not be fooled by the \"5 stars\" in the title of this hotel. This is far from 5 stars. As I sit here in our room waiting, waiting, waiting for reception...they seem to tell you everything you want to hear but are never quite able to deliver.", "title": "Not really 5 Star, pretty loud, very stylish", "helpfulness": 2, "user": "DTimberLD", "date": "May 28, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 16478352, "likes": {"liked": "— Overall modern luxury feel", "disliked": "— Noisy room"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled on business", "text": "I stayed here whilst at a meeting in Barcelona. The location is great being just one block off the Paseig de Gracia and hence only two blocks from the metro. The hotel itself has been constructed within an older building and the architecture is very interesting. The hotel is built around a central atrium. The front lobby is very arty with various glass and water features. The public areas were generally of a high standard.", "title": "Good, 4.5 star - not quite 5 star", "helpfulness": 1, "user": "Superdocuk", "date": "May 17, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 16136574, "likes": {"liked": "— Location", "disliked": "— Lack of hotel facilitites"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2008", "text": "The front desk were very friendly and helpful. My room was on the fifth floor - the lifts are very small, glass affairs. The furnishings were to a high standard in the room. The bedroom and separate bathroom were spotlessly clean. It did suffer majorly from having only one small window which was set a one end of the room and opened out onto the internal atrium. This meant that little natural daylight got into the room. The toileteries were ample and of good quality.", "title": "Location, Service, Ammenities", "user": "eab0895", "date": "April 15, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 15057311, "likes": {"liked": "— Location", "disliked": "— Twin beds too close togethere"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "Breakfast was served in the basement - so no daylight there either. The room I found to be featureless and devoid of atmosphere. It started serving at 07:00 which is quite late for business people. The choice was reasonable and the presentation faultless. I have had better breakfasts in Spain, but I have had many worse.", "title": "\"Don't Believe the Negative Reviews - A Wonderful Hotel\"", "helpfulness": 1, "user": "VAEnglishteacher", "date": "April 5, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 14818714, "likes": {"liked": "— location, staff", "disliked": "— lack of free internet access"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "There is a pool on the roof but this is much smaller in reality than the hotel website photographs would suggest - so be warned you won't being doing traiing laps here. There is a bar beside the pool and another small one on the ground floor.", "title": "Fantastic Service", "user": "Lizzy36", "date": "March 26, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 14544629, "likes": {"liked": "— The location and the staff", "disliked": "— Small rooms"}}, {"rating": 3.0, "stay_parameters": "Stayed January 2004", "text": "Overall this is indeed a luxury hotel but I am not sure it meets UK 5 star standards, mainly due to the lack of amenities. It is a moderate sized, boutique-type hotel rather than your large scale Mariott or Hilton.", "title": "Good location, particular rooms.", "user": "quattromonti", "date": "March 25, 2008", "detail_rating": {"front_desk": 4.0, "service": 3.0, "business": 2.0, "cleanliness": 3.0, "rooms": 4.0, "location": 4.0}, "id": 14530174}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "16-19 July Suite number 622", "title": "Keep returning...", "helpfulness": 1, "user": "pelun", "date": "December 9, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 121563154}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "WIFI AT A (HIGH) CHARGE", "title": "Good, but rooms not the best", "helpfulness": 2, "user": "awesometraveller05", "date": "December 4, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 121374480}, {"rating": 5.0, "stay_parameters": "Stayed November 2011", "text": "Booked through Small Luxury Hotels and was triple upgraded to a suite (nice)! Stayed many time at the Claris. Like the location and love their rooftop pool and terrace. Staff professional, friendly and service minded (not the standard feature in Barcelona). Even though bedrooms are nicely decorated and comfortable, they need to be upgraded. In particular the bathrooms which also tend to be a bit small (even in the suite). Rooms on the lower floors facing the street are a bit noisy so I stay away from them. But Claris has its charm, you get what you expect and most often also at a very decent price. Don’t expect W or Mandarin Oriental, but the quality and service is still more than adequate with a third of the price tag from the hotel mentioned. BUT why no free wifi???", "title": "Good. A rating.", "user": "Qrottyspj", "date": "December 3, 2011", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 121361238}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "Good location, quite small rooms and EXTREMELY hard beds! Pool and balcony were very nice, but pool can only fit about 3 or 4 people in it at a time. Very good service but VERY pricey!!!!", "title": "Great location, great value, stylish and comfortable", "helpfulness": 2, "user": "ChicagoTraveler017", "date": "December 3, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 121350981}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled on business", "text": "Overall very good.", "title": "Personal Letter....", "helpfulness": 1, "user": "DajanaS", "date": "December 3, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121342366}, {"rating": 3.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "Other reviews here note most of the positives and negatives.. Good location and nice lobby. Everything else at the hotel -- room, service, ammenities -- was just ok but nothing special.", "title": "Just OK", "user": "jim m", "date": "November 9, 2011", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 120403203}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled with family", "text": "We just completed out first trip to Barcelona. We stayed at the Claris. We were alittle unsure of our bearings as we had never visited this city. The Claris was perfectly located. It was a nice, quiet neigbothood and within walking distance of everything. We were able to walk to the Rambla and Placa de Catalunya. Also walked to the Cathedral and the old town area. Goudi house also within walking distance. Hotel upscale. Room was clean and very nicely equipped. Beautiful rooftop bar and restaurant. Food was excellent but a little expensive. Staff can arrange anything you need like transfers to airport. Taxis right outside the door. Shops close by. All in all-perfecC", "title": "Beautiful hotel and location", "helpfulness": 1, "user": "annekins", "date": "November 7, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120266979}, {"rating": 3.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "I give this hotel 3 stars because of it's proximity to cultural attractions (5 minute walk to La Pedrera and Passieg de Gracia). That is a definite plus. You feel the upscale nature of the hotel when you walk in the lobby; it's very modern and bright. However, the rooms are tiny and dark, so it is not a hotel you want to laze around in. The pool on the roof is just okay, there is nothing fancy or especially inviting about it. Also, internet is an extra charge, about 15 Euro a day, which is always something that surprises me in a nicer hotel. When I go back to Barcelona, I will probably stay somewhere else, I don't think this is worth the money.", "title": "Location was great, lacked character", "helpfulness": 1, "user": "Julie P", "date": "November 7, 2011", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 120263268}, {"rating": 3.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "My girlfriend and I visited Barcelona nov 2010. Hotel Claris in general was very nice however we felt it was more 4 star than 5 star.", "title": "Overall good location and service, not 5 star quality", "helpfulness": 3, "user": "KSV_8", "date": "November 5, 2011", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 1.0, "rooms": 3.0, "location": 4.0}, "id": 120201012}, {"rating": 1.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "Service was good, staff were accommodating and welcoming, however the room seemed to lack 5 star quality. It was not entirely clean and the bed was extremely uncomfortable, in fact i found 'premier inn' had better quality beds.", "title": "Don't bother booking at this hotel!", "helpfulness": 4, "user": "Bumpyone", "date": "October 31, 2011", "detail_rating": {"service": 3.0, "cleanliness": 1.0, "value": 2.0, "sleep": 1.0, "rooms": 1.0, "location": 4.0}, "id": 119958794}, {"rating": 5.0, "title": "A cool Hotel", "text": "The hotel has very nice rooms. The Roof Terrace restaurant was fab and the evening entertainment by the pool was really laid back, fun and chilled out. Generally good service and pleasant staff. A friend told us to check out the hotel online at TabletHotels and we were so surprised to find this fantastic site filled with the most amazing boutique hotels. The site was so easy to navigate through and there was so much information on this hotel and others that we already have our next vacation planned. I would certainly come back here again.", "helpfulness": 17, "user": "Leslie T", "date": "August 30, 2005", "id": 3816409}, {"rating": 2.0, "stay_parameters": "Stayed August 2005", "text": "I would agree with all the negative comments and wish I had heeded them.", "title": "Dark and Noisy", "helpfulness": 13, "user": "renelle06", "date": "August 15, 2005", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "rooms": 1.0, "service": 1.0}, "id": 3767340}, {"rating": 5.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "We overnighted at the Claris Hotel recently following a cruise. Despite arriving mid-morning, the excellent front-desk staff were able to give us a room immediately.", "title": "Beautiful design and convenient location", "user": "GeorgeTO", "date": "March 11, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 26030025}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "The hotel has a very modern, elegant interior with a glassed-in waterfall feature, visible from the glass elevators. There is a small gym and pool on the top floor. A display of Egyptian artifacts is on the first floor, where the restaurant is located. The hotel offers free admission to the Egyptian museum 1/2 block away.", "title": "I love this place", "user": "dionne2010", "date": "March 6, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 3.0, "service": 5.0, "rooms": 5.0}, "id": 25687391}, {"rating": 5.0, "stay_parameters": "Stayed February 2009, traveled with family", "text": "The room we were given was a bit worn (scuffed hardwood floor), but very clean. The bathroom had double sinks and a tub/shower combination, and a nice amenity kit. Robes and slippers were also provided. Wireless internet is available for 10 euro per day, but as we were there for just the one night, we used the computers in their business centre instead.", "title": "Loved the Claris Hotel", "user": "sej904", "date": "February 26, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 25211284}, {"rating": 2.0, "stay_parameters": "Stayed February 2009, traveled on business", "text": "Our major quibble was the noise in the room at night. There is a bit of street noise, and a noticeable gurgling sound that was probably coming from pipes in the wall. This can be a problem if you are a light sleeper. We also could not get the LCD television to work, but were not in the room long enough for this to be more than a slight annoyance.", "title": "Not A Five Star Hotel", "helpfulness": 1, "user": "AAflyerSeattle", "date": "February 22, 2009", "detail_rating": {"cleanliness": 5.0, "value": 1.0, "location": 5.0, "service": 4.0, "rooms": 2.0}, "id": 24930017}, {"rating": 2.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "The location of the hotel is very convenient, near the centre of the Eixample area attractions and shops. We were satisfied on the whole with the accommodations, particularly as we booked a good promotional rate on the hotel's website. The overall feeling we got was that design here won over function.", "title": "old tired 5 star", "helpfulness": 1, "user": "darrenlikestotravel", "date": "November 25, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 2.0, "location": 4.0, "rooms": 1.0}, "id": 22160676, "likes": {"liked": "— Location", "disliked": "— tiredness"}}, {"rating": 5.0, "title": "Fantastic", "text": "The rooms are very small - even a junior suite is not large enough for three people. Two people cannot pass between the bed and the wall!", "helpfulness": 9, "user": "A TripAdvisor user", "date": "July 21, 2005", "id": 3689228}, {"rating": 4.0, "stay_parameters": "Stayed April 2005", "text": "Noise - yes, you can hear between the walls easily. If someone coughs in the next room, you will hear it in your room. This is especially true in the anteroom of the suites.", "title": "beautiful decor", "helpfulness": 7, "user": "skiierboston", "date": "June 5, 2005", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "service": 4.0}, "id": 3530047}, {"rating": 4.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "Like previous reviewers, we are mystified by the 5 star accolade.", "title": "More of the same", "helpfulness": 10, "user": "DeeEmm", "date": "September 19, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 5.0, "rooms": 3.0}, "id": 5817237, "likes": {"liked": "— location", "disliked": "— price"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2004, traveled on business", "text": "The location is excellent and we too found the staff exceptionally good.", "title": "Great rooftop pool!", "helpfulness": 4, "user": "CheltenhamLady", "date": "August 21, 2006", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 5637900, "likes": {"liked": "— Rooftop pool and bar", "disliked": "— Small rooms"}}, {"rating": 3.0, "stay_parameters": "Stayed August 2006, traveled with friends", "text": "Our room, although quiet at the back of the hotel, had a grim view. The decor was well maintained if a bit odd colourwise. The bathroom was OK - good size and well equipped.", "title": "Definitely not a 5-star", "helpfulness": 6, "user": "Coluche105", "date": "August 14, 2006", "detail_rating": {"front_desk": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 4.0}, "id": 5609496, "likes": {"liked": "— Rooftop pool and fitness room", "disliked": "— Lack of 5 star service"}}, {"rating": 5.0, "title": "Loved the hotel and its location", "text": "From the moment we walked thru the lobby everyone was welcoming, warm and friendly. The room was great (except the internet connection never worked from the room). I especially loved how helpful Pau at the front desk was. His restaurant and other suggestions were greatly appreciated. The location of the hotel is perfect for all the Gaudi sites. We would definitly return to the Claris.", "user": "Janice K", "date": "October 26, 2011", "id": 119762529}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled on business", "text": "Wonderful location for Barcelona. Great room -- we had a suite with it's own sauna. Didn't get a chance to use it -- too busy enjoying the city. Very good breakfast buffet. Only complaint is that wifi connection was very poor. Very helpful staff -- gave great recommendations for shopping and services in the area.", "title": "Great Hotel - we would stay here again.", "user": "natk4", "date": "October 26, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119738050}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "We stayed at the Claris for 5 nights in October. The room was excellent - very quiet, clean, turn down service every night. Although we got to the hotel early, our room was ready and we were able to check in. The concergie services were good, and we got a dinner recommendation almost every night we were there as well as other recommendations. The breakfast was wonderful, very fresh and an ample supply of food. We loved the location of the hotel in a quiet area of the city and walkable to everything, but definately not in the center near all the action of the Ramblas. We would definately stay here again!", "title": "Overall excellent hotel", "user": "harlady", "date": "October 25, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 119735038}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "We stayed at the Claris Hotel for 4 nights recently as we discovered Barcelona. The location was outstanding and within easy walking distance to all of the major sites.", "title": "Beautiful Hotel, Terrific Service and a fabulous location", "user": "CartQueen61", "date": "October 13, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 119268147}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "The roof top restaurant was lovely for a late evening drink. The food pricing was a bit high for the quality of it - and it is better to experience Tapas in the local restaurants.", "title": "Great Location, Service and Staff (what else you want??)", "user": "Tjunoon", "date": "October 11, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119200395}, {"rating": 4.0, "stay_parameters": "Stayed April 2006, traveled as a couple", "text": "My husband and I stayed in the Claris in April this year, to celebrate our wedding anniversary.", "title": "not 5 star but....", "helpfulness": 10, "user": "colant", "date": "December 10, 2006", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 5.0}, "id": 6358201, "likes": {"liked": "— loccation", "disliked": "— expensive bar prices"}}, {"rating": 1.0, "stay_parameters": "Stayed October 2006", "text": "The hotel is perfectly situated to explore Barcelona on foot, and a two minuite walk to the nearest tourbus stop.", "title": "Be carefull with 5 Stars in Barcelona", "helpfulness": 7, "user": "There_&_Back_Again", "date": "November 22, 2006", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 1.0, "cleanliness": 3.0, "value": 1.0, "location": 5.0, "rooms": 1.0}, "id": 6164624}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "Our room was more than adequate for our needs, with a lovely bathroom with excellant shower. A particularly nice touch was complimentary aromatherapy bath oil delivered to our room on the first night.", "title": "We found a winner!", "helpfulness": 11, "user": "DanaeT", "date": "November 16, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6136786, "likes": {"liked": "— the ambiance", "disliked": "— there was a bit of noise from the neighbouring room, but it didn't go on all night"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "The downside of the room was that the double bed was actually two singles joined together, not particularly romantic!", "title": "a gem of a hotel", "helpfulness": 10, "user": "janetjoel", "date": "November 7, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 6082902, "likes": {"liked": "— location, cleanliness, spaciousness of room, friendliness of staff"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2003", "text": "While it was a bonus to have a rooftop pool, the view was rather disappointing.", "title": "The Claris Hotel, Barcelona", "helpfulness": 18, "user": "mikie12", "date": "September 22, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 5.0, "rooms": 4.0}, "id": 5826392}], "location": {"country": "Spain", "region": "Catalonia", "continent": "Europe"}, "stars": 5, "variance": {"poor": 38, "average": 102, "very good": 220, "terrible": 20, "excellent": 274}, "aka": "Hotel Claris Barcelona", "slim_ranking": 0.170825335893, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.5}, "description": "This hotel in the centre of Barcelona is ideal for a few days of relaxation or work. Boasting comfort and high-quality service, the hotel enjoys the best location for discovering Barcelona and taking advantage of all the tourist and leisure activities the city has to offer"}