{"user_rating": 3.5, "review_count": 643, "name": "Clarion Collection Neptun Hotel", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled with friends", "text": "Excellent situation with easy access to metro for the airport. Very clean hotel but go for the superior room as standard rooms very small. Excellent breakfast and bonus of evening buffet so no need to spend extra on eating out. Tea/coffee available all day.", "title": "location location location", "helpfulness": 4, "user": "Zoe080", "date": "November 9, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 145041968}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled with friends", "text": "Copenhagen card worth buying as includes transport out to Rosskilde for the viking museum.", "title": "great location", "helpfulness": 2, "user": "RunnerBeanBristol57", "date": "November 9, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 145021640}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled solo", "text": "Clean and welcoming hotel which we would go back to again. The reception rooms can be used at any time for tea/coffee which is free. The breakfast set you up for a days sightseeing without needing a lunch stop.The light evening buffet was more than enough to eat- even for a vegetarian. It always included soup and as much lovely bread as you wanted, the salads were substantial with rice, patsa, cous cous ,cheeses,salads etc and the hot choice was usually meat based. As Copenhagen is expensive this kept the costs down.", "title": "Weekend in Copenhagen", "helpfulness": 3, "user": "decdeasy", "date": "November 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 145007575}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "Location-right in the centre only 1 minute from Nyhavn and 5 minutes from the metro stop. Efficient fast metro from the airport included in the 72 hour Copenhagen card which keeps down the cost of all travel and entry to museums etc.", "title": "Brilliant location and value for money", "user": "PlymouthJoeyA", "date": "November 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 144870792}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "The only drawback with our small double standard room was that it opened onto an enclosed atrium so fresh air was limited and we had to turn on the air conditioning in October. However our friends stayed in a larger superior double with outside windows.", "title": "Best hotel for value and comfort", "user": "ginnyyoga", "date": "November 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 144609089}, {"rating": 4.0, "stay_parameters": "Stayed November 2012", "text": "We spent four nights at the Neptun and could not recommend it enough. It is in a brilliant location, just behind Nyhavn, on a beautiful quiet square. The streets around are a delight of small, independent shops and restaurants. The hotel is minutes from the metro at Kongens Nytorv, the 10 a bus stops nearby and takes you on a delightful tour of the city. Our room looked out over the square, and though small was very comfortable. The staff are friendly and helpful. The breakfast buffet was fantastic , but the hotel goes the extra mile with unlimited tea and coffee all day, cake at tea time and a lovely light buffet at night. All in all ten out of ten!", "title": "Wonderful, wonderful Copenhagen and the Hotel Neptun!", "helpfulness": 4, "user": "JeanneAlbi", "date": "November 28, 2012", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 146349127}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled on business", "text": "I have stayed in this Hotel several times since 1997, a perfect location and great value for money. I have always been made to feel \" at home\"", "title": "Always return", "helpfulness": 2, "user": "kevinbenton", "date": "November 27, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 146282292}, {"rating": 2.0, "stay_parameters": "Stayed November 2012, traveled on business", "text": "Good rooms, albeit a tad on the small side but that is not unusual in Scandinavia.", "title": "Friendly, but lousy.", "helpfulness": 1, "user": "Alex P", "date": "November 19, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 2.0, "sleep": 1.0, "rooms": 2.0, "location": 4.0}, "id": 145770584}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "Look forward to YOUR visit", "title": "Top Hotel in Copenhagen", "helpfulness": 3, "user": "Viktor K", "date": "November 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 145127804}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "We stayed at Clarion Neptune Hotel only one night and we regret our choice. The bedroom area was rather small and the shower/toilet is really tiny. It felt even tinier, because the door was opening into the bathroom. The bathtub (also meant for shower) was very slippery due to its rounded bottom, so one had to consider every movement when taking a shower. It was also impossible to sleep at night - the air-ventilation system was so noisy, it kept me awake all night (in addition, it started making strange ticking sounds around 4 in the morning). Let alone uncomfortable beds with strange-sized pillows (one was unreasonably big, and the other - really small).", "title": "Great Hotel", "helpfulness": 2, "user": "Peebee64", "date": "November 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 145100041}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "Hotel very central and easy to find, we caught the metro from the airport and were able to walk to the hotel pulling our luggage. Room was small but very clean, the bathroom was nice, shower over the bath but was a good size and perfectly adequate. Breakfast and dinner were included, dinner was fairly ordinary but after a 24 hour flight it was very convienient not having to find somewhere to eat. Staff on the front desk were very friendly and helpful and despite being really busy were happy to organise taxis for the many people (including ourselves) wanting to go to the port to meet the Emerald Princess cruise ship. All in all we thought the Neptun was good value.", "title": "Central Location, easy to find", "helpfulness": 2, "user": "Kiwi678", "date": "October 9, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 142436517}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "We spent a Saturday night here and then 2 weeks later a Sunday night. We had booked an economy room each time. The rooms are very small. Room 515 was very nicely appointed but the bathtub was under a low ceiling, image showering sitting in the tub and hard to get out of. Room 410 was small and the shower was simply part of the bathroom, meaning the floor got wet. The light evening meal was salad and chicken legs one night and salad and meatballs the other night. The location and the staff was perfect! I do plan on staying again next year.", "title": "Perfect location", "helpfulness": 2, "user": "Rob1eddy", "date": "October 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 142046796}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "We stayed in this hotel for 2 nights. Hotel may not be 4-star by North American or Asian resort standard. We have stayed in other much worse shape 4-star European hotels. House keeper only provided 2 bath towels and 2 face towels and no floor mat. We stayed in room 424. The room does have Air cooler, see photo. There was no remote control for temperature, fan speed, pan and swing. It cool the room down significantly. In the old days, the plumbers and electricians do not always put user interface as their primary concern. They would install things at their convenience. Fixtures, power switches, toilet, shower and sink may not be in the ideal place. We must shower very carefully in order not to splash too mush water on the floor. As shown in the picture, when I sat on the toilet, my right shoulder rubbed against the wall. Toilet paper was almost out of reach. I am not complaining. I just tried to say when I design something, I would visualize myself as the user first.", "title": "Nice and cool", "helpfulness": 2, "user": "Stag88", "date": "September 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 141680322}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "Hotel staff was excellent and friendly. We asked the front desk to call a taxi to cruise port. She told us that rate would be 200Kr. The driver showed up within 5 minutes. He entered a fix fee of 180Kr. We gave him 200 anyway. It was a short drive. Taxi from airport to hotel trip was much longer and the fee was 265Kr.", "title": "Beautiful, centrally located hotel", "helpfulness": 2, "user": "onthegoCincinnati_OH", "date": "September 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 141677436}, {"rating": 4.0, "title": "Great place!", "text": "We stayed for one night post-cruise and were happy to be able to walk everywhere from this location. From the airport, we took the Metro to the Nytorv stop and walked only a few blocks to the hotel. We were able to walk to the Town Hall and Tivoli along the Stroyet and we walked in the other direction to Rosenborg Castle, Amalieborg Palace and the Little Mermaid. The breakfast and dinners were not exciting, but served in a lovely setting and so convenient. The desk called a taxi for us to travel to the ship and it was there in less than 5 minutes. All in all a great experience.", "helpfulness": 3, "user": "Jacnmel", "date": "September 26, 2012", "id": 141346073}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled with friends", "text": "This hotel is a little gem, great & helpful staff. Good breakfast with good selection for the hungry traveller. The triple room was big enough for our 2 night stay with adequate case space and room to move. The Location is just the best possible, for the sightseeing tourist, within a 150mts of the Danish Royals palace....around the other corner is the Nyhavn Harbour, with lots of good eating houses, and just as beautiful as the photo's show...easy walking around Copenhagen to the little mermaid and the Tivoli Gardens.", "title": "Location,Location & more", "user": "MJT111", "date": "November 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 144401697}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "Spent three nights in October 2012. Selected superior room. Size and features were good (safe, wifi, computers/printer, refrigerator), decorating not so good. Great breakfast and really quite good dinner offerings (pasta one night, chicken lags another and lasagna the third). After touring all day, we chose to eat in each night as the selection was adequate and much easier than going out again. In addition, prices in Copenhagen are about double US prices, so this represented real value. The hotel is an accumulation of old buildings combined into one property with small steps (2-3 are common) connecting various levels. Some rooms open onto enclosed patio where meals are served, while others open to street. We had street side and would certainly choose the same again for ventilation and privacy. No AC, but not needed during our stay.", "title": "Good choice", "helpfulness": 1, "user": "RL-Chicago", "date": "October 18, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 143102716}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "I noticed several hotels in Copnehagen had been given poor reviews due in part to unfriendly reception staff. We had quite the opposite experience with recection staff at Neptun - welcoming and friendly and very helpful indeed. Room cleaner was lovely and worked quickly and to a hgig standard and waiting staff in the dining area were extremely helpful.", "title": "GREAT value for money and perfect location", "helpfulness": 1, "user": "Christopher S", "date": "October 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 142965429}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "The hotel location is best in Copenhagen, situated in Nyhaven and near metro, shopping and waterfront amenities in nice residential area. Rooms were immaculately clean and quite roomy indeed as well as very comfortable. The breakfast was a very substanical buffet with good choices and the evening \"light buffet\" was more than adequate offering choice to guests. Overall, a very good experience and excellent value for money compared with other hotels in the area.", "title": "Perfect location", "helpfulness": 4, "user": "Florence H", "date": "October 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 142546889}, {"rating": 1.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "We spent three nights in this hotel, arriving very easily by metro from the airport. The hotel is about five to ten minutes walk from the Kongens Nyrtov metro station.", "title": "No heating in bathroom", "user": "lbkb436", "date": "October 11, 2012", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 1.0, "location": 5.0}, "id": 142534981}], "location": {"country": "Denmark", "region": "Zealand", "continent": "Europe", "city": "Copenhagen"}, "stars": 3.5, "variance": {"poor": 46, "average": 141, "very good": 259, "terrible": 47, "excellent": 150}, "aka": "Clarion Hotel Copenhagen", "slim_ranking": 0.247706422018, "detail_rating": {"service": 4.0, "cleanliness": 3.5, "value": 4.0, "sleep": 3.5, "rooms": 3.5, "location": 4.5}}