{"user_rating": 4.0, "review_count": 490, "name": "Clarion Suites Maingate", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled on business", "text": "Great value and location. Close to WDW with lots of family friendly places within walking distance of the hotel. Room w/one king and a sofa was spotless and fine for two. The pool was good and the 2-for-1 drink coupons were a nice bonus.", "title": "Great value!", "helpfulness": 1, "user": "JohninDC", "date": "March 30, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7254672, "likes": {"liked": "— Cleanliness of room and property.", "disliked": "— Noisy A/C"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2007, traveled solo", "text": "I stayed 3/19-3/24/07 and was pleasantly surprised by the hotel and location. I must stress location! Within walking distance there is a Cracker Barrel, Carabbas Italian, TGIF Fridays, Dairy Queen and a small strip mall with a food market! The hotel is surrounded by nice sidewalks and I never felt unsafe even walking around at night. The suite was alittle disappointing because it is one room; the living area was separated by a half wall. There is only 1 TV so you could not watch TV in the \"living area\". The room was very clean and freshly painted. The bathroom was large with plently of counter space. Plently of towels too. In the bedroom area was the refrig & microwave. The coffee maker was in the bathroom. I was disappointed in the number of drawers for clothing: only 3 drawers! If you had alot of people you would have to live out of a suitcase. The beds were very comfortable and each had 4 pillows. The rooms were quiet from any outside noise; the only noise was the A/C unit. Even on low it was somewhat noisy. Not good for light sleepers! The pool area was fine; they have a bar open during the evening. The breakfast room was ok; small and noisy when full. They had cereals, juices, waffles, pastries etc. I only used it for coffee and a bagel. We walked over to Cracker Barrel for the best breakfast. If on a budget you can make do with the hotel's breakfast. The front desk staff was fairly friendly; they just did their jobs and that is all. All in all a good experience !! Great location!! ( Note: The other Comfort Suites by Old Town is way in the back and is isolated. Nothing in walking distance other than Old Town.) My advice: Stay at this location!! Plenty of open space!", "title": "Great Location! Recommended!", "user": "Hotelwarrior", "date": "March 25, 2007", "detail_rating": {"cleanliness": 4.0, "front_desk": 3.0, "location": 4.0, "value": 3.0, "rooms": 4.0}, "id": 7220250, "likes": {"liked": "— Location", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled with family", "text": "This hotel is awesome! My family of 5 stayed here from 3/6/07-3/16/07 and were very comfortable. Brand new modern bedding. (the pictures do not do this hotel justice) The pool was awesome! This hotel is very clean. You can tell management takes pride in keeping everything in tip top shape. The staff was friendly. On top of that you get a FREE breakfast. Hard boiled eggs, mickey mouse eared shapped waffles, cererals, fruites, donuts, bagles, toast and more!! I have stated at 4 star hotels who have not messured up to this one. I think it is right up there.", "title": "3/6/2007", "helpfulness": 2, "user": "micheletwo", "date": "March 17, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7179492, "likes": {"liked": "— Clean and great value", "disliked": "— There is not one thing I could say"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "The motel was great. The room was very clean, the courtyard area was beautiful, and breakfast was offered every day. We had a refrigerator and microwave, room safe, sofa bed, and table and chairs. The bathroom was very large - only thing I would change is I personally like a sink outside the bathroom but that's just me.", "title": "Would stay there again", "user": "leisuretraveler74", "date": "February 27, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6849474, "likes": {"liked": "— Very clean"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "I would gladly stay here again. We were treated very well and had no problems. Area is fairly quiet - no traffic noises. Restaurants and shopping are within walking distance.", "title": "Nice room for a good price", "user": "travelwanderer", "date": "February 6, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 6751360, "likes": {"liked": "— Price and location", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "We traveled all over Florida in August and this was by far the best hotel of our stay! Rooms are large, very clean, comfortable, and the area was very safe. Rooms include a programmable safe, compact refrigerator, coffeemaker, sofa(bed), etc. We were on the second floor and did not have any noise issues whatsoever. The pool was huge and very clean! They also had a kiddie pool with a mushroom waterfall, and a hot tub that I never visited. My kids went back and forth from the kiddie pool to the large pool (right next to each other), and had a great time. The large pool was heated and very comfortable. We did NOT come for Disney, which was great, because we practically had the pool all to ourselves during the daytime! The only downside was that the breakfast area (though HUGE) was extremely crowded. It was a madhouse. At any given time during breakfast hours there were over 100 people in the breakfast area! The hotel could use more staffing for breakfast because the poor guy filling the stations could not begin to keep up! It doesn't help when selfish people (with no social manners whatsoever) hold up lines for 15 minutes while they make 6 waffles for their entire table!!! I also witnessed people grabbing fruit out of the employee's hands as he brought it out and tried to replenish the supply! People's manners are not the hotel's fault; however, if the staffing and supply had been adequate there would not have been so much chaos. I would highly recommend this hotel! (Just plan on eating at 6:30 a.m.! before it gets crowded!)", "title": "Wonderful stay! Clean, economical, safe!", "helpfulness": 4, "user": "KitKatluvr2", "date": "August 22, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 5687640, "likes": {"liked": "— cleanliness", "disliked": "— fighting for food at breakfast"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2004", "text": "We stayed in August 2004. The pool area was clean. Plenty of towels and lounge chairs. Our daughter loved it! Breakfast was more than adequate. We never ate out once for breakfast-a nice money saver! It is a very small room to eat in and it can get crowded, but get there early and you'll have no problem finding a table. Getting to WDW was no problem if you left early to avoid any traffic. It took maybe 10-15 min. most cases. The shuttle was not very flexible. Use your own car or a rental if you want the freedom to come and go at your own schedule. The nearby shopping center was very convenient: grocery store, Subway, etc. in walking distance. I booked the room online for great rate of $69 per night ! Well worth it!", "title": "Good Location and good for the money!", "helpfulness": 4, "user": "tootersue", "date": "June 23, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 5376283}, {"rating": 4.0, "title": "Great Stay", "text": "Hurricane Charley arrived at the tail end of our trip. The staff was very accomidating. The hotel was at over 100% capacity due to people evacuating to the hotel, but it was managed well. After the hurricane, we had to pack to leave which was a bit inconvenient being on the top floor. No elevator until an inspector could officially O.K. it to be used afterward. The pool was shut down due to storn debris. The hotel was not at any fault for these things. It was a hurricane!", "helpfulness": 9, "user": "A TripAdvisor user", "date": "June 11, 2006", "id": 5330664}, {"rating": 5.0, "stay_parameters": "Stayed May 2004", "text": "I would definitely return. It was well worth the money. If you're traveling during hurricane season, try to get a first floor room just in case!", "title": "we loved this hotel", "helpfulness": 10, "user": "elcatto", "date": "May 22, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 3.0, "service": 5.0}, "id": 5191510}, {"rating": 4.0, "stay_parameters": "Stayed May 2006", "text": "we just returned from a 5 night stay. The kids loved the pool (they even give you pool towels along with bath towels), the husband loved the bar at the pool, I loved the whole thing. The rooms were spacious and clean. There were two security guards that we saw, and cameras in the hallways. There is a guest laundry on the second floor, which came in handy. The breakfast room was small, but they have tables set up outside so you can eat there if it is too crowded. The location was excellent, the plaza next door has everything you need. We drove to the parks and even with traffic it didnt take more than 10 minutes. The only negative thing about the trip had nothing to do with the hotel. There is alot of construction in the area and it makes it kind of hard to navigate, especially if you don't know where you are going. All in all it was a great stay and I wouldn't hesitate to stay again.", "title": "Great hotel for 6 people/room", "helpfulness": 5, "user": "wendyton", "date": "May 17, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 5146563}, {"rating": 2.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "After reading the reviews here on Tripadvisor, I booked a room at Comfort Suites Maingate in Kissimmee for 3 nights just after Christmas, choosing it over other motels in the area because so many reviewers seemed to have liked it. I would not stay there again. First of all, it being the height of the tourist season, they charged $149/night when I booked through Comfort Suites web site (Choice Hotels), which came out to $135 or so with AAA discount--no bargain here. There are many nearby hotels, some closer to the Disney approach road. (For those of you who are not familiar with the Disney World area, this hotel is over a mile from the entrance to the approach road, and after that it's another several miles to the Magic Kingdom and other Disney parks.) Anyway, while I can say Comfort Suites Maingate is clean and well-kept, several things irked me, which may have been less bothersome if I had paid $65 or $75, but for $135 I expected better. The bed was uncomfortable because the mattress pad was like one of those waterproof plastic baby diapers. It felt like sleeping on a thick sheet of plastic, which bunched up and stuck in our backs uncomfortably. Such a mattress pad is expected in a cheap motel, but not a mid-priced Comfort Suites. Also, the bedspread and blanket had cigarette burns in them. Again, fine for a cheap motel, but not a mid-priced Comfort Suites. Moreover, at check-in, I was asked to initial that I understood I would be charged $200 if someone smoked in my (non-smoking) room. After seeing the results of someone having smoked in MY room (well, having smoked on the bedspread and blanket that were now in my room), I felt like I should have charged THEM $200 for having to tolerate such a disgusting bed in a NON-SMOKING room.", "title": "poor value", "helpfulness": 4, "user": "LorenzoAtlanta", "date": "December 29, 2006", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 2.0, "rooms": 3.0, "location": 3.0}, "id": 6517950}, {"rating": 5.0, "stay_parameters": "Stayed March 2006, traveled as a couple", "text": "I am also totally perplexed by glowing comments from some previous reviewers about the pool, bar, friendly service, etc. I felt it was just an ordinary motel like many others I have stayed at, with an ordinary pool, tiny \"bar,\" typical motel complimentary breakfast, etc.. Nothing special here. I think you may end up feeling misled if you stay here because there are a relatively large number of very good reviews while there are fewer good reviews for other hotels in the area. I suspect other hotels in the same area are on par with this one. I also suspect that the people who paid $65 felt that what they got was good for the price. I recognize that I stayed there on perhaps the absolute peak days, when hotels charge the most, but I was nevertheless disappointed. I will take Tripadvisor reviews with a grain of salt in the future.", "title": "Wonderful Stay", "user": "cherriest", "date": "December 22, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6480883, "likes": {"liked": "— The cleanliness", "disliked": "— The fact we had to leave"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2006, traveled with family", "text": "My husband and I stayed at this hotel in March 2006. The room was extremely clean and very well maintained and there was a fresh, clean smell in the air when we walked in. The outside of the hotel was also extremely clean and modern. Very friendly staff in the lobby. We only stayed at the hotel for one night as we just traveled to Orlando for the weekend to see a Braves/Reds baseball game at Disney's Wide World of Sports. We had planned on eating out after the game, however we found our room so extremely comfortable that we opted to order in and relax. We also spent a good deal of time that evening at the pool area enjoying drinks and the whirlpool. The pool area was extremely pleasant and we enjoyed talking with other guests. There were plenty of fresh towels in our room and the bed was very comfortable with clean, crisp sheets. There was free WIFI in the rooms and it worked very well and was fast. I was also pleased with the size of the suites... they are very roomy. The ac, fridge, and microwave were all in good working order. The elevator worked well and at a decent speed. Also, there was no noise while we slept and it was very peaceful. We will definitely stay at this hotel again in the future without hesitation.", "title": "Great value for price!!!", "helpfulness": 2, "user": "Mom2NY", "date": "December 18, 2006", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 6457138, "likes": {"liked": "— Saved us money and it was just very pleasant for the price.", "disliked": "— no mirror outside bathroom and that sink/vanity is inside bathroom"}}, {"rating": 2.0, "stay_parameters": "Stayed December 2006, traveled with family", "text": "The Good", "title": "Nobody at the desk at night. Security = 0", "helpfulness": 2, "user": "Ultimatetravelking", "date": "December 11, 2006", "detail_rating": {"cleanliness": 4.0, "front_desk": 1.0, "location": 4.0, "value": 2.0, "rooms": 3.0}, "id": 6364121, "likes": {"liked": "— Good Price", "disliked": "— No front desk attendant at night. Security concern."}}, {"rating": 4.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "For the price I feel this was a great value hotel. We stayed in first week of Dec. 2006 and paid $62 (week day) and $72 (fri/sat) triple A rate but they never asked to see our triple A card. The room was capable of sleeping 6 - we were 2 adults and 2 small children and the room was more than adequate. Hotel provided us with a pack and play which fit between the two beds. The room came with fridge, microwave, coffee maker and safe. Overall the hotel seemed very clean. Free breakfast was included every morning from 6am-10am. More than adequate food - bagles, toast, muffins, waffles, yogurt, coffee, juice, cereal etc...Pool and area was nice and clean. Hot tub relaxing. Very close to Disney. Extremely close to grocery store and restaurants and fast food all along 192 - some walking distance. I found the elevator quick and convenient.", "title": "More a spacious motelroom than suites", "helpfulness": 2, "user": "Andrea13", "date": "December 3, 2006", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 3.0, "cleanliness": 3.0, "value": 4.0, "location": 4.0, "rooms": 3.0}, "id": 6321462, "likes": {"liked": "— very quiet location near 192", "disliked": "— Tv did not work well"}}, {"rating": 2.0, "title": "Good Enough", "text": "Just got back from our trip. My wife, 3-year-old, and I stayed here. Don't get me wrong, for the price I wasn't expecting much, but based on the rave reviews on this site, I thought I'd be pleasantly surprised. Well, I wasn't. The pool area was quite nice, but that's where my compliments end. I did not like the room. I'm won't be one of those Internet-hotel-review crazies that list every little thing that I didn't like about it. Instead, I'll just say that overall the room is quite ugly and uncomfortable. But it's clean and just barely functionable, so if that's all you care about, then they'll do. As for the breakfast, in exchange for it being free, this hotel seems to have felt it necessary that it must be served in a room that's the size of a postage stamp. And oh yeah, the hotel is not quite a close to Disney as I thought it would be. The two miles of road from this hotel to the road that leads to Disney (not Disney itself) can take 15 minutes to travel because of the traffic. So, while it's a plus that its located next to a great shopping center, it's not quite as convenient to Disney as some reviewers (and the hotel itself) lead you to believe. Overall I give this hotel an \"eh\" and I would not stay here again.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "April 6, 2006", "id": 4942253}, {"rating": 1.0, "title": "Not Secure at All", "text": "We were supposed to stay for 3 nights but only stayed for 1.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "March 28, 2006", "id": 4739902}, {"rating": 4.0, "stay_parameters": "Stayed February 2006", "text": "In the middle of the night some guy started to bang on the door and forcing the door to open it.", "title": "Great Location, Great Value!", "helpfulness": 8, "user": "DeeTee616", "date": "February 25, 2006", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "rooms": 3.0, "service": 4.0}, "id": 4519999}, {"rating": 5.0, "stay_parameters": "Stayed February 2006", "text": "We called the front desk and said to call 911.", "title": "Wonderfully clean, we're coming back!", "helpfulness": 10, "user": "andreanicole", "date": "February 17, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 4466910}, {"rating": 4.0, "stay_parameters": "Stayed January 2006", "text": "In the morning we contacted the manager and he said that was too bad. his name's Sanjay", "title": "nice hotel", "helpfulness": 7, "user": "maxile", "date": "February 13, 2006", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 4.0, "service": 3.0}, "id": 4455850}], "location": {"country": "United States"}, "stars": 2.5, "variance": {"poor": 34, "average": 54, "very good": 182, "terrible": 21, "excellent": 199}, "aka": "Comfort Suites Maingate Hotel", "slim_ranking": 0.105590062112, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.5}, "description": "Conveniently located two miles west of the Walt Disney World entrance. This Award winning hotel offers Complimentary breakfast, Free Shuttle to major theme parks and Free wireless Internet. Studio Suites sleep six people with two queen beds and sleeper sofa, refrigerater, microwave, coffee maker. All rooms refurbished in 2007, tastefully decorated with new furniture, carpet, bedding, linens. Oversized heated pool, Jacuzzi and poolside Cabana Bar. Eleven restuarants within walking distance as well as shopping center."}