{"user_rating": 4.0, "review_count": 443, "name": "Clarion Hotel Prague Old Town", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "Well I’ll start by saying that the location was pretty good. We were able to walk to the center of Old Town, no problem. It was further to walk to the castle, but if you don’t mind the walk, it’s nice to see the town and take some time to browse in the shops. We also walked to the river and various museums, which were a bit farther but not too bad on a sunny day.", "title": "Hotel is Good, but Staff will Cheat you when it comes to CABS", "user": "Seeker707", "date": "May 22, 2010", "detail_rating": {"service": 2.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 64983449}, {"rating": 1.0, "stay_parameters": "Stayed May 2010, traveled solo", "text": "The hotel itself was clean and we felt it was safe. The room wasn’t big enough with our suitcases and we were climbing over the bed to get from side to side, but it’s Europe, so that’s to be expected. The room did come with a fridge, great TV (though only CNN in English – again to be expected) and various shower accoutrements. The closet was also a decent size, which was nice.", "title": "Don't stay at Clarion Prague Old Town unless you like strange men opening your door unannounced!!", "helpfulness": 1, "user": "lillyamma", "date": "May 4, 2010", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 63226098}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled on business", "text": "ONE THING TO BE AWARE OF: We took a cab to the hotel after a LONG night on the train. We felt the cab driver was trying to cheat us, so we decided to ask the woman behind the desk how much it should cost to get from the train station to the hotel. She told us about 300 krona, which was also about what the cab driver had told us (black cab that had a meter, so we thought it was safe). We paid the amount and thought everything was fine. When we took a cab back to the station to leave, we had a yellow cab (which we had to specially request the hotel to call for us. DO NOT let them tell you to just take their black unmarked car!!!). The yellow cab was 150 krona. It was only then that we realized the girl at the front counter had LIED to us upon our arrival and had cost us money. I expect more from an American-based chain.", "title": "excellent value, good location, friendly staff", "helpfulness": 1, "user": "peterwitheld", "date": "May 2, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 62992256}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "So, yes, the hotel itself was nice, but know that the staff will try to cheat you when it comes to cabs (and sometimes succeed). Live, learn, and pass it on to you, our fellow travelers.", "title": "great location, good service", "user": "lucie4", "date": "April 29, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 62743335}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled on business", "text": "I was happy with my room and service until the following happened on my last day (Apr30-May3). I was about to leave my room for the day when I heard a knock at my door which was then immediately opened before I could do anything.", "title": "Excellent location, superb friendly and helpfull staff, cleaniness 5*", "helpfulness": 1, "user": "davidkaufman", "date": "April 25, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 62372582}, {"rating": 1.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "We chose this hotel as it was a special anniversary due to its location and that it was a relatively small hotel. We researched and booked this hotel through Expedia 6 months prior to our trip. We selected a superior room and booked our own transport to and from the airport. On arrival were given room 417 which in our opinion was not superior as it was basic and you could barely walk pass the end of the beds. We tried speaking to the receptionist whose attitude was dismissive and very unhelpful. We then experienced problems with the air con and again tried speaking with the same receptionist who thought being sarcastic was good customer care \"what temperature do you want then\". After the console being replaced the temperature in our tiny room still remained the same 24.5c which was not only very uncomfortable during the day but unbearable at night even with the windows open. Although the hotel's location was good for sightseeing, if we had not prepaid we would have found alternative accommodation around the corner which seemed more spacious and reasonable, than our supposed 4 star superior room. On our return we contacted Expedia and in a nutshell agreed with the Hotel stating our room was superior ,see pictures attached and judge for yourself., they look nothing like the rooms shown on the hotel website. Also they did not post our traveller's review about the hotel on their website, just the grades. We were offered £30 compensation and some vouchers for a future break but we will not be booking through Expedia again and they don't seemed bothered about that either . You make your own mind up.", "title": "First visit to Prague", "helpfulness": 7, "user": "Doghandler995", "date": "September 25, 2010", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 3.0}, "id": 80934044}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "We have spent a weekend with my wife in the Clarion Old Town in order to celebrate our 10th wedding aniversary. The hotel is located just 5 minutes from the famous Old Town Square, but in a quiet street. The reception was a little bit unfriendly at the checkin, the room was OK, but the bed a little bit short -if I were 2 metres long, I would have problem with it. The view were very nice from the balcony, and we get a bottle of champagne and a fruit basket as a gift from our hotel for the anniversary - it was very-very kind. The high speed Internet which is free of charge was very useful.", "title": "Wonderful city, nice hotel\"", "user": "salesman973", "date": "August 24, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 76589983}, {"rating": 1.0, "stay_parameters": "Stayed August 2010", "text": "The breakfast choice is OK, the minibar choice is bigger than I've ever seen. Altogether it is a nice city hotel, I would recommend it to everyone.", "title": "Awful staff at hotel", "user": "kindin", "date": "August 22, 2010", "detail_rating": {"cleanliness": 3.0, "location": 3.0, "service": 1.0}, "id": 76311219}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "Booked delta vacation 6 months in advance, paid in full 6 weeks before travel, called hotel direct one week ahead to confirm. On arrival at hotel our group of 10 were told, sorry-they were holding the rooms for a bigger group. Hotel Clarion in Prague were rude & obnoxious. Would not allow us to call Delta. Shifted us to a back alley hotel 20 minutes away. Finally called Delta to resolve this. We were told that Delta was willing to refund our hotel price, we were free to find our own hotel. In Prague, Czech Republic, most do not speak English.", "title": "No Smokers Rooms...!", "helpfulness": 1, "user": "PerKam", "date": "August 11, 2010", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 74703930}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled on business", "text": "Staff at the Hotel were very rude. They moved us to another very very poor quality hotel. Miseable experience", "title": "Perfect place downtown", "helpfulness": 1, "user": "Holton_Michael", "date": "June 14, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 67439860}, {"rating": 2.0, "stay_parameters": "Stayed March 2010, traveled with family", "text": "We were forced to stay in this hotel after being transferred from a hotel which was overbooked... We were travelling with our 18month old daughter who was excited but tired by this point... The service at reception at 10 pm in the evening was okay, but the receptionist the next morning was clearly more interested in a plastic toy that the doorman had bought her to give to her child rather than her customers. This confirmed to me that this was definitely not the hotel for us!", "title": "Great location - shame about the service and the room", "user": "Tired_travelling_dad", "date": "April 14, 2010", "detail_rating": {"service": 1.0, "cleanliness": 2.0, "value": 1.0, "sleep": 1.0, "rooms": 2.0, "location": 5.0}, "id": 61341616}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled on business", "text": "The room itself was fairly standard for a Travel lodge type chain hotel. The beds would have been okay but being two singles pushed together with individual sheets and two separate, short single duvets, this did not make for a very comfortable night's sleep in a double bed! The bathroom was clean apart from the bathroom bin not having been emptied since the last occupants vacated the room (presumably 10 hours before) and it wasn't pleasant seeing other people's detritus or very safe for the exploratory hands of a toddler...", "title": "We have enjoyed it!", "helpfulness": 1, "user": "martynka", "date": "February 21, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 56630376}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled on business", "text": "Breakfast the next morning was not great but was passable. The hotel was busy so there was a quick turnover of food and things seem to be fairly fresh, although there wasn't much choice and the actual quality of what was there wasn't great. Enough to fill you up but not very tasty...", "title": "Great Service", "helpfulness": 1, "user": "iflysims", "date": "January 7, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 3.0, "service": 5.0, "rooms": 5.0}, "id": 52871388}, {"rating": 2.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "The saving grace is that the location right in the heart of the Old Town, near the river is very good. It is near all the sites but at the same time is far enough from the main squares that any rowdy behaviour is not noticeable. Also, there was a nice balcony in the room.", "title": "Good location but not the best hotel", "user": "Boltonian", "date": "January 4, 2010", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "location": 5.0, "service": 1.0, "rooms": 2.0}, "id": 52546712}, {"rating": 1.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "In summary, if you are expecting a Travel lodge and are just here to see Prague and don't care about a relaxing hotel room or decent service; then this hotel is satisfactory. However, if you are here to have a relaxing holiday in a beautiful city; I would definitely recommend going elsewhere - that is what we did... And you will not see me staying in this hotel EVER again.", "title": "Not the place to stay if you want to enjoy your vacation", "helpfulness": 1, "user": "Zaitz", "date": "December 3, 2009", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 3.0, "service": 1.0, "rooms": 2.0}, "id": 50598220}, {"rating": 3.0, "stay_parameters": "Stayed November 2010, traveled solo", "text": "My first impressions of the Clarion Old Town were not positive: you must haul your luggage up the stairs at the entrance, for one thing. And I really didn't like the way the woman at the front desk kept asking me if my friend was staying with me. My friend, who is a former student of mine, lives in Prague and she was helping me get around (and helping my haul my bags up the front steps). When I checked in, the desk clerk asked, pointing to my friend, \"Is she staying here with you?\" I said no. Then when I got the key card and was about to head for the elevator, she once again accusingly asked, \"Is she staying in your room?\" Um, I already said no, so when she asked again, it sounded like she was suggesting that I had lied the first time.", "title": "Adequate hotel, needs some improvement overall", "user": "isoruku", "date": "November 21, 2010", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 3.0, "sleep": 1.0, "rooms": 2.0, "location": 4.0}, "id": 87801908}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "Choice Hotel reservations told me that I was getting a queen-sized bed. Great. That dispelled the fear that I'd be getting one of the mysteriously tiny rooms that appear on Tripadvisor but not on the hotel's web page. My mistake. I got a tiny room. With a standard sized bed that has won Prague's \"hardest concrete surface for a hotel bed\" competition three years running. I didn't sleep much.", "title": "Comfortable hotel, reasonably close to everything", "user": "Phewtorquay", "date": "October 3, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 81960707}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "I don't mind the small room, since I was a solo traveler (despite the suspicions of the desk clerk). But I do mind not getting what I was promised, and not seeing my type of room on the hotel's web page, which features beautiful rooms, not my cramped and rather plain one.", "title": "OK hotel", "user": "prozerran", "date": "October 3, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 81891803}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled solo", "text": "And it was too warm in my room, no matter how I adjusted the thermostat. So I opened the windows. In late November.", "title": "Great base for exploring Prague", "user": "Soujourner69", "date": "September 30, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 81648124}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "On the plus side, it was surprisingly quiet, and the free breakfasts were quite nice - except for the coffee, which was \"brewed\" in one of those instant coffee machines that produces your cup of coffee in about three seconds. You can't brew coffee in three seconds. It's impossible. The result is bland, mediocre coffee. (At the Clarion Congress, they have brewed coffee in coffee pots placed around the dining area. it's good coffee.)", "title": "Nice, clean and well located", "helpfulness": 1, "user": "adamber", "date": "September 29, 2010", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 81530716}], "location": {"country": "Czech Republic", "region": "Bohemia", "continent": "Europe", "city": "Prague"}, "stars": 4, "variance": {"poor": 27, "average": 71, "very good": 195, "terrible": 13, "excellent": 137}, "aka": "Clarion Prague", "slim_ranking": 0.320950965825}