{"user_rating": 4.5, "review_count": 259, "name": "Clarion Inn & Suites Atlantic City North", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled with family", "text": "Best friendly/Clean Hotel I have stayed in A/C. Staff is very friendly and works hard to make my stay a great experience. The room was spacious. Never seen a cleaner Hotel/good breakfast. We will definitely go back again and again.", "title": "Best Hotel Clean and friendly than the Trump Plaza", "user": "Mike1011A", "date": "February 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 124862392}, {"rating": 5.0, "stay_parameters": "Stayed February 2012", "text": "Me, my Wife and 11 month old daughter stayed one night on Feb 18th and wish I could of stayed longer. I am a choice rewards member and have to admit that this hotel had one of the nicest managers I ever met. Her name was Sandra Brown. Sandra was very warm and welcoming the minute we stepped in. I could tell her hands were full, but she had every thing under control. The hotel was nice and very clean. Our room was spacious with a nice size fridge and very good climate control. The continental breakfast the next was excellent with fresh fruit, bagels, muffins, cereal and waffles. Sandra made sure that the food was plentiful and greeted everyone. Would definitely stay again when I'm in the AC area. Also only a 12 minute drive to the casinos.", "title": "First class customer service!", "user": "smoothrube", "date": "February 19, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 124838372}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled with family", "text": "Thanks,", "title": "Clean, comfy and friendly.", "user": "yasmeen p", "date": "February 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 124770950}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "Mr. Torres", "title": "Great stay for the $$", "user": "Jenkeyo1125", "date": "February 14, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 124580692}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled with friends", "text": "Immaculately clean, large spacious rooms, comfy beds, tastefully renovated, very helpful and friendly staff, decent free breakfast. All in all and EXCELLENT hotel....will definitely go again!", "title": "Fresh & Clean", "user": "Fran W", "date": "February 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124149844}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "We went to Atlantic City for a concert on Saturday night. The hotels in AC were charging $200-$400 for a room so we stayed at the Clarion which only charged $99. The hotel is only located 7 miles from the Casinos so it only took 10-15 minutes to get to the show. The hotel has a shuttle which will drop you off and pick you up - $10 a person, each way. Last shuttle is at 1:30 a.m. I thought $40 for the two of us was kind of steep so we drove. We only had to pay $10 to park at the Casino.", "title": "Nice Room for Reasonable Price", "user": "Lulubelle1212", "date": "March 26, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 126682152}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "The room we had was spacious with a king size bed and sofa. The room and bathroom were spotless. We were in the room at the end of the hallway nearest to the White Horse Pike, so we heard all of the street noise, which was very loud. Make sure to request a room away from the roadway.", "title": "Awesome Place to Stay!", "user": "Ot74", "date": "March 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 126391097}, {"rating": 2.0, "stay_parameters": "Stayed February 2012, traveled with family", "text": "The hotel had a free continental breakfast in the morning which consisted of pasties, muffins, waffles, cereal, oatmeal, coffee and juice.", "title": "are you kidding me?", "user": "timesharemom", "date": "February 25, 2012", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 125180401}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "We go to AC for concerts about twice a year, I will definitely stay at the Clarion again.", "title": "Very Clean Room..Pleasant Management...Comfortable Stay!!", "user": "Avonbuynancy", "date": "February 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 3.0}, "id": 125059154}, {"rating": 2.0, "stay_parameters": "Stayed February 2012, traveled with friends", "text": "Staff was friendly, helpful, and NICE. Rooms were nice, roomy, and clean. Great place to stay :-)", "title": "MANAGEMENT IS A JOKE!", "user": "Elle C", "date": "February 21, 2012", "detail_rating": {"service": 1.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 125007537}, {"rating": 5.0, "stay_parameters": "Stayed April 2012", "text": "I just returned from a 2 night stay at this wonderful hotel. I inspected the room quite thoroughly and it was spotless. The beds were very comfy, the best hotel matresses I've ever slept on. The fridge is a nice size, even the big soda bottles fit inside! The microwave is another nice convenience included in the room price. The breakfast offered was much more than I expected including bagels, muffins, waffles, Danish, cereals, eggs, and several fruits. All desk clerks were very friendly and professional, and Sandra is very reponsive to all her guests needs and wants. I was shocked that I was able to check into my room at 11 a.m.when I just stopped by the hotel to let them know I arrived in town and would be checking in later! Who needs the hassles and long waiting times to check into the hotel/casinos when the Clarion is available such short driving distance away from the Boardwalk.", "title": "Great place to stay!", "user": "jacal", "date": "April 16, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 127987810}, {"rating": 1.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "This is the worst hotel we stayed at ever. The manager is very rude and has a very bad atttitude. She is arrogant and not capable. She even charged us twice on our credit card for the same stay! She has a big ego problem and thinks she is always right. We booked our room there for a fun family stay and it turned out to be a big mistake. I would never stay at this hotel again and tell all my friends to stay away from this place. I hope the owner Mr. kripalani wakes up and fires her. She is ruining his hotel . I spoke with couple of the employees there, who told me that they were fed up with the manager and that she made working there soo miserable that they were going to leave.", "title": "Worst hotel stay ever . Hotel manager is very rude and has bad attitude.", "user": "mark l", "date": "April 12, 2012", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 1.0}, "id": 127772699}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "I stayed one night here with my family on our way to graduation ceremony at Cape May, New Jersey. It is close to Atlantic City. The hotel is brand new, fresh, clean and wonderfully decorated. The bedding and mattresses are simply amazing. I was thrilled with every aspect of this hotel, including the front desk staff.", "title": "New, Beautiful....close to Atlantic City", "user": "Mom2SixRoses", "date": "April 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127569690}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "Tried this hotel because we had a Groupon deal. What a surprise! The staff was exceptionally personable and helpful, the rooms large and well appointed with the most comfortable hotel beds we have ever experienced. We are given the option of down or down alternative pillows on the bed. Nice breakfast options including oranges, apples, bananas, cantaloupe and grapes( unusual for a continental selection). Very nice indoor pool. Shuttle to Showboat in AC available hourly. Not sue we would have picked this hotel on its own without the Groupon offer, but now that we have been there we will definitely return.", "title": "\"A wonderful alternative to AC prices\"", "user": "Burdview", "date": "April 3, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 127189193}, {"rating": 5.0, "stay_parameters": "Stayed March 2012", "text": "Super clean well appointed rooms, indoor heated pool and sauna. Beds are VERY comfortable. We felt like this is our new stopoff in AC and we wont have to worry about a thing! Breakfast looked fabulious too!!", "title": "Really nice place, friendly, just amazing!!!!", "user": "Jdubkenji", "date": "March 29, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 126914687}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled with friends", "text": "A Couple of friends and I went to Atlantic City for the weekend to relax and unwind. Check-in was a breeze and with our Groupons, we got tons of free stuff! So we decided we wanted to go out to a nice club, we called up the different casino's asking for there dress code, and they all said \"no sneakers/tennis shoes\"......granted we should have known this in the first place, but we are from Pittsburgh, you can get into our fanciest club with a \"pull my finger\" T-shirt on! So we called front desk and we asked them if they knew of anywhere we could find nice shoes for cheap, She said there was a K-mart close.....she could tell that we had been pre-gaming to go out for a solid hour and a half, so we couldn't drive. The DRIVER said he would go get them for us!!! alone, like we just gave him the money, and he went and grabbed them and we pre-gamed! once he came back, we switched our shoes and we were ready to go! This hotel definitely made our vacation!!! Great staff, great service", "title": "Amazing Service!!!", "user": "jkoestline", "date": "January 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 123889567}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled on business", "text": "This is the second time my group (about 12 rooms) has stayed at the Clarion Atlantic City North. And again we had an excellent experience. The manager, Sandra, was amazing! There are allot of details when booking a group-- but Sandra made it stress free. She is the best! Really, all of the staff are great!", "title": "Excellent Staff & Nice Hotel", "user": "baallen33", "date": "January 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 123437172}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "The hotel is new and clean. The staff are always in the lobby cleaning- dusting & mopping. The lobby has a fresh scent! The hotel is bright and cheery. We had a great time, and will return yet again!", "title": "Great place to stay", "user": "Glenn L", "date": "January 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 123178931}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled on business", "text": "My wife and i went for a weekend get away and i book this hotel through Hotels.com, upon our arrival the young lady named Sandra checked us in, The room was spotless and Sandra was the type of person that if i had a business i would hire in a minute, she attended to all our needs and very polite. we will definately go back again. THANK YOU SANDRA !!!", "title": "Booking the room was a great experience, and we haven't even stayed there yet!", "user": "Aly0705", "date": "January 11, 2012", "detail_rating": {"service": 5.0}, "id": 122947349}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "I'm a photographer and will be shooting a wedding in Galloway Twp. in August. I went on TripAdvisor to see what was available nearby and saw the outstanding reviews of the Clarion.", "title": "The best stay we ever had in atlantic city", "user": "skastne", "date": "January 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 122783935}], "location": {"country": "United States"}, "stars": 3, "variance": {"poor": 8, "average": 19, "very good": 63, "terrible": 7, "excellent": 162}, "aka": "Clarion Inn & Suites Atlantic City North Hotel", "slim_ranking": 0.0833333333333, "description": "Welcome to the Clarion Inn & Suites Atlantic City North, a newly built hotel minutes from the Atlantic City Boardwalk! For your relaxation needs, the Clarion Inn & Suites Atlantic City North boasts a beautiful 33-foot-long indoor heated pool and a well-equipped exercise room. All rooms have a small refrigerator and microwave oven for your convenience. For those who will expect nothing less than the very best, we proudly offer a King Hot Tub Room for the ultimate in luxurious romantic relaxation. If you are traveling with family, we are ready for you! Our Triple Queen Suite is complete with two bedrooms, including a private en-suite room so the family can be together while affording everyone a bit of privacy."}