{"user_rating": 4.0, "review_count": 234, "name": "Clarion Collection Hotel Opera Pavillon", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed October 2005, traveled on business", "text": "The Hotel de Pavillon tries hard to be hip'n'trendy (a la Philippe Stark hotels) - and very nearly succeeds. But the rooms are small and a little tatty round the edges (for these prices everything should be top notch). On the plus side, the rooms facing the internal courtyard are very quiet and peaceful - recommend you ask for one of these.", "title": "OK - but nothing special", "helpfulness": 3, "user": "AlanLondon_UK", "date": "November 7, 2005", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "service": 3.0}, "id": 4090982}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "I have read the other reviews and I am confused... To be honest, it is not the cleanest hotel in the world. Nor is it the best appointed. And it doesn't necessarily do the little things too well either.", "title": "Plesant Staff, Decent Location, Seen Worse", "user": "Dazzler-TA", "date": "October 31, 2007", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 10469740}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "But its not as bad as everyone has said.", "title": "Unique, Chic and Very French!", "helpfulness": 1, "user": "Gemmi_G", "date": "August 6, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8360988}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "ROOMS:", "title": "Recommended", "user": "Toshman", "date": "June 5, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 7771207, "likes": {"liked": "— The atmosphere", "disliked": "— Leaving"}}, {"rating": 2.0, "stay_parameters": "Stayed April 2007, traveled on business", "text": "The room was small - this is true. But the beds are decent size (2 singles pushed together form a massive double). The bathroom was awesome, with a boiling hot shower, decent bath tub and bath robes. And the slippers were a nice touch as well. Wardrobe space is adequate, the curtains cover the windows....", "title": "Trouble at the Pavillon", "user": "Devlin5", "date": "April 24, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 2.0, "cleanliness": 3.0, "value": 3.0, "location": 3.0, "rooms": 2.0}, "id": 7427404, "likes": {"liked": "— The design touches", "disliked": "— Smoke coming through ventilation, not returning my laundry"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled on business", "text": "VIEW:", "title": "adored the Pavillion", "helpfulness": 2, "user": "Shune", "date": "January 9, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 6569543, "likes": {"liked": "— very clean and luxurious", "disliked": "— small room"}}, {"rating": 4.0, "title": "Great Small Hotel", "text": "We were so happy with our stay at the Pavillon de Paris, 7 rue de parme in the 9th Arondissment of Paris. It is a great small hotel, with accomodating staff who speak English quite well. They gave us directions, called for a taxi and catered to our needs. The Breakfast bar in the morning had fresh fruit, croissants, rolls, meats, cheeses, juice and coffee, plus cereal, yogurt and much more. My teenage daughter and I shared a double bed and had plenty of space. There was an adequate closet, terry robes and slippers, chair and a desk, mini refridge, plus tv which we never turned on once. We could walk to Galeries Lafayette and Printemps and there was a bakery and mini grocery store around the corner. Plus the police station was right next door, so we felt very safe.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "March 31, 2006", "id": 4825515}, {"rating": 4.0, "title": "Good value for price", "text": "We got a very good price for this hotel (considering is in Paris - less than 150 dlls!) and was gladly impressed by the value we got. We had a big room with a big and spotless bathroom (the room our friends were staying in was very small so we were lucky!). We did not have breakfast at the hotel but we discovered a GREAT restaurant Wepler one block away. Location wise Montmarte is wallking distance, so is a metro station, we didn't have any trouble getting where we wanted to go. The receptionist was helpful and kind. On a previous trip to Paris we stayed at a Sofitel which was the worst experience of my life!! And more expensive than this one! Bottomline, if you can get a good rate, it is worth it.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "January 18, 2006", "id": 4361252}, {"rating": 2.0, "stay_parameters": "Stayed January 2006", "text": "This hotel was probably pretty decent when it opened but has lapsed into complacency. At first glance the rooms appear to be tastefully furnished, but closer inspection reveals that the 'chipboard with dark brown venner' furniture prized by so many lower end boutique hotels is badly chipped and scratched in many areas. Worse still, the carpets are visibly dirty and stained, which severly undermines what would otherwise be a decent sized and reasonably decorated room.", "title": "Disappointing", "helpfulness": 4, "user": "LondonTraveller73", "date": "January 3, 2006", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "rooms": 2.0, "service": 2.0}, "id": 4319496}, {"rating": 2.0, "title": "Poor facilities for the business traveller", "text": "On the plus side, the communal areas are attractive (although the bar never seemed to open) and the staff pleasant, if a little inept. For instance, the lock to our room was broken and after three days, they still had not managed to repair it which meant that we had to find a member of staff - easier said than done - to let us into our room every time we wanted access as they refused to give us their only key or get another one cut.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "November 16, 2005", "id": 4119513}, {"rating": 3.0, "stay_parameters": "Stayed November 2005", "text": "All in all I would suggest looking elsewhere until they have had a good spring clean/ refit.", "title": "Not Good, Not Bad, Just Okay", "helpfulness": 4, "user": "Pat H", "date": "November 13, 2005", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "rooms": 3.0, "service": 2.0}, "id": 4108624}, {"rating": 4.0, "stay_parameters": "Stayed November 2006", "text": "Stayed at the Pavillon hotel for one night. Unfortunately they only had a single room available. The hotel and the room were clean and nicely decorated but the room was very small. The bed in the middle of the room was only 90cm wide and that was no fun. I paid £91 pounds. Pavillon is a small boutique hotel without a restaurant. The area near the Place de Clichy and the Paris Red Light district is quite nice.", "title": "Nice hotel but be aware of small rooms and narrow beds", "helpfulness": 1, "user": "wwewerwrwe", "date": "December 1, 2006", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 2.0, "location": 4.0, "rooms": 1.0}, "id": 6313560}, {"rating": 5.0, "title": "Stylish Boutique Hotel conveniently located", "text": "Would I recomend the hotel? Only if a larger room was guaranteed.", "helpfulness": 2, "user": "Abi32", "date": "July 31, 2006", "id": 5533173}, {"rating": 4.0, "title": "Nice boutique-style hotel", "text": "Tim", "helpfulness": 4, "user": "A TripAdvisor user", "date": "June 27, 2006", "id": 5395662}, {"rating": 4.0, "stay_parameters": "Stayed September 2004", "text": "The Pavillon de Paris is a small, but very stylish boutique hotel, conveniently located near the Place de Clichy metro in Paris and Montmatre. It's chic, without being pretentious, and the staff are considerate, helpful and attentive, and made us feel extremely welcome without being overbearing.", "title": "Stayed in worse, stayed in better!", "helpfulness": 5, "user": "sisimia", "date": "May 3, 2006", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 4.0, "service": 3.0}, "id": 5030553}, {"rating": 5.0, "stay_parameters": "Stayed April 2006", "text": "The rooms are small, but simply and effortlessly decorated and the beds are unbelievably comfty, especially after a full day walking round the sites of Paris! And there is a well stocked mini bar with various drinks and snacks.", "title": "Good for what we wanted", "helpfulness": 6, "user": "elvisampio", "date": "May 2, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 5026743}], "location": {"country": "France", "region": "Ile-de-France", "continent": "Europe", "city": "Paris"}, "stars": 4, "variance": {"poor": 26, "average": 35, "very good": 98, "terrible": 6, "excellent": 69}, "slim_ranking": 0.416062465142, "description": "Let yourself be transported by the atmosphere and relaxing design of Clarion Collection Opera Pavillon. This gorgeous hotel located near the Opera Garnier and the Parisian cabarets will be your starting point. The reflection of the hotel, the staff calm, helpful and courteous opera is here to satisfy all your desires."}