{"user_rating": 4.5, "review_count": 158, "name": "Clearbrook Motel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled with family", "text": "Great apartments in centre of Wanaka. Views of mountains from balcony and a stream running through the garden. 2 bedroom apartment was spacious, clean and tidy. Our only minor complaint was no washing powder provided with the washing machine.", "title": "High quality apartments with great mountain views", "user": "Kevin B", "date": "February 24, 2011", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 97791569}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled with family", "text": "The burbling brook and stunning mountain view made this place distinctive. There's a nice patio (or deck if you're upstairs). Like other places in NZ, the windows lack screens, so bugs may come in, esp. with the lights on. The beds were adequate, and the washer/dryer was quite useful (be aware you have to pay for detergent, unless you bring your own... or improvise with the complimentary dishwashing powder!) Parking is free and the location in Wanaka makes for easy walking to the downtown. There's a supermarket nearby, and the kitchenette is usable for actual cooking. Overall, we enjoyed the Clearbrook.", "title": "Lovely brook in the backyard, pleasant rooms", "user": "JiffyPoo", "date": "February 23, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 97766955}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled with family", "text": "My husband and 9 year old stayed here only for 1 night (unfortunately) and would have stayed longer if time permitted. Wananka is probably our favourite town on the South Island and for us has it all. The cost of the motel was the most we paid during our trip but was well worth the extra. Very quiet, clean, newly built and well appointed and the kitchen was excellent. The only downside was at times the very slow wireless broadband service. Lots of things to do in Wanaka which is set in a beautiful location and not an easy place to leave.", "title": "The Best Accommodation of our Trip", "helpfulness": 1, "user": "EJNZTRIP", "date": "February 20, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 97276704}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "The owners made us very welcome, considering I had booked the wrong month! Delighted with our room, clean and quiet, and just 5 minutes stroll to town centre and good supermarket. Another 5 minutes to lovely lake beach with views of Mount Roy - water on cool side, which was great as sun has been shining.", "title": "FABULOUS ROOMS AND LOCATION", "user": "henley-dreamer", "date": "February 16, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 96815223}, {"rating": 4.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "Well equipped kitchen and outside furniture etc.", "title": "An enjoyable stay", "user": "Griff1980", "date": "February 5, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 95550768}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled with family", "text": "We visited Wanaka for a special occasion, so were looking for a special place to stay. And Clearbrook was equal to the occasion. Warm, clean, and a lovely view (despite the weather!). Kitchen facilities were excellent, and the spa bath was a plus.", "title": "Friendly welcoming hosts and a lovely spot.", "user": "GeorgeTooting", "date": "August 26, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 77022889}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "Hosts couldn't have been more helpful, both for our booking, and during our stay. Highly recommended.", "title": "Warm and attractive in every way - great accommodation!", "user": "SkiierOZ", "date": "August 23, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 76407144}, {"rating": 3.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "Clearbrook is great: excellent central heating; well-appointed, large and attractive rooms; views of the mountains from floor-to-ceiling living room windows; warm and secure lockers in which to store ski gear; and one short block from the main shopping/eating area, yet away from noise. As an added bonus, Dougal and Bernice (the owners) are just lovely, and couldn't be more helpful. After a terribly cold winter experience at another Wanaka motel, having seen the cramped conditions where friends stayed (for almost the same cost), and having heard what others have said about their accommodation elsewhere, we've come to the conclusion that Clearbrook has to be one of the best in Wanaka! That's what's made us go back three times and, yes, we're booked in for next year too!", "title": "over priced", "helpfulness": 1, "user": "VanessaJoe", "date": "August 15, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 1.0, "sleep": 3.0, "rooms": 2.0, "location": 3.0}, "id": 75261458}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled with family", "text": "We've travelled a lot around NZ and stayed in many motels, hotels etc. We paid $270 to stay in a two bedroom cottage at Clearbrook for one night. The cottage was fully equipped but quite dated, particularly the kitchen and bathroom. Of all the places we have stayed in NZ, this was by far the least value for money. The newer units looked nicer so it was a shame those were all booked.", "title": "Fantastic Location", "user": "frankchristchurch", "date": "July 23, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 72085320}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled on business", "text": "We stayed at Clearbrook for two nights in mid-june. Beautiful view of the lake and surrounding mountains with alpine stream running through the grounds. Very comfortable and spacious apartment, well set up for families with the added bonus of having a washing machine and dryer in the bathroom. Only 2 minutes from the town centre. Knowledgeable and friendly hosts.", "title": "Hidden Gem", "user": "Teapot2323", "date": "July 6, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 69940813}, {"rating": 4.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "The Clearbrook Motel is typical of most owner-operated lodging we encountered in New Zealand: scrupulously clean, well-equipped and run by exceedingly friendly and helpful people who seem ecstatic to be in the hospitality business. After suffering the indifference and sloppy standards so prevalent in chain-dominated motels in North America, the Kiwi experience continually amazed us.", "title": "Easy to recommend", "user": "Gadman", "date": "November 20, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 87694197}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "We spent two nights in an upper floor suite at the Clearbrook. The unit was immaculate, with a kitchen, in-suite laundry, and comfortable king bed. The patio overlooked the charming brook, and resident ducks waddled up to quack for bread crumbs in the late afternoon. A very charming and tranquil location a short three blocks from main street.", "title": "Clearbrook Motel", "user": "suparoo49", "date": "November 6, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 86156580}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "The only quibble might be the somewhat sterile decorating theme: green linoleum of the hospital variety in the bathroom and foyer, and dull beige carpet and furniture in the living room. Again, pretty common in NZ motels.", "title": "Great modern facilities at a fair price", "helpfulness": 1, "user": "pragmatopian", "date": "November 6, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 86137453}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "Staff were engaging and helpful, with Lisa even sending me an email after we left to say that I’d left a hardcover book behind and she could courier it to Queenstown if I wanted. I’d finished the book and left it for future guests, but her thoughtfulness about a little item like this speaks volumes about a commitment to guest service.", "title": "Great Location and value for money", "user": "EinRov", "date": "September 22, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 80540438}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled with family", "text": "The Clearbrook is very easy to recommend for anyone spending time in Wanaka.", "title": "convenient location, excellent host, value for money", "user": "cict2011", "date": "September 20, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 80256703}, {"rating": 4.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "Read the other reviews as they have said it all and I agree excpet on one point.", "title": "Excellent choice in Wanaka", "helpfulness": 1, "user": "rustycycle", "date": "January 25, 2011", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 94436573}, {"rating": 4.0, "stay_parameters": "Stayed January 2011, traveled with family", "text": "There's no point in simply repeating what others have said if I agree with them. The one point that I don't agree with some reviewers is whether Clearbrook is the best place in NZ. I simply am unable to agree on that point as I have stayed at some truly amazing places. Clearbrook is not one of them, however it is very good never the less, particulary for the price paid. I would recommend it as a good choice in Wanaka.", "title": "Great location, great service, tired room", "user": "LaurenceEmma", "date": "January 25, 2011", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 2.0, "location": 5.0}, "id": 94395512}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "We stayed at Clearbrook in a 1 BDR apt with our 10-months old boy for 3 nights. The service was excellent with the receptionist allowing an early check-in and a last minute change for a downstairs room. She also found us a high chair which she never charged us for. Located within minutes from the lake and just around the corner from the local supermarket (open 8am-8pm 7 days) and at the same time very quiet. We were slightly disappointed by the room. I suppose the “luxury accommodation” heightened our expectations a bit too much. The spa bath is in a cramped bathroom and the room has had its fair share of wear and tear. The service is daily though with no xtra charge for toilet paper or tea/coffee top ups, fresh towels available every day. There is a very lovely patch of green grass just outside the terrace where we enjoyed playing with our little boy. We had a lot of sport gear including a bike and no one ever objected to us taking it inside the room. All in all, a great spot, excellent service.", "title": "Stay here!", "user": "HoppyEu", "date": "January 12, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 92663721}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "Excellent, excellent.", "title": "Lovely view, convenient location and well equipped", "user": "NormAndCheryl", "date": "January 5, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 91904019}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled solo", "text": "We only spent one night here but would have loved to stay longer.", "title": "Great room, great view", "user": "nickworld08", "date": "December 31, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 91221585}], "location": {"country": "New Zealand", "region": "South Island", "continent": "South Pacific"}, "stars": 4, "variance": {"poor": 1, "average": 10, "very good": 43, "terrible": 0, "excellent": 104}, "aka": "Clearbrook Hotel", "slim_ranking": 0.142857142857, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "Clearbrook offers affordable motel accommodation for all! Including families and groups visiting Lake Wanaka. Conveniently located close to Wanaka town centre, Clearbrook comprises 14 private self-catering apartments and two self-contained holiday homes, fully equipped for a Wanaka holiday.Clearbrook is set in a peaceful location by Bullock Creek and each self-contained apartment has a private balcony or courtyard with stunning mountain views. Clearbrook's spacious accommodation is ideal for corporate and wedding groups, families on ski and summer holidays and visitors on hunting and fishing trips."}