{"user_rating": 4.5, "review_count": 27, "name": "Cleburne Homestead", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "Cleburne is full of character and is an interesting place to stay - great art, farmyard animals and nice rooms. The location is a little out of town but its not difficult to get around the city by car. Its also close to MONA which is a must - even if you are only in Hobart for a short stay. The host was wonderful - informative and welcoming - what more could you want? We also loved the breakfasts by the fire in the large dining room - sumptuous and healthy to boot! Overall we enjoyed our long weekend there and liked the fact that we were in a farmyard setting rather than in a characterless high rise hotel or apartment. Another advantage of the location was that we explored more of the city than we would have if we stayed in the central touristy area.", "title": "Something a little different", "helpfulness": 2, "user": "CiaraB", "date": "August 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 137982865}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "We had a wonderful stay at Cleburne. Penelope is a wonderful host and Tilly the pup, the alpacas, the \"protest\" of geese and other animals were lovely company. Breakfast by the fireplace each morning was a great way to start the morning, and the wee selection of wine and nibbles on hand meant we didn't have to go anywhere if we were running low on supplies. Would definitely stay again, and would definitely recommend anyone to stay.", "title": "Wonderful stay with fantastic hosts", "helpfulness": 1, "user": "Candi_James", "date": "July 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 134603498}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled with friends", "text": "We stayed at Cleburne for a long weekend in the beginning of March as a large group of friends, so took over the estate a little for a few days. Penelope and David were amazing hosts that welcomed us and accommodated our every whim (as well as did all the animals, providing lots of entertainment for the kids). Loved the simple but varied breakfasts that we were allowed to have at times that suited everyone. As well as letting us have the run of the dining room and bbq for a dinner together. There is plenty of the property to explore with the gardens and lamas being the biggest attractions", "title": "Old made new again", "user": "avstralijka", "date": "July 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 5.0, "location": 3.0}, "id": 133559682}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled with family", "text": "The rooms were beautifully restored, each with it's own character. Absolutely loved the way that the old restored walls and rustic features were neighboring new and modern vanities or furnishings. The rooms all vary in size but are pretty accurately described in the description on the website.", "title": "A Wonderful Place to Stay", "user": "mercuryprinciple", "date": "January 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 123431301}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled on business", "text": "Firstly let me say that David and Penelope are two of the most welcoming hosts that can be hoped for. We recently stayed 2 nights with our 2 children 9 & 12 and as the property is set in beautiful grounds with alpacas and geese, chooks and of course Mitilda the dog so the kids were always occupied. We stayed in the cottage and it was delightful with some great pieces of art (Penelope is an artist). Continental breakfasts were delicious and varied each day. If you are very light sleeper the roads are close so the noise might bother you a little but take ear plugs if you are a light sleeper as it is definetly worth staying here. You will need a car but it is not far to Hobart central and is far enough away to enjoy the rural outlook. A must stay location, thanks again for a great couple of days and hope we can return soon.", "title": "Two Days of living in a dream!", "user": "PaulandValda", "date": "December 3, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 121342209}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "Beautiful, rustic 19th century buildings and elegant, comfortable rooms - Cleburne Homestead is tucked away by the north end of the Bowen Bridge about 10kms from Hobart CBD, just across the river from the Derwent Entertainment Centre. It's a little oasis from the city's hustle and bustle. The hosts were charming, friendly and helpful; the breakfast was tasty; plus free off-street parking.", "title": "hidden gem", "user": "cliffh", "date": "February 23, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 97665437}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled with family", "text": "We loved Cleburne. Its location would be difficult if you don't have a car, but I would still recommend it. The rooms all had character, were extremely confortable and very clean. The continental breakfast was superb, with mulberries stright from the bush that morning, excellent bread and jam, and tasty homemade muesli. David and Penelope were superb hosts, giving us a guided tour of the animals and garden, and allowing us to try a little bit more fruit from the mulberry tree and a plum tree! They really bent over backwards to help us, with directions, recommendations and advice about things to do in the area.", "title": "Wonderful hosts and exceptional service", "user": "Mtyler", "date": "January 31, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 95118140}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled with friends", "text": "Set in beautiful grounds with alpacas and geese for a rural touch. One of the oldest buildings in this area of Risdon Cove which was the orignal settlement, each room is different but the historical authenticity of the buildings has been retained. Some very interesting modern art (Penelope our hostess is an artist) decorates the rooms and the main house. With four couples we enjoyed having \"the Cottage\" to gather together where David and Penelope lit a fire for us each afternoon. Penelope and David are the ideal hosts, very welcoming and informative and interesting to talk to. Continental breakfasts were varied, hearty, fresh and delicious. The only drawback is that the large rural property is surrounded by busy roads but the noise seemed distant and visually it did not detract from the setting as the the roads were hidden by greenery and far enough away not to be intrusive. If you are very light sleeper the road noise might bother you but it didn't bother me.Tranquil setting with the attraction of living in an historical building. Something out of the ordinary. You need a car but it is not far to Hobart central and we found it a good set off point for Port Arthur, 90 minutes away.", "title": "Staying in a restored historical building in a rural setting was appealing", "user": "Travel_addict13_10", "date": "November 7, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 86231528}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled with family", "text": "We stayed here for a couple of nights. The hosts were very accomodating and set up a lovely cot for our baby. Our room was beautifully decorated, although travelling from Queensland we found it a bit cold (the bathroom was freezing and could certainly benefit from some heat lamps!). The room had lovely soft fluffy towels, gorgeous bed linen. Breakfast was nice and lovely quality. The location wasn't a problem as we had a hire car.", "title": "Lovely historic room", "user": "Jen_Tony", "date": "October 19, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 84039930}, {"rating": 3.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "Beautifully restored stables, old farm feeling with animals and old homestead, great breakfast BUT.........since it was saved from demolition for a freeway the roadway literally surrounds it and the traffic is relentless all day all night, trucks, hoons in utes, etc. Spoiled the weekend, but not a lot they can do about it. No shops, no transport or even half decent bottleshop. Won't stay or recommend to friends.", "title": "Highway Through Heaven", "user": "lyndingo", "date": "October 24, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 2.0, "rooms": 4.0, "location": 1.0}, "id": 119656345}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "We were very lucky to snare a last minute room at Cleburne...the hosts were delightful, the breakfast immense, fresh, local & utterly memorable.", "title": "Wonderful escape just up-river from Hobart", "user": "Colin S", "date": "October 17, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 119384779}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "The amazing, lovingly restored old stables (that we were in, there are other restored buildings with a range of accommodations) are cosy, soundproof & afford a solid sleep.", "title": "A fantastic and wonderful place with great service.", "helpfulness": 1, "user": "mxmas67", "date": "August 17, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116842235}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "Leave time for a leisurely breakfast on the massive table in front of the open fire - it will set you up for the day!", "title": "Rustic cottage with modern comforts", "helpfulness": 1, "user": "shireenwalker007", "date": "May 31, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 110710571}, {"rating": 4.0, "stay_parameters": "Stayed April 2011", "text": "You need a car to be staying here, but it is close to MONA (DO NOT miss MONA), & still just minutes to Hobart, so who cares?", "title": "Stunning modem art collection in 1820s homestead", "user": "Colin-Vince", "date": "April 24, 2011", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 105231684}], "location": {"country": "Australia", "continent": "South Pacific"}, "stars": 4, "variance": {"poor": 0, "average": 2, "very good": 4, "terrible": 0, "excellent": 21}, "slim_ranking": 0.5, "description": "Cleburne is a fascinating and luxurious art hotel located at Hobart, Tasmania. We offer bed and breakfast accommodation in heritage-listed sandstone buildings. The art hotel is furnished with contemporary Tasmanian and Australian artworks. With the fusion of new and old, Cleburne Homestead is one of the most earliest original heritage accommodation in Tasmania.We are the perfect spot to stay during your explorations of different beautiful places in Southern Tasmania. Our art hotel is a five minutes drive to MONA – the Museum of Old and New Art and fifteen minutes drive to Hobart's Constitution and Salamanca Place. Cleburne Homestead lets you experience art with our modern art collections embellished in every room.Cleburne Homestead is a place for comfort and relaxation. We have complete facilities for your satisfaction. You can choose from our five delightful suites: The Cottage, The Bakehouse, The Homestead, The Barn and The Stables. The Cottage is a two-storey suite with a queen-size bed and fully equipped kitchen. The Bakehouse has a free-standing bath furnished with Tasmanian art. Our Homestead is perfect for morning coffee and has private access to the Reading Room. You can enjoy the cosy atmosphere of The Barn and The Stables with its stone walls and leather furniture. Our two day beds can accommodate additional guests and children. Enjoy our delectable foods in our dining room or the verandah. Cleburne Homestead gives you the best bed and breakfast accommodation experience that you will never forget.Cleburne Homestead gladly accepts singles, couples and children and pets by arrangement. We take pride to our genuine hospitality and finest bed and breakfast accommodation. We are accredited with the Tourism Council of Tasmania and registered with GALTA. What are you waiting for? Spend a lovely time and enjoy the delights of Cleburne Homestead! Make your bookings now!"}