{"user_rating": 4.0, "review_count": 68, "name": "Cliffside Resort & Suites", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "Beautiful location above Lake Delton. All the Dells attractions are just minutes away, but Cliffside feels far removed from all the hustle & bustle. My multi-generational family reunion (20+ people) have been coming here for the past 4 years. We enjoy it here so much we don't even bother going into the Dells anymore. The pool/ whirlpool is fun for all ages! We enjoy just hanging out here. The atmosphere is very relaxed, the lakeside rooms have great balconys to enjoy the views. The kids enjoyed fishing down at hte piers, and pontoon boat rentals are close by.", "title": "Get away from it all- but still be in the Dells", "helpfulness": 1, "user": "mharti", "date": "June 19, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 114440426}, {"rating": 3.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "This is not a new mega-hotel, but an older charming family run place. Enjoy it for what it is....don't expect Wilderness or Kalahari. It's not too big, so even when it's full it doesn't fell crowded. The rooms are adequate, beds comfortable, and I've never had problems with smells or the drains.", "title": "Nice view with no frills.", "helpfulness": 2, "user": "stevem1711", "date": "October 13, 2010", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 83349713}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "Can't wait for next year!", "title": "Nice place to stay away from all the tourist commotion", "helpfulness": 5, "user": "FlakeyMcFlake", "date": "August 21, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 76210266}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled with family", "text": "We were looking for a decent place without the big mob of kids over the Columbus Day weekend. Looking at the website, this location was right in the heart of the Dells and neaby to the things we were doing. With a name like Cliffside, you got the impression of a quite hotel in the side of a mountain overlooking a smooth body of water. That is exactly what we got. Upgrade to the rooms with a balcony, but bring your own bfast. This hotel has no frills including no resraurant within walking distance and being asked to pay cash at check in. We didn't bring our laptop, but it might not have wifi. We were given an old fashion hard key to access the room.", "title": "Absolutely wonderful-better than expected!!", "helpfulness": 9, "user": "TravelLovers4", "date": "June 29, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 69144017}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled with family", "text": "All in all, decent if you have low expectations.", "title": "Great family run resort with great views...very clean and relaxing!", "helpfulness": 3, "user": "bigcatOhio", "date": "June 26, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 68743748}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "We have been staying at the Cliffside for years. The owners, Angie & Wally, treated us like family on our first stay. I don`t understand some of the bad reviews because we have stayed different times of the year and various room accomodations and we have never had a bad stay or a bad room. We especially love it here because you are away from all the hub-bub of the downtown and strip. The lake is so enjoying.I would not hesitate to recommend this hotel to anyone. If you should have an issues, I am sure the owners will make it right!", "title": "We Love This Hotel and Owners", "user": "4grannycakes", "date": "February 14, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 55959952}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "Beautiful place. Will definitely stay there again in the future!", "title": "LOVE IT!!!!", "helpfulness": 1, "user": "DebraChicagoIL", "date": "October 25, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 21203511, "likes": {"liked": "— The balcony view, indoor/outdoor pool, game room", "disliked": "— No water in Lake Delton when we were there"}}, {"rating": 2.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "We went here hoping for a relaxing night by the lake. Unfortunately, when we arrived, we noticed the room smelt like snuff...wintergreen I think. We left and turned the air conditioner on, hopin' i would improve the smelt, but it still did smelt kinds musky. The frigerator made noise and the sink wuz slow which I don't like whem I'm brushtin my teeth. I saw brown spots on the carpet which I thought it must be mouse droppings, but it turned out to be snuff too. Nice people stayed next door and a good value. We will stay here again.", "title": "Lovely room with snuff smell", "user": "Elvis56", "date": "July 4, 2008", "detail_rating": {"front_desk": 2.0, "business": 1.0, "service": 2.0, "cleanliness": 1.0, "value": 2.0, "location": 2.0, "rooms": 1.0}, "id": 17540930, "likes": {"liked": "— the campin", "disliked": "— the smell and the coffee"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "My boyfriend and I just came back from a three night trip. We stayed at Cliffside Resort in the corner Jacuzzi Suite. We paid $130.00 per night. The price we paid for a Lake view room is not something you will find anywhere else. I looked around, this is the cheapest price. It was very relaxing, very quiet. The view from our private balcony was amazing and calming. The rooms were very clean. The people working there were very nice. I would say the Resort is about five minutes from Downtown. Theres a great restaurant three minutes away, Moose Jaw Brewery, they have great food. We would definitely stay there again. We stayed at a few other places in the past but I think the view from this Resort tops it off. The price we paid for a Lake view room is not something you will find anywhere else. I looked around, this is the cheapest price.", "title": "Great Place to relax", "user": "Kasiaf", "date": "May 27, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 16445151}, {"rating": 4.0, "title": "Great Getaway, Real Dells Experience", "text": "My fiancee and I have stayed here two years in a row. We stayed 5 days each time and loved it, and even got engaged here! Yes, the rooms are older, but the price is low! You can't get a room in the Dells on the lake for that price anywhere. They also give a discount if you stay a certain amount of days. The smell people are talking about is the lake! It isn't the rooms. Anyone that has ever been to a lake or river knows what I am talking about.", "user": "crazyfortravel39", "date": "January 25, 2008", "id": 12981228}, {"rating": 5.0, "stay_parameters": "Stayed July 2011", "text": "This was a very nice hotel we stayed in July of 2011. Clean room clean nice pool's inside pool an outside pool. Fun for kids an adult'd had a nice little water slide for the outdoor pool. Pool's cleaned every night an morning. Nice game room by the pool. Has a pool table foss ball table air hockey table and a few video game's. If you have a boat they have dock space. Nice little picnic area down by the lake with picnic tables bbq grill fire pit's. Sandy little beach area.we had a room overlooking the lake that's the way to go. Otherwise you can get a room looking at the parking lot. If your staying here you need the water view room. They have balcony's with chair's an. Table. DON'T forget to ask for the discount card for attractions at the front desk. It will get you buy one get one free for food an attractions. Had a great time. DON'T let other reviews change your mind. The people who complain probably stay at 6 gold star resorts this resort is for people looking to have a great time in an awesome atmosphere for all age's. Would definitely go back.", "title": "Great value,Nice Hotel,Fun time's", "helpfulness": 1, "user": "xpocdude", "date": "August 3, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 116207911}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "This hotel is just as pictured on their website. The location was right on Lake Delton and we watched the Tommy B ski show a couple times from our room balcony. The hotel was somewhat dated in the decor, but everything was clean and in working order. We had a jacuzzi suite with a lakeview balcony and we really enjoyed it. It was just a 5-10 minute drive to where all the stuff goes on and about that far to drive to the casino. Having said that, the place was really quiet and peaceful at night. The outdoor pool area was nice with plenty of chairs and loungers. You don't have a bar/restaurant here and it doesn't have the perks the bigger, newer hotels offer but you also won't pay their outrageous rates nor deal with the crowds. This hotel was much more reasonable and well worth a stay. I don't think you'll be disappointed!!!", "title": "\"Older place, but clean & charming!\"", "helpfulness": 1, "user": "amieh40", "date": "July 29, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 5.0, "service": 4.0}, "id": 115943786}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "Was searching hard for a place near water and inexpensive. Since River Inn has been consumed by the \"Olympia\" conglomerate, (and their pool was not suppose to be working anyway) We lucked into finding the Cliffside Resort...", "title": "Love The Hotel but, steer clear of the Waterslide!", "helpfulness": 7, "user": "geeman2159", "date": "July 28, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 5.0, "service": 5.0}, "id": 115877205}, {"rating": 4.0, "stay_parameters": "Stayed June 2011", "text": "I really like the Place. Wonderful Hotel, great Location, price and excellent staff.", "title": "Lakeview rooms ... Breathtaking and relaxing", "helpfulness": 4, "user": "dellsfun", "date": "July 3, 2011", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 114993368}, {"rating": 1.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "I have only 1- caveat...", "title": "What a dump!", "helpfulness": 2, "user": "cseckert", "date": "June 20, 2011", "detail_rating": {"cleanliness": 1.0, "sleep": 1.0, "value": 1.0, "service": 1.0}, "id": 114582769}, {"rating": 2.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "We just returned from out weekend stay at the Cliffside Resort. When we arrived check in went good. The place looked nice from the outside. When we walked in our room there was a awful smell. I would say it smelled musty. My husband said it smelled like snuff. We turned the A/C on high and opened the windows for a few hours. When we came back to the room it still smelled but not as bad. So this was just the start of our bad experience. The A/C was so loud that it woke me up everytime it started up during the night. And that was very often. The fridge made noise all the time I only noticed it at night when I was trying to sleep. So you think all these bad noises and smells are bad right. Well then we go to take a shower and the tub is half full when we are done with the shower and my husband has to wait 20 minutes after me to shower so the tub would drain. The sink was also slow draining (that grosses me out when I am brushing my teeth). They also didn't clean the bathroom from day to day and when I stay in a hotel I want my bathroom cleaned. I clean mine at home everyday so I expect they should as well. I also believe they did not wash the sheets from day to day either. When I complained about these things they told me they would right them down and check into them. The guy that runs the place took a screwdriver with him and said he was going to get the hair out of the tub drain. The other problems I think are alway there so they didn't mention doing anything about those. They did not offer a discount. She said I should have mentioned it before checkout. I asked if the had another whirlpool sweet they could have moved me to and she said no. So what would have been the point.", "title": "Romantic Getaway", "helpfulness": 1, "user": "Juels", "date": "September 11, 2007", "detail_rating": {"front_desk": 3.0, "service": 1.0, "cleanliness": 2.0, "value": 2.0, "rooms": 1.0, "location": 4.0}, "id": 8696639, "likes": {"liked": "— The view of Lake Delton", "disliked": "— The smell in the room and loud A/C"}}, {"rating": 5.0, "title": "Great place to stay and relax", "text": "I would not stay there again. The view of the lake was great but did not make up for the rest of the things that where wrong with the hotel.", "user": "SukaNinja", "date": "August 29, 2007", "id": 8539194}, {"rating": 2.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "Excellent!! Great outdoor pool. Nice lake access. Staff very friendly.", "title": "Not what you would expect!!!", "helpfulness": 1, "user": "mames77", "date": "August 15, 2007", "detail_rating": {"front_desk": 2.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "location": 3.0}, "id": 8431641, "likes": {"liked": "— The attitude of the staff"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "Tim", "title": "Great Little Place", "helpfulness": 1, "user": "AlmdoiPad", "date": "July 5, 2007", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 8062965, "likes": {"liked": "— The location", "disliked": "— The people sitting on the steps right in front of the resort!"}}, {"rating": 4.0, "title": "Old Time Dells", "text": "MPLS/MN", "helpfulness": 4, "user": "Crzyjaney8", "date": "June 24, 2007", "id": 7975266}], "location": {"country": "United States", "city": "Wisconsin Dells"}, "variance": {"poor": 7, "average": 4, "very good": 24, "terrible": 1, "excellent": 32}, "aka": "Cliffside Resort And Suites", "slim_ranking": 0.226666666667, "description": "Overlooking beautiful Lake Delton, Cliffside Resort has been a relaxing getaway for over 30 years. All pools, indoor or outdoor, have panoramic views of the lake and the Tommy Bartlett Waterski Show. Our outdoor pool has a 60 foot water slide and floating polar bear. Suntan on our decks, fish off our docks, or enjoy an evening bonfire on the lake. Registered guests can also utilize our soothing sauna, workout in the exercise room, and play a game of billiards in the game room near the outdoor pool. The resort also offers picnic areas by the pool and on the lake for small and large group gatherings. Our rooms have balconies and standard amenities, including: 32 inch flat panel TVs, free WIFI, micro-fridges, hair dryer, coffee-maker, iron/board, and telephone. The room sizes range from 2 person Jacuzzi suites to 8 person family suites with handicap accessibility throughout the resort except for the lake front."}