{"user_rating": 4.5, "review_count": 201, "name": "Clove Hotel Zanzibar", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "We stayed here for six nights during a recent visit to Zanzibar. This hotel is a great place if you are a solo traveller, travelling with a partner or friends or with a family. There is a really nice terrace on the top floor which operates an 'honesty bar' -a cold beer here was a welcome relief after walking the hot dusty streets of Stone Town! The breakfasts here are also very good. Every morning we were offered a fresh selection of fruit, bread, eggs and juice, which is taken on the terrace. The location of the hotel is fantastic- within a few minutes walk from Forodhani night market, and in a nice part of the Hurumzi area. Reserving a room was easy- we sent an email to the hotel and then paid a small deposit using paypal. The hotel also has free wifi, which you can access either from your room or the terrace.", "title": "Friendly gem in the heart of Stone Town", "helpfulness": 3, "user": "MJ_1984", "date": "February 26, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 98140081}, {"rating": 4.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "One of the main highlights though of this place were the friendly staff who worked here, and the owner Lisenka. She was really helpful in organising tours for us, for example phoning up and booking us on to a day visit to Chumbe Island (a must!), as well as some of the more standard tours like the spice tour. We got the feeling that the hotel has good relations with local businesses, so taxis and tour operators booked through the hotel were always reliable and good value. It is also possible to order meals from the nice restaurant across from the hotel, which you can then eat on the terrace (if you don't want to go out).", "title": "Friendly place", "user": "jon o", "date": "February 15, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 96694856}, {"rating": 4.0, "stay_parameters": "Stayed January 2011, traveled with friends", "text": "I would definitely come back here on a return trip.", "title": "A nice hotel in the central part of Stone Town.", "user": "Sanna0479", "date": "February 14, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 96551262}, {"rating": 4.0, "stay_parameters": "Stayed February 2011, traveled with friends", "text": "We thought Clove Hotel was lovely and friendly. The room was nice, although not too big. The bathroom was nice with an open shower and a rustic feel. There was just a fan, which we expected, but it was a little stuffy, probably could have done with a/c and it was June so not the hottest time of the year.", "title": "Nice hotel and fantastic rooftop terrace", "helpfulness": 1, "user": "crassi", "date": "February 6, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 95696045}, {"rating": 3.0, "stay_parameters": "Stayed January 2011, traveled with friends", "text": "Breakfast on the roof terrace was relaxed and was a tasty couple of servings of eggs and varied tropical fruits.", "title": "Small rooms, good location", "user": "nissin", "date": "January 21, 2011", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 93969261}, {"rating": 3.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "We stayed here for two days as part of our 6 day stay in Zanzibar. The staff were friendly and our room was bare bones but comfortable. The hotel is centrally located and very close to the nightly seafood market at Forodhani Gardens. The rooftop lounge is a great place to relax after a day of sightseeing. The rooftop is also where breakfast is served and it is included. They have wi-fi and safes in the rooms which are nice perks. Our room was on the 2nd floor and the neighborhood can be a little loud going into the evening. So, if you are a light sleeper you will need ear plugs. Overall, the hotel is a basic but comfortable hotel.", "title": "Very Good Location", "helpfulness": 1, "user": "CalTraveler45", "date": "August 13, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 3.0, "value": 4.0, "service": 3.0}, "id": 116665973}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "enjoyed our stay here, good location for stone town and great breakfast mandazi.", "title": "Very convenient and good value", "user": "micknpaula", "date": "July 31, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 3.0, "value": 4.0, "service": 4.0}, "id": 116058833}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with friends", "text": "noisy location but nothing that you can do about that if you want this area of stone town.", "title": "Great place to stay in the centre of Stone Town!", "user": "Syd_Traveller_2011", "date": "July 26, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115784827}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "friendly staff and safes in the room for your valuables.", "title": "Great location, clean rooms, nice shower, super staff.", "user": "farah-iqbal", "date": "July 24, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115717983}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "free internet but not quite high speed", "title": "Lovely little gem in the heart of Stone Town. Staff welcoming & friendly with the whole family. Highly recommended.", "user": "Gotepi", "date": "June 21, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 5.0, "service": 4.0}, "id": 114608545}, {"rating": 4.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "We stayed at Clove Hotel for 3 nights before going to Nungwi. We loved the roof terrace. The breakfast was good. Our room had roof-fans and a safety box. We also had a small balcony. The room/hotel was clean but quite run-down. Nothing that bothered us though. We would definitely stay there again. The staff was very friendly and helpt us with taxi arrangements and to negotiate prices.", "title": "Great value and perfect location!", "user": "CissiB", "date": "June 17, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 5.0, "service": 5.0}, "id": 113977370}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled solo", "text": "Cozy hotel in the heart of the Stonetown. Rooms are nice and clean, although nothing special - they are more fit for backpacker-styled travellers and youth. Given lagging of Zanzibar in infrastructure development from other developed resorts, the hotel offers good value for money option. Staff are friendly and there is no problem that won't be resolved for you. Rooftop terrace is the good place to have breakfast and to chill out at night after your interesting and exciting day on the island", "title": "Great place to stay for 1-4 days", "helpfulness": 1, "user": "Yarrilo", "date": "April 30, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 106226935}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "I would recommend for short stays (1-4 days) for people who are travelling around and are are not going to spend their time in suite. Otherwise fancy hotels on beaches of Nzungi should be preferred", "title": "Excellent value", "helpfulness": 1, "user": "MillyandMike", "date": "April 22, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 105017948}, {"rating": 4.0, "stay_parameters": "Stayed February 2011, traveled with friends", "text": "Clove hotel was in a great location in stone town. Bars and restaurants all near by. Safe to walk around at night. The rooms were perfect although there was only a fan to keep the room cool. Very chilled out atmosphere. We loved the roof top, where there was a fridge with cold beer, you could take what you wanted and pay on leaving. No hassle. breakfast was fine and the service was great. in all we had a lovely relaxing time at this hotel.", "title": "Nice place with excellent service", "helpfulness": 1, "user": "aroundtheworld57", "date": "March 3, 2011", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 5.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 98736774}, {"rating": 4.0, "stay_parameters": "Stayed February 2011, traveled solo", "text": "The main feature of this guesthouse is clearly Lisenka. A very nice and knowledgeable Dutch lady who can and will arrange anything for you if you ask her. Nothing is a problem and will be solved for you in a very efficient European way while she makes phone calls on your behalf in Swahili. The rooms a little dated, but clean and the bathroom is for Eastern Africa pretty good. Water pressure as in many other places is a problem, but warm water isn’t. There is a safe box in the room, which is big enough for the standard things like camera and passports etc. The location of this guesthouse is also pretty good and the roof terrace is a nice place to relax and enjoy a cold drink and a bit of a breeze. Stonetown can be very hot and dusty, but the rooms don’t have AC, so it can be difficult to sleep as keeping the windows open brings in the noise from outside. The breakfast is pretty standard with fruit and eggs to order and you will enjoy it on the roof terrace. Lisenka will be able and willing to arrange anything for you from a taxi to a spice tour or a ferry ticket - just ask her. The best thing about it is that you will get a good deal as she knows local prices and will tell you if anybody wants to charge you too much.", "title": "Friendly staff, great location and excellent value", "user": "VickySor", "date": "March 2, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 98711377}, {"rating": 4.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "We stayed for two nights in Room 203 and one night in Room 303. Both offered good sized and clean rooms with a good sized ensuite. These rooms did not have balconies. The rooms had mosquito nets and fans, although the rooms did get especially hot on one night. The staff at Clove Hotel were really friendly, and the roof top terrace was superb. Breakfast was served on the roof terrace and offered a selection of fruits, breads, cooked eggs etc. The hotel felt safe with security by the front door at all times, and the hotel is well located for the waterfront at Stonetown. The accommodation is fairly basic but represented good value in our view.", "title": "Well located and reasonable value", "helpfulness": 1, "user": "Lcp1234", "date": "November 29, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 88528137}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "We stayed 3 nights there and although, our double rooms was quite dark (not a suprise anymore when in Africa), smallish (thanks to a massive comfi bed) and the neighbours were extremly noisy (we slept with ear plugs the whole time), we were happy with our stay. The breakfast was good and filling with eggs, bread, chapatis, jam, honey, avocado, tomato, fruits, tea and coffee and served on a breezy and lovely roof terrace. The terrace was also great to escape the heat of the day. The location was perfect, close to everything and the staff helpfull and friendly. Good value for money.", "title": "Nice option in the centre of Stone Town", "user": "Delphine73", "date": "October 20, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 5.0}, "id": 84268212}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "The rooms are quiet small and dark and the breakfast is a bit sparse. However the rooms were clean, the service was good, the location was convienient. So it's a good choice for the medium budget traveller.", "title": "Good medium budget option", "user": "Sarah S", "date": "September 14, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 79495120}, {"rating": 4.0, "stay_parameters": "Stayed June 2010, traveled with friends", "text": "Four friends and I spent two nights at Clove Hotel as a part of a Tanzania Holiday in June 2010. Clove Hotel is a good value in a great location in old Stone Town within very easy walking distance of attractions such as Forodhani Gardens, House of Wonders, Old Arab Fort. Rooms were clean, relatively roomy and comfortable. The five of us had two \"Family Rooms\". Each family room had en suite bath with hot water, a double bed and two single beds and a nice balcony overlooking the street. There was also a safe in each room for keeping valuables. Room rates include a nice breakfast of eggs, breads, and fruits, juice and coffee. The breakfast room is at the top of the hotel and has a great view of the city. Booking was easy via email. There is no restaurant at the hotel but there are restaurants within easy walking distance. We particularly enjoyed buying food from the vendors at Forodhani Gardens each evening. The traditional Zanzibari food was good, very reasonably priced and the walk back to the hotel in the evening was safe.", "title": "Clove Hotel is a good value in a great location", "helpfulness": 1, "user": "NancyAndFriends", "date": "September 9, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 78867956}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "Me and my boyfriend stayed here for 3 nights, 2 nights in a suite and then 1 in a double room the following week. The suite was gorgeous, light and spacious, with a balcony and beautiful bathroom. The double room was still nice with a lovely bathroom but it wasn't as spacious or bright as the suite and there was no balcony. However, the rooms were great value for money, particualrly as Zanzibar is all-round expensive in general, and it was perfectly located just a minutes walk to the water front and right next to streets and streets of little market stall-style shops. Breakfast came included in the price and was delicious. The staff were friendly and always happy to help. The beds were also massive and very comfy, and the rooms had a fan and mosquito net.", "title": "Fantastic location, bright rooms, lovely rooftop breakfast :)", "user": "AfricanAdventure17", "date": "September 8, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 78816251}], "location": {"country": "Tanzania", "continent": "Africa"}, "variance": {"poor": 6, "average": 12, "very good": 77, "terrible": 7, "excellent": 99}, "aka": "Clove Hotel Zanzibar Stone Town", "slim_ranking": 0.166666666667}