{"user_rating": 3.5, "review_count": 2476, "name": "ClubHotel Riu Bambu", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "Punta Cana is far one of the best (if not the best) tropical destination. A place with endless palm trees, miles of beach and sourced by the most turquoise sea I have ever seen. Me and my wife got to the RIU Bambu without expecting much of the hotel, once we got a very good deal (paying less than half of the price we paid to go to Sandals in Jamaica last December). The experience in Punta Cana was unbelievable. Besides the astonishing beach, the hotel was more than great! Everything starts by an extremely adorable staff, real people (not robots), funny, with smile in their face, with sincere good will in helping you in anything you want. The hotel is also very clean and the rooms and pretty well decorated.", "title": "Perfect Beach, Hotel and Staff for us", "helpfulness": 17, "user": "fabcunha", "date": "September 6, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 8667910, "likes": {"liked": "— Decoration, convenience, confort"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "Once Punta Cana is a very international tourist destination, you will see a very good equilibrium among tourist’s nationalities. Therefore, you can undergo a real foreign experience, flavoring a spectacular food, with a unique Dominican signature. (different than Sandals in Jamaica that we had the same damm food that we have in USA).", "title": "Great value - would definitely go again!", "helpfulness": 16, "user": "jesrambo", "date": "September 6, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "rooms": 2.0, "location": 5.0}, "id": 8666445, "likes": {"liked": "— Nice grounds, beautiful beach, excellent pool", "disliked": "— Guest Rooms"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "We definitely will come back to RIU Bambu. We made a couple of friends among that hotel staff, specially the adorable Felix and Osires (Swimming Pool Towel Guys), the barmen Sosa and Nicolas, and the waiters Diaz and Ismael.", "title": "We had a great time", "helpfulness": 16, "user": "eganmayChi", "date": "August 30, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 5.0, "value": 3.0, "rooms": 3.0, "location": 4.0}, "id": 8579966, "likes": {"liked": "— the ocean breeze and the beach, great coffee and quality time with loved ones", "disliked": "— leaving"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled with friends", "text": "We visited the RIU Palace and Macao, although larger and with more attractions, they didn't have the lay back atmosphere that we encountered at Bambu, with its bungalows and palm trees. It doesn’t worth paying more for those. We got to have lunch at RIU Taino. Their restaurant is right by the beach, what feels very good because the breeze. However, we missed the Bambu staff…", "title": "Great Vacation", "helpfulness": 9, "user": "Raechka", "date": "August 26, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 8510856}, {"rating": 3.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "We truly enjoyed our week-long stay at the Riu Bambu in Punta Cana. The staff was very friendly, the resort was well-kept, and the beach was fantastic. The food was typical for an all-inclusive resort...not gourmet, but I could ALWAYS find something to eat. The buffet had lots to choose from and everything was very good. The \"restaurants\" that they offer, however, aren't really \"restaurants\" we discovered. They are the pool-side cafe turned Italian Bistro and Steakhouse. Nothing wrong with that - just want you all to be informed that it's not a \"separate restaurant.\" The room left a little to be desired, I'll be honest. But, we spent so little time in there that it didn't really matter. It was cleaned daily, it was spacious, had a nice patio, and we loved the in-room bar!! It wasn't a 5-star room, though, in my opinion. The beach was FABULOUS! Lots of lounge chairs...beautiful sand...clear water (most of the time!). We parasailed, which I highly recommend, and also took the Carribean Festival excursion, which was a lot of fun. All in all, I definitely give this place a thumbs up. We've stayed in several all-inclusives and we were very pleased. We will definitely go back to visit again!", "title": "Vacation Getaway", "helpfulness": 4, "user": "SandraS", "date": "August 22, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 8470340}, {"rating": 3.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "Thomson! – We booked this holiday with Thomson and I will never ever go with them again. What a joke! I have been on lots of long haul flights where an individual built in screen is part of the standard package on your flight. Well not with Thomson! If you want this, it is classed as an upgrade and you have to pay £95 per person each way for the privilege! If you don't want to do this and have a window seat, it is near impossible to see the TV screen past the overhead storage. We had one hot meal and one cold meal on the flight which I also thought was poor. I thought this was going to be the start of a terrible holiday but it's just as well the hotel was nice. The Thomson reps at the hotel were only ever around trying to sell you the excursions and other peoples left over suncream and shampoo. We rarely saw them which was a good thing I suppose as they thought they were funny but they were cringeworthy. The German rep was much more competent. She was on hand for her guests everyday.", "title": "Never with Thomson again!", "helpfulness": 11, "user": "Natalie5798", "date": "August 10, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 5.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 8383159}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "Beach – Everything that is said about the beach is true. It really is fabulous! The sand is soft and white and the sea is very clean. It’s really easy to get sunloungers on the beach at any time of the day.", "title": "Blissful Relaxation", "helpfulness": 12, "user": "azaria11", "date": "August 8, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 3.0, "location": 5.0}, "id": 8372843, "likes": {"liked": "— Great attention to detail, polite and attentive staff, good food, beautiful grounds, lovely beach", "disliked": "— umm"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "Food – The food is ok. Nothing spectacular but not too bad. There is a lot of variety and as long as you're not too fussy you can eat something different every day. The Caribe Grill restaurant was nice as it was right on the beach and the breeze was a godsend especially on clammy nights. There are loads of bad reports about the food but I thought it was fairly nice. We did go to the toilet more than usual, but I think a lot of that is to do with your body getting used to the change in the weather and climate, and also that you are eating different foods than you are used to. There's no point in getting a huge plate of fruit and complaining that you're going to the toilet more often. We took Imodium with us and it worked a treat! Definitely get some before you go just incase. We had no real sickness though.", "title": "GREAT Hotel, Staff - Food OK", "helpfulness": 4, "user": "RoCNewJersey", "date": "August 8, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 8372806, "likes": {"liked": "— Entertainment", "disliked": "— Food"}}, {"rating": 3.0, "stay_parameters": "Stayed June 2007", "text": "The pool – Although I never got an ear infection, there were many who did. I heard of a party of 11 people and 7 of them had ear infections from the pool. This is because people are peeing in the pool. The chlorine that is put in protects you to a degree but if you're never out of the pool, expect an ear infection, particularly if you are prone to them. Just take some stuff with you just in case. Beware of the doctors though! People who had ear infections went to the medical centre on the Riu camp and were sent straight to a hospital. Here they had to pay for someone to tell them they had an ear infection and give them some ear drops. You're insurance won't matter a jot as they want paying there and then and will put you under police guard until you've paid. Thomson then kindly tell you that you might be able to claim it back once you've got back home. Thanks Thomson!", "title": "Mixed Feelings", "helpfulness": 4, "user": "Sherdley", "date": "August 1, 2007", "detail_rating": {"cleanliness": 4.0, "front_desk": 4.0, "location": 3.0, "service": 4.0, "rooms": 3.0}, "id": 8272696, "likes": {"liked": "— Beach", "disliked": "— Not enough air conditioning"}}, {"rating": 3.0, "stay_parameters": "Stayed July 2007, traveled with friends", "text": "Kids! – As the summer holidays go on no doubt this place will be overrun with little brats who have no idea how to behave. The English kids and usually the American kids were fine but there were many (of foreign nationality) who were let loose by their parents to spend all day in the pool while they went on the beach. Please look after your kids if you take them away! Anything could happen to them. The reps are there to entertain them not to be used as a baby sitting service!", "title": "Glad I Went!", "helpfulness": 3, "user": "FDP", "date": "July 31, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 5.0, "location": 4.0, "rooms": 3.0}, "id": 8268226, "likes": {"liked": "— The beach!", "disliked": "— Nothing!"}}, {"rating": 5.0, "title": "Wonderful Riu Bambu", "text": "I have been at Riu Bambu with my husband between the 1.9.07 until 8.9.07.", "helpfulness": 13, "user": "catucha", "date": "September 23, 2007", "id": 8863832}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled with friends", "text": "What I can say is that it is a pleasant place with nice people.", "title": "muy bien gracias!", "helpfulness": 7, "user": "kdando", "date": "September 22, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 5.0}, "id": 8851778, "likes": {"liked": "— the beach the pool and the caribe grill", "disliked": "— the room is dated, the staff is a bit apathetic"}}, {"rating": 4.0, "title": "Relaxing time", "text": "The beach is very fascinant with warm water and I feel so", "helpfulness": 18, "user": "Swansea101", "date": "September 16, 2007", "id": 8724014}, {"rating": 2.0, "stay_parameters": "Stayed June 2007, traveled with family", "text": "calm and happy that I do not want to come home.", "title": "i,m english and i dont think this is such a great place", "helpfulness": 5, "user": "burn007", "date": "September 15, 2007", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 1.0, "value": 2.0, "rooms": 3.0, "location": 1.0}, "id": 8718347, "likes": {"liked": "— coming home", "disliked": "— arriving"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled with family", "text": "The food is good and always with different things to choose.", "title": "fabulous", "helpfulness": 15, "user": "holz_girlz", "date": "September 12, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 8703326, "likes": {"liked": "— cleaness", "disliked": "— nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "Just back from the RIU Bambu. First off, I must say tripadvisor.com was very helpful for the planning and deciding of our final destination and other travelers opinions were great to read.", "title": "A very nice resort for the price", "helpfulness": 14, "user": "Pars1978", "date": "February 18, 2008", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 4.0}, "id": 13664927, "likes": {"liked": "— The Beach", "disliked": "— Lack of bathrooms and bars near the Beach"}}, {"rating": 2.0, "stay_parameters": "Stayed February 2008, traveled with friends", "text": "So, where do I begin......our room was basic, nothing fancy, but it was cleaned very well daily and our fridge was freshly stocked with water, 7up, pepsi and beer throughout our stay. Some previous reviews spoke of \"thin walls\" and the ability to hear your neighbors real easily, but this was rarely the case. Now, most mornings people were out and about between 7-8am, so you would hear doors slam and people walking past the room and sound carried in the hallways. No big deal, why sleep in when the beach/pool are waiting!", "title": "Never again !", "helpfulness": 3, "user": "galina1994", "date": "February 18, 2008", "detail_rating": {"front_desk": 3.0, "service": 2.0, "cleanliness": 3.0, "value": 2.0, "rooms": 2.0, "location": 4.0}, "id": 13644785, "likes": {"liked": "— beach", "disliked": "— room and beach towels"}}, {"rating": 2.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "As for the food, my wife and I \"played it safe\" and didn't gamble on stuff we normally wouldn't eat. We ended up doing morning breakfast buffets daily (which resulted in eating little if anything for lunches other than a snack). For dinner of our six nights, we did the buffet 3 times and did a la carte 3 times.", "title": "Don't Go", "helpfulness": 7, "user": "ryan0603", "date": "February 16, 2008", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 5.0, "cleanliness": 4.0, "value": 2.0, "location": 4.0, "rooms": 1.0}, "id": 13606550, "likes": {"liked": "— the staff", "disliked": "— the accomodations"}}, {"rating": 1.0, "stay_parameters": "Stayed February 2008, traveled with family", "text": "The breakfast buffet had a huge variety of items, we loved the pastries and especially the homemade donuts (made right on the spot). The pancakes and french toast were also good (and made on the spot as well).", "title": "Worst place I've ever been too", "helpfulness": 6, "user": "TonyTifosi", "date": "February 16, 2008", "detail_rating": {"front_desk": 2.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "rooms": 2.0, "location": 2.0}, "id": 13598208, "likes": {"liked": "— The nightly entertainment", "disliked": "— The service"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2008, traveled with family", "text": "Lunches like I said, consisted of a quick snack at one of two possible lunch locations.", "title": "Fun Resort!!!!", "helpfulness": 8, "user": "aburg1964", "date": "February 14, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 5.0}, "id": 13560996, "likes": {"liked": "— beach", "disliked": "— no bar on beach"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "My parents booked us this trip for a honeymoon after our wedding. The Riu Bambu was a beautiful resort, very clean, nice vegetation, and the beach was incredible - powder sand, fair amount of shade via palm trees and a relatively calm sea. The swimming pools and poolside areas were also clean and fun. We arrived at the beach/pool at about 9 am each day and we always found a chair, although not always under a hut/tree.", "title": "Had a Great Time at the Bambu", "helpfulness": 5, "user": "phidelt1499", "date": "June 13, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 16889243, "likes": {"liked": "— Definitely the beach!", "disliked": "— The beds and pillows"}}, {"rating": 1.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "The resort rooms were clean and well appointed; cold AC, provided room safe, cable TV, patio, good mini bar and they always kept the drinks replenished (although I did tip the housekeepers twice throughout the week...). The beds, however, are hard as a rock and the pillows are flat. I realize that you don't usually go to all-inclusive resorts to stay in the room, but by the end of the week, I'd had enough with the bed. Also, the tap water in the DR is not potable, so be sure to brush your teeth with and drink the provided bottled water - my wife and I both did this and we were not sick from the water at all. Other than those two criticisms, the rooms were good.", "title": "This place is suspect", "helpfulness": 3, "user": "BeadedMohawk", "date": "June 9, 2008", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 2.0, "cleanliness": 2.0, "value": 1.0, "location": 4.0, "rooms": 1.0}, "id": 16797975, "likes": {"liked": "— Beahes", "disliked": "— Everything else"}}, {"rating": 2.0, "stay_parameters": "Stayed June 2008", "text": "The food was also pretty good, but by the end of the week I had enough of the \"Colonial\" food. The dinner menu changes its main entrees, but the lunches and breakfasts were essentially the same throughout the week. There is a large selection however, so you don't have to eat the same things day in and day out. We made reservations at both the Caribe Grill and the Italian Restaurant. The Italian was ok but the Caribe Grill is very good. I would definitely recommend eating there at least once.", "title": "No go for the RIU Bambu", "helpfulness": 4, "user": "zzblack", "date": "June 8, 2008", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 4.0, "cleanliness": 3.0, "value": 2.0, "location": 5.0, "rooms": 2.0}, "id": 16760222, "likes": {"liked": "— Nice Beaches", "disliked": "— Bed"}}, {"rating": 1.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "The hotel did provide some watersports for free although I didn't use any of it. We did do a full day excursion through our trip representative (Turinter) and that was $90/person (USD).", "title": "Riu POO POO!!!", "helpfulness": 4, "user": "Ian35", "date": "June 4, 2008", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 2.0, "cleanliness": 2.0, "value": 2.0, "location": 2.0, "rooms": 3.0}, "id": 16677900, "likes": {"liked": "— Beach", "disliked": "— Food"}}, {"rating": 1.0, "stay_parameters": "Stayed May 2008, traveled on business", "text": "The resort was also mostly hispanics and europeans (French and German mostly). We were there for 7 days and only met 3 other Americans. If this doesn't bother you, you'll be ok, but it's something to consider if you're not used to being the minority. The people (both tourists and hotel staff/locals) were friendly. One thing that really bothered me however was the prevalence of beach walkers and vendors outside of the hotel. They constantly bother you to buy this or go on that trip or get a massage. It is not so bad at the hotel except for Friday and Saturday nights when the hotel allows table vendors to line the lobby - it's like running the gauntlet when your trying to get to dinner ;)", "title": "Very Bad 5 Apple Sqaure Deal Resort", "helpfulness": 7, "user": "repowomen", "date": "June 2, 2008", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "location": 2.0, "rooms": 2.0}, "id": 16596563, "likes": {"liked": "— beach", "disliked": "— apple rep.hotel staff,room with views."}}, {"rating": 4.0, "stay_parameters": "Stayed June 2005, traveled as a couple", "text": "Arrived at the Bambu and was amazed at how beautiful it is...fantastic gardens, beautiful buildings and great pools. It is in an ideal location of being right on the Punta Cana beach.", "title": "Paradise", "helpfulness": 4, "user": "rosieanddanny", "date": "August 6, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 18678979, "likes": {"liked": "— The setting, The gardens and The All-inclusive"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "I really rate this hotel if you are looking for luxury, a romantic holiday, relaxation yet the opportunity to do water sports snorkelling etc. (All included! :o) )", "title": "Good for a week relaxing break", "user": "Mackem_27", "date": "August 5, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 4.0}, "id": 18657173, "likes": {"liked": "— Friendly staff, massage service excellent", "disliked": "— No air conditioning in the restaurants"}}, {"rating": 3.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "Everyone seems to complain about the food yet you are in the Carribean- it is the third world!! There was always plenty to choose from in the buffet- some of the food may seem a bit \"manky\" but there is always plenty to choose from. The best thing about the food is that they do theme nights. Mexican night was fab. The staff were dressed up- fruit displays were fab and the food was delicious.", "title": "Amazing beach!", "helpfulness": 1, "user": "Travelfun08_8", "date": "August 4, 2008", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 2.0}, "id": 18622496, "likes": {"liked": "— beach", "disliked": "— no air conditioning"}}, {"rating": 3.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "We didnt manage to book into the restaurants which was a shame as we left it too late but they looked great. We did plenty of trips which arent cheap but are well worth it. Eg- Monster truck, dolphin encounter, etc. If you dont do the trips there is plenty to do by the pool, eg aerobics and sports.", "title": "Beautiful beach,Not so great hotel!", "helpfulness": 1, "user": "PiratesSmile", "date": "July 31, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 5.0, "rooms": 3.0}, "id": 18473783, "likes": {"liked": "— The Beach", "disliked": "— The Pool"}}, {"rating": 3.0, "stay_parameters": "Stayed July 2008, traveled with friends", "text": "The pool bar was fab. Amazing smoothies. The entertainment was good. Lots of shows and games.", "title": "Nice staff, great beach but food just ok...", "helpfulness": 1, "user": "Lola70", "date": "July 30, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "rooms": 3.0, "location": 5.0}, "id": 18439397, "likes": {"liked": "— beach", "disliked": "— Repetative food and weak air conditioners."}}, {"rating": 1.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "the RIU bambu - needs a refurb and staff to be trained!", "title": "worst riu hotel ever!", "helpfulness": 2, "user": "oldenglish11", "date": "July 10, 2008", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 1.0, "cleanliness": 3.0, "value": 1.0, "location": 4.0, "rooms": 2.0}, "id": 17744683, "likes": {"liked": "— checking out", "disliked": "— most of it!!"}}, {"rating": 3.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "we have stayed at many RIU hotels without a problem and 5 star service hence booking into the RIU bambu.", "title": "Adults Beware", "helpfulness": 1, "user": "Goodiesx2", "date": "June 30, 2008", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 3.0}, "id": 17373808, "likes": {"liked": "— The beach", "disliked": "— Kids in the pool"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "The hotel is rated a 5 star, rated a 4 star with our tour operator but iin reality its a maximum 3 star!! If you are english or american i would not reccomend there are loads of very rude french & italinans guests \"never heard of a waiting line\"", "title": "Honest Travel Agent View", "helpfulness": 10, "user": "alliealliecat", "date": "June 24, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 5.0, "rooms": 3.0, "location": 4.0}, "id": 17170745, "likes": {"liked": "— Fantastic Beach", "disliked": "— A la Carte Restaurnts"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled with friends", "text": "The rooms - on arrival we were givena room which was damaged - lampshades, floor tiles, tv, you name it as well as bein very damp. We were then moved to another which had similar faults but not to the extent of the previous and then were told that it was the best room available bearing in mind the hotel was only half full! 4/10", "title": "Amazing Trip to Riu Bambu", "helpfulness": 1, "user": "Randi1383", "date": "June 18, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 17036333, "likes": {"liked": "— Beach/Pool/Entertainment", "disliked": "— Having to leave"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "The staff - Staff are very rude, well thats unless you are older and can be taken of advantage easier. Restaurant staff were a mostly a joke - very sleezy with the women and constantly taking advantage of older guests. they have one thing on there mind and thats TIPS! which is the reason they favour the older guests. Along with them being very rude and you have probaly half chance of them ever getting you a drink at dinner (they are the worst staff i have ever had to put up with). 2/10", "title": "Riu Bambu - Muy Bien!", "helpfulness": 10, "user": "brajun", "date": "June 18, 2008", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 17025345, "likes": {"liked": "— Pretty much everything!", "disliked": "— Sporadic room cleaning times"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled with family", "text": "If you have booked here and are reading up on it now - don't worry.", "title": "Fantstic - a very special place.", "helpfulness": 8, "user": "bishyEastleigh", "date": "January 30, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 13114756, "likes": {"liked": "— Staff, Service, Amazing Beach, Fun", "disliked": "— Nothing - it is just perfect"}}, {"rating": 2.0, "stay_parameters": "Stayed January 2008, traveled with friends", "text": "It really depends who you are, as to whether you will appreciate the charms of this place.", "title": "Great beach, awful food, bedding, service", "helpfulness": 4, "user": "cmq62", "date": "January 29, 2008", "detail_rating": {"front_desk": 1.0, "service": 2.0, "business": 2.0, "cleanliness": 4.0, "rooms": 2.0, "location": 3.0}, "id": 13102801, "likes": {"liked": "— The beach", "disliked": "— The food"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled with family", "text": "What is most special is the atmosphere and the amazingly hard working, genuine staff. The people are warm, the hotel is fun yet relaxing, and everything is designed to help you forget about everything else.", "title": "Stop complaining! You get what you pay for!", "helpfulness": 7, "user": "yzernut_19", "date": "January 28, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 13077478, "likes": {"liked": "— Entertainment, Beach, Friendly Staff", "disliked": "— Not enough beach towels every day, tiny bugs on counter in bathroom"}}, {"rating": 3.0, "stay_parameters": "Stayed January 2008, traveled with family", "text": "I cannot believe anyone would criticise the food. It is superb - and I am fussy. The buffet is probably best of all, different every night, beautifully presented and delicious.", "title": "The Good and The Bad", "helpfulness": 11, "user": "icdbko32", "date": "January 28, 2008", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 13073026, "likes": {"liked": "— Beach", "disliked": "— Food wasn't what i would think of a 5 star hotel"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2006, traveled with family", "text": "The rooms are fine - spotless and comfortable. Not huge, but 3 of us together were more than happy.", "title": "Suepups & Big Dave's Caribbean Adventure", "helpfulness": 7, "user": "Susipups", "date": "January 27, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 13027644, "likes": {"liked": "— Location, Location, Location", "disliked": "— Security"}}, {"rating": 1.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "The flight was good and we were greeted by friendly people when we arrived in Punta Cana..", "title": "holiday from hell", "helpfulness": 2, "user": "dawn01", "date": "June 18, 2008", "detail_rating": {"front_desk": 3.0, "service": 2.0, "cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "location": 3.0}, "id": 17013088, "likes": {"liked": "— beach", "disliked": "— pool area"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "The hotel..", "title": "Don't Get All the Bad Reviews", "helpfulness": 10, "user": "oceans11Maryland", "date": "June 17, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 16995029, "likes": {"liked": "— Cleanliness and staff", "disliked": "— Nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled solo", "text": "Riu Bambu exceeded our expectations..The staff was greatly helpful and were always there when we needed anything..We were greeted at the lobby when we first got there with a drink in our hand..The rooms were very nice and very clean..The bungalow set up made it feel like we were really on a vacation..We asked for a room closest to the beach and a second story room and they were more than willing to give it to us..There were 3 of us and they even gave us a cot so we would be more comfortable. We always got extra towels and everything without even asking..The pools were very nice and clean..There were always chairs around and we didnt have to get up early to save one..The beach was absolutely amazing and the water was beautiful..There was an abundent amount of chairs and once again we didnt have to get up early to get one..The food was good and we were very satisfied with the buffet that we never even went to the restaurants..They have an entertainment team that works hard during the day and at night to keep us happy and smiling..They put on great shows at night..I was very happy with everything with the hotel and the amazing service we got", "title": "Beautiful Bambu", "helpfulness": 9, "user": "xmasgurl", "date": "June 14, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 16923061, "likes": {"liked": "— Beach", "disliked": "— Beds"}}, {"rating": 4.0, "title": "Paradise on earth", "text": "I've been for honeymoon at the Bambu and everythings started great. Welcome drinks at the arrivel, a quick introduction and after 5 minutes in our room the luggage also has been brought - What a service!!", "helpfulness": 13, "user": "A TripAdvisor user", "date": "July 3, 2006", "id": 5419352}, {"rating": 4.0, "title": "We had a great time!!!", "text": "The rooms are verry clean and the room maid had good ideas how to decorate the rooms. Red balloons, towells modelled to some kind of animals or hearts with different types of flowers. One night there was some noise because of an animal on the roof but just after one call the problem was solved by the room service and there was no further animal during our stay.", "helpfulness": 15, "user": "A TripAdvisor user", "date": "June 27, 2006", "id": 5395206}, {"rating": 4.0, "title": "Beautiful, Beautiful Beach", "text": "We were there 2 weeks and the only thing that is a little negative (but you have to no this before travelling there) is that there is no town or something like that outside the Hotels were you could go for a walk. The only way to get some impressions is to book a jeep safary and to visiit some traditional places in the \"outback\"...", "helpfulness": 20, "user": "A TripAdvisor user", "date": "June 24, 2006", "id": 5380021}, {"rating": 5.0, "stay_parameters": "Stayed June 2006", "text": "The beach is greeeeaaaaat!!! I've never seen something like that before. And it doesn't matter if you are sleeping long or wake up early. You will ever get a chair at the beach under the palms.", "title": "Loved the Bambu!!", "helpfulness": 19, "user": "beccybobeccy", "date": "June 22, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 5373765}, {"rating": 1.0, "title": "bambu snafu", "text": "Annimation is ok. But don't think that they have always higher level shows. The bars are also good but take care. They don't save the rum...", "helpfulness": 17, "user": "A TripAdvisor user", "date": "June 20, 2006", "id": 5364324}, {"rating": 3.0, "title": "Great Time at Riu Bambu!!", "text": "My husband and I stayed at Riu Bambu from Jan 22 to 29,06. We had a great time, the werather was wonderful. Here are some pointers.", "helpfulness": 16, "user": "A TripAdvisor user", "date": "January 30, 2006", "id": 4398816}, {"rating": 4.0, "title": "Riu good time", "text": "Rooms: We had a standard room which was nice, nothing spectactular, but thats what a standard room is.. We didn't see any creepy crawlers which is a good sign.. Housekeeping was good, and they always refill you mini fridge.... There are alarm clock just make sure not to turn off the power switch near the door, that will turn off the power for the clock, then you'll have to reset it once again... Other then that it was all good..", "helpfulness": 27, "user": "A TripAdvisor user", "date": "January 30, 2006", "id": 4397753}, {"rating": 3.0, "stay_parameters": "Stayed January 2006", "text": "Entertainment: Sorry to say, we didn't enjoy it at all, kind of boring.", "title": "Had a good time", "helpfulness": 11, "user": "yawaii30", "date": "January 28, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "service": 4.0}, "id": 4394396}, {"rating": 3.0, "stay_parameters": "Stayed January 2006", "text": "Food: The food was good, one night at the Colonial (buffet) they had Mexican night which was a hit and another night they had Caribean night, which was also good. Unfortunatley we didn't get to experiance the a la carte, if you want to book it they you have to wake up at 7am because if your later than that you wont get a booking. TRUST ME!!!!", "title": "Nice on the surface!", "helpfulness": 11, "user": "MarkWindsorOntario", "date": "January 25, 2006", "detail_rating": {"cleanliness": 2.0, "value": 3.0, "rooms": 2.0, "service": 4.0}, "id": 4387860}, {"rating": 4.0, "stay_parameters": "Stayed January 2006", "text": "Staff: Everyone is very friendly expecially the entertainment team. They keep you entertained during the day with many different kinds of activities.. and if you have kids they are great with them.", "title": "Very Enjoyable Stay", "helpfulness": 12, "user": "SamsClub", "date": "January 24, 2006", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "service": 3.0}, "id": 4385541}, {"rating": 4.0, "stay_parameters": "Stayed February 2006", "text": "My boyfriend and I just returned from the Riu Bambu - stayed four nights from February 17-21. Good points and bad points but all in all, a great time and a very good value for the money.", "title": "A fun time......", "helpfulness": 22, "user": "lolasmom", "date": "February 22, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "service": 4.0}, "id": 4478538}, {"rating": 4.0, "stay_parameters": "Stayed February 2006", "text": "PROS: The beach - absolutely gorgeous and you can walk for miles. Lots of topless women walking around which you get used to. Mostly by people who probably \"shouldn't\" but that's our American upbringing I guess. Plenty of lounge chairs, soft white sand, chrystal clear warm water, etc. We took a catamaran sailboat out two days in a row (included in price) and did the snorkeling excursion ($29 pp) Both wonderful. Our room was great, room 113, near the beach and the dining facility, 2nd floor. One of the best rooms at the hotel. The staff was excellent, friendly and accomodating. The drinks were strong, a little TOO strong - we had a few too many at the pool bar which was ...awesome, great party atmosphere, we met people from Austria, England, France etc and had a blast. Again, maybe too much fun. Fully stocked refrigerator and liquor, they were great about replacing whenever we needed.", "title": "Great holiday", "helpfulness": 12, "user": "doccers", "date": "February 19, 2006", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 4470892}, {"rating": 2.0, "stay_parameters": "Stayed April 2004", "text": "CONS: Beds were HARD, very uncomfortable. However, if you take along some Tylenol PM as I did, you won't even know, you will sleep like a baby! I highly recommend that.... No bar service at the beach, a little bit of a walk to the bar to get a drink. Bring large insulated mugs and they will fill those for you. The food....well good and bad. Breakfast at the Colonial buffet was great, omelettes made to order. A lot of greasy deep fried stuff for all meals and the grease smell was awful. Lunch at the Mamajuana snack bar was ok, I had to pick and choose and avoided the deep fried stuff. Pizza was always a safe bet. The meat looked weird so I didn't touch it. We did not do any ala carte based on things I've read. The food all in all was ok, some things really good, some not. My boyfriend did get sick and didn't feel well for a good part of the trip but he hung in there :) Probably a combination of the food and too many rum and cokes at the pool bar. Had to go ALL the way to the bar to get ice for the room for your beverages. Called front desk, they would not bring it up. No ice buckets so you had to get a plastic bag from the gift shop. Entertainment - ok - nothing great but we were too tired at night to really stay up for the 10:00 show. The Casino at the Palace was fun, but definitely a much older crowd and very different atmosphere, more formal I guess.", "title": "Bad for teens, good for adults", "helpfulness": 5, "user": "CTgirl123", "date": "February 18, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "service": 5.0}, "id": 4469441}, {"rating": 4.0, "stay_parameters": "Stayed February 2006", "text": "To sum things up, I didn't mind that the food wasn't the greatest, I found things that I really liked that were very good and avoided the other stuff. The beach, the pool, the dominican atmostphere, the staff, the water sports, the pool bar and the hotel itself (buildings and grounds were clean and beautiful) made up for some of the negatives.", "title": "It is what you make it", "helpfulness": 25, "user": "Douall", "date": "February 18, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "service": 4.0}, "id": 4469221}, {"rating": 4.0, "title": "Nice but not perfect", "text": "Having read reviews we arrived with mixed views on what the hotel would be like. We found the staff very friendly and responsive to your every need. The food was of good quality although somewhat repetitive. There were plenty of entertaining things to do and the beach was the best we have experienced in the Caribbean. The rooms were well equipped, including hairdryer in the bathroom. The all-inclusive package was extremely good value for money and certainly the most extensive we have experienced. We would not hesitate in recommending the hotel complex to our friends and relatives.", "helpfulness": 11, "user": "plovervacation", "date": "February 15, 2006", "id": 4463477}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "We were there for 4 days, loved it .", "title": "Good hotel, great stafff", "helpfulness": 3, "user": "crivas04", "date": "August 21, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 8467475, "likes": {"liked": "— the staff", "disliked": "— none"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "The staff was great and very pleasant , specially Osvaldo at the", "title": "best hotel ever", "helpfulness": 10, "user": "matsar2", "date": "August 16, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8438869, "likes": {"liked": "— Everywhere easy access"}}, {"rating": 3.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "Colonial restaurant .", "title": "overall good hotel", "helpfulness": 6, "user": "michelecm", "date": "August 14, 2007", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "rooms": 2.0, "location": 4.0}, "id": 8421991, "likes": {"liked": "— the staff", "disliked": "— beds, alcohol, no air during lunch/dinner"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "Hotel was clean , fun activities and the beach area amazing.", "title": "Good Time at Riu Bambu", "helpfulness": 11, "user": "TRIP421", "date": "August 11, 2007", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 3.0, "location": 3.0}, "id": 8394105, "likes": {"liked": "— The Beach and staff", "disliked": "— Buffet can get warm and sometimes repetitive"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "We are definitely coming back!!!", "title": "Loved the Bambu", "helpfulness": 7, "user": "bbexxx", "date": "August 10, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 8386130, "likes": {"liked": "— food", "disliked": "— undecided"}}, {"rating": 2.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "We stayed at the Riu Bambu from 31st Dec to 7th Jan 2008. The hotel rates itself as a 5*, thomson rate it as a 4*, I would say 3* max, the rooms 2*. The rooms need a good make over.", "title": "4*....more like 2/3*", "helpfulness": 3, "user": "pennie_pencil", "date": "January 16, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 1.0, "location": 3.0, "rooms": 1.0}, "id": 12685827, "likes": {"liked": "— The entertainment team", "disliked": "— The rooms"}}, {"rating": 2.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "The food wasn;t labelled up correctly, so if your fussy you don;t know what you can and can;t eat! The staff could speak hardly any english, which is strange as most people there seemed to be american.", "title": "5 Star, More like 3 Star!!", "helpfulness": 3, "user": "foxxie02", "date": "January 15, 2008", "detail_rating": {"front_desk": 3.0, "service": 5.0, "cleanliness": 1.0, "value": 2.0, "rooms": 1.0, "location": 4.0}, "id": 12667669, "likes": {"liked": "— beach, staff very attentive", "disliked": "— rooms, quality, value compared to other like priced hotels"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled with family", "text": "We had to change rooms due to the smell of sewerage.We also had to get the shower head changed due to it not working. We had to have a technican out to the TV aswell as the reception terrible, but they didnt fix it.", "title": "We had a great time!", "helpfulness": 6, "user": "KarenTorontoToronto", "date": "January 15, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 3.0, "location": 5.0}, "id": 12642438, "likes": {"liked": "— Friendly staff, beautiful resort, great beach"}}, {"rating": 1.0, "stay_parameters": "Stayed January 2008, traveled with family", "text": "I wouldn;t go there again, I wouldn;' pay that much for it.", "title": "Butlins in Bavarro", "helpfulness": 6, "user": "ydm161", "date": "January 11, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 1.0, "cleanliness": 2.0, "value": 1.0, "location": 4.0, "rooms": 1.0}, "id": 12535028, "likes": {"liked": "— nothing", "disliked": "— in need of refurbishment"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled with friends", "text": "The did however think the entertainment team were fantastic, always had something going on to keep people busy and entertained", "title": "Excellent/Fun/Safe", "helpfulness": 8, "user": "girlsvac", "date": "January 7, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 12412829, "likes": {"liked": "— CLean, close to everything, ground floor good size", "disliked": "— First room was located directly behind a building - were moved - all good."}}, {"rating": 4.0, "stay_parameters": "Stayed January 2006", "text": "RIU Bambu 19th jan - 2nd feb sorry quite a long review...", "title": "Not good for Vegetarians, but lovely setting", "helpfulness": 19, "user": "windsurf-girl", "date": "February 13, 2006", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "rooms": 3.0, "service": 4.0}, "id": 4456369}, {"rating": 4.0, "title": "LOVED IT!!!", "text": "Overall we had a lovely holiday. The staff are very good and work extremely hard, the communal areas are lovely and kept clean.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "February 12, 2006", "id": 4455000}, {"rating": 5.0, "stay_parameters": "Stayed February 2006", "text": "I would like to comment on the following:", "title": "Ruuuiiillly Great", "helpfulness": 28, "user": "Riubabe", "date": "February 12, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 4454880}, {"rating": 1.0, "title": "Beautiful beach ...nothing more", "text": "Beach is lovely, white sands and lovely water. The water was quite choppy and the red flag was out for about ½ our trip, with a yellow flag for the rest of the time. I am not sure if we experienced a particularly windy time or if the weather is quite windy most of the time in Punta Cana. It did mean that the watersports were not operating for a large proportion of our time there (oh, and if you windsurf the equipment is awful, in very bad condition) We walked quite a way down the beach in both directions and I would say that the RIU hotels have a very nice stretch of beach. The beach is also lovely if you turn left, we didn’t think it was quite so nice if you turned right. (we walked for about 3km) but even so it was still really lovely. Take some bread out when you snorkel and feed the fish!", "helpfulness": 6, "user": "A TripAdvisor user", "date": "February 11, 2006", "id": 4452348}, {"rating": 5.0, "title": "While I was at the Riu Bambu...I LOVED MY JOB!!!!!!", "text": "Rooms", "helpfulness": 23, "user": "A TripAdvisor user", "date": "February 9, 2006", "id": 4449518}, {"rating": 3.0, "stay_parameters": "Stayed March 2008, traveled with friends", "text": "After having read both the positive and negative reviews posted at this site, I thought I'd chime in with some fair balance.", "title": "Uneven, but inexpensive", "helpfulness": 6, "user": "CelticMutt", "date": "March 11, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 2.0}, "id": 14218273, "likes": {"liked": "— Beach and Service", "disliked": "— Dinners and Bedding"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled with friends", "text": "I have some in depth commentary but for those looking for an executive summary:", "title": "Great vacation!", "helpfulness": 6, "user": "sabrams13", "date": "March 10, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 14196534, "likes": {"liked": "— comfortable room with working a/c, tv", "disliked": "— bedding"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "The price:value ratio is very good.", "title": "Heads up Bubbas", "helpfulness": 1, "user": "aljanNewmarket", "date": "March 10, 2008", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 4.0}, "id": 14193191, "likes": {"liked": "— Clean", "disliked": "— Hard pillow but yoou get used to them"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "Beach is one of the most beautiful we've ever been to.", "title": "definately recommended...great resort", "helpfulness": 3, "user": "MapleLeafwonderer", "date": "March 8, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 14148021, "likes": {"liked": "— Low rise bungalows", "disliked": "— Distance to beach if staying at a bungalow at rear of property"}}, {"rating": 1.0, "stay_parameters": "Stayed March 2007, traveled with family", "text": "Service is excellent. Tons of enthusiastic staff.", "title": "Love It!", "helpfulness": 3, "user": "Alyssabuzz", "date": "March 8, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 14132013, "likes": {"liked": "— Everything", "disliked": "— Nothing"}}, {"rating": 2.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "Hi,", "title": "Don't go !!!!", "helpfulness": 16, "user": "LadyI", "date": "August 29, 2006", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 2.0, "cleanliness": 2.0, "value": 2.0, "location": 3.0, "rooms": 1.0}, "id": 5725699, "likes": {"liked": "— Nothing", "disliked": "— Everything"}}, {"rating": 2.0, "stay_parameters": "Stayed July 2006, traveled with family", "text": "We stayed at the Riu Bambu from July 28, 2006 to August 12, 2006.", "title": "Disappointed", "helpfulness": 9, "user": "Schmiltz", "date": "August 27, 2006", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 2.0, "cleanliness": 3.0, "value": 2.0, "location": 4.0, "rooms": 3.0}, "id": 5712514, "likes": {"liked": "— the beach", "disliked": "— the treatment of the management"}}, {"rating": 2.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "There was nine of us in total. Myself and my hubby, (ages 36 and 39) and our two children (a boy 12, a girl 10), my parents (ages 67 and 64), and my aunt and uncle (42 and 42) with their son (age 14). Actually, it was my parents first trip down south.", "title": "Not a 4 star hotel!!!", "helpfulness": 8, "user": "Tizi", "date": "August 25, 2006", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 3.0, "cleanliness": 2.0, "value": 3.0, "location": 3.0, "rooms": 2.0}, "id": 5709230, "likes": {"liked": "— the beach", "disliked": "— the room, really cheap"}}, {"rating": 3.0, "stay_parameters": "Stayed August 2006, traveled with friends", "text": "This was my second trip to PC, and my parents, my aunt and uncles first trip to PC. This first time around we stayed at the Sunscape Punta Cana Grand (should have went back - we loved it there).", "title": "Great time...but watch what you eat and drink!!!", "helpfulness": 6, "user": "damst55", "date": "August 22, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 4.0}, "id": 5699543}, {"rating": 5.0, "title": "Best Week Ever!", "text": "Eight out of nine of us got sick (the first week) - that says it all (vomitting and running to the bathroom for a 24 hour period). I am still suffering. I went to the Dr's and have been put on medication, as I have a form of EColi, and parasite. Can you believe it???", "helpfulness": 16, "user": "Carina12345", "date": "August 8, 2006", "id": 5579381}, {"rating": 5.0, "stay_parameters": "Stayed September 2006", "text": "wow!!", "title": "\"i want......iwant to go ro riu\"", "helpfulness": 15, "user": "georgiapoop", "date": "October 2, 2006", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 5900493}, {"rating": 3.0, "stay_parameters": "Stayed August 2006", "text": "the riu bambu is a fabulous hotel and the experience my mum, brother and myself had there was one we will never forget!", "title": "Our first trip to the Dom Rep (wedding party)", "helpfulness": 12, "user": "bobbie80", "date": "September 22, 2006", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "location": 3.0}, "id": 5825240, "likes": {"liked": "— the sun", "disliked": "— bathroom"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2006, traveled as a couple", "text": "ok so the coach transfer to the hotel was the greatest but it gives you your first look at what a truely remarkable and diverse country the dominican is!!", "title": "Very relaxing time, great hotel....", "helpfulness": 11, "user": "tads", "date": "September 21, 2006", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 5822198}, {"rating": 5.0, "stay_parameters": "Stayed May 2006, traveled as a couple", "text": "on arrival we were greeted with a warm smile and handed Mai Tai immediatly! check in only took around 10 mins and all our luggage arrived at our room safe and sound!!", "title": "Dream honeymoon hotel", "helpfulness": 14, "user": "tommo82", "date": "September 19, 2006", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 5817842, "likes": {"liked": "— The beach", "disliked": "— Nothing I would say I did'nt like"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled with friends", "text": "on our first mornin, we were greeted on our terrace by a gr=ardener who was choppin coconuts for the bar! he kindly offered one to us and chopped it for us to have whilst gettin ready for breakfast! all the groundstaff, barstf and restaurant staff are friendly and helpful and willl do their best to talk to u in whatever language you speak!", "title": "***** Perfect Paradise *****", "helpfulness": 16, "user": "missmv1976", "date": "September 11, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5789213}, {"rating": 1.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "The Bad:", "title": "Bambu was TERRIBLE", "helpfulness": 6, "user": "bambustinks", "date": "May 30, 2008", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 2.0, "cleanliness": 1.0, "value": 1.0, "location": 3.0, "rooms": 1.0}, "id": 16530157, "likes": {"liked": "— The beach", "disliked": "— Everything else!!"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "*The room*", "title": "Fantastic Location", "helpfulness": 3, "user": "SexyTrucker", "date": "May 29, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 3.0, "value": 5.0, "rooms": 3.0, "location": 5.0}, "id": 16493732, "likes": {"liked": "— Fantastic beach", "disliked": "— Swim-up pool bar"}}, {"rating": 2.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "It was disgusting. We stayed on the first floor which was a bit of a hike from the lobby. The bathroom/room was infested with little ants and had a bad odor. The beds are hard as rocks and the pillows are flat and equally as hard (kinda felt like resting your head on a notebook). The water smells that comes out of the showers/faucet and they give you a gallon of bottled water to attempt to brush your teeth with. There was a liquor dispensor with thee CHEAPEST nastiest liquor in it and a few bottles of coke (which are the only bottled beverages you will be given throughout your entire stay...so savor them). There aren't any american outlets nor is there an iron or an ironing board. You can get an adapter (that is old and broken, and an iron that doesnt even steam and is 50 yrs old) from the front desk for $20.", "title": "Disappointed", "helpfulness": 3, "user": "Don61", "date": "May 27, 2008", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 2.0, "location": 1.0, "rooms": 1.0}, "id": 16446800, "likes": {"liked": "— Leaving", "disliked": "— Room"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled with friends", "text": "*The Food*", "title": "Great customer service......", "helpfulness": 2, "user": "2fun4maine", "date": "May 26, 2008", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 5.0, "cleanliness": 4.0, "value": 3.0, "location": 3.0, "rooms": 2.0}, "id": 16413336, "likes": {"liked": "— everything was included...", "disliked": "— the room and lack of AC and fans......"}}, {"rating": 5.0, "title": "The best vacation I've ever had", "text": "It was absolutely disgusting and misleading. **There is NOT a steak house or an italian restaurant... i repeat... there is NOT a steak house or italian restaurant** There are two places to eat on the resort: The colonial restaurant and the Mama Juana.", "helpfulness": 3, "user": "RandyBroderick", "date": "May 24, 2008", "id": 16372687}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "We got back today from what we both decided was our best holiday as yet!", "title": "Best holiday ever whats with all the bad feedback?", "helpfulness": 3, "user": "kayliesteve", "date": "July 18, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 18002847, "likes": {"liked": "— Everything", "disliked": "— We had to come home"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "The Riu Bambu is a lovely set out hotel with lots of buildings of about 8 rooms per building (looks much nicer than one big hotel block with hundreds of floors!) The building are all pretty pastel colours and surrounded by palm trees, and gardens.", "title": "Riu Bambu - The Good, the Bad and the Ugly", "helpfulness": 3, "user": "turnbulltribe", "date": "July 15, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 2.0, "location": 4.0}, "id": 17915664, "likes": {"liked": "— The beach", "disliked": "— Restaurants"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "Let me start by saying that having seen some of the negative reviews about the Riu Bambu on this site I was very aprehensive about our stay. However, how wrong they were and we had a fantastic time.", "title": "Loved it!", "helpfulness": 4, "user": "paulwinter33", "date": "August 27, 2008", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 19432045, "likes": {"liked": "— The Pools and Beach", "disliked": "— Nothing!"}}, {"rating": 3.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "Having arrived at Punta Cana Airport to a smart terminal with a thatched roof (!) I knew that standards on this island would be better than some of the others we have visited. We are a family of 4 (2 adults, 2 children (13 & 10) and travelled on a Thomsons package holiday to the resort.", "title": "Loved it", "helpfulness": 2, "user": "TwistedCandy", "date": "August 21, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 2.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 19213633, "likes": {"liked": "— beach, amount of people, activities", "disliked": "— not all inclusive 24/7 buffet closes at 10pm"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "The Riu Bambu is set on 35 miles of beautiful beach and is one of 5 Riu properties forming the Punta Cana resort. You can use the facilities of the other Rui Hotels (3 of) but not the two Palace Hotels. Having visited them all I am glad we choose the Bambu. All of the public areas are spotlessly clean and the gandeners are forever tidying up the landscaped gardens around the complex. There are two pools with plenty of loungers and large umbrellas around but there is a lot of shade due to the number of tall palm trees so you may find you are moving your lounger depending where the sun is. The beach is just fantastic and again with plenty of loungers all day. The towel hut did run out of fresh beach towels around lunch time so make sure you get them in time.", "title": "riu bambu we luv you!!!! go narly dudes!!!!", "helpfulness": 4, "user": "moleyhunny", "date": "August 19, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 19116636, "likes": {"liked": "— the beautiful beach", "disliked": "— leaving"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2008, traveled on business", "text": "The main restaurant (The Colonial) is very good with a massive choice. I can not believe you could not find something you would like from the massive range of salads, pizza, pasta, hot roasts, speciality dishes etc. Mamma Juana on a lunch time is very informal situated nearer the beach/pool and you can again sample a wide variety of both hot and cold things. You can go in there with just you beach wear. On an evening this becomes the a la carte restaurants of Italian and Steakhouse. We tried the Italian and had a really nice meal. Did hear some negative comments about the Steakhouse so we did not bother trying. The best restaurant was the Caribe Grill - had a lovely meal there one evening, situated on the edge of the beach, under a thatched roof with the sound of the sea etc etc.....Regretfully 2 days later it had had a fire and was reduced to a pile of ash on the beach but they were hopeful of having it rebuild by mid September.", "title": "Fantastic Hotel", "helpfulness": 1, "user": "DustyMidlands", "date": "August 18, 2008", "detail_rating": {"cleanliness": 5.0, "front_desk": 5.0, "location": 4.0, "service": 5.0, "rooms": 3.0}, "id": 19061522, "likes": {"liked": "— the atmosphere", "disliked": "— cold pool"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "The bedrooms were fine. They were clean and comfortable and we all found the beds/pillows to be fine. We opted just to have one room which had 4 beds in and this was a little cramped but it was our choice. The maids did a great job af tidying up after us and often left some fresh flowers or made a 'shape' out of a folded towel.", "title": "A Wonderful Holiday", "helpfulness": 1, "user": "JBs_advice", "date": "August 15, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 5.0}, "id": 18996704, "likes": {"liked": "— The setting on the beach and the hotel grounds", "disliked": "— No air conditioning in any of the communal areas, it was very hot and humid"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "Returned April 14 from the Riu Bambu after a gorgeous week of sun and fun. Everything was as expected and advertised and described here on Tripadvisor. My wife and I try to stay at Riu's where ever and when ever possible. the consistancy between restorts is amazing.", "title": "As Expected", "helpfulness": 1, "user": "frankp42", "date": "May 28, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 162197037}, {"rating": 1.0, "stay_parameters": "Stayed April 2013, traveled solo", "text": "Weather was perfect. Sunny and 85 all 8 days. Rained a few minutes late one night. Room was clean and done on a regular basis. Mini fridge was always replenished when required. Room itself was nice with very little extras. No hot water once for about an hour around 4 pm but that was the only complaint about the room. Oh ya, when booking I asked for a room closest to the beach. When we checked it we were given a room as far from the beach as physically possible. After we settled in I went to the front desk, explained our dilemma (informed the front desk girl that I was a Riu Club member and showed her my card which helps) and she explained that we can be moved tomorrow. Went back the next day expecting the worst but to my surprise we were moved to a room as close to the beach (and pools) as possible. WOW. AWESOME.", "title": "RIU Bamboo Punta Cana", "helpfulness": 2, "user": "Phil P", "date": "May 28, 2013", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 1.0, "sleep": 1.0, "rooms": 2.0, "location": 4.0}, "id": 162167555}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "The food was great. Never got sick at all. Lots of variety and theme nights. I didn't go hungry, that's for sure. And my wife was a picky eater. All the a la cartes were good with no real complaints. There is a bit of a line first thing in the morning for reservations but EVERYONE basically got a reservation at one a la carte or another.", "title": "Enjoyable Vacation", "user": "RMT18", "date": "May 28, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 162162518}, {"rating": 3.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "Beach and pools were AWESOME especially the beach. Make sure you visit the locals up the beach for good bargins but be prepared to haggle.", "title": "Somewhat Disappointing", "helpfulness": 2, "user": "btp-01", "date": "May 28, 2013", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 162113313}, {"rating": 3.0, "stay_parameters": "Stayed May 2013", "text": "All in all I truly believe we got what we paid for. A good resort for a decent price. If you're looking for luxury you have to go to the Palaces. More money but more service and variety. Like anything else... you get what you pay for. Besides, relax and don't sweat the small stuff and most of it is small stuff. Enjoy your holiday because after all that is why you are there :)", "title": "Not a 5 star but having a good time", "helpfulness": 2, "user": "biffaboo", "date": "May 26, 2013", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 3.0, "rooms": 4.0}, "id": 161918901}, {"rating": 4.0, "stay_parameters": "Stayed February 2008, traveled with friends", "text": "A group of 6 of us in our early 30's stayed at the Bambu the last week of February. Two years ago we stayed at the Taino and we liked the Riu properties enough to go back and try the Bambu this time. These properties are comfortable and clean and if you are going on vacation to have a great time and not nit pick then you will have fun. I tend to go on vacations and look at everything as my glass is half full, not half empty.", "title": "Another Great Vacation in Punta Cana!", "helpfulness": 6, "user": "KelleyHill", "date": "March 7, 2008", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 14116454}, {"rating": 4.0, "stay_parameters": "Stayed February 2008, traveled with family", "text": "Positives-", "title": "Great place for the money", "helpfulness": 1, "user": "MarleyBoston", "date": "March 1, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 13971328}, {"rating": 4.0, "stay_parameters": "Stayed February 2008, traveled with family", "text": "-Punta Cana is beautiful, the beaches are wonderful and the Dominican people are so friendly.", "title": "Had A Great Time", "helpfulness": 5, "user": "RUFUSBARK", "date": "February 28, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 3.0}, "id": 13921177, "likes": {"liked": "— VERY FRIENDLY", "disliked": "— ROOM SERVICE"}}, {"rating": 2.0, "stay_parameters": "Stayed February 2008, traveled on business", "text": "-The rooms are adequate sized and comfortable.", "title": "Very Disappointing", "helpfulness": 1, "user": "BigFishDaddy", "date": "February 26, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 2.0, "location": 3.0, "rooms": 2.0}, "id": 13857896, "likes": {"liked": "— friendlyness of common workers", "disliked": "— too much misrepresentation"}}, {"rating": 5.0, "title": "Loved the riu Bambu", "text": "-There is a large selection of drinks, both alcoholic and non alcoholic.", "helpfulness": 4, "user": "Princessa12", "date": "February 25, 2008", "id": 13844248}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled with family", "text": "I kept reading the reviews, after I booked and I was almost fustrated that I booked, until I actually got there. The hotel is beautiful, the beach spectacular, the rooms simple but for the amount of time you spend in them who cares. The animation team was the best, they work so hard. The food was different they can't cater to everyone, I ate like a pig for 7 days, The mini club for the kids is great also, the come around the resort and pickup the kids at 10:00am till 12:00 and played games with the kids, then again at 3:00 till 5:00, at 8:00pm every night they did a mini disco with the kids all dancing on stage, afterwards they gave out certificates to the kids that won the daily activities. The kids could run around the resort without worring. The staff was wonderful and fun ,the animation team had activities all day they walked around yelling, volleyball, darts, bingo etc...... and you could win rum,shirts, caps. So for all those planning a vacation there I say book you will have fun, look at the good of the hotel it outbeats the bad..........And for the ones complaining please book at the Riu Palace it's luxurious for the people never satisfied.", "title": "People stop complaining, great hotel !", "helpfulness": 8, "user": "cat_eyes33", "date": "January 26, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 3.0}, "id": 12999203, "likes": {"liked": "— The srvice and staff made you feel right at home", "disliked": "— The beds took getting used to"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled with friends", "text": "We just returned from a short 3 night 5 apple square deal. It was a short, but much needed trip. I have done 2 of the 6 golden apple square deals in the past. I did like the previous resort more, but \"you get what you pay for\". The biggest problem I had is the fact that Riu does not supply coffee in the room. I like coffee when I first get up, but this did not ruin my trip, or keep me from returning to the Riu Bambu. Also the water in the pool was a little cool, but this was not the resorts fault. The pool was nice, it washttps://tonic.tripadvisor.com/SavedPhotos-g150849-i17492915,17492916,17492917,17492918,17492919,17492920,17492921,18587448,18587449,18587450,18587451,18587452,18587453,18587454-w1-Punta_Cana_Dominican_Republic.html#18587448", "title": "5 Square Apple Deal", "helpfulness": 9, "user": "mkb607", "date": "January 23, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 12916102, "likes": {"liked": "— pool & beach", "disliked": "— needing reservation at resturants & no coffee in rooms"}}, {"rating": 1.0, "title": "Apple Honeymoon Trip Sucks", "text": "https://tonic.tripadvisor.com/SavedPhotos-g150849-i17492915,17492916,17492917,17492918,17492919,17492920,17492921,18587448,18587449,18587450,18587451,18587452,18587453,18587454-w1-Punta_Cana_Dominican_Republic.html#18587448 a little deep. When you got closer to the bar it was not quite as deep & not quite as cold. It was very clean & had good service at the bar. The staff was very friendly & hard working . There was a very nice beach & you could walk for a long way either direction. There was a nice brick sidewalk between the resorts. We had no complains with the room. We did not hear anyone in the rooms next to us, & there were people, we saw them in the hallway. The maid did not speak English, but we had no problem. We called for a wake up call & we needed a blanket, again no problem.. Sometimes I wonder if there are 2 resorts with the same name. There were 4 of us in 2 seperate rooms & none of us were unhappy. I think the best meal at the buffet was the breakfast. Since we were just there 3 nights, we did manage to eat at both the steakhouse & the Italian . resturants. They were both very good. A lot of the time, the beef out of the US is not that good. The ribeye was excellent & huge. I would return. We had a very good deal & a very nice time.", "helpfulness": 3, "user": "foxjm", "date": "January 22, 2008", "id": 12904781}, {"rating": 1.0, "stay_parameters": "Stayed January 2008, traveled with family", "text": "My now husband and I booked our trip thru apple vacations called a 5 apple square deal. We have gone out of country together 8 times. We have even done the 4 apple square deal before, but this one takes the cake. The whole experience for our honeymoon was horrible. The rooms were ok size, but we didn't have fitted sheets and every time you rolled over, the sheets came off. The bed, which was to twins pushed together to make a king were hard as a rock. I was tempted to sleep out on the balcony chairs. We could hear everything going on outside our room, the kids screaming, the maids yelling to each other every moring at 8am. mold and ants in the room, it was very unsanitary. We had to move rooms when we first got there our \"honeymoon suite\" was next to the tennis court and smelled like a sewer. The fan and airconditioning didn't work. When we moved the next rooms air conditioner would't shut off. As far as the toplessness, big deal we are in another country and you dont want tan lines guys. The spedo is just a horrible idea, but good for a laugh. We met really nice Canadian people and some European people. There were kids all over the place, and mind you they are cute, but I like a little quiet time. We found out after we got back that the week we were there and the week after was kids stay free. Dont get me wrong parents need vacations also, but why would Apple stick us on our honeymoon with kids free weekend is beond me. We wont be using them again. The pools were ok, but freezing. We saw staff pouring in buckets of ice at night, no wonder it never warmed up. The food was ok, but very repetitive and labels were wrong. The staff, I thought were very nice. I speak no spanish, but they tried to figure out what I was saying. They do need to learn mixed drinks a little better. Also they change the kegs around 1pm, so the beer is best then. They also say it is a 24 hour resort, not so because you can get no food after 10pm. I would not recommend this place unless you are to drunk to look at the rooms or have a family going with you. PS. Your neighbors can hear you when you pee in the bathroom and have sex. I heard our neighbors every morning on both counts, at least they had some good times. I would rate this a 3* hotel. Our apple 4* was a good 4*. I would't stay here if you paid me.", "title": "Do Not Go Here!", "helpfulness": 6, "user": "ROYALGATEWAY", "date": "January 18, 2008", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "location": 4.0, "rooms": 1.0}, "id": 12774199}, {"rating": 4.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "My family and I have been to Punta Cana at least twenty times, and we have never stayed at a resort as terrible as this one. I don't know who would call this resort a 5 star hotel; Riu Bambu is anything but. We stayed at Riu Bambu for 11 days, from December 28 2007 through January 7 2008. The rooms were tiny and absolutely plain; there were no ocean or pool views. Apple Vacations, along with Riu Bambu information online and otherwise, advertises that they are an all-inclusive, 24-hour service resort. This is not true; this resort may be a 24-hour paradise for alcoholics because the bars are always open, but good luck trying to find a bite to eat after 11pm, and there are also times during the day where all restaurants are closed. The food in the restaurants is equivalent to that of a 2-star hotel. Even on New Years eve, there was nothing special in the restaurants or otherwise. There are two small pools in the resort, and they are very deep. There is no spa in this resort. I have never heard of any 5-star resort that doesnt have a spa, and only has one buffet restaurant and one other restaurant on the beach. The disco is a good ten or fifteen minute walk from the resort, and drinks are not included there. Also, you have to pay for food at the bar outside of the disco. There were also piles upon piles of cockaroaches crawling around the lobby and bar areas. The only good thing about this resort is the entertainment team; which was excellent. The shows were pretty good. If you are planning on booking a vacation in Punta Cana DO NOT go to this hotel. Go to another REAL 5-star hotel in Punta Cana.", "title": "Nice Reasonably Priced Hotel", "helpfulness": 6, "user": "Chilly25", "date": "January 18, 2008", "detail_rating": {"cleanliness": 4.0, "front_desk": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 12769901, "likes": {"liked": "— Nice atmosphere, friendly staff", "disliked": "— Evening entertainment"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "Just reiterating the majority of the uk community who have stayed at this hotel, check-in quick and easy, room spacious and clean, buffet varied, beach and swimming pool areas clean. Hotel staff friendly. Colonial breakfast buffet is the main breakfast buffet, Mama Juana is an overspill for late risers for breakfast so doesn't have totally the full selection but lunch is served from 11.30am. As in any hotel accommodation, leaving valuables out is a temptation, there is a free safe in the room so make use of it. Free towels provided around the swimming pool on production of hotel card, plenty of sunbeds on complex. Read hotel guide in room as some water sports are free. Tip waiters and bar staff if you get good service. Saona - Caribbean cruising is a must as is the outback safari, if planning to go on outback safari please bring pencils, rubbers and exercise books with you as you stop at a school and they can accept these gifts. Don't rely on google for weather as it shows storms all the time and the weather is very hot.", "title": "Just arrived home today - great hotel/holiday", "helpfulness": 1, "user": "tinkz1", "date": "May 22, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 161524013}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "This complex was very large and spotlessly clean. Our room was very big with a huge bed. Above the mini bar there were 4 bottles of spirits with optics (changed every two days if you needed it). Food was plentiful and edible but not very exciting. All the staff were very friendly. The two things that were not perfect was: Many, many children (not english as during term time) and the evening entertainment left a bit to be desired but other than this brilliant.", "title": "Great place", "user": "Patsiepoo", "date": "May 22, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 161480333}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "We stayed at the Riu Bambu resort the week of May 4th, 2013.", "title": "Great vacation!", "helpfulness": 2, "user": "TravellingNBer", "date": "May 20, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 161322882}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "Pros :", "title": "A fantastic holiday", "helpfulness": 3, "user": "Margaret49", "date": "May 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 161263768}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "The resort itself is beautiful, very clean and well kept", "title": "The Best Holiday", "helpfulness": 4, "user": "Pete651", "date": "May 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 161231221}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "We were originally supposed to stay at the Colony Bay but we were upgraded to the Riu as the Colony wasn't finished yet. This was great!!! The food at the Riu is great, there is alot to choose from. They had pizza, breads, chicken, beef, fish, pasta, rice, potatoes, salads, and much more. Every meal of the day was great. The rooms were nice, nothing spectacular, but comforatable. The king size bed was two double beds pushed together. The room has a bar fridge that they stock with pop and beer every other day. They also have hard liquor. The beach is beautiful, except it was really busy when we were there over Christmas and it was hard to find 2 chairs. We had a great time except for it being so busy, I don't think we would travel at this time of year again. I'm not a crowd person. It was a great experience though.", "title": "Great Resort", "helpfulness": 7, "user": "pggurl", "date": "January 3, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 12306667}, {"rating": 2.0, "stay_parameters": "Stayed October 2007, traveled with friends", "text": "Previously I have stayed at the RIU Palace Riviera Maya in Mexico, which was amazing and only rated at half a star higher than the Bambu... so this hotel was a huge let down. Starting with when we arrived...", "title": "Great Beach, Bad servuce", "helpfulness": 4, "user": "Lady_Jay13", "date": "January 3, 2008", "detail_rating": {"cleanliness": 3.0, "front_desk": 2.0, "location": 4.0, "service": 1.0, "rooms": 1.0}, "id": 12303375}, {"rating": 3.0, "stay_parameters": "Stayed December 2007, traveled with family", "text": "Upon arrival it seemed as though there had been a staff mutiny, as there was no management to be found, or anyone to help us for that matter. The staff only spoke Spanish to us and it seemed as though many had invited their local friends into the resort to drink for free for the night... it was just slightly un-nerving. Not to mention, since we were two young women travelling alone, the male staff would not leave us alone even for a second. We were constantly being harassed by them, and not only by cat-calls but they were always touching us as well.", "title": "Started great, down hill from there", "helpfulness": 6, "user": "scuba4fun", "date": "January 1, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 2.0}, "id": 12196773, "likes": {"liked": "— location", "disliked": "— bugs"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled with family", "text": "One night when we were planning on going to the RIU disco/nightclub we were warned by another female patron that it wasn't a wise idea unless we had a guy to accompany us. Because she had gone the night before and said that about 80% of the crowd was RIU staff, and they had grabbed her and forced her to dance with them... and wouldn't let her go when she tried to get away.", "title": "Wonderful experience at RIU Bambu", "helpfulness": 9, "user": "Ilyaphd", "date": "January 1, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 12193987, "likes": {"liked": "— Palm tree shade, beach moon-lit walkway"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled with family", "text": "I don't know... but ummm... that sounds like sexual harassment to me.", "title": "Great family resort!", "helpfulness": 5, "user": "lb_Ohio", "date": "December 31, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 12156472, "likes": {"liked": "— Beach, room", "disliked": "— none"}}, {"rating": 4.0, "title": "Awesome time! Can't wait to go back!!!", "text": "I stayed at the Riu Bambu hotel Jan. 29th - Feb. 5th. - I had the time of my life!!!!", "helpfulness": 13, "user": "A TripAdvisor user", "date": "February 9, 2006", "id": 4449363}, {"rating": 5.0, "title": "Fantastic holiday at Riu Bambu", "text": "Although, I don't do much traveling, so I do not have much to compare this resort to, I thought it was amazing. I went with my friend's family. (I am 19, my friend is 18, her two parents and two sibilings who are 8 and 3.)", "helpfulness": 11, "user": "A TripAdvisor user", "date": "February 8, 2006", "id": 4447467}, {"rating": 4.0, "title": "Fun in the sun at RIU Bambu - I love my job!!!", "text": "We spent most days just relaxing on the beach and spent most nights at the bar and disco. The staff is extremly friendly! The rooms were average - like most have said the beds are a little hard, but by the time it is time to go to bed, you are wiped out - so they didn't bother me at all.", "helpfulness": 12, "user": "A TripAdvisor user", "date": "February 3, 2006", "id": 4411615}, {"rating": 3.0, "stay_parameters": "Stayed January 2006", "text": "I highly recommend to go snorkling - the fish are gorgeous, they swim right up next to you - the water is so amazing!!!!!", "title": "GOOD FOR THE PRICE", "helpfulness": 17, "user": "UICHVAC", "date": "February 2, 2006", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "service": 4.0}, "id": 4408668}, {"rating": 4.0, "stay_parameters": "Stayed January 2006", "text": "I can't say enough about this hotel - I could go on forever. We are already planning our next trip!", "title": "We had a wonderful time!", "helpfulness": 7, "user": "weasieIllinois", "date": "February 1, 2006", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 4406835}, {"rating": 4.0, "title": "Riu Bambu Hotel (February 9 to February 23, 2008)", "text": "My wife and I travel to a Riu hotel every year. We have stayed at Riu hotels in Mexico (Cancun, Mayan Riviera, Puerto Vallarta (2), Cabo San Lucas), Jamaica (Ocho Rios, Negril) and Punta Cana. Our first Riu hotel was the Riu Bambu about 8 years ago and we liked the beach and palm trees so much we decided to return.", "helpfulness": 6, "user": "Paul_Myers", "date": "February 25, 2008", "id": 13843038}, {"rating": 4.0, "stay_parameters": "Stayed February 2008, traveled with family", "text": "The weather was very good while we were there. It must have been around 90 degrees most days. We got rain on 2 mornings which lasted about an hour but it was sunny by 11:00 AM. It also rained on 3 nights (once during the night and twice around 9:00 PM which we solved by staying at the bar).", "title": "You Get What You Pay For But......", "helpfulness": 7, "user": "sixseveneight", "date": "February 25, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 3.0, "rooms": 3.0}, "id": 13822306, "likes": {"liked": "— Weather!!!!!!!"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2008", "text": "I will rank the positives and negatives of the Riu Bambu versus some of the other Riu hotels we have stayed at.", "title": "Excellent food and drink at the Riu Bambu", "helpfulness": 5, "user": "micto", "date": "February 24, 2008", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 3.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 13811197, "likes": {"liked": "— The property was not too large; quick access to your rooms.", "disliked": "— Children in pool bar area."}}, {"rating": 4.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "POSITIVES:", "title": "Beautiful Beaches and a great Apple Vacation!", "helpfulness": 1, "user": "contactmso", "date": "February 23, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 2.0, "location": 5.0}, "id": 13784163, "likes": {"liked": "— The hotel's location", "disliked": "— The food was not so good taste wise."}}, {"rating": 3.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "1) One of the better beaches for sand and lots of palm trees", "title": "OK Place", "helpfulness": 4, "user": "SaskatchewanGypsy", "date": "February 22, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "rooms": 2.0, "location": 4.0}, "id": 13755072, "likes": {"liked": "— Beach", "disliked": "— Pool"}}, {"rating": 2.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "That I have to agree with the other bad reviews on this site about this hotel.", "title": "Sorry to say...", "helpfulness": 4, "user": "TonySJA", "date": "July 23, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 2.0}, "id": 18172539, "likes": {"liked": "— Stunning views, Animation staff", "disliked": "— Rough sea, Beds, Insect infestation in most wooden furniture, Sugary drinks, Repetitive food"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "I was mortified when I read the poor reviews about this hotel after booking a £2.5k trip there, but hoped for the best. The best I did not get.", "title": "Would we go back? But of course...", "helpfulness": 1, "user": "rebelynnya", "date": "July 21, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 5.0}, "id": 18118349, "likes": {"liked": "— The Palm Tree's, Beach and Ocean", "disliked": "— Some of the guests at hotel were very rude and inconsiderate of others."}}, {"rating": 3.0, "stay_parameters": "Stayed January 2008", "text": "How this is a 5 star I do not know, it is a 3 star at best. This is apparent as soon as you get through reception.", "title": "Enjoyable", "helpfulness": 1, "user": "josilarson", "date": "July 21, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 3.0, "rooms": 2.0}, "id": 18097711, "likes": {"liked": "— Friendly service", "disliked": "— the beds!"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "well folks im back having today just fly back home from the riu bambu punta cana 18th may 2013", "title": "why did we have to leave", "helpfulness": 5, "user": "mandy165", "date": "May 19, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 161163838}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "what can i say there must be some people out there, who was after a refund, as when i read some of the reveiws on this place thought id made a mistake on booking this hotel but guess what i went and was really gald i did this hotel is just great and this is my true review so here goes", "title": "Clean well kept and in a beautifull location", "helpfulness": 9, "user": "dkayLakeDistrict", "date": "May 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 161132633}, {"rating": 3.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "my first sight of the hotel was good our rep was there to welcome us we got our room keys the room was pretty big 2 large beds stocked fridge with beer and soft drinks,and water we had optics with rum brandy gin and whiskey, bathroom was very clean, room was cleaned towels changed everyday,all the staff was very friendly ben in the sports bar always made us laugh", "title": "Disappointed----extremely--theft is \"UNACCEPTABLE\"", "helpfulness": 3, "user": "mandy165", "date": "May 18, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 161058929}, {"rating": 3.0, "stay_parameters": "Stayed May 2013", "text": "louis,victor in the arena bar very funny these guys are great fun", "title": "No nightlife. If you want boring, it's your resort", "helpfulness": 4, "user": "Tracy_mlg", "date": "May 15, 2013", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 4.0, "service": 2.0, "rooms": 4.0}, "id": 160803054}, {"rating": 5.0, "title": "A Truly Wonderful Holiday", "text": "the food is good and fresh the entertainment team work there butts off allday and night and the show they do are good the pool area was kept clean everyone seamed to be enjoying themselfs me and dean did the nice beach every day. we did afew trips i recommend the vip buggy trip and the outback trip really good the only downside to this place is are u ready for this WE HAD TO COME HOME OUR HOLIDAY WAS OVER please people dont take bad report of this hotel to heart just book and go and see for urselfs as i did its a lovely hotel and dont need to be bad mouthed about well riu bambu we will be back thanks for a wonderful time. oh we was in room 911", "helpfulness": 8, "user": "Charlotte G", "date": "May 14, 2013", "id": 160714321}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled with family", "text": "Just writing a review to say how FANTASTIC the bambu is!", "title": "Oh My God... We loved it !", "helpfulness": 17, "user": "WoodyDCJ", "date": "August 5, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5561104, "likes": {"liked": "— The entertainment staff", "disliked": "— There was nothing we didnt like!"}}, {"rating": 2.0, "stay_parameters": "Stayed June 2006, traveled with friends", "text": "Firstly the apartments:", "title": "Fabulous beach terrible food", "helpfulness": 12, "user": "Devon_girls", "date": "July 26, 2006", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 2.0, "location": 5.0, "rooms": 3.0}, "id": 5511862, "likes": {"liked": "— The beach", "disliked": "— The food"}}, {"rating": 5.0, "title": "loved it !!!!!!!", "text": "Very spaceous, nice big beds, which are a little hard but you will get used to them after the first day, the whole room was very clean and was cleaned daily by the maid. Air con and fan were great and cooled the room down nicely. (however air con doesnt work with balcony door open). there is a tv with many channels in English, Movies, Cartoons and music are shown frequently!", "helpfulness": 16, "user": "A TripAdvisor user", "date": "July 14, 2006", "id": 5466128}, {"rating": 3.0, "stay_parameters": "Stayed July 2006", "text": "Pool", "title": "Be Aware ...", "helpfulness": 13, "user": "TLM323", "date": "July 12, 2006", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 4.0, "service": 4.0}, "id": 5460449}, {"rating": 5.0, "title": "Sunshine, white beaches; relaxation; wow!", "text": "Got rather crowded at times, but we neerly allways managed to find some sunbeds at around 8am - 8.30am. Both pools are great but we mainly stayed around the smaller one as it was less crowded.", "helpfulness": 26, "user": "A TripAdvisor user", "date": "July 7, 2006", "id": 5437515}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "I've got a pretty good deal with 5 Apple Square Deal Punta Cana - 05/06 - 05/15. For the price we paid we had an amazing time in Riu Bambu. I love the beach!!! Riu Bambu is nice, solid, clean place. We got a room in the back building - love it! After all this food consumption you need to walk a little :) We totally feel we got what we paid for, which was a good deal. The buffet was plentiful at all meals, and they did their best to change up the offerings as much as possible at dinner, the a la carte restaurant were awsome. I love the fish - I was just a little dissapointed there were not reaviling the name of it, usually in the resort are more fish choices and there is a note that describes what kind is it - Riu representative, please respond to that. The mango is the best mango I've ever have, so were the other fruits. I love the stretching class and Aerobic class on the beach, I was there every morning! My only complain is - I know i can not problably change that - the enterteining shows are sooooooo laaateee! According to me. After you get of the beach and go to dinner around 6 - 7 it is a long time to wait for it, especialy if you do not drink ha! ha! I did enjoy free 90 minutes wi fi in the lobby, all though my phone was only picking that every other day- do not know the reason. The Beach is awsome, long, you may taking long walks both directions, we were up at 7, and before breakfast I was walking, my husband was running. For all those days we had excellent weather, they were two showers, but it was still hot and it passed quickly. As for the food complainers, I always have to add this: guys I would love to see your refridge and your cooking skills... with so much food choices it is a shame to complain... shame shame shame. I've seen people reaching for hot dogs, burgers and donuts (I would not touch that, no nutrients!!! :))) daily, people that are afraid to try new food, I think those are the ones that write bad reviews about food in the resorts. How blind and ignorant you must be not to be finding food for you in those many choices buffet.... no more comments. If you a shopper and love to buy some jewerly as suvenir, you better off going to Marshalls, Tj Maxx or order from Amazon. I do not like to shop there becouse they are coming up with the crazy prices, but I do understant. Small tip - ypu can offer 2 dollars instead of 3 and still have this coconut (it is still too much, ha ha , Whole food has them for 1.99 so....) but there so fresh and so good, no I did not like alkohol in them. But is always nice to bring some of that Mama Juana :) I do not have nothing against that rezort. It maybe little less luxury than Punta Cana / Dominicana Iberostar but it is still nice place to stay with the pretty beach :)", "title": "Nice, Solid , can't complain.", "helpfulness": 2, "user": "Niebieski", "date": "May 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 161899308}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "I have been on holiday many times over the years and this one was by far the best ive ever had, the location, the complex, the hotel, the staff, the excursions, could not fault any of it. Before I went I was on here reading up reviews about the hotel and Punta Cana and most of them were negative, which put me down about what I was going to get and find when I got here. Our holiday reps were Amos and Sonny they were brilliant met us at the airport to transfer us to our hotel and they were straight away so lively and friendly and they livened us up after a boring long 9 hour flight. We were the only drop off which was great it was scorching hot outside so we didnt have to sit travelling in the coach for ages we went straight to our hotel.", "title": "Amazing holiday Fantastic resort beautiful.", "helpfulness": 4, "user": "Kirsty H", "date": "May 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 161876429}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "The hotel was lovely, the staff was so so friendly all made you feel so welcolme we checked in and got shown where to go for our rooms and then the boys came and took our bags for us to the rooms, although we had a bit of a wait before the turned up and all we wanted to do was just unpack our stuff and go and have a look around the resort. I didnt have the comfiest of beds we had a family room and I had a sofa bed which was not very comfortable at'all when im use to a comfy soft bed but I did get use to it. We had a ground floor room which meant we did get the bugs and cocroaches nealy every day but we asked for the ground floor so we expected that. From the reviews I saw before I arrived at the hotel it was deffinatly better than I was expecting and the animation team were fantastic the only down side was it starting so late after spending the day out on excursions or in the sun it does tire you out and you just want to sleep by the time the entertainment comes on, but this is the first holiday I actually been on that has the entertainment in the hotel all day long and evening, it was them that deffinatly made the holiday one to remember, they tried to get everybody involved with activities and water games and beach games during the day and some evenings they do the games in the theatre to get everybody involved and they do the merengue dancing and the animation team come and get people up to dance to this, it was very entertaining. Every day all the staff at the hotel would greet you say good morning.", "title": "Wonderful holiday resort", "helpfulness": 3, "user": "jafraskl", "date": "May 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 161861984}, {"rating": 2.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "The colonel restaurant was fab, the waiters in there were so welcoming and there were a few evenings when it was packed we couldn't find a table or there were dirty tables and the waiter would come over to us find us a table straight away or quickly clean us a table while we go and get our food, we did go to the Mexican restaurant one evening again the staff were very welcoming but the food wasnt the best but thats me being fussy! if your a big fan of Mexican food you would love it. There was a big variety and choice of food and drink so you certaintly dont go hungry here!", "title": "Not a Thomson Platinum", "helpfulness": 5, "user": "Chris M", "date": "May 23, 2013", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 3.0}, "id": 161624309}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled with friends", "text": "The bar staff were so lively and friendly again, always singing and very quick at what they do fantastic! as soon as we got to the bar there was somebody there to serve us, the pool bar was lovely, I get bored just sitting round the pool all day but at the one with the pool bar they had music and the entertainment and certain times of the day which broke the day up and made it more interesting deffinatly looking at going back here again it would be nice to go to a different hotel but I dont think I want to go back to Punta Cana and stay in a different hotel I would deffinatly stay at Riu Bambu again. We was so gutted to leave and we went round and said goodbye to the animation team that we got along with well Peluka, Junior, Cupido, Jackson, Alex and all the rest of them boys and girls were fantastic Peluka was halleriouse! very entertaining.", "title": "Beautiful Bambu", "helpfulness": 3, "user": "Lynn M", "date": "May 22, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 161545687}], "location": {"country": "Caribbean"}, "stars": 3.5, "variance": {"poor": 253, "average": 452, "very good": 839, "terrible": 173, "excellent": 759}, "aka": "Riu Bambu", "slim_ranking": 0.613861386139, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.5, "rooms": 3.5, "location": 4.5}, "description": "* Located in Punta Cana * Situated on Arena Gorda Beach * Complimentary sun loungers on the beach * Within the Riu Resort, along with the Riu Palace Punta Cana, Riu Palace Macao, Riu Taino and Riu Naiboa hotels * Main building and 1-story bungalow complex * Surrounded by 46,000 m2 / 50,300 sq. yards of palm groves, adjacent to the beach * 50 km / 31 miles from Higley * 600 m / 1,980 ft. from Caribbean Street * 30 km / 19 miles from Punta Cana Int€™l. Airport * Credit cards accepted: Visa, MasterCard, Amex, Diners"}