{"user_rating": 4.0, "review_count": 3481, "name": "ClubHotel Riu Merengue", "reviews": [{"rating": 5.0, "title": "Best Holiday ever!", "text": "As a 17 year old, i went to the Dominican Republic with my family hoping to meet people the same age as me and for good nightlife. Every single staff member in that complex was so helpful and nice, and i ended up getting to know well most of the people at reception and the sports beach. The entertainment staff are great as well, and i especially got along well with DJ Manga and Victor. At night, the pacha nightclub is the place to go for those really over 14. there, i was able to meet many people of my age and have a great time also. During the day, i was kept happy by using the great facilities there, such as the pool, gym, sports beach, pool room or else simply relaxing by the pool or beach. The weather there was great and we only had rain roughly once a week, except from the island being brushed by hurrican frances on my last day there. I have definitely made up my mind that i will go back there again next year if I have the chance again. It was a great holiday and if you are reading this, you are very lucky to be going there.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "September 4, 2004", "id": 2512887}, {"rating": 5.0, "title": "best hol ever", "text": "myself,husband,also 2 friends had a fab holiday the best ever,hotel was excellent,staff great,they even gave me friut in our room for my birthday.also put flowers on our table staff sang happy birthday which was awsome.the food was lovely,room very clean,we went on 3 trips monster trucks,it made u sad to see how they lived,but all the kiddies did was smile.also went on cable cars,that was cool.the best was swimming with the doliphins it was a day i will always remember,we are going back next year cant wait,were going with the same couple plus there 15 yr old daughter,which she will love as there is loads for her to do,wish we were all going 2morro as that hol was the hol of our dreams,if anyone would like 2 know more please email me.we went there sept 03", "helpfulness": 5, "user": "A TripAdvisor user", "date": "September 4, 2004", "id": 2512508}, {"rating": 5.0, "title": "Just Paradise!!!!!!", "text": "I have just returned from the Mambo 1st September 2004, I had a two week break there with 5 other adults and 2 children. I was very nervous at first after reading some reviews and was concerned about it being rainy season......Well I am just about to book it again.Absolutely Fantastic ! ! The staff are wonderful, always smiling and happy to help, food - Excellent choice and they cater for everyone, rooms were immaculate. The people at the Mambo have got it spot on. The holiday could not have been any better. The people work so hard trying to satisfy everybodys need 14hours of the day............ and they do this with smile. Terrific if you ask me !!", "helpfulness": 2, "user": "A TripAdvisor user", "date": "September 2, 2004", "id": 2509664}, {"rating": 5.0, "title": "Riu Merengue Fabulous!", "text": "We visited the Riu Merengue aug 16th for 1wk.Staff were extremely nice and informative. If we had stayed for a month we would be talking sentences in spanish. Beautiful property food lots of pork, rooms clean. Whenever you go say hello to Barry and Emile. If you go on day outings go on the outback safari and request Jessie for your guide.Tell him Myra's twin sister from Canada spoke highly of him.........Marian, Angela,Eugene,Tamara and Andre.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "August 30, 2004", "id": 2503000}, {"rating": 4.0, "title": "Very Good Value for my £s!!", "text": "Recently returned having been there 6th-20th August 2004. Went with my wife, and daughters 16,and 12, from the UK with THOMSONS.", "helpfulness": 3, "user": "Scarletfez", "date": "August 29, 2004", "id": 2501070}, {"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled with family", "text": "My wife and I stayed may 5-11. we are in our 40's and have stayed at all inclusives in mexico. we knew the Riu was not \"sandels\" and didn't expect a 5 star..as a matter of fact airfare from atlanta, transfers from prieto tours, and 7 nights only came to $850 each which is comparable to a 3 star cancun deal, so we were expecting a lot less. I saw the ultra low prices for the riu's in DR for a couple of years and after reading a lot of good reviews finally went for it...bottom line is we would happily do it again. the good and bad are as follows:", "title": "Riu Mambo Good choice", "helpfulness": 3, "user": "Wise2u", "date": "May 22, 2008", "detail_rating": {"front_desk": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 2.0, "location": 3.0}, "id": 16303668, "likes": {"liked": "— use of all the riu properties", "disliked": "— painfully hard beds"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "Bad things first...the beds are very uncomfortable. for the last 2 days i used the pads for the pool loungers to pad the matress and slept on top of the slightly damp covers, if we go back i will pack an egg carton style foam pad or buy inflatable pool floats to sleep on. I doubt the other hotels had upgraded beds but if they did it would be worth the extra bucks.", "title": "Loved Riu Merengue", "helpfulness": 7, "user": "cah83", "date": "May 21, 2008", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 16294828, "likes": {"liked": "— Food, drinks, staff and other guests", "disliked": "— Nothing"}}, {"rating": 3.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "The air conditioner barely cooled, even cranked down to its lowest with the ceiling fan going it was a little warm, I asked the desk to send someone to check it, but they never did which told me- thats as good as it gets unless we wanted to switch rooms. Since we were only in the room to sleep and change we stayed where we were 2016. we brought a smelly candle but the room still smelled like wet couch, the only way to air it out would require both doors open for most of the day and that wasnt an option so we dealt with it, you get used to it after a few days.", "title": "Not paradise!", "helpfulness": 3, "user": "becs66", "date": "May 20, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 5.0, "cleanliness": 3.0, "value": 3.0, "location": 3.0, "rooms": 3.0}, "id": 16261166, "likes": {"liked": "— ermm the sun", "disliked": "— repetitive food"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "Minor annoyances included no washcloth until next to last day (good thing we packed a few)..no conditioner , just shampoo.", "title": "Great time,", "helpfulness": 6, "user": "Pammy", "date": "May 20, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 16246581, "likes": {"liked": "— Only two stories and clean", "disliked": "— Air conditioning was not great"}}, {"rating": 5.0, "title": "perfect holiday!", "text": "certain hours no food available just before dinner (they shut down snack bar to turn area into italian and steakhouse for dinner) and after dinner ...even though i thought they said merenge had 24 hour snack bar we could not find it.", "helpfulness": 3, "user": "sarahsteve", "date": "May 19, 2008", "id": 16195167}, {"rating": 4.0, "title": "Loved the Merengue", "text": "I stayed at the Riu Merengue Sept 30 to Oct 4, 2004. I absolutely loved it. The hotel is extremely nice. The people are very friendly. I read some reviews about the food that it was bad. The food was great. There was so much to choose from. I stayed away from anything that I thought would spoil quickly(like anything containing eggs, luncheon meats, etc.)", "user": "cruisingjj", "date": "November 2, 2004", "id": 2802542}, {"rating": 5.0, "title": "Great Place!!!!!", "text": "I learned quickly from our travel guide that you should not drink more than 2-3 drinks containing the coco loco milk(pina colado, etc). Not good on the stomach(instant laxative). I took his advise. I did not want to spoil this vacation.", "user": "A TripAdvisor user", "date": "October 24, 2004", "id": 2782614}, {"rating": 2.0, "title": "Great place shame about the food.", "text": "The rooms were great. We did have to change rooms due to a key being broken off in our lock in the door. We were moved right up front on the beach. WOW what a view.", "user": "annthefool", "date": "October 10, 2004", "id": 2689204}, {"rating": 5.0, "title": "Awesome", "text": "We took some excursions and they were great. The night out on the town with Jason and Phil were great. They really know how to entertain and take you to great spots.", "user": "A TripAdvisor user", "date": "September 24, 2004", "id": 2597442}, {"rating": 4.0, "title": "Nice Hotel shame about the tropical storm", "text": "We enjoyed the other two hotels as well. Very nice. I will definetly go back and stay at this hotel.", "user": "A TripAdvisor user", "date": "September 23, 2004", "id": 2595851}, {"rating": 5.0, "title": "holiday heaven", "text": "my husband, myself and another couple (all early forties) had two fantastic, fun filled weeks between 8th and 22nd August '04. On arrival we were asked if we would like a free upgrade to the Bachata next door. Apparently the Merengue was proving to be very popular this year and they were trying to transfer some guests to one of the sister hotels. We were taken on a tour of the Bachata and although it lookeed lovely we decided to opt to stay where we'd booked. With hindsight it wouldn't have mattered either way as we could use the facilities in both hotels along with the facilities at the Mambo. The food at the restaurant was extensive ( none of our party was ill - not even the usual holiday tummy, and I don't think anyone could have eaten or drunk more than us.) The room was airy and kept very clean. The air conditioning was a godsend after a day in the blazing sun. Very hard working and cheerful staff. There was nothing wrong with the pool but we tended to spend our pool days at the Bachata - (swim up bar). It was a much bigger pool. The beach wasn't a typical Caribbean beach (golden sand rather than white and although the sea was lovely and clear it wasn't turquoise blue.) The sports beach was prettier. WE went on the monster truck safari which we all highly reccommend but please take things for the poor kids. Make sure you enjoy the free flowing rum on the way! One of our favourite places to eat was on the terrace of the Bachata. The view across the beach was beautiful. The entertainment was really good in the evening, the only drawback was that the children took centre stage until around 10.00p.m. Some nights we were too tired after packing in a whole day of sun and fun, to wait around for the entertainment to begin. I don't believe in holidaying in the same place twice as the world is such a big place, but this is one hotel I would definitely consider re-visiting. If you're off soon have a fab time!", "user": "holady", "date": "September 17, 2004", "id": 2581651}, {"rating": 5.0, "title": "Fantastic", "text": "Just got back and all I can say is that it was absolutely superb. From the moment we arrived at the hotel the staff were bending over backwards to help and always with a smile on their face. The gardens are beautifully maintained (even when Hurracaine Frances popped over for the day!). The choice of food was excellant with all different kinds of meat, fish and salads and my girlfriend and I never experienced any problems. In fact I lie, I woke up with a terrible hangover one morning ( mini bar in room) but that was quickly resolved with a dip in the pool!", "user": "A TripAdvisor user", "date": "September 15, 2004", "id": 2576955}, {"rating": 5.0, "title": "What a fantastic holiday!", "text": "The entertaimenent staff were simply amazing. Always smiling and enthusiastic but never pushy. From entertaining around the pool during the day (watch out for BOM BOM the rep who is worth going to the hotel in itself and especially the mock wedding every fortninght) to performing shows such as Grease. Cats and Michael Jackson at night.", "user": "A TripAdvisor user", "date": "September 14, 2004", "id": 2571785}, {"rating": 2.0, "title": "prison camp.", "text": "Everything from the food, the drink, the reps and the actual relaxed and ever so friendly environment of the Merengue has made up my mind that I will definately be returning and hopefully very soon!!", "user": "A TripAdvisor user", "date": "September 13, 2004", "id": 2526417}, {"rating": 5.0, "title": "Better Late than never!", "text": "I've just spent a fantastic 2 weeks at Rui Mambo (27th August - 10th September). I read all the reviews on this site before and really did my research. I disagree with all the bad bits and agree with all the good bits!", "user": "Adazae", "date": "September 9, 2004", "id": 2520870}, {"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "Arrived back 2 days ago from this resort and i am still recovering from jet lag ! This hotel is very busy and has a lot going on day and night. The animation team never stop and to be fair they are a credit to the hotel.", "title": "butlins in the sun !", "helpfulness": 5, "user": "kimwrighton", "date": "May 15, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 3.0, "location": 3.0}, "id": 16057106, "likes": {"liked": "— cold beers in fridge !", "disliked": "— nothing"}}, {"rating": 3.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "If you want a quiet holiday then this is not for you. The hotel was set in lovely grounds and the beach was lovely.", "title": "NIce, good value overall but certainly nothing special", "helpfulness": 3, "user": "SBRitz", "date": "May 14, 2008", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "rooms": 2.0, "location": 2.0}, "id": 16043034, "likes": {"liked": "— Great value. Great staff. Clean.", "disliked": "— Rocky beach, watch out for food related problems, lackluster pool area."}}, {"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "Pool- Nice but not enough loungers and have to get up early to reserve one if you wanted shade and we did because it was so hot and no breeze. Beware though the animation team are there all day and it can get very noisy ! Head to the beach where it is quieter and plenty of beds in the shade and lots of sun for those like me who worships it.", "title": "Very good hotel, excellent value", "helpfulness": 6, "user": "glos-tim", "date": "May 14, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 3.0}, "id": 16022299, "likes": {"liked": "— Very clean, well maintained hotel", "disliked": "— Room blocks quite close together"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "Rooms- Nice spacious rooms with balcony , and the maid kept it spotless leaving us some wacky towel art every day. Beer water and sodas in fridge and spirits on optic topped up every 2nd day. We left a note and $5 in fridge asking for more beer and we never ran short..", "title": "'Great Hotel' Loved it", "user": "LondonDolphin_Lover", "date": "May 13, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 3.0, "rooms": 5.0}, "id": 15993430, "likes": {"liked": "— Staff were fantastic and all ground were very clean", "disliked": "— nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "Food- Cant fault it. Plenty of choice you would never starve here. We tried the steakhouse once it was ok but we preffered the main restaurant because of the huge choice. The pool snack bar is open all day, 10am to 12 noon for continental breakfast and 12 noon to 5 for lunch serving burgers pasta fish salads etc. Ate there most days and always found something.", "title": "Great Easter Getaway", "user": "DrewRit21", "date": "May 11, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 4.0, "rooms": 3.0}, "id": 15939525, "likes": {"liked": "— Ocean World", "disliked": "— Buffet"}}, {"rating": 4.0, "title": "So Romantic!", "text": "The Riu Merengue is truly a perfect place for almost anyone. It was very international-we met very few people from the US, which was rather nice. Let me qualify the different aspects into categories.", "helpfulness": 8, "user": "NicoleandKyle", "date": "November 19, 2004", "id": 2835653}, {"rating": 5.0, "stay_parameters": "Stayed October 2004", "text": "HOTEL/ROOM: The room was very nice although rather small. Beds were pretty hard, but the room was very clean. AC was a little intense no matter how we adjusted it. The minibar was great, with beer, hard alcohol, and plenty of mixers. We used this fairly regularly, but either bring additional glasses or be prepared to constantly clean yours out. The shower was awesome, big enough for two (wink wink) and fabulous massaging spray.", "title": "Absolutely Perfect!!!", "helpfulness": 7, "user": "macho_baracho", "date": "November 9, 2004", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "rooms": 5.0, "service": 3.0}, "id": 2814404}, {"rating": 5.0, "title": "best ever holiday", "text": "FOOD: It definitely got to be monotonous, but I was perfectly happy. The food is very different from the States, so be prepared for that and be adventurous! I have a weak stomach so I stayed away from anything that wasn't cooked, but I didn't get sick the entire time I was there--take 2 pepto a day starting a day before your trip and ending a day afterwards and you will be fine. My boyfriend was fine the entire time without taking any meds and he ate all the vegetables and fresh foods without any problems. We didn't have a chance to go to the ethnic restaurants because we were fine with the buffet and had heard nothing but poor reviews from the other vacationers who had been. But, can't judge, because we never went.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "November 5, 2004", "id": 2807456}, {"rating": 5.0, "title": "Best Holiday Ever", "text": "BEACH: This was the only disappointing thing about the trip. It was very rocky and not at all fun to go in the water. I am the first one to be in the water for the whole vacation and I only went in the water once or twice for very short dips. But, the pool is very nice. If you are looking for a good beach, this is NOT for you.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "November 3, 2004", "id": 2804510}, {"rating": 4.0, "stay_parameters": "Stayed October 2004", "text": "SERVICE: The service was fantastic! My BF and I wanted to start the drinking a little early one day and they turned on the beer tap just for us special even though they don't serve alcohol until about 11 or so. The maids are incredible if you tip them--just leave a few dollars in the room and they will create beautiful things for you out of towels, etc. We came back one to see our towels in the shape of two swans kissing strewn with fresh flower petals. It was very romantic! There really was never a huge wait to get a drink and the drinks were made very strong if you asked. We brought our own cups that were bigger so that we didn't have to get up as often. That was key to our happiness!", "title": "I came back, I saw and I'm still satisfied...", "helpfulness": 6, "user": "QuebecTraveler", "date": "November 2, 2004", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 2802666}, {"rating": 2.0, "title": "NOT THE SANDALS", "text": "This resort is not the Sandal's,it is like being on a cruise but on land. Service tough people don't speak much english so hard to get point's across. Bad for people ,who are disable no shuttle service between other resort's on property. Had big problem with air condition in room could not regulate it in room no one came to repair or look at after several calls. Sent complaint e mail never heard back so custormer service not good.", "helpfulness": 1, "user": "stevez1955", "date": "May 19, 2008", "id": 16187988}, {"rating": 4.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "We were lucky enough to book a 10 night break arriving on 26th April 2008, allocated on arrival, either the Riu Merengue or the Riu Mambo, we were lucky enough to be staying at the Riu Mambo!!", "title": "How lucky were we to end up in the Mambo!!", "helpfulness": 7, "user": "lindamojo", "date": "May 19, 2008", "detail_rating": {"front_desk": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 16185385, "likes": {"liked": "— Everything!", "disliked": "— Coming home :-("}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "Check in - was not the quickest or best (which I think is the only minor niggle we can think of for the whole holiday), everyone was gathered together from the bus and had to wait whilst we were given a little welcome speech and one by one our envelopes with our room keys etc., however, within 10 minutes we were being escorted to our room. First impression - what a pretty place, lovely colonial style room blocks, all different pastel colours, gardens gorgeous with plenty of trees and all well spaced out, not on top of each other.", "title": "Super mambo experience!!", "helpfulness": 6, "user": "ishtarbeam", "date": "May 17, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 16157662, "likes": {"liked": "— the excellent service and all inclusive really meaning all inclusive", "disliked": "— the transfer company and the excursion company"}}, {"rating": 5.0, "title": "A beautiful resort", "text": "We were staying in room 2018, on the ground floor, which was wonderful, it was right at the end of the street with such a lovely view. The room itself was great, usual high Riu standard, 2 double beds, table and 2 chairs, television, great bathroom, lots of drawer space, double wardrobe (with lots of hangers), complimentary safe and then our favourite cupboard - housing 4 optics with fridge below with mixers and beers!! lol Balcony with table and 2 chairs (now we know that we're on holiday!!) We set about unpacking and had a telephone call from reception welcoming us to the Mambo and asking if everything was okay. I told them that everything was fine thanks but any chance of having some Vodka ('him indoors' favourite tipple) and I was told no problem they would make sure we had some the following day - less than 15 minutes later the little booze van turned up with Vodka, service or what!! Only half an hour into our holiday and we knew that everything was going to be wonderful!! Tip for the Brits - we knew from being on TripAdviser which travel adaptors we needed but hadn't thought about the voltage - it's only 110, thankfully my hairdryer is a duel voltage so it worked well but I had a battery charger for my camera and that took 2 days to get enough charge into my spare batteries.", "helpfulness": 3, "user": "AurelianB", "date": "May 16, 2008", "id": 16110839}, {"rating": 5.0, "title": "Another great stay!", "text": "For evening meals you are asked to eat in your own hotels restaurant, have to say that after our first evening it was so enjoyable that we didn't try out the other restaurants for either breakfast or lunch. The staff are wonderful, nothing is too much trouble and they are always smiling. Tables were cleared away quickly and re-laid, never a problem getting a table, even when they were busy. The food was wonderful both at breakfast and dinner, we only ate at the poolside restaurant during the day so can't comment on lunch. So much choice, far too much to list (even for us picky eaters) and all well prepared. Ashamed to admit that I am a smoker but there were clearly defined areas for smokers and non-smokers (usually there were fewer children in the smokers area too, a bonus when you're our age and childless!!) Another tip for the Brits, the salt and pepper work the other way around to here, the salt is the one with lots of holes and the pepper is the one with only one hole, good job we like both, lol.", "user": "miemage", "date": "May 15, 2008", "id": 16067113}, {"rating": 2.0, "stay_parameters": "Stayed May 2008, traveled with friends", "text": "Stayed from 5/22 to 26. The only airconditioning they have is in the rooms. After a very long walk to our room we were soaking wet. The AC did not work. we called and this guy removed the filter and it looked like it was not changed in years. No view at all. Overall the place is very clean. The food was not good and the dinning room is soo hot. The shows are not good and it is also very hot. The pool and beach are very nice. Plenty of lounge chairs and great places for shade. The staff tries very hard to entertain you but the shows are poor. When you arrive at the Airport you must pay Ten Dollars a person in cash only to get into the country. We booked a car in advance from Isaira Tours (www.isairatours.com) 100 dollars for a nice , VERY cold van for the four of us to and from the hotel. I recommend them highly. They meet you with a sign and then return promptly for the trip to POP.That was the most cooling part of the trip.Overall for the price it is not bad. I don't recommend Riu Mambo for older people or families. For young couples it OK", "title": "Hot", "user": "DavyGGG", "date": "May 27, 2008", "detail_rating": {"front_desk": 2.0, "business": 2.0, "service": 3.0, "cleanliness": 5.0, "value": 4.0, "location": 1.0, "rooms": 3.0}, "id": 16440549, "likes": {"liked": "— The Beach", "disliked": "— Lack of AC"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "Just returned today 26th May 2008 from a two week stay at the Merengue. The flight with First Choice was excellent especially in Star Class Premier. We are in our early 30's from England. The holiday was excellent value!", "title": "Excellent Two Weeks! Go with the flow and just relax!", "helpfulness": 7, "user": "oxford_uk_2000", "date": "May 26, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 16414531, "likes": {"liked": "— Beach", "disliked": "— Entertainment in the evening was a bit repetative"}}, {"rating": 2.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "A very busy hotel which shares with two other hotels. There is probably between 2000 - 3000 staying at any one time across the resort however if you are careful, use the beach which is great (bring some beach shoes) and eat early for Breakfast (which is the best part of the day), a later lunch and find the quieter areas of the buffet you can get some peace! In the evenings all hotels are very busy, the entertainment is in full force,everybody getting their dinners, bars are busy and quite an experience! Again you can search out quieter places, i.e reception areas if you need some peace but there are not many quieter spots!.", "title": "Merengue Review", "helpfulness": 5, "user": "dorset1", "date": "May 26, 2008", "detail_rating": {"front_desk": 4.0, "business": 1.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 16404564, "likes": {"liked": "— clean and tidy", "disliked": "— Some of the other residents and mosquitos"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled with family", "text": "The entertainment is ok. Some amazing dancing but quiet a lot of miming! 14 days was enough but you have to admire their effort.", "title": "Would Go Again", "helpfulness": 4, "user": "jjpclark", "date": "May 25, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 16381641, "likes": {"liked": "— Staff", "disliked": "— Nothing"}}, {"rating": 1.0, "title": "Hated it.. Never Again", "text": "The staff are fanstastic. Tipping does help but they seem really pleased for the odd dollar. I ordered $200 single dollar bills from my bank and they were ideal for tipping, small purchases and ready for emergencies.", "helpfulness": 5, "user": "bdgirl34", "date": "May 22, 2008", "id": 16309998}], "location": {"country": "Caribbean"}, "stars": 3.5, "variance": {"poor": 239, "average": 499, "very good": 1046, "terrible": 149, "excellent": 1548}, "aka": "Riu Merengue", "slim_ranking": 0.186046511628, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 3.5, "rooms": 4.0, "location": 4.0}, "description": "* Located on the beach in Maimon Bay * Complimentary sun loungers on the beach * Located in the Riu Resort, near ClubHotels Riu Bachata and Riu Mambo * Main building and 1-story bungalow complex * Surrounded by 15,000 m2 / 18,000 sq. yards of tropical gardens * 9 km / 5.5 miles from Puerto Plata * 150 m / 495 ft. from Caribbean Street * 25 km / 15.5 miles from Puerto Plata Intl. Airport * 300 m / 990 ft. from a bus stop * Credit cards accepted: Visa, MasterCard, Amex, Diners"}