{"user_rating": 4.0, "review_count": 609, "name": "Club Quarters San Francisco", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed February 2006", "text": "Nice, cozy place, right by the financial district. It's also a short cab ride to downtown, Little Italy, and Fisherman's Wharf. Chinatown is walking distance, but you do have to climb hills! It's nice little place, I would stay there again.", "title": "Nice, cozy place", "helpfulness": 1, "user": "thisiskristine", "date": "February 23, 2006", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "service": 3.0}, "id": 4499109}, {"rating": 4.0, "title": "Great Accomadations - As Usual", "text": "This place is a great place to stay if you want a location where you have access to all the sights and sounds of San Francisco. Three blocks from Chinatown, Two blocks from the Famous Cable Cars and Four blocks from BART and a heafty walk to Pac-Bell SBC (AT&T) Ballpark. My girlfriend and I took our three grown children for the Chinese New Year's Celebration weekend, and were able to walk back after all the festivities without having to fight the massive crowds. The next day, we hopped on the cable car to ride down to Fishermans Wharf for sour dough bread, clam chowder, chocolate and to see the Sea Lions at Pier 39. Then we took the other line back up to Chinatown for \"dim sum\" and walked down to catch BART to go under the trans-Bay tunnel. This place is a private, members only establishment during the business week because its in the heart of the business/financial district. But on the weekends its open to those who know about it. Rooms are neat and clean but a little small for a family trip (that's why we needed two rooms), but the location is worth the cramped space (esp. if all you need is a place to sleep.) Parking is $28.50 per day in the Embarcadero Center underground garage, but the security is really good there.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "February 20, 2006", "id": 4474243}, {"rating": 5.0, "title": "Great Hotel for Business in the Financial District", "text": "My stay at the Club Quarters San Francisco was great and exactly what I hoped and expected. The hotel was booked solid when I arrived, fortunately I made reservations ahead of time. Due to the solid booking I was upgraded to a suite! The location is best for those traveling to San Francisco on business, particularly if your meetings are in the financial district. I walked to every meeting and only needed to take BART twice to get to and from SFO. For those with good health and light luggage, it is an easy 4 or 5 block walk from the BART Embarcadero stop. If you enjoy running - the hotel is two blocks to the Embarcadero drive, allowing you to run along the bay.", "helpfulness": 8, "user": "A TripAdvisor user", "date": "January 20, 2006", "id": 4365847}, {"rating": 4.0, "stay_parameters": "Stayed November 2005", "text": "Each room has free and easy internet access too - a huge plus for the business traveler. All was clean and aestetically pleasing, comfortable bed.", "title": "good value for the money", "helpfulness": 8, "user": "dcgolf", "date": "November 16, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 4122210}, {"rating": 5.0, "title": "Better than Expected", "text": "Attached to the hotel is the Elephant & Castle restaurant which makes eating easy when you are too tired to go out and find something. The restaurant is open for three meals.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "November 15, 2005", "id": 4112529}, {"rating": 4.0, "title": "Small Rooms but Convenient Location", "text": "I was looking for a cheap 3 star in the city and Hotwire gave me CQ for $99 a night. I was very happy about this deal until I called the hotel and found out parking would cost $33 a day nearby. Oh well, that's the big city for you! Us country bumpkins from the OC just ain't used to payin' to park our tractor of an SUV!", "helpfulness": 1, "user": "SenatorK", "date": "September 24, 2007", "id": 10000276}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled solo", "text": "Rooms are small but clean and comfy. Perks include free wi-fi and bottled water. There's also a laundry and a gym with weights. A British-style pub and Starbucks are right next door.", "title": "good value in SF", "helpfulness": 1, "user": "dc_chuck", "date": "September 23, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 3.0, "rooms": 3.0}, "id": 8865792}, {"rating": 4.0, "title": "Smart hotel, good location", "text": "Pro: Walking distance to the Ferry station, Embarcadero Center, Cable Car station, and Chinatown.", "helpfulness": 1, "user": "MrBen1", "date": "September 20, 2007", "id": 8827891, "likes": {"liked": "— Location, price", "disliked": "— Nothing."}}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled on business", "text": "Con: Few staff members in lobby as it's expected that you check-in and out by yourself. No bathtub.", "title": "Great for single, business travelers...", "helpfulness": 1, "user": "eco_parakalo", "date": "September 19, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 3.0, "rooms": 5.0}, "id": 8753769, "likes": {"liked": "— Wireless internet and excellent bed", "disliked": "— Not all rooms have a great view"}}, {"rating": 3.0, "stay_parameters": "Stayed August 2005", "text": "Trivia: When the hotel was being built, the crew found a Gold Rush- era trading ship buried underneath! Huzzah!", "title": "Liked my stay, but would recommend that travelers keep looking", "user": "yiuyiu_tai", "date": "September 16, 2007", "detail_rating": {"cleanliness": 5.0, "front_desk": 4.0, "value": 3.0, "location": 3.0, "service": 4.0}, "id": 8725804}, {"rating": 3.0, "stay_parameters": "Stayed May 2006", "text": "CQ bills itself as a business hotel, and it is that, but nothing more. Most of the rooms are VERY small, with double beds, small bathrooms and only one hand-towel. We spent one night in a room that was more like a cell--its window looked out at a bare concrete wall just 3 feet away. And it reeked of tobacco! But the second night we were moved to a much larger room on the top floor, with great views, and no smell. On the holiday weekend we were there, most of the patrons were foreign tourists and youf couples. We had no issues with noice. Being in the financial district, there was always street parking available, which saves about $35/night.", "title": "It's only business", "helpfulness": 2, "user": "Evanescent", "date": "May 30, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 2.0, "service": 2.0}, "id": 5237140}, {"rating": 3.0, "stay_parameters": "Stayed May 2006, traveled on business", "text": "Stayed here April 30 - May 3 as a good alternative to the Hyatt down the street, where my meeting was located. The place is nice and the room is adequate for a single traveler. The savings averaged $50 per night over the Hyatt. However, the walls are so thin that you can hear the TV and the conversation of the people in the next room. Be sure that you like them, because you will hear everything that they have to say.", "title": "OK Place - Be Sure That You Like the Neighbors in the Next Room", "helpfulness": 4, "user": "GAHighRoller", "date": "May 24, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "service": 3.0}, "id": 5208391}, {"rating": 4.0, "stay_parameters": "Stayed May 2006", "text": "I just got back from a trip to San Francisco and a stay at Club Quarters. I found the previous reviews to be very helpful. It was in a great location and the room was fine - clean and met our needs. I agree they were a little skimpy with the bathroom towels, but immediately brought up a couple more when I requested them. We had to find an blanket in the guest closet in the hallway (the bed only had the top sheet and bedspread on it) - which was fine; I just hope they clean those blankets regularly! The staff was easy to deal with and allowed us to have a late checkout, which we needed. The only real complaint I have is with the parking - parking is at the Embarcadero Center garage, which is fine, but expensive. Even with the parking expense, it was still cheaper to stay here than anywhere else downtown.", "title": "Good hotel, great location", "helpfulness": 1, "user": "iWonder", "date": "May 23, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 5204724}, {"rating": 2.0, "stay_parameters": "Stayed April 2006, traveled on business", "text": "I didn't have any trouble with \"thin\" walls, but I travel with a white noise machine anyway since I'm a light sleeper. I also liked the free internet access - helped with getting directions to places outside of the city and just to check on a few things. All in all, I would defintely stay at Club Quarters again.", "title": "Staff Needs Friendliness Training!", "helpfulness": 5, "user": "asgeirs", "date": "April 26, 2006", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 2.0, "service": 2.0}, "id": 5012642}, {"rating": 4.0, "title": "Good deal for the Price", "text": "I spent four nights at the Club Quarters in April 2006. I arrived at 1:30 (after a long flight from the East Coast) and was told that check-in time was at 3 - ergo, room not ready. Fine. I had a nice lunch in the adjoining restaurant. Came back at 2:45 or so. Nope - room not ready. Went for a walk down by the Bay. Returned at 3:30. The desk staffer, a young woman of Asian heritage, was extremely rude in informing me that the room was still not ready. Funny, don't I start paying for the room at 3 pm? I must say that the young man who had to inform me of the room not being ready the first two times was very helpful and professional. The young lady, however, could not have cared less that I had to sit around waiting for my room. This was NOT a good way to welcome a first-time visitor, and certainly doesn't make me want to direct return business to this hotel. Too bad for them, as I was here specifically seeking a location for extensive group business. As for the room, it was sort of small, there were not enough pillows, and they're sort of skimpy on towels and bathroom accessories. And, yes - very thin walls! The bed was extremely comfortable, however, and the water pressure in the shower was absolutely wonderful. The hotel is also in a great location.", "helpfulness": 7, "user": "190671", "date": "March 13, 2006", "id": 4607090}, {"rating": 4.0, "stay_parameters": "Stayed February 2007, traveled on business", "text": "My wife and I enjoyed our stay at Club Quarters, however, be advised that the standard rooms are too small for two people for a stay of more than a few nights. For San Francisco, you can't beat the rates, though, and the rooms, while small, are new and clean. We stayed 5 nights so we took advantage of the laundry room in the basement, which is where the ice and vending machines were located as well.", "title": "Great Rates", "helpfulness": 2, "user": "LAWheels", "date": "March 16, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 3.0}, "id": 7173020, "likes": {"liked": "— Close proximity to work", "disliked": "— The small rooms for disabled guests."}}, {"rating": 4.0, "title": "Very clean and comforable", "text": "My wife is disabled and in a wheelchair full time. We found the accessible bathroom to be excellent with a roll-in shower and an ADA toilet with grab bars. Also, the sink was elevated for wheelchair patrons. Strangely, the accessible rooms were located at the far end of the hallways, once you leave the elevator lobby so, if you're traveling with a walker or someone using a cane, beware. In addition, since the room was a too small for two people, we tried to upgrade to a larger room but the only accessible rooms are the standard ones.", "helpfulness": 2, "user": "Wheezy_Dave", "date": "March 2, 2007", "id": 6900698}, {"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled on business", "text": "The hotel is across the street from the Embarcadero, which harbors shopping such as Banana Republic, Victoria's Secret and other mainstream stores. An ATM is located in the first set of buildings facing the hotel. The hotel does not have an ATM. In addition, there is a Tony Roma's there and a Chevy's, if you're desperate. Otherwise, you can try Schroeder's restaurant, an old German restaurant dating back to 1893, which is a few blocks away on Front Street. Also on Front Street is the Irish bar Harrington's. If you want to venture out, try Scoma's down in Fisherman's Wharf. The prices are too high but it's fun to eat by the water and the food is good.", "title": "Great location, VERY clean and quite cozy", "helpfulness": 4, "user": "Heidi H", "date": "February 6, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 6749115, "likes": {"liked": "— Good location and very clean. GREAT PUB & GRILL NEXT DOOR!", "disliked": "— Wished all rooms had fridge & microwave"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled on business", "text": "In closing, the Club Quarters is great for the lone business traveler. Upgrade to the bigger room if you're traveling with two or more people and, if you have disabilities, call in advance to quiz them on the room. Perhaps they have some that are closer to the elevators.", "title": "Great Value/Great Location/No problems", "helpfulness": 3, "user": "TravelH0und", "date": "January 22, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 6642877, "likes": {"liked": "— Value", "disliked": "— Noise through thin walls"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "The Club Quarters gives you a very inexpensive, but still clean and comfortable option in San Francisco's financial district. Picture a corporate dorm--the rooms are a bit smaller than your typical business hotel, but are very clean and the bed was comfortable. The shower is a small alcove off the small bathroom (no tub), but the water pressure was fine and it got the job done.", "title": "Great place, good service, nice people", "helpfulness": 3, "user": "greatbeginnings", "date": "January 17, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 6610766, "likes": {"liked": "— Location, cost, good staff, comfortable bed", "disliked": "— restaurant"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled on business", "text": "I stayed at this hotel for a conference at the Moscone Center; it was significantly less expensive than the hotels closer to the Moscone Center even with the special conference rate.", "title": "Convienent and clean", "helpfulness": 2, "user": "otsumami", "date": "November 14, 2007", "detail_rating": {"front_desk": 3.0, "business": 5.0, "service": 4.0, "cleanliness": 3.0, "value": 4.0, "location": 4.0, "rooms": 3.0}, "id": 10829326, "likes": {"liked": "— Water bottles, proximity to Chinatown, value, cleanliness", "disliked": "— Not close to the hottest dining scene"}}, {"rating": 2.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "I arrived quite late the first night and was given a room at the very end of the hall; it was a smoking room, despite having requested a non-smoking room through Expedia. There were no more non-smoking rooms available that night. However, the front desk called the following morning by 8 am to let me know a non-smoking room had become available for me.", "title": "Do not fall for this trap! Not worth 3.5 stars!", "helpfulness": 6, "user": "naja58", "date": "October 28, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 2.0, "location": 2.0, "rooms": 2.0}, "id": 10397260, "likes": {"liked": "— room quality"}}, {"rating": 2.0, "stay_parameters": "Stayed September 2007", "text": "The rooms here are definitely small, but it also seems to be dependent on where the room is located. My first double was so small that the bathroom door, room door, and closet door all opened into the same space, but my second double was quite comfortable, albeit still on the smaller side. Cable TV is a plus, as well as the complimentary wireless Internet access (which, incidentally, may vary in signal from essentially nonexistent to reasonably strong.)", "title": "disappointed with stay", "helpfulness": 2, "user": "alferrari", "date": "October 19, 2007", "detail_rating": {"front_desk": 2.0, "business": 2.0, "service": 2.0, "cleanliness": 2.0, "value": 2.0, "location": 2.0, "rooms": 2.0}, "id": 10151328}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "A significant perk of the hotel is the complimentary refillable water bottle dispenser near the elevators on each floor. These are plastic sealed bottles which can be opened and filled with cold filtered water. Another perk is the club room on the ground floor, where I was able to use the complimentary computers with Internet access and also print documents, including ones that I sent to the printer via laptop while in my hotel room and then used a unique document code to print out once I was down in the club room.", "title": "Wonderful location and perfect long weekend hotel", "helpfulness": 2, "user": "ROKChicago_IL", "date": "October 12, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "business": 4.0, "cleanliness": 4.0, "rooms": 3.0, "location": 4.0}, "id": 10071298, "likes": {"liked": "— Location and price", "disliked": "— Rooms are smaller, but OK for long weekend."}}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled on business", "text": "It was about a 10 min walk to the Moscone Center from the hotel and about 3 min walk to Chinatown. The nearest BART station was about 5 min away, even with luggage. I would easily choose to stay at this hotel again.", "title": "Great value", "helpfulness": 3, "user": "Caring_Bear", "date": "October 9, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 3.0, "rooms": 4.0}, "id": 10059221, "likes": {"liked": "— Fantastic value for the amenities", "disliked": "— Location is not great if you want to be near tourist attractions"}}, {"rating": 4.0, "title": "A great room", "text": "I moved here to find a cheaper location in SF. It's a little claustrophobic compared to the posh high end hotels, but I find it sort of 'european'..an economy of space. My room had everything i needed, desk, office chair, easy chair, and a very comfortable bed. The shower is walk in w/ a hand held spray, very nice!", "helpfulness": 12, "user": "juthu", "date": "November 9, 2005", "id": 4101626}, {"rating": 3.0, "stay_parameters": "Stayed November 2005", "text": "My only complaint is windows you cannot open, and a very lint/dust clogged AC filter. Security is nice, requiring a room key to use the elevator. And my favorite thing, free use of computers in the lobby. They also provide coffee maker in room and in lobby. and a nice place in the lobby to sit, read, watch tv. I highly recommend it.", "title": "Great Value and location...but", "helpfulness": 7, "user": "AZ89", "date": "November 8, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 3.0}, "id": 4093346}, {"rating": 3.0, "title": "Average quality, but nice", "text": "..as just about everyone here has mentioned, the walls are paper thin...my boyfriend and I felt like we were sleeping with the couple next door. Definitely bring ear plugs if you are a light sleeper.", "helpfulness": 11, "user": "A TripAdvisor user", "date": "November 1, 2005", "id": 4078129}, {"rating": 3.0, "stay_parameters": "Stayed October 2005", "text": "The Club Quarters Hotel in San Francisco is a little bit hard to review. It has qualities of both a business hotel and a budget motel.", "title": "Small, Efficient, GREAT PUB downstairs!!", "helpfulness": 1, "user": "CLUBCHICK", "date": "October 25, 2005", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "service": 3.0}, "id": 4051325}, {"rating": 5.0, "stay_parameters": "Stayed September 2005", "text": "Physically, the rooms are very small, but very clean. They are well appointed, but with the quality of linens you would expect to find at a Motel 6. The bathroom is the smallest Ive ever seen in a hotel. The hallways of the property are very narrow with low ceilings, so it's a bit clausterphobic, if that kind of thing bothers you. I could hear every conversation and person going by in the hallway, but could not hear from other rooms, so thin doors, thick walls.", "title": "Great value, very clean", "helpfulness": 4, "user": "ajslc", "date": "October 3, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3986262}, {"rating": 4.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "This is a no-frills but clean, modern and comfortable hotel clearly designed for the business traveler -- the male business traveler. Room decor, colors used, furniture, bathroom, etc., were very masculine, but nice. I don't know if they're all this way, but ours had a shower stall only. The hair dryer was the small, wall-mounted type. One major recommendation I would make to women staying here is to definitely bring your own toiletries. Rooms were smallish, but my husband and I did not feel cramped in the least. In fact, I was impressed with how space-efficient this hotel was. Why do you really need tons of floor space in a place where most of the time you're there you're in bed asleep? I was concerned about the noise problem other reviews here mentioned. I specifically asked for a quiet room and got it. I did hear room doors opening and closing, but that's it. I guess I lucked out. One little bennie we discovered: a computer and printer in the lobby we used at no extra cost. Great for printing out our Southwest boarding passes! Enjoyed our one night and would stay there again.", "title": "No complaints", "helpfulness": 6, "user": "Kaycj", "date": "September 8, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 4.0}, "id": 5779242, "likes": {"liked": "— Value for the money, comfort, location, access to computer and printer in lobby", "disliked": "— Hallways felt a little institutional. Toiletries were lacking"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2006", "text": "Club Quarters San Francisco is a great travellers hotel. The hotel is clean and modern. There is free high-speed internet access (you can bring your own lap top or there are computers downstairs in the common area.) The bed was extremely comfortable. The room was a bit small, but my fiancee and I are both over 6ft tall, and we never felt cramped or in each others way. Check-in was a breeze, and the staff was excellent. I actually saw one of the desk attendants walking a party from the hotel around the financial district to help them find a place to eat on labor day eve...talk about service!!! The room had a microwave, refrigerator and coffee maker. (I'm not sure if all do, so you may need to request.) In addition to all of this, there is a gym with some pretty decent equipment and a roof-top deck w/ somewhat restricted views of the bay.", "title": "Great hotel, location and amenities", "helpfulness": 1, "user": "jaypeaznuts", "date": "September 5, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5771333}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "I read some negative reviews about the location, and I'm not sure what those people are smoking. The hotel is about 3 blocks outside of North Beach. It is also about 5 blocks form market street, along which there is access to muni, bart, busses and ferries. In my opinion, that's a damn fine location.", "title": "great hotel at a great location", "helpfulness": 6, "user": "46red", "date": "August 25, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 5709272, "likes": {"liked": "— clean rooms"}}, {"rating": 5.0, "title": "I left my love in San Francisco", "text": "Booked a last minute trip to San Francisco for labor day weekend. I am not sure of the exact price that was paid for the hotel as it was a package deal, but based upon my guesstimation and arithmatic, it was probably around $65-$75 per night....an absolute steal for this beautiful city.", "helpfulness": 1, "user": "Nellrose", "date": "July 21, 2006", "id": 5494476}, {"rating": 2.0, "title": "EXTREMELY THIN WALLS!", "text": "I was very happy with the location, very close to china town and also to the embarcadero. We walked to dinner most nights in chinatown and little italy. I was a little worried when I saw the reviews saying that the rooms were small, I can tell that the people who wrote them never stayed in new york city hotels because our room was twice the size of the average hotel room in nyc. The room was clean and more than enough space for two people. I was also happy that we did not have the homeless people hanging out near the hotel like many of the other hotels had. I felt secure here.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "June 25, 2006", "id": 5381107}, {"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled on business", "text": "I've been traveling to San Francisco on business for roughly seven years and have stayed at a large variety of hotels there. This my my first time at the Club Quarters and I was a bit leery due to the rate of $89. Wow was I impressed! This hotel was much better than many of the boutiques I've stayed in and even some of the well-known historic hotels in the city. The room was small and only a double bed, but I did expect that. It's the perfect place for a business travel -- very close to Market Street (and even a Starbucks a mere 20 feet away). The one suggestion I have is to bring your own shampoo, conditioner, etc.", "title": "Far exceeded expectations", "helpfulness": 2, "user": "mrs_nuts", "date": "January 16, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 3.0, "rooms": 4.0}, "id": 6604367, "likes": {"liked": "— Value, cleanliness, lounge", "disliked": "— no front door cab service"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled on business", "text": "The ease of check in and check out was superb! The dollar value for the room was excellent! The location was great!", "title": "Excellent Place to Stay!", "user": "Lporr913", "date": "January 15, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6597461, "likes": {"liked": "— Ease of check in and check out."}}, {"rating": 4.0, "stay_parameters": "Stayed January 2007, traveled with friends", "text": "Safe and ideal location for a vacation to San Fran. The free internet computers in the lobby was a nice perk. The only drawback was that the walls are very thin and the rooms are close together...so if you are a light sleeper this may be a problem.", "title": "Great location, good value.", "user": "meltraveler", "date": "January 7, 2007", "detail_rating": {"front_desk": 3.0, "business": 5.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 6563649}, {"rating": 2.0, "stay_parameters": "Stayed May 2005", "text": "Stayed here a while ago. Room is small but clean. Window faces the wall! Restaurant breakfast is so so. The only great point about the hotel is free internet.", "title": "Most basic business hotel", "user": "TaminatorSF", "date": "January 5, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 3.0, "value": 2.0, "location": 3.0, "rooms": 2.0}, "id": 6553716}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled solo", "text": "I spent three nights over a weekend at the Club Quarters San Francisco and had a great experience. The room was clean, comfortable, and very nicely furnished. The property is a bit different from other hotels. The hotel isn't set up for every feature to be a profit center and there are good deal more self-service options than you would find at a comparable property.", "title": "Great Stay at Club Quarters", "helpfulness": 1, "user": "paubri", "date": "July 3, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 8053363, "likes": {"liked": "— Great quality accommodations at a phenomenal price!"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "The room was not the most generously sized, and might have been an issue if I were on a business trip where I was doing a great deal of work in my room. For my purposes, however, (a place to sleep and relax) it worked very well. There was a bit of a noise issue as others have mentioned, but nothing that interrupted my sleep at all. Also, the bathroom only has a stall shower, not a bathtub, so if that's an issue this may not be the place for you.", "title": "Wonderful! - some advice", "helpfulness": 5, "user": "newlywed518", "date": "June 8, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 7805332, "likes": {"liked": "— Location", "disliked": "— size of bathroom"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2007", "text": "The room had a good desk with plenty of available light, outlets available at the work station, and two phones in the room, one of which was cordless. Each room has its own direct-dial phone number, which is a nice feature.", "title": "Try it for yourself.", "helpfulness": 4, "user": "aus99", "date": "May 19, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 4.0}, "id": 7642955}, {"rating": 4.0, "title": "Loud A/C", "text": "Vending and the ice machine are located on the lower level along with the fitness center (treadmill, stationary bike, and a rack of dumbells) and complimentary guest laundry facility. The ground floor features three computers with high speed internet access, a complimentary guest print me printing station, a nice guest lounge and the check-in desk. Each floor has a water dispenser with empty bottles for complimentary chilled water. Most of the stuff one would expect to pay for at this level of property (internet, laundry, printing, etc.) is provided at no charge, but the trade-off is the self-service nature of much of the facility, including self-service check-in and check-out. That being said, any time I had a question the folks at the front desk were great and very helpful!", "user": "SanDiegoMytime", "date": "May 14, 2007", "id": 7616367}, {"rating": 5.0, "title": "One of the BEST !!!!", "text": "The location is accessible to many of the tourist areas on foot or via a short cab ride. It's also within blocks of a BART station for service to SFO or OAK airports.", "helpfulness": 2, "user": "53mainline", "date": "April 15, 2007", "id": 7365306}, {"rating": 4.0, "stay_parameters": "Stayed April 2008, traveled on business", "text": "I booked a room at Club Quarters before reading some of the negative reviews here at TripAdvisor. I had selected the hotel based on location and price but a couple of recent reviewers had really roasted the place, so I arrived with some apprehension. My experience was uniformly positive, so I'd like to offer a counterpoint.", "title": "Good choice for business traveler", "helpfulness": 1, "user": "Chap4Chap", "date": "April 17, 2008", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 15111034, "likes": {"liked": "— Location, price", "disliked": "— No newspaper"}}, {"rating": 3.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "When I checked in the staff was courteous and pleasant and I was informed that I had been given an upgraded room which turned out to be a small suite. The room was clean, everything worked (including the HVAC), and I never heard a thing from my neighbors. The complimentary WiFi connection seemed quite fast and never dropped out. I found the bed comfortable and the linens fresh.", "title": "Great financial district location", "user": "Michparis", "date": "February 5, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 3.0, "location": 5.0}, "id": 13287286, "likes": {"liked": "— Easy to find, walking distance to Chinatown, the wharf, nearby area.", "disliked": "— Window did not open, hotel allows guests to smoke in front of the entry door."}}, {"rating": 1.0, "stay_parameters": "Stayed August 2006, traveled on business", "text": "Don't get me wrong--this is not a posh place. It's utilitarian and doesn't offer a lot of frills. The bathroom counter tops are not marble, but the things that mattered to me were just fine. Since I had a suite I can't answer the complaints about room size, but for someone like me, who just wants a comfortable, safe place to spend the night rather than a hotel \"experience,\" the Club Quarters fit the bill exactly.", "title": "Doesn't Deserve a 4 star rating AT ALL", "helpfulness": 1, "user": "DomJC", "date": "January 16, 2008", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 2.0, "cleanliness": 3.0, "value": 1.0, "location": 5.0, "rooms": 1.0}, "id": 12702112, "likes": {"liked": "— The location", "disliked": "— Everything. This is the worst hotel in San Francisco"}}, {"rating": 1.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "Hotel has not parking, we were told that it would be 37 dollars per day, however because we stayed at Club Quarters on a week-end we were able to park on the nearby street for free !", "title": "We couldn't run out of there fast enough.", "helpfulness": 3, "user": "Weekendtrippers", "date": "January 1, 2008", "detail_rating": {"front_desk": 1.0, "business": 2.0, "service": 1.0, "cleanliness": 2.0, "value": 1.0, "location": 1.0, "rooms": 1.0}, "id": 12226567, "likes": {"liked": "— That we only had to stay one night!", "disliked": "— Where should I start?"}}, {"rating": 5.0, "title": "Great hotel off the beaten path", "text": "Our room 534 was on a non-smoking floor, facing a quieter street. Decor is spartan, room is very clean, nice bed, large shower only. Towels are changed every other day. Extra pillows and blankets are available in the hall-way although get yours early as the linen closet is not refilled during the day. There is a filtered water fountain with plastic bottles. The TV is dated. The clock-radio is more recent. The room is small.", "helpfulness": 2, "user": "CSquaredC2", "date": "December 24, 2007", "id": 11937380}, {"rating": 5.0, "title": "Excellent Hotel", "text": "This is a great hotel in an excellent location! Everything you need is within easy walking distance including a large supermarket. Excellent restaurants are also close by. The rooms are very nice and although on the small side, they are average in size for San Francisco. The lobby is a real plus as it is very large and a very comfortable reading or lounging area. Coffee is provided in the morning as is many newspapers and magazines. A large screen TV is also available plus 3 free computers with printing capability.", "user": "CarlOjai", "date": "September 12, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 8703471, "likes": {"liked": "— Value & Location", "disliked": "— Use of security card in elevators"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "I read all of the previously written reviews and was concerned about some of the negative comments about the hotel staff. And of course some of the staff was better than others but on average they were very helpful and courteous. Peter was the best at helping with restaurant recommendations.", "title": "Affordable and Great place", "user": "pnav", "date": "September 4, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 8656644}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "You can't go wrong with this hotel.", "title": "Nice, affordable choice", "helpfulness": 1, "user": "Rusty_Shakelford21", "date": "August 30, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 8551001, "likes": {"liked": "— Smooth check in", "disliked": "— Terrible view outside the window"}}, {"rating": 2.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "We stayed in club quarters during labor day week end. The hotel and location was just great.. Every thing is so close by.", "title": "Nice hotel, lacks customer service.", "helpfulness": 1, "user": "IntrepidTraveller05", "date": "August 24, 2007", "detail_rating": {"front_desk": 1.0, "business": 4.0, "cleanliness": 4.0, "value": 2.0, "rooms": 4.0, "location": 3.0}, "id": 8496583, "likes": {"liked": "— Cleanliness, layout of rooms, bed was comfortable.", "disliked": "— The staff, check-in and check-out, electronic machines, hotel was not very secure."}}, {"rating": 4.0, "stay_parameters": "Stayed July 2007", "text": "The Embcardo center is just opposite the hotel, which has couple of good places to eat. Easy to get cabs, munis etc. Union square is about 15 min walk, China town is very close by. The location just rocks!!!. The rooms were neat.. bit tiny.. But we hardly spent time.... No complaints!!!!! and of course Affordable when compared to other hotels aroundl....", "title": "Great stay !", "helpfulness": 1, "user": "D4real", "date": "August 3, 2007", "detail_rating": {"front_desk": 5.0, "service": 3.0, "location": 4.0, "business": 5.0, "rooms": 3.0}, "id": 8348430, "likes": {"liked": "— Location", "disliked": "— small room size"}}], "location": {"country": "United States", "city": "San Francisco"}, "stars": 3.5, "variance": {"poor": 30, "average": 102, "very good": 234, "terrible": 18, "excellent": 225}, "aka": "Club Quarters San Francisco Hotel San Francisco", "slim_ranking": 0.2, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.0, "rooms": 3.5, "location": 4.5}, "description": "Private, full service club-like hotel with 346 rooms located in the center of the prime business district and a short distance from Embarcadero center, the city’s most prestigious office complex, with shopping, movies, and restaurants. The hotel is minutes to fine dining, shopping, and entertainment. A short walk to Market Street and most downtown points of interest, such as Chinatown, Union Square and North Beach. Convenient to the cable car system and a brief ride to Fisherman's Wharf, featuring the Elephant and Castle Pub and Restaurant with both a full American menu as well as English pub food at the bar. Club Quarters is the best value hotel based on quality and the prime location. Club Quarters provide:• Safe, restricted entry• Instant registration and check out• Free high speed internet access throughout the hotel• Onsite restaurant • Multi-menu in room dining options (through onsite restaurant and many local restaurants)• Refrigerator and microwave available• Unlimited complimentary chilled purified bottled water • 5 meeting and event rooms available (maximum reception style 100 people)• Free use of computer/printer • Ergonomic workstations• State of the art guest rooms with premium bedding• Contemporary furnishings• Flat panel HD TVs• Complimentary coffee and tea• 24 hour guest service desk • Fitness room • Exercise equipment delivered to guest room upon request • Corporate Apartments available • Value rates• Government per diem rates 365 day a year with valid ID• Laundry facilities."}