{"user_rating": 4.5, "review_count": 848, "name": "Club Belcekiz Beach Hotel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "Had a great holiday at this hotel, all the staff without exception were very friendly and couldn't do enough to ensure that all your needs were catered for, the room and all public areas were spotless. the food was excellent and plenty of variety. The location is right on the sea front and handy for an evening stroll to walk off the evening meal excesses before returning to the Plaza bar for drinks. Would highly recommend", "title": "fabulous holiday", "helpfulness": 2, "user": "DDTravellers15", "date": "September 29, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 45407117}, {"rating": 3.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "We visited the hotel from the 7th to the 21st of September and reading all the reviews on here we were expecting something special, that stopped when walking in the lobby on arrival it was shabby not what you expect from a 5* hotel.", "title": "Not 5* Not Platinum, Not for us", "helpfulness": 4, "user": "qatarman", "date": "September 28, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 3.0, "service": 3.0, "rooms": 3.0}, "id": 45359530}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "The room was ok for what its for sleeping and washing and was kept spotless by our maid.Staff were as it has been said very good.", "title": "A Very Enjoyable Holiday", "helpfulness": 3, "user": "AuldyinHerts", "date": "September 28, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 45291223}, {"rating": 3.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "The food which get raves reviews on here, well if you like the dinner left overs from the night before hashed up in cream sauce then you will be okay also if you like tomato soup no problem its available EVERY night at dinner.The breakfast is a none event toast (only 1 machine for all the guests and 3 passes to brown the bread) eggs if you could find the Chef to cook them,jam like water,some incepid looking sasuages, is this top class 5* food,not even a Menu posted so you could see what was for Lunch and Dinner this is done by 2* hotels.", "title": "Nice hotel - shame about the food poisoning!!!", "helpfulness": 3, "user": "snowy1624", "date": "September 27, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 3.0, "rooms": 4.0}, "id": 45014012}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "Entertainment is 1950s Butlins enough said.The Plaza Bar, it took 15 to 20mins to get a drink and when it came it was not as ordered and the Barcardi and Coke I payed for we are still looking for the Barcadi.This bar had 2 wedding parties while we were there and they were the ones being fawned over by the waiters because they were paying.", "title": "ABSOLUTELY AMAZING!", "helpfulness": 6, "user": "mandyjl", "date": "September 22, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 43709948}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled with family", "text": "We have just come back from a week at Belcekiz Beach and found it to be a really charming hotel. Whilst the rooms are not luxurious they are spotless, well maintained and well equipped. The food was the best all–inclusive buffet I have seen. I have holidayed in 5 star hotels in 5 continents and this food was special – local, international, fresh, healthy, cooked to order, varied and very yummy.", "title": "Impressive and full of charm", "helpfulness": 3, "user": "Ruthjfj", "date": "November 3, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 48389228}, {"rating": 3.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "We were there in the last week of the season and so enjoyed fabulous service in a not-full hotel. I have no opinion on the entertainment as we did not engage with it, but the bars, gym and other facilities are well staffed and equipped. We had a night of horrendous rain during which it became apparent the hotel’s communal areas was not really designed for rain and cold, but apart from this we very pleased with the whole experience.", "title": "Not 5 star or platinum more like tin", "helpfulness": 7, "user": "joanmombasa", "date": "October 29, 2009", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 48040941}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled with friends", "text": "In summary, the quality of service and food are top notch, the setting and facilities are excellent and the rooms are fine. If you want a standard box, book a Hilton or a Holiday Inn – if you want a charming and impressive local experience, Belcekiz Beach would be my recommendation.", "title": "paradise", "helpfulness": 2, "user": "marabs", "date": "October 29, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 48024564}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "Having just returned from a 3 week stay at the Belcekiz Beach,and booked this holiday on the reviews on trip advisor a year ago.Wehad a good holiday to Oludeniz,first time in Turkey,but very well travelled all over the world.Firstly,the good points of this hotel.The location of the hotel is 1st class,as is the resort area.Rooms are kept spotless,and maids are excellent.Reception staff pleasant and obliging,nothing too much trouble.The only thing that made this hotel a good stay was the food,which was excellent,and the chefs that obviously worked very hard to keep it that way.Aspecial mention to the dessert chef,SELCUK(JIMMY)as his creations were exceptional.Also the restaurant staff,who worked extremely hard and a special mention to Aysha and Hassan.Im afraid that is where the good points stops.On the bad points the main pool and bar area is scruffy and dirty,daytime snack area dirty with lots of flies about,we did not eat there once .Entertainment diabolical,or nonexistant and mainly for kids.Nothing for adults to do at night and nowhere to sit and relax.Music far too loud and going on till 1am keeping you awake.Gardens are grassless and muddy and unkept.Not enough lighting around the grounds and very dismal,and finally this hotel is very clicky as for some strange reason ,some guests do return for more of the same.Also in the 3 weeks we were there,Mehmet,the restaurant and bar manager spent most of his time fawning over his regulars and cronies who took time to walk his dog for him.So overall it is definitely not a 5 star more like a 3 with exceptions for the food.", "title": "Not quite 5 star", "helpfulness": 3, "user": "OwenLondon", "date": "October 22, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 5.0, "rooms": 3.0}, "id": 47505023}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled with friends", "text": "Having just returned from the Club Belcekiz Beach Resort, i was eager to write a review on the Hotel. My husband Ian son Edward daughter Emily and Best friends Andrew,Clare,Polly and Harry had the most wonderful holiday despite the weather being a little unsettled. If i were to give marks out of 100 it would score 100. The rooms are spotlessly clean and even the towels and bedding smelt clean and fresh, something i have never experienced in a Hotel. You usually have sandpaper rough towels and never that fresh clean smell. The maids worked so hard to maintain first class standards,not a speck of dirt in sight. ...The food, WOW, IT was fantastic, how anyone could complain about it is beyond me although you will always get some people who have an ill palate and moan. It was beautifully presented fresh,hot,tasty,huge choice and never ever ran short.The service was 5 star, never ever did our party sit with an empty glass, there was always a happy smiling waiter/waitress on hand to top up the glasses. The staff worked so hard to ensure everyone was looked after, and what shone through was the staffs team work. Never ever did the staff appear mardy and the resturant Manager had us in tucks of laughter at every meal and should be wearing a jesters outfit for his effort. I would not hesitate to recommend the Hotel to anyone. It well deserves the 5 stars it has earned. The hotel should be proud of its achievements and on behalf of our family the Marabellas and our friends the Underwoods we would like to say a huge thankyou for making us all fat alcoholics!!!!!......... But very happy ones.We will return. xx", "title": "Brilliant Hotel but check Tui baggage allowances!", "helpfulness": 1, "user": "Schmokin", "date": "October 19, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 47241599}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "My wife and I stayed here for two weeks from 25/09--11/10 and were very impressed with the Hotel in general but with particular mention to the quality of the food and drink but even more for the hospitality. The staff are all young and the majority on work experience from around Turkey and Eastern Europe.They are very well trained extremely friendly and polite and will not suffer the sight of an empty glass. All in all it is a great hotel and excellent value when considering the service and all inclusive hospitality ,oh and the location is as good as it gets,. One small gripe, smokers sun beds should maybe be segregated from others? Great place, well recommended. The a la carte is worth a try just to experience table service for a change, do eat out occasionally too as good value restaurants abound.", "title": "Service with smiles", "helpfulness": 6, "user": "JohnDoeTyneandwear", "date": "November 10, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 86643530}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled with family", "text": "Travelled to Olu Deniz for the 12th time and stayed at the Belcekiz for the first time since 1997. Have stayed in various hotels in the resort, most of which were all absolutely fine. The Belcekiz however in a class above the rest in every way. Despite mixed weather (the worst we've ever had) we still felt relaxed, pampered and spoilt after our week at the hotel. Our 3 year old had an absolute ball both day and night and was very upset to leave.", "title": "best hotel in olu deniz for location and service", "helpfulness": 6, "user": "suzanne015", "date": "November 1, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 85584236}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "The hotel was immaculately clean and tidy . The service was amazing. No queing for drinks, they were almost instantly replaced for you. Couldn't fault the food, always plenty of choice and head chef offered to cook something for our daughter if there was nothing she liked.", "title": "Back Again", "helpfulness": 4, "user": "Andy_and_Sue", "date": "October 29, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 85285433}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "The entertainment team were excellent without being too pushy ( something we've found in other hotels in Olu deniz). My only complaint would be the childrens pool temperature , it was even colder than the main pool, which was also not for the fainthearted! Location wise the hotel couldn't be better. The beach is just a 2 minute hop across the road. Perfect for anyone who likes to go to the beach for a paddle or walk without trekking miles in the heat. Just watch out for paragliders landing as you cross the walkway!! Didn't want to come home from this holiday and can't wait to go back to Olu Deniz again soon, hopefully to the Belcekiz .", "title": "Fantastic Staff!! Very Good hotel.", "helpfulness": 2, "user": "Blackthorn", "date": "October 29, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 85256641}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "Back from the Belcekiz Beach after our 4th year in a row, and we don't even come close to being regulars. Shows how good this place is, or does it. Many people we have spoken to are starting to voice the opinion that there are better value holidays to be had with better facilities and service elsewhere, both in Turkey and further afield. So why do so many come back year after year, is it complacency or is it something else. Perhaps a forum, maybe hosted by the management, to obtain constructive feedback to further improve the Belcekiz experience could be started.", "title": "Fantastic!!", "helpfulness": 3, "user": "xstaceyx_10", "date": "October 28, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 85147142}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "The hotel is a 5 star according to Turkish rating but not for anywhere I have ever been before. Yes, it is in a very good location probably the best in Olu Deniz. I read some rave reviews about this hotel on TA before going and I was really expecting something fabulous. The hotel is quite dated and basic. We had a room in the main hotel and the wardrobe was a joke as there was a shelf half way down which prevented anything other that the tiniest top hanging properly so don't take your long dresses ! The room was clean but we didn't get any 'maid's creations' or flowers on our bed like so many had mentioned. The toiletries consisted of shower gel, shampoo and 4 cotton buds oh and a pencil and sewing kit ! 5 Star I think not. There are tea and coffee making facilities in the room and the air conditioning was good. The TV only had the usual basic channels. On the plus side there are fabulous views from the dining room which is all open air (beware of flies at the buffet during the day) The white wine is quite pleasant and the beer is refreshing in the heat, we had it with lemonade. The Plaza Bar at night is very atmospheric with great music, don't bother with the entertainment unless it is imported. The staff do work very hard which we appreciated. It is very clicky with the entertainment team spending time with their 'favourites' which was fine by us as they left us mostly alone! I must mention Air who was in his own words 'everywhere' ! I don't think any of the staff get a day off so 10 out of 10 to them. We had a rain storm one lunch time and the waiters just carried on serving drinks even though they were soaking wet, well done guys and gals. A word about the swimming pool, I did the rope drop on our last day but still failed to get a pole position sun bed, you see they went and extended the hotel but didn't realise there wouldn't be enough room around the swimming pool for everyone but you can always get a seat in the pool bar for a shady shandy.", "title": "Very Good Location", "helpfulness": 6, "user": "SueG56", "date": "October 8, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 3.0}, "id": 46274007}, {"rating": 3.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "The beach is very stoney so buy some rubber shoes in resort for going in the water, this is not for the faint hearted as it gets very deep very quickly. We went to the blue lagoon which is better for swimming and at the Sugar Beach Club there is sand and you can get a free bus there from the hotel. If you walk to the lagoon you will find the same stoney beach.", "title": "Not a 5 star hotel but entertainment and staff made for a good holiday", "helpfulness": 4, "user": "ChrisJaggerWilliams", "date": "October 4, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 4.0, "rooms": 3.0}, "id": 45780219}, {"rating": 3.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "We did enjoy our holiday very much as it was so different, very laid back and not a lager lout in sight. Turkish people are very friendly and helpful but a bit pushy in the shops so be aware, you can also haggle as I did. If you want cheaper stuff get the dolmus to Fethiye which has good shops and a lovely marina. Watch the para gliders whilst taking in the stunning scenery. Try it for yourself you will have a good time but don't expect too much and you won't be disappointed.", "title": "3rd time here", "helpfulness": 5, "user": "putneylady123", "date": "October 2, 2009", "detail_rating": {"cleanliness": 5.0, "value": 1.0, "location": 5.0, "service": 5.0, "rooms": 2.0}, "id": 45659733}, {"rating": 3.0, "stay_parameters": "Stayed September 2009, traveled with friends", "text": "Having read previous comments before we booked and went , we knew that the rooms would be disappointing in terms of size, storage space and a 'snug' balcony were expected.", "title": "NOT 5*", "helpfulness": 3, "user": "donnasquires", "date": "September 30, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 4.0, "service": 5.0, "rooms": 3.0}, "id": 45516865}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "What did spoil the holiday somewhat for me being an active person was the state of the games and leisure equipment, broken pool cues, tennis bats with no rubber and a wobbly table tennis table with poor lighting. We have stayed in nicer and better 5 star hotels elsewhere so this was not on the same level in terms of quality and range of food on offer. The option not to have a cocktail of the day included and a limited range of spirits could be addressed. Air, Go Go and Tom on the entertainment team were great fun and encouraged participation but without any pressure. The catering staff and poolside service was good as they all worked long hours extremely hard to make you feel relaxed and get anything you wanted . Compared to other hotels in the same area we feel this is the one to choose if you are thinking of going in terms of location.", "title": "Fantastic staff ..... but certainly not a 5* platinum hotel", "helpfulness": 4, "user": "CarterPZ", "date": "September 29, 2009", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 4.0, "service": 5.0, "rooms": 3.0}, "id": 45450726}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled with family", "text": "I stayed at the Becekiz Beach Club (BBC) for two weeks at the beginning of October with my wife and family.", "title": "Better than the reviews, best holiday ever!", "helpfulness": 6, "user": "enzuigiri", "date": "October 12, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 83127388}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "Summary", "title": "another good holiday at the belcekiz", "helpfulness": 2, "user": "stokiepaul", "date": "October 3, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 81958811}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "-------------", "title": "Good Hotel", "helpfulness": 4, "user": "stonker", "date": "October 3, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 81906918}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "This is without a doubt the best holiday I have ever had and the best hotel (overall) that I have ever stayed in. From the moment we arrived to the moment we left we were treated like royalty and the facilities and staff are beyond excellent.", "title": "Brilliant Belcekiz - Excellent!!!", "helpfulness": 2, "user": "Lynette49", "date": "October 3, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 81900729}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "I have read some reviews saying ‘not platinum’ and obviously this only applies to a certain holiday company so perhaps not relevant on Tripadvisor however addressing that for a moment, if I compare this with platinum offerings in other places I have stayed (such as Cyprus) then it compares extremely well, if not better – personal opinion of course (as is the rest of the review)", "title": "Great hotel", "helpfulness": 1, "user": "MAP59", "date": "September 27, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 81255672}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "Yes visited again. Why?", "title": "Another revisit", "helpfulness": 5, "user": "cabby289", "date": "December 21, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 51611496}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "We feel at home here and in the forums I have said I would do another review after this visit.", "title": "Excellent holiday", "helpfulness": 2, "user": "JanuszWarsaw_Poland", "date": "November 15, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 49235025}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled with family", "text": "The only changes I felt was the evening entertainment this time was poor as was shown by the numbers attending as there were plenty spaces left and in previous times everyone shuffled up to squeeze more in.", "title": "Lovely Hotel in a Great Location!", "helpfulness": 5, "user": "cadBuckingham", "date": "November 6, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 48645683}, {"rating": 3.0, "stay_parameters": "Stayed October 2009, traveled with friends", "text": "Yes the gardens were not as good but it has benn a difficult summer and more variable weather.", "title": "felt ripped off", "helpfulness": 4, "user": "sheforr", "date": "November 5, 2009", "detail_rating": {"cleanliness": 5.0, "value": 2.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 48569956}, {"rating": 3.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "The staff were as lovely as usual and food acceptable for buffet style but there is the option to go to the chefs for the theme of the evening which I did most times.", "title": "Good holiday spoilt by excessively noisy animation team", "helpfulness": 4, "user": "IOWcouple", "date": "November 3, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 48390229}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "our 5th visit ti this hotel over 7 years always has been a fantastic hotel and will hopefully stay that way.We tend to go to the beach and not sit around the pool , always seemed to be plenty of sunbeds free though, the restaurant was great lovely food gained quite a few pounds!!! the bar staff friendly always smiling and asking if you needed anything .lovely clean rooms we however had really noisy neighbours who liked to shout at each other ar 2 in the morning, however this is not the hotels fault and they were gone after 3 days. we will definately come back for another stay in the future.", "title": "perfect", "helpfulness": 1, "user": "lynnie1000", "date": "October 24, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 84639512}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "A great place to go for relaxing or an active holiday. Beach looks great on pictures but is pebbles and shelves off quickly making it difficult to get out of sea.", "title": "Great Holiday", "helpfulness": 1, "user": "alglenAberporth", "date": "October 23, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 84533183}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled with friends", "text": "Just returned from my 6th visit to Belcekiz. Had a great time, despite the bad weather. It was lovely to see lots of staff from previous years and especially good to see Al and Air, who I hadn’t seen for four years. All the staff looked after us very well, as always, and nothing was too much trouble. The only negative comment I have about the staff is that most of the girls and boys who bring the drinks round the pool are eastern European students now. They do their jobs well, but you can’t seem to have a laugh with them like in previous years when it was all Turkish staff.", "title": "Fantastic!", "helpfulness": 2, "user": "AlisonC1970", "date": "October 21, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 84328633}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled with friends", "text": "The food was excellent as ever and I really don’t see how anyone could go hungry.", "title": "Fantasmagorical - try it and see for yourself", "helpfulness": 1, "user": "PlatinumPensioner", "date": "October 19, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 84033374}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "The only real downside this year was the weather. We only had one full day of sun and there really isn’t much to do when it’s wet. They put some movies on, but I don’t want to sit indoors watching a film when I’m on holiday – I want to be socialising with everyone else. We could have done with some quizzes or bingo or games like Giant Jenga that everyone can join in with, or maybe Turkish lessons like Al used to do a few years ago. Also it would be nice if the pool could be heated at the beginning and end of the season. I really wanted to have a swim every day, but it was so cold I felt like all my internal organs had frozen!", "title": "Great Service", "helpfulness": 1, "user": "EastCoastBruce", "date": "October 16, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 83685991}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "Visited again last October.", "title": "Not spoilt by weather", "helpfulness": 1, "user": "cabby289", "date": "April 7, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 103156702}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled with family", "text": "You cannot really beat it for a casual holiday in an unbeatable location and excellent service.", "title": "Really Great - Booked Again", "helpfulness": 9, "user": "braddyWales", "date": "January 8, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 92163350}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "Some days we were huddled in the pool bar under the patio heaters but it became a bit of a laugh. I have been here at this time other years and the weather has been great.", "title": "Noisy and dull room", "helpfulness": 4, "user": "Stiegldrinkers", "date": "December 6, 2010", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 1.0, "rooms": 2.0, "location": 3.0}, "id": 89159930}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled with family", "text": "Liked the new food hall as there appeared to be more choice.", "title": "Turkish paradise", "helpfulness": 6, "user": "qwerty222222", "date": "November 22, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 87940305}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "Mehmet and all the guys and girls make it enjoyable each time.", "title": "Wonderful location, excellent management", "helpfulness": 2, "user": "NederlandTheHague", "date": "November 16, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 87235742}], "location": {"country": "Turkey", "region": "Turkish Aegean Coast", "continent": "Europe"}, "stars": 4, "variance": {"poor": 12, "average": 48, "very good": 163, "terrible": 6, "excellent": 619}, "aka": "Belcekiz Beach", "slim_ranking": 0.0722891566265, "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.5, "rooms": 4.0, "location": 5.0}}