{"user_rating": 4.5, "review_count": 3851, "name": "ClubHotel Riu Tequila", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "This was our second trip to the riu tequila and again we had a wonderful time.Flight was a little bit of a pain,Flew with Thomson ,[who were fantastic as allways]left Birmingham 8.30am but had to stop in Manchester for change of crew and refueling which was a bit of a pain.arrived cancun about 3.00pm there time and no problems getting through there customs,but make sure you fill in the immigration forms correctly as they are strict on this.It is then about an hour to the hotel by coach.", "title": "Excellent holiday", "helpfulness": 6, "user": "johnwood0804", "date": "May 2, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 63052371}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled with family", "text": "On arrival you are given a drink your keys and wrist band and you go to your room,your bags arrive shortly afterwards.", "title": "Drunken haze", "helpfulness": 4, "user": "Tequila_Geoff", "date": "May 1, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 62938142}, {"rating": 4.0, "stay_parameters": "Stayed April 2010, traveled with family", "text": "Rooms are good with toilet and shower and two large beds.ive never slept so far from my wife.The room has a free safe and the mini bar is free.roomsarecleaned everyday.", "title": "Excellent for just relaxing", "helpfulness": 3, "user": "phoej", "date": "April 30, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 62823460}, {"rating": 2.0, "title": "Not At All Good!", "text": "Entertainment weather it is activities such as games are excellent and evening entertainment is fantastic with something for anyone from young to old.", "helpfulness": 2, "user": "Magx52", "date": "April 28, 2010", "id": 62699669}, {"rating": 3.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "Food is again brilliant from steaks to burgers fantastic salads and much more.", "title": "Not all that great!!", "helpfulness": 1, "user": "Ben064", "date": "April 27, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 3.0}, "id": 62616489}, {"rating": 5.0, "stay_parameters": "Stayed November 2005", "text": "We were at this resort from Nov 26 to Dec 3/05 and just loved it. This trip replaced our disastrous holiday at the Rius in POP (Puerto PLata), Dominican Republic last year and we were so hoping that it would be much better and it was.", "title": "best holiday yet", "helpfulness": 13, "user": "snowyowl", "date": "December 11, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4231268}, {"rating": 5.0, "title": "fantastic holiday", "text": "We found everything about the resort wonderful. The staff, the grounds, our rooms, pool and the food at the restaurants was fantastic. We did find the beds hard like someone had mentioned in another review. The only complaint we heard was from someone who said they'd never go back because their kids complained about not enough food that they would eat, like McDonalds!!! We had the hamburgers and they were delicious unlike the hamburgers we have tried in Cuba and the DR. We never tried the a la cartes because we enjoyed the selection of foods at the buffets and we can't be bothered to get up early to book although it wasn't crowded so we could have easily booked when we were eating breakfast.", "helpfulness": 15, "user": "A TripAdvisor user", "date": "December 4, 2005", "id": 4160763}, {"rating": 4.0, "stay_parameters": "Stayed November 2005", "text": "Because of the health issues last year at POP we (my husband and I) took bismuth tablets at every meal. I assumed my kids were too but at the end of the week I asked if they had been using them and much to my surprise they said no and none of us were ill.", "title": "Tequila in good shape", "helpfulness": 16, "user": "StarsFan", "date": "November 25, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 4144108}, {"rating": 5.0, "stay_parameters": "Stayed November 2005", "text": "The only noticeable damage at the Rius from the hurricanes was the tree tops and they were growing their leaves back. When you walked down the street or on the beach you could see damage done to the other resorts. Other than the Viva Wyndham salesmen bugging you to go in there were no problems.", "title": "Excellent", "helpfulness": 15, "user": "johntorr", "date": "November 19, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 4127595}, {"rating": 5.0, "title": "Great Stay at the Tequilla", "text": "It wasn't crowded the week we were there so there was no worries about finding a decent place at the beach or pool or long lines for food. We didn't have to book a seating time for supper which was great, we just went when we wanted to. Probably when it gets busier they'll go back to seated times.", "helpfulness": 12, "user": "57Cato", "date": "November 18, 2005", "id": 4126312}, {"rating": 3.0, "stay_parameters": "Stayed October 2005", "text": "We were at Riu Tequila from October 16-26. We were there 3 days longer due to Hurricane Wilma.", "title": "Suntrips Failed Us During Hurricane Wilma", "helpfulness": 11, "user": "resaridg", "date": "November 6, 2005", "detail_rating": {"cleanliness": 4.0, "value": 1.0, "rooms": 3.0, "service": 2.0}, "id": 4089842}, {"rating": 5.0, "stay_parameters": "Stayed October 2005", "text": "Yes, the hotel did it's best to deliver food to us while the hurricane was in full blast. We did feel safe considering the circumstances. However the hotel charged for the 3 additional days. We talked to other guests (British, European, Apple Vacations), and they were not charged for the extra time they stayed. For some, it was almost a whole week. I asked the front desk what happened if we didn't have the money. He responded that it hasn't happened and that they had sent Federales to the airport in past instances...????", "title": "very very good", "helpfulness": 15, "user": "suzydLondonEngland", "date": "November 1, 2005", "detail_rating": {"cleanliness": 3.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4077707}, {"rating": 5.0, "stay_parameters": "Stayed September 2005", "text": "We would have enjoyed our stay had the hurricane stayed away. However, after it was all over, it was very apparent the front desk staff were getting irritable and not so friendly. Sometimes they were downright rude. It was very frustrating because we were trying to figure out how we would get home.", "title": "What ??", "helpfulness": 26, "user": "MKElrick", "date": "October 31, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "service": 5.0}, "id": 4075203}, {"rating": 4.0, "stay_parameters": "Stayed July 2005", "text": "Our tour rep from Suntrips was HORRIBLE! She was a pathological liar. She claimed to be there when she wasn't, and she didn't show up after SHE set a \"9:00 a.m. sharp\" meeting. Another guy showed up 40 minutes late to tell us Anne-Christine wasn't coming and he had no new information. Thanks for nothing Suntrips!", "title": "Butlins in the sun?", "helpfulness": 15, "user": "Bar1", "date": "October 31, 2005", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 2.0, "service": 5.0}, "id": 4074508}, {"rating": 5.0, "stay_parameters": "Stayed October 2005", "text": "Suntrips informed us that it was up to Riu hotels to refund us for the portion of the hotel we didn't get to use. I'm sure we will go around and around and get nothing. It's all so frustrating. I'm questioning whether I will stay at another Riu hotel depending on the outcome of this. I realize a hurricane is not their fault, but it's not mine either and why should I be completely out of the hard-earned money I paid to enjoy a vacation??", "title": "We survived Hurricane Wilma!", "helpfulness": 49, "user": "Ivzmom", "date": "October 28, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 4069026}, {"rating": 4.0, "stay_parameters": "Stayed July 2005", "text": "I stayed there for 3 nights just before hurricane Emily back in July. We had to leave in the middle of the night on our last night but while we were there we really enjoyed our stay. There is an abundance of food and if you can't find something you are very picky. The staff works very hard and the grounds are well kept. The beds were a bit hard for me, but no big deal. Loved the room fridge stocked with water, soda and corona. The walk to the beach is a piece of cake and I can't believe that people complain about it; very lazy people, I guess. Nice beach, nice pools very relaxing; would definitely go back.", "title": "Loved the riu tequila.", "helpfulness": 13, "user": "hellommg", "date": "January 4, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "service": 4.0}, "id": 4325182}, {"rating": 5.0, "title": "Love the Riu Tequilla", "text": "We rely on Trip Advisor whenever we take a trip to a new location, so we try to contribute. We had a wonderful one week stay at the Riu Tequilla in Playa Del Carmen, Mexico between Christmas and New Year. We are a family of four with 5 and 7 yrs old children. The staff bent over backward to please us. Whenever we see them, it's always a smile and a willingness to help. Our room was a suite, comfortable, clean, well kept and large. Our fridge was stocked full of drinks. We made a request for extra water bottles, and they were there each and every day. The food was good and plentiful. We did not go to any shows because our kids were exhausted by the 9:30 pm show time. We did not need to use the kids' club because our kids loved spending every day at the beach. The beach is a pleasant 10 minutes stroll with shadded overhead trees. We ate so well that the exercise was most welcome. The sea was calm and aqua blue, the water bath temperature. The only evidence of the hurricanes were the tops of the palm trees had fallen off. We did one excursion to Coba and had a wonderful time. We would recommend booking through Apple Vacations again because the representative Dani was there everyday at the hotel and gave us great tips on excursions and shopping. Shopping was a $5 taxi ride to 5th avenue, great prices. We exchange peso there because the rate seemed to be best. Overall, we had a wonderful time. Even the Riu Tequilla was all inclusive, we tipped every chance we got (the staff made our vacation so wonderful and they work so hard for so little). We gave $2-$5 tip for breakfast and lunch, and $5 for dinner. The restaurant staff was attentive. We tipped our room attendant $5 each day. Having been to the poor sections of town where the hurricanes hit the worst, we felt guilty for being so well pampered at the resort.", "helpfulness": 17, "user": "blink4", "date": "January 4, 2006", "id": 4324071}, {"rating": 5.0, "stay_parameters": "Stayed December 2005", "text": "We stayed at the Riu Tequila in December 2005, just before xmas.", "title": "Riu Tequila - Great Resort!", "helpfulness": 15, "user": "thegame_911", "date": "January 3, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 3.0, "service": 5.0}, "id": 4321980}, {"rating": 5.0, "stay_parameters": "Stayed December 2005", "text": "The hotel is easily within walking distance of the beach , a 15 min walk max. The pool was quite nice as well.", "title": "Wish i had booked a longer stay!!!", "helpfulness": 15, "user": "Tadike", "date": "January 3, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 4320216}, {"rating": 5.0, "stay_parameters": "Stayed December 2005", "text": "Food was pretty good. Lots of choices at the buffet. The pasta was great. And lots of fruits and vegetables on hand.", "title": "Loved the hotel Rui Tequila but very dissapointed with Thomson Holidays", "helpfulness": 18, "user": "redrobinuk", "date": "January 2, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4317120}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled with friends", "text": "For the first time doing an all inclusive \"Tequila\" was the place to start and before we left we were already planning next years trip. Went there with another couple for our friend's birthday and from the time we boarded the shuttle at around 11PM our party had begun.", "title": "OH WHAT A NIGHT....", "helpfulness": 3, "user": "nlheartland", "date": "May 3, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 63162363}, {"rating": 5.0, "stay_parameters": "Stayed April 2010", "text": "Check in was quick and easy & a late night snack waiting for us at the room. Room was VERY clean and spacious. The liquor dispenser and stocked mini bar was an added bonus,however did not drink in our rooms because service was so good at the bars we perferred sitting in the loby or at the bar with a cold one... Breakfast was outstanding, lots to pick from every morning. Lunch was good, ate off the resort 3 days, missed lunch all together another day due to intoxication but the other days found a great variety to chose from. Dinner was always good. Getting up early to make reservations was not a problem for our party of 4 because we are all early risers. While the boys went to book reservations the gals got freshened up to take on the day. Done the steak house one night and was a little disappointed. Food was fine but I have a major fear of cats and there they were wandering around the steak house waiting for someone to drop a scrap of food. I spent the whole meal looking over my shoulder or should I say under my feet. Just as we had finished our meal my watch had come on hooked and dropped off my arm and fell to the floor, the GD cat must have thought it was food and came chasing after me... Needless to say we did not return to the steak house. No Big Deal.. The asian resturant was awesome as well as the buffet dining room. Found we were never hungry after eating dinner so did not go to the sports bar for late night snacks but apparently there was lots to be gotten. Lots of wildlife to see and before I went to the Tequila I read some of the reviews on here and looked at pics. I have to admit I was a little freaked out. Once I got there and realized that they really don't bother you, I was okay. I actually got used to them and by the end of our trip I was snapping pics of them myself", "title": "AMAZING!!!", "user": "mexicoloverEngland", "date": "May 3, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 63132610}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "The pools were great and the swim up bar was a hoot. Julio and Maria are da best especially to the birthday girl..LOL..", "title": "WE werent Disappointed", "helpfulness": 8, "user": "KathleenI", "date": "May 3, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 63123773}, {"rating": 4.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "Only one word to describe the beach...AMAZING... White sand, turquise water and cold drinks, what more could you ask for. Walkway to the beach was so relaxing and they say it is 10 or so minutes. Definitely didn't seem like that. Parasailing was out of this world and we took advantage of the free water activities also. There was no trouble getting kayaks or boogie boards at any time.", "title": "Worth the price we paid!", "user": "Veterantraveller_9", "date": "May 3, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 2.0}, "id": 63111102}, {"rating": 4.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "We done Xplore one of the days we were there and a lil tip is to buy the package for $99 US and go on your own. Take your own taxi to and from for about $15 US each way and then you can come and go as you please. The ziplining is great but tires you out so you can just jump in a taxi and head back to your hotel when you are ready as opposed to having to wait for a group to finish. They offer you an all inclusive day package and it was well worth the money.", "title": "Well Worth It !", "user": "CurleySuz", "date": "May 3, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 63068056}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "Just returned from our third, 10 day vacation to this resort...in the past 4 yrs! Needless to day we enjoy this place! Can't quite figure out all the complaints though...travelling is about the experience! You can find \"peace\" or \" trouble\" where ever you go! The service is out of this world at this resort & in Mexico in general. ( this was my 11 visit to this country!) The hotel staff is beyond friendly & helpful. Food is good and safe to eat at all venues. Yes, a bit of a drag to get up to sign up for a la carte, but it is a beautiful time of day! Take advantage of dawn on the beach...grab a coffee and stroll the beautiful beach or even just stroll down the street. (very safe to leave the resort...no one gets in to Playacar with identification...let alone the resort itself ) During our stay this time Spainards were celebrating graduation and pretty much took over the pool a day a few days. We also found them loud & overbearing & disruptive. But hey, they are young......weren't we all??! Annoyed yes, but did not complain to hotel. Not the hotels fault....but am confident they would have moved us from our high traffic room. Just a note: hallways carry an echo.....be it conversation or closing the door to the room...hey it's a structure thing...:) We again, had a fab time and found great value for our Canadian dollar! Will again return to this resort. ( should note that we met up with 4 other couples who have also been to the Tequila AT LEAST 3 previous times...some with kids, some without.....I think that speaks volumes!) If you want a pretenious, uppity, formal vacation, where you have to dress up for every meal & do not want to hear another voice of another person or see any wild life....then this is NOT the resort for you. ( also would like to mention, we stayed in Jamaica Sandal Grande Ocho Rios & an Almond resort in St. Lucia and the RIU is a thousand s time better!!!!!) Can't wait to return!", "title": "Third Visit was a Charm....again!", "helpfulness": 5, "user": "mentalmilo", "date": "April 26, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 62524370}, {"rating": 3.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "I think if this were my first all inclusive hotel we would have had a different opinion, but for us there are better out there. The ride to the hotel was fine, check in was fine, when we got there our room was on the ground level and i asked if there were any second level available, and in about ten min they had changed us to a second floor room. No one asked to help us with our bags so it was kind of a long trek to our room and up the stair with no bell man. I saw them though. The room was clean and nice, the frige stocked but was not restocked one time while we were there. My husband would just ask for a few bottles of beer when we headed back to the room. The beach was nice and we usually used the Yucatan pool. All of the pools were very cold and i hardly saw anyone in them. I was dissappointed that there were no hot tubs, just whirlpools connected to the main pool. I was not impressed with the entertainment staff rubbing the shoulders of some girls sitting next to us at the Yucatan pool. Not very professional. And i HATED the people who put there towel out on chiars at 6 am to get a spot. This should be a warning there is not enough chairs for the size of hotel it is. There was never a problem getting a chair on the beach around 9-10 am.", "title": "Good Value, OK hotel", "helpfulness": 1, "user": "fendawg42", "date": "April 25, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 62429273}, {"rating": 3.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "There was a great selection of food, but after a few days it did get old. Much is geared toward the european traveler. We loved the cook to order omlettes in the morning but get up early if you dont want to wait in a long line. We tried the mexican resturant one night and that was probably the biggest dissapoinment, there was really nothing mexican about it. The service was VERY slow, and the food not very good, i had garlic shrimp over rice.", "title": "Not that great and not 5 star !", "helpfulness": 1, "user": "Geemiker", "date": "April 25, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 62428740}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "The bars were ok, i liked the blended drinks, my husband liked the mohitos. They were not strong at all, and the \"top shelf\" rum was bacardi. I called to the front desk to see if i could get bacardi for the room and they said it would be $40, why when you have already paid to be at an all inclusive would it be that much more for liquor that you can get at all the bars. The next day the people with the bottles of drinks were sitting around and i aked them if i would get a bottle of bacardi for the room, they said yes, i tipped them $5 and imagine that, a bottle of bacardi. But remember the room was never restockd so i was constantly going to get diet at the bar. And i did call twice to have it restocked. I wish i would have brought big size mugs for drinks. Those baby size glassed were awful.", "title": "Outstanding Holiday & Wedding", "helpfulness": 6, "user": "Louise_S_Baker", "date": "April 25, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 62399371}, {"rating": 4.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "I know so people say that americans are rude, but i feel like i am a pretty easy going american that is friendly to everyone. I am not saying everyone was rude, but the majority of encounters with the people from other countries were not good. I found people to be very unfriendly and for example you ask them \"what they were drinking\" they just looked at you like what the hell are you talking to me for. There was a couple sitting next to us one night at dinner and they were from N. Carolina, and when they heard us talking they were so excited to meet some fellow Americans, and they had the same general opinion we did about other guests. The staff were all very friendly. Hola everytime they passed by.", "title": "Good hotel, boring resort", "user": "nellymay", "date": "April 25, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 2.0}, "id": 62361682}, {"rating": 5.0, "stay_parameters": "Stayed December 2005", "text": "Ok, first off i would like to state that someone wrote that 70% of the tourist are English, this is rubbish as up till now only two flights a week were going to mexico from england due to Wilma and First choice have started there flights to mexico however they do not use the Tequila!!!!", "title": "Really NIce!", "helpfulness": 18, "user": "mojodipper", "date": "January 1, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4315051}, {"rating": 4.0, "stay_parameters": "Stayed December 2005", "text": "There were mainly Americans, Canadians and other europeans, even the mexicans said how little people from the uK were visiting. I am going to begin my review by saying that i had an excellent time and that the mexican people are amazing they are lovly and friendly they really make you feel safe and wanted in there country!", "title": "Pretty Good Times", "helpfulness": 15, "user": "divetravler", "date": "December 21, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "service": 5.0}, "id": 4255006}, {"rating": 5.0, "stay_parameters": "Stayed December 2005", "text": "The hotel reception areas were lovly, i went to all the other hotels (Lupita, Yucatan,playa car) and i can honestly say the tequila is much prettier! If i had to choose one to go back to it would be the tequila!", "title": "Pre-Christmas at Riu Tequila", "helpfulness": 15, "user": "shandl2", "date": "December 20, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4252795}, {"rating": 5.0, "stay_parameters": "Stayed December 2005", "text": "Food was Ok, for how many they cater for it was excellent however i did find my self moaning to my partner most days about the food, for example at breakfast they had odd food that i can only asume was left over from thr night before, like chile pork and sweetcorn. We had hashbrowns on our first morning and they were lovly however we never saw them again, instead there were seasoned potatos? The bacon was good, the eggs were good and the coffee and juice was lovly! There was always plenty to choose from at breakfast even if it was not to everyones taste! Lunch was probly my favourite meal at the beach and at the hotel, there was allways fresh salads, pizza, burgers, chips, pasta, fresh fish the list goes on! Evening meal was probly my least favourite as there seemed less to choose from then lunch, however i always managed to find something!", "title": "Wonderful Trip", "helpfulness": 17, "user": "ColoMama33", "date": "December 17, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 4247380}, {"rating": 5.0, "title": "I want to come back!!!", "text": "As i dont drink alcohol the drinks were probly what drove me to moan the most (i dont usually moan) as the coke 7up ex all had a funny taste out of the machines and sometime were flat so tasted like syrup! I tended to drink coffee durring the day and drank banana milkshakes from the bar as they were lovly!", "helpfulness": 13, "user": "A TripAdvisor user", "date": "December 11, 2005", "id": 4232606}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "Just returned from 4 days at RIU Tequila. This is a beautiful hotel and the grounds were very well kept. The staff work very hard and are constantly cleaning.", "title": "Great Place, few small issues", "user": "kinoxl", "date": "May 11, 2010", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "service": 5.0}, "id": 63827849}, {"rating": 4.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "We booked through RIU.com and upon arrival at the airport, we were greeted by name. It took 45 minutes from airport. Check in was smooth and English was preferred over our broken Spanish.", "title": "A must....will be returning!", "helpfulness": 3, "user": "needawee", "date": "May 10, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 63717815}, {"rating": 3.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "The buffet dinner and breakfast was great, alot of selection. We ate at the Steakhouse and it was so-so. The steaks are more rib eyes and flank steaks, so no filets here. Lunch buffet was very average with hot dogs and burgers each day, but not bad. We did eat at RIU Playa car for lunch and it was exactly the same. The birds were sneaking in and eating right from the buffet plates. Gross.", "title": "Disappointing", "helpfulness": 1, "user": "DGbubble", "date": "May 7, 2010", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 2.0, "sleep": 3.0, "rooms": 4.0, "location": 2.0}, "id": 63484787}, {"rating": 3.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "We took an 1/2 day excurion through Blue Caribe and snorkelled with turtles in Akumal Bay. We also saw eel rays and a Baracuda. The reef was also very nice. We then went to Hidden Waters Cenote (same trip) and this was wonderful. The water was great and crystal clear. Highly reccomend this. We also visited Tulum. While very nice, it takes a while to get there and back, but also worth it.", "title": "It was alright", "helpfulness": 2, "user": "Shanberry", "date": "May 5, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 63344315}, {"rating": 5.0, "title": "good times", "text": "We ate in downtown Playa Del carmen one night and this was fun. The cab rides were exactly $5.", "user": "StephenL8", "date": "May 4, 2010", "id": 63267055}], "location": {"country": "Mexico", "region": "Yucatan Peninsula"}, "stars": 3.5, "variance": {"poor": 91, "average": 336, "very good": 1103, "terrible": 69, "excellent": 2252}, "aka": "Riu Tequila", "slim_ranking": 0.219387755102, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.0, "rooms": 4.0, "location": 4.5}, "description": "* Located in the Yucatan peninsula, 3 km / 1.9 miles from Playa del Carmen * Within the resort area Playacar along with the hotels Riu Palace Mexico, Riu Palace Riviera Maya, Riu Yucatan and Riu Playacar * Main building and 1-story buildings * Surrounded by 48,000 m2 / 57,600 sq. yards of lush gardens * 800 m / 2,650 ft. from the beach (complimentary shuttle) * Complimentary sun loungers on the beach * 300 m / 990 ft. from Mexican Street * 55 km / 34 miles from Cancun Int???l. Airport * Credit cards accepted: Visa, MasterCard, Amex"}