{"user_rating": 4.0, "review_count": 2740, "name": "Club Med Turkoise, Turks & Caicos", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed April 2006", "text": "Why Club Med? It was last-minute, it's all-inclusive (meaning all food, drinks, and activities are free), and I was going alone.", "title": "A New Yorker's Point Of View...", "helpfulness": 32, "user": "toasty24", "date": "April 30, 2006", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 2.0, "service": 4.0}, "id": 5019830}, {"rating": 3.0, "title": "We'll tell it like it is!!!", "text": "I shook off any cheesy pre-existing notions of Club Med (too much of a meat market, too \"mainstream\" for a downtown NY'er, too \"commercial\", etc) and off I went:", "helpfulness": 17, "user": "A TripAdvisor user", "date": "April 21, 2006", "id": 4994007}, {"rating": 4.0, "stay_parameters": "Stayed April 2006", "text": "ROOM (3 out of 5 stars)", "title": "Many great aspects, a few drawbacks", "helpfulness": 9, "user": "swatson61", "date": "April 15, 2006", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 3.0, "service": 4.0}, "id": 4974836}, {"rating": 5.0, "title": "Paradise", "text": "Despite a recent renovation, I found the room unimpressive and motel-ish(70's-esque orange and blue color bedspread and cushions), but livable enough, and would do ok during my stay. My biggest concern were these tiny ant-like creatures that kept appearing in random places. 2 were even on my bed and crawled onto my arm! I freaked out and called the front desk who said, \"We've never had a problem, but we'll have the maid spray around the bed.\" However, after asking other guests if they saw the same thing, they all said YES, but it didn't seem to bother them. Apparently the ants are harmless, and they do not bite. Most guests found them a very minor nuisance but i was still a bit skeeved since i hate bugs and this was a testament to uncleanliness.", "helpfulness": 8, "user": "A TripAdvisor user", "date": "March 20, 2006", "id": 4718502}, {"rating": 5.0, "title": "Outstanding!!!!!!!", "text": "BEACH: (5 out of 5 stars)", "helpfulness": 10, "user": "A TripAdvisor user", "date": "March 20, 2006", "id": 4716700}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "My fiance and I stayed at Club Med for a week and just got back. We were extremely nervous prior to leaving for Turks after reading some of the reviews here. Thankfully, the bad reviews seemed to be completely unjustified. First, let me say that we are beach people- we went for the beach. We were not looking for nighttime entertainment or to meet people and participate in lots of activities. We were also not looking for amazing cuisine. A vacation for us is a calm, quiet time to de-stress from work (and get a little drunk on the beach).The beauty of club med is that you can do nothing or everything and no one harasses you either way.", "title": "Good Value for the Money", "helpfulness": 5, "user": "heathergreg", "date": "May 7, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 5.0, "sleep": 5.0, "rooms": 3.0, "location": 4.0}, "id": 129553085}, {"rating": 1.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "ROOMS: They are old and not modern but were clean and the bed was very comfortable. Our electricity went out one evening for a few hours but was promptly fixed. We had to kill a few tiny ants in the bathroom sink a couple times. The AC was light, but did its job- it initially will make you think its not working, but it just takes time to take effect. The shower is very tiny, it's hard to touch your toes, but do-able. The floor kept getting dirty (don't know if it was from us, or just the room) so I would recommend you bring slippers to walk around in.", "title": "Needs to be renovated pronto!", "helpfulness": 3, "user": "Lovestotravelalot79", "date": "May 7, 2012", "detail_rating": {"service": 2.0, "cleanliness": 1.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 129539619}, {"rating": 3.0, "stay_parameters": "Stayed April 2012, traveled solo", "text": "BEACH: The beach was absolutely amazing. Club Med has a huge strip of beach so you are never on top of other people, which is nice. Lounge chairs on the beach vary widely. Some are rock hard and downright impossibly painful to lay on, but others have cushioning and are fine. You do need to get up fairly early to reserve chairs, esp if you want shade (which we did since we spent all day at the beach and the sun is harsh). Club Med has signs posted that if you leave your chair for 45 mins or more, you lose it, but that was never enforced. Beware different cultural norms if you are American: lots of french people always seemed to be smoking near me, with the smoke blowing at me, which pissed me off. One German woman in her 60's felt free to take off her bikini bottom on the beach to change into another one, in front of me, her husband, another couple they were traveling with, and everyone else on the beach- yikes!!! Water was a little too cold for me to enjoy it on a regular basis, which was unfortunate but refreshing to take dips in every now and again. Do NOT take a float out into the ocean, as there is a huge undertow and you will quickly float very far away from shore. Definitely stay for a sunset- it's beautiful.", "title": "My return to Club Med...", "helpfulness": 1, "user": "TomL1961", "date": "May 6, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 129479265}, {"rating": 4.0, "stay_parameters": "Stayed April 2012", "text": "FOOD: I am an extremely picky eater and I found tons to eat at every meal. If anyone complains about the food, they have serious serious issues. Some people complained about the wine, but I loved it. The maid left us new bottles of water every day just for leaving her a $3 tip, so there is no need to worry about the supposed \"two bottles\" they give you for a whole week.", "title": "Go for the spirit, not the amenities.", "user": "Snorkeleyes", "date": "May 6, 2012", "detail_rating": {"cleanliness": 2.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 129457401}, {"rating": 4.0, "stay_parameters": "Stayed January 2012", "text": "SERVICE: Service was excellent. All of our requests were met promptly and the Sharkies cook was awesome. I will say this was the first time in the Caribbean that we actually had our luggage delivered to our room in a timely manner upon arrival! The club med van was waiting for us as soon as we stepped out of the airport, and upon arriving, the greeters didn't waste our time- they let us get to our vacation and the beach right away, which I appreciated.", "title": "Consecutive trips there, And planning more", "user": "Romeo31881", "date": "May 3, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 129325497}, {"rating": 2.0, "stay_parameters": "Stayed May 2012, traveled solo", "text": "This was over my third time going here. Something’s changed. That’s usually from the top down so maybe corporate? The GOs are openly complaining about their jobs (I don’t want to hear it. I spent too much money to be your “I hate my job\" therapist, the friendliness is gone with most of them. I experienced some other incidents that I will take up with the company. Let’s just say more than once GOs assumed I was ‘the help.’ Tacky!", "title": "Things have changed", "helpfulness": 4, "user": "deserved", "date": "May 2, 2012", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 129274172}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled with friends", "text": "The GO who covered James Blunt’s Goodbye My Lover was wonderful! I still tear up.", "title": "Great Beach, fantastic sports, room & food okay", "helpfulness": 1, "user": "Smileydean7", "date": "May 2, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 129266476}, {"rating": 3.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "I enjoyed the trip despite what it’s becoming. It was good for the spirit. I walked away from the complainers GOs and GMs and just enjoyed myself.", "title": "All you need is 2 days...FREE FOOD, DRINK & ACTIVITIES", "helpfulness": 2, "user": "theUPTOPKID", "date": "May 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 129251347}, {"rating": 3.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "Not sure I could recommend it though. Depends what your motives are for choosing Club Med Adults Only.", "title": "T&C best beach-property needs some TLC", "helpfulness": 2, "user": "caymanbound26", "date": "May 1, 2012", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 2.0, "location": 5.0}, "id": 129208992}, {"rating": 3.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "Turks and Caicos is the best island! So if you're looking for decent food, a party every night, and to get out and explore - this spot is not so bad.", "title": "a lovely beach, but just regular resort", "user": "RICARDO A", "date": "May 1, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 129189777}, {"rating": 5.0, "stay_parameters": "Stayed June 2006, traveled on business", "text": "Club Med Turkoise is a great place. This is my 3rd stay at a Club Med. I've stayed at Bora Bora, Cancun and now Turks & Caicos. The water is the most unbelievably clear and warm water I've been to. The GOs are great host/hostess and David (Chief of the Village) is a very energetic person who strives to deliver a great time for all. The food was very good. I rate it the best of the 3 Club Meds I've stayed at before. Lots of fresh fish prepared numerous ways (sauted, fried, stewed, grilled, sashimi, etc.). I just loved the fried wahoo. Vegetables, salads and fruit are awsome. Did I mention that the deserts were great? You can't eat 3 whole meals without gaining weight. I opted to eat light at breakfast. Rooms are very clean and the shower is great to get cleaned up. The toilet is separate from the bathroom area. There are so many activities do do at this village (catamaran sailing, snorkel, scuba, kayak, wind surfing, trapezee, swim, basketball, tennis, boce ball, workout, etc.). Sharkies is a place to go late at night for snacks and drinks during the day, while you're on the beach. I would definitely return. The island is still small, but construction is under way to develop more resorts. I wish I could invest there, as I believe it will become a more popular place to spend vacation time.", "title": "Great Time at Club Med Turkoise", "helpfulness": 14, "user": "Dakineguy", "date": "June 27, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 5393444}, {"rating": 5.0, "title": "Don't miss out on a great vacation!", "text": "My friend and I just got back from Club Med Turks & Caicos and had a blast! We are already planning our next trip back in 3 months. The club itself is very nice and the beach is the best I have ever seen. We met great people from all over the world and everyone was so friendly. The GO's made us feel very welcome and were always going above and beyond to make us comfortable. The room was nice, not 5 star but clean and enough room for 2 people. The variety of activities was endless and we tried to participate in as much as possible in our 7 night trip. Water aerobics was really fun with GO's Brian and Jeremy. We also went snorkeling and did the wave runner excursion - don't miss!!! The nightlife was fun as well. The Chicago, trapeze, Cirque du Soleil shows were the best! The GO's also do a great job of getting the energy up during the shows. Yes, the crazy signs dancing is silly but it is SO fun. My friend and I are still laughing about our times at Club Med and are so grateful that we traveled all the way from California to see such a beautiful area, meet great people and relax!", "helpfulness": 13, "user": "A TripAdvisor user", "date": "June 21, 2006", "id": 5371836}, {"rating": 5.0, "title": "what an all-inclusive should be", "text": "I came here with my boyfriend, who had been to the Turks before, but I was really worried when I first read some of the reviews of ClubMed. While most of them were good, there was a good bit of \"cons\" that people wrote. Well, I did not find one con about it! The food was excellent -- they tried every kind of culture and did a really good job. And another good thing about the food/eating/dining was that they seated you at a different table with different people every meal. We met so many interesting people this way. We even met a couple that we hung out with almost the rest of the time (they were closer to our age, upper 20s). I felt like staying there for five days was not enough time because there are SO many things to do there (trapezing, snorkeling, salsa dancing, windsurfing, sailing, etc.) We didn't even get to do a lot of the things we wanted to do because I really just wanted to lay on the breathtaking white, white beach and get in the blue, blue water. The water is the most pristine you will ever see. And the shows at night, sure, they are by the GO's but I thought they were perfectly entertaining and I thought they did a very good job. The rooms was okay, but who spends time in their room when they can be outside at such a beautiful beach anyway? I just want to go back, and right away!", "helpfulness": 16, "user": "A TripAdvisor user", "date": "June 9, 2006", "id": 5327591}, {"rating": 5.0, "stay_parameters": "Stayed May 2006", "text": "I really would recommend this place to anyone who is thinking about going. Don't think twice.", "title": "Great honeymoon!! In Provo -- Go Club Med!", "helpfulness": 25, "user": "pull4ud", "date": "June 8, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 3.0, "service": 5.0}, "id": 5325860}, {"rating": 5.0, "stay_parameters": "Stayed May 2006", "text": "Great trip! First off … Club Med is an amazing dollar value! For what we paid, we got action-packed entertainment, food galore and drinks galore. And, I never heard a rumbling in my stomach once the whole trip. Feel free to e-mail me at Pullem@gmail.com. I had a hard time making my decision, and will be happy to share the good and bad with you.", "title": "Can't Wait To Go Back", "helpfulness": 23, "user": "sandstorm", "date": "June 2, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 5292852}, {"rating": 5.0, "title": "Club Med is Awesome", "text": "I stayed at Club Med Turqoise the week of May 13th - the 20th and I will absolutely go there again. It was the best vacation I ever had and I travel at least twice a year. I traveled to Turqoise solo, but I felt like I went there with 50 friends. I meet two great girls the first day I got there. Hey Dana and Crystal! You guys are the best. Can't wait to meet up with you soon to plan our next trip!", "helpfulness": 10, "user": "A TripAdvisor user", "date": "May 21, 2006", "id": 5186827}, {"rating": 5.0, "stay_parameters": "Stayed May 2006", "text": "Everyone was just so friendly and laid back. I meet people from all over. Canada, Boston, Bernie from Oregon (hey Bernie thanks for the great dancing every night), Paris, London, California, Connecticut, etc. I thought the food was great (ate way too much White Chocolate Bread), the drinks were really great, the rooms was very nice and clean. The beaches in Turks and Caicos are beautiful. I thought that all of the GO's were so cool. I don't have a bad thing to say about Club Med Turqoise. I did not want to leave, could of definitely stayed a few more days. Yes it was hot, but loved it.", "title": "another great vacation", "helpfulness": 10, "user": "dhauk", "date": "May 6, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 3.0, "service": 5.0}, "id": 5038889}, {"rating": 4.0, "stay_parameters": "Stayed April 2006", "text": "Didn't try the Trapeze, but quite a few of the people I was hanging out with did and had a blast. Thank God for Sharkies at about 2:00 a.m. after dancing and drinking all night. Grab a burger or nachos and you are good to go. I higly suggest Club Med Turqoise. Alot of my friends have been there and they all told me that I would be fine if I went there alone and they were right. Great recommendation guys!", "title": "Nice and Very............... Relaxing!", "helpfulness": 5, "user": "BBDWI", "date": "May 3, 2006", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 3.0, "service": 4.0}, "id": 5029936}, {"rating": 4.0, "stay_parameters": "Stayed April 2006", "text": "We're just back from the Club Med Turquoise, or as they call it in French, Turkwazzzzzz. At first we were a little disappointed that all the staff we had gotten to know and love from our vacation last year were gone. But we got to know the new kids and found them to be fun and interesting as the kids they replaced. I found the food even better than last year in the cafeteria, though surprisingly poor in the reservations restaurant. Each night in the cafeteria has a dress and cuisine theme, and there were no disappointments. It helps to like fish and to be able to handle an international cuisine. You won't find a lot of meat. Again we got to know dozens of folks, mostly Canadian, so we got to eat every meal with people we knew and with a few new arrivals. The real problem in the cafeteria is NOT trying everything, especially after having loaded up on their chocolate bread.", "title": "Overall a good experience", "helpfulness": 9, "user": "michael1_44", "date": "May 1, 2006", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "service": 3.0}, "id": 5024757}, {"rating": 5.0, "title": "Wonderfull, Perfect, paradise", "text": "Our activities were interrupted by a weak storm that passed by on Saturday, leaving little rain, but producing waves that kept the dive boat and snorkel boat from going out for a few days. I dove on my last day with calm clear waters and intense sun, and it was the best dive i've had in the Bahamas. The Club Med scuba operation is the best and most professional I've found in the world.", "helpfulness": 8, "user": "A TripAdvisor user", "date": "April 30, 2006", "id": 5022118}, {"rating": 3.0, "title": "Hot, Bugs and Beautiful beaches!!", "text": "OK, Love this island. It is so beautiful with the fake looking ocean and pure white sand. The rooms are 3 star basic, and feel a bit dirty to me. Bed spreads curtains need to be cleaned! The activitys are incredible, lots to do . The staff , I found the men to be kind of rude, as the women were more accomedating. The chief is down right cold, we found out on the way home he and his man were at conch for lunch , maybe hence his odd cold behavior to the girls? We all felt it. Sorry. However I wish theyd spray we were loaded daily with bug spray! That was horrible. Food was great, and there is no service so dont ask. They are very low on customer service, lots of the gos were dying to go to cancuns newest, which opens in Nov? I was really disappointed because I asked for things I needed like , towels, a clean room, extermination, and many times it was passed over. Also David the chief had said if you have a complaint , so sorry , fill out a form when you leave. He needs an attitude change, he is the head GO so if his spirit could be brighter it would make it wonderful, the front desk is really bad, like really, it also has no fans, I think on purpose to make you drown in your sweat and just go , forget it! I dont need whatever it was I came for!!So the beaches AMAZING, sailing people awesome, food good, vollyball, and nite shows great, bartenders fun, need more bug spray, cleaner nicer bedspreads and curtains, and a serious change of attitude!", "helpfulness": 14, "user": "30000ft", "date": "August 2, 2006", "id": 5539441}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled with friends", "text": "It always starts at the top.", "title": "*** The Best Time Of Our Life ***", "helpfulness": 11, "user": "elikusurfing", "date": "July 25, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5509766, "likes": {"liked": "— Beautiful Resort, Amazing Beach, Great Team Of Go's, All Inclusive ...", "disliked": "— NA"}}, {"rating": 4.0, "title": "Club Med Turkoise", "text": "Well, where can I start ?", "helpfulness": 2, "user": "A TripAdvisor user", "date": "July 8, 2006", "id": 5439665}, {"rating": 4.0, "title": "Great resort- but NOT if your hungry for good food...", "text": "My friend and I stayed at ClubMed Turkoise between", "helpfulness": 11, "user": "A TripAdvisor user", "date": "July 3, 2006", "id": 5419555}, {"rating": 2.0, "stay_parameters": "Stayed June 2006", "text": "July 15-22 , 2006.", "title": "Stay Away!", "helpfulness": 17, "user": "red8sox", "date": "July 2, 2006", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "rooms": 1.0, "service": 1.0}, "id": 5418463}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled with friends", "text": "If you're looking for a simple place to go where the food is pretty good, the beaches beautiful and lots to do if you want to or you can just relax without being bothered, this is the place.", "title": "We loved it", "helpfulness": 4, "user": "jlawrie", "date": "May 1, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 129173743}, {"rating": 3.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "Yes the rooms are simple, but our beds were comfortable, the rooms very clean and the showers had lots of hot water and great pressure. 2 closets for your clothes & 2 safes in the room was a nice surprise.", "title": "In decline", "helpfulness": 2, "user": "eitanca", "date": "April 30, 2012", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 129128083}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "The diningroom is set up a little different - there are a few tables of 2 and 4, but most of the tables are set for 7. It is a great way to meet new people & this leaves a chair at the table for guests who are on there own and the G.O.s can sit with you. We met many people in the resort at meals.", "title": "Shoutout to the staff", "helpfulness": 1, "user": "jzmitreise", "date": "April 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 129056108}, {"rating": 3.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "We found the resort staff very friendly and a lot of fun.", "title": "The Good, the Bad, and the Ugly", "helpfulness": 16, "user": "BurlyBuddhist", "date": "April 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 2.0, "location": 5.0}, "id": 129006907}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with friends", "text": "The beach is the best I've ever seen and the water is as clear as a swimming pool.", "title": "One our best vacations yet!", "helpfulness": 3, "user": "Patti9518", "date": "April 28, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 128994202}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "Stayed at Club Med Turks & Caicos April 12-19. I would recommbed this place but not to those looking for high end luxury. My first impression was that it looked run down. But its mostly just the outside of the buildings. I stayed in 2 different rooms and they were both great. Clean and spacious! I recomend bulding A and C is TOO FAR! I stayed in a club room so had my fridge filled everyday with pop and water. There were also litlle gifts left for us a few days. The bathroom was nice and clean and water pressure awesome.", "title": "I WOULD RECOMMEND IT,,,,", "user": "SKF03", "date": "April 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 128992433}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "The lounge and pool area were nice. Food was good,,, lots of variety. Breakfast was yummy too but the same everyday.", "title": "Loved the snorkelling, tennis and sailing!", "user": "Ashley J", "date": "April 27, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 128936853}, {"rating": 3.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "The GO`s were awesome,,, very friendly and talented. The activities were great,,lots to do.", "title": "Jerks & Caicos", "helpfulness": 9, "user": "beachmofo", "date": "April 27, 2012", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 128806058}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled solo", "text": "Beach - A-MAZING!!!Nicest beach I have ever seen.", "title": "Already want to go back!", "helpfulness": 4, "user": "AtDaniel", "date": "April 26, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 128677678}, {"rating": 3.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "So to sum it up if you are checking out reviews to book club med,,", "title": "It's time for some renovations", "helpfulness": 3, "user": "Russell_9", "date": "April 26, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 2.0, "location": 5.0}, "id": 128646596}], "location": {"country": "Caribbean"}, "variance": {"poor": 143, "average": 310, "very good": 1039, "terrible": 116, "excellent": 1132}, "aka": "Club Med Turkoise, Turks & Caicos Hotel Providenciales", "slim_ranking": 0.707317073171, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.5, "location": 5.0}, "description": "Discover the incredible beauty of Turks and Caicos during your stay at Turkoise. A breathtaking resort designed with a panoramic view of the talcum-soft sand and clear turquoise waters of one of the most gorgeous beaches on the globe. Travel to Club Med Turkoise with your friends or alone to enjoy a carefree all-inclusive vacation in beachfront tropical scenery on the island of Providenciales, in the Caribbean Sea. Stay at this upscale all-inclusive adult resort and experience a vacation as carefree as exciting. Relax on a beach chair or indulge in the ultimate in water sports and fun activities. As one of the best all-inclusive resorts reserved exclusively for adults, this beautiful location is a destination that allows singles and couples to enjoy their getaway like they never have before."}