{"user_rating": 4.0, "review_count": 350, "name": "Club Quarters", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled on business", "text": "I stayed at this hotel for two weeks on a business trip. If you want a clean room, modern bathroom, a reasonably priced restaurant, a lounge offering espresso, cappuccino and snacks - this is the place. Staff are super friendly and helpful -- ask for Rany for seamless service! The rooms are a little small but are user-friendly. Location is very central (2 blocks away from White House) and a Farragut West metro station is right next door.", "title": "Great location, friendly staff, clean room!", "helpfulness": 1, "user": "FK2013", "date": "February 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 152055858}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled with friends", "text": "From the time I checked in to the time I checked out, the staff at Club Quarters Washington DC was very pleasant.", "title": "Pleasantly suprised though there was a little mishap", "helpfulness": 1, "user": "iamebbyK", "date": "February 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 151627614}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "What I liked", "title": "Really good place for a short DC trip.", "user": "MEJOK", "date": "February 7, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 151596843}, {"rating": 4.0, "stay_parameters": "Stayed December 2012", "text": "-seamless check in and check out", "title": "My closet at home is bigger", "user": "Footloser", "date": "January 31, 2013", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 1.0, "service": 3.0, "rooms": 1.0}, "id": 151121575}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled on business", "text": "- the happy hour in the restaurant. The food - not so great", "title": "Convenient. Modern. Small-ish rooms.", "user": "egatrop", "date": "January 29, 2013", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 150939085}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "When we arrived around 10am, our room was ready and check in was a breeze. Ronny (is handsome) checked us in and was very friendly and helpful, thank you! You have to use your card to get into the hotel after hours and to use the elevator. That's a plus to keep randoms out.", "title": "Great Stay, Friendly Staff, Convenient Location, Will Stay Again", "helpfulness": 2, "user": "HeadBeachInCharge7", "date": "January 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 150625312}, {"rating": 4.0, "stay_parameters": "Stayed January 2013", "text": "The location is very ideal, a few blocks from the White House, lounges and stores across the street or around the corner. The Farragut West metro station is 5 steps out the door to your right. Very convenient.", "title": "Very good location and decent value for DC", "user": "DrLSB", "date": "January 21, 2013", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 150211713}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "The hallways are very slim. I felt like I was on a cruise ship. They provide free filtered water with plastic bottles in the hallways. Our room was small but it was made for one person. I think it's called a Standard Single Room, again, it was reminiscent of a cruise ship. Because of our room location, the view was another building like a alley view from a NYC apartment. No big deal. The room was clean, bathroom clean, room service from their restaurant till 11pm and the food is very good and not too pricey. I would stay again. Oh yea, and I was here for Inauguration weekend but at this hotel it felt like a regular easy going day.", "title": "Really good value for the price in DC", "helpfulness": 2, "user": "blackjack1234567", "date": "January 16, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 2.0, "rooms": 5.0, "location": 5.0}, "id": 149831613}, {"rating": 3.0, "stay_parameters": "Stayed January 2013, traveled on business", "text": "This hotel is located in a very good spot, near the White House and some key conference locations. The premium museums are a bit of a walk away but if the weather is good then they are worth the stroll. The staff were 'business like' and thus not especially friendly. Would recommend the hotel for business travellers wanting comfortable rooms, a good location but on a limited budget", "title": "Great location, clean room, inadequate gym", "helpfulness": 1, "user": "gregcmorley", "date": "January 12, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 149474454}, {"rating": 4.0, "title": "Clean rooms, friendly staff and close to the attractions", "text": "This is not the Hilton BUT its been renovated, and is clean. You can confidently book this hotel, the rooms are nice, with new bathrooms, and modern wood paneled interiors, flat screen tv's. Also includes access to the club room with a real nice Cappuccino machine for free and snacks, and filtered bottled water refill machine. The best part is this hotel is right in the heart of DC, you can walk to everything, the White House is 5 minutes away, literally. The hotel sits right next to a DC metro station (subway) where you can get anywhere. There are also a ton of great restaurants right nearby. Everything in DC is expensive, I mean there is no point in carrying $1's or $5's or even $10's, it seemed like everything was at least $20 or more, lol. Ok maybe I am exaggerating, but it is expensive. HOWEVER all that is made up for with all the free tours. All of the Smithsonian museums including air and space are free, tours of the Capital engraving etc, ALL free! Always check to see if you need to make a reservation though, many attractions require a few weeks to a few months notice, you can't juist show up to the White House and get a tour..", "user": "Rodrik1970", "date": "January 10, 2013", "id": 149318889}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "This is the 4th Club Quarters location we have used having previously stayed in London, Chicago and Boston. We like the smaller size and no fuss nature of these \"hotels\". This particular location is excellent with access from the airport via the Metro literally yards from the front entrance. We booked the Superior room and ended up on the 2nd floor where the Club Room is located with coffee machine, computers etc. There is currently construction work that according to the letter in our room is scheduled to last for a couple of months. This meant workers were walking in front of our windows during the day, but this did not impact us as we were out exploring DC. The room was a little cold and increasing the temp of the a/c seemed to have the opposite effect with cold air blasting out.", "title": "Club Quarters deliver again", "helpfulness": 1, "user": "NatsDad", "date": "March 16, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 154785660}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled on business", "text": "As with previous locations, the rooms were clean and housekeeping was efficient. Overall Club Quarters contributed to a very enjoyable first trip to Washington DC.", "title": "great centrally located hotel for business", "helpfulness": 1, "user": "Int_Bus_Travel", "date": "March 15, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 154681141}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "You can't beat the central location on too of Farragut west metro. This is a great hotel for business with free Internet access and a good club room with computer, printer and seats and table. That's good if you need a bit of space to work or meet with colleagues or clients. Rooms are functional but not overly large. My room had a bit of white noise from the traffic but it wasn't too much of a nuisance.", "title": "My Go-To Place in DC", "helpfulness": 1, "user": "KathyKitty", "date": "March 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 154531773}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled on business", "text": "My brother lives in DC and I'd still pay (and have) to stay here. We do the Cherry Blossom Race every April and stay here because it's way more comfortable, affordable, and perfectly located for the start line and all the area essentials (national landmarks, free museums, good restos, Metro, post-race pub). I haven't even reviewed it for 5 years because I don't want anyone to find out about it! I love having a glass of wine in the hotel bar, the room is comfy and quiet, and love the business center for checking itineraries and email/printing out tickets. The staff is always helpful and will hold your luggage until it's time to go--great if you had an early morning race and need to fuel up after checkout before hitting the train or airport.", "title": "Not a club but good lodging choice", "user": "yrlesru", "date": "March 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 154442095}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "This was my first stay at a Club Quarters. Being right next to the Farragut West metro stop, as was the central downtown location made for very convenient for getting around DC.", "title": "All you need", "helpfulness": 2, "user": "Joshua G", "date": "March 4, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 153734347}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled on business", "text": "For a short stay, the hotel is an excellent one. My experience was excellent and the value for money is very good. The staff is very friendly and creative. Cleanliness of some kitchen items needs improvement.", "title": "Club Quarters DC review", "helpfulness": 1, "user": "Elie A", "date": "March 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 5.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 153569404}, {"rating": 2.0, "stay_parameters": "Stayed February 2013", "text": "I get it that business travel does not need to be frivolous. And everyone appreciates a reasonable room price. But this place goes too far. I have stayed there twice now. I thought maybe the first time I got a lousy room as it was so small I thought my feet might hang out the window at the bottom of the bed and the bathroom barely had room for me to fit into it. But I stayed there again, got a different room and same thing...ultra small. Other than that it was clean. Room service was good. I just prefer not to feel claustrophobic! And defined don't stay here if you plan more than one to the room. That would be awful.", "title": "Why would anyone want to stay in a shoebox?", "user": "Travels101", "date": "March 2, 2013", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 4.0, "service": 3.0, "rooms": 2.0}, "id": 153562598}, {"rating": 3.0, "stay_parameters": "Stayed February 2013, traveled on business", "text": "I stayed here for on a Saturday and Sunday night and had difficulty sleeping because of the noise of fire engines and police cars. Moreover, the heating system was also incredibly noisy when it turned itself on and off - so I ended up choosing to keep my room very chilly. Not a good way to start a meeting on Monday morning! On the plus side is the convenient location and the proximity to most of the major tourist sights of DC as well as to decent restaurants. I liked the excellent WIFI and the Club lounge on the 2nd floor with good coffee and snacks. But the need to sleep outweighs all of the advantages for me so I would not stay here again.", "title": "Good Value but Noisy", "user": "DalkeyIsland30", "date": "February 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 5.0, "sleep": 1.0, "rooms": 3.0, "location": 5.0}, "id": 153383321}, {"rating": 3.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "I went to Washington DC Valentine’s Day weekend. It was a last moment decision.", "title": "You Get What You Pay For", "user": "Trom0934", "date": "February 19, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 1.0, "rooms": 3.0, "location": 3.0}, "id": 152556409}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "There really were not many rooms left to choose from in the city. End up at Club Quarter I paid for one of the bigger most expensive room at the Club Quarters and when I arrived they stuck me in a shoe box sized room. I went back down to the front desk and they finally gave me the room size that I paid for. The restaurant is a 3 on a scale of 1-10. The 2 rooms that I saw were both clean and updated. It located on a VERY noisy street. I have stayed in the same general area many times the fire department and/or ambulances must be next to the hotel because I was woken up a minimum of 15 times by them.", "title": "Perfect location for exploring DC", "user": "Michelle K", "date": "February 17, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 152330758}], "location": {"country": "United States", "city": "Washington DC"}, "stars": 3.5, "variance": {"poor": 23, "average": 54, "very good": 156, "terrible": 21, "excellent": 96}, "aka": "Club Quarters Hotel Washington Dc", "slim_ranking": 0.53488372093, "description": "Private, full service club-like hotel with 161 rooms. The hotel overlooks Farragut square and is just two blocks from the White House and Lafayette Square. Club Quarters is the best value hotel based on quality and the prime location.Club Quarters provide:• Safe, restricted entry• Instant registration and check out• Free high speed internet access throughout the hotel• Onsite restaurant • Multi-menu in room dining options (through onsite restaurant and many local restaurants)• Refrigerator and microwave available• Unlimited complimentary chilled purified bottled water • 1 meeting and event rooms available (maximum reception style 38 people)• Free use of computer/printer • Ergonomic workstations• State of the art guest rooms with premium bedding• Contemporary furnishings• Flat panel HD TVs• Complimentary coffee and tea• 24 hour guest service desk • Fitness room • Exercise equipment delivered to guest room upon request • Corporate Apartments available • Value rates• Government per diem rates 365 day a year with valid ID."}