{"user_rating": 4.0, "review_count": 4842, "name": "ClubHotel Riu Ocho Rios", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed April 2008, traveled with family", "text": "I did a lot of research before deciding to take my husband and two 19 year old girls to this resort. This Riu is a Club Hotel and full of action. If you want swimming, snorkeling at the beach, watersports, tennis, pool, entertainment, dancing, shopping, volleyball, parties, music, games, noise ...... this is the place. There are people of all ages and always a couple of weddings going on. The weather was beautiful every day with a gentle breeze.", "title": "Awesome Place", "helpfulness": 5, "user": "PieOntario", "date": "May 9, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 15856048, "likes": {"liked": "— beautiful beach, snorkeling off the beach", "disliked": "— noise 24/7"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "The grounds and rooms are very clean. We had awesome ocean view rooms which was well worth the extra money. The water is aquamarine and the beach is clean, although your opportunity to walk is restricted to the hotel property. Expect to be approached to buy Ganja, The sellers are very polite if you decline. There is a small market at one end of the beach.", "title": "Quite enjoyable", "helpfulness": 6, "user": "handy101055", "date": "May 9, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 3.0}, "id": 15855987, "likes": {"liked": "— Quality of beach and proximity to mountains", "disliked": "— Ala Carte selection and food preparation"}}, {"rating": 5.0, "title": "we loved the riu", "text": "The St. Ann's dining room has a marvelous breakfast and dinner buffet. We also enjoyed the Asian a la carte. The jerk hut on the beach is delicious.", "helpfulness": 3, "user": "BUCKETSOFHOPE", "date": "May 9, 2008", "id": 15846778}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "If you are looking for tranquility and relaxation, i would not recommend this resort. Also, be prepared for a 2 hour bus ride from the Montego Bay airport. If you want to see the Dunn's River Falls, i would not recommend the tour from the hotel. We spent $350 US for one of the Cool Runnings canamerans (including water shoe rental and tips). The boat was over crowded with almost no shade. The trip included snorkeling on a degraded reef outside Ocho Rios with very few fish. After spending over an hour hiking up the Dunn's River Falls, there was a \"party\" with rum drinks, 70's music (Village People anyone?) and no food. The staff screamed through the microphones. We arrived back at the hotel starving and deaf. If you want to see the Falls, take a taxi to town for $10.", "title": "loved jamacia", "helpfulness": 8, "user": "gant21", "date": "May 8, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 15816185, "likes": {"liked": "— The beach", "disliked": "— nothing i didnt really like that i would make a point about"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "The Jamaican people are upbeat and friendly. Bring a supply of US dollar bills for tipping bus drivers, baggage handlers and tour guides. Although apparently included, we also tipped the maids, bartenders and waiters who were exceptional.", "title": "Another good riu Hotel", "helpfulness": 2, "user": "Coley83", "date": "May 8, 2008", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "location": 5.0}, "id": 15807085}, {"rating": 4.0, "title": "Excellent Vacation Destination", "text": "WOW! I just realized how long this review is.....Sorry, but I hope it gives you lots of info.", "user": "augusierra", "date": "May 7, 2008", "id": 15764640}, {"rating": 4.0, "title": "RIU Ocho Rios was pretty good", "text": "We were 16 hours delayed arriving at 3:30AM, and I just wanted to get into bed. RIU had staff waiting for us with our keys, brochures, etc, and was less that 5 minutes getting into our room. Very well organized.", "user": "hwtj", "date": "May 7, 2008", "id": 15744982}, {"rating": 4.0, "title": "Yea mon!", "text": "The hotel itself is extremely beautiful, and the staff is constantly cleaning and polishing. They take a lot of pride in the hotel that is for sure. We met our housekeeper on the first day, introduced ourselves, tipped her for the week and explained what our needs would be, which are actually quite simple. I only wanted fresh face clothes everyday. The towels I would reuse a couple of times. That seemed to do the trick, and hopefully made her job a little easier, and give her extra time with the patrons who require much more attention.", "user": "l0ve2party", "date": "May 6, 2008", "id": 15719364}, {"rating": 2.0, "title": "Don't stay here if you can help it", "text": "The food was excellent. The jerk hut was my favorite. Salads become a little boring by the end of the week, but there was always a great selection for any tastes. I find it hard to believe people could not find a decent meal. We tried 1 a la carte (Sir John), which was good. It was much more private which is a nice change from the hustle of the buffets. We did upgrade to a Jr. Suite, but unless you get a really good deal like we did ($60 for the week), it's really not worth it. The walk to the main restaurant is long, and for that matter, there was only the Japanese restaurant and Mamee Bay which you need reservations for anyway. The roms was beautiful, but so were the standard rooms and they were much closer to everything. I did however like the privacy on the suite side. No noise from the pool or restaurants is really appreciated at night when you are trying to sleep. I think maybe the bars keep a supply of watered down booze because my drinks were so stong I could barely drink them.", "user": "Travelchicquita", "date": "May 6, 2008", "id": 15718356}, {"rating": 5.0, "title": "Rained first 4 days", "text": "The pools were beautiful. And what pool doesn't have crub on them at the end of the day? There aer hundreds of people in and out all day, of course they get dirty. But unless you have on a snorkel and mask like a previous post, you will not notice it, and you certainly can't feel it under your toes.", "user": "robo395", "date": "May 5, 2008", "id": 15690578}, {"rating": 4.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "Just returned from Riu Ocho Rios April 20 so this is a late review. We had a great time on our trip, loved Jamaica, its people, and the resort as well.", "title": "Good Time Had At Riu", "helpfulness": 5, "user": "Culture-Shocked", "date": "May 13, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 15998043, "likes": {"liked": "— good food, friendly staff, clean", "disliked": "— smaller than used to, It's Jamaica Mon- no problem"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "We were told by a tour guide that the Riu Ocho Rios, to date, is the largest resort in Jamaica (but soon to be second largest when a new resort being now built is completed). This being said we still found the resort quite small as to what we have been used to in other areas. But even though we found it small we still found lots to do and plenty of room by the pools and on the beach as well.", "title": "Great Experience; Reading These Boards is a Must!", "helpfulness": 11, "user": "kc-bug", "date": "May 12, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 15975708, "likes": {"liked": "— cleanliness, safety, and high level of service", "disliked": "— bed was hard"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "The beach is very clean and the water crystal clear, though you are limited to walking just within the resorts property...there is a wharf on the right side and nothing to speak of on the left side, but still very open with lots of chairs.", "title": "jean from nova scotia", "helpfulness": 3, "user": "jean62", "date": "May 12, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 15973709, "likes": {"liked": "— the staff and the rui resort"}}, {"rating": 3.0, "stay_parameters": "Stayed May 2008, traveled on business", "text": "The pools are very clean also with the one on the left side being alittle quieter then the other. We never had a bad time getting a chair there either. We spent morning and early afternoon on the beach and later afternoon we headed to the pool areas.", "title": "Chain Hotel - Nice But Too Large", "helpfulness": 3, "user": "mcbarber930", "date": "May 11, 2008", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "location": 2.0, "rooms": 4.0}, "id": 15938873, "likes": {"liked": "— Jr. Suite, Beach", "disliked": "— Entertainment (Lacks Jamaican Sound/Flavor)"}}, {"rating": 3.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "The resort, grounds, lobby, rooms, bathrooms, etc ...were all very clean as well. We found the restaurants and buffet good, we enjoyed all the food, and the service was good too. We loved the morning omelettes. We enjoyed the drinks as well, loved the Miami Vices- my afternoon choice for drink, also enjoyed the fresh coconut milk and rum right off the tree. The Jerk Hut on the beach was the best, awesome chicken and sausages, there also is a beach BBQ everyday. The pizza at the Italian restaurant at night was good too. We tipped our maid, bellboy, waiters, and the boys at the bars, they all work hard.", "title": "decent hotel and vacation", "helpfulness": 4, "user": "ssundiva", "date": "May 11, 2008", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "rooms": 2.0, "location": 4.0}, "id": 15911326, "likes": {"liked": "— beach..pool", "disliked": "— distance from airport...musty smelling rooms."}}, {"rating": 4.0, "title": "You'll Love the breeze.", "text": "I just came back from the RIU Ocho Rios (April 26 - May 3) and wanted to tell you that the property did not disappoint. As the title of the review suggests, the incoming breeze coming from the ocean was amazing. It was refreshing and relaxing and made the Jamaican heat bearable.", "user": "artmarcelino", "date": "May 4, 2008", "id": 15642645}, {"rating": 4.0, "title": "Americans TOO LOUD MON!!", "text": "As for the hotel, I loved the open concept layout of the front lobby. It faces the ocean and the beach is about 20 yards away. A beautiful setup. Once we got to our room on the fourth floor, our view was spectacular, we were able to see most of the complex and the beach from where we were at. Note: if you get booked in an oceanview room ask to stay in Building \"C\" because it's much closer to the pool, gym, buffet restaurant etc. The other Building \"A\" you'd have to walk a little more to get to those places. We really didn't expect anything less than what we got from our room. It was clean, the drink fridge was fully stocked always and the liquor dispensers were always full. The only snafu we experienced was that our toilet tank lever broke off but the RIU maintenence staff responded within half an hour and the problem was fixed by the time we got back to the room after dinner. Their followup calls to see if we were doing okay were a nice touch. Overall, I feel the staff at the RIU were great. Everyone was helpful, accommodating and friendly.", "user": "AngieMFAK", "date": "May 4, 2008", "id": 15642596}, {"rating": 1.0, "title": "Robbed and stressed!!!!!!", "text": "I can't even begin to tell you all how nice the pool at the RIU was. I've read some glowing reviews about the pool in this website and all of the descriptions of its beauty were true. I'm a beach guy but that pool is awesome. When you're at the pool, try ordering a \"Purple Rain\" it's a tasty purple cocktail laced with rum and you'll love it. As for the beach, it was beautiful and I was definitely happy tanning there almost every day. A can't miss is the Jerk Hut on the beach. The chef there cooks a mean BBQ chicken, beef, ribs or sausage jerk and it was the best I've ever had.", "user": "blingblingSudbury", "date": "May 4, 2008", "id": 15642112}, {"rating": 5.0, "title": "Amazing!!!!!!", "text": "One of the great policies the RIU has implemented was that vendors are forbidden to hawk their products to you on the beach. So it was nice to just enjoy the beach without a countless stream of peddlers interrupting you. Some Caribbean resorts I've been to have no such policy for their guests and vendors on the beach sometimes get pretty annoying. Just a little advice, Jamaican vendors outside the resort can get a little agressive. So if you plan to do any shopping in Ocho Rios and don't want to get hassled every 15 seconds a nice but firm \"NO Mon, I'm good\" will suffice. But by all means haggle with them if you see something you're interested in, don't take the first offer. The only time we ventured off the resort was to go on a shopping/ botanical garden/ Dunn's River excursion. The whole tour took 6 hours and cost $45US. The highlight was Dunn's River Falls and yes you will get soaked on this tour. Just ensure you buy aqua shoes beforehand because trekking up the rocks can get pretty slippery and you probably don't want to rent the water shoes $5US for obvious hygienic reasons.", "user": "lovegoingsouth", "date": "May 4, 2008", "id": 15639275}, {"rating": 4.0, "title": "Great time...Few things to expect.", "text": "If you plan on buying liquor on your trip, wait until the airport. We bought rum on one of our shopping stops and found that it was 40-50% cheaper at the Duty Free shop at the Montego Bay airport. So if these vendors tell you how cheap their booze is remember that it's always cheaper at the airport.", "user": "Ritz9876", "date": "May 4, 2008", "id": 15630804}], "location": {"country": "Caribbean"}, "stars": 3.5, "variance": {"poor": 407, "average": 717, "very good": 1682, "terrible": 238, "excellent": 1798}, "aka": "Riu Ocho Rios", "slim_ranking": 0.230769230769, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.5, "rooms": 4.0, "location": 4.0}, "description": "Situated in northern Jamaica, on the beachfront. Two 6-storey buildings and one 5-storey building. Surrounded by 90,000 m2 / 107,000 sq. yards of lush gardens. Complimentary sun loungers on the beach. 10 km / 6.2 miles to Ocho Rios. 4 km / 2.5 miles from various shops. 105 km / 65 miles to Montego Bay airport. 600 m / 1,970 ft. from a bus stop. Credit cards accepted: MasterCard, Amex, Visa, Diners"}