{"user_rating": 4.0, "review_count": 480, "name": "Club Quarters, opposite Rockefeller Center", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "It was very difficult for me to figure out where to stay in NYC, not having a good sense of what was close to the center of things etc. I stumbled on Club Quarters and after hours of reading reviews on trip advisor, I decided to give it a try. Traffic was horrendous, because in my divine wisdom, I decided to select the avoid tolls option on my GPS! BAD MOVE! Uggghhh... so after fighting with traffic, we finally arrived. We were lucky to find parking right in front of the hotel. We waited a while because there was a huge rush but the concierge, was very patient and kept checking in on us and updating us on how things were going. She noticed that we had a small baby with us, and said that all she had was a smoking room but would look to find another option in consideration of our son! How sweet! We ended up in a smaller room than what I booked online, but the manager offered us a comp'd night within a year and Iris (I think her name was) offered us free breakfast! Talk about good customer service! The room was comfortable, a little tiny but seriously it wasn't an issue. It was furnished nicely, everything was neat and clean and the bathroom was without issue as well! I was very comfortable. We had breakfast the following morning on their outdoor patio and looked over at Rockerfeller center. The location is great! Walking distance to everything--attractions, eating shopping etc. I can't wait to go back!", "title": "Great find in the city!", "user": "BushTea", "date": "November 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 144635629}, {"rating": 2.0, "stay_parameters": "Stayed October 2012, traveled on business", "text": "I stayed at Club Quarters in October for business reason. Hotel is ok, nothing fancy. Rooms are relatively big, although quite pricey..", "title": "Average hotel, but big price!", "helpfulness": 1, "user": "venvit", "date": "October 24, 2012", "detail_rating": {"cleanliness": 3.0, "sleep": 3.0, "location": 4.0, "value": 2.0, "rooms": 2.0}, "id": 143638884}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled on business", "text": "Wi-fi is free, while breakfast price ranges between $11 and $20", "title": "Close to the Rock, functional and clean hotel", "user": "tooraktoff", "date": "October 21, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 143397219}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled on business", "text": "Hotel entrance is quite poor looking. No safe room in the room not even mini bar.", "title": "Excellent location and good value for money", "user": "WorldTraveller08901", "date": "October 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 142890908}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "Good for business, I would not recommend this for a family trip", "title": "Location location location & comfortable too!", "user": "Essie3", "date": "October 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 142861008}, {"rating": 3.0, "stay_parameters": "Stayed October 2012", "text": "Club Quarters - Rockefeller Center corners the market on minimalist accommodations. You get a comfortable, clean bed in a convenient location. Other amenities such as a working remote control for the TV and light switches that do not have to be jiggled to work are extra.", "title": "Serviceable", "user": "DrAndyman", "date": "October 10, 2012", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 4.0, "service": 3.0, "rooms": 3.0}, "id": 142458753}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled solo", "text": "This is the second time I've stayed in this hotel and I would definitely recommend it.", "title": "Great Midtown Value.", "user": "billaholic", "date": "October 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 142425164}, {"rating": 4.0, "stay_parameters": "Stayed October 2012", "text": "Pros: The location is very central and close to everything. Clean. Upscale look. Reasonable price for that area. Free wifi. Computer centre (includes printer to print event tickets and boarding passes, etc). Lovely lounge with terrace! Attentive, friendly staff - always greeting you with a smile, give great tips on venues/events, promptly respond to requests. Free bottled water. Smooth and accurate check in and out.", "title": "Clean rooms in a great location", "user": "Myrolexs", "date": "October 8, 2012", "detail_rating": {"cleanliness": 4.0, "location": 5.0}, "id": 142313112}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "Cons: Very tiny rooms!! Skimpy on pillows and extra towels in room but readily bring you more if you ask. Tiny lobby - can get crowded. No locked storage for luggage if room isn't ready or if you want to sight-see on your last day and don't wish to haul your bags around. Having said that, the maitrese d' was more than will to babysit my suitcase beside her for a few hours on my previous visit!", "title": "I would go back", "user": "598Storm598", "date": "October 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 142262636}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "As a single, travelling and meeting up with friends, or as a business traveller, I would have no hesitation recommending this hotel. A couple would also do well, but would probably enjoy one of the larger rooms better. Families would find the standard and larger rooms a bit cramped and crowded.", "title": "Excellent location", "user": "sharonGalway", "date": "October 7, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 142193723}, {"rating": 3.0, "stay_parameters": "Stayed November 2012", "text": "The location is superb: close to the 5th and the Rockefeller Center, you are in the heart of the Christmas shopping. Good hotel for business, rooms are small, service essential but efficient and complimentary water on tap is always available. Qindow isolation from external noise in not always perfect. Avoid rooms close to the fan motors", "title": "The right place to be during Christmas", "helpfulness": 1, "user": "pepe_moeder", "date": "November 28, 2012", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 5.0, "service": 3.0, "rooms": 3.0}, "id": 146361451}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "This was our first hotel during our USA trip and it did not disappoint. The hotel room was spacious, had a nice view of the street and surroundings (19th floor). We ate breakfast once at the hotel which was quite nice but a bit pricey when you can visit the small deli (Teresa´s brick oven pizza) beside the hotel. Great breakfast for a good price.", "title": "Prime location and nice view", "user": "flekkur", "date": "November 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 146245789}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled solo", "text": "Every prime location is within walking distance, such as Times Square, Broadway, Rockefeller Center and more.", "title": "Loved it!!!", "user": "beachblondegirl", "date": "November 13, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 145353773}, {"rating": 2.0, "stay_parameters": "Stayed May 2012, traveled solo", "text": "We were even so lucky as to experience a festival during our stay. They even offer fast checkout so you do not have to wait for service if you are in a hurry.", "title": "ceiling had no fire sprinklers, not disability friendly", "user": "cookieskid", "date": "November 12, 2012", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 2.0, "sleep": 1.0, "rooms": 2.0, "location": 5.0}, "id": 145284831}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled on business", "text": "Overall I would surely recommend this hotel for anyone staying in New York.", "title": "Great location, Phenomenal roof bar view, Great deal", "helpfulness": 2, "user": "MA F", "date": "November 5, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 144643140}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "This hotel has a great location. It's one block to Rock center, 6 blocks to time square and 6 blocks from central park. It's also very close to the Gershwin theatre, so if you're seeing Wicked, this is a great spot to stay. Parking is a bit confusing, as the garage is on 54th st, not the corner as they say. Check in was efficient, but we never really got more than hello and goodbye from the front desk. Rooms are small, but not cramped. Very clean. There are no views of rock center or tree, but no biggie. Very nice overall.", "title": "Great location, no complaints", "user": "kinoxl", "date": "January 7, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 149088974}, {"rating": 3.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "The location to Times Square and Rockefeller Center are excellent, you are within walking distance of Times Square and right down the street from 5th Ave and the best shopping in NYC. Bergdorff, Louis Vuitton, Tiffany and Co, everything you need is just down the street. Its adjacent to Duane Reed as well so if you need anything from the convenient store pharmacy you got that right there too. Rockefeller Plaza is literally right across the street!", "title": "Prime location - Decent room", "user": "ShironD", "date": "January 2, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 148653322}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "The room itself was small, but all NYC rooms are small. it was decent, nothing to rave about, it served its purpose. I would stay again.", "title": "nice service, clean rooms", "user": "emillene", "date": "January 1, 2013", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 148534608}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled on business", "text": "If you want some place near times square, its a good option... the room is small but ok, there is no big rooms in NY, there is good places to hace breakfast nearby.... During the news yeart week i found it too crowded....", "title": "Quick, Clean Comfort at Rock Center", "user": "Augusthelmsman", "date": "December 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 146815266}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled on business", "text": "I only stayed here for one night, as my trip extended and the hotel I had been in couldn't let me stay another night, but... I got lucky, it was a good choice!", "title": "Perfectly Located and Pleasantly Surprised", "user": "ReneeValdes", "date": "November 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 146482384}], "location": {"country": "United States", "city": "New York City"}, "stars": 3.5, "variance": {"poor": 17, "average": 63, "very good": 202, "terrible": 13, "excellent": 185}, "aka": "Club Quarters, Opposite Rockefeller Hotel New York City", "slim_ranking": 0.358916478555, "description": "Private, full service club-like hotel with 175 rooms located opposite Rockefeller Center, steps away from the famous skating rink, Christmas tree, St. Patrick’s Cathedral, Saks Fifth Avenue, Museum of Modern Art and Radio City Music Hall. Minutes from world class shopping, restaurants and entertainment. The other impressive feature of this Club Quarters is The Terrace Club the luxury executive club on the 7th floor, featuring year-round outdoor dining on the terrace that your hotel guests will be able to use when they stay overnight. Club Quarters is the best value hotel based on quality and the prime location.Club Quarters provide:• Safe, restricted entry• Instant registration and check out• Free high speed internet access throughout the hotel• Onsite restaurant • Multi-menu in room dining options (through onsite restaurant and many local restaurants)• Refrigerator and microwave available• Unlimited complimentary chilled purified bottled water • 3 meeting and event rooms available (maximum reception style 55 people)• Free use of computer/printer • Ergonomic workstations• State of the art guest rooms with premium bedding• Contemporary furnishings• Flat panel HD TVs• Complimentary coffee and tea• 24 hour guest service desk • Fitness room • Exercise equipment delivered to guest room upon request • Corporate Apartments available • Value rates• Government per diem rates 365 day a year with valid ID."}