{"user_rating": 4.0, "review_count": 486, "name": "Club-Hotel Nashville Inn & Suites", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled on business", "text": "Clean, Quiet and Safe. Rooms were nice size, Bed was comfortable. The Happy Hour is a nice touch and the breakfast outstanding. To be real nit picky I could say the shower head had one setting and the water pressure could have been better but will I stay there again? Definitely", "title": "All The Essentials", "user": "rpgovols", "date": "December 13, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 147406163}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "the staff was friendly. the room was very clean and had very nice toilet articles.the bed was very roomy with a firm mattress.had\"happy hour\" with variety veggies tray,cheese/meat tray,variety of fresh fruit tray,crackers,chex mix. plus mixed drinks,coffee or tea. this was very nice!!breakfast..hot/cold cereal variety,juices,tra,coffee,hot cocoa,cinnamon rolls,variety of muffins,waffles,scrambled eggs,biscuits,gravy,sausage links/patties,fresh apples and bananas.very nice variety. would stay there again.", "title": "club hotel nashville inn and suites", "helpfulness": 1, "user": "cclc_12", "date": "December 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 146966729}, {"rating": 2.0, "stay_parameters": "Stayed November 2012, traveled with family", "text": "The rooms at the \"Club Hotel Nashville\" have been renovated and in that I was impressed! We had a oversized guest room with 2 comfortable queen beds, comfy feather blend pillows and a large flat screen HDTV, adequate bathroom with impressive all natural toiletries. Also included in the $60 rate we paid was an OK breakfast buffet (6-9am) with a small selection of bread/muffins, link & patty sausages, scrambled eggs (albeit but powdered) biscuits w/ gravy along with your typical and expected cereal and juices (orange and apple from concentrate of course) There was also the waffle maker with batter dispenser (they are pretty good and every hotel has them now it seems). Weekdays the hotel offers a managers reception nightly with hors de oeuvres and drinks, but we arrived too late for that. There is an outdoor pool and a nice large indoor jacuzzi, along with a fitness room (cardio/weights) Facility wise the place is nice enough to justify its 3 star rating, however the staff at this hotel are amoung most unfriendly I've ever come across!", "title": "Unfriendly and Unwelcoming ....", "helpfulness": 1, "user": "hendrixallen", "date": "December 6, 2012", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 146906675}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled with friends", "text": "Check in was short and curt and checkout was just the same. I got a very bad vibe from the staff of this hotel and decided against staying a 2nd night as I had planned. Southern Hospitality?? Dont expect to find that here, these people had a hard time even smiling. I won't return.....", "title": "Great place to stay for shopping or a football game", "user": "tnfurrybear", "date": "December 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 146718801}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "Very convenient location to Opry Mills mall and also to board the Music City Queen if you want to ride the boat to a football game downtown. Room was nice and clean. Slept on pull out sofa bed and it was comfortable. Breakfast buffet was really good - biscuits, eggs, sausage instead of just pastries.", "title": "Unbelievable!", "user": "Traveler0264", "date": "November 29, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 146432678}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "We have stayed at the Club Hotel a number of times and have always been pleased with both the facility and staff. Rooms and bath are always clean and the complimentary buffet breakfast is superb. The front desk personnel as well as the people manning the dining area are always very friendly. We especially enjoy the complimentary evening cocktails and snacks served from 5 pm to 7 pm. The only downside to this hotel is the requirement that you must cancel 48 hours before the arrival date when making advance reservations. Since we always prefer making advance reservations when traveling we will not reserve a room at the Club Hotel when there is a chance our travel plans may change during the 48 hour period. Instead, we will reserve at a hotel where we can cancel before 6 pm on the day of arrival.", "title": "Great Hotel Except For Cancelation Policy", "helpfulness": 1, "user": "tripjbm", "date": "November 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 146400391}, {"rating": 3.0, "stay_parameters": "Stayed November 2012", "text": "The hotel is nice. Kind of out of the way if you are interested in doing things in downtown Nashville, but very close to Opry Mills area. The room was large and clean. The full breakfast was hot and huge...very impressed! If you wish to use the Internet, be prepared for a VERY poor wifi connection. I couldn't keep a connection with my portable device in my room. :-( Which meant I could not FaceTime my children for three days. Very disappointed about that.", "title": "Nice room - Terrible Wifi!", "user": "bmandrellfan", "date": "November 24, 2012", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 3.0, "service": 3.0, "rooms": 4.0}, "id": 146110519}, {"rating": 5.0, "stay_parameters": "Stayed November 2012", "text": "This hotel is just a few minutes from Opryland and easy access to freeway. We enjoyed the awesome breakfast and weekday cocktail time. My back was hurting and the bartender was able to cure me if only for a few hours. The rooms were excellent and they were able to let us check in early so we could head out and explore! I have already spread the word. Thank you so much for making our trip to TN so great!!", "title": "Amazing value! Great Staff!", "user": "JerCoursey", "date": "November 24, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 146095713}, {"rating": 3.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "Hotel was decent but not as great as website and reviews had led us to believe. The whole thing felt a little out-dated. Be sure to request a room that doesn't face the highway! We reserved a King Patio room that was supposed to have a deck overlooking the inner patio and pool area. Instead they upgraded us to a suite, which was nice with two big rooms except that it faced a big highway, so we had to listen to traffic all night. Hotel front desk staff were not helpful with directions and suggestions about what to do in the area. Hot breakfast is included which was extensive and very satisfactory. Easy to hop on the highway and it takes about 10-15 minutes to get to downtown Nashville.", "title": "Decent hotel for the price", "user": "AEWilson", "date": "November 18, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 3.0}, "id": 145688991}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled with family", "text": "Very pleased with the hotel. The room was clean and spacious. The little ammenities (body wash, shampoo, etc) were all very nice. The breakfast buffet was great. There was gravy, biscuits, eggs, sausage and waffles so no need to go elsewhere. My son is disabled and in a power chair so he was allowed to come through the front lobby to reach our room. I accidentally left my cell phone charger plugged in the outlet in the room and when I called back the cleaning staff had turned it in and I was able to stop by and pick it up on our way back home. The staff that we dealt with were all very nice. The only negatives I found were that the common areas (hallways ,etc) were a little worn and a football game was in town and there were quite a few intoxicated people as we were checking in. We would definately stay there again with the deal that we had gotten on Priceline.", "title": "Few negatives but very positive overall", "user": "Christine P", "date": "November 7, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 144845139}, {"rating": 3.0, "stay_parameters": "Stayed December 2012", "text": "Stayed 4 nights got room serviced 1 time. The rest of the time I had to call for clean towels. Hot breakfast was ok, better then others, but not the best. The hotel smells like old dirty carpet . Carpets looked dirty. Our room smelled like moldy damp carpet. I febreezed to no avail and finally resorted to buying a yankee candle which burned continuously while in the room. If you don't plan to spend a lot of time in your room and you aren't sensitive to smell go for it!", "title": "Cheap and smelly but not the worst", "user": "venaniece", "date": "December 20, 2012", "detail_rating": {"cleanliness": 2.0, "value": 3.0, "location": 4.0, "service": 2.0, "rooms": 3.0}, "id": 147817787}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "A surprise trip for my Mother and Daughter as an early Christmas present. This location was great with easy access to the interstate or backway into the city itself. We weren't more than 15 minutes in any direction to the sights and sounds of Nashville. The hotel offered a hot breakfast which on the days I could make it down in time (clean-up at 9am sharp) it was in fact hot and very good. During the 4 day stay they had at one time or another, eggs, bacon, sausage, biscuits and gravy, make-yourself waffles, breads and fruit. The hotel seemed to be secure as we didn't see any issues upon coming in late at night. All access to the building is by room key only day or night. The staff were very helpful and friendly from the front desk, the morning breakfast crew and the housekeeping staff. Very enjoyable stay!", "title": "Nice Place and In a Great Location", "helpfulness": 2, "user": "Her09", "date": "December 20, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 147806907}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "My family and I stayed overnight here during the Nashville Christmas Parade weekend. The staff were very welcoming and polite during our stay. The location was really convenient to downtown & the attractions we wanted to visit while there. Check-out was smooth as well. Would definitely stay here again.", "title": "Great Place to Stay", "helpfulness": 2, "user": "AUChickadee", "date": "December 17, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 147606461}, {"rating": 4.0, "title": "Pleasantly surprised", "text": "I have to say I was pleasantly surprised with the stay. We arrived on a Saturday and left on Monday. The room was clean and nicer than I had expected. I didn’t sleep well the first night because I kept hearing noises in the hallways, but I eventually fell asleep. We slept in too late to catch breakfast. The only downside the next day was that I had wanted to watch the Packer game on NBC and it was the only channel that didn’t come in. The front desk stated that it wouldn’t get fixed until the next day. I was forced to watch it on my laptop. The breakfast the following day was okay, nothing great.", "user": "Elizabeth K", "date": "December 15, 2012", "id": 147494540}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with friends", "text": "Stayed for 2 nights just for a little Nashville exploring, and I would definitely come back to this hotel to stay! It wasn't very far from a lot of the things to do/ heart of Nashville. The staff was relatively friendly, the price was very good for the location and benefits, the breakfast was great. The room was very nice, more than I expected, as were the beds very comfortable. I was overall very pleased with everything about the room and the hotel!", "title": "Will Definitely Stay Again!", "user": "Tiffany W", "date": "December 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 147477595}, {"rating": 4.0, "title": "No Complaints", "text": "This hotel was a great value for the priced payed. We were very impressed with the evening cocktail hour. The appetizers actually included healthy options such as a large fruit and vegetable platter, and a cheese plate with crackers. All types of liquor was included as well as beer and wine. A hot breakfast included scrambled eggs and bacon as well as the usual cereal, waffles, bagels, etc. Most unusual for a budget hotel china plates and real silverware, not paper and plastic, were used.", "user": "hollywoodChicago", "date": "January 5, 2013", "id": 148944279}, {"rating": 5.0, "stay_parameters": "Stayed December 2012", "text": "Our king room was spacious, the beds were comfortable with good linens and bathroom amenities were of high quality. The location was convenient to Opryland, 10 min drive.", "title": "Best for your money hands down!", "user": "AHAMMONS", "date": "December 30, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 148396101}, {"rating": 2.0, "stay_parameters": "Stayed December 2012", "text": "Based on value, I would recommend this hotel.", "title": "Not recommended!!", "user": "Supercracker", "date": "December 28, 2012", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 3.0, "service": 1.0, "rooms": 3.0}, "id": 148204990}, {"rating": 3.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "After some of the negative reviews I was worried. I booked this back over the summer. I got a rate of 63.00 per night, plus the breakfast is extensive- lots of hot and cold options. The room is nice, clean/ white plush bedding, lots of complimentary tolietries... This was a great find!", "title": "Not bad, not great", "user": "Rebecca B", "date": "December 25, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 148035245}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "Got to the hotel on Dec. 26 and left the morning of Dec. 28. Had to call and request that our room be cleaned. ( was told by front staff that it would be a while due to not enough employees there). When checking in the lady at the front gave us a pice per night with tax. When checking out, the young BOY and the acting manager was at the front and was very argumentative about that we heard wrong and that we were not told that! I have stayed at cheaper hotels and got better service and have met homeless people that acted more professional than the bunch that works and operates this location. DON'T WASTE YOUR MONEY AT THIS PLACE!!!!", "title": "Good value stay", "helpfulness": 2, "user": "Ethhvuhg", "date": "December 24, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 147996148}], "location": {"country": "United States", "city": "Nashville"}, "stars": 2.5, "variance": {"poor": 37, "average": 65, "very good": 176, "terrible": 34, "excellent": 174}, "aka": "Club-Hotel Nashville Inn And Suites", "slim_ranking": 0.331081081081, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "description": "The perfect choice for nashville hotels, the ClubHotel Inn & Suites hotel in Nashville, Tennessee provides lodging accommodations near the Country Music Hall of Fame, Nashville Airport, and the Grand Ole Opry. Our hotel is also conveniently located near area attractions such as The Parthenon, Cheekwood Botanical Garden and Museum of Art, Belle Meade Plantation, General Jackson Showboat, Tennessee Central Railway Museum, Cumberland Science Museum, Nashville Zoo at Grassmere."}