{"user_rating": 4.0, "review_count": 202, "name": "Club Med Sahoro", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled with family", "text": "We arrived in late December hoping this would be a great place for our little family to celebrate Christmas. It was fantastic. We have two girls 8 and 10 who had never skied before. The GO's were very welcoming and showed us around when we got there. The rooms were a decent size, although we barely spent any time in them, and the rooms and resort were very clean. We were treated to fabulous meals with plenty of variety for breakfast, lunch and dinner, with cuisine from Japan and other parts of the world. Everything was included even beer, wine and cocktails at the bar. The quality of the ski school was great and the teachers were very experienced. I particularly liked Olivier who was my teacher for most of the time, he was fantastic. My kids loved it, and they made new friends, in fact we didn't see much of them during the week, when they weren't skiing they were swimming in the pool or lounging in the Canadian hot tub. The snow was great, and although it does not have as many runs as Niseko, there was plenty of variety, the runs were long and there was hardly anyone there, as there are only two resorts at Sahoro. We had a feast on Christmas Eve and Christmas day. They really lived it up with shows from the GO's, our kids put on a show and the GO's dressed up for a nativity scene. I cannot fault my stay at Club Med it really was a fantastic holiday and I look forward to returning soon. Lydia, the head GO was great and ran a great team. This is an excellent holiday for families.", "title": "Fantastic Family Holiday - we couldn't have asked for better", "helpfulness": 4, "user": "AussieNicky", "date": "January 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 123094775}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "We spent a few days here over Christmas. Most aspects of the stay were very good, the food is good, the staff are lovely, the skiing is great with very few people on the mountain even in busy times. To me though, for the (very high!) price, the rooms need to be a lot better. They are small and tired. The rest of the hotel seems to have had a makeover recently but the rooms themselves are poor quality. We very very cramped in a 'delux' room which supposedly could sleep 5, but in fact was tiny. The orginal room they gave us had very poor quality bathroom and we asked for an upgrade.", "title": "Good stay - rooms need work", "helpfulness": 1, "user": "David D", "date": "January 1, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 122378514}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "On balance, a great holiday, great location but at a high cost.", "title": "The people makes this trip EXTRAORDINARY :-)", "helpfulness": 1, "user": "Eyes4art", "date": "December 16, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121793070}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "We just came back from a memorable experience @ Club Med Sahoro. Besides the facilities, food, environment etc. that other guests have raved about... what makes Club Med Sahoro extraordinary is the people. It's the sincerity, passion, energy and warmth of the GOs that touched us. Thank you Lydia and your EXCELLENT team of staff for making our trip soooo special. ;-)", "title": "Great food & wonderful GOs are what made the difference!", "helpfulness": 5, "user": "mummybearie23", "date": "December 9, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 121539363}, {"rating": 4.0, "stay_parameters": "Stayed February 2011, traveled with family", "text": "Our family was the among the first to arrive on Dec 3 for the new ski season. Resort facilities including restaurant area was upgraded this year. Other facilities like ofuro, Canadian hot tub, squash courts (yes, if you have energy after a whole day of skiing, you can). Overall, we are happy with the physical facilities. Come mid December, I hear that there will be a skating rink created outside the resort front for kids and family. Pity we will miss that. But really - the Fantastic crew and fantastic food is what made the difference to our holiday! Lydia, Chef de Village and her G.O. team are the best. From the ski rental team, Remi, Marco, Fablo and Putu to the ski instructor teams - Keith, Jeff, James, Chloe, Pierre, Mie and the whole team. Skiing is literary ski in and ski out. If you haven’t skied before, beginner lessons are great and everyone is very encouraging. Mini clubbers are also taken care of well, and had lots of fun with Nita and team. We also enjoyed snow trekking with Ade, who brought our family who did not ski, out for a trek in the snow for one hour to enjoy snow scapes. For food, there are two options - one is the buffet restaurant which serves up great quality food, always enough and top notch, great variation in menu. The other is a Nabe restaurant where you cook up your own steamboat, ramen etc. Katsu and Yuko our servers provided great service and patience in explaining how to do it right. We were a family of 14 people, half ski and other didnot. All enjoyed themselves :) very much over a 5 day 4 night stay in a winter wonderland. What a great start to the 2011-2012 ski season at Club Med Sahoro – so we will be back for more.", "title": "Club Med Sahoro", "helpfulness": 1, "user": "chelsea69", "date": "October 8, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 119065949}, {"rating": 4.0, "stay_parameters": "Stayed February 2011, traveled with family", "text": "good snow and nice place to stay with kids", "title": "Perfect with kids", "helpfulness": 1, "user": "nathdarbon", "date": "March 8, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 99442478}, {"rating": 3.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "everything is well organised except the nightlife. If you like it is not the good place to go. The disco opens only one night a week (Wednesday)", "title": "Satisfactory", "helpfulness": 4, "user": "patchoy", "date": "March 8, 2011", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 99387873}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled with family", "text": "Food not as good as others Club Med", "title": "leave your kids and don't feel guilty :o)", "helpfulness": 1, "user": "flaut", "date": "March 6, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 2.0, "sleep": 5.0, "rooms": 3.0, "location": 3.0}, "id": 99097049}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled with family", "text": "One ski instructor has not his place in this international hotel", "title": "Great Family Winter Adventure! Excellent choice for family with young kids!", "helpfulness": 1, "user": "Waynelai", "date": "March 6, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 99093288}, {"rating": 3.0, "stay_parameters": "Stayed March 2011, traveled with family", "text": "* Staff including GM friendly and good", "title": "Great service and atmosphere created by the GOs, let down by poor rooms and in our case dissapointing snow conditions.", "helpfulness": 1, "user": "adrian094", "date": "March 6, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 1.0, "location": 3.0}, "id": 99089933}, {"rating": 4.0, "stay_parameters": "Stayed February 2011, traveled with family", "text": "We were back at Club Med Sahoro in February 2011 and enjoyed it as much as on previous occasions.", "title": "Still great, but...", "helpfulness": 14, "user": "Turistjavisst", "date": "June 26, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 5.0}, "id": 114750592}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled with family", "text": "But, Club Med need to upgrade the resort facilities and most importantly, the food!", "title": "Fantastic holiday especially for families with kids", "helpfulness": 1, "user": "JKE255103", "date": "June 22, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 4.0}, "id": 114628036}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled with family", "text": "Recently being upgraded to a 4 star rating among Club Med resorts, further improvements are truly a must. The price points that come with a 4-star rating are otherwise not justified, especially as there is now a Club Med in northern China with the same rating that is brand spanking new.", "title": "Exceeded Expectations", "helpfulness": 3, "user": "cjm08", "date": "April 3, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 102703832}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled with family", "text": "The Sahoro resort as such is very old and really starting to show its age even if the bar area and some rooms have been upgraded. We've stayed in the renovated rooms on both visits and felt quite comfortable, but the older, standard rooms are really worn.", "title": "What a fantastic holiday!", "user": "bobolei", "date": "March 28, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 101968537}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled with family", "text": "What disappointed us the most however compared to our visit in 2010 was the food!", "title": "my first visit, but Excellent experience will lead to my Annual Event.", "helpfulness": 1, "user": "club_beginner", "date": "March 26, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 101662831}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled with family", "text": "A very good Club med experience but thought things had slightly deteriorated since last year the food is good but not great and thought the food choice was less than previous years with the remodelling of the dining room (more seats, less room for food buffet?).The cereal selection was very limited & a lot of Chinese food, apparantly to strangely satisfy the Japanese clients. There was also a higher proportion of only Japanese speaking ski coaches, they have a large Japanese client contingent but my wife was stuck for 4 days with no english speaking coaches. Overall a very satisfactory experience, great snow quailty & empty slopes but if you want more challenging slopes, more variation in food & not travelling with young kids you could consider Niseko.", "title": "Second visit would probably come a third time", "helpfulness": 2, "user": "familymanHongKong", "date": "February 7, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 124278161}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled with family", "text": "This is our 2nd year and we are already planning to go next year and for longer. 8 days was not enough! All inclusive skiing holiday, no meals to cook, ski passes, 2 lessons a day, kids club, fabulous selection of food including alcohol, good entertainment, ofuro to relax in after a day's ski, massage is too expensive though. Bring own ski clothes if you can. Hiring can get expensive but if you have no choice it might be more convenient rather than lugging skis etc. Very cold -10 to -16 every day but it snowed the 4 days in 8. So beautiful powder to ski in. Slalom race for Club 4 and above. Kids Star 4 can also participate. Tues and Fri. Easier to get to from Obihiro Airport (flies out from Haneda - Tokyo), CM bus waits for the flight and it took only 1 hr 15 min", "title": "Great skiing holiday destination", "helpfulness": 4, "user": "JKE255103", "date": "February 3, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 124062859}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled with family", "text": "I am still stunned at the cost of this trip. It was our most expensive holiday to date! In typical club med style, everything was included, except ski rental, which for 2 adults and 1 5 year old was US$200 per day! If you want to buy ski goggles (our both broke in transit) that will set you back US$100 for the cheapest pair. Once you have put aside the giant price tag, this was an amazing holiday! If you are beginner to intermediate skiers than this is the IDEAL place. Their are plenty of bunny runs and easy poma and chair lifts for beginners, plus many gentle green runs to practice your new techniques on! The club med ski school is very clever. 5 hours of group lessons are included each day and they are divided into groups from beginner to club 6 level. depending on how many people apply for each group daily, the group is often further split depending on your ski level and technique. This allows you to ski with your same level skiers and to learn things relevant to your ski level. I really felt my skiing improved on this trip! Plus you can dedicate 5 -6 hours to skiing each day, as the kids are cared for from 8am to 5pm. They will help them dress for ski classes, feed and entertain them. Only children 4 up may ski in their ski school. age 2-3 go to the petit club. Our 3 year old really enjoyed the petit club and didn't complain once! The food was also pretty good. We are great fans of Japanese food, and enjoyed the Japanese section each day! There was of course the standard pasta and nuggets and chips and hamburgers and hotdogs each day as well as lovely salad buffets and carvery! We especially enjoyed the sushi (four times in the week) and lovely alaskan crab legs and lobster one night! The kids OD'd on the delicious hokkaido soft serve machine too! None of us wanted for anything food wise! Drinks wise, although we weren't too taken by the house red, we enjoyed the warm sake and the hot sangria (AKA gluwein) after our afternoon ski! With young kids we didn't participate in too may of the night time entertainment, but there is something on every night if you are keen. We all loved the hot jacuzzi and outdoor canadian bath as well as the Japanese onsen and sauna. It's the best way to warm up and soothe the days aches away. We had a wonderful holiday and everyone was well taken care of and catered for! Our room was very comfortable. The kids LOVED sleeping on the futons in the tatami room. We did have to ask to have our two single beds pushed together and made up into a double bed. Although the bathroom was tiny, we mostly showered after the pool and jaccuzzi or used the onsen, so only landed up using our shower in our room a few times.", "title": "Complete hassle free ski holiday for the whole family!, where all you have to worry about is your skiing", "helpfulness": 3, "user": "tourtheworld-74", "date": "January 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 123880224}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled with family", "text": "2nd time here. Restaurant and food much better than last visit - taraba crab AMAZING !!!! great for families - kids club, staff, shows all really wonderful. skiing is good and mountains always empty but there is no real advance skiing, chute 1 and 2 are normal red/black runs. Rooms are basic but fine. What really makes the place are the staff who work sooooooo hard and all the kids having the time of their lives. We'll be back next year", "title": "Wonderful family holiday, staff are amazing", "helpfulness": 3, "user": "BloomFamily", "date": "January 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 123716993}, {"rating": 3.0, "stay_parameters": "Stayed January 2012", "text": "Well I'm sat in the lobby, having just checked out. So here are the pros;", "title": "A mix bag", "helpfulness": 3, "user": "Neil_g63", "date": "January 24, 2012", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 5.0, "service": 5.0, "rooms": 3.0}, "id": 123576101}], "location": {"country": "Japan", "continent": "Asia"}, "variance": {"poor": 4, "average": 26, "very good": 76, "terrible": 4, "excellent": 92}, "aka": "Club Med Sahoro - Karikachi Kogen Hotel", "slim_ranking": 0.5, "description": "Japan, the alternative winter sports world. Sahoro is a place of refinement, in full Japanese style. The microclimate that reigns over the island of Hokkaido, which has less rainfall and is cooler than the rest of Japan, ensures optimal snow cover for an intense skiing experience. And after all that skiing, revival is guaranteed, with the choice between Ofuro, traditional Japanese hot baths, and Canadian outdoor baths. Indoors you will find a heated swimming pool, jacuzzi and saunas."}