{"user_rating": 4.0, "review_count": 268, "name": "Coast Edmonton Plaza Hotel", "reviews": [{"rating": 5.0, "title": "Coast Edmonton Plaza", "text": "The room was very comfortable, the hot tub a great way to relax, the shuttle service very handy, and the food in the bar & restaurant tasty and not overpriced, but the best thing about the hotel was the staff. In every situation they could not have been more friendly and helpful. I had never stayed at a Coast hotel before, but with this experience would not hesitate staying with them again.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "March 28, 2003", "id": 925556}, {"rating": 5.0, "title": "Coast Plaza Delightful", "text": "A quiet hotel with courteous staff. A well appointed room, with excellent bed, usable desk and even terry cloth robes in the closet for your use. A relaxing evening. AAA/Goverment rates offer substantial savings so try to find a way to get one.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "December 4, 2002", "id": 820265}, {"rating": 1.0, "stay_parameters": "Stayed June 2005", "text": "We (2 adults and 2 children - 5&6) were not impressed at all with this hotel. The room was non smoking room but had obviously been a smoking room not so long ago, the smell was arwful..we even went out and bought air freshner! The decor in the room was dark and dingy and it was like going back in time to the 1970's, not a place to relax in, we couldn't wait to get out. The bathroom was ok but could have been cleaner and we were puzzled why there was a bottle opener screwed on to the wall next to the toilet roll holder?? The pool and gym was nice we all thought it was the best part of the hotel.", "title": "Never again!", "helpfulness": 11, "user": "joolsnsteve", "date": "July 13, 2005", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "rooms": 2.0, "service": 2.0}, "id": 3662374}, {"rating": 4.0, "title": "Great the 2nd time as well", "text": "Anyone going with children should be aware that there isn't anywhere to sit and have a drink (soft or otherwise) with the children. You can get room service (no thank you!) or sit in the restaurant, but we found that as soon as you had finished your meal you were expected to leave. The food by the way was lovely and can be recommended.", "helpfulness": 8, "user": "KAH_Calgary", "date": "June 28, 2005", "id": 3616950}, {"rating": 3.0, "title": "Decent Location and Rooms", "text": "This hotel was one of three that we stayed in during our 11 day trip to Alberta and we have nothing but praise for the other hotels we stayed in so please do not think that we are a family of moaners, the rest of the trip was fantastic!", "helpfulness": 7, "user": "A TripAdvisor user", "date": "September 29, 2004", "id": 2608394}, {"rating": 4.0, "stay_parameters": "Stayed August 2004", "text": "This is the 2nd time we have stayed at this hotel. We had a nice corner room and the price was great as we got a 2nd room for 1/2 price for the other couple we were traveling with. We also got a free upgrade for our room. They messed up our bill and over charged us just as they had done the first time we stayed there but fixed it as soon as we brought it to there attention. Comfortable room, nice ammenities, friendly service we would stay there again.", "title": "Stayed here August 18 - 21, 2004", "helpfulness": 10, "user": "madge62", "date": "August 24, 2004", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 2491759}, {"rating": 4.0, "title": "Great hotel", "text": "Stayed here over Labor Day Weekend (Sept. 2-6). Overall, happy with the stay. Had 2 rooms and were able to get rooms across from each other. The room size is average. A little dark, but OK if you open the window curtains. The rooms we had were quiet and we couldn't hear too much noise besides the people who would pass by.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "March 14, 2004", "id": 1725194}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled solo", "text": "$99 Cdn a night booked three days before a long weekend, and I saved more than $60 over two nights at the Crowne Plaza Chateau Lacombe, where I cancelled my res. Place was clean, room large and pleasant, quiet, they let me check in at 1130 after an early flight. Only real negative was that the bar was closed Sun night and the immediate area is kinda of bare of establishments, though I did find a Boston Pizza one block over. I would stay here again, though not for the $149 they were listing on their own website (I booked thru Expedia.ca)", "title": "For the $$$$ paid excellent value", "helpfulness": 7, "user": "a78jumper", "date": "August 6, 2007", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 3.0, "rooms": 4.0}, "id": 8363870, "likes": {"liked": "— Price combined with a name brand hotel", "disliked": "— Limited Bar hours with not much readily available closeby"}}, {"rating": 3.0, "stay_parameters": "Stayed March 2007, traveled on business", "text": "I stayed here on business March 2007. My room rate was $154 a night. Overall the hotel is good and probably appropriate for the price I paid. I got the overall impression that it was an old hotel with recent renovations, but that that they cheaped out a bit when doing them. For example, in the halls you can tell the walls are old and the doors look a little dated. That being said, the room, TV sheets etc were very nice and I was very happy with the room, witch I guess is the most important thing. I was a little disapointed with the pool and Hot Tub. On their website the photo makes it look look really nice, but in reality it is a little old and run down (but not bad). I would stay here again as it was nice, and cheaper than other downtown hotels.", "title": "Pretty Good, but not really good.", "helpfulness": 3, "user": "Family_Guy", "date": "March 23, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "location": 3.0, "rooms": 4.0}, "id": 7209709, "likes": {"liked": "— room", "disliked": "— pool"}}, {"rating": 4.0, "title": "Was a great 10 day stay", "text": "The hotel was very considerate during our stay, I got sick, then my wife got sick, then our 2 year old grandaughter got sick. The restaurant went out of their way to help us. The maid we had was also very helpful, as she realized we needed extra towels, sheets etc., etc.", "helpfulness": 4, "user": "Daveonhudson", "date": "November 15, 2006", "id": 6133263}, {"rating": 3.0, "title": "Nice hotel with friendly staff", "text": "I will stay here again.", "helpfulness": 5, "user": "fmacmillan", "date": "November 5, 2005", "id": 4088009}, {"rating": 4.0, "stay_parameters": "Stayed August 2005", "text": "Dave S.", "title": "Fine hotel, a little understaffed", "helpfulness": 2, "user": "ascime", "date": "August 21, 2005", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "service": 4.0}, "id": 3793580}], "location": {"country": "Canada", "city": "Edmonton"}, "stars": 3, "variance": {"poor": 23, "average": 57, "very good": 77, "terrible": 11, "excellent": 100}, "aka": "Coast Edmonton Plaza", "slim_ranking": 0.25, "description": "Contemporary Downtown Hotel convenient to Convention Center."}