{"user_rating": 3.5, "review_count": 218, "name": "Coast Edmonton House", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled on business", "text": "I recently stayed one week in Edmonton on business at the Coast Edmonton House located in the central downtown area of the city. Check in was very prompt as I am a Coast rewards member so everything was ready for me upon arrival. My room was on the 18th floor with a nice view of the city. The rooms are all suites with separate bedrooms. They also include kitchens which is very handy for fixing a quick breakfast while I am getting ready for the day. There are two flat screen TVs in the room and plenty of closet space. I required more hangers, however, so I called down and some were sent up fairly quickly. The living room has a sofa/hide-a-bed. There is also a large balcony.The room was clean and quiet and the bathroom very adequate. The room was too warm though and so we had our balcony door open much of the time for cooling.", "title": "An excellent property in Edmonton, Alberta", "helpfulness": 3, "user": "Gemgirlbarbara", "date": "February 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 153146672}, {"rating": 2.0, "stay_parameters": "Stayed February 2013, traveled solo", "text": "I found the room clean and more than served my needs. I will definitely stay here again.", "title": "You win some, you lose some", "helpfulness": 3, "user": "hugseeker", "date": "February 20, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 5.0, "sleep": 1.0, "rooms": 2.0, "location": 3.0}, "id": 152640995}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled with family", "text": "I am currently staying at the Coast Edmonton House and I have to say I'm having a love/ hate feeling about it. I came here for some down time, to get caught up on work things and to relax. The rooms, upon appearances are great, nothing super fancy, but a suite hotel...full kitchen, full bathroom, living room with a small dining area, separate bedroom, balcony, 2 small blocks away from a Tim Hortons...big bonus. On the down side, the heat in my room didn't work for 2 days, it was cold, also the cover on the ac unit in the bedroom wasn't there, letting in more cold air, and I had to sleep in the living room on the pull out bed (we all know how fun those are), causing me to throw my back out. The heat is partially fixed, the thermostat doesn't work , so the maintenance guy had to set the heat on the actually base board heater (old school, yes)...so it is now set at one temperature. The internet here is horrible, it took 3 minutes for this \"write a review\" page to load...yes I timed it...3 minutes is a long time in the internet world...it's been like this for the past 3 days. Since my back hurts, due to sleeping on the sofa bed, due to no heat and too cold in the bedroom, i've been laying here for a day and a half, with crappy internet and bored out of my mind. Customer service is meh....when I called to report heat in the evening, the lady was not that pleasant...the housekeeping staff are great , very friendly and helpful. I check out tomorrow, I would like to be the type of person that demands to be comped for this somehow, but I won't...I'll just write this review and hope that the next person in this room has a better time than me.", "title": "Fine stay at Coast Edmonton House Hotel", "user": "M_and_N_s_Adventures", "date": "February 19, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 152547967}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled with family", "text": "Although hotel was dated and could use some work in the bathrooms and kitchens (in suites), it was clean and staff were friendly. We weren't told however on check-in that there was a $16 fee to use the parking facilities for 1 night, but we were able to have that fee waved on checkout (just an FYI for future guests). The bed was really soft, which was fine for me, but gave my husband a backache so rating the bed just depends on what type of bed works for your body. Overall it was a descent stay with a nice skyline view.", "title": "Great value and good view!", "helpfulness": 2, "user": "Doug M", "date": "February 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 151929335}, {"rating": 3.0, "stay_parameters": "Stayed February 2013, traveled with friends", "text": "I was surprised that the rate for a one bedroom room was only $119! Nice, older hotel but very nice furnishings in rooms. Parking should be free it was $15/day. Staff were really helpful in getting us checked in early for our daughters wedding.", "title": "Great space", "helpfulness": 1, "user": "Ark15noah", "date": "February 10, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 151857283}, {"rating": 4.0, "title": "Pleasantly surprised!!!", "text": "Stayed at the Coast Jan 31 to feb 3. Read previous reviews, some good some not so good, before travelling to Edmonton. Was booked in the hotel for a one day conference. Was pleasantly surprised by the room. It was a one bedroom suite with king size bed. The suite is equipped with a full kitchen and dining area. It has a large and comfortable living space with a balcony, We were on the 23rd floor facing the river so had a pretty good view. The suite was clean and fresh smelling. Bathroom was quite clean( no evidence of mold as mentioned in previous review), There is a pool in the hotel, although I didn't have time to try out. There is a good restaurant off the lobby called Rutherfords, Only had a chance to have breakfast so can't comment on the rest of the menu but looks quite nice. Overall, would definitely stay there again when travelling to Edmonton.", "user": "kjs1961", "date": "February 3, 2013", "id": 151348292}, {"rating": 4.0, "title": "Great Place for Frequent Travelers", "text": "I travel to Edmonton on a regular basis (currently biweekly) and I like having a seperate living room and kitchen. The restaurant is very good, however I have been trying to eat healther and it is nice to be able to store food in the fridge and cook in the room. When you combine that with the option to take your shoes off and relax in front of the TV while eating supper, it is the desciding factor for me to saty at the Coast Edmonton House.", "user": "CRMW154913", "date": "January 29, 2013", "id": 150974374}, {"rating": 1.0, "title": "Great property - 20 years ago.", "text": "Date of stay: January 24 - 27 unless I can find alternate accomodations sooner", "user": "Joshua K", "date": "January 24, 2013", "id": 150544055}, {"rating": 5.0, "title": "Great value, great view", "text": "1. Upon check-in, both front desk attendants were on the phone. One waved at me. I'm assuming this meant to wait a minute.", "user": "BrightSided", "date": "January 22, 2013", "id": 150297165}, {"rating": 5.0, "title": "Stay was made as comfortable as possible with amazing staff :)", "text": "2. When I checked into my room, there was no bed skirt covering the box spring. I had linens on the top of the bed and a bright blue box spring staring back at me.", "user": "Dee F", "date": "December 15, 2012", "id": 147477637}, {"rating": 4.0, "title": "Great place for a weekend", "text": "We stayed Nov 2012, me my husband and 2 year old. I LOVED that there is a kitchen and a bedroom. We were able to prepare food in our room for our picky 2 year old, and stay up after he went to bed. Hotel was clean and the staff were frendly. They included a $20.00 voucher with check in for the reastarunt downstairs (we ordered room service for breakfast). All and all great stay, but heads up they charge $15.00 a day parking. I would stay here again.", "user": "Ashley S", "date": "November 21, 2012", "id": 145917757}, {"rating": 4.0, "title": "Awesome home away from home!", "text": "Great location, great facilities, great staff. Hotel is a little dated (80's). Room was very comfortable especially on a long term (i.e. 1.5 months) stay. Full kitchen, separate bedroom all for a good price. Nice fitness room with pool on-site. Small on-site market is a welcome bonus!!", "user": "SullyBarrie", "date": "November 19, 2012", "id": 145775396}, {"rating": 3.0, "title": "Remembrance Day weekend at the Coast", "text": "The front parking for check in is very small and congested making for a lot of confusion.The maid service did not come until 3pm and we had been out of the room since 9am by then we were back and ready to relax but had to leave again The heat was not even turned on in the rooms so by the morning we were cold and finally had to call for maintenace. When we went to exit the parkade in the am the gate was locked even though it was way after the time it said on the sign so we had trouble getting out. But the rooms were spacious and nice for having company over to visit and the pool was clean and well maintained.", "user": "334steph", "date": "November 18, 2012", "id": 145662475}, {"rating": 2.0, "title": "More bad than good", "text": "We booked this hotel for 6 days for the CFR. I was very clear on the phone that we wanted a smoking room. I asked her three times, make sure it's a smoking room. We will book somewhere else if not. Yes, yes it is! We get here, no, it's not! I go the desk, tell the clerk that we reserved a smoking room, which this wasn't, and that the phone doesn't work. She has no apology or fix for it, I'm told, well the smoking rooms have been booked up for some time now. Just matter of fact about it. Nothing about the phone, just that's the way it is! I was so unimpressed I just walked away. No way could find another room at this time of the year so we stuck it out.", "user": "Flipant", "date": "November 11, 2012", "id": 145190331}, {"rating": 3.0, "title": "Decent value, but no frills", "text": "Next day, chamber maid is awesome, gives us more coffee, very nice lady. Will bring you some tea towels later on. Day goes by and the next. Still no tea towels, so using white bathroom towels to wash cups and glasses in the kitchen. The air conditioner was still in and not covered, cold air billowing in, so we froze for three days before I asked them about it. They sent someone up that day to fix it, but phone still doesn't work. I realize there is a phone in the bedroom that isn't cordless, and it works, so it's ok they didn't fix the phone.", "user": "songbook", "date": "November 4, 2012", "id": 144515377}, {"rating": 5.0, "title": "Above and beyond", "text": "Yes, the hotel is undergoing reno's but this never once interfered with our stay. The rooms are well appointed, clean and comfortable. The restaurant also serves good food and has a good breakfast buffet. (Not included in the room rate.) All the rooms are suites making it a very comfortable environment. The staff are friendly and very helpful. We had left our son's blanket in the room and we didn't discover this until arriving home. We phoned the hotel and they went above and beyond searching for the blanket. They found it. I stayed here four nights over 2 stays and both times were very good. I would definitely stay here again. (Its also right in the downtown, so very convenient.)", "user": "Darin P", "date": "November 1, 2012", "id": 144225159}, {"rating": 1.0, "title": "Bad Experience", "text": "The hotel is currently undergoing extensive renovations which isn't advertised anywhere. So if you don't mind stepping through wet asphalt or being asked (as I was) to jump from one dry area to another you are off to a good start. The hotel also accepts large corporate groups (union meetings when I was there) so there was floor parties lasting until midnight which would then escalate to full blown fist fighting by 2am. We were fortunate enough to have ring side seats (adjacent rooms) to the \"ultimate fighting\" where we experienced yelling and fighting next door to wall punches and finally the screen door being detached and tossed around the adjacent balcony. I really wish I had taken pictures. As way of compensation the management offered one of four nights no charge but not two nights, which was the actual no. of nights we didn't sleep due to the floor \"activity\". I have to say that security was terrific and immediately responded by standing outside our door to speak to the police on a two way radio (on a speaker phone) for three hours! Yes, apparently this is a common hotel occurrence to which the police no longer respond. If I hadn't been a speaker at the conference I was attending at the Hotel McDonald I wouldn't have been so upset by all the \"activity\" (ok...who am I kidding...I would have still been upset). This is just another reminder to me to stay at the conference hotel instead of trying to save a few bucks for a suite. My next conference is in Hawaii and I've already cancelled that budget hotel. I guess I've finally learned my lesson. Maybe you can learn from my experience.", "user": "Shannon D", "date": "October 22, 2012", "id": 143496728}, {"rating": 5.0, "title": "Great friendly staff!", "text": "Each year when we hold our Provincial Music Festival we stay at the Coast Edmonton House and the staff is very accomodating! We love the suite style rooms and closeness to our event! The front desk staff is fantastic and remember us each year. We love to deal with Gloria for all our needs!", "user": "Dianne J", "date": "October 22, 2012", "id": 143485124}, {"rating": 1.0, "title": "Outdated and old", "text": "I booked this hotel as a last resort, as all other hotels that I usually stay at were booked. The hotel is very outdated, the rooms are very large almost feels like an apartment unit. But the service lacks in every aspect. The rooms have a mouldy smell, the carpet is old and dirty, the bathrooms need upgrades, the cleaning stafft need to do a much better job, I don't think they really clean the rooms during an stay. I asked the front desk staff to see if another room was available as this one is too big and makes me feel uncomfortable, they were rude and not helpful. I actually tried finding another room for the next few nights at another hotel but no such luck.", "user": "Sayda27", "date": "October 17, 2012", "id": 143032228}, {"rating": 2.0, "title": "Coast Edmonton House has been coasting for to long", "text": "This hotel is showing it's age and no amount of poor amenities are going to change that. The staff are great but the whole place needs a good going over, it's like they are holding on while the world around them, namely other hotels, gets with the times. The elevators are as noisy as the traffic outside, the rooms are out of a bad 80's movie, the in room service such as TV offerings are barely better than looking out the dirty sliding glass window. The food is prepared by a cook who seems to not really want to be a cook (not that I asked, just based on the meals I had) and would rather be some where else. The bedding consists of a foam quilt and a sheet which is right out of a cheap motel.", "user": "daveinyk", "date": "October 14, 2012", "id": 142775689}], "location": {"country": "Canada", "city": "Edmonton"}, "stars": 2.5, "variance": {"poor": 23, "average": 28, "very good": 81, "terrible": 17, "excellent": 69}, "aka": "Coast Edmonton House Hotel", "slim_ranking": 0.295454545455, "description": "The Coast Edmonton House is an all-suite property centrally located in downtown Edmonton's arts, business and shopping district. The hotel features spacious one and two bedroom suites including fully equipped kitchens, separate living rooms with dining areas and private balconies for your enjoyment. The Hotel features Rutherford’s Restaurant and Lounge, banquet facilities for up to 80 persons , a fitness centre, indoor swimming pool, laundry facilities, covered parking, and complimentary wireless Internet access."}