{"user_rating": 4.5, "review_count": 262, "name": "Cobalt Coast Resort & Suites", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with friends", "text": "I stayed in one of the cottages with two of my girlfriends for our birthdays. The staff and accommodations were outstanding. One night, we couldn't get the BBQ grill lit, so Arie cooked our steaks in the resort kitchen for us. Above and beyond! The resort is great because it is off the beaten path and very quiet, but we made it our own. It was nice to be able to relax after a long day at the beach with the crowds from the cruise ships. Everyone was spectacular. I will definitely be back! I would love the recipe for the smoked Mahi dip!!!", "title": "Can't Wait To Go Back", "user": "amyphall", "date": "December 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 147371211}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled solo", "text": "I just returned from a wonderful week at Cobalt Coast., from Nov.29-Dec. 6th. It was recommended to me, and I am so glad I stayed there. Ari is the nicest, most hospitable host I have ever met. He makes you feel right at home. The service was excellent as well as the food. Everyone of the staff went out of the way to please. The rooms are very clean and bright.", "title": "I will definitely be returning to Cobalt Coast", "user": "KathleenKuper", "date": "December 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 147258476}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled with family", "text": "As a single person, I felt very comfortable and safe. I would highly recommend Cobalt Coast to anyone who loves diving and plans to visit Grand Cayman.", "title": "Friendly Pirates in the Caribbean", "helpfulness": 1, "user": "Peter K", "date": "November 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 146076387}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "It is simply exquisite. It is also so convenient to the diving. Just take a few steps out of your room and you are to the dive shop.", "title": "Great Lodging", "helpfulness": 1, "user": "dan b", "date": "November 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 145418965}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled with friends", "text": "Thank you Ari and all of your staff for a most wonderful vacation.", "title": "Divers and non-divers will love it", "helpfulness": 3, "user": "wtc108", "date": "November 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 144905469}, {"rating": 5.0, "title": "Great SCUBA destination and much more...", "text": "I joined a group for a long weekend of SCUBA diving at Cobalt Coast. The trip was all about the diving so I had not given the resort much thought prior to arriving. I was very pleasantly surprised to discover that Cobalt Coast provides much more than just basic accommodations for divers. While there is no mistake that the onsite DiveTech operation is very good and the house reef is spectacular, there is much more to enjoy at this resort. The entire property is very clean and the staff members make you feel at home. Arie, Dora, Mike and Raju knew our names after the first day and always went out of their way to make sure every whim was addressed. I am fairly difficult to impress with hotel restaurant food. The variety, taste and value of all the meals we had at the resort were nothing less than phenomenal. I highly recommend the dive, meal and drink packages. They are well worth the price. You won't be disappointed. This is a great place to stay regardless of whether you plan to dive a little, a lot or not at all. The resort is located a few miles north of George Town center and away from the shopping areas that get crowded when several cruise ships port at the same time. This fit well with my plans but you will have to rent a car (roughly $40 US per day) or take a taxi if you plan to spend time downtown. I never left the resort except to dive. Thank you Arie for the exceptional destination you have created. I have already booked my next visit.", "user": "Kevin W", "date": "November 7, 2012", "id": 144894203}, {"rating": 5.0, "title": "My first choice for any future GCM trips!", "text": "I have been diving for 33+ years and stayed at places ranging from a thatched hut and sharing the accommodations with fruit bats to a beachside villa with private chef. Somewhere toward the top end of the scale you'd find Cobalt Coast Resort and Suites. When comparing value, Cobalt Coast is at the number one position with no one else even remotely close.", "user": "Larry-n-Lorie", "date": "November 7, 2012", "id": 144844853}, {"rating": 5.0, "title": "Couldn't have stayed at a better resort.....", "text": "I was staying at Cobalt Coast with a fairly large group of people on a dive vacation. As timing would have it we arrived on the Saturday (10/20/12) immediately before the effects of Tropical Storm Sandy made shore diving impossible (6-9 foot seas). The dive operation, DiveTech was very accommodating and transported everyone to the leeward beach for boat diving and offered a one-tank afternoon dive on 5 of the 6 days for an extra charge. If you read my review of Living The Dream Divers you'll see that I opted to dive with this other dive operator Wed-Fri for a two-tank excursion rather than DiveTech. Kudos to Greg, Toni, Jeni, Andre, Steve, Stephanie, Ragime, and SammaLamma (Samantha) for a good dive operation that runs like a well-oiled machine. My only suggestion would be that a dive provider that has Tech in its name should offer the Nitrox blend of the divers choice rather than 32% fits all. DiveTech also provides \"lockers\" (plywood constructed stalls with a lock) for those that don't want to carry their equipment back to their room each day.", "user": "Dale C", "date": "October 27, 2012", "id": 143879798}, {"rating": 5.0, "title": "Who Could Ask For Anything More...", "text": "Now back to Cobalt Coast and let me hit the high points (since there are ZERO low points):", "user": "harbormaster999", "date": "October 22, 2012", "id": 143456384}, {"rating": 5.0, "title": "What a great trip!", "text": "- The Inclusive meal plan meant that I had the option of taking all of my meals at the resort, which with the exception of 3 lunches, I did. AJ, the chef, is talented and desires to please. I can say that there was NEVER a meal placed in front of me that was nothing short of fantastic! I also never heard a single complaint or even a whisper that a dish was mediocre. Our group even asked AJ if he could prepare something from his native India and on the Friday before departure the evening meal \"Special\" was the most delightful Tandoori Chicken Masala. Joseph, the prep cook and pastry chef even made Coconut Cream Pie three times during the week based on a special request from me. If you see it on the menu, grab it! The NY Strip was a favorite and even with a $5 upcharge for the entree it was well worth it. Flavorful, tender, juicy, and cooked to perfection. I tried many things on the menu and also from the daily specials offered and nothing fell short of a very high expectation.", "user": "deedarmyers", "date": "October 15, 2012", "id": 142915833}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "We have just returned from a 6 night stay a Cobalt Coast. We had a 1 bedroom ocean view room, and took the dive package. While it may seem impossible that the resort could possibly be as good as all the positive reviews indicate, believe me, it is.", "title": "Perfect Vacation for Divers", "helpfulness": 2, "user": "Ate22", "date": "January 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 149207644}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled with friends", "text": "Without a doubt Ari and his staff genuinely want to make your stay as comfortable and enjoyable as they possibly can. From the breakfast staff (who happily brought our 11 year old daughter freshly baked muffins every morning) to every other employee you come across, everyone is so incredibly friendly and wanting to make your vacation as perfect as they possibly can.", "title": "Wonderful 40th birthday celebration", "user": "amy_ammo", "date": "January 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 149119563}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "We have been lucky enough to stay in some wonderful hotels over the years, but there have been few stays where we have felt so relaxed and welcome. Our room was bright, comfortable spotlessly clean and the ocean view was stunning.", "title": "We will be return guests", "user": "EandN P", "date": "January 1, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 148494896}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "We loved that the property is away from the hustle and bustle of Seven Mile Beach. However, it is easy enough to travel around on the great local bus service which is not only really cheap, but also great fun.", "title": "Best of the best", "helpfulness": 4, "user": "dczhw", "date": "December 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 148392682}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled solo", "text": "We dived with DiveTech - excellent dive operation who took us to the most amazing dive sites.", "title": "Arrive as a guest, leave as a friend", "helpfulness": 3, "user": "AuntieVal_12", "date": "December 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 147771100}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "From making our reservations, with the assistance of Kirsten, to the farewell hug from Arie, the owner, we found this to be an excellent choice for us.", "title": "Content at Cobalt Coast", "helpfulness": 2, "user": "SeeLife", "date": "October 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 142911204}, {"rating": 5.0, "title": "cobalt coast resort grand cayman", "text": "We arrived after the scheduled lunch time. Lunch was held for the two of us.", "helpfulness": 1, "user": "mark c", "date": "October 14, 2012", "id": 142806459}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "Speaking of the meals, we found them to be consistently good. The menu was varied to please different tastes. The chef was accomodating of special diets and requests. The staff were friendly and proficient. Special thanks to Sherma, Kym, and Sharon.", "title": "We will be back", "helpfulness": 2, "user": "vacati0n2009", "date": "October 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 142548966}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with friends", "text": "Our ocean front suite added a bit to our \"dive package\" cost, but was well worth it. The suite was open and airy. The air conditioning kept us comfortable. Houskeeping kept us clean and tidy.", "title": "Great time with Cobalt Coast and Dive Tech", "helpfulness": 3, "user": "Garyh127", "date": "September 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 140205502}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "DiveTech, the shop connected to the resort is A+ in service and safety. Divemaster to divers ratio was small on all dive trips, making for comfortable diving for both divers with less experience and those who were advanced. A special thanks to Jo, our divemaster and boat captain for most of the week.", "title": "Treated like a long lost friend", "helpfulness": 1, "user": "scubaDr", "date": "September 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 139526566}], "location": {"country": "Caribbean"}, "stars": 3, "variance": {"poor": 8, "average": 2, "very good": 38, "terrible": 1, "excellent": 213}, "aka": "Cobalt Coast Hotel Grand Cayman", "slim_ranking": 0.235294117647, "description": "Located in a residential area in Grand Cayman's north shore, Cobalt Coast offers oceanfront lodging. Cobalt Coast has a full restaurant and bar and dive center Divetech on-site."}