{"user_rating": 4.5, "review_count": 1209, "name": "Cocobay Resort", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "What we liked (loved):", "title": "Beautiful, quiet retreat for couples!", "helpfulness": 3, "user": "KatyAggieMamma", "date": "June 17, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 3.0, "rooms": 5.0}, "id": 32548919}, {"rating": 5.0, "stay_parameters": "Stayed June 2009", "text": "-Location: it felt secluded but was only 20 minutes from St. Johns and 5 minutes from shopping/ATM at Jolly Harbor", "title": "Fantastic resort", "helpfulness": 2, "user": "1gruesome", "date": "June 14, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 32283062}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "-Rooms: the cottages are rustic but very comfortable. Balcony with hammock was AWESOME. Air conditioning was not missed.", "title": "Amazing babymoon", "helpfulness": 4, "user": "GemimaM", "date": "May 28, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 31017873}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "-Grounds/Landscaping: lots of lush vegitation and beautiful flowers. Well-maintained.", "title": "Total heaven!", "helpfulness": 3, "user": "Thenewmrsbowen", "date": "May 25, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 30713196}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "-Size of resort: we liked that there were only ~50 guests.", "title": "Fantastic place, beautiful wedding - could not fault it!", "helpfulness": 6, "user": "k9742700", "date": "May 20, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 30352962}, {"rating": 1.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "How Virgin rate this hotel as 3+ is beyond me. Right from the time you enter the site via an unmade track full of large potholes you just know that this is not going to be good. Well you won’t be disappointed! its worse IMHO. The cottage allocated was a good 250 yds accessed via a very up and down narrow path, that’s 500 yds for each round trip to and from the cottage! The cottage itself was OK, clean and reasonably presentable, the bed was OK. A lovely balcony, pity that the sun only shined there for about 1 hour in the mornings! The food, breakfast's were OK lunch got more unpalatable as the week went on, Dinner went the same way, at best unpalatable at worst inedible. You just knew what you were going to get the next by what you had the day before only warmed up and still unpalatable IMHO. In the past we have enjoyed caribbean cuisine as very tasty a colourful unlike this hotels food sometimes very “Hot” but bland and “brown”. Don’t get me started on the wine, Argentinean plonk, on day 2 we asked for a bottle of rosé on the wine list only to be told that that it out stock and day 3, day 4 5 6 7 8 etc so it was local beer or rum punch from then on.", "title": "Worst holiday ever", "helpfulness": 4, "user": "ColinandDawn", "date": "April 16, 2009", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "location": 1.0, "service": 2.0, "rooms": 3.0}, "id": 28147411}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled with friends", "text": "We did meet some nice people and the time spent away from the \"hotel\" was enjoyable, the catamaran trip around the island and the jeep safari was very enjoyable.", "title": "If you're looking for a perfect Caribbean beach and a room with a view, don't hesitate", "helpfulness": 1, "user": "Stacey1973", "date": "April 15, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 28082612}, {"rating": 4.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "We didn’t enjoy the normal weather that one expects in Antigua for the month of March with a very unseasonable tail end of a tropical storm which all but prohibited any reasonable use of the beach. The “beach” a strip of sand approx 20 yards wide and about 20o yards long which was not particularly clean and we saw no real attempt to clean it up during our stay. With the wind that we were experiencing and the dome shaped beach by the time you lathered up with sun tan lotion and sat down you became an instant piece of sandpaper. I know that the weather is no ones fault and you just have to get on with whatever is presented but the small size of the “Pool” area where else does one go. The “Pool” would be nice if you could imagine nice teak wood planking, a Jacuzzi each end of the decking and at least twice the size, what you got was some gnarled old wood planks which were almost rotten with bad joints and nails sticking up and repaired splices which didn’t match the thickness of the adjacent planks and the wooden loungers that had seen better days, I don’t mind “rustic” but the condition of the pool and its surroundings defied the meaning of the word! Basically the pool area is just not big enough for 49 cottages and 4 Plantation houses and their occupants when there’s is nowhere else to go, like when there’s is inclement weather.", "title": "Good hotel, friendly staff, great location but decor a bit tired", "user": "davidfife", "date": "April 10, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 3.0}, "id": 27746763}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "The staff were reasonably pleasant but their attitude was standard Caribbean laid back and fairly typical.", "title": "Million Dollar Views on a budget", "helpfulness": 5, "user": "SouthernBelle50", "date": "April 7, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 27614365}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "All round there is no way we could recommend this hotel to anyone and we remain very disappointed considering the cost involved, I believe Virgin should give this hotel a miss in their next brochure.", "title": "Little bit of Heaven on Earth", "helpfulness": 1, "user": "LTaylorHants", "date": "March 27, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 26931240}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "This is an ideal place to get away from it all. The individual cottages are basic, but they've got everything you need including a little fridge and a hammock on your veranda to chill out in and watch the amazing sunsets over the sea. You'll share your cottage with the wild life and if you're a light sleeper take ear plugs as the tree frogs, birds and insects get quite loud once the sun goes down. Also take the strongest mosquito repellent you can find with a high percentage of DEET and lots of it. You'll need it.", "title": "Wonderful Location & Hotel", "helpfulness": 4, "user": "Bigbluesquare", "date": "July 10, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 34383011}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "The location is perfect with great beaches and snorkelling so close by and lots of other beaches only a short drive away. The hotel staff and facilities are excellent with a fantastic all inclusive restaurant serving a very adventurous and fresh menu. Great house red and white wine as well and no lack of it. There are no children as guests.", "title": "Nice resort", "user": "Novadz", "date": "July 9, 2009", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "location": 5.0, "service": 3.0, "rooms": 3.0}, "id": 34347576}, {"rating": 3.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "The hotel pool is an infinity pool with the phenomenal views from it. From the hotel you can book out kayaks, snorkelling gear and two person boats for free. You can kayak across the bay to your own private beach which takes about 45 minutes each way.", "title": "fair to middlin'", "helpfulness": 1, "user": "mimimck", "date": "July 9, 2009", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "location": 4.0, "service": 2.0, "rooms": 4.0}, "id": 34313170}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "To explore the island you will need to hire a car/jeep. Driving in Antigua is entertaining and I strongly recommend taking out the full damage waiver. If you are in a collision the police are very thorough and the car hire firms very relaxed. Antigua is surprisingly expensive as well so if you're out and about and not eating at the hotel plan on East Caribdean Dollar equivalent of between £5 to £8 sterling for a sandwich and a drink.", "title": "Excellent location", "helpfulness": 1, "user": "cnygaard", "date": "July 5, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 33938477}, {"rating": 5.0, "stay_parameters": "Stayed June 2009", "text": "Avoid the weekly evening Shirley Hights 'Party' as it is just a tourist trap. There are plenty of parking spaces if you want to drive yourself, but we thought there would be some great local bands and a chilled out atmosphere and instead it was just a cover band, over priced food and loads of tourists. Go to Shirley Hights during the day instead for the amazing view.", "title": "Tropical Island Paradise", "helpfulness": 1, "user": "LozSLongLawford", "date": "June 22, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 32918587}, {"rating": 4.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "I think its important to realise that this resort is not a lively resort full of games and music. It does exactly what it says on the tin providing a quiet, relaxing time with absolutely gorgeous views and the food is in my opinion good.", "title": "Gorgeous Views and Relaxing Quiet Place!", "helpfulness": 4, "user": "pcater", "date": "May 17, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 3.0, "service": 4.0, "rooms": 3.0}, "id": 30145136}, {"rating": 4.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "The transfer from the airport was provided by taxi, which takes you through St Johns and out towards Jolly Beach. We were welcomed with towels and Rum Punch, much needed after the rather slow customs lines at the airport (3 airlines landed at the same time and the queues were the longest I have ever seen in the Caribbean). Anyway nothing to do with the resort which we thought was fantastic.", "title": "5 star views 3 star service", "helpfulness": 4, "user": "cs82685", "date": "May 11, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 2.0, "rooms": 4.0}, "id": 29782157}, {"rating": 4.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "Rooms", "title": "Incredible views...service could use a revamping!", "helpfulness": 5, "user": "Laura7818", "date": "April 28, 2009", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 5.0, "service": 2.0, "rooms": 4.0}, "id": 28970260}, {"rating": 1.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "We had Room No 3, right on the edge with unobstructed views across the bay towards Jolly Beach and the Cocos Resort. The views are awesome and calming with privacy on your terrace making you think you are on your own. We had a Plunge Pool but I would not say they were essential, the air conditioning was welcoming (and I believe they are fitting all romms with air con soon) and the ceiling fan was one of the quietest and non wobbly fans I have ever seen. Nice to leave it on all night. The rooms are basic, wooden interior and the bed large (but have had bigger). The bathroom is large with double sinks and a large shower area. We could have done with more drawers as we were staying for 2 weeks and probably brought more clothing than guests staying 7 days.", "title": "Stay away!!!!!!!", "helpfulness": 6, "user": "pmyersdata", "date": "April 23, 2009", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "location": 3.0, "service": 1.0, "rooms": 1.0}, "id": 28633340}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "The Mosquito net we used each night, but I actually did not see many of the \"buggers\", but they must be about as we did get bitten. But I don't think it was in the room. We also don't believe we got bitten as badly as other countries we visited! (Although my wife will say otherwise!)", "title": "A wonderful place, couldnt fault it!", "helpfulness": 4, "user": "jody09", "date": "April 21, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 28513347}], "location": {"country": "Caribbean"}, "stars": 3.5, "variance": {"poor": 43, "average": 74, "very good": 273, "terrible": 50, "excellent": 769}, "aka": "Cocobay Hotel", "slim_ranking": 0.4, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.0, "location": 5.0}, "description": "A colorful collection of quaint wooden cottages set on a breezy hillside bordered by three white sand beaches, Cocobay offers quiet relaxation and privacy in a rustic, romantic setting. The 49 cottages and 4 plantation houses each boast large verandahs with easy chairs, hammocks and striking sea views. Rooms include hand made wooden furniture, ceiling fans, mini fridge, shower, hair dryer, coffee maker and in-room safe. Seafront rooms include air- conditioning and private plunge pools."}