{"user_rating": 5.0, "review_count": 207, "name": "Cocotal Inn & Cabanas", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "Stayed here for 4 nights in September while vacationing with my husband. What a great find! The apartment we stayed in was right by the pool and it was spacious, comfortable, private, and well equipped. We arrived to the water taxi terminal and although our driver was late it was actually quite fortuitous because we were approached by a tour guide who offered us an all-day snorkeling tour, including lunch, for a reasonable price (after some negotiation). We stopped by the store on the way to the Inn and we certainly would’ve bought groceries had we been staying longer or not been interested in eating as much Belizean food as we could.", "title": "Great value but secluded", "helpfulness": 1, "user": "LuvSLO", "date": "November 15, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 145485807}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled with family", "text": "We arrived to Cocotal, were given keys to our apartment, briefly oriented with the property, and commenced with checking out our accommodations. The human interaction bascially ended there. We didn't really see any staff or even get properly checked in until we needed to check out.", "title": "Geat Amenities, Great People at Cocotal Inn!", "helpfulness": 1, "user": "Colleen S", "date": "November 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 144800816}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "The room we stayed in was huge! We were pleasantly surprised with the amount of space and how well appointed the unit was. There was a large fresh water dispenser, large and fully-equipped kitchen, couch, dining table, television, huge bathroom and comfortable sized bedroom with plenty of storage areas. The bed was comfortable and the A/C in the bedroom was heavenly.", "title": "Our second stay", "user": "RediscoveredMan", "date": "November 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 144651426}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "We made good use of the bikes while there but unfortunately some of the tires went flat while we were riding, which made for a long walk back to the property so make sure to fill them up before you leave. Regardless, it’s such a fun activity to ride the bikes along the beach and soak in the warm, salty air and beautiful sunsets. We took daily dips in the pool and enjoyed many sunsets on the pier out front of the property.", "title": "A great place with tons to do", "helpfulness": 1, "user": "mpkow", "date": "October 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 142521103}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "My biggest complaint about Cocotal is the location. It’s simply too far from town if you don’t have a golf cart. We are in-shape, active people and opted to take the bikes into and out of town every day. After a long day in the sun though, riding 2 and a half miles back to the property is pretty tiring. And worse, if you want to go back into town for dinner (since the dining options in the off-season near Cocotal are limited) you are faced with another 5 mile roundtrip ride. It’s best to either suck it up and rent a golf cart or stay closer to San Pedro if you intend to go to the center often. However, if you are looking for seclusion and have a stocked pantry for cooking in the unit, this place is heaven.", "title": "Great Choice", "helpfulness": 1, "user": "IreMuse_27", "date": "September 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 141019320}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "We spent 14 nights in a very comfortable cabana. The only thing we lacked was a second chair to sit and read in; which they immediately provided us. The kitchen allowed us to cook all our meals and we enjoyed having access to the gas BBQ. We took advantage of the free kayaks and bikes nearly daily. We enjoyed being away from the noise and crowd of the city, but with easy access via bikes. We will be back.", "title": "super", "helpfulness": 1, "user": "cindy5050", "date": "May 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130600646}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "Love, love, love Cocotal! My husband, myself and a friend stayed in the yellow and red garden cabanas. Both were even better than we pictured. There is a small kitchen in the cabanas that came in very handy. We loved having our morning coffee at the end of the pier. The beauty and intimacy of Cocotal was exactly what we were looking for! The grounds were lovely and the staff were stellar! Ernesto helped us set up our excursions and he always went the extra mile to book our tours. We enjoyed the use of the free kayaks and bikes. As other reviewers have written, be sure and kayak out to the reef as the snorkeling was pretty good. We biked to San Pedro (stunning) and in the opposite direction (North) and there is nowhere we would rather stay than Cocotal. We also went to the Chicken Drop at the Wahoo Lounge which was great fun! My husband won $25! We never vacation at the same place as there are so many countries we want to see, but we would return to Belize and Cocotal in a heartbeat! What a special place!", "title": "Simply Lovely!", "helpfulness": 2, "user": "SWshred", "date": "May 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130122173}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "I am a cautious person by nature. I am pessimistic and painfully aware that too-good-to-be-true will usually let you down. I brace myself for the worst even after preparing my best. And yet, I look forward to each new adventure like a young pup with its whole life ahead.", "title": "Want: A Moment in Time.", "helpfulness": 4, "user": "Christina C", "date": "May 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 129951035}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "We first stayed at Cocotal in August 2009. It was the last thing I did before starting law school. And the memories of white sand beaches, tranquil blue waters and scuba diving kept me going through the dark days of the California Bar Examination. It was the best vacation I had ever experienced.", "title": "Great Place, just what you want!", "helpfulness": 2, "user": "littlered007", "date": "May 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 129762290}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "Our most recent trip was in December 2011. I just received my Bar Examination results and this trip was either going to be a celebration or a consolation. It turned out to be a celebration. I convinced my now-fiance and parents that we needed to go to Belize. We needed to go back to a place where I felt safe, secluded, unplugged, but not isolated. We needed to return to Cocotal Inn. In these clear, blue waters I found the closest thing to bliss. At this Inn, it felt like I was returning home.", "title": "Beautiful Garden Cabana", "helpfulness": 2, "user": "andy t", "date": "May 8, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 129616460}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "We had a wonderful 10 nights at Cocotal. Just far enough away from town to avoid the hustle and bustle yet close enough to walk or ride bikes for meals, groceries and discovering San Pedro. We stayed in the newest of the three Cabana’s on the lagoon side of the property for 8 of the 10 nights we were there.. It was absolutely perfect inside. The kitchen was all you could possibly need, the bed the most comfortable of any I’ve slept in on numerous trips to Central America. Outside was hot and still, with little breeze (bring lots of bug spray) so we spent our time at the palapas by the beach, the covered pier, the pool and the honor bar. I had wanted to book our stay in the Casita right on the beach but in was only available for 2 nights in the middle of our stay. So we packed up and moved for the 2 nights. Calvin hauled our luggage back and forth. The Casita was fantastic, smaller kitchen that the Cabana but sufficient for our needs. There is a nice wicker sitting area inside and a covered porch to relax and watch the ocean and world pass by. Bikes and kayaks are provided and we made use of both many times. You can kayak out to the reef and tie up to a buoy and snorkel. Raul and Calvin were wonderful and took care of every need we had. The grounds are neat and everything was very clean. We did several snorkel trips with Yemen at White Sands Dive Shop next door, small boat and intimate service. Great Time! This review would not be complete without mentioning Mara the resort dog. She went for walks, for dinner and even slept over. Felt like home ", "title": "Total Relaxation", "helpfulness": 4, "user": "HeidiHeidiVixen", "date": "July 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 134451752}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "We stayed in the ocean front casita for a week and had an amazing time. We were glad we chose to stay on the north end of the island as we found the town of San Pedro to be hectic. Jesus picked us up at the airport and gave us a great tour telling us places to go and stopping at the grocery store. The casita had everything we needed and was spacious. We were able to cook meals and really enjoyed sitting on the front porch enjoying the beautiful view. We used the bikes provided to ride everywhere. Our favorite place to eat was Ak'Bol. That had some outstanding food with outstanding prices. Try the stuffed fry jacks and salbutes! I may need to return just to eat there. Take plenty of the bug spray, as the mosquitos and no see ums were really bad at dusk and when the wind was not blowing. Take half of the items you packed as you will not need them. I would not hesitate to stay here again.", "title": "Outstanding Stay", "helpfulness": 2, "user": "mocha2", "date": "July 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 134178257}, {"rating": 5.0, "title": "Great place to stay..will return.", "text": "Really cannot say enough about our stay at Cocotal. From our peaceful taxi ride from the airport - they set it up - with Jesus, who took us to the grocery store before we arrived at the inn, to Raul our groundsman who provided us with bikes and Kayaks - they are included with your stay - and gave wonderful advice as where to eat, to Estephan our manager who made each of our request come to light, we had an enjoyable, adventurous and relaxing stay. This is one of the best combinations of value and service I have experienced. Cocotal works with the White Sands Inn next door to help your fishing, scuba and snorkeling desires a reality as well. We stayed in one of their Cabanas and both I and my new wife enjoyed the king sized bed, the masterbathroom and kichenette that each are appointed with. Personally, I think that they are located in the best place to take advantage of Ambergris Cayes's solitude and sporting oportunities. You can even kayak out to the reef and snorkel from their pier.", "user": "Charles S", "date": "July 11, 2012", "id": 134070056}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "We found Cocotal to be a perfect fit for our vacation. We were pleased that there can only be a small number of guests at any given time, so crowds are never an issue. It's far enough from the noise and crowds of San Pedro, but close enough by water taxi, bicycle, golf cart or cab to be convenient should you need to go into town. The accommodations are excellent. We stayed in a garden cabana and quickly decided that we would be able to live there permanently. The cabana is equipped with absolutely everything you could possibly need for a short or extended stay. The grounds at Cocotal are beautiful and meticulously maintained. There is a nice pool area and honor bar as well as a pier extending into the Caribbean Sea. We took advantage of the on-site kayaks and bicycles. In addition to the amenities, location and natural beauty that make Cocotal the top destination on Ambergris Caye, the staff is also top-notch. Ernesto and Adelita in the office kept everything running smooth. On several occasions we asked Ernesto to help us plan day trips and every time he went above and beyond our expectations. Raul, the resort's caretaker was busy from dawn 'till dusk, but always made time for a smile or to answer any questions we had. He always seemed glad to see us. Calvin and Ramiro work tirelessly to make sure that the buildings and grounds keep their immaculate appearance. Our cabana always looked like a model home when we returned in the evening thanks to Duny and Stephanie. And of course, since we missed our pets during our stay, Mara the resident dog volunteered to be our surrogate pet for the duration of our stay. Individually and as a group, they made sure we had a very memorable trip. We couldn't have asked any more of them", "title": "Best of Ambergris Caye", "helpfulness": 2, "user": "Dan H", "date": "July 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 133309559}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "There are lots of places to stay on Ambergris, but for us, Cocotal is the only real choice. Can't wait to return.", "title": "Cocotal Inn was GREAT!", "helpfulness": 1, "user": "Lary B", "date": "July 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 133273878}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "If you want a spa, restaurant, dance floor with a dj, loud music and a hotel-like atmosphere, DO NOT stay at Cocotal. If you are looking for an authentic island experience, replete with a cool beach vibe, fresh water pool, well-eqipped casitas and the best \"camp dog\" ever--stay at Cocotal! It is within walking distance to Capricorn and Ak'Bol and you can go directly next door to White Sands for tours and scuba. The staff is second to none and will get to know you by name. If you are REALLY nice and lucky, maybe Raul will give you his recipe for a really mean rum punch! Stay here for the most wonderful Belize vacation you could ever hope for.", "title": "Very Special!", "helpfulness": 2, "user": "Beth K", "date": "June 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 133141136}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "Stayed here for 10 days for our honeymoon, stayed in number 1 cabanna, closes to the beach.", "title": "Paradise! This is the best in San Pedro.", "helpfulness": 2, "user": "scotslass007", "date": "June 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 132523891}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "Stunning location and very peaceful at the same time, its 2.5miles into San Pedro town which takes 10 minutes by bike (complimentary from cocotal)", "title": "Casita is idyllic", "helpfulness": 2, "user": "MinnesotaPT", "date": "June 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 132368368}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "There are a few good restaurants either side of Cocotal Capricorn being one of those. This is where Cocotal is different from other places, it has amenities roundabout it.", "title": "Ambergris Caye’s best kept secret!", "helpfulness": 3, "user": "Gge0rge", "date": "June 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 131102786}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "The room was beautiful and comfy with fans and air con unit to keep us cool. It had everything needed to prepare a quick and easy meal.", "title": "Paradise", "helpfulness": 3, "user": "Kim B", "date": "June 1, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 131072359}], "location": {"country": "Belize", "region": "Belize Cayes", "continent": "Central America"}, "variance": {"poor": 0, "average": 0, "very good": 17, "terrible": 0, "excellent": 190}, "aka": "Cocotal Inn & Cabanas Hotel San Pedro", "slim_ranking": 0.1, "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.5}, "description": "Cocotal Inn and Cabanas is a beachfront vacation property located 2- 1/2 miles north of San Pedro. There are five units available for nightly rental. Intimate and low key, Cocotal is still only a bike ride from town in a great up and coming area. Our units are well appointed with fully equipped kitchens, air conditioning, cable TV, and maid service. There is an in-ground pool, honor bar, BBQ, and free bicycles and kayaks for guest use - a beautiful property and a great value! This description is based on information provided by the specialty lodging."}