{"user_rating": 4.5, "review_count": 1555, "name": "Colonnade Hotel", "reviews": [{"rating": 1.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "This is one of the worst hotels I have ever stayed. The bed spread had holes, rooms were stinky and bathroom was falling apart. Stay away unless they are charging $90/night as location under $100 is worth it. I would never stay or recommend.", "title": "More like Days Inn than 4 Star", "user": "Formula1Champ", "date": "August 13, 2007", "detail_rating": {"front_desk": 3.0, "service": 2.0, "cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "location": 5.0}, "id": 8407239, "likes": {"liked": "— Location", "disliked": "— Everything about the room"}}, {"rating": 3.0, "stay_parameters": "Stayed July 2007, traveled on business", "text": "The Colonnade is clearly a hotel in a period of transition and renovation. I stayed at the hotel in July for a conference, and right away I noticed that there was a lot of change going on, as the check-in was set up on some folding tables by the entrance, because half of the lobby was tarped over.", "title": "a hotel in transition", "helpfulness": 1, "user": "davidbruce", "date": "August 8, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "location": 5.0, "rooms": 4.0}, "id": 8373624, "likes": {"liked": "— Nice, quiet, newly renovated room.", "disliked": "— Restaurant/bard"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled with friends", "text": "I was pleased with my room, which appeared to have been recently renovated - and nicely. The room had stylish new furniture and furnishings, a big flat screen TV, a comfortable bed, wonderful new linens, and lots of quiet. However, several of my colleagues had one of the pre-renovation rooms, and they were furious when they saw my room. Their furnishings looked like something out of a 1960s-era motel, with a tiny little old TV, worn-out linens, etc. They didn't even get the same high-end towels and toiletries that I got. So if you're staying at the hotel during this transition period, be sure to request one of the renovated rooms. Otherwise, you'll end up paying a four-star price for a one-star room and will be as upset as my colleagues were.", "title": "Great hotel.", "user": "Tom M", "date": "July 23, 2007", "detail_rating": {"front_desk": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 8221989, "likes": {"liked": "— Location", "disliked": "— The AC was ok. Not very cold."}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled with family", "text": "Other notes: The hotel gym was smallish bt adequate. It too seemed to be recently renovated, with brand new equipment, flat screen TVs, etc. But I'd suggest avoiding the hotel restaurant and bar. The food was so-so, the waitstaff was rude, and the bar area is tiny, rundownd and in desperate need of its own renovation.", "title": "Had a great time", "user": "winniemartin", "date": "June 18, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7873393}, {"rating": 2.0, "stay_parameters": "Stayed June 2007, traveled on business", "text": "I should also add that the Colonnade is in a great central location, within walking distance of many Boston attractions, shopping, etc.", "title": "Bait and switch", "helpfulness": 1, "user": "vivigogo", "date": "June 4, 2007", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 3.0, "cleanliness": 5.0, "value": 2.0, "location": 5.0, "rooms": 2.0}, "id": 7757014, "likes": {"liked": "— location", "disliked": "— quality"}}, {"rating": 1.0, "stay_parameters": "Stayed May 2007, traveled on business", "text": "I have to say that I cannot understand how anyone could give this hotel a good rating. The decor is horribly outdated, everything is old and the musty smell meets you at the front door. We stayed one night. The air conditioning gave off a terrible musty smell, and we could not turn it off. Luckily we could open the windows (which was very dangerous for kids as the windows are only 2 feet from the floor). We gladly exchanged the noise from the traffic for some fresh air. Our room had moldy plaster over the bed. The bathroom fixtures were probably nice in 1971. The TV was very small. This is not a 4 star hotel. On the positive side, it is near the T station, and the towels are new. Some of the rooms appear to be updated, but I don't see how you can avoid the smell from the air conditioning. I was going to give it 2 stars, but that means \"okay but some problems\" and it was not ok. Not at all!", "title": "2 star hotel at 4 star price", "user": "Noreen2007", "date": "June 2, 2007", "detail_rating": {"cleanliness": 2.0, "front_desk": 3.0, "value": 1.0, "location": 5.0, "service": 3.0}, "id": 7742182, "likes": {"liked": "— Location", "disliked": "— Very old and run down throughout the property"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled with family", "text": "I was pleasantly surprised by the Colonnade Hotel. Yes the rooms are small, and the hallways are dark, but the current renovations of the rooms have resulted in modern-style, boutique-type amenities. (I believe they are still renovating- we stayed on the 10th floor.) The beds were comfortable, the sheets soft, and the furniture new. The staff are completely friendly and helpful, and the location is hard to beat- right in front of the T line and adjacent to the Prudential Center and Newberry Street shopping.", "title": "Solid stay at the Colonnade Hotel", "user": "cdlc", "date": "May 19, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 7646062, "likes": {"liked": "— Newly renovated rooms", "disliked": "— No view from room, facing an adjacent building"}}, {"rating": 2.0, "stay_parameters": "Stayed April 2007, traveled on business", "text": "The room service (breakfast) came quickly, the coffee hot, and the pastries delicious. Brasserie Jo, the restaurant in the lobby is also great for lunch.", "title": "Get your money's worth somewhere else", "user": "aeb88", "date": "April 24, 2007", "detail_rating": {"front_desk": 3.0, "service": 2.0, "cleanliness": 4.0, "value": 1.0, "rooms": 3.0, "location": 4.0}, "id": 7428830, "likes": {"liked": "— Doormen were really friendly and helpful.", "disliked": "— Management's unwillingness to turn on the air conditioning."}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled on business", "text": "We paid a steep price (about $330 per night) since we were there during gradution season-- it's definitely worth it if you can find a hotwire deal (as mentioned in other reviews).", "title": "Marble bathroom plus rubber ducky", "user": "Lost_in_Pittsburgh", "date": "April 20, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 5.0, "rooms": 5.0}, "id": 7405362, "likes": {"liked": "— Friendly staff"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled with friends", "text": "Four stars because of the small rooms and bathrooms.", "title": "Colonnade OK", "helpfulness": 1, "user": "Traveldiva81", "date": "March 20, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 3.0}, "id": 7196067, "likes": {"liked": "— The location.", "disliked": "— The rooms were a bit dated, but very clean."}}, {"rating": 1.0, "stay_parameters": "Stayed September 2007, traveled on business", "text": "Although our group of 8 arrived at the same time, some of our party received \"renovated rooms\", while the other half got stuck on the outdated, musty, woefully inadequate green carpeted side. No better than a 1-star motel, for $500/nite I was tortured to 70's stank carpet, hard bed, lumpy pillows, thin bedding, noisy street, grey towels....and SOMEONE ELSE's HAIR on my sink. I asked to be moved 3 times, and never was satisfied with the condition of the rooms. Although my colleagues slumbered in renovated loftiness, all I can say is that I hate this hotel. Who doesn't have coffee makers in the rooms anymore???", "title": "This rubber ducky is SUCKY", "helpfulness": 4, "user": "keryninbali", "date": "September 25, 2007", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 2.0, "cleanliness": 1.0, "value": 1.0, "location": 4.0, "rooms": 1.0}, "id": 10001558, "likes": {"liked": "— location", "disliked": "— rooms"}}, {"rating": 3.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "It seems as if The Colonnade is trying rest on the fact that it is a good location. If I had booked a room at the Ramada or some other mid-scale hotel, I probably wouldn't have been too dissappointed. But when a hotel advertises itself as upscale and luxury, my expectations grow a little.", "title": "Hard to Recommend The Colonnade", "helpfulness": 3, "user": "dever", "date": "September 17, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 2.0, "rooms": 2.0, "location": 4.0}, "id": 8738679, "likes": {"liked": "— location", "disliked": "— value, not what I expected, lack of up-keep"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled solo", "text": "The positive -location, as every other reviewer wrote. Real convenient to just about anywhere you need to get to. But at some point you have to return to the room you paid a nice little sum for.", "title": "Good all round choice", "user": "sold", "date": "September 12, 2007", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 3.0}, "id": 8703178, "likes": {"liked": "— Pool", "disliked": "— Bland corridors"}}, {"rating": 3.0, "stay_parameters": "Stayed August 2007, traveled on business", "text": "This hotel is going through a renovation. Good thing. When I called to confirm my reservation, the man said renovations would begin again in the spring, which means half the hotel is renovated. I also requested a renovated room(after reading other reviews), since my wife and were getting away for an anniversary trip weekend. The gentleman said it shouldn't be a problem, and made note of it. I was excited. Until check-in, when the girl at the front desk(who could use a little more enthusiasm when talking with guests) told me it would be an extra 60.00 a night for the newer rooms.", "title": "Okay", "user": "cinncitraveler", "date": "September 5, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 8660086}, {"rating": 2.0, "stay_parameters": "Stayed August 2007, traveled on business", "text": "This would be a handy piece of information to have when confirming the reservation. I opted not to upgrade, and in hind-sight, I'm happy I didn't. One of the maids showed us the upgraded room. Same size, just flat screen TV, new linens and carpet. Nothing special.", "title": "Absolutely Nothing Special", "helpfulness": 1, "user": "Melston", "date": "August 24, 2007", "detail_rating": {"front_desk": 2.0, "business": 1.0, "service": 3.0, "cleanliness": 4.0, "value": 1.0, "location": 3.0, "rooms": 2.0}, "id": 8499715, "likes": {"liked": "— well, we had a bed when we thought we might be on the street.", "disliked": "— Spiders. I hate Spiders."}}, {"rating": 3.0, "title": "Lowered Expectations", "text": "If you most highly credit an involved and friendly staff, this hotel provides the goods. Previous comments are on target: ancient hall lighting, some deteriorated bathrooms (peeling ceilings, dirty grout, etc.), dated wallpaper in halls and rooms, limited room storage for clothing, etc. All in, a place aspiring to better things but sadly in need of refurbishment. However, it has a great Back Bay location, adjacency to a T stop, across the street from the Prudential Mall and just 2 blocks from the very upscale Copley Mall, and a solid restaurant in the lobby. The parking charges are dispiriting, at $36 per day, but fully in line with the other indoor facilities nearby. The doorman and concierges were among the most friendly and eager I've yet encountered and the rooms were kept clean. We found the room to be smallish, but very quiet at night (8th floor). A decent choice when discounted rates are offered but not a buy at rack rates over $300 (I paid $135).", "user": "TruthTalker", "date": "February 25, 2007", "id": 6838886}, {"rating": 5.0, "title": "A Confident Hotel", "text": "The Colonnade does not look like much on the outside but inside it is spotless and swish. There is a great air of confidence with the staff. There is no shoulder shrugging here. They know exactly what's' going on and therefore have time to focus on guests.", "helpfulness": 3, "user": "tribesman_76", "date": "February 16, 2007", "id": 6800350}, {"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled on business", "text": "The bar/ rest. is Brasserie Joe's with a hint of a French theme. Again the staff were excellent. Bar had a great range of drinks. It had a good atmosphere at night- lively but with perfect conditions to chat. The burgers there are fantastic, by the way.", "title": "Nice business hotel", "helpfulness": 3, "user": "candice826", "date": "November 21, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 6163024}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "Room was spotless and hallways inviting. In summer there is an excellent rooftop pool with dashing view of the cityscape close-up. Pool is small but the set-up is very relaxing with again great staff and a nice little bar.", "title": "Great Hotel, Excellent Location", "helpfulness": 3, "user": "kirkjshurey", "date": "October 12, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 5945963, "likes": {"liked": "— Quality of accommodation and location", "disliked": "— Poor shower and no tea/coffee making facilities"}}, {"rating": 1.0, "stay_parameters": "Stayed August 2006, traveled on business", "text": "I'll sign off on the staff again. Concierge was fantastic. Loved his job. Apparently the best in the city. Downside, it was hard to leave the hotel to go out!", "title": "Terrible and filthy", "helpfulness": 3, "user": "doc04", "date": "September 21, 2006", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 2.0, "cleanliness": 1.0, "value": 1.0, "location": 3.0, "rooms": 1.0}, "id": 5822514, "likes": {"liked": "— absolutely nothing", "disliked": "— filthy, dirty, old, smelly"}}], "location": {"country": "United States", "city": "Boston"}, "stars": 4, "variance": {"poor": 54, "average": 136, "very good": 388, "terrible": 44, "excellent": 933}, "aka": "Colonnade Hotel Boston", "slim_ranking": 0.194805194805, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 5.0}, "description": "Located in Boston's fashionable Back Bay neighborhood, the hotel recently completed a comprehensive $25 million reinvention. With thoughtful, relevant amenities, the redesigned hotel appeals to the discerning business and leisure traveler. All guest rooms were re-engineered to provide a sophisticated, residential feel with state-of-the-art features. Home to the city's only roof top pool and the award-winning Brasserie JO restaurant, The Colonnade is next door to the Prudential Center and Copley mall and within walking distance of Newbury Street, Fenway Park and the Hynes"}