{"user_rating": 4.5, "review_count": 60, "name": "Coltsfoot Country Retreat", "reviews": [{"rating": 4.0, "title": "Birthday bash with the ladies", "text": "A birthday meal with girl friends was the occasion. We followed very narrow lanes to get to the location and were rewarded with a very beautiful setting, the grounds and buildings are well kept and beautiful, The staff were attentive and the food very good. I struggled to find something on the menu I wanted and the vegetables were a little on the stingy side so we had to ask for more. A relaxed and informal evening in a beautiful setting.", "user": "Suqi", "date": "August 2, 2012", "id": 136029972}, {"rating": 5.0, "title": "Excellent service and the food is 5*", "text": "Coltsfoot is now one of my favorite places to stay, we have stayed here twice before on a dinner, bed and breakfast package which on laterooms is only £139!", "user": "LISA T", "date": "July 17, 2012", "id": 134605292}, {"rating": 5.0, "title": "secluded and private", "text": "The rooms are spacious clean and include toiletries and bathrobes. The road to the hotel is small and windy and at one point you will probably think you are going the wrong way but then the hotel appears and its like WOW. Entry is through electric gates which open as you drive up to them. Loads of parking. The dinner is al a carte which i thought would be fancy small portions...WRONG! There is a good range of starters, mains and desserts and trust me they fill you till bursting point. We ate at 8.30pm and did not want breakfast the next morning as we were too full.We met the chef the next morning and congratulated him on such a fantastic meal (the 21 day aged fillet of beef melted in your mouth)", "user": "crackersX5", "date": "June 25, 2012", "id": 132727752}, {"rating": 5.0, "title": "Delightful stay in the countryside", "text": "On our last stay we did have breakfast which was cooked to order and very tasty. We will be returning to Coltsfoot very soon and would highly reccomend it to anyone.", "user": "Janice M", "date": "June 5, 2012", "id": 131378725}, {"rating": 5.0, "title": "Affordable Luxury", "text": "this hotel was in middle of lush fields and countryside, you would struggle to find it in the dark. Very friendly staff and efficient check in and out, Lots of parking and secure gates so you are quite safe. My room was two storey with a lovely big bathroom. The toiletries were molton brown and I had the choice of shower with jets or a massive bath.Unfortunately i did not have time to enjoy the facilities and the hotel as it was an over night stay for me and i arrived late. However the time i spent there was very relaxing and will definitely go back there. There was a lack of power points near the bed which was an issue for me as I like to charge my phones overnight and set the alarm.", "user": "BarryLM", "date": "March 1, 2012", "id": 125470433}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "Stayed one night on business. Nicely tucked away, rooms were spotless and very well appointed, big beds, large fluffy towels, massive shower and molten brown toiletries. A nice little patio area outside the rooms which are converted barns.", "title": "A great little find- especially at a late deal price", "user": "pugwash4x4", "date": "May 17, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 161007716}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with friends", "text": "Dinner was excellent if a little pricey. Service didn't quite match but it wasn't bad per se- more inexperienced.", "title": "Wonderfully organised wedding in a stunning venue", "user": "Matthew G", "date": "March 30, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 156082098}, {"rating": 4.0, "title": "Lovey old barns made into a stylish hotel", "text": "Would make a lovely wedding venue.", "user": "stephyannis02", "date": "February 14, 2013", "id": 152128337}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "Attended the wedding of a friend here. The whole day was brilliantly organised from start to finish. Food was lovely and staff were friendly and helpful. Room was spotless, comfortable and well equipped. The owner of the venue went above and beyond the call of duty when we got a flat tyre just down the road. He took the tyre away and tested it to see if it could be repaired rather than replacing it and when he found that it couldn't the next morning he drove it himself to a garage in town and brought back a replacement in time for us to drive home straight after breakfast.", "title": "Lovely place for a retreat", "user": "kiki2009", "date": "January 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 150760315}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "Lovely place, very picturesque, friendly staff, quiet location with lovely walks. Was there on a business trip would definitely consider going back on a private trip.", "title": "Absolutely Lovely", "user": "Headbarman", "date": "November 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 145079990}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled with friends", "text": "Recently visited this retreat and it definitly lives up to its name. Very walm welcome and reIlaxing atmosphere. It is an ideal place for couples to have quality time together in a quiet almost secluded enviroment. Rooms,decor, set up is perfect. Photos do not do justice to the comfort experienced! We had a lovely dinner in the restaurant, everything was freshly prepared and the service was excellent. We will certainly return!", "title": "True to its name.", "user": "greengrapevine", "date": "March 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 125434003}, {"rating": 5.0, "stay_parameters": "Stayed February 2012", "text": "A peaceful and small hotel in rural Hertfordshire. Helpful staff. Good food. Lovely room. Check Late Rooms for amazing dinner, bed and breakfast offers.", "title": "Quiet. Rural. And wonderful.", "user": "RDT0204", "date": "February 26, 2012", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 125249230}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "We had our Wedding at Coltsfoot in December 2011. We had an awesome day. We hired the whole venue. Coltsfoot is perfect for an intimate Wedding. The rooms, staff, service, food and bar are exceptional. They also know a lot of local Wedding suppliers that were all fantastic. As it’s a review I thought I would also mention some constructive criticism:", "title": "Winter Wedding - Amazing - However a few pointers.", "helpfulness": 3, "user": "Andy H", "date": "January 7, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 122712587}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "- They have a small marquee/gazebo connected to the venue, this we feel is up all year round (we’ve never seen it down) and is really needed as the venue is not big enough to cater for the numbers they have, it’s also an ideal smoking area. They did try and charge us an excessive amount for having “use” of this, £500, we felt this was totally unacceptable as in our opinion it should be part of the venue, the reason why it is there is because the venue isn’t big enough in it’s current state for the numbers they have. They will argue around this point but I think it’s just an extra way for them to make some hidden charges. I can understand a contribution maybe towards this but certainly not in the hundreds, they also ask if you want the sides down for an extra charge, yadda yadda what ever we shouldn’t be having this conversation with the venue, this was our main cause of contention in the run up to the Wedding and it should not have been.", "title": "Excellent cuisine, lovely location, extremely comfortable", "user": "RedzerH", "date": "November 26, 2011", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121050162}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "- They are not the best at communicating back via email, some emails took 3+ days to be responded to and also we covered the same ground with various points leading up to the day.", "title": "Lovely stay however a few pointers...", "user": "Julie138", "date": "November 20, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 120831917}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with friends", "text": "I have recently celebrated a significant birthday at Coltsfoot Country Retreat. All my 54 guests were very impressed by the venue, the food, the service and the atmosphere! A brilliant night! Thanks to all the staff.", "title": "Brilliant!", "helpfulness": 1, "user": "Glyn D", "date": "September 26, 2012", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "location": 5.0, "service": 5.0}, "id": 141340223}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "Helen, the event coordinator, with Debbie, were excellent; helpful and attentive to my requests and requirements. The restaurant and bar staff were polite, very attentive and I could not have asked for any better service. The food was excellent; thank you Chef!", "title": "Wedding", "user": "ctgi186338", "date": "September 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 141314876}, {"rating": 4.0, "stay_parameters": "Stayed September 2012", "text": "My room was clean and well furnished and fitted. Everything worked. The breakfast was excellent and I had no reason to object about anything. I would, and have not hesitated, in recommending Coltsfoot Country Retreat as a venue for any special occasion. A big 'thank you' to Coltsfoot Country Retreat for making my 'special day' so special!", "title": "Proper countryside", "helpfulness": 2, "user": "Flowerfred", "date": "September 17, 2012", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 140559375}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "We just had our wedding at Coltsfoot It was perfect. The staff were brilliant they did every thing but without any one really being aware they were there. They were helpful polite and did every thing with a smile, Helen the wedding organiser was more than helpful from the run up to the wedding through the wedding and the next morning. The place looked amazing and the food was really good. All the bedrooms are lovely very spacious and the bathrooms are very nice. We have had a lot of comments from guest about what a great venue Coltsfoot is. I couldnt recomend", "title": "Amazing wedding", "user": "reviewhols", "date": "September 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 139089716}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with friends", "text": "it more highly.", "title": "Amazing venue", "user": "Travellingtoes", "date": "August 12, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 136968846}], "location": {}, "variance": {"poor": 2, "average": 6, "very good": 13, "terrible": 1, "excellent": 38}, "aka": "Coltsfoot Country Retreat Hotel", "slim_ranking": 0.5, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}}