{"user_rating": 4.0, "review_count": 107, "name": "Columbus Airport Marriott", "reviews": [{"rating": 2.0, "title": "Has Never Failed to Depress", "text": "I have stayed in this hotel twice for business, most recently in April 2006. The entire place is very blah, very depressing. The layout is so poor that it is a long long walk from the lobby to the rooms, and back again for the conference rooms. Business service is really terrible - both stays, my meeting moved rooms every day, with poor signage and no notice. We were yelled at one day by hotel staff for eating the wrong breakfast, which was outside the meeting room we'd been in the previous day! Speaking of, food was typical hotel bad.", "user": "ennove29", "date": "August 3, 2006", "id": 5553417}, {"rating": 4.0, "title": "Great Service and Staff", "text": "Cellphone service DOES NOT EXIST in this hotel - everybody has to go outside. It's kind of funny, actually, to see 30 sweaty businessmen standing outside, sweating, just to get reception. The workout facilities are not great, and are in full view of everybody in the pool area. The only real positives of this hotel are proximity to Easton shopping center (1 exit away), easy access from the freeway, and consistently good wireless internet.", "user": "A TripAdvisor user", "date": "July 16, 2006", "id": 5470763}, {"rating": 4.0, "title": "'Adequate to Good' for Business Travellers", "text": "My wife and I stayed at the Columbus Airport Marriott recently because our flight arrived into Columbus after midnight. From the time we arrived at the hotel at 1:00 a.m., every interaction we had with staff (check-in, room service call, room service delivery, check-out, etc.) was perfect, as if they were actors in a Marriott corporate customer service training video. The staff and service at this property are consistant with what we would expect at a luxury hotel and we were pleasantly surprised to find it at an airport hotel! The room was clean and we did not experience any challenges or disappointments during our short stay.", "user": "psu0904", "date": "April 22, 2006", "id": 4996189}, {"rating": 2.0, "title": "More like Marri-NOT - business-geared hotel, not for leisure", "text": "I was here for three days for a conference in April 06. Even though I have attended meetings there before, this was my first time as an overnight guest.", "user": "A TripAdvisor user", "date": "June 7, 2005", "id": 3536107}, {"rating": 4.0, "title": "Nice Stay at the Marriott", "text": "The staff was wonderfully courteous - an A+.", "user": "swaninthepark", "date": "February 20, 2005", "id": 3212255}, {"rating": 4.0, "title": "Really Nice Property", "text": "Very quiet for an airport hotel. Nicely decorated room. Property is very modern and nicely decorated. Plenty of free parking. Friendly and attentive staff. Not much in the surrounding neighborhood though (except Waffle House!). Would stay here again.", "user": "Corpuscle", "date": "April 15, 2008", "id": 15069742}, {"rating": 5.0, "title": "Columbus Airport Marriott was Fabulous", "text": "Our son had his wedding reception at the Marriott in October 07. We, as well as many of our friends, were staying from Wednesday until Sunday so we could be part of the pre and post wedding activities -- (we are from N.J.) The accommodations were wonderful and the rooms were immaculate. The lobby served as a very beautiful back drop for the cocktail hour which took place in the center of the lobby. The food at the wedding reception was served attractively and was absolutely delicious. The 10 oz. steaks melted in your mouth and the service was excellent.", "user": "JEFNj", "date": "November 13, 2007", "id": 10792351}, {"rating": 3.0, "title": "Overall - Good", "text": "The bartenders in the area bar in the lobby were always accommodating whether we wanted to grab a bite to eat or we just wanted to join friends and sit around the bar.. I wish I had the name of the female bartender (I think she had a pony tail) who was just so kind to us and whose company we really enjoyed.", "user": "moremonkeykisses", "date": "August 21, 2007", "id": 8463578}, {"rating": 1.0, "title": "Our Prepaid Reserved Room Not Available!", "text": "Breakfast served in the hospitality room was also a very nice touch and the breakfast food was delicious.", "user": "chauncie", "date": "April 26, 2007", "id": 7438189}, {"rating": 5.0, "title": "Can't say enough good things", "text": "Everyone was very accommodating and friendly at the Hotel and if and when I return to Ohio, I would definitely make reservations to stay there again.", "user": "gobethgo", "date": "August 19, 2006", "id": 5626261}, {"rating": 5.0, "title": "Very very Nice and clean", "text": "Just spent two days at the hotel for a wedding.....very nice and very clean best bathrooms ever and the service was excellent and the staff could not have been nice would definitly stay here again.. food was very good.", "user": "Varner", "date": "May 9, 2004", "id": 1900845}], "location": {}, "stars": 3.5, "variance": {"poor": 5, "average": 16, "very good": 28, "terrible": 8, "excellent": 50}, "aka": "Columbus Airport Marriott Hotel Columbus", "slim_ranking": 0.323741007194, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "description": "Stay in the center of it all at the Columbus Airport Marriott, the closest full-service Marriott to downtown Columbus and the airport. With corporate convenience and vacation comfort, Columbus Airport Marriott offers amenities for all guests."}