{"user_rating": 4.5, "review_count": 41, "name": "Comfort Suites Airport", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled on business", "text": "New property, so the room we were in had nice colors, furniture and bathroom. We had a very clean room and the bedding was comfortable. They had airport pickup and the front desk personel were friendly. Our deal came with a breakfast was included in our booking which was a plus. In the morning they served a good breadfast with a variety of fruits, juices, cereals with hot sausage, eggs, waffles. All in all a good deal, nice place to stay!", "title": "Very good value", "helpfulness": 1, "user": "skylane9", "date": "October 2, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 179505558}, {"rating": 5.0, "stay_parameters": "Stayed September 2013", "text": "There is nothing more to say about this hotel but EXCELLENT!! We stay every year for the ASU vs JSU game in nearby Jackson & the hotel is just as well kept & clean as the first year we came. Being a choice hotel Elite Member I wish ALL CHOICE HOTELS would follow this model of spectacular hotel service, & cleanliness! GOOD JOB !", "title": "Great stay", "helpfulness": 1, "user": "Wms06", "date": "September 8, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 176385267}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "I can only second what everyone has written about this hotel! Our room was large, comfortable, smelled clean, and had everything we needed. The breakfast was delicious. We recommend it highly and understand how they earned a \"Platinum Award\"!", "title": "Wonderful Suite Hotel", "user": "Laura E", "date": "September 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 175915805}, {"rating": 5.0, "stay_parameters": "Stayed August 2013", "text": "Everything was wonderful and the proximity to the medical center and airport were perfect. Plus, the area shopping & restaurant choices are amazing too! The TV was a bit comfusing for this technically challenged mama, but my son quickly had us up and running. The cookies in the lobby were a lifesaver at 10pm when I needed a bite, but couldn't eat in front of my little man because he couldn't eat. :-/ Overall, we will definitely stay again. Loved it.", "title": "Was there with my 10yo for a medical procedure at River Oaks.", "user": "MSAshley6", "date": "August 21, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 173358695}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "Recently I stayed at this fabulous hotel in Jackson Mississippi. The entire experience was perfect from start to finish. The hotel is 3 years old, but it looked brand new. The front desk staff was extremely nice and accomadating. The room was large and well apointed with nice bedding, pillows, wall art, etc.The morning we checked out, there was a man working outside cleaning the sidwalks and attending the lush shubbery. If I am ever within a 100 miles of this place again, I will make the extra effort and stay here. I truly can not imagine a more perfect stay. Wish I could give it 10 stars!", "title": "Perfect in Every Way!!!", "helpfulness": 1, "user": "Slm1206", "date": "July 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 166052823}, {"rating": 4.0, "title": "Above Average- Reasonable and Clean", "text": "Good place to stay at a reasonable price.", "user": "MIRay", "date": "September 17, 2008", "id": 20142598}, {"rating": 3.0, "title": "So where is the elevator??", "text": "Positives: Comfy bed; pretty good free breakfast; clean room and bathroom; good water pressure in shower; friendly staff.", "user": "Dendez", "date": "September 10, 2008", "id": 19952594}, {"rating": 5.0, "title": "Definitely Earns an \"A,\" Almost an A+", "text": "Negatives: No elevator; no on-site fitness room; no open electric outlets near desk - a plug strip or lamp with plug would be helpful.", "user": "A TripAdvisor user", "date": "August 15, 2008", "id": 18990970}, {"rating": 5.0, "title": "Great Stay--It Was a Treat!", "text": "We were flying out to Las Vegas at 7 AM and looked for lodging close to the airport with a shuttle service. Comfort Suites provided both, but what sold us was the parking service. We could leave our vehicle at their parking lot up to five days without extra charge and get a shuttle ride back from the airport on the return trip. All in all, it worked out nicely.", "user": "RebelTraveler07", "date": "June 30, 2008", "id": 17381786}, {"rating": 5.0, "title": "Excellent Stay!", "text": "Surprisingly though there was no elevator. Since we were on the second floor, that meant hauling our stuff up and down stairs...and at 5 AM that was no fun. How could a two story motel be built without an elevator? Glad we were not handicapped. Also, the discount rates we found on the internet did not apply if using the \"free\" parking service.", "user": "MyKidzStink", "date": "May 31, 2008", "id": 16530566}, {"rating": 5.0, "title": "Wonderful Airport hotel", "text": "We stayed at this hotel when flying out of the Columbus airport early the next morning and again for one night when we returned at the end of our trip. I was very pleased with the courteous and helpful attitude of the clerk at the front desk. Our room was clean, internet was a nice convenience and we enjoyed popcorn from the in-room microwave! The furnished refrigerator was a nice size. The included breakfast was way above average -- waffles, fruit, yogurt as well as a selection of pastries. Fruit and delicious gourmet coffee was available in the lobby 24/7. The 24 hour shuttle service to the airport terminals was prompt and very convenient. I don't know how long this has been a Choice Hotels property, but after seeing negative reviews of this hotel below, I am guessing it is a recent change. I'm sold enough to look for Choice Hotels everywhere I travel in the future.", "user": "RobGin2006", "date": "December 14, 2007", "id": 11553053}, {"rating": 5.0, "title": "Good Stay, Great Location", "text": "Have stayed here twice while visiting friends that are more like family. Each time had first floor with \"runway view.\" I actually thought it was just another road till I realized that the wooshing sound wasn't the wind, but a Boeing every now and then. A really good job of soundproofing, but it was very nice outside for late August/Early September and I would've liked being able to crack the window open for some fresh air. Hotel room was clean and smelled good though. Mini-fridge is always a plus for me so I can keep some \"beverages\" handy. Room is set up to how many other Choice Hotels' junior suites are. I especially like Comfort Suites size for a longer stay than just a night or two. I specifically remember that they had a vending machine on the 2nd (or 3rd) floor that dispensed juice cans! That is very rare these days to find actual 100% juice versus the sugar-y carbonated water that people call refreshment. A big plus for me because, again, I like to keep \"beverages\" handy. Front desk was cordial and up to task. Provided me with any requests and directions to restaurants promptly and with a smile. Overall, their great internet pricing and location makes this an ideal stay for visting Columbus and Easton.", "user": "NaptownTraveler", "date": "May 16, 2007", "id": 7633413}, {"rating": 4.0, "title": "convenient, nice staff, decent room and breakfast", "text": "My son and I stayed at this property over Memorial Day weekend, while attending several family functions. We noticed a foul odor in the first room to which we were assigned, but foolishly stayed in there the first night. The next morning, we requested another room assignment, and our request was pleasantly and expeditiously acted upon. This second suite had a great view of a runway, and we enjoyed the \"activity\" over the next few days!!", "user": "WannaRetire", "date": "January 19, 2007", "id": 6623853}, {"rating": 4.0, "title": "Comfy new beds", "text": "The breakfast was nicely set up, with ample selections. The staff was pleasant and helpful, but we found housekeeping not quite up to \"standards\" (such as food wrappers under the beds).", "user": "Esmerlda", "date": "November 20, 2006", "id": 6158874}, {"rating": 5.0, "title": "Great stay", "text": "Our stay at this conveniently-located property was, all-in-all, nice. The price was very reasonable, and although we've stayed at nicer Comfort properties, the accomodations and service were acceptable.", "user": "ktfarley417", "date": "February 21, 2006", "id": 4476515}, {"rating": 3.0, "stay_parameters": "Stayed March 2005, traveled on business", "text": "Shuttle driver somehow forgot for 20 minutes that I was waiting for him in the rain at the airport, had to repeat my call. Hotel: Clean, big room, ok staff. Some vending machines out of order. TV was dark image and poor color. I had some trouble make the internet connection work because of the worn modem box, but worked nicely once hooked up. Breakfast decent, at least for being 'continental'. Only proximity to airport defends price. I didn't bring a car, so wouldn't know whether other reviews concerning security are representative.", "title": "Average", "helpfulness": 1, "user": "Hallvard7", "date": "April 17, 2005", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "rooms": 3.0, "service": 3.0}, "id": 3372132}, {"rating": 2.0, "title": "close to the airport, you can see the planes from your window", "text": "I stayed here Oct. 22 with the park and fly rate of $68.00. This is usually more then I spend for the area but it was a last minute trip so I think it was a good deal considering there was an OSU game the next day. Check in went ok, she did have a problem running my credit card she said it wasn't the one I used to book but I know it was. But that was easily fixed. She told me the wrong way to get to my room. Room was average. Bathroom was not as clean as should be. There was something growing around the rim of the sink. Room had a king size bed, coffee pot, fridge, microwave, and a desk. Other then the bathroom rest of the room was somewhat clean. You can hear the planes landing and taking off but hey you are at the airport. I just turned on the fan and it blocked the noise out. There are no elevators so if you have a lot of luggage stay on the bottom floor. The free breakfast in the morning was more then I expected. There was a lot of choices. Check out went OK but I had to ask twice to get a shuttle to the airport. I think she forgot to call him the first time I asked. Employees here were not unfriendly but they could use some people skills.", "helpfulness": 4, "user": "Justonia", "date": "October 29, 2004", "id": 2794054}, {"rating": 1.0, "title": "Shockingly Unclean and Unsafe to boot!", "text": "Had no problem leaving my car for the 4 days I was gone. The shuttle from the airport back to the hotel was waiting for me when I walked outside.", "helpfulness": 11, "user": "coando", "date": "April 23, 2004", "id": 1834047}], "location": {"country": "United States", "city": "Flowood"}, "stars": 2.5, "variance": {"poor": 1, "average": 0, "very good": 4, "terrible": 1, "excellent": 35}, "slim_ranking": 0.222222222222, "description": "Comfort Suites Airport hotel near Jackson, MS. The Comfort Suites® Airport hotel is conveniently located near many area attractions and local businesses. Jackson-Evers International Airport is three and half miles away and this Flowood, MS hotel provides free airport transportation for its guests. Additional points of interest close to this Mississippi hotel include: •Mississippi State Fairgrounds •Dogwood Festival Market & Promenade •Bass Pro Shops •Mississippi Museum of Art. Jackson, the capital of Mississippi, is just a short drive away from this Flowood, MS hotel. This robust area is home to the Mississippi State Capitol building, numerous governmental agencies and historic landmarks. There are many entertainment venues, shopping centers and restaurants in the vicinity. As a guest of this Flowood, MS hotel, you can enjoy features like: •Free full breakfast •Free Wi-Fi Internet access •Free USA Today newspaper •Free local calls •Free coffee in the lobby. This Mississippi hotel offers additional amenities including a seasonal outdoor pool, exercise room, on-site business center, public computer with Internet access, and access to copy and fax services. All spacious guest rooms are suites that are furnished with flat-screen televisions, microwaves, refrigerators, coffee makers, curved shower rods, hair dryers, desks, voice mail, irons, ironing boards and cable television. Ask about our rooms that also have sofa sleepers and whirlpool bathtubs. Connecting rooms can be requested. Coin-operated laundry facilities are located on the premises and valet cleaning service is available. On-site free parking is available and can accommodate most vehicles. Whether you are traveling for business or pleasure, the Comfort Suites Airport hotel has countless features that will make you feel at home. Make a reservation with us today."}