{"user_rating": 3.0, "review_count": 61, "name": "Comfort Inn Edmonton West", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "This hotel is very close to the west Edmonton Mall, and since that was the purpose of our trip, it made for a good base to get to the mall quickly. The hotel is really lacking in amenities though; no breakfast- which all Comfort Inns are supposed to offer; no hotub, no public computer, no workout room. Good thing all we did was sleep then head off to the mall. It would have been nice to soak in a hottub though.", "title": "Not at all like other Comfort Inns", "helpfulness": 2, "user": "lovebeachtravel", "date": "January 5, 2008", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 12364004, "likes": {"liked": "— Close to West Ed Mall", "disliked": "— No Amenities"}}, {"rating": 3.0, "title": "Hotel not so hot but staff was great", "text": "I don't think I would stay there again, I would rather have a longer drive to the mall in exchange for more amenities.", "helpfulness": 2, "user": "comfortseeker1946", "date": "June 22, 2007", "id": 7959858}, {"rating": 4.0, "title": "Great value, very clean.", "text": "Well, we booked because the price was right and it was close to the big mall. When we arrived Coleen checked us in. We were disapointed to find out that all they had was a 2nd floor room and the hotel was full no rooms left on the bottom level. Being seniors it was going to be hard to get our things up the stairs, without us asking she offered to assist us and carried up the 2 larger bags. She the told us that if the was something else need to just let her know. She was warm and welcoming. The room was ok, but had not been very well cleaned and it was a tad noisy most of the evening. We called down to complain about the noise but the person working seemed bothered by our call and he didn't do anything. The next day we were checking out the same girl was still at the reception desk she again we very friendly and asked us if we had enjoyed our room and our time at the mall. Even if she didn't really care she sure came across like she did. If we stay there again it will be because of her.", "helpfulness": 1, "user": "gadget463", "date": "March 28, 2007", "id": 7237988}, {"rating": 2.0, "title": "Disliked this stay", "text": "The hotel was clean and the rates were reasonable. It's not a 5 star, but for the price it was reasonable and we will be staying there again.", "user": "mrpickles", "date": "August 7, 2006", "id": 5575798}, {"rating": 1.0, "title": "Never Again", "text": "The hotel was not kept up. The hallways were dingy and carpet was stained. Inside the rooms were not cleaned well and there were stains on the comforter. The sheets were not changed at all during our three days even though we put the sign on the bathroom door to have them cleaned. Some of the staff was unhelpful. The shuttle rides to the West Edmonton mall were not free and it was not in walking distance like they said.", "helpfulness": 4, "user": "Tim D", "date": "April 29, 2006", "id": 5018729}, {"rating": 4.0, "title": "Clean, Comfortable & Quiet", "text": "We stayed at the Comfort Inn Edmonton last summer while we were visiting the West Edmonton Mall. We found the staff very friendly and most accomodating. The room we booked was a non-smoking room and it was very clean and fresh. In reading the other reviews I was surprized to see what others were saying. One, can you prove you got the scabies from the hotel? Scabies are transferred from one human being to another not usually from hotels. Scabies are parasites that survive on the flesh and not usually on a bed. Two, the Mall is not that far away from the hotel. Yes, it is probably too far to walk if you are carrying parcels as it is 3 long city blocks. If you look at a map you will see it is only 3 or 4 blocks away. Are you sure you weren't at the Comfort Inn & Suites downtown and thought you were at the one near the mall because I don't recall going through any industrial area to get there from the hotel.", "helpfulness": 11, "user": "A TripAdvisor user", "date": "August 16, 2004", "id": 2453619}, {"rating": 1.0, "title": "Hardly Near the West Edmonton Mall", "text": "We enjoyed our stay there so much that we have booked rooms there again for our trip next week. While we were there we never saw any groups of \"teenagers\" standing around the parking lots smoking or not. I felt very safe and secure in the hotel, no less safer than other hotels. There are very few hotels that have fences around the perimeters, besides, fences only keep the honest ones out. Fences cause places for others to hide which, to me, would be scarier than having them out in the open. Besides, teenagers hanging around smoking doesn't automatically make them a threat or harmful. If my trip this time is any different I will be sure to post my findings but if it is comparable to last time you won't here from me.", "helpfulness": 20, "user": "A TripAdvisor user", "date": "October 28, 2003", "id": 1427271}, {"rating": 1.0, "title": "Watch Out", "text": "This hotel advertises itself as within walking distance of the West Edmonton Mall - this was untrue as it was about 2 miles away through a large industrial area. The hotel also said they offered a shuttle service to the West Edmonton Mall (but it is at a cost and they only take you there and do not bring you back.) The hotel charged for every little extra so even though the rates seem 'reasonable' they aren't with all the hidden extras. Most of the staff were also unfriendly and unhelpful.", "helpfulness": 21, "user": "A TripAdvisor user", "date": "February 27, 2002", "id": 411474}], "location": {"country": "Canada", "city": "Edmonton"}, "stars": 2, "variance": {"poor": 9, "average": 12, "very good": 14, "terrible": 17, "excellent": 9}, "aka": "Comfort Inn West Hotel", "slim_ranking": 0.693181818182, "description": "Our 100% smoke-free Comfort Inn, situated in the West End, has newly renovated the front desk and lobby area which now includes a 24-hour business centre, fireplace and sitting area. All bedrooms have new carpet, vinyl, drapes, 32 inch flat screen tvs & new vanity and tile in the bathrooms. All rooms are equipped with free wireless high speed and the hotel offers a small meeting room. Melt into your pillow-top bed with Truly Yours bedding. Upgraded rooms are equipped with a fridge and microwave. We are a pet-friendly hotel and offer ground floor rooms with a patio. Ideally located minutes from the West Edmonton Mall, Rexall Place, Telus Space & Science Centre, great shopping and restaurants"}