{"user_rating": 3.5, "review_count": 109, "name": "Comfort Suites - Columbus / Clara St", "reviews": [{"rating": 1.0, "stay_parameters": "Stayed March 2007, traveled with friends", "text": "Our stay at this Comfort Suites was absolutely horrible. We arrived to first find that the toilet bowel was still stained and not cleaned. We also found a blood stain on the sheets on one of the beds. We pulled the sheets back in hopes the sheets would be changed, but after the room was made the next morning the same sheets were on the bed. The \"clean\" towels had a few pieces of long black hair on them as well. Also, on the 3rd floor one of the windows from the sky light was gone. It was snowing on the floor in the hallway and terribly cold on the floor. The front desk was notified, although they mentioned someone was coming - 24 hours later the window was still not fixed. I suggest not to stay here if at all possible!", "title": "Horrible Experience", "helpfulness": 1, "user": "Hilldog", "date": "March 5, 2007", "detail_rating": {"front_desk": 3.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "location": 3.0}, "id": 6919197, "likes": {"liked": "— The location to the highway", "disliked": "— The cleanliness"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2007, traveled with friends", "text": "I was very pleasantly surprised with this Comfort Inn Suites. My room was large, clean, and comfortable. The bathroom was average size, but ample and clean, the sleeping area, (with 2 double beds, desk and TV), led into a small lounge with one sofa, fridge, safe, and coffee making facilities. Excellent value for money; I got in on a great Triple AAA rate! In addition, there were vending machines right outside my room. The breakfast has hot and cold items, along with pastries and a good selection of coffee and tea. Although I did not swim in the pool, it was indoor and looked clean. The hotel is off I-70 and is about a 10-minute drive from Downtown Columbus and near I-270. Overall, it was a good stay and a good value. In addition, we were so amazed with how clean, open, and bright the lobby happens to be. They have an ATM on the premises!", "title": "Pleasantly Surprised!", "helpfulness": 3, "user": "Shad0wy", "date": "February 5, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 6746760}, {"rating": 4.0, "stay_parameters": "Stayed August 2005", "text": "I am a Marriotts person. I rarely stay at other hotels other than Residence Inn's , Courtyards, Renaissance. I was very pleasantly surprised with this Comfort Inn Suites. I got in on a great Triple AAA rate. We went to the Ohio State Fair this weekend to see \"That's so Raven\" in Concert. Well after the concert that started at 1:00 we went to check in to our hotel (which was right across the street in walking distance) and we were so amazed with how clean, open, and bright the lobby happen to be. The staff were very polite and eager to please with anythy we needed (toothbrushes, paste, more towels). They have an indoor pool which is clean. They have an ATM on the premises! The rooms are big! We had a double queen bed with a sleeper sofa. The rooms also have a microwave, mini refrigerator and coffee maker. The continental breakfast was very good. I so enjoyed this stay. It is literally right off the highway. Easy access to downtown, high street, the stadium, and the Ohio State fair in which I will be staying here next year when we come to the fair again. Spectacular!", "title": "Absolutely Perfect!!!!!!!! Location, Location, Location!", "helpfulness": 5, "user": "CHUBABY", "date": "August 16, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 3768851}, {"rating": 1.0, "title": "Horrible Customer Service", "text": "This was the worst hotel experience ever. Check-in was at 3:00. We arrived at approximately 3:45. They gave us our key. Our room was not yet cleaned from the night before. It was repulsive. There were chips on the floor and bed. Blood on the pillowcase. Water standing in the bathtub. Towels thrown throughout the room. The toilet was completly full. We requested another room or someone to come clean it. All the rooms were full and they said they would send someone \"right\" up. This was at 4:15. No one came to our room until 5:45. Then when they were \"done\" we discovered they had not even changed the sheets. It was the worst customer service I have ever experienced. The next day we talked to the manager. He was not of American descent so there was of course the language barrier. He pretty much thought we were making everything up. In the end he gave us a measly 35% off. I would not recommend anyone go to that hotel. They do not know how to take care of their customers at all. And they really didn't seem to care.", "helpfulness": 8, "user": "A TripAdvisor user", "date": "June 24, 2004", "id": 2219456}, {"rating": 4.0, "title": "Good Value", "text": "I was a business traveler and his hotel was a good value.", "user": "MIRay", "date": "September 17, 2008", "id": 20146883}, {"rating": 4.0, "title": "great value no problems", "text": "Positives: Comfy bed, good water pressure in shower, room and bathroom clean, just north of downtown and just east of OSU; nice open area for free breakfast.", "user": "mogadoredad", "date": "March 28, 2008", "id": 14606059}, {"rating": 1.0, "title": "CUSTOMER SERVICE IS THE WORST I HAVE EVER SEEN", "text": "Negatives: VERY small fitness room – bike did not work so that left only a treadmill and old weight machine; no wireless in room but they did have Ethernet cables to borrow; parking lot on side of building but you could not use the door on the side to enter – only to exit; some front desk staff had English comprehension challenges.", "user": "travelin-mama87", "date": "March 19, 2008", "id": 14395486}, {"rating": 3.0, "title": "Nice Hotel, minor problems", "text": "we recently stayed here for one nite. we had a room with 3 adults and 3 kids. room had 2 queen beds and a pulled sofa bed. room was clean and had plenty of space. within minutes of ohio state as we were attending a basketball game.indoor pool was a little cold ,could've been a little warmer . breakfast was very good even when there were alot of people it was still well stocked. good selection for all. i would stay here again.", "user": "Deborah 0729", "date": "February 5, 2008", "id": 13303577}, {"rating": 4.0, "title": "Not Bad At All!!", "text": "this was the worst hotel experience i have ever had. first of all, i called the front desk a couple days ahead of time to see if we could check in about an hour early. they said they would put a note under our reservation and do there best.", "user": "nancyk1116", "date": "August 9, 2007", "id": 8379882}], "location": {"country": "United States", "city": "Columbus"}, "stars": 2.5, "variance": {"poor": 5, "average": 12, "very good": 44, "terrible": 15, "excellent": 33}, "aka": "Comfort Suites - Columbus / Clara St Hotel", "slim_ranking": 0.31654676259}