{"user_rating": 4.0, "review_count": 32, "name": "Comfort Suites", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "Where do I start? We stayed in the Comfort Suites in Copperas Cove for 1 week. It was absolutely the best service we have ever received while taking long trips. We are from Somersworth, NH, so we traveled quite a ways. We arrived late but the hotel staff was very polite and helped us. Every time we left for the day, one particular front desk manager named Jared, greeted us when we left and when we returned asking about our day. The breakfast was great. Something different every morning. My daughters love the Texas-shaped waffle maker. The housekeeping staff was great. Very kind. Kept our room cleaned, gave us plenty of towels. What else can I say? Not enough. We plan on visiting the Copperas Cove area every year from now on because of our new granddaughter, so we will be definitely staying at this hotel again for sure!! Please pass this review on to the staff at the Copperas Cove TX Comfort Suites. It is very important that this does get passed on so everybody gets praised for a job well done!!", "title": "Absolutely love the Comfort Suites in Copperas Cove, TX", "user": "nhtravelers51", "date": "August 6, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 18681514, "likes": {"liked": "— Everything was great", "disliked": "— I liked everything"}}, {"rating": 5.0, "title": "The One and Only Downtown Hotel", "text": "Just returned from a long trip in PA and wanted to share a little secret. If your travels ever take you to the Carlisle area, you must try out this neat hotel in the downtown historic district. The rooms were big, the staff was very friendly and the place was very clean.", "helpfulness": 10, "user": "A TripAdvisor user", "date": "September 26, 2003", "id": 1367972}, {"rating": 4.0, "title": "Best Hotel in Carlisle.", "text": "I stayed at the Carlisle, PA Comfort Inn & Suites for two weeks in July. This hotel is definitely the best hotel in Carlisle in terms of the quality of the rooms and the location. We stayed in one of the hotel suites and this more than met the needs of two adults and one infant. The hotel was located in the heart of downtown Carlisle and this meant we were within walking distance of a large number of restaurants. We were also roughly 1 mile from a large shopping center. There were only two drawbacks to our hotel room and those are that the suite only had an air conditioner in the bedroom. This meant that the door separating the bedroom from the living room (room with the sofa sleeper) had to remain open at all times or else the living room would become unbearably warm. The other drawback was that we had a problem with our whirlpool tub and no one on the hotel staff seemed to know how to fix the problem. Despite the two drawbacks to the suite, I would definitely stay at the Carlisle Comfort Inn & Suites again.", "helpfulness": 7, "user": "fishfry", "date": "July 26, 2006", "id": 5515139}, {"rating": 5.0, "stay_parameters": "Stayed October 2005, traveled on business", "text": "Cheerful staff from start to finish.", "title": "Comfort Suites sweet, central for historic Carlisle", "helpfulness": 7, "user": "sbrandondc", "date": "October 16, 2005", "detail_rating": {"cleanliness": 3.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4027147}, {"rating": 5.0, "stay_parameters": "Stayed October 2005", "text": "Desk man got me a lovely room at the \"front of the house\" at my request at check-in. I do love to get a feel for a city by getting a street or skyline view and rather enjoy the rhythm of the noises of the day and night. (Watch where you stay in some cities in Pa if you don't - the crosswalk lights go \"CheepCheepCheep!\" State bird?)", "title": "Great Hotel", "helpfulness": 5, "user": "DianeNiagaraFalls_NY", "date": "October 15, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4025578}, {"rating": 5.0, "title": "Good Place to Stay", "text": "Little Carlisle wasn't too noisy for the older windows although they should lose the Sunday morning leaf blowing and get a broom.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "November 30, 2004", "id": 2856441}, {"rating": 5.0, "title": "A truly charming and lovely hotel. We loved it!", "text": "The windows open, a wonderful thing these days. At least at \"the front of the house.\"", "helpfulness": 7, "user": "like2travel1", "date": "September 23, 2004", "id": 2593891}, {"rating": 3.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "We recently spent 3 nights at the Comfort Inn in Copperas Cove to visit family. It was a typical stay for a budget friendly hotel. The inn was located close to 190 and the local Wal-Mart but set back far enough from the road and stores for a quiet setting for sleeping and relaxing. There was plenty of parking and check in/out was easy. Our room was right off the main lobby. It was sometimes noisy late at night or early in the morning when people came in/out. (I’m a light sleeper) The manager refused to move us unless we paid more for a room with a Jacuzzi tub. This was the only negative during our stay. We had a king room with a small sitting area and microwave/fridge combo. It was good sized for a hotel room with high ceilings. The room itself was clean and was in excellent condition being a newer hotel in the area. The bed was comfortable and the linens were fresh and good pillows. However, the edges of the carpet and some the fixtures appeared to be dusty/dirty. The maid service was adequate with linen exchange and emptying trash. I don't think they wiped down the bathroom. The free breakfast in the morning was average. The hot options were terrible: goopy waffles, pre-made egg pucks and “sausage” links. The fruit didn’t look too fresh. Ick. But there was plenty of cereal, yogurt, pastries/bagels and decent hot coffee for a light breakfast. I’d recommend Little Tex restaurant for a solid breakfast and lunch options. Yum! The pool and hottub were small but appeared to be well maintained. We enjoyed a nice soak in the hot tub in the morning. I hope the management keeps up with a good cleaning so Copperas Cove has a well cleaned and budget friendly option for visitors to the area.", "title": "Thumbs Up", "user": "Daphne418", "date": "June 8, 2009", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 4.0, "service": 3.0, "rooms": 3.0}, "id": 31876162}, {"rating": 5.0, "title": "Best Comfort Suites I have stayed at", "text": "I travel over 300 days a year and stay at hundreds of hotels and hands down this is the best Comfort Suites I have ever stayed at. It's underpriced! I try and stay at a med price hotel, newer Holiday Inns, Hamptons, etc around $110 to 120 a night and this hotel fits into that catagory but is priced under $100..", "user": "tamartin516", "date": "November 29, 2008", "id": 22289286}, {"rating": 2.0, "stay_parameters": "Stayed November 2008, traveled on business", "text": "Very upscale bed", "title": "Eye Opening", "helpfulness": 1, "user": "katoAz", "date": "November 9, 2008", "detail_rating": {"front_desk": 4.0, "business": 1.0, "service": 2.0, "cleanliness": 1.0, "value": 4.0, "location": 3.0, "rooms": 2.0}, "id": 21668785, "likes": {"liked": "— leaving", "disliked": "— internet, and cleanliness"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "good selection of TV channels", "title": "A great place to stay", "user": "MKarl", "date": "August 22, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "rooms": 5.0, "location": 3.0}, "id": 19246274, "likes": {"liked": "— The staff", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "in room temp control", "title": "The best !", "user": "Aloha123", "date": "August 12, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 18873579, "likes": {"liked": "— The large room", "disliked": "— Nothing"}}, {"rating": 3.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "We stayed at this hotel for one night. The front desk personnel were somewhat unprofessional both during the check-in and check-out. The woman who checked us in seemed busy taking care of her kids. Another woman who worked in the morning was out for her smoke break when we tried to check out, so we had to wait for a while until she came back.", "title": "Clean room, large bathroom, and strange front desk clerks", "user": "Fortwood", "date": "January 6, 2008", "detail_rating": {"front_desk": 2.0, "business": 2.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 3.0}, "id": 12390526, "likes": {"liked": "— Clean room", "disliked": "— Noise"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled with family", "text": "But, we were very pleased with the cleanliness of the room, and the size of the bathroom. Like the previous reviewer, the room configuration was rather strange, and we had to store things in the entry way as bed area was quite cramped. We had difficulties watching TV because it was located on the side wall. Our room wasn't right next to the evelator, but we could hear the elevator noise all night.", "title": "Contemporary Style", "helpfulness": 1, "user": "CrossCountryDriver", "date": "October 20, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 10156150, "likes": {"liked": "— new clean facilities", "disliked": "— strange room configuration"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "The fitness room equipment were not in very good shape at all, but my husband used the massage chair which was available for free.", "title": "Loved this Hotel.", "user": "ligh501", "date": "September 2, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 8604995, "likes": {"liked": "— great hotel in itself but very convenient to any destination in the area", "disliked": "— nothing bad... a great time."}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "The breakfast was okay. Nothing special, but typical comfort inn breakfast.", "title": "Best Hotel in Toledo", "user": "jpete02", "date": "June 26, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 3.0}, "id": 7998379, "likes": {"liked": "— The Plasma TV", "disliked": "— Access to the hotel was blocked by a median off Northbound I-75"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "Since we just needed a clean place to sleep with free breakfast (to save time on the road), this was a very reasonable accomodation overall.", "title": "Wow! Excellent value and amenities!", "helpfulness": 3, "user": "TheBigK", "date": "February 22, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 3.0, "rooms": 5.0}, "id": 6826359, "likes": {"liked": "— Multiple flat panel TVs and great whirlpool in room", "disliked": "— Nothing, really. An A+ place."}}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled solo", "text": "I stayed her in mid-september for three nights. the hotels is has been open for less than a year, so they were willing to give a discount if you called the hotel directly. first of all, the rooms were clean, with a modern look (ie, paint, tiled bathrooms, modern water fixtures) which included a 42 inch plasma TV. the free breakfast was very nice, with fruit, cereals, bagels, scrambled eggs & sausage. the staff was very friendly and pleasant. also, there are a buttload of restaurants within walking distance. i usually stay at the marriott hotels (fairfield, courtyard) while in toledo (because all the other hotels have significant drawbacks), but this hotel is my new favorite.", "title": "Great Hotel, Modern rooms", "helpfulness": 2, "user": "havajava", "date": "September 30, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 5.0, "rooms": 5.0}, "id": 5893764, "likes": {"liked": "— Clean, modern, plasma TV", "disliked": "— no pool"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2006", "text": "We left the Detroit Airport and started looking for a hotel in the Toledo Ohio area. We ended up at the Comfort Suites Perrysburg. The hotel had only been open a couple weeks and is absolutely beautiful. It has all the latest amenities, including flat screen tv's. We liked the hotel so much we stayed there a second time three days later on our return towards Detroit. The ladies at the front desk were very helpful. They suggested a restaurant called Mr. Beefy's for dinner. They had the best ribs my wife and I had ever had in a restaurant. Definitely stay at the Comfort Suites Perrysburg. You won't be disappointed.", "title": "Wonderful New Hotel", "helpfulness": 3, "user": "dstanton6", "date": "July 10, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 5447271}, {"rating": 5.0, "title": "Very nice room, excellent service, recommended", "text": "We stayed here one night while on a long drive back to our home from New Orleans. Although it was slightly more expensive than most other locations, the cost was well worth it by the quality and cleanliness of the room and very good food service (we had two meals delivered to our room at no additional cost).", "user": "dalehiet", "date": "November 19, 2010", "id": 87608034}, {"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled on business", "text": "This property is close to I-29 but takes a bit of manuevering to get to. Once you get there the hotel has everything you would expect of a Comfort Inn. The \"suite\" I stayed in was really just a standard room with a partial wall divider which distinguished the sitting area from the bedroom. There was no way to close off one area from another. The room had a microwave and a refrigerator.", "title": "Comfortable and quiet", "helpfulness": 2, "user": "paubri", "date": "May 3, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 7544051, "likes": {"liked": "— Nice and quiet", "disliked": "— No major complaints."}}, {"rating": 4.0, "title": "very nice stay", "text": "It appears that this property is more tailored to families than business travelers as there is no real work area in the room other than a table. The property has a small fitness facility with three cardio machines as well as an indoor pool and spa.", "helpfulness": 4, "user": "BRMom3", "date": "August 1, 2005", "id": 3726414}, {"rating": 5.0, "stay_parameters": "Stayed May 2005", "text": "Staff were helpful and friendly. The room overall was clean, although by the dried coffee stains on the coffeemaker carafe in my room, it appears that it may have been rinsed rather than completely washed by housekeeping. The property was nice and quiet (other than a fire alarm in the middle of the night one night - something I can't fault the hotel for).", "title": "Nice place to stay!", "helpfulness": 3, "user": "rme245", "date": "May 28, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 4.0}, "id": 3505707}, {"rating": 5.0, "title": "Excellent Customer Service", "text": "Overall I would stay there again.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "January 16, 2005", "id": 3010047}, {"rating": 5.0, "title": "Very nice, comfortable hotel at an excellent value! Stay here if you are in the area!", "text": "This Comfort Suites was an awesome hotel! Don't know if it's brand new but it sure looked like it. I loved the decor in the lobby and breakfast, very chic and modern. Loved seeing all the good decor- from tall glass vases, pictures, and \"art\" on the walls. Didn't expect to see all the nice little touches. Room was spacious. Had a youth group with me and we were able to put 6 to each room. Had 2 queens and pullout sofa. Beds and pillows were very comfortable and luxurious, must have been new mattresses. Will definitely stay here again if I'm in the area. It's right off I-65, north east of Nashville. And to top it all off, the price was very decent. A fantastic value for all the nice touches.", "user": "CosmoMaui", "date": "February 20, 2012", "id": 124941449}, {"rating": 4.0, "title": "Very good hotel", "text": "It is an excellent hotel for the price that we paid. The hotel is very clean as it has a total smoke-free environment. The room is spacious and the breakfast is adequate and quite good. Our stay would be perfect if not becuase of the glitch of the wifi connection and the lack of linen and blanket for the sofabed.", "user": "Snowbird888", "date": "January 6, 2012", "id": 122661319}, {"rating": 5.0, "title": "Fantastic Value", "text": "Returning from Florida, we stopped at this hotel located just off of I-65 in a wooded valley. We had a $10 off coupon obtained from a TN rest park which was cheerfully accepted by the very friendly counter attendent. Our third floor room was beautifully furnished with two queen beds, flat screen TV, refrigerator, microwave and sitting area. The bathroom was impeccably clean with granite counters and stone tile flooring. The next morning we partook of the free continental breakfast. Now the best part: $69.00 at check-out. I have no idea how they do it, but I would highly recommend this hotel if you are in the area just a few miles south of the KY border.", "user": "Curt909", "date": "October 31, 2011", "id": 119953369}, {"rating": 5.0, "title": "Great", "text": "Our room was 326 on third floor via elevator", "user": "wataview", "date": "October 9, 2011", "id": 119121790}, {"rating": 5.0, "title": "Great People", "text": "Pros: King bed + sofa bed, loads room for extended stay if needed. 30\" flat screen TV, Frig, microwave, and coffee maker etc. Great continental breakfast. Restaurant on site", "user": "windsong_2000", "date": "September 29, 2011", "id": 118758881}], "location": {"country": "United States", "city": "Copperas Cove"}, "stars": 2.5, "variance": {"poor": 6, "average": 4, "very good": 8, "terrible": 1, "excellent": 13}, "aka": "Comfort Suites Copperas Cove", "slim_ranking": 0.5}