{"user_rating": 4.0, "review_count": 80, "name": "Comfort Inn & Suites", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed February 2008, traveled on business", "text": "I stay at this hotel on a regular basis because I travel with busines. The staff are always friendly and accomodation and if there has ever been a mess up they have been quick to rectify the problem. The price affordable and the rooms have always been clean. It's not the Luxor by any means, but for a clean and affordable hotel it's great.", "title": "Good place to stay", "user": "hlh698", "date": "February 18, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 13661575, "likes": {"liked": "— Affordable and Clean", "disliked": "— Perhaps not as"}}, {"rating": 1.0, "title": "Lice infested !", "text": "Do not stay here ! Hotel has lice in the beds and the rooms are not clean (pet hair emporium). We left almost as soon as we checked in , when we noticed something crawling on the nighstand and found that it was lice , we pulled back the bottom sheet and the bed was totally infested .", "helpfulness": 8, "user": "A TripAdvisor user", "date": "July 10, 2006", "id": 5446873}, {"rating": 2.0, "stay_parameters": "Stayed June 2005", "text": "This hotel was just alright. Only the ice machine on the first floor works (there's 4 floors) and the staff could use some better training. The light in our bathroom was out and there was only half a roll of toilet paper. The beds were comfy, but made a lot of noise when you moved. I would stay here again, but only if I was drunk and needed a place to crash.", "title": "Needs some work", "helpfulness": 3, "user": "DentalGal1426", "date": "June 19, 2005", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 2.0, "service": 3.0}, "id": 3576030}, {"rating": 5.0, "stay_parameters": "Stayed June 2005", "text": "THIS is a great place to stay. WE first stayed here in 2000 and returned 6/3-5/05. We were pleased to find the hotel was still well maintained and very clean. The staff were very friendly and helpful. We had a king on the 4th floor and we had plentyof room and it was quiet at all times. The rates are very affordable. It also has interior halls.THE NEIGHBORHOOD IS CONVENIENT AND CLEAN. WE WOULD STAY HERE AGAIN.", "title": "quiet ,clean hotel", "helpfulness": 3, "user": "glennsheila", "date": "June 8, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3539671}, {"rating": 4.0, "title": "Great, Fantastic, Wonderful Hotel", "text": "This hotel was wonderful. We wanted to spend a nice, relaxing few days away from home. We originally had a reservation at another hotel, which ended up being terrible so we decided to stay somewhere else. This hotel is what we found. It is nice, in a good neighborhood, gives you what you are promised and more. Great customer service and management.", "helpfulness": 8, "user": "A TripAdvisor user", "date": "July 11, 2003", "id": 1135392}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "This hotel was excellent. Standard room was huge with 'sitting area\" separated from bedroom. The King bed has plenty of room for movement. Sitting area had sofa and big chair and a phone next to chair for convenience", "title": "Just wrote a review for this hotel---please try to find it", "helpfulness": 1, "user": "HILDA S V", "date": "March 5, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 125646756}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "Breakfast was fine every morning and the employees were helpful and friendly.", "title": "Nice place.", "helpfulness": 5, "user": "val7379", "date": "December 10, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121591680}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "Hotel next to an Applebee's, and other restaurants within walking distance I would go back tomorrow for their \"pampering\".", "title": "Very Nice", "helpfulness": 1, "user": "Drmaurice69", "date": "November 29, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 5.0, "location": 4.0}, "id": 121197062}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled on business", "text": "Hospital barely a mile away--so convenient.", "title": "A really nice place to stay", "helpfulness": 1, "user": "thegormandizer", "date": "October 29, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 119877083}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled on business", "text": "The hotel was nice. We didn't get a chance to try the pool out, but it didn't smell overwhelmingly like chlorine, which is always a good sign. The breakfast was the standard Comfort Inn fare, which the staff were incredible at restocking continually. The room was clean and spacious and had a fridge and sink. The one thing that made this place a 4 rating instead of a 5 was a particular staff member at the desk who was, shall I say, less than customer service oriented. It's kind of a downer when that happens. She just didn't seem to want to help, was reluctant to give you her attention. Most of the staff was wonderful, especially the overnight staff.", "title": "Noise, one can hear the phone conversation of the next room", "helpfulness": 1, "user": "pa3ddg", "date": "October 24, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 119657045}, {"rating": 3.0, "stay_parameters": "Stayed September 2011", "text": "This was a 3rd year in a row stay for Big E visit. Each year the rooms seem more dates and worn. We had a 1 king bed suite on first floor. Wear your socks/shoes and bring your Lysol wipes. Big minuses for cleanliness of floors and countertops etc. My socks were dirty from 1/2 of walking on carpet and my socked feet were sticking to bathroom floor. Enough said. Furniture and fixtures were worn, broken or missing. Bathroom ceiling had water stains. Probably a nice place 20 years ago. We like the location ...very quiet and good soundproofing but that's all it has going for it now. Will stay elsewhere next year.", "title": "Discomfort Inn...", "helpfulness": 1, "user": "Daphne418", "date": "September 24, 2011", "detail_rating": {"cleanliness": 2.0, "value": 3.0, "location": 5.0, "service": 3.0, "rooms": 3.0}, "id": 118548910}, {"rating": 2.0, "stay_parameters": "Stayed June 2011, traveled with friends", "text": "We stayed one night here with a coupon. That was good but still not very cheap. We were on the 2nd floor and they had no elevators (that's what they said) and that is bad if your old with a disability. The room was fair but not real clean. Besides not being real clean there was a half pizza in the room from I guess the last occupant. The hall had a very strong odor that smelled like folks might be cooking in the rooms? The location was in an out of way place (found thanks to the GPS) that made you feel a little unsafe and worried about your vehicle (it was O.K. the next morning). There was local construction and after we ate supper most of the roads back to the motel were closed. We would have been lost without the GPS.", "title": "Probably Not Again", "helpfulness": 1, "user": "Mike-Landon", "date": "August 29, 2011", "detail_rating": {"cleanliness": 2.0, "sleep": 2.0, "value": 2.0, "service": 2.0}, "id": 117420132}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "We stayed here last year and opted to try it again for our family vacation to Six Flags. The hotel is very close to shopping. The kids love the hotel pool, although it looked like it could have been cleaned by our second day. The breakfast is good. The front desk staff answered all of our questions. The room was nice and clean.", "title": "Great hotel, close to Six Flags", "user": "Stacey04", "date": "August 17, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 5.0, "service": 4.0}, "id": 116858015}, {"rating": 3.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "My wife, 2 kids and I stayed here for 2 nights to go to Six Flags. We checked in after a long travel day and got in late (around 10 pm) on July 31st. We were greeted by a very rude lady who I felt like I was bothering even though there were no other guests in the lobby at that time. I was ready to turn around and leave if it were not for the room being prepaid. We were given a room on the 2nd floor. We are on a 2 week driving trip from Canada so we had lots of luggage. The first odd thing about this hotel is that it has no elevators. When we commented about this being odd, all we got was some eye rolling from the staff member Taking the luggage up the stairs was quite the endeavor.", "title": "Odd experience.", "user": "Yysguy", "date": "August 4, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 3.0, "value": 3.0, "service": 2.0}, "id": 116287248}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "The room itself was fine. The Internet was the next oddity. We were asked how many wireless devices we had and were provided with 3 cards which were valid for 72 hours each. They have a login and password, each being a combination of letters and numbers. This would've been fine except that you get disconnected after about 30 min and have to log on again. If you didn't have the card handy (when we were having breakfast) you can't log back in. They do have a business Desk with computer and internet for free as well as a printer.", "title": "Lovely hotel....close to Six Flags", "user": "MaryMG1", "date": "July 28, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115913085}, {"rating": 1.0, "stay_parameters": "Stayed March 2007, traveled on business", "text": "The only thing that is consistent about Magnuson hotels is that the photos are always better than the actual stay. Neighborhood was not so good, service and room was ordinary and below average. This is the second time I’ve booked a room with this hotel chain.... and it will not happen again.", "title": "Will not happen again", "user": "Nadine001", "date": "March 14, 2008", "detail_rating": {"front_desk": 2.0, "business": 1.0, "service": 2.0, "cleanliness": 2.0, "value": 1.0, "location": 1.0, "rooms": 2.0}, "id": 14273360}, {"rating": 4.0, "stay_parameters": "Stayed November 2007, traveled on business", "text": "I chose to stay outside of the City based upon the ringing reviews here, and a desire to save about $20 per night versus comparable places downtown. The hotel location is ok, right off I-90. There are some good eating options nearby, but I wouldn't say the neighborhood is all that great. The room was ok, very typical, nothing outstanding. The first night the heater seemed to be broken, so I had to move to a different room the next night. Staff were friendly and helpful about that. They now have some internet cables at the front desk, so I was able to use the in-room internet with no problems. A nit-picky complaint of mine is the $1.50 safe fee, which just seems like a way to rip people off more than anything else. They will waive the fee if you ask at checkout, so why not just waive it entirely, or make it an opt-in rather than an opt-out? I felt like a penny-pincher asking for that $1.50 back. I didn't use the pool or partake in the breakfasts, although both looked above average at a glance. Torn between a rating of 3 and 4, guess I'll go with 4 since staff were helpful.", "title": "Nice stay, nothing more", "user": "tinadam", "date": "November 11, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 3.0, "rooms": 3.0}, "id": 10758467}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled with family", "text": "For a Best Western-type of hotel, they exceeded our expectations... from the clean foyer, friendly staff (everyone impressed us with their attention/pride to the job), and great pool. The pool was indoor, clean and my 3 and 5 year old really enjoyed it - the depth was 3\" which was a welcome sight to my 3 year old.", "title": "This had exceeded our expectations", "user": "CustomerSat", "date": "October 10, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 10061714, "likes": {"liked": "— The upkeep of the hotel & the pool & the breakfast", "disliked": "— smoking rooms on 1st floor"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled on business", "text": "Beds were nice and the rooms are very quiet. 1st floor is actually basement level, and several smoking rooms are down there, so I recommend you ask for a 2nd, 3rd, or 4th floor room to avoid any residual odor from the pool (on the 1st floor) or smokers.", "title": "Very nice, but overpriced", "user": "azengebretsons", "date": "July 18, 2007", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 2.0, "location": 3.0, "rooms": 4.0}, "id": 8181589, "likes": {"liked": "— pillowtop beds, queen-sized", "disliked": "— price"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "The in-room safe was big enough to fit a laptop - a welcome sight for a business traveler brining the family along.", "title": "Nice Hotel! Would Stay Here Again!", "helpfulness": 1, "user": "MrMrsTravel", "date": "February 5, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 4.0}, "id": 6745634}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled solo", "text": "Agree with all the other positive comments here, wonderful value for the money, close to Spokane Mall shopping, also Cabelas in Idaho. The second night I unexpectedly became quite ill, blocked the toilet and soiled the linens so sought out the cleaning lady for a brush and a plunger to clean up the mess, and she insisted doing so herself, which certainly was not my intent-I tip service like this above and beyond the call. This is not a four star resort, and the location is suburban, but certainly a most solid performer in its price range. Very friendly staff.", "title": "GR8 Stay ...all things considered", "helpfulness": 1, "user": "a78jumper", "date": "November 24, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 22149004, "likes": {"liked": "— Friendly and accomodating staff", "disliked": "— Getting sick here and not being able to enjoy the place as much as I might have...."}}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled on business", "text": "My husband had a recent business trip in Spokane. We were there for 10 days with our 2 young kids. They upgraded us to a 2 room suite and went out of their way to make us comfortable. Housekeeping even made up the crib daily when they cleaned the rest of the room. Our room was cleaned around the kids nap time and even though at times there were toys and other things about the room, housekeeping did an outstanding job of getting the room clean. The breakfast was good and had quite a selection. The maintenance man saw us in the pool and got toys out for the kids to play with. What a great experience!!", "title": "Great Hotel!!", "helpfulness": 1, "user": "TaylorTravels6", "date": "November 24, 2008", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 3.0, "rooms": 5.0}, "id": 22145971, "likes": {"liked": "— Staff and spacious rooms", "disliked": "— internet was difficult to connect to"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2008, traveled with friends", "text": "Stayed here one night alone & 2 more nights with a friend in September 2008, while we visited a friend who lives in Spokane.", "title": "Nice place, good value.", "user": "iamqueenme", "date": "October 27, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 3.0}, "id": 21311601, "likes": {"liked": "— 24 hour pool/spa/exercise room & breakfast!", "disliked": "— Lack of view, location."}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "This hotel was a bit of a distance from our friend's home on the south hill & the hospital that she was in for part of the time that we were there, but not so far away that it was a big problem, since we had a rental car.", "title": "A++++", "user": "TEC4174", "date": "July 31, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 3.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 18472652, "likes": {"liked": "— Cleanliness", "disliked": "— The bathtub was stained"}}, {"rating": 2.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "The Pheasant Hill Inn was a lovely place to stay & I will definitely stay there again on my future visits to Spokane. I wish that they had a lovely view or were by the river or something like that but, that is the only thing that they lack and they excel in every other way!", "title": "just o.k.", "helpfulness": 1, "user": "octubre09", "date": "July 9, 2008", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 4.0, "cleanliness": 2.0, "value": 2.0, "location": 3.0, "rooms": 2.0}, "id": 17690520, "likes": {"liked": "— service in breakfast bar", "disliked": "— smelly pillows! no wireless internet"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "We came during the blackout in Westchester in the spring. I couldn't get a hotel anywhere, and I was about 6 months pregnant, so staying home in our freezing condo was not an option. We were without power for 4 days in our neighborhood. On a whim, on my way to the NYSC gym next door, I stopped in at the front desk to ask if they had any vacancies. Technically, they didn't, but they took one look at my desparate face in my superpregnant state and found something for me. Originally smoking, but when we came back after going home for our belongings, they even moved us to a non-smoking room. We were so grateful to the front desk staff for accomodating us!! The room was fine, we even brought our Foreman grill and made lots of grilled fish in the room last night (because otherwise, everything in our freezer at home was going to go bad). We enjoyed the pool and the Continental breakfast - no complaints about anything. Oh, and I should mention, they cut the rate superlow for us as well - everyone else was price gouging during the blackout! I would recommend this location to anyone for their supreme service. Did I mention the free internet? No restaurant on site but a diner at the end of the driveway, if one was so inclined, and an Italian restaurant and Wendy's almost across the street.", "title": "Amazing staff, excellent property!", "user": "Julie12881", "date": "October 7, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 82528874}, {"rating": 3.0, "stay_parameters": "Stayed May 2009, traveled on business", "text": "Hi stayed in this hotel for five nights to attend a conference at Westchester Medical Center. The hotel was clean. The room was standard and clean, however the walls were very thin and I could hear my neighbor's TV when i was trying to sleep. I liked that the room had a fridge. I was disappointed in the pool (small, indoor and can only swim when another guest is also swimming). If I had to attend a conference here again, I would probably return.", "title": "Good for business travel- no frills", "user": "travellinrosie", "date": "October 9, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 3.0, "service": 3.0, "rooms": 3.0}, "id": 46418311}, {"rating": 3.0, "stay_parameters": "Stayed October 2008, traveled on business", "text": "Clean, comfortable. Nothing especially bad or good. I read other reviews that did not like the beds or the pillows, so I brought my own pillow; however, the pillows and beds were fine, so I never needed mine.", "title": "Clean, comfortable", "user": "Arl02478", "date": "October 11, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 3.0, "location": 3.0, "rooms": 4.0}, "id": 20793740, "likes": {"liked": "— New, clean"}}, {"rating": 3.0, "stay_parameters": "Stayed January 2008, traveled on business", "text": "The walls were a bit thin-- I could hear a man with a rather loud voice next door-- but it was not so loud that it kept me awake, and I don't think very much different from many hotels.", "title": "Nice Place----BUT", "user": "meachac", "date": "October 7, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 5.0, "rooms": 5.0}, "id": 20699226}, {"rating": 3.0, "stay_parameters": "Stayed September 2008", "text": "The building is newish, the rooms therefore of reasonable size. I was only staying for one night, so when I was assigned a room close to the elevator I did not have it switched, but I would advise, due to the buildings V-shaped layout, getting a room further away from the central elevator, guest laundry, and ice/snack area. There was not a ton of foot traffic (it was Sunday night), but if it were busier that might have been an issue.", "title": "You get what you paid for with a little extra.", "user": "JedH", "date": "September 29, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "location": 4.0}, "id": 20481835, "likes": {"liked": "— Location, free wifi, free breakfast", "disliked": "— bathroom amenities, towels"}}, {"rating": 2.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "I had a terrible stay at this hotel. The halls were filled with noisy yelling children", "title": "Did not sleep at all second night", "helpfulness": 1, "user": "Caribe4Ever", "date": "October 16, 2011", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 3.0, "sleep": 1.0, "rooms": 4.0, "location": 4.0}, "id": 119372864}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "Into the early hours past midnight and I was unable to sleep", "title": "Great Rooms, Comfortable hotel", "user": "Carol839", "date": "October 16, 2011", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 119364929}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "Also the room was non smoking and it smelled like smoke in the room and", "title": "read before you sign", "helpfulness": 1, "user": "jerseywoman", "date": "August 8, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 4.0}, "id": 116442996}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "It got worse as the night went on. I stayed on the third floor. The front desk refused to move my room and they did nothing about the noise. They also refused to make a reduction on my bill. Very disappointed.", "title": "Clean, excellent service", "user": "familymontreal", "date": "June 23, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 114674498}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "This is really a motel, but quite comfortable, spacious rooms which are well appointed. It had everything we needed, a good place for luggage, nice sitting area, very comfortable beds. The pillows were hard, but the triple sheeting was a nice touch. Housekeeping did a good job. We stayed two nights and it was a fairly convienent location, not far from Tarrytown and Sleepy Hallow. We found our way to Kikuit (Rockefeller's Family Home), Sunnyside (Washington Irving's Home), Union Church with the Chagall and Matisse windows and other local attractions. A GPS is very useful to find this location, as well as to navigate the windy roads of the area. Although we were at the front of the hotel it was very quiet. The evening reception was not friendly, but the day staff was helpful and the breakfast acceptable.", "title": "Nice clean hotel", "user": "SlymanChicago", "date": "June 15, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 3.0, "service": 3.0}, "id": 113580069}, {"rating": 5.0, "stay_parameters": "Stayed January 2009, traveled with family", "text": "Oh my goodness I had a 14 hour drive from TX to CO. After 8 hrs to Lubbock I decided not to go to the hotel I had intentionally planned on going to which was another 2 hr drive. So I stayed here and the room was beautiful and comfortable I went to sleep w my socks on and by morning I was in such a deep sleep my socks were off by morning king sized be so awesome and complimentary breakfast make sure you get up for that it was so so so yummy! I am so going to stay here on my way back from CO! Too Awesome....!!", "title": "Comfort Inn Rocked My Socks off *Honestly*", "user": "BLANcantu", "date": "February 5, 2009", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 24265795, "likes": {"liked": "— So comfy so so comfy", "disliked": "— Nothing was disliked"}}, {"rating": 3.0, "stay_parameters": "Stayed July 2008, traveled on business", "text": "We booked a king bed \"suite\" at this hotel, so we were disappointed when we arrived to discover that it was not a suite. It was essentially the same as a regular hotel room, with a little shin-high wall separating the bed from the rest of the room. The reason we booked a suite is that we have an 8-month old baby who is a picky sleeper. He has to have it dark and quiet, and he goes to bed between 6-7 PM. So this meant that my husband and I ended up sitting in the dark all evening, with only the computer to entertain us. The room was so small that when we talked or moved around much, our baby woke up crying. So yeah, you could say we had a bad experience. However, the room was clean and comfortable enough. Had it just been the two of us, we would have been perfectly comfortable. I was a little put-out that they sell this as a \"suite.\" We talked to the employees at the desk and apparently they do have what I consider a real suite, but they were all booked up (supposedly). I wasn't too happy about that, but they did let us cancel our 2nd night there for no charge. We transferred to Embassy Suites (only place available on short notice), and that is a whole different story...", "title": "Fine, but didn't work for our purposes", "user": "saraallison", "date": "July 19, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "rooms": 2.0, "location": 3.0}, "id": 18040673, "likes": {"liked": "— Clean, not too loud", "disliked": "— The \"suite\" we booked was not really a suite!"}}, {"rating": 2.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "We have stayed here before and everything was fine. It was a fairly new hotel and everything seemed okay. This past July we stayed there again and the place is a mess. I started coughing within half an hour of checking into the room. I was joking with my wife that there was probably mold in the a/c unit. Sure enough, I looked into the vent and there was literally mold/fungus growing in the air conditioning. After that discovery I decided to check the bathroom vent and it was covered with dust and grime.", "title": "Going Down Hill", "user": "Slim_Pickings", "date": "July 15, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 1.0, "value": 2.0, "location": 4.0, "rooms": 4.0}, "id": 17921813}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled with family", "text": "It's a shame because the staff was great and everything else was fine, but I would check the room before I stayed in it.", "title": "Great Experience at the Comfort Inn", "user": "jljmyers", "date": "March 3, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 14021938}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled with friends", "text": "We were in room 115.", "title": "Very pleased with this hotel", "user": "SusieQNewMexico", "date": "March 3, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 3.0, "rooms": 4.0}, "id": 14019428, "likes": {"liked": "— room cleanliness", "disliked": "— liked everything"}}, {"rating": 3.0, "stay_parameters": "Stayed May 2007, traveled with friends", "text": "This is a decent and very average traveler’s hotel. It is within walking distance of downtown, the river and the Milwaukee Art Museum. It also had quick access to the airport by car. The continental breakfast was more than donuts and a carton of OJ. I expected to skip it, but it was fine. Hot made waffles, fruit, and boiled eggs. A nice surprise. They have a small night club attached to the lobby. It’s a little cheesy……. but, so over the top that we had a drink there anyway just to watch the 6 or 7 people in there…. I would stay here again", "title": "A Fine Average Traveler’s Hotel", "user": "TIBIDO", "date": "May 23, 2007", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 4.0, "rooms": 3.0, "location": 5.0}, "id": 7683724}, {"rating": 1.0, "stay_parameters": "Stayed May 2007, traveled with family", "text": "I was traveling with my husband, sister and her husband, and my mom and dad. Milwaukee was booked up for the weekend due to the Twins game (which we were there for) and college graduations. We were excited to find out that we could get a King Size suite with a pull out couch, microwave, fridge, etc... We figured we would all fit with the king size bed for my parents, the pull out couch for my husband and I and my sister and her husband would sleep on an aero bed we brought along. The room was usally $250.00, but my brother-in-law is in the National Guard and gets a military discount.", "title": "Be a little leary...", "user": "kruskor", "date": "May 22, 2007", "detail_rating": {"front_desk": 4.0, "service": 1.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 4.0}, "id": 7673902, "likes": {"liked": "— The location", "disliked": "— The customer service at the hotel itself!"}}, {"rating": 3.0, "stay_parameters": "Stayed April 2007", "text": "We walked in and were greeted by two friendly staff members. Check in was a breeze. We paid our $10.00 to park at the hotel for the night. Space was increduably tight and it was a little crazy trying to park. We parked and hauled all of our stuff in, rode the elevator to the 4th floor, got to our door, used the key card to get in and found that they had given us a single bedroom with only 1 King sized bed in it, NO couch and absolutely no room for any of us to sleep there for the night.", "title": "Middle of the Road", "user": "garpts", "date": "April 3, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 2.0, "location": 1.0, "rooms": 4.0}, "id": 7278644, "likes": {"liked": "— Bed", "disliked": "— Location, snotty staff in the lounge"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "We called the desk immediately and they said they were booked out for the night and that they needed to talk to the Manager. She would call us back. 25 minutes passed and we had not heard from the front desk. We called them again and asked them what they were doing about the situation. They said they were still waiting for the Manager to come back from running to the bank. We were very miffed by that time and were loosing our patience. We asked how long it would take the manager to get back from the bank, and they said 15 minutes. Meanwhile, we were sitting in a room that we did not reserve and pay for; we had been travleing in the car since 5 a.m.; we hadn't eaten lunch (my sister is pregnant and was starving!); and we had planned some touristy things to do before we would go to the Twins game and time was wasting.", "title": "Safe Location", "helpfulness": 1, "user": "bjeffreym", "date": "July 24, 2006", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 5503583, "likes": {"liked": "— cleanliness and bed rqst", "disliked": "— parking"}}, {"rating": 1.0, "title": "a disappointing stay", "text": "Luckily we had some time to look at the reading materials that they had on the desk. One of the pamphlets said that this hotel had a 100% Satisfaction Guarantee. It said roughly if you are not taken care of when problems arise and to your satisfaction, you would not pay for the night's stay. We were excited to see this as a sign that this hotel would do whatever they could to make this right. Boy, were we WRONG! The manager basically said there was nothing she could do...we were very unhappy and quoted the satisfaction guarantee back to her. She was not going to do anything. Finally, she said she could move us into a room with 2 queen beds. We said fine, let's do it, at least we would have 2 beds and maybe some room for the aerobed. The room was even smaller!!! We walked down to the front desk and asked to talk to the Manager in person. We told her how unhappy we were with the whole situation and how there was no way we could stay in that small room and still be expected to pay for it (citing again their 100% Satisfaction Guarantee). She wouldn't do anything else for us and said she would not comp. the room. We were done dealing with her and asked who was above her to talk to about our situation. She said there was noone else above her, but that we could call Choice Hotels Customer Service if we wanted to.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "February 11, 2006", "id": 4453366}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "When i read the reviews i was a little reluctant to book this hotel. I could have had a normal room for 109.00 but saw the one with a kitchen and fireplace for 129.00.", "title": "Great price for size of the unit.", "helpfulness": 1, "user": "reader1234", "date": "July 16, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115433383}, {"rating": 2.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "So i booked the one with the kitchen so we could cook our own meals instead of eating out.", "title": "Will NEVER be back--in fact, I'll never stay with Comfort Inn again...", "user": "BRR0407", "date": "June 6, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 2.0, "value": 1.0, "service": 3.0}, "id": 111754850}, {"rating": 1.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "When we arrived the hotel looks alright from the outside and this put my mind a little at ease about what other people wrote.", "title": "Do Not Even Consider", "helpfulness": 1, "user": "mysugarpie", "date": "April 7, 2011", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 1.0}, "id": 103207767}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "We checked in and when i opened the door to the room i couldn't believe how large this place was. There was a kitchen, livingroom, fireplace and tv in one room with lots of room to walk around. The bedroom had two queen beds and tv with lots of walking space.", "title": "enjoyable stay", "user": "bordersitter", "date": "March 30, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 2.0}, "id": 102179935}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled with friends", "text": "For the price this was a very nice unit.", "title": "Great hotel for the Big E!", "user": "TravelPixels", "date": "January 10, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "location": 4.0, "value": 5.0, "rooms": 5.0}, "id": 92464838}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled on business", "text": "Check in was a breeze, even though I arrived a bit early. My room was quite large, with a separate sitting area and bar area with fridge and microwave. All bedding and towels were clean and fresh smelling. I agree that the walls are a bit thin, but I found the hotel quiet nonetheless. Climate control was very convenient. The breakfast was average for this type of hotel, and it was kept very clean. I would definitely stay here again.", "title": "Clean with huge rooms", "helpfulness": 3, "user": "Bandlady", "date": "May 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 129428879}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "We stayed here on a family trip and were not disappointed. This hotel is clean and feels fresh and new. Our king-bedroom suite was very large with space for a couch (with hideaway bed), desk and chair and two wardrobes (one housed the flat screen TV, the other held our hanging items). The pool was attractively decorated and indoors, so useable throughout the year. There is a business center in the lobby with a computer, printer and small meeting table (could hold about 4 or 5 people). The free breakfast is served in an attractive alcove off the lobby and offers a full range of hot and cold items with a make your own waffle machine. A small fridge holds hard boiled eggs, yoghurt and butter. A variety of breads (two toasters), cereals, fresh fruit, juice, coffee, and tea round out this area. Staff at the front desk and service staff were very friendly and welcoming. We had a brief problem with a non-flushing toilet and it was fixed when we returned to the room from a short trip to the store. Rooms at the back of the hotel generaly overlook the glass pool roof (but you can't see the pool). We had an accessible room (though we did not need one, the hotel was full and this was the only one left). The concession to accessibility here was a larger bathroom with grabbars and signage on the door posted lower so that a person in a wheelchair could see it easily.", "title": "Clean, spacious rooms, well-maintained", "helpfulness": 3, "user": "sailingboat", "date": "April 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 129131047}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled solo", "text": "I stayed at the Comfort Inn & Suites last week. I was so pleased with the staff. I found them to be friendly, familar with the area and very professional. I was greeted by Gwen and Bryant with a big smile and friendly faces. I was traveling for the fist time by myself since my husbands death. The room was very clean and very nicely furnished. My first night Nikki (not sure if I spelled her name correct) was so sweet to direct me to a local supermarket and suggested a few places were I could get a bite to eat. Then the next morning was pleasantly suprised with the breakfast they offered. Again I was greeted by two lovely ladies who keep the breakfast area very clean. The owner of this property should be very proud of there staff. I can not wait to go back during the summer.", "title": "Staff with a Smile", "helpfulness": 3, "user": "Michele C", "date": "March 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 126984420}, {"rating": 3.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "I checked into the hotel on a Tuesday night, and was very annoyed by the lady that checked me in. First of all her appearance was very unprofessional. She had very long nails, which I know in that industry should be short and well manicured. This employee was not nice at all when I asked for a non smoking room. I understand the hotel was booked, but it's not that she could not get me into a non smoking room, it's her demeanor when informing me. Her name tag had MANAGER on it, well if that's one of your manager I'm sorry for your guests.", "title": "Rude Front Desk Employee", "helpfulness": 3, "user": "kat d", "date": "March 22, 2012", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 2.0}, "id": 126486687}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "The price is very reasonable for the value, service and definitely cleanliness that you get. The standard room with two queen sized beds was huge with a sitting area. The sitting area had two big chairs and a desk. There was a closet with iron board and iron in the room. The kitchen had a microwave, small fridge, and coffee maker. Aside from the nightstand, there's a phone on the desk and one in the bathroom. I always bring my own towels, pillow covers etc. but I didn't feel the need to use them here. I was very comfortable with the cleanliness of the place. The continental breakfast is limited, but it's just fine for some quick nourishments before heading out to enjoy the area. The gym, pool & sauna area are clean and open till 8pm. I had a room on the first floor close to the reception area, but noise was never an issue. There's also an Applebees right next door to the hotel.", "title": "This hotel is why I will join ChoiceHotels!", "user": "CrissyBelle", "date": "March 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 126449092}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled on business", "text": "The rooms, the service, the pool, the people, the breakfast - perfect, perfect, perfect! I have not stayed at a better place period! This is a must stay!!!!", "title": "The BEST Hotel!!!!! A+++++++++++++++++++", "user": "Televated", "date": "July 2, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 17455721, "likes": {"liked": "— Everything!", "disliked": "— Nothing!"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "We're from Red Deer, Alberta, Canada. We were only suppose to stay one night but ended up staying three nights. The front desk was amazing, so helpfully about restaurants, golf courses, malls, etc. We ended up getting the golf package. They called the course for us to verify directions then proceeded to print out a map for us. The baked goods and 24/7 coffee/tee always available to guests was great for early mornings and late nights. An Amazing hot breakfast (oatmeal, gravy and biscuits, waffles and fruit, egg wraps, bagels, etc) was fantastic. Pool and hot tub were great. Again the staff was amazing. Five Star in my opinion. Thanks Pheasant Hill!!!! You made our vacation great!", "title": "AMAZING SERVICE", "user": "SKCDN81", "date": "May 31, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 16548746, "likes": {"liked": "— Cleanliness, service, COST, location...all good", "disliked": "— n/a"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled on business", "text": "Spent two nights here. I checked in late and the front desk was still very helpful. The room was pretty new and large and the carpets were clean and everything was pretty nice.", "title": "Above Average!", "user": "PHXTrainer", "date": "May 2, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "business": 4.0, "cleanliness": 5.0, "rooms": 4.0, "location": 3.0}, "id": 15559588, "likes": {"liked": "— Comfy beds", "disliked": "— Not really anything.... maybe organic chocolates on my pilllow??? hehe..."}}, {"rating": 1.0, "title": "Mistake leaves family out in snow storm.", "text": "The beds were VERY comfortable, the internet worked well and parking was ample. The TV was a basic 26\" tube, nicer than the little 19\" tvs I have seen recently. There was a Micro and a fridge in the room. The hallways were bright and clean.", "helpfulness": 1, "user": "xrayer", "date": "April 3, 2008", "id": 14774091}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled on business", "text": "That being said, yes the neighborhood doesnt look nice but seriously, I am from Phoenix, how bad can Spokane really be??? I never saw any hookers or street people, which is more than I can say for the St Francis in SFO at 3x the price.... I doubt that anyone was waiting to steal my wallet. There is a hospital across the street and the neighborhood is basically commercial instead of upscale. Big deal. There is an Applebees across the street as well as a 7-11. Otherwise there isnt much food around.", "title": "Very Comfortable", "user": "Bobberdown", "date": "March 21, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 14433405}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled with family", "text": "We booked 2 rooms for 1 night, very happy with stay, very close to freeway. Our room was very cozy and clean, the bed felt like a California King, flat LCD screen TV was nice. Breakfast was good, boiled eggs, coffee, toast, bagels, cereals, oatmeal, sausage, etc. We would stay here again.", "title": "Nice hotel and clean", "user": "kjshurbet", "date": "June 1, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 5.0}, "id": 31322112}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "From the front desk clerks' assistance to the maids' service, this hotel was amazing!! The employees are extremely professional, helpful, and very courteous! I was very impressed with the ladies and gentlemen at this hotel!! I will honestly never stay anywhere else in Lubbock again!! The services were one-of-a-kind and unforgettable!! Thank you so much to your staff!! Our weekend get-away was AMAZING!!!!", "title": "Will Never Stay Anywhere Else Again- Simply Amazing!!!", "user": "KC_D_Ya", "date": "April 15, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 28050908}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled on business", "text": "I simply walked in and asked for a room at a reasonable price with certain critera. The two people behind the desk were very open and informative. All of the people working at this motel greeted me each and every time I encountered them. The room was very clean and quite. The location was perfect. Great access to the highway. I travel alot and have been in 5 different states and many cities,a different motel almost every night since June of 08. I would say this property and the staff are as good as it gets. The people will take care of you at this motel. Comfort Inn means Comfortable to be sure.", "title": "Comfort Inn means Comfortable to be sure.", "user": "kaybob", "date": "April 1, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 27206652}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "Everything was great from the moment we walked in the front desk girl was amazing we asked what there was to do in town where to eat movies entertainment and we went to our room and within an hour she had a list of places. The rooms were clean and well kept and the entire facility was wondeful.", "title": "Amazing Helpful Staff", "user": "nahbay", "date": "March 30, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 27119779}, {"rating": 5.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "Clean, close to everything and the front staff was very helpful. Highly recommend.", "title": "Fantastic Front Staff", "user": "mycohomes", "date": "March 26, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 26872771}, {"rating": 5.0, "title": "Wonderful get away", "text": "We selected Comfort Inn after looking for a Hotel that had a Whirlpool and reasonable price in the Springfield MA area. This was the only one found. My wife and I were looking for a quick get away after the holiday. The Hotel exceeded our expectations. The Whirlpool was perfect. Just right temp's. The gym had new excellect working cardio, weight equiment, the sanua was excellect. All are on the smaller scale, however perfect for our needs. Truely outstanding location, freindly service. The Beds were amazing, nice firm but soft pillow top. The breakfest once again exceeded our expectation. Make my own waffle. Fruit, donuts, yogurt, coffee, tea, juice, all free Newspaper and internet were all free and excellect. The one and ONLY complaint was the water pressure in the bathroom shower. It was weak. We booked for $100.00 per night and it was the greatest Christmas gift we could've ever given to ourselfs. I highly recommend it. We will visit again. BOOK IT AND ENJOY!!!!!!!!!!!!!!!!!!!!", "user": "MKROJ", "date": "December 29, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 12033702, "likes": {"liked": "— Spa", "disliked": "— weak water pressure"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "We stayed here for 2 nights while attending the BigE. The staff was very professional. The room was clean, bedding seemed new as the pillows were fluffy and the sheets had a high thread count. I say that because last year when we went to the BigE we made the mistake at staying at the Quality Inn which is less than a mile away and it was the absolutely filthy and disgusting. There are plenty of resturants nearby and the front desk has a sheet listing them all. We will definitely return next year to this hotel.", "title": "will definitely return", "user": "taylor130", "date": "September 28, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 10016285, "likes": {"liked": "— cleaniness and location", "disliked": "— nothing"}}, {"rating": 3.0, "stay_parameters": "Stayed May 2006", "text": "We stayed here because of the proximity to the Basketball Hall of Fame. We payed $80 a night for a king size bed with a couch which was very inexpensive for that area and a very large room. I didn't notice the decay of the place in our room. It also has an indoor pool and fitness room. It was only 4 miles away from the Hall which my husband REALLY loved and I thought a great deal.", "title": "good for the money", "helpfulness": 2, "user": "keeks2020", "date": "May 23, 2006", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "rooms": 3.0, "service": 3.0}, "id": 5191987}, {"rating": 1.0, "stay_parameters": "Stayed May 2006", "text": "...presumably. On the negative side, the toilet seat in our first room had traces of feces on it. When asked to clean the toilet, whoever was assigned the job apparently just wiped off the lid with wet toilet paper, which somehow ended up on the wash basin (yum!). The toilet seat, you guessed right, looked like before.", "title": "At least no cockroaches...", "helpfulness": 4, "user": "tobx", "date": "May 6, 2006", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "rooms": 2.0, "service": 1.0}, "id": 5039009}, {"rating": 3.0, "title": "Rapidly Fading Splendor", "text": "The reception lady -- with a fair amount of glares and sighing (apparently I was not supposed to interrupt her chat) -- did give us a different room that was clean enough.", "helpfulness": 9, "user": "coando", "date": "August 13, 2004", "id": 2445803}, {"rating": 2.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "We stayed one night to visit family and of course: The Big E. It was an easy hotel to get to and tucked away in a quiet office park off a busy main road; which is a big plus to me. There was plenty of parking and the check in/out process was easy. The room was decent but it needed a deep cleaning, new wall paper, and an airing out. It had that \"1001 people have slept here\" smell. The hotel was very quiet and we got a good night’s sleep and a warm cup of coffee for the car ride home the next morning. Would I stay here again? Probably not. Though if you need a somewhat clean, quiet, and safe place for 8 hours of sleep, it’s worth the $100.", "title": "No frillls...bring some febreeze..", "user": "Daphne418", "date": "October 1, 2008", "detail_rating": {"cleanliness": 2.0, "front_desk": 3.0, "location": 4.0, "value": 2.0, "rooms": 2.0}, "id": 20543620, "likes": {"liked": "— Location", "disliked": "— Dank smell in room"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "We have been to this hotel for the last 3 years and the hotel is better and the staff has been friendly and very helpful. I would like management to reward these employees for excellent service. Housekeeping was excellent and came early to clean the rooms.. They checked to see when we were leaving so that they were prompt and did an excellent job. We came for the Big E and this hotel had a shuttle bus and discount tickets to the fair.I enjoyed the bus and did not miss the traffic and parking going to the Big E. The hotel is off the busy road and in a safe and quiet area, not like most other hotels. The pool and hot tub are great. The breakfast area is good, average, and free. I would not even think of looking for another hotel if I was in West Springfield. The rooms are clean, staff excellent, and location great. If you could find a better hotel for the price let me know.This hotel seems to get better year after year. I'll be back.", "title": "Great hotel", "user": "Postman948", "date": "September 21, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 20259530, "likes": {"liked": "— Friendly staff and clean hotel", "disliked": "— Nothing- the weather was even great"}}, {"rating": 3.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "Great stay if you're looking to spend time at Six Flags New England (which was a horrible amusement park). They had by far the best Six Flag package.", "title": "Great Stay for the Price", "user": "Guamie", "date": "July 25, 2008", "detail_rating": {"front_desk": 2.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 3.0}, "id": 18233191, "likes": {"liked": "— price", "disliked": "— customer service"}}, {"rating": 3.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "The customer service was under par, but the rooms were clean and the location is not too far from shopping and chain restaurants like the Outback Steakhouse.", "title": "Okay hotel, nothing fancy", "user": "jvinci", "date": "July 7, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 2.0, "rooms": 3.0, "location": 3.0}, "id": 17625686, "likes": {"liked": "— the bed pillows!", "disliked": "— maid service wasn't up to par .. didn't get our towls replenished two days in a row!"}}, {"rating": 3.0, "stay_parameters": "Stayed April 2008, traveled with family", "text": "Its location is tucked away which makes it nice.", "title": "Not too bad.", "user": "dylanr1", "date": "April 26, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "business": 3.0, "cleanliness": 4.0, "rooms": 3.0, "location": 4.0}, "id": 15371723, "likes": {"liked": "— price", "disliked": "— Not easily accessible to the rooms."}}, {"rating": 4.0, "title": "We got our money's worth, great for Six Flags & Big E trips", "text": "We have stayed there several times in the past using Choice Hotel points and the AAA rate. Conveniet to Six Flag and the Big E (Eastern States Exposition).", "user": "wcstory", "date": "July 28, 2010", "id": 72780647}, {"rating": 4.0, "stay_parameters": "Stayed June 2010, traveled with family", "text": "Nothing fancy, but we didn't want to pay fancy price.", "title": "Queen Suite great for kids!", "user": "2superkidstraveling", "date": "July 3, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 69590287}, {"rating": 3.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "The 2 Queen Bed, 2 room suites are the way to go! This stay was a 2 day trip to Six Flag.", "title": "OK at this time of the year", "user": "Freedom50plus", "date": "May 24, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 4.0}, "id": 65142154}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled on business", "text": "We've only had one bad stay (loud, underage kids partying) and the pool wasn't heated out of all the times we've been there. A call to the manager after our stay and they made it right.", "title": "Fresh, New and Updated Property", "user": "WorkingHard12", "date": "January 5, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 52664687}, {"rating": 1.0, "stay_parameters": "Stayed November 2009, traveled with family", "text": "The hotel is tucked in an industrial park yet it's right down the street from dozens of food and shopping choices. We stay here when we go to Six Flags, which is a short distance away. The pool convienent but what we love is the 2 queen bed suites. The bedroom/bathroom close off with french doors and the other room has a full kitchenette with counter/chairs, a desk, couch and fireplace...so the kids can go to bed in the other room with that tv and you can watch tv in peace and not be on top of one another. The breakfast has enough choices that everyone should be happy and with the suites we usually brought it back to our own room.", "title": "Disappointing", "user": "Talking_Tony", "date": "November 23, 2009", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "location": 3.0, "service": 2.0, "rooms": 1.0}, "id": 49913666}, {"rating": 4.0, "stay_parameters": "Stayed December 2006, traveled on business", "text": "We stayed three nights at this property in early December of this year. The rooms were great - clean, comfortable and quiet. Only bummer was the hot tub was out of order...with 20 degree days it would have been a great place to unwind in the evenings. Front desk staff was extremely helpful in giving us driving directions around the area. Wouldn't hesitate to stay here again.", "title": "Great Place to Stay in Spokane Valley", "helpfulness": 2, "user": "SoCalTravelGirl16", "date": "January 5, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 6556137, "likes": {"liked": "— Clean, quiet and comfortable rooms!", "disliked": "— Broken hot tub!"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled with family", "text": "We stayed at this hotel in early October and loved it. The rooms were spacious and included coffee maker/fridge/microwave. The beds were very comfortable. The room was very dark at night and soundproof (we were on main floor on hill overlooking freeway and it was very quiet). There is free internet in room. Also a full business center with two computers/fax/printer, which we used and enjoyed..There is 24 hour coffe/tea/hot choclate available in the breakfast room which is right in the lobby. Everyday there are free fresh cookies available 5-7p.m (best peanut butter cookies ever).Breakfast is served from 6-10a.m. which was nice instead of waiting till 7. Quite a few choices for continental breakfast.The pool is small but nice but I found pool and whirlpool too chilly for me, my son said they were fine but kids will do anything for a swim. We loved staying at this hotel in the Spokane Valley.", "title": "loved this hotel", "helpfulness": 1, "user": "luvdisneyland", "date": "October 23, 2006", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 3.0, "rooms": 4.0}, "id": 6003704, "likes": {"liked": "— comfortable room", "disliked": "— cool pool"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "As mentioned in a previous review, the rooms are very clean, quiet & and the beds good quality but a little soft.", "title": "Very decent accomodation in Spokane Valley", "helpfulness": 1, "user": "Cbluez", "date": "October 20, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 5979276}, {"rating": 3.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "Fridge, microwave and a nice desk.", "title": "Very Average Hotel", "helpfulness": 2, "user": "mystieladie", "date": "August 31, 2006", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 3.0, "rooms": 2.0}, "id": 5731055, "likes": {"liked": "— 24 hour pool", "disliked": "— dated decor"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled with family", "text": "A good location for noise as it's set way back off of the interstate, except for a train around 1:15 am that insisted on honking over and over.", "title": "Great hotel!", "helpfulness": 1, "user": "hlbtimes2", "date": "August 1, 2006", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 5536052, "likes": {"liked": "— Great beds!"}}, {"rating": 2.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "We spent 1 night here. The room was clean but we kept having problems with the room key. We also requested extra towels but never got them. The hotel is a short walk from Catherdral Square where there are a couple of nice eateries and several great bars. Parking is tight so use a smaller car. The hotel is very near the lake shore so there is an opportunity for some nice walks. The Summerfest grounds are also within walking distance, about a mile.", "title": "Just OK", "user": "gregwhiz", "date": "October 24, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 2.0, "location": 5.0, "rooms": 2.0}, "id": 10302564, "likes": {"liked": "— Location", "disliked": "— Some problem with room"}}, {"rating": 3.0, "stay_parameters": "Stayed October 2007, traveled with family", "text": "We stayed here because it was within walking distance to the Milwaukee School of Engineering. The hotel is basic but very clean. The free continental breakfast was handy, good coffee! The only restaurant in the hotel is a lounge/club type that's open at 5pm.", "title": "Basic hotel, fine for short stay.", "user": "colleges", "date": "October 14, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "location": 3.0}, "id": 10076873, "likes": {"liked": "— Close to MSOE, continental breakfast, goof coffee", "disliked": "— Not convenient to restaurants. Rooms are pretty worn."}}, {"rating": 1.0, "stay_parameters": "Stayed May 2007", "text": "I don't know where to start! Living in Milwaukee, I choose Comfort Inn Suites to have my wedding guests stay, as it is across the street from our condo. I reserved a block of rooms in the beginning of May for my September 29, 2007 wedding; however, they never returned my phone calls so it took me forever to reserve. Due to the lack of service I received in the beginning of organizing my block, they gave me a reducted rate on my rooms, which I signed an agreement for. Now it's August and my guests are calling in to make their reservations and are getting charged the original rate AND were told that they are over booked on Sept. 29th and do not have a room for them!!! I still have yet to receive an explanation from Lisa and Valerie (office managers) why they are overbooked when I have had at least 9 rooms booked in advance with a signed agreement on file stating the dates I reserved. DO NOT STAY AT THIS HOTEL. You will be left on the street!!!", "title": "Worst Customer Service Ever!!!", "user": "MKEMilwaukee", "date": "August 6, 2007", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "location": 4.0, "rooms": 1.0}, "id": 8362562, "likes": {"liked": "— Customer Service"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled with friends", "text": "My friend and I stayed at the Comfort Inn on Thurs July 5th. I've stayed here 2 other times in the past 4 years when it was still called The Park East Hotel. I would say it definitely has been improved and the rooms remodeled since then. Our room was small but was nicely updated. It had fresh paint, new comforters/linens and a flat screen TV. The bathroom looked like new, they must've refurbished everything, including the tile. I have to say, the carpet in the hallway could be replaced. Check in was fast and easy (considering that Summerfest was going on) and we did pay the $10 to park in the lot. The parking lot is very small and difficult to get around. If you have a choice between driving a SUV or a small sedan, go with the sedan! This hotel has a great rooftop area that overlooks the lake. Nice to sit uptop and have a cocktail. We didn't get to try Aqua, but it looked cool. Walking distance to the Art Museum and the Summerfest Grounds. We will stay there again.", "title": "Nice hotel, nice price", "user": "MTGrafix", "date": "July 10, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 8091019, "likes": {"liked": "— Location", "disliked": "— small parking lot"}}, {"rating": 2.0, "stay_parameters": "Stayed June 2007, traveled with family", "text": "We stayed at this hotel for one night during Summerfest and found the staff to be friendly and helpful. The rooms were small but adequate and clean. The only problem we had was a very slow bath tub drain. Our rooms were ready at check in and they were both what we had requested. One room had a lovely view of the river. The beds were comfortable and the linens were clean. We were about a mile from the amphitheater but it was still a walkable distance for us.", "title": "A decent hotel for a short stay", "user": "vacationjoy", "date": "July 3, 2007", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 2.0, "value": 3.0, "rooms": 3.0, "location": 4.0}, "id": 8050786, "likes": {"liked": "— location", "disliked": "— rooms were a little small"}}, {"rating": 4.0, "title": "Was fine", "text": "We stopped at this Comfort Inn on a long drive around midnight without a reservation, and luckily they did have a room available. The hotel looked new, and the room we had was spacious and clean; the bathroom was very bright and clean looking. The free continental breakfast was not the best, but it was adequate. For $90 I thought it was overpriced, but then given we did not have a reservation I guess it was ok.", "user": "ats262m", "date": "August 21, 2007", "id": 8466889}, {"rating": 1.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "The only good thing I have to say about this hotel was they processed my online confirmed hotel booking for one of their rooms. That was fast and plesant. Here is where plesant stops cold and the nightmare begins.", "title": "Sad Joke Hotel", "user": "LouisianaWingnut", "date": "July 18, 2007", "detail_rating": {"front_desk": 3.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "location": 2.0}, "id": 8176543, "likes": {"liked": "— How fast it took to check in.", "disliked": "— We were given a messy room that took two hours for staff to arrive and clean!!"}}, {"rating": 2.0, "stay_parameters": "Stayed December 2005", "text": "The elevator ride to our floor was SLOW and with no air conditioning, we felt trapped in a sauna.", "title": "Not again!", "helpfulness": 4, "user": "SmokiesBrynn", "date": "March 7, 2006", "detail_rating": {"cleanliness": 2.0, "value": 3.0, "rooms": 2.0, "service": 1.0}, "id": 4592172}, {"rating": 2.0, "title": "What an ordeal!", "text": "We arrived, three hours AFTER the suggested check-in time--and found our room door WIDE OPEN. Inside, both beds were stripped of linens; the used ones were covering the floor--and evidently had been used!! And we waited nearly two hours till the non-English speaking housekeeping staff finally cleaned up the messy room!!", "helpfulness": 4, "user": "A TripAdvisor user", "date": "August 23, 2005", "id": 3799703}, {"rating": 4.0, "title": "Clean and pleasant", "text": "This alone ruined our stay in Chattanooga.", "helpfulness": 2, "user": "dutchandfree", "date": "June 23, 2005", "id": 3607503}, {"rating": 2.0, "stay_parameters": "Stayed August 2008, traveled on business", "text": "-Is an older hotel modernized (slow elevator, narrow halls, low cellings)", "title": "Look Else Where", "user": "DisneyFan30", "date": "August 31, 2008", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 2.0, "value": 2.0, "rooms": 2.0, "location": 5.0}, "id": 19588674, "likes": {"liked": "— Downtown Location", "disliked": "— service, small rooms, parking"}}, {"rating": 3.0, "stay_parameters": "Stayed June 2007, traveled with family", "text": "-No Pool", "title": "Location, location, location", "user": "uwgirl65", "date": "June 16, 2008", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 4.0, "cleanliness": 3.0, "value": 3.0, "location": 5.0, "rooms": 4.0}, "id": 16959814, "likes": {"liked": "— Location", "disliked": "— Parking"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "-Water runs hot/cold in showers", "title": "Great Location", "user": "MinnesotaVisitor", "date": "May 20, 2008", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 5.0, "rooms": 4.0}, "id": 16253660, "likes": {"liked": "— Location", "disliked": "— Parking"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "-small bathroom, no place to set things, rusty vents hanging over shower, dirty & mildewy shower head", "title": "nice place", "user": "mertie", "date": "March 31, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 4.0, "rooms": 3.0, "location": 4.0}, "id": 14681615, "likes": {"liked": "— location", "disliked": "— parking"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "-reserved & paid extra for lake view room, was a city view, in order to see the lake you had to crane head side ways and stand on chair. Asked to be moved to another room we were told they were full.", "title": "Absolutely the best!", "user": "LinneaPearson", "date": "January 4, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 12324840, "likes": {"liked": "— Uniquie, and it had great employees!", "disliked": "— That I couldn't stay longer."}}, {"rating": 3.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "When we first arrived at the hotel I thought the room was decent for the price that we paid and the location was really good. We stayed in a suite and it had a nice ktichen area and was roomy. At the time I stayed it appeared as though there were only 2 other couples staying in the hotel besides us. I put out the do not disturb sign before we went to bed just in case the maid service came around before checkout. Sure enough, at 6:30 they were banging on the door so I told them that we were checking out today and that they should come back later. They came back at 7, 7:30, and 8:00. By 8:00 we were so annoyed that we just ended up checking out. In most hotels we have stayed at, when you are checking out of a room they just wait before you check out before cleaning your room.", "title": "decent room for price but rude maids", "user": "kristeep", "date": "November 15, 2010", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 4.0}, "id": 87152141}, {"rating": 3.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "This hotel is situated close to interstate connections. It appears to be in need of an overdue update as the decor is quite dark and dated. The rooms are small by Comfort Inn standards. The location is convenient but not particularly pleasant as it is lost amongst industrial and business units between I91 and the Connecticut river. Having now visited the area, we would have probably chosen the Hampton Inn on Riverdale Road just around the corner. Breakfast was adequate with cereals, baked goods, hot waffles, hard boiled eggs, juice, staring at 6 am which was good to allow us an early start driving up to Vermont. We found this hotel fairly expensive given the location, the size of the rooms and how \"tired\" it looked. OK for a night's sleep, no more.", "title": "Not the best Comfort Inn we have stayed in", "user": "turkeyrun23", "date": "October 27, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 2.0, "sleep": 4.0, "rooms": 2.0, "location": 2.0}, "id": 85006678}, {"rating": 3.0, "stay_parameters": "Stayed October 2010, traveled with family", "text": "Rooms were a little on the small side but they were clean and the staff friendly. I would stay again.", "title": "Fine. Nothing Fancy.", "helpfulness": 1, "user": "dwthibodeau", "date": "October 14, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 83422521}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "My husband and I decided to take a trip up to the Big E and found this hotel to stay at. Our room was clean and it was at a great location close to restaurants and also the Big E. The beds were comfortable although I am not a fan of down pillows. Overall I would probably stay here again. It's very hard to find decent hotels that aren't gross. I rate this a 4-4.5 out of 5.", "title": "Clean and Convenient", "user": "crystalc359", "date": "October 8, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 82583403}, {"rating": 3.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "We stayed here as our first pick place was full. We were tired and had been on the road for over twelve hours. The check in was smooth and the guy at the desk very friendly and helpful. The hotel does not have an elevator, we had to walk up a flight of stairs carrying our bags. The rooms on our floor all had that little no smoking symbol on them but I could smell a strong odour of cigarette smoke in the hall. The furniture in the room looked very well used, missing handles on the dresser, and one drawer was completey missing. It made the room look a little \"used.\" The shower had a poor quality of water pressure and the curtain was on a straight not curved rod so it touched you when you were taking the shower.I don't like a hotel room shower curtain to touch my skin as I always wonder if it has actually been changed!", "title": "OK, room a bit tired,smelled cigarette smoke in the halls", "helpfulness": 1, "user": "nsjetsetters", "date": "September 23, 2010", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 80765408}, {"rating": 3.0, "stay_parameters": "Stayed March 2010, traveled with friends", "text": "We had a group of 12 guys come down for the NCAA tournament at the Bradley Center. I contacted the Comfort Inn and they gave us a very good rate. The hotel was decent, nothing special, but served our purpose. Rooms were definitely not of the 'suite' size. Breakfast choices were just ok. Very close to the lakeshore and Summerfest grounds. Great area for those that like to run or walk. They did not clean some of our rooms (after we told the maid we were leaving in an hour or so and to come back then), so that was a little disappointing, but we didn't complain. Fitness center was ok, but sounded like a couple of the machines didn't work very well. Wireless internet worked fine. Overall good value for the price we got, but a few disappointments. About a mile to the Bradley Center which was certainly walking distance for us.", "title": "Good price, decent location", "user": "Family-with-four", "date": "March 23, 2010", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 59338325}, {"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "This hotel is in a very good location within easy walking distance of restaurants, parks, bars, shops and sights. We left the car in the parking lot and walked everywhere in Milwaukee from the hotel. Better than average Comfort Inn.", "title": "Excellent Location in a great city", "user": "travelpassion", "date": "March 6, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 57896299}, {"rating": 2.0, "stay_parameters": "Stayed January 2010, traveled with family", "text": "We traveled to Milwaukee to attend a family wedding. It was very cold, and the rooms were either so cold that they had to bring in a space heater or too warm. The hallway on the 5th floor felt like there was air conditioning running. The continental breakfast was the worst we have ever encountered. Everything stale and hard, except the waffles. Our room never got cleaned the first day. The bathrooms are very small with absolutely no counter space. The location is wonderful, but I'd avoid it in the winter.", "title": "Skip this in the winter", "user": "GrannyGNc", "date": "February 2, 2010", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 55007288}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled on business", "text": "Just blocks from the Lakefront, I love the view from my room. Front desk staff was very nice. Parking was tight just like any other downtown. I love the bar next door in Aura, beautiful Nightclub, and food was good. Guest room was nice and cozy.", "title": "Beautiful location on Lake Michigan and downtown", "user": "johnwebber", "date": "October 29, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 48014488}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "Nice hotel, clean rooms,pool restaurant close by and free breakfast", "title": "enjoyed Comfort inn", "user": "davecind", "date": "November 19, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 22006773, "likes": {"liked": "— clean", "disliked": "— parking"}}], "location": {"country": "United States", "city": "Lubbock"}, "stars": 2, "variance": {"poor": 9, "average": 16, "very good": 17, "terrible": 3, "excellent": 35}, "aka": "Comfort Hotel Lubbock", "slim_ranking": 0.327272727273, "description": "Comfort Inn & Suites, a Lubbock Texas hotel near Texas Tech University.The 100 percent non-smoking Comfort Inn & Suites® hotel in Lubbock is conveniently located near Buddy Holly Center and Cactus Theater. This Lubbock, TX hotel is also minutes from the Lubbock Preston Smith International Airport and Joyland Amusement Park, and blocks from businesses in the east side industrial area. Texas Tech University and Lubbock Christian University are also located in the area.The American Wind Power Center and Museum is also located minutes away. Additional area attractions include downtown Lubbock Depot District, Science Spectrum & Omni Theater and Buffalo Springs Lake.Your Morning Breakfast is full of hot and delicious options, making breakfast at the Comfort Inn & Suites the perfect way to start your day. Enjoy our free hot breakfast featuring eggs, meat, yogurt, fresh fruit, cereal and more, including your choice of hot waffle flavors!Guests of this Lubbock, TX hotel can take advantage of free local calls and will enjoy the large indoor pool, hot tub and sundeck. The fitness center includes a treadmill, universal gym and stair climber to help guests stay fit on the road.Business travelers will appreciate the speakerphones and access to copy and fax services.All guest rooms at this Lubbock hotel feature refrigerators, microwaves, cable television with HBO, large desks, hair dryers, sofa sleepers, irons and ironing boards.Suites with two rooms or whirlpool bathtubs are also available. The two-room suite has a kitchenette with living area, separate bedroom and large vanity and bathroom. These suites are ideal for families, business executives needing extra work space or long-term guests. The whirlpool suites will put guests in a romantic mood during a weekend stay, or give that hardworking business traveler a stress-reducing evening prior to another hard day of work.The perfect location and convenient access to area attractions makes the Comfort Inn & Suites hotel a great place for business and leisure travelers in the Lubbock, Texas area."}