{"user_rating": 4.5, "review_count": 215, "name": "Comfort Suites Chincoteague", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "My Bride and I stay here, we had a nice time hotel was clean, love the water view, just not much of a balcony. The breakfast left me hungry, not into dried bacon and water flavored oj. Staff was very friendly, if not for the breakfast and balcony I would give 5 stars.", "title": "A Night Alone", "user": "Mike M", "date": "July 22, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 168645561}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "We visit Chincoteague a couple times a year and always stay at the Comfort Suites. It is always a good stay with a nice breakfast. We asked for an upgrade and were upgraded to the third floor waterfront view.", "title": "Visit to chincoteague", "helpfulness": 1, "user": "WVUFanNorfolk", "date": "July 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 168457190}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "Stayed here 3 nights from 7/2 - 7/5, 2013. Stayed in room 210 which was a very large and quiet 2 Queens Bed suite with a partial room divider with a terrific balcony view of Chincoteague Bay and the causeway to the mainland. This hotel was ranked #4 of 17 hotels when I last checked on Trip Advisor - it should be #1 in my opinion. I had considered the other 3 hotels when reviewing Trip Advisor before we went but am glad I chose this hotel. Comfort Suites had slightly lower rates than Hampton Inn, which is located right beside this hotel. Comfort Suites has an outdoor pool (small) in addition to an Indoor pool (only hotel on island, I think, that has both). The grounds/landscaping/views of both were similar. The complimentary breakfasts sound similar. We passed by the other 2 hotels rated higher on our 10 minute drive to the Refuge/Seashore each day and the properties did not seem to match the quality of the Comfort Suites from the outside or for views. The only advantage I could see for staying at those 2 hotels is if you planned to ride a bike to take to the beach that those 2 properties would offer a plus being closer in distance to the entrance to Refuge/Seashore.", "title": "This hotel should be ranked higher on list of Chincoteague Hotels", "helpfulness": 1, "user": "jeff84deb", "date": "July 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 167422508}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "The Comfort Suites interior is very Chincoteague Pony themed with lovely prints of the ponies in various settings displayed on the walls throughout - we had 3 prints outside our room by the elevator area. Hotel was a 2013 Finalist for Comfort Suites awards (saw plaque). The ladies at the front desk mentioned that most of the guests rave about the Wildlife Refuge Tour (a bus tour sponsored by the Chincoteague Natural History Assoc (buy tickets at Educ & Admin Center near entrance to Refuge/Seashore - less expensive than boat tours to see ponies - $12/adult vs $40-50/adult for boat). We took this tour and saw several small herds of ponies very closeup from the bus.", "title": "Comfort in a good location", "user": "spheare", "date": "July 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 167402622}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "The beds were very comfortable with many pillows, the nice-size flat screen TV had many channel choices (it takes a few minutes for the Phillips TV to \"warm up\" & display a screen and the remote buttons must be firmly pressed). There was a sofa and chair by a coffee table and a small table with chairs in the partitioned area between the bed area and the balcony. The entrance hallway was very long/spacious. A microwave, coffee maker and small refrigerator and ironing board and room safe were provided. The bathroom was good size with a strong water pressure (sink light burnt out but was quickly replaced). The complimentary breakfast was well-stocked with good variety, including hot eggs, sausage, waffles and the breakfast area was large enough to accommodate all. Coffee was always available in the lobby as well as cookies in the afternoon.", "title": "Lovely room with a view of the water", "user": "plural39", "date": "July 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 166621223}, {"rating": 4.0, "stay_parameters": "Stayed August 2013", "text": "Our room was close to elevator and ice maker but it was quiet. We had plenty of room and a half deck with view of the water. Wifi is free, there is a mini frig, microwave, and coffee maker. Indoor and outdoor pools were nice and never crowded. All the cute shops and restaurants were walking distance away. Bfast was typical except the eggs were weird. They nake cookies every pm and coffee is available all the time.", "title": "Great location, nice amenities", "user": "seethesightsUSA", "date": "August 26, 2013", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 174133581}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "Stayed here with a military discount. First night my husband and I arrived late (with a reservation) and got the last available room. It was on the first floor in a corner (126) and the view was definitely not what we expected--a great disappointment. The room and balcony were very large and would be great for someone with kids who was going to be out and about most of the time and didn't care about what we wanted to do, which was spend time chilling on the balcony and watching the boats go by and enjoying the sunsets. We asked to be moved and was told no other rooms were available, however we might be able to move the next day. Brenda at the front desk called shortly after we went back to the room and told us there was a third floor room available in the morning and if we wanted to go out, staff would be happy to move our items. Long story short, we were moved the next day to a smaller room with a smaller balcony and a much better view. Morning desk staff was very friendly and made sure we were happy and we actually ended up extending our stay. Breakfast was OK for us--we had the hard boiled eggs, fruit, yogurt, toast, bagels, waffles and coffee. Also available was juice, milk, pastries, scrambled eggs and breakfast meats (varied from day to day). Coffee and hot water for tea and cocoa is available 24 hrs and ice cold lemonade and tea were offered in the afternoon. Pools were not crowded at all, grounds and facilities were well kept, toiletries were plentiful and rooms were clean and air conditioning, 'frig and coffee maker worked well. Great water pressure in shower! We enjoyed several mornings and evenings on the balcony watching the peaceful water views of ducks, dolphins, boats and people fishing on the boardwalk in front of the building. The hotel is a short walk to the town shops on Main Street and on Maddox Street and to the city park, which had a nice concert the weekend we were there. We could return to the hotel for a short time and go back out without a long walk and parking was never a problem, even when we returned later at night. Only suggestion would be for the hotel to replace some of the older bed pillows. Those in the first room were nice, but the second room's pillows, though plentiful, were shrunken and not very comfortable. We would stay here again.", "title": "Very nice hotel", "user": "01AMK85", "date": "August 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 172302524}, {"rating": 5.0, "title": "Definitely coming back!!!", "text": "Our room could not have been any more perfect! We were on the second floor and our balcony had a pristine view of the channel and bridge. We actually saw four dolphins swim right in front of our balcony! The staff was most helpful as the reservations we had made at another place of business did not pan out. The people at the desk were very friendly and gave us tips on where to go in the area. Will definitely come back here again!!!", "user": "booboom2013", "date": "August 10, 2013", "id": 171643519}, {"rating": 4.0, "stay_parameters": "Stayed August 2013", "text": "Really nice hotel on the island. It is on Main Street, so easy walking to shops, restaurants and fun. Only a few blocks from both the bridge to the island, and the road to Assateague. Kind and helpful staff. The suite was clean, well appointed, and quiet. Thanks for a great stay!", "title": "Welcome comfort!", "user": "Tatiana L", "date": "August 9, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 171547913}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "I just completed a two-night stay at the Comfort Suites, Chincoteague Island. It was my first time to the area, and I visited with my tween daughter and her friend, who I just picked up from camp at the nearby marine institute. My choice of hotel was predicated on price, backed up by ratings on TripAdvisor. Thanks to a military rate, the Comfort Suites was by far the most reasonable choice among the top-rated hotels on the island, and I was not disappointed.", "title": "Really Enjoyed Our Stay. Reliable Choice.", "helpfulness": 1, "user": "NellieVA", "date": "July 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 169530790}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "Loved the deck, couch in the room, and general feel. Grandkids loved the pool. Handy for visiting the National Seashore. Didn't see any ponies until we were back in town at the rescue center. But the shell collecting was great. Smart Minnesota Mama had brought jackets, hats and mittens so the children were warm enough and could run barefoot in the sand. Great memory.", "title": "Wish we had another night", "helpfulness": 1, "user": "Linda G", "date": "May 31, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 162485255}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "My daughter and I recently stayed at Comfort Suites for a Mother/Daughter week-end getaway. The hotel was clean, the rooms were large, the hotel is within walking distance of many shops and attractions. There is a large, private deck outside of each room that was very relaxing. The room also included a refrigerator and microwave which comes in handy when traveling. The staff was very helpful with any questions and the complimentary breakfast was a nice bonus. We had just stayed at the Hilton in Virginia Beach the previous week-end and we were just so surprised how much nicer and more enjoyable the Chincoteague Comfort Suites hotel was in comparison. We thoroughly enjoyed our stay and hope to return again soon.", "title": "Excellent hotel", "user": "velmasue2", "date": "May 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 162355113}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "This hotel is clean, fresh, well kept and good price/value. The staff was very helpful answering local questions and suggestions. Would recommend on return visit. Breakfast is very diverse and area kept clean.", "title": "Staff excellent help", "user": "dpksa", "date": "May 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 162126768}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "All of the rooms face the waterfront and have balconies which provided a beautiful view of the sunset each night. Our room was large with two queen beds and a sitting area with couch, chair, and desk. The room also had a microwave and mini fridge. There are several shops and restaurants within walking distance of the hotel. The hotel also has an indoor pool and jacuzzi as well as an outdoor pool. There is also a nice area outside along the water for walking. The complimentary breakfast included your standard cereals, fruits, toast, and hot items such as eggs and bacon or biscuits and gravy. There are also two waffle makers. The exercise room is a good size with free weights, two treadmills, and an eliptical. We never really noticed any noise from other rooms or the hallway, so it was nice and quiet. The staff was so friendly. Only complaint would be that we could never get a strong wireless signal and was slow. Overall, it is a great hotel and we enjoyed our stay very much.", "title": "On the Water", "user": "stella306", "date": "May 25, 2013", "detail_rating": {"cleanliness": 5.0, "service": 5.0}, "id": 161827213}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "Great hotel on Chincoteage Island. Rooms and bathrooms are very large and have a balcony overlooking the waterway. Exceptionally clean with a very nice breakfast including two kinds of waffles, egg and sausage sandwiches, yogurt, muffins, cereal and fruit. Staff was very helpful. Walking distance to restaurants and downtown area. Loved this hotel!", "title": "Excellent stay!", "user": "kklammers", "date": "May 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 161737273}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "We selected this hotel sight unseen and were not disappointed during our week-long stay. The room was very comfortable with a western view off the balcony that made for spectacular sunsets. The staff, especially the ladies at the front desk, were very helpful with questions about the local area as we did a lot of bike riding and exploring. The outdoor pool was great for relaxing after our morning bike rides. We will be back!", "title": "Excellent accommodations, service, and views!", "user": "Joan S", "date": "July 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 166105910}, {"rating": 4.0, "stay_parameters": "Stayed June 2013", "text": "Stayed here for one night on a driving holiday. We had a waterfront room but our assigned room was very close to the pool. We requested a change & this was dealt with very efficiently & pleasantly by Margie.", "title": "Clean, comfortable, great views", "user": "mrssandgrounder", "date": "June 30, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 165825109}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "The room was large & comfortable with a balcony (with furniture) which gave a stunning view across the water.", "title": "You will love the most amazing sunset ever behind this hotel on the water!", "user": "nicole s", "date": "June 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 164652942}, {"rating": 3.0, "stay_parameters": "Stayed June 2013, traveled on business", "text": "The room was very quiet. We couldn't hear any other guests when inside. It had everything you are likely to need... fridge, microwave, coffee maker, iron & board, safe... We didn't use the fitness room although it looked perfectly adequate.", "title": "Good for vacation, ok for business", "user": "Caleb W", "date": "June 13, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 2.0, "rooms": 4.0, "location": 5.0}, "id": 163892809}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "Breakfast was included & was fine for me & my husband (although we are just coffee & toast people). Hot food items were available & people seemed to enjoy making their own waffles.", "title": "Love the location!", "helpfulness": 2, "user": "PatMillsboro_DE", "date": "June 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 163796521}], "location": {"country": "United States"}, "stars": 2.5, "variance": {"poor": 1, "average": 15, "very good": 63, "terrible": 0, "excellent": 136}, "aka": "Comfort Suites Chincoteague Hotel", "slim_ranking": 0.166666666667, "description": "Located in the heart of historic downtown Chincoteague, the Comfort Suites hotel offers the ideal way to enjoy all the beauty, history, recreation and adventure of Chincoteague Island. Whether its business or leisure that brings you to Virginia's only resort island, Comfort Suites lives up to it's name from the moment guests enter the lobby to be greeted by friendly, attentive staff. \"Comfort\" continues to be the operative word throughout the hotel, from the 87 oversized suites with waterfront views and spacious work and sitting areas, to on-site amenities that include a newly remodeled fitness center, indoor and outdoor pools, free continental breakfast and morning paper, guest laundry, fax & copy service, meeting facilities for 50 and free high speed internet service. Best of all, when it's time for fun, the options are endless on this small island. In town, there's great shopping, dining, galleries, boat rentals and fishing excursions. A visit to Chincoteague National Wildlife Refuge on Assateague Island offers guests the oppertunity to catch a glimpse of some of the 260 species of birds as well as the wild Chincoteague ponies. Additionally, miles of biking and hiking trails wind through pine woods, marshes and freshwater ponds. Built in 1833, the Assateague lighthouse is a favorite attraction, as is the Assateague Island National Seashore, offering over 37 miles of unspoiled beachfront for swimming and water sports. Hotel guests also enjoy the NASA Visitor's Center as well as antique shopping, miniture golf and scenic day cruise excursions."}