{"user_rating": 4.0, "review_count": 1265, "name": "Comfort Inn Manhattan", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed June 2005", "text": "My wife and I stayed at this hotel because we were in town for a Yankee game and do some sightseeing. We arrived a little early (around 12ish), and I stopped in to find out about parking and early check in. Basically was barely given the time of day by the lady at the front desk. She told me where I could get discount parking (18.00 per day), and said my room wasnt ready but didnt offer any time estimate of when it would be. I stopped back and asked two more times (at 2, and then 2:45), and did not even say anything when I could finally check in. She was continually rude the remainder of our stay, and a letter will be sent to them regarding her. Anyways, the room was ok. We stayed on the 11th floor, and elevators were definately an issue. Slow is an understatement. The hotel needs some TLC. Our room was clean, but the bathroom is small, the AC is front a window air conditioner. The room was a decent size though. The location was good. There was a subway stop a couple hundred feet away from the front door, Times Square was a 15 minute walk, some good diners/coffee shops were close (breakfast). Ground Zero and Statue of Liberty were easily accessible by subway, as was Yankee Stadium. I wouldnt stay here again on the next trip to NYC. The subway is so easy to use, I would probably stay outside of the city, and utilize mass transit to avoid parking and hopefully pay reasonable prices for food.", "title": "Ok hotel, good location, some rude service", "helpfulness": 7, "user": "rjkcpktrips", "date": "June 27, 2005", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "service": 1.0}, "id": 3613381}, {"rating": 2.0, "title": "Not our best choice", "text": "Room for 2 for site seeing and Yankees game, only 1 night stay. Cant say that I would venture back to the same hotel in NY. Yes, Alex was great, he advised multiple things to see and gave decent directions. Only 1 of 2 elevators were working on the day we stayed, making the wait a little long. The elevators were about a 5x5 size so not many people (luggage) could even fit for the trip up or down. Getting off on the 7th floor, the entry flooring was damaged and in bad need of repair. The room was just as bad. Yes we had what looked to be clean bedding and towels. The air conditioning was a well worn window unit and I also noticed the heating system enclosed in a wall cover that was really out of shape. The drapes and sheers would not open properly over the window unit, so we had to utilize chairs to hold back the drapes so the air would flow into the room. We did not need to use the tiny closet area. The bathroom was really the laugh of the day. The sink was probably a 1 1/2 foot by 1 foot size, really small and there was a glass shelf placed below the mirror to hold glass, tissues, etc. Well, trying to brush my teeth and utilize the sink was a chore. Either you bang your head on the glass shelf or stoop over to use the sink. The toilet was crammed between the bathtub and wall. If I was a larger person, I would not have been able to utilize the toilet. The toilet paper roll was directly next to the toilet causing even less room. The shower was hot and that was about the best of the entire room. We stayed because we did not really expect to spend much time in the room anyway. The continental breakfast was a joke. My husband went down to get a light snack for me. The mechanical toaster was broken and you had to manually place the toast or bagel on the rack and watch it carefully to turn with tongs. A 9.99 replacement toster would have done the trick. Not much to choose from, toast, bagel or cereal. And he had to walk down the stairs becuase the elevator was apparently stuck. Well, we did the town, it was a good location and the bed was comfortable. Want to see the Yankees again, will try another place to stay. I recommend not to use room 708.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "June 23, 2005", "id": 3607763}, {"rating": 3.0, "stay_parameters": "Stayed June 2005", "text": "We (2 adults + 2 17 year-olds) stayed at the Comfort Inn for 4 nights at the start of June. It's a bit basic, just about clean enough and in need of a coat of paint but if like us you are only going to use it to sleep in (about 5 hours a night!), more than adequate for a sight-seeing based trip. The lifts get some stick but generally behaved OK although being on the top floor there could be a slight wait sometimes. There are only two small lifts (5 people each max.) so if you got there at a busy time - we saw 3 large school parties arrive during our stay - there could be problems.", "title": "Sight-seeing central!", "helpfulness": 8, "user": "A36", "date": "June 7, 2005", "detail_rating": {"cleanliness": 2.0, "value": 4.0, "rooms": 2.0, "service": 4.0}, "id": 3536066}, {"rating": 2.0, "stay_parameters": "Stayed June 2005", "text": "The famous Alex deserves his reputation. A mine of knowledge who steered us towards some great sight-seeing tours and eateries. Got the impression that he might be making a buck or two out of his recommendations but wouldn't begrudge him that as the tours we took were excellent. Overall the service from all the staff was helpful and polite.", "title": "Not awful, but not good, for whatever that's worth...", "helpfulness": 3, "user": "ramblingrose", "date": "June 6, 2005", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 2.0, "service": 4.0}, "id": 3533285}, {"rating": 4.0, "title": "Everything you'll need", "text": "Location is superb. 2 minutes from Macys, Broadway, the Empire State and the subway. Also right opposite is the Metro Hotel with a fantastic roof terrace. Late night cocktails on the 14th floor over-shadowed by the ESB was one of the highlights of our trip. We also had a sneaky look around the Metro while we were there and I have to say if you can get good rates it would be a good step up from the Comfort.", "helpfulness": 13, "user": "A TripAdvisor user", "date": "May 19, 2005", "id": 3484559}, {"rating": 3.0, "title": "First time in New york", "text": "My husband,myself, and our 3 children stayed here during spring break. We found the staff to be very friendly and helpful. The breakfast was okay, after all, it is a continental breakfast. The elevators were an issue, so we took the stairs, luckily we were only on the sixth floor. The location was great! The price was the best we could find. I did notice that some of the other people staying there were not so nice to the staff, and in return they were not going out of their way to help them. The room was clean, but the halls are in need of repair. We would stay again.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "September 17, 2005", "id": 3911224}, {"rating": 4.0, "stay_parameters": "Stayed July 2005", "text": "The location was wonderful! The room was clean and quite large even if the wash-basin was unconfortable because it was really small. Only a lift worked but we didn't have any problem.", "title": "Good choice!", "helpfulness": 8, "user": "Salsera012", "date": "August 12, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 3757005}, {"rating": 5.0, "stay_parameters": "Stayed July 2005", "text": "Breakfast was included in the price and it was great!", "title": "good, great location", "helpfulness": 9, "user": "browniebearjune2010", "date": "August 7, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3744106}, {"rating": 2.0, "title": "better off somewhere else", "text": "Overall great, the only problem was one of the elevators did not work. But the staff was nice and the room was well decorated, clean and more spacious than other NY hotels I have been stayed in. The lobby is very pretty. The hotel is located less than a block from the subway and close to great bargain shopping like Macy's, Daffy's, Lush, Victoria's Secret, H&M and Conway. We had a great view of the empire state building. We had a Southwest airlines discount so the total price (with tax) for 2 nights stay was $300, which was fine with me. Happy overall. I would certainly return again.", "helpfulness": 8, "user": "LorSanClemente", "date": "July 17, 2005", "id": 3675492}, {"rating": 4.0, "stay_parameters": "Stayed June 2005", "text": "We were unlucky enough to pick this hotel for a one week stay. The only good points I can say are that the location is within walking distance of many attractions, the hot water came quickly for showers, and when we asked for a refrigerator it was delivered right away.", "title": "Great Location!", "helpfulness": 12, "user": "ghirl123", "date": "June 27, 2005", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 3.0, "service": 4.0}, "id": 3613690}, {"rating": 4.0, "stay_parameters": "Stayed October 2005", "text": "Having read previous reviews of this hotel, I wasn't sure what to expect. I was pleasantly surprised by every aspect of my stay. The staff were extremely polite and helpful (particularly Alex) and seemed to know the area really well. Brilliant location - within walking distance of loads of sights & shops. The room itself was clean, tidy and a very reasonable size with a good sized (& very clean) bathroom. The breakfasts were lovely - good selection of delicious bagels, cakes, cereals etc. The ONLY downside was that the heating system in our room was noisy first thing in the morning, lots of pipes clanking as it started up, but this was bearable as we were getting up early anyway. Overall I would recommend this hotel and would definitely stay here again if I return to the city.", "title": "Really pleased with hotel", "helpfulness": 4, "user": "Toastie", "date": "November 2, 2005", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 4080722}, {"rating": 4.0, "title": "Very Pleased", "text": "My wife and I stayed at the Comfort Inn Manhattan for 4 nights and were very pleased. From previous reviews, we were not quite sure what to expect, but we were pleasantly surprised. Both elevators are now working and we had no problem getting to and from our room. We had a King room which was small, but very comfortable. The carpet was kind of old, but the bedding and furniture looked very nice. We were not bothered with any noise at all. We never heard any noise from the halls or rooms close to us nor did we hear any street noise. The staff was extremely friendly and very helpful. The location of the hotel was top notch. We were right around the corner from the Empire State Building and Macy's and within short walking distance to numerous popular sights. Great shopping on 5th avenue is just around the corner also. There are several very convenient subway entrances close to the hotel. We were very pleased and would highly recommend this hotel for a comfortable and affordable stay. If you are looking for a plush hotel however, this is not the hotel to stay in. If you are looking for comfort, affordability, location and friendly staff, you will be very pleased.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "October 28, 2005", "id": 4069525}, {"rating": 4.0, "title": "great holiday", "text": "We stayed at the Comfort for 4 nights and had a great time even though it rained every day. The staff at the hotel were very helpful and friendly, Alex gave us plenty of tips. We had a room on the 4th floor which was clean and tidy although we had no view as the only window led to the fire escape but that was not a problem. The breakfast was good and set us up for the day of sightseeing. The location of the hotel is excellent and all the sights are in walking distance. We would definately go back again. Had a great time.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "October 19, 2005", "id": 4034454}, {"rating": 4.0, "stay_parameters": "Stayed October 2005", "text": "The Comfort Inn Manhattan is located on 35th Street between 5th and 6th Avenues. Turn left out of the hotel entrance, and you are in Herald Square and Macy's in under 5 minutes. The hotel is about a 10-15 minute walk from Times Square. Brendan's Bar & Grill is located at the hotel, and that is where the free continental breakfast is served each morning. The breakfast included cereal, doughnuts, other pastries, toast, bagels, apples, coffee, orange juice, and apple juice. The menu at Brendan's provides decent prices on a fairly good selection of food. They are open for breakfast, lunch, and dinner, as is the adjacent Anesis Cafe, also at the hotel. Alex at the front desk seems to know everything about New York, so he is an excellent person to ask if you are unsure of where you are going, especially if you've never been to New York before. The front desk staff is also multilingual. Subway entrances are also located near the hotel, about a half-block away. The room, although not spacious, was clean and well-maintained. Our room had a king bed and a sofabed. When the sofabed was pulled out, there was no room to walk between that and the king bed, so that was a bit of a problem, but for New York, we felt the room was more than adequate. The only two issues to complain about the room are that the lighting was poor and the drain in the tub was slow. The hotel only has one working elevator, and that did cause us to wait a couple of times for about 5 minutes, but most of the time it did not seem to be a problem. Stairs are an option, although we never had to use them. The other elevator is under renovation, and has been for several years, according to other reviews I've read. Overall, I would recommend this hotel, and we may stay here if we visit NYC again.", "title": "Great place to stay on our first visit to NYC!", "helpfulness": 15, "user": "AGS_guy", "date": "October 17, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 4028947}, {"rating": 2.0, "stay_parameters": "Stayed October 2005", "text": "Why my friend raved about this hotel I will never know. After a protracted booking in at the front desk, the room I was finally given was clean, but small and dark. Good points are the staff and the free breakfast. The hotel really needs a rate cut, a full clean up and some decoration. Oh and please fix the lift.", "title": "OK, just", "helpfulness": 2, "user": "Godders1968", "date": "October 10, 2005", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "rooms": 2.0, "service": 4.0}, "id": 4004575}, {"rating": 4.0, "stay_parameters": "Stayed September 2005", "text": "We stayed at this hotel for 7 nights and found it to be very good. Some reviews made me worry a little, but everything was fine. The location was fantastic, right in the heart of NY city where you can walk to just about anything. The room wasnt too bad in size, except for the double bed which was as a little bit of a tight squeeze and we are not huge people!", "title": "Prefect Location", "helpfulness": 8, "user": "buffsstar", "date": "October 3, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 3985418}, {"rating": 3.0, "title": "Wonderful Hotel", "text": "Breakfast downstairs in Brendons bar was great, plenty of things to choose from. The staff were excellent and helped us out a great deal. I would stay here again if im in NY", "helpfulness": 8, "user": "A TripAdvisor user", "date": "September 28, 2005", "id": 3945771}, {"rating": 3.0, "stay_parameters": "Stayed September 2005", "text": "My friends and I traveled to New York in Sept of 2005. For weeks beforre t he trip we would check out the reviews of our hotel and although most were positive, there were those who did not have a good experience, and all commented on the slow elevators. Well we had a thourouhly enjoyable stay at this hotel. Did not find the wait for the elevator long, rooms were very clean and of a good size. Staff were very friendly and helpful. The area and convenient location was fabulous. Would recommend to anyone and would stay there again.", "title": "Great Location, Ok Place to Stay", "helpfulness": 9, "user": "SLWNovaScotia_Canada", "date": "September 27, 2005", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "service": 3.0}, "id": 3942251}, {"rating": 4.0, "stay_parameters": "Stayed September 2000", "text": "After reading all of the reviews about this hotel, I wasn't sure what to expect, as there were as many good reviews as bad. We stayed here for 4 nights and found the place OK. It is old building, but clean, staff is very friendly & helpful and the location was great. Only one of the two elevators was working, but a five minute wait isn't really a big deal. I was with two other ladies and we felt very safe walking around the area after dark. I think for the price we paid the place was better than I was expecting after reading the reviews. The room had a microwave and fridge, so we were able to come back and have a cool drink. People have to keep in mind that in New York City, if you can get an OK place for less than $200 per night, you shouldn't expect real luxury accommodations and we were in the room only long enough to shower and sleep so I would recommend this hotel as an OK place and a great central location.", "title": "Second trip to New York", "helpfulness": 10, "user": "JosieB6", "date": "September 25, 2005", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 3.0, "service": 4.0}, "id": 3937640}, {"rating": 4.0, "stay_parameters": "Stayed September 2005", "text": "This was our second trip to New York, we had previously been in April 2004 and stayed at the Ameritania.", "title": "Fantastic Location!!!!", "helpfulness": 7, "user": "clarabella27", "date": "September 18, 2005", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 3.0, "service": 4.0}, "id": 3913210}], "location": {"country": "United States", "city": "New York City"}, "stars": 2, "variance": {"poor": 90, "average": 218, "very good": 543, "terrible": 32, "excellent": 382}, "aka": "Comfort Inn Manhattan Hotel New York City", "slim_ranking": 0.453724604966, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.5, "location": 5.0}, "description": "This New York City, NY hotel offers the ambiance of a small European hotel. Superior amenities and features include free breakfast with hot waffles, free coffee and free weekday newspaper.Business travelers will appreciate conveniences like free wireless high-speed Internet access in all rooms and access to fax services.All spacious guest rooms have irons, ironing boards, voice mail, safes, hair dryers and cable television. In addition, many rooms come equipped with sofa sleepers, microwaves and refrigerators. Non-smoking rooms are offered.Accessibility and value are just two of the many reasons to select the Comfort Inn Manhattan. Our guests will experience personalized service from our attentive and friendly staff. The Comfort Inn Manhattan is affordably elegant."}