{"user_rating": 4.5, "review_count": 86, "name": "Comfort Inn Columbia Gorge Gateway", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "This hotel is not impressive as you drive up. A rectangle, 3 floors, looks like a million others. But inside all is updated. Latest furniture, bedding, carpet. Fridge, micro, ample plug-ins for electronics. Good lamps and pillows. Guest computer in lobby. Free breakfast is above average too. AND in late afternoons soup and cookies served. 1:00 PM ckout which is unheard of. Not one but two daily newspapers. Pleasant desk folks too. So much better than other medium priced places we've stayed. Highly recommended.", "title": "We were impressed", "user": "Tootsie7", "date": "April 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 158804712}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "The Front Desk staff of a hotel can make the whole stay good, bad or just another bed on the trip. The staff here made the whole one night stay a treat. Recommended a good restaurant. Was very nice. Rooms were very clean, nice. Breakfast was more than just a waffle. Bacon, eggs, biscuits and gravy, fruit, yogurt,..... very pleasant stay.", "title": "Staff very helpful", "user": "Pat W", "date": "April 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 158365917}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with friends", "text": "Booked this room after scrutinizing TripAdvisor reviews. We stayed here after driving westward through the Columbia River Gorge. We found it quite comfortable and pleasant, had no complaints at all, would certainly recommend it.", "title": "Fine place to stay", "user": "Moniquepeep", "date": "March 21, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "location": 5.0, "service": 5.0}, "id": 155271555}, {"rating": 5.0, "stay_parameters": "Stayed March 2013", "text": "This hotel is pretty basic, but it is good value. We had a family suite which was large, lots of room to spread out. Breakfast had choices for us all. Not a fancy hotel, but a good, clean, pleasant one.", "title": "Great hotel for the money spent", "user": "JMS75", "date": "March 20, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 155166648}, {"rating": 3.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "I am only giving an average rating based on the room itself, housekeeping and breakfast.", "title": "mixed", "user": "Glamma4", "date": "January 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 149104262}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled solo", "text": "This was the friendliest, most sincere welcome I've ever had upon entering a hotel. Loree was extremely helpful with info and maps for the spots to see along the Gorge and recommending a great walk nearby along the river for the pup. Later, Rian steered me to a fantastic Lebanese restaurant in Portland. It was like he knew exactly what I was looking for.", "title": "Felt like home", "user": "Gus N", "date": "May 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 162065343}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "The room was totally clean and comfortable with all the trimmings at a wonderfully reasonable price. Internet was good. I can't think of a single thing that might have been improved upon. They were having some exterior work done, but were extremely considerate about limiting noise or nuisance. It seemed as though consideration for the guests was utmost at this location. What a delightful change from the average experience.", "title": "Nice stay", "user": "Aneesh D", "date": "May 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 162063002}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "I highly recommend a stop here if you're in the area.", "title": "Awesome home base", "helpfulness": 1, "user": "Teresa A", "date": "May 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 160177760}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "We did a last minute booking and could get a King size bedroom under $100. The room was neat with all facilities that we would expect. It is around 10miles from Multnomah falls and 5 from Vista house. Opposite there is an decent sized outlet mall.", "title": "Lovely Surprise", "user": "YogaFoodFan", "date": "May 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 159407803}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled on business", "text": "Had a free breakfast and it was pretty good. Great experience all together.", "title": "Easy access and friendly staff", "user": "Gary R", "date": "April 27, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 158940435}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with friends", "text": "The beds are very comfortable. We stayed two nights with a large group for a wedding. The rooms are nice, clean and quiet. You don't hear your neighbors. The suites are spacious and I like the fridge being behind the cabinet door under the flat screen TV. The staff is terrific. The manager, desk, housekeeping and maintenance were all so nice and helpful. This was a large wedding party with lots of rooms and they had everything we needed including a shuttle. We took over the breakfast room from 10am to 1pm arranging our flowers and they were very accomodating. Lots of parking too. Would highly recommend to anyone traveling up the Columbia River.", "title": "5 stars! Great room and top shelf staff!", "user": "AlaskaScubaGirl", "date": "December 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 148019571}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled solo", "text": "I stumbled onto the Comfort Inn Colombia Gorge Gateway by getting terrified at the Motel 6 across the highway while searching for a room at almost midnight. I had given up and was going to head on to Cascade Locks when I found the Comfort Inn.", "title": "Wonderful Management and Great Room", "user": "Piercedlibrarian", "date": "December 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 147977922}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled with friends", "text": "Needless to say the Comfort Inn was an amazing find. The manager, Loree was helpful and friendly. We bonded over a South Pole chat. Loree was well informed and fun to talk to, but sadly, it was almost midnight and I was exhausted, so our chat was brief.", "title": "Oregon trip 2012", "user": "paws4me", "date": "October 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 142656417}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "The room was clean, spacious, and comfortable with a flat screen TV, huge comfortable bed, and well lit mirror with several plug in options all over the room. I couldn't hear any road noise or any other clients at all. There was a hot breakfast in the morning with quite edible biscuits and gravy, toast, juices, bagels, cream cheese, and coffee.", "title": "Convenient place to stay when exploring the Columbia River Gorge", "user": "TNLady60", "date": "October 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 142101819}, {"rating": 4.0, "title": "Great hotel for Columbia Gorge.", "text": "I would have never intended to stay in such an oddly dodgy area, but now that I know about this little gem tucked away on the other side of the freeway- I would absolutely stay here again.", "user": "Valerie34099", "date": "September 28, 2012", "id": 141494525}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled with friends", "text": "Recently stayed here one night. It was one of the better motels that I have stayed in. Room was nice with a large LCD TV. A really great facility. I just wish it was withing walking distance of restaurants and shopping. It was more expensive than what I am used to paying, but it was compatible with the nearby competition.", "title": "Very nice, but a little pricey", "user": "Tomcod", "date": "June 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 165561365}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "It had a very nice complementary breakfast.", "title": "Handy location", "helpfulness": 1, "user": "sydaus3", "date": "June 27, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 3.0}, "id": 165424501}, {"rating": 3.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "This hotel is undergoing remodelling so there is scaffolding around it. However, this did not affect our stay as the room was clean, comfortable and quiet. The staff was friendly. The hot buffet breakfast was good. The only down sides were the pool and the room plumbing. The tap was installed the wrong way in our room, so when I turned the cold water on to have a drink, I got hot water (forgot to mention it to hotel so I hope they fix it soon).", "title": "So-so hotel stay...even though the staff was great", "user": "angie n", "date": "June 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 1.0, "rooms": 3.0, "location": 3.0}, "id": 165336189}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "It is close to a small airport, but they seemed to have double glazed windows which cut out the noise. It is very close to the town of Troutdale for shopping and restaurants.", "title": "Excellent Stay- Easy way out of Portland!", "user": "aztstorm", "date": "June 22, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 164841248}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled on business", "text": "Booked this hotel through Priceline...stated they had a pool and hot tub. Did NOT. BAD PRICELINE!!", "title": "Always Great!", "user": "SeattleTim", "date": "June 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 163525412}], "location": {"country": "United States", "city": "Troutdale"}, "stars": 2.5, "variance": {"poor": 1, "average": 11, "very good": 26, "terrible": 2, "excellent": 46}, "aka": "Holiday Inn Express Portland - East Hotel Troutdale", "slim_ranking": 0.4, "description": "Welcome to the Comfort Inn Columbia Gorge Gateway! Our hotel is located 10 miles east of Portland International Airport at the gateway to the Columbia River Gorge National Scenic area featuring majestic Multnomah Falls. Activities and wonders abound in this land of rugged cliffs, sweeping vistas and cascading waterfalls. Start your morning out right with our complimentary hot breakfast including meat and eggs, biscuits and gravy, fresh waffles, plus a great selection of breads, cereals, muffins, yogurt, juice, and fruit. Spend your day hiking the Gorge, enjoying great food and shopping in Troutdale and on the river, or just relax and enjoy the day with a stroll by the Sandy River. Spend your evening wine tasting at McMenamin's Edgefield, featuring three restaurants with an onsite distillery, winery and a brewery. All of our guest rooms are fresh and sparkly from our May 2012 renovation and include a microwave, refrigerator, coffee-maker, and iron and board. We are a pet friendly facility and will be happy to give you directions to the best places to take the pup for a romp. To keep you connected we offer free wireless high-speed Internet access and a business center in the lobby. Looking forward to seeing you soon!"}