{"user_rating": 4.5, "review_count": 231, "name": "Comfort Inn Shady Grove", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled with family", "text": "My husband travels a lot with business and is a Priority Club member at a number of chains. We normally choose Hampton Inns for their not-too-fancy, but extra clean and comfortable atmosphere. This particular Comfort Inn in Gaithersburg, MD was comparable to all of the nicest Hamptons in cleanliness, service and comfort. We had absolutely no complaints. The value was excellent and the distance from DC just fine. On one day we took the hotel shuttle to the metro station and received excellent service from the shuttle driver. We decided to walk back to the hotel from the metro station in the evening and that was a quick and easy walk on flat, city sidewalks.", "title": "Perfect Hotel Experience", "helpfulness": 2, "user": "Byrddenest", "date": "March 21, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 26553467}, {"rating": 5.0, "stay_parameters": "Stayed February 2009, traveled on business", "text": "Another day we drove into DC in our personal vehicle and had no troubles whatsoever. I highly recommend this hotel.", "title": "A bit far from DC but worth it", "helpfulness": 1, "user": "TeresaupstateNY", "date": "February 25, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 3.0, "service": 5.0, "rooms": 4.0}, "id": 25163150}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "The staff at this Comfort Inn on a busy corner makes every effort to be terrific hosts, and it makes all the difference. It's a 10 minute walk to the Shady Grove metro stop, but they also have a free shuttle. It took about 35 minutes on the metro to get down to Farragut North station on the same line (red).", "title": "Loved it - Perfect for trips to Washington DC", "helpfulness": 1, "user": "TheFoxBrain", "date": "January 14, 2009", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 23554162, "likes": {"liked": "— Ease to get to DC", "disliked": "— No pool in September"}}, {"rating": 5.0, "title": "Would recommend this hotel for visiting DC", "text": "It's all squeaky clean, the bed is very comfy and there are tons of pillows. The place is older, and the heat was a bit noisy, but they maintain it very well. The touch that got me is a new (and gratis) bottle of spring water at the bedside every night.", "user": "pacific2", "date": "October 2, 2008", "id": 20571731}, {"rating": 4.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "The breakfast is included, and there are fresh waffles, eggs, cereals, juices. No fresh fruit or yogurt. There were always friendly and intelligent people at the front desk who were interested in helping us to find restaurants, a good place for a morning walk, how to get to the metro, etc. It sure beats staying down in DC for $250+ per night for a room, no breakfast, and an impersonal staff. We're glad we gave this place a try.", "title": "Loved it even though there was no electricity!!", "user": "mullii4", "date": "June 8, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 16774607}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled with family", "text": "We decided to stay here on recommendations from our neighbors and got a great AAA rate. The rate was under $95.00 for weekdays and weekends as well. Quite a substantial savings from closer DC hotels. First off, the hotel is a little hard to find. My GPS had us lost and couldn't find the hotel. If you exit at Shady Grove, be sure to stay in the far right lane and after a few sets of lights, you will see the sign on your right. You have to turn right at that corner and the entrance driveway is right there. The hotel is very clean and not what I expected for a Comfort Inn. The foyer has beautiful marble floors. The staff were excellent and very helpful. The complimentary breakfast was great. There is a free Wi Fi connection and guest laundry. The room fit our needs but there were a few things that bugged me. The beds were just full beds and pretty small for two people. The rooms overall seemed small. The maids start cleaning very early and often were at it by 8:00 am. They had the vaccuums running at that time. The pool closed early at 8:00. This hotel overall was very quiet. That is if you shut your air conditioner off at night as that was a bit loud. The location is close to the Metro. You could walk it but I wouldn't. It was about 40 minutes into the city by Metro. Overall, what you get far exceeds the price they charge. The distance while a little inconvenient wouldn't keep me from staying here again. Great budget hotel. One more thing to note is that this hotel has recycling bins right in the rooms. I have never seen that before and I was impressed with that.", "title": "This Hotel Was Worth The Savings", "helpfulness": 2, "user": "Msia52", "date": "June 27, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 3.0, "service": 5.0, "rooms": 4.0}, "id": 33330971}, {"rating": 3.0, "stay_parameters": "Stayed April 2009, traveled with family", "text": "We stayed at this hotel for 3 nights with two children, aged 7 and 4 for a visit to Washington DC. We chose this hotel because it was what we could afford - those hotels closer to DC were prohibitively expensive. We also needed a hotel that could accommodate all four of us in one room. We had a room which was clean and tidy, although somewhat old and tired. It was very quiet, and had everything we needed. The kids don't share a bed well, but we had room to make up a bed on the floor.", "title": "\"Comfortable, but what about the Environment?\"", "helpfulness": 1, "user": "OurGrandDayOut", "date": "June 17, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 2.0, "service": 4.0, "rooms": 3.0}, "id": 32532873}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled on business", "text": "The hotel is the last stop on the Redline Subway and took around forty minutes each way. The hotel supplies a complimentary shuttle to and from the subway station on request, which we were able to use and found it very efficient (cab fare from the station was $11).", "title": "Great Hotel at a Great Price!", "helpfulness": 1, "user": "mct1977", "date": "June 2, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 31422540}, {"rating": 3.0, "stay_parameters": "Stayed May 2009, traveled with family", "text": "Hotel staff were very welcoming, friendly, and helpful. They told us about nearby restaurants, and we would recommend the Indian just a few doors down.", "title": "Nice but not enough room to move.", "helpfulness": 1, "user": "Kalamazoo5", "date": "May 25, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 3.0, "service": 4.0, "rooms": 1.0}, "id": 30727110}, {"rating": 3.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "The price of the room included a breakfast each morning. This works well for us as the kids are always hungry early. The selection was good enough, but we were appalled by the amount of plastic (cutlery, plates, cups, bowls, condiments etc) - all thrown out, often many sets per person as people return to the buffet. As most hotels are striving to be more environmentally friendly - and this one too asked guests to please conserve bath-towels - how can this still be practiced? In our view a bad choice for the environment.", "title": "Value, however expect minor issues", "helpfulness": 2, "user": "NYaverageJoe", "date": "April 30, 2009", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "location": 3.0, "service": 4.0, "rooms": 2.0}, "id": 29086017}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled on business", "text": "I stayed here for a week long training conference and had a very pleasant stay. The staff were very helpful and my room was clean and comfortable. The hotel is older, but they have done a very nice job keeping it clean and presentable. The breakfast room was quite crowded in the mornings so it would be nice to see them expand this area or open a second seating area.", "title": "Pleasant staff", "user": "wednesday2281", "date": "May 11, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 15935565, "likes": {"liked": "— Friendly Staff", "disliked": "— Business Center was not very private"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "I consider myself a pretty stern and traditional person when it comes to customer service. I think that in all service industries like the hotel business the customer should come first, and in this day and age it is rare to see a hotel that lives up to this expectation. However the Comfort in at Shady Grove did just that.", "title": "An outstanding hotel, considering the location and the price.", "helpfulness": 2, "user": "wvtalbot", "date": "April 6, 2008", "detail_rating": {"cleanliness": 5.0, "front_desk": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 14830458, "likes": {"liked": "— The helpfulness of the staff.", "disliked": "— Nothing really, it definitly is not a five star hotel, but for the price and location it is excellent all around."}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "I arrived early with two kids on a Saturday at around noon, expecting to not be able to check-in till late that evening after I returned from the kite festival, I walked in and asked for directions to the Metro station. The front desk clerk offered to let me check in immediately, which was a great relief after spending several hours in a cramped car with two small children.", "title": "Great value with excellent services for the Gaithersburg area", "helpfulness": 1, "user": "CAFamilyRvwr", "date": "March 30, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 3.0}, "id": 14665544, "likes": {"liked": "— Services included in with the hotel room", "disliked": "— The beds could use some updating"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled on business", "text": "The room was neat and modern, and clean to exceed my expectations. The staff was very helpful in providing local information to the guests.", "title": "A great hotel at a great price", "helpfulness": 3, "user": "JolieIthaca_NY", "date": "March 2, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 13983679, "likes": {"liked": "— The cleanliness of the rooms", "disliked": "— The elevators are away from the service desk which risks security"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled on business", "text": "On Saturday night, at around 10 O'clock, some sort of youth group had apparently checked-in to several rooms on my floor. The kids were being rather loud as kids often are, and I could hear them running up and down the hall. After about three minutes of this I pout on my slippers and prepared to go down to the front desk to complain. But before I opened a door, I heard a member of the staff talking in the hallway to who I assume was one of the adult leaders of the group. He was very polite but firm that other people were sleeping on the floor and they needed to quiet down. I never heard another thing from outside the room that night.", "title": "Great Hotel for the price", "helpfulness": 2, "user": "TravelFan58", "date": "February 29, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 3.0, "rooms": 4.0}, "id": 13948904, "likes": {"liked": "— Cleanliness, room ammenities"}}, {"rating": 1.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "We stayed two night over the 4th of July weekend. The rate was very good for Washington DC. We were given a room on the top floor which was very nice. Even though the hotel is in the city and on a busy highway, it was quiet. We used the shuttle to the metro stop and it was fine. (Note, the metro parking lot are free on weekends, you can park your car and not have to rely on the shuttle). The breakfast was very good for a free hotel breakfast, nothing fancy but better than most. There is a local pizza/submarine place next door which is good for a quick meal.", "title": "Good Value", "helpfulness": 2, "user": "Robbed_John", "date": "July 19, 2009", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "location": 3.0, "service": 1.0, "rooms": 2.0}, "id": 35185441}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "We stayed in July 2009 and the staff was there for our every need. They have a shutlle if your going to the Metro to go into DC. Metro station is only a few minutes away by car or shuttle. Our rooms were very nice clean and it was quiet.", "title": "This place is great!", "helpfulness": 1, "user": "robin5082", "date": "July 19, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 35117255}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "The morning free breakfast had a large selection of doughnuts, muffins, fruit, juices, eggs,cereal and they had a great make your own waffle maker and more in a large room with great decor and tv. The pool and park in the back was very nicely landscaped. There are places to eat within walking distance that are family friendly. We got a pamplet from the desk for Capital City Sightseeing which picked us up ($48.00", "title": "Great Place for DC Stay", "user": "SoloPapa", "date": "July 18, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 35084318}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled with family", "text": "per person) at the hotel and drove us to Arlington where we had time to walk and see the changing of the guard and then on to all the memorials with a stop at the old post office for lunch. We were the only people on our tour so it was like having our own personal driver for the day. We took a trip through Georgetown and then the drive brought us back to the hotel it was about an 7 tour. This was an excellent way to cover a lot in one da yand we loved our drive Madood. Taking the Metro was really safe and it was easy to get to The Smithsonian. We really loved everything about this location in the suburbs but good location to access DC. Love, Loved Loved it! Hats off to the staff they were the nicest I have ever encountered at a hotel. Oh year and we only pd $87.00 per night what a steal!", "title": "Nice place to stay", "helpfulness": 1, "user": "msar1076", "date": "July 3, 2009", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "location": 3.0, "service": 3.0, "rooms": 3.0}, "id": 33841608}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled with family", "text": "I chose this hotel after reading other good reviews. They were right. Great place (after we found it - GPS was being uncooperative). It was clean and comfy. Hotel staff was friendly and helpful. Hotel is about a mile from the Shady Grove station of the Red Line, but the hotel provides a free shuttle. FYI - the shuttle is a six-passenger van, and is first come, first served. We watched one guy make a fool of himself by throwing a fit because he had to wait for the shuttle.", "title": "Many amenities and friendly staff", "helpfulness": 1, "user": "Please_G0_away", "date": "July 1, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 3.0}, "id": 33695168}], "location": {"country": "United States", "city": "Gaithersburg"}, "stars": 2.5, "variance": {"poor": 4, "average": 20, "very good": 69, "terrible": 4, "excellent": 134}, "aka": "Comfort Inn Shady Grove Hotel", "slim_ranking": 0.133333333333, "description": "Seven stroy brick building with interior corridors."}