{"user_rating": 4.0, "review_count": 152, "name": "Comfort Inn Boardwalk", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed October 2005", "text": "Stayed one night on Oct 28, 2005. Great Hotel ! Large, clean room right on the ocean. Large Bathroom, plenty of towels etc. very friendly staff, very safe secure place to stay. Free Breakfast [Coffee, juice, cereal, Danish, Muffins and a free USA Today. Would Stay Again", "title": "Great Price", "helpfulness": 7, "user": "DavyGGG", "date": "October 31, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 4074804}, {"rating": 2.0, "title": "It was just OK", "text": "We just got back from a one night stay (9-29-05) at the Comfort Inn Boardwalk in Ocean City. We were in room 101, oceanfront. This room is directly in front of the lounges and the pool. We were informed of this when we booked, but were told the pool closed at 6 pm. It was cool out so we did not have to worry about anyone swimming. However, if this were summer I would never book a room on the ground floor. Too noisy, everyone can see right in your room, no privacy whatsoever.", "helpfulness": 4, "user": "Penney1000", "date": "October 1, 2005", "id": 3983084}, {"rating": 3.0, "title": "Acceptable", "text": "Our room was OK, 2 double beds (why every hotel doesn't have queens I do not know), a sleeper sofa, small equipped kitchen and fairly good sized bathroom.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "September 16, 2005", "id": 3908722}, {"rating": 5.0, "stay_parameters": "Stayed August 2005", "text": "Our problems were these - property is older, carpet in halls needs to be replaced, there is sand along the baseboards, our room had several areas where the wallpaper was sticking up, the room needed a good dusting, fixtures were dusty, toilet paper holder was dusty and above all the dustiest thing was the plastic case the hairdryer was in. There was something wrong with the drain in the tub, it was shut and it could not be opened, hence the tub never drained and you had to stand in water to shower. I would of said more, but we only stayed for 1 night.", "title": "Awesome vacation at the Comfort!!", "helpfulness": 1, "user": "bbz", "date": "August 28, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3812941}, {"rating": 4.0, "stay_parameters": "Stayed August 2005", "text": "The breakfast is meager, orange juice was so watered down it did not even taste like juice, the pastries were tiny and so were the bagels.", "title": "great location!", "helpfulness": 4, "user": "Helen5", "date": "August 20, 2005", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "service": 4.0}, "id": 3792512}, {"rating": 5.0, "stay_parameters": "Stayed August 2005", "text": "We decided to take a last minute weekend trip to the beach before school started and wanted to try and stay somewhere right near the heart of the boardwalk for a change. We were quite nervous and weren't sure what to expect, since we always tried to avoid staying anywhere near the Boardwalk when the kids were younger. To our surprise, we enjoyed ourselves more than ever before and will never stay away from the boardwalk again! The convenience was pricelss and it was no where near as crazy as we had thought it would be. We were pleasantly surprised when we first walked into our hotel room to find an extremely clean and modern room. The sheets, blankets, pillows and towels were of good quality. The air conditioner was brand new and the room was ice cold. Kitchenette was perfect and all new appliances. The water pressure was fantastic! Great indoor pool. The staff was very friendly and accomodating. Continental breakfast was fabulous. Fresh bagels, fruits, danishes, various muffins and cereal, an abundance of them each morning!", "title": "Absolutely wonderful...highly recommend!!!", "helpfulness": 5, "user": "gracemore7", "date": "August 16, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3776945}], "location": {"country": "United States", "city": "Ocean City"}, "stars": 2, "variance": {"poor": 15, "average": 30, "very good": 54, "terrible": 6, "excellent": 47}, "aka": "Comfort Inn Boardwalk Hotel Ocean City", "slim_ranking": 0.27358490566}