{"user_rating": 4.5, "review_count": 136, "name": "Comfort Inn & Suites Airport", "reviews": [{"rating": 5.0, "title": "Convenient for one night stay", "text": "Reno was a one night stay on a two week auto trip beginning and ending in San Francisco. We were heading on down to Yosemite the following day but looked forward to an evening in Reno. Because it was just a one night stay, we didn't want to hassle with staying at any of the casinos and opted for a location where we could get in and out of easily. After reading other reviews we thought the Comfort Inn Airport location was perfect for us and we were not disappointed. The room was very nice with very comfortable beds and 4 pillows on each bed. We were interested in going into town to try our luck at the Casinos and the free shuttle service worked perfectly. When we were ready to come back all we had to do was call the front desk and request a pickup. The breakfast the next morning was more that adequate with plenty of seating. We thoroughly enjoyed our stay and would recommend this facility to anyone who wants a no muss-no fuss approach to Reno.", "user": "ocsurvivor", "date": "June 23, 2008", "id": 17167531}, {"rating": 4.0, "title": "Great Place for the Price", "text": "We decided to stay at this property after reading the reviews on Trip Advisor. We were in town for an event and were looking for a clean and economical place to stay for one night. The Comfort Inn did the job.", "user": "Mikruli", "date": "June 9, 2008", "id": 16784703}, {"rating": 5.0, "title": "Great Budget Accomodations", "text": "We were traveling with a 15-monthold and my wife's elderly parents. I must say that the hotel is not in the best of neighborhoods and we were a little nervous about our choice at first. The parking lot to the hotel is surrounded by walls, with one entrance, so that is good in terms of security. But there were numerous “sketchy types” rolling around the area on bicycles, which appeared to be burglars and/or thieves just waiting to break into your car. There is not much to look at on the property either, which also was a bit depressing.", "user": "GoTBGo", "date": "May 27, 2008", "id": 16446244}, {"rating": 4.0, "title": "Great choice for Reno!", "text": "However, once we went inside, we found the hotel was only six months old and everything was new and clean. The hotel is family owned and operated and the entire staff was extremely friendly to us. Once we checked into our room, the front desk called to make sure everything was fine. In addition, every time we walked by the front desk, they made sure we had everything we needed.", "user": "SeaGuy60", "date": "May 18, 2008", "id": 16179482}, {"rating": 5.0, "title": "Exceeded expectations!", "text": "The room itself was rather plain, but extremely CLEAN. That was what we wanted, especially with our little one running around. Not much of a view (Costco and a parking lot), but then again, this is a motor lodge type hotel. My father-in-law (who is 73-years-old) loved the bed. He said it was better than his at home. We also found it to be quite comfortable.", "user": "faith716", "date": "May 7, 2008", "id": 15767934}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "We stayed one night at the new Reno Comfort Inn - Airport (Nevada) and had an excellent experience. It is a new hotel (just a few months old) and was immaculate. The room was spacious and nicely decorated, with a very comfortable bed (pillow-top mattress). They offer a delicious free full breakfast with eggs, waffles, fruit, bagels, etc. We were very impressed and will stay there again. Bravo to the new Comfort Inn - Airport in Reno, Nevada!!", "title": "Loved Reno's New Comfort Inn - Airport", "user": "NevadaCarol", "date": "February 8, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 13387294, "likes": {"liked": "— Very clean accommodations.", "disliked": "— Nothing - it was great!"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled on business", "text": "We were so pleased with the Comfort Inn. We were in town for a convention at the Grand Sierra. We were so happy that we stayed here! The service was excellent! We were impressed with the cleanliness, the water pressure in the shower, the comfortable beds and pillows, the coffee maker in the room (most of the casino hotels don't), the continental breakfast, the free wireless internet service and the location was easy access to everything and it was in a \"good\" part of town! They even offer a free shuttle service to casinos, restaurants or bars. I would highy recommend this hotel.", "title": "So So So Pleased!!", "user": "rubygirl6", "date": "April 23, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 15267313, "likes": {"liked": "— The service was great, the location was great and the hotel was comfortable.", "disliked": "— nothing"}}, {"rating": 5.0, "title": "Great Place with a good restaurant near by.", "text": "I stayed at the Comfort Inn for two nights and found it excellent. The room was large, spotless and the staff most friendly and helpful.", "helpfulness": 1, "user": "Scharmann", "date": "April 13, 2008", "id": 15008554}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled on business", "text": "There was none of the \"you guys\" type greeting which I detest. The breakfast was basic but just fine.", "title": "This place is great", "user": "JDS29", "date": "March 12, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 14226253, "likes": {"liked": "— clean great staff", "disliked": "— nothing"}}, {"rating": 4.0, "title": "Highly recommended", "text": "Very near by we went to a small Indian restaurant which was excellent. It was in a shopping center. This place was well worth the visit.", "user": "ctjourneyman", "date": "February 26, 2008", "id": 13864555}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "I went up to Reno on business and did not know where to stay. I saw the reviews on Trip Advisor and chose this hotel because of the good reviews. My experience was the same. The staff very friendly, helpful and cared about your stay. New hotel, rooms very clean, everything was good. Sometimes small things matter. Two bottles of complimentary water in the room. Last hotel I stayed in it was four bucks a bottle. Wonderful breakfast in the morning. Location close to airport and short drive to everything else. This is a good place for business or pleasure. Very nice experience all the way around. Highly recommend.", "title": "Excellent Hotel!", "user": "ValuedGuests", "date": "February 23, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 13792495, "likes": {"liked": "— Atmosphere", "disliked": "— N/A"}}], "location": {}, "stars": 2, "variance": {"poor": 0, "average": 12, "very good": 40, "terrible": 2, "excellent": 82}, "aka": "Comfort Inn & Suites Airport Hotel Reno", "slim_ranking": 0.106060606061, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}}