{"user_rating": 4.0, "review_count": 347, "name": "Comfort Inn and Suites Durango, Colorado", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed May 2009, traveled with family", "text": "We booked 2 rooms for 3 nights about a month before our visit. We were very happy with this hotel. We were about 1 mile south of Downtown, we had no problem with that, Wal-Mart is down the road too. We got great rates to stay here, $62.99 a night for each room. Rooms were very clean, we had an issue with our shower valve, but it was resolved within minutes. The only thing I did not like are the pillows, they are deceiving, look very nice and comfortable, but they would go flat as pancakes. We had to use 2-3 pillows each. No pets are allowed and no smoking, that was one of the main reasons for staying here. The breakfast was good, they had waffles, assorted juices, milk, coffee, toast, bagels, english muffins, tortillas, eggs, eggs with sausage, biscuits and gravy, donuts, muffins, etc.. Overall we had a nice experience, we would stay here again.", "title": "Nice Place and Very Clean", "user": "kjshurbet", "date": "June 1, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 3.0, "service": 4.0, "rooms": 4.0}, "id": 31319407}, {"rating": 4.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "Situated on the south end of Durango -- the hotel was nice and clean. Location wise - it's perfect. It's a small drive into downtown and you're close to the mall. The room was clean and spacious. Some issues with construction going on -- which made it a bit challenging to get to the property, but when we go back to Durango - we won't hesitate to stay there again.", "title": "Great Stay", "helpfulness": 1, "user": "MMSpooner", "date": "December 12, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 22676412, "likes": {"liked": "— Location to town, it was clean, spacious rooms", "disliked": "— Check-in staff was a little cranky"}}, {"rating": 3.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "Quiet, comfortable and clean motel about 2 miles south of train station. The free breakfast was O.K. but the dining room has limited seating, we were their for 4 nights and only sat for breakfast on 2 mornings. A bonus was the indoor pool.", "title": "Clean motel", "user": "harburybill", "date": "October 9, 2008", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 2.0}, "id": 20745130, "likes": {"liked": "— indoor pool", "disliked": "— breakfast"}}, {"rating": 2.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "I know you shouldn't expect too much from a Comfort Inn. Don't get me wrong: the rooms are clean and spacious, the staff is friendly. The indoor swimming pool wasn't bad. The breakfast sucked. You're better off somewhere else if you want a decent breakfast.", "title": "Did not like it very much", "user": "Suppiluliomas", "date": "September 20, 2008", "detail_rating": {"front_desk": 4.0, "service": 2.0, "cleanliness": 3.0, "value": 2.0, "rooms": 3.0, "location": 3.0}, "id": 20219175}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "Since it was high season, the prices were rather high; too high for what you get.", "title": "Beautiful Hotel. Beautiful spot", "helpfulness": 1, "user": "NanaKas", "date": "August 21, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 4.0}, "id": 19200615, "likes": {"liked": "— The full breakfast", "disliked": "— breakfast"}}], "location": {"country": "United States"}, "stars": 2.5, "variance": {"poor": 16, "average": 63, "very good": 135, "terrible": 7, "excellent": 126}, "aka": "Comfort Inn And Suites Durango, Colorado Hotel Durango", "slim_ranking": 0.266666666667, "description": "Welcome to the Award Winning Comfort Inn & Suites Durango, CO located in the City of Durango near the famous Historic area. This hotel is a Tripadvisor Certificate of Excellence Award Winner 2013 – 2011 and is just minutes from the great area attractions, such as the Durango & Silverton Narrow Gauge Railroad, Animas River Walk, Trimble Spa & Natural Hot Springs, Durango Mountain - Purgatory ski area, Sky Ute Casino, and Fort Lewis College. Visitors can enjoy river rafting, jeep tours, mountain biking, horseback riding, fishing and hiking in the area. Durango has a unique shopping district and many excellent restaurants. Mesa Verde National Park, a UNESCO World Heritage Site, is just a short drive from this Durango, CO hotel. Our Durango hotel is nestled in a town rich in history and so much to offer. Enjoy breathtaking views along the San Juan Skyway through the San Juan Mountains of southwest Colorado. The Durango Lift stops within 200 feet of the hotel for easy and convenient access to areas of Durango.Full-service hotel amenities and features include the following:Free high-speed Internet accessFree local callsBusiness centerIndoor heated pool and hot tubAir conditioned exercise facilityYour Morning Breakfast is full of hot and delicious options, making breakfast at the Comfort Inn & Suites the perfect way to start your day. Enjoy our free hot breakfast featuring eggs, meat, yogurt, fresh fruit, cereal and more, including your choice of hot waffle flavors!Business travelers staying at this Durango, CO hotel will find the available copy and fax services useful.All spacious guest rooms come equipped with microwaves, refrigerators, coffee makers, hair dryers, irons, ironing boards and 32-inch televisions with cable, including movie channels. A guest laundry facility is located on the premises for convenience."}