{"user_rating": 3.5, "review_count": 107, "name": "Comfort Inn Airport", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "We were impressed with the welcome we received on three separate stays, even when we arrived at 4 am and were offered breakfast. The rooms were functional, and we liked the separate washbasin and bath areas. The free and prompt airport transfers were a big help, just phone from the terminal, or ask at the front desk (walking, it's only 10 mins. away). The bar serves food up to midnight, really useful as the airport arrivals area is very limited after 9 pm. We also appreciated the great rate we received when we booked an extra night by phoning ahead.", "title": "Decent accommodation and close to airport", "helpfulness": 1, "user": "rnathan", "date": "October 6, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 179978734}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "We stayed twice in September 2013 at the Comfort Inn Airport: One night at the beginning and two nights at the end of our 2-week trip to Newfoundland. In both cases, our room was very large and very clean. The hotel is really very close to the airport (5 minutes on foot!), although it can be quite hard to find at night, because it is hidden from the main road by rows of trees. They make everything convenient, especially for people with early morning flights: breakfast from 4 AM (although the breakfast room is pretty small and inconvenient), computer with printer to let you check in and print your boarding pass in advance. We will stay there again next time we visit Newfoundland. Oh, and did we say that Newfoundland was really beautiful?", "title": "Very large, clean rooms and convenient service", "helpfulness": 1, "user": "JacquesXP", "date": "October 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 179859847}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled with family", "text": "Everything at this hotel was awesome. It is very clean , the staff from the front desk to the kitchen staff and everyone in between are wonderful. Very helpful , polite friendly. Everyone makes you feel at home and welcome. The food in clancys is just devine. The manager Andrew is a person that needs to be at this hotel for a long time, and he should be very proud of his staff. Andrew makes it a point to talk to the guests.", "title": "Comfort inn st.johns", "helpfulness": 1, "user": "Candace W", "date": "September 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 177924885}, {"rating": 3.0, "stay_parameters": "Stayed September 2013", "text": "We recommend this hotel to anyone who comes to st.johns. We have stayed here at least 5 times and never had a complaint, and I have no problem saying we will stay here again....", "title": "Location does not compensate for condition", "helpfulness": 2, "user": "Outporter", "date": "September 17, 2013", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "location": 5.0, "service": 3.0, "rooms": 2.0}, "id": 177515380}, {"rating": 3.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "On a 2 week family vacation, we decided to stay in the airport comfort Inn as a matter of convenience seeing that we had to drive 4 hours to St Johns to catch our flights. Of the 2 week vacation this was the worst nights stay we had anywhere. The room we stayed in had damage to the door which looked like someone had tried to kick it in. The room was very dated and felt dirty. The room was uncomfortably hot and the air conditioner did not work. There was a door that lead to the outside parking lot that didn't open or close properly as though it was broken on its hinge. We arrived at 1230 am from our trip and checked in during a wedding reception which had drunk people wandering the halls blurting out obscenities in front of my 2 kids and at my wife. The front staff were accommodating in placing us far from the reception but the non existent hall signage made it nearly impossible to find our room through the labyrinth of halls stairs and corridors. After all four of us tossed and turned for 4 hours we finally gave up and checked out at 5am and drove home. Thanks for a terrible ending to an otherwise perfect vacation.", "title": "Convenient, but tired.", "helpfulness": 1, "user": "AimeeDP41", "date": "August 26, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 174235369}], "location": {"country": "Canada"}, "stars": 2.5, "variance": {"poor": 3, "average": 26, "very good": 53, "terrible": 7, "excellent": 18}, "aka": "Comfort Inn Airport Hotel", "slim_ranking": 0.5}