{"user_rating": 4.0, "review_count": 69, "name": "Comfort Inn & Suites Carney's Point", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "We chose this hotel for its location (halfway to the OBX); and being dog-friendly - and were not disappointed. We were given a ground floor nonsmoking room, one door away from a side entrance. That was very handy with our two dogs. The room & hallway was clean, and although the NJT was right outside our window, the room was remarkebly quiet.", "title": "Good value, location & service", "helpfulness": 1, "user": "sfm132", "date": "October 2, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 81843326}, {"rating": 4.0, "stay_parameters": "Stayed June 2010, traveled with family", "text": "It was easy on/off either highway; and a short distance from the Delaware Memorial Bridge. There is a state park nearby (Fort Mott) that is also dog-friendly - good for stretching human & canine legs after a long drive. The cost was most reasonable, especially adding two dogs to the tab. Many places charge more than their $10 each; and most have a size limit below that of our Irish Setters.", "title": "Nice, safe, and clean", "user": "flaxenmane", "date": "June 23, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 68464230}, {"rating": 4.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "The breakfast area was clean & inviting; the food selection certainly adequate. All staff we met was pleasant and friendly.", "title": "Great Location at a fair price", "user": "stormlover7157", "date": "June 22, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 68378701}, {"rating": 4.0, "stay_parameters": "Stayed May 2010, traveled solo", "text": "We will not hesitate to stay here again during any future east coast trip.", "title": "Quiet, safe, convenient location", "user": "geri_gal", "date": "May 26, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 65434938}, {"rating": 1.0, "stay_parameters": "Stayed December 2008", "text": "The lobby is beautiful - The rooms were a nice size & decently cleaned.", "title": "Smelly Hotel", "helpfulness": 1, "user": "Millbilly21", "date": "December 31, 2008", "detail_rating": {"front_desk": 1.0, "business": 3.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "location": 1.0, "rooms": 1.0}, "id": 23133851}, {"rating": 3.0, "title": "Expected more after all the nice reviews", "text": "The rooms are clean, well kept, except for one thing: they mix the non-msoking with the smoking rooms big time; I booked a non-smoking room and all the bed linen was stinky with cigarette odor...that was disgusting; the receptionist couldn't change the room, but provided new bedlinen; also I was told that only the first floor is a smoking floor; well, I stayed on the 3rd floor and the whole corridor was filled with cigarette smell...again dissapointing. Otherwise, breakfast is complimentary and is good as other people have said.", "user": "danut15", "date": "October 7, 2007", "id": 10051205}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "If they could really respect the non-smoking and smoking rooms as they should, it would be a nice hotel.", "title": "The reviews are right on regarding this hotel.", "user": "loudbmw", "date": "October 4, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 10039734}, {"rating": 5.0, "stay_parameters": "Stayed August 2007", "text": "Very clean and a friendly staff. Very close to exit 1 of the NJ Tpke or exit 2 on 295. Inexpensive gas nearby too.", "title": "Decent Stay", "user": "DJC17", "date": "August 5, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 8357810, "likes": {"liked": "— Clean", "disliked": "— Confusing getting to facility from Delaware Bridge."}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "We booked a so called suite. As it was only $10 more I didn't expect much. It had a sofa and coffee table, small desk in addition to the king bed - maybe 20% larger than a normal room but nice for an extended stay.", "title": "Perfect Overnight Spot", "user": "msc46", "date": "July 18, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 8184144, "likes": {"liked": "— Clean", "disliked": "— No negatives"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled on business", "text": "Clean and modern facility. Conveniently located.", "title": "Didn't Want to Leave", "helpfulness": 1, "user": "wormwould", "date": "June 5, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 7781188, "likes": {"liked": "— Clean", "disliked": "— Week WiFi signal"}}, {"rating": 4.0, "title": "Clean and comfortable stop on a roadtrip", "text": "We stayed at the Comfort Inn & Suites, last exit on the NJ Turnpike headed south, as a stop-off on a roadtrip and it was just what we needed. I big comfortable bed, very clean amenities, and a better than expected continental breakfast before checking out the next morning. It is in the middle of a residential neighborhood overlooking the turnpike so not recommended as a \"vacation spot\"! Great for business travelers or those needing a stop while traveling. The staff was constantly cleaning and asking us how everything was and if we needed anything. Fruit is available all day and night in the lobby as well as a flat screen TV to watch the news with your free breakfast and a computer to check your email. Great deal for the price, better than some 4 star hotels I've stayed at...will definitely stay here again as opposed to the absolutely horrific Econo Lodge nearby!!", "user": "dinerdogg", "date": "May 30, 2007", "id": 7716360}, {"rating": 5.0, "title": "Great Place to Stay", "text": "I had a terrific stay at the Comfort Inn & Suites in Carney's Point, N.J. I chose this particular Comfort Inn because of its proximity to Delaware and because of the good reviews the hotel had already received. The hotel is close to the New Jersey Turnpike and while it is tucked away on a side road, I had no trouble finding it. And even though it's near a major highway, I never noticed any traffic sounds during my stay.", "helpfulness": 1, "user": "All_Things_English", "date": "April 17, 2007", "id": 7382226}, {"rating": 2.0, "stay_parameters": "Stayed February 2007, traveled solo", "text": "Upon walking into the hotel, I was immediately struck by the elegance of the hotel foyer and reception area. The desk clerk was friendly and professional and my check-in was quick and easy. I noticed a good-sized breakfast room (more on that later) on the way to the elevator. The hotel's elegance didn't stop at the lobby, either. The table and mirror opposite the elevator was a nice touch and the hotel's carpets were clean and in good shape.", "title": "OK except for gym", "user": "peachesdad", "date": "February 11, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 2.0, "location": 2.0, "rooms": 3.0}, "id": 6780391, "likes": {"liked": "— quiet", "disliked": "— gym"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled on business", "text": "I was very impressed by my room. What I immediately noticed was the length of the hallway from the door to the bedroom area. I can only assume it was designed that way to cut down on the inevitable hallway noise. While the hotel was fairly quiet on this particular night, I did appreciate the thoughtfulness that went into the layout.", "title": "Good place for business travel", "user": "gottagulf", "date": "October 9, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 3.0, "rooms": 4.0}, "id": 5931328}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled on business", "text": "The bedroom area was immaculate. It had a king-sized bed, a wardrobe which housed a television and small refrigerator and microwave (both clean - I checked!), an easy chair and ottoman and a desk and chair. The room overlooked the front of the hotel, which faced a farm with horses.", "title": "I made the right CHOICE!", "helpfulness": 2, "user": "jefffromark", "date": "September 18, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 3.0, "rooms": 5.0}, "id": 5813743, "likes": {"liked": "— quiet", "disliked": "— would of been nice to have full basic cable instead of 3 HBO stations"}}, {"rating": 3.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "Given my research of hotels in Wilmington and my inability to find an inexpensive/safe/quiet location, we opted to stay right across the river in Carney's Point for our one night stopover on the way to NC. The hotel is conveniently located right off the highway on a quiet cul-de-sac. For $100 a night including taxes and fees, the room was average and clean but was obviously a smoking room. Our reservation was clearly labeled as a non-smoking room. The smell of smoke permeated all of the clothes in our bag even though we were there for a mere twelve hours. The self-serve breakfast bar was nice and unexpected. If I were passing through again I would most likely try to find another hotel. I certainly wouldn't have stayed here for more than one night.", "title": "entire place smells of smoke", "helpfulness": 1, "user": "havalina", "date": "July 1, 2008", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 2.0, "rooms": 3.0, "location": 4.0}, "id": 17396177, "likes": {"liked": "— location from highway, safety", "disliked": "— whole place smelled like smoke"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "This was another free stay for us at Carney's Point Comfort Inn. I really like this hotel but I guess it is a little hard to find. You really don't expect a hotel to be at the end of a residential street. But once you find it, you'll want to come back. It's clean, safe and quiet. We have always had a room that overlooks the front of the hotel and the small horse farm across the street. So pretty and a view that makes you keep your curtains open. The hotel staff s friendly and the rooms are comfortable. You are just behind the highway but it's very quiet. I would stay her again for sure.", "title": "A little bit of country off the highway", "helpfulness": 1, "user": "almondcookies", "date": "June 21, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 17107109, "likes": {"liked": "— Clean , comfortable, quiet, good breakfast"}}, {"rating": 3.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "We stayed at this hotel while attending the NASCAR races in Dover DE. It met the criteria we want when chosing a hotel while attending the races--close to the highway, within an hour drive of the track, reasonably priced rooms with microwave and refrigerator, and a guest laundry room.", "title": "OK, but hard to find", "helpfulness": 2, "user": "Kitters", "date": "June 15, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 2.0, "rooms": 3.0}, "id": 16932032}, {"rating": 2.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "The hotel is a little difficult to find, on a side road in a rather rural area. It was however, very quiet. When we checked in we asked about a place to buy groceries, but the desk clerk couldn't seem to give us very clear directions. There were no restaurants or stores close by. We finally drove around the area and found a small grocery store in one little town and a couple of restaurants and fast food places in another place.", "title": "both good and not so good at Comfort Inn", "helpfulness": 1, "user": "dibbitz", "date": "June 10, 2008", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 2.0, "value": 4.0, "rooms": 2.0, "location": 3.0}, "id": 16817836, "likes": {"liked": "— good shower, good price", "disliked": "— cleanliness of the room, difficult to find, needs more signs"}}, {"rating": 3.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "Our room was comfortable and tidy, but in need of a thorough deep-cleaning and the bathroom door would not close and latch.", "title": "Not bad if you get a good rate.", "user": "ucantimagine", "date": "May 19, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 4.0, "location": 3.0, "rooms": 3.0}, "id": 16184286, "likes": {"liked": "— I rarely see other guests when I'm there.", "disliked": "— They could do a better job of dusting vents, tops of armoires, etc. Breakfast leaves a lot to desire."}}], "location": {"country": "United States", "city": "Carneys Point"}, "stars": 2.5, "variance": {"poor": 10, "average": 11, "very good": 19, "terrible": 1, "excellent": 28}, "aka": "Comfort Hotel", "slim_ranking": 0.25, "description": "The Comfort Inn & Suites® hotel is conveniently located less than 10 miles from DuPont Chambers Works, Salem and Hope Creek nuclear power plants and the Cowtown Rodeo, the longest continuously running rodeo in the United States. This Carneys Point, NJ hotel is minutes from Fort Delaware State Park, Bridgeport Speedway, Widener University and the Brandywine Zoo.The University of Delaware, Fort Mott State Park, Delaware Park horse race track, the Delaware Museum of Natural History and Longwood Gardens horticultural park are also nearby. The Philadelphia International Airport is 26 miles from the hotel. Delaware is just minutes away. Dover Downs horse race track is within 45 miles.Full-service amenities and features include:-Free breakfast with hot waffles-Free local calls-Free USA Today-Free 24-hour coffee, tea and hot cocoa-Exercise room. This Carneys Point hotel provides business travelers with conveniences like free high-speed Internet access, a business center, two-line cordless telephones, executive work desks with ergonomic chairs, and access to copy and fax services. There is a meeting room that accommodates up to 30 people. All spacious guest rooms include refrigerators, microwaves, coffee makers, hair dryers, irons, ironing boards and premium cable television. Kitchen suites, king suites and whirlpool suites are available.Guest laundry facilities are located on the property. Designated non-smoking floors are also available. This is a pet-friendly hotel; a small nightly fee is required. The perfect location, friendly customer service and affordable rates make the Comfort Inn & Suites hotel perfect for everyone visiting the Carneys Point area."}