{"user_rating": 3.5, "review_count": 612, "name": "Comfort Inn by the Bay", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "Nothing to really get too excited about. The room was very clean and the breakfast was ok. It was in a great location - about 10 minutes walk to the Wharf. We found the parking bays to be limited and very small (we had a People Carrier and struggled to get in and out). The only complaint was that there wasn't enough room in the dining area, people were eating cereal in the hotel lobby!", "title": "Functional", "user": "crocettesontour", "date": "September 4, 2007", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 8619360, "likes": {"liked": "— The location", "disliked": "— Lack of dining space/no bar"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "We stayed here for 4 nights in August, after looking at a bunch of different hotels on tripadvisor. We selected this one based on the positive reviews, the price and most of all the location!", "title": "great location, good price!", "helpfulness": 1, "user": "NielsB", "date": "August 31, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 8590324, "likes": {"liked": "— location"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "We had a double room, with bridge view. The Golden Gate bridge isn't exactly very nearby, but it was clearly visible from our window. Very nice. The street below was a bit noisy, but not in a disturbing way. We slept very well all nights.", "title": "Great location and value", "helpfulness": 3, "user": "wholelottaworld", "date": "August 27, 2007", "detail_rating": {"cleanliness": 5.0, "front_desk": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 8516540, "likes": {"liked": "— clean and quiet", "disliked": "— no surrounding pubs"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "The hotel is within walking distance (downhill) of the Fisherman's Wharf area. If you're not too tired and in ok shape, it takes about 15 minutes to get there. There is also a busstop not far from the hotel, and with the excellent public transportation (get a MUNI passport!), you could anywhere easily.", "title": "Great place to stay on a moderate budget", "helpfulness": 2, "user": "looloobird", "date": "August 24, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 4.0}, "id": 8499705, "likes": {"liked": "— cleanliness", "disliked": "— distance from Fisherman's Wharf"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled with friends", "text": "Breakfast is cool - you make your own waffles! Additionally there's hot or cold cereal, bagels, muffins, juices, fruit, coffee/tea/cocoa. Nothing incredibly fancy, and not everything is very healthy perse, but it fills the stomach!", "title": "Mark (at front desk) was exceptional!", "helpfulness": 1, "user": "azzure", "date": "August 21, 2007", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 8461475, "likes": {"liked": "— location", "disliked": "— Herds of people at breakfast, high-speed internet station not working"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "Comfort Inn By The Bay - San Francisco: \"Good Value\"", "title": "Good value and service", "helpfulness": 2, "user": "SINtraveller", "date": "September 24, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 8885317, "likes": {"liked": "— Location", "disliked": "— Breakfast stops at 9.30am"}}, {"rating": 3.0, "title": "Just OK", "text": "Reviewer: James Lam, Singapore", "helpfulness": 1, "user": "dkckekmk", "date": "September 18, 2007", "id": 8753252}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "Just came back after four days' stay in Comfort Inn. The location is very convenient with many buses plying along Van Ness Ave. You can practically go to any part of San Francisco by bus.", "title": "good value !", "user": "Kendo3", "date": "September 17, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 8735950}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled with friends", "text": "The room was ready when we arrived at 12 noon which was very convenient. It was very clean with white bath towels and bed sheets. Two complaints (water flow of the bath tub and toilet flushing system) were fixed quickly to our satisfaction. However, we did not tell them that the heating system was not working (maybe it's still summer).", "title": "An excellent base from which to explore San Francisco", "user": "PeteOnTheMove", "date": "September 12, 2007", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 4.0}, "id": 8699184, "likes": {"liked": "— The staff were really friendly and the location was good", "disliked": "— Breakfast was a bit of a free for all"}}, {"rating": 1.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "The complimentary breakfast was good and adequate. Hot waffles and fresh fruits are welcome items at any hotel breakfasts.", "title": "Nice Room, Checked Out Early", "helpfulness": 2, "user": "davidkr", "date": "September 5, 2007", "detail_rating": {"cleanliness": 3.0, "front_desk": 3.0, "location": 3.0, "value": 1.0, "rooms": 1.0}, "id": 8659084}, {"rating": 1.0, "stay_parameters": "Stayed November 2007, traveled on business", "text": "This was the 4th time I have stayed at this hotel in the last 7 years. I chose it because it has a great location for tourist spots although there aren't many places to eat around there. The hotel doesn't have a restaurant but they do have a breakfast area. I decided to book myself and 2 colleagues here because it was budget friendly and I knew the locale and as we were on business we had a tight budget. What a disappointment this turned out to be. I paid extra for a view of the bridge, my friends didn't and they got a view of a parking lot. The wall in my room was covered with mildew as were the curtains but then again so were my friend's rooms. The room seemed clean enough but on the second day I was there I noticed about a dozen or so tiny tiny bugs crawling all over the flush tank of my toilet. I called to the front desk at 7 am when I noticed them and asked them to send someone up to check it out, I had to call again at 8 am and at 9 am I went out to the hallway and found the housekeeper. I told her what the problem was and she said she had it on her board to do. She also said she couldn't spray the room until I left. I was at meetings all that day and with a major conference in the city couldn't get another hotel to go to. I also didn't want to separate from my colleagues. I did leave the room and was gone for 5 hours. When I came back, my room still hadn't been touched. I called the front desk and asked to speak with the manager and was told he was helping someone else but would call me back within 5 minutes. I waited almost 1/2 hour and eventually went downstairs to the lobby. I didn't want to discuss this in front of other guests but was really pushed to do so. The manager was apalled and said this was the first he'd heard of it. He assured me the room would be done immediately and the bathroom would be sprayed. He couldn't tell me what these creatures were. I had an event that evening and when I came back at 1 am I noticed they were still there and still as many of them as when I left earlier in the day. I called downstairs and at 2 am I had to pack up my things and move to another room. I checked out that following morning. When I mentioned to the front desk staff she said it was my fault because I had eaten a banana in the room the day before and these were fruit flies. I actually work in the Health Dept. and explained to her that fruit flies need more than 12 hours to incubate and that fruit flies fly, these little critters were crawling and weren't even near the garbage can that I had used. The staff at the front desk were less than helpful with things I needed (ie FedEx form for a package I needed to send). I was so paranoid about bringing something home with me that I emptied my suitcase in the garage and even the new sweaters etc. that I bought I washed and dried immediately before I would bring them into the house. This was the worst treatment I have ever received. I only signed on to this site so I could warn others what this place is really like. The pictures must be years old and really do not represent what this hotel is really like. Stay away, it isn't worth your hard earned money or the grief of wondering if you caught something.", "title": "Bring your own can of Raid!!", "helpfulness": 10, "user": "goneagain50", "date": "November 5, 2007", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "location": 4.0, "rooms": 1.0}, "id": 10624947, "likes": {"liked": "— The location", "disliked": "— The bugs in the bathroom"}}, {"rating": 2.0, "stay_parameters": "Stayed October 2007, traveled with family", "text": "My husband,myself and two family members from England stayed at this hotel from October19th -22nd, we flew directly from Vancouver to San Francisco ,we arrived at the hotel ( at noon) well before the check-in time of 4 p.m, our rooms were not ready so they suggested we leave our luggage with them and return around 3 p.m. as our rooms should be ready by then . We took a walk ,had some lunch and returned at 3 pm,I booked this trip at least 4 months before taking it so I thought the requests I had made would be honored.We asked upon booking the trip for both rooms to be either facing the city or the bay and neither were,that was dissapointing as the view from both rooms on the 4th floor were facing an apartment building, we had also requested one of the two rooms be a smoking room, we were told they did not have one available and that if anyone smoked in that room there would be a hefty charge added on to our credit card.No big deal, as we weren't in the room much other than to sleep so we went outside if we wanted to have a smoke. The room itself was not bad, comfy bed, lots of pillows,decent size television, the bathroom however was not the greatest, it was tiny and no window and no fan? I thought that was odd, plenty of hot water and a nice size tub so that was a plus. There was internet available to patrons for free in the breakfast room but a sign was posted on it saying it wasn't working- when I asked at the front desk about when it may be available to use they were unable to tell me ,just got a lot of hmmm? I am not sure.......it was still not available come monday afternoon. There is a pop/juice machine on each floor, after a long day of walking around the city we went back to our room for a break and to get ready to go out for dinner- walked down to the pop machine to get a drink and a sign was posted-out of order, no problem- hopped the elevator to another floor and the same thing there - out of order-after trying 3 floors I gave up - walked across the street to the store and purchased some drinks.The breakfast room was pretty good - a good assortment of fresh fruit,danish,muffins,hard boiled eggs ,tea,coffee,juice and waffles,never had a problem finding a table to eat at but after 8am it got quite busy.We saw alot of the city in 4 days - Alcatraz is amazing , Fisherman's Wharf was also a fave -- so much going on there and some great food available - we really liked eating at Nick's Lighthouse , the seafood there was awesome. Rented a car and drove to Napa and Sonoma valley - went to a winery called Rosso & Bianco, it is owned by Francis Ford Coppola and it was absolutely amazing ! You could sit on the terrace and have lunch,or for $10 you could do a little wine sampling which was nice , the gardens are well kept and so pretty .We also did the double decker bus tour in the evening for $15 a person ,well worth it as we were able to get some fantastic pictures - a great way to see the city! I would definately go back as 4 days was just not enough to see everything, however - I would try a different hotel next time , the people running this hotel didn't seem to really know what they were doing . feel free to contact me at debrab60@hotmail.com if u have any questions.", "title": "Average Hotel", "helpfulness": 4, "user": "tinydancer", "date": "October 30, 2007", "detail_rating": {"front_desk": 2.0, "business": 1.0, "service": 2.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 10449369, "likes": {"liked": "— 15 minute walk to Fisherman's wharf", "disliked": "— no view"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "We were quite happy with this hotel although we did not realise before we arrived that there was no restaurant. Breakfast was good and an easy walk or bus ride down to Fisherman's Wharf which we loved. The staff were very friendly and helpful and luckily for us the weather was just perfect! The trip to Yosemite was awesome. (We were travelling from New Zealand)", "title": "Loved Fisherman's Wharf", "helpfulness": 2, "user": "winegumAuckland", "date": "October 27, 2007", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 4.0, "cleanliness": 3.0, "value": 4.0, "location": 3.0}, "id": 10364054, "likes": {"liked": "— Friendliness and helpfulness of staff", "disliked": "— Lack of restaurant"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "My husband and I stayed here for our honeymoon. Had a 10th floor room with a bay/bridge view. Room had in-room fridge and safe. Worth the extra $20 bucks or so a night if you are staying for multiple nights.", "title": "No frills honeymoon in SFO", "user": "milojo", "date": "October 24, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 10291057}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "The bridge view is great, but the bay view is just ok because some developer built a couple matching eyesores that block most of the view of Alcatraz.", "title": "Walking distance to Fisherman's Wharf", "helpfulness": 1, "user": "Mysteryxpert", "date": "October 22, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 3.0, "cleanliness": 3.0, "value": 4.0, "location": 4.0, "rooms": 3.0}, "id": 10242644, "likes": {"liked": "— Reasonable priced compared to other hotels at Fisherman's Wharf"}}, {"rating": 1.0, "stay_parameters": "Stayed October 2007, traveled on business", "text": "This place is old and desperately in need of renovation. There was no refrigerator, nor microwave. Our toilet seat was broken. The windows are screwed shut and can't be opened. Our courtyard view was in reality no courtyard, but plants planted along the street.", "title": "Thought it a Shabby Hotel, In Need of Renovation", "user": "SignLady", "date": "October 22, 2007", "detail_rating": {"cleanliness": 3.0, "front_desk": 3.0, "location": 4.0, "value": 1.0, "rooms": 1.0}, "id": 10234832, "likes": {"liked": "— Location", "disliked": "— Not as represented on the internet, this hotel is badly in need of renovation"}}, {"rating": 3.0, "title": "Cheap and cheerlful", "text": "Sad to say, they have a great location, but need to spend monies on renovation.", "user": "ChrisLondon_UK", "date": "October 22, 2007", "id": 10217074}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled solo", "text": "The internet photos aren't representative of the run down condition of the rooms, hallways, etc.", "title": "Perfect Stay", "user": "ann7NewYork", "date": "October 15, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 10083442, "likes": {"liked": "— The hotel was close to everything without being in the middle of the noise"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "\"We're not a full service hotel.\" said the man on the desk.", "title": "Great Location!", "helpfulness": 1, "user": "grandma_debi", "date": "September 28, 2007", "detail_rating": {"front_desk": 4.0, "business": 1.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 3.0}, "id": 10016439}, {"rating": 4.0, "title": "Great Find", "text": "As long as you keep that in mind you'll be happy. Good location, basic rooms, but a good size and some with views of the Bridge. Breakfast is included, but the breakfast rooms got very busy at times.", "user": "alfa147a", "date": "September 26, 2007", "id": 10007960}], "location": {"country": "United States", "city": "San Francisco"}, "stars": 2, "variance": {"poor": 47, "average": 160, "very good": 274, "terrible": 27, "excellent": 104}, "aka": "Comfort Inn By The Bay Hotel San Francisco", "slim_ranking": 0.497872340426, "detail_rating": {"service": 3.5, "cleanliness": 4.0, "value": 3.5, "sleep": 3.5, "rooms": 3.5, "location": 4.0}, "description": "The Comfort Inn® By the Bay is conveniently located off U.S. 101, near Fisherman's Wharf, the San Francisco Marina Yacht Harbor, Fort Mason Center, Union Street and Lombard Street, the World's Crookedest Street. This San Francisco, CA hotel is close to popular attractions, including AT&T Park, the Golden Gate Bridge, San Francisco Chinatown and the San Francisco Civic Center Plaza."}