{"user_rating": 3.5, "review_count": 182, "name": "Comfort Inn North", "reviews": [{"rating": 4.0, "title": "Cant beat this place", "text": "Last weekend I stayed at the Comfort Inn North, our group had a block of 50 rooms for our athletic organization. I was impressed with this hotel from day one. It was easy to deal with the Director of Sales, Gagan. He made this event a pleasure. For beginners they had put all our rooms close together, they even had directions printed to our venue, and he even let our girls use the banquet area for a pizza party for free, he helped us get discounted rates on pizza. The staff was very friendly , cheerful, and efficient. We had all our keys ready and waiting for us at the front desk, the express checkin helped our teams reach their competition on time.", "helpfulness": 2, "user": "NewjerseyWright", "date": "June 28, 2006", "id": 5397933}, {"rating": 1.0, "title": "Shabby, they didn't want my business", "text": "The hotel was well maintained, the rooms were clean, and modest the indoor pool was in working order. The housekeepers were very nice and did a good job on my jacuzzi suite. I will always use this hotel for my group every time we come to Columbus. It can be difficult choosing a hotel based solely on pictures and online websites, im glad I called them directly and we were very happy with our stay.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "March 15, 2006", "id": 4620067}, {"rating": 1.0, "title": "Dont stay very dirty - gross -", "text": "First they messed up my reservation (which I made at the choice hotels website, you'd think it'd get through right). Stained carpets, loose plumbing fixtures, baseboard moulding not looking so hot, the employees like to hang out in halls and talk very loudly.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "August 24, 2005", "id": 3802460}, {"rating": 1.0, "title": "Don't stay here for anything!!!!!!", "text": "Most importantly the building was posted with some sort of 'no firearms' signage, it didn't apply to me but the intention was obvious. They wanted to keep out legal, licensed, responsible person.", "helpfulness": 8, "user": "A TripAdvisor user", "date": "November 26, 2003", "id": 1499286}, {"rating": 1.0, "stay_parameters": "Stayed May 2008, traveled on business", "text": "This is a dirty, smelly truck stop motel. The carpets have a black path down the middle. My first room had not been vaccumed, with hair all over the bathroom. Not to mention the smell. The second room they tried to have me stay in was just as dirty, plus a stain on the wall. The stain was a drink someone had thrown on the wall that had dried.", "title": "BAD BAD BAD", "user": "KellySebring_OH", "date": "May 6, 2008", "detail_rating": {"front_desk": 2.0, "business": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "location": 1.0, "rooms": 1.0}, "id": 15717987, "likes": {"liked": "— Nothing", "disliked": "— Cleanliness"}}, {"rating": 1.0, "title": "Dirty, No working Fitness Equipment", "text": "I checked out, very quickly. Now I have to fight with Expedia to get my money back.", "user": "Debde72", "date": "March 3, 2008", "id": 14013798}, {"rating": 1.0, "title": "Nastiest Place on Earth!!!!", "text": "We were given a room that was occupied, and at 1 am had to wait for security to come and give us keys to another room. The hotel is dirty, clothes rack fell off the wall, toilet leaked, sink drained very slowly, didn't feel like room was very clean. One reason we stayed was because of fitness facility, and the only two cardio machines in the gym didn't work. It also stunk terribly. The pool was closed for maintenance.", "user": "Boss_Lady0812", "date": "January 22, 2008", "id": 12885971}, {"rating": 1.0, "stay_parameters": "Stayed April 2007", "text": "The housekeeping staff had just quit, so there was no one to clean the rooms. We were there for 2 nights, and had 3 different rooms. The first room had no heat, and the TV didn't work. The manager came in and \"beat\" the TV to working, but the heat never started (after 2 attempted beatings!). The 2nd room, again had no heat, but also no electricity (this was due to the space heater they gave us- it blew a fuse). IWe then went to swim (which also wasn't that great), and came back to a ROOM FULL OF ANTS EVERYWHERE. This room did, however, have a wonderful view of a brick wall! The last room, -again no heat, but the staff realized the whole bottom floor had no heat- there was heat on the 2nd floor, but no rooms rented out due to new carpet being installed (constant banging all night). Ants were still there, but they did give us some bug spray to use! A fellow visitor had 5 children get sick from the lack of heat, and requested her $$ back as well. There was also a man complaining that a drunk man was in his room taking his bed apart when he returned! The staff informed us that they were \"cutting some corners\"", "title": "Run.....DO NOT WALK!", "user": "TeamOhio", "date": "April 26, 2007", "detail_rating": {"front_desk": 3.0, "service": 2.0, "cleanliness": 1.0, "value": 3.0, "rooms": 1.0, "location": 2.0}, "id": 7438554}, {"rating": 1.0, "stay_parameters": "Stayed November 2006, traveled with family", "text": "We WERE credited back one night, and will NEVER stay here again. I wouldn't recommend this place to anyone.", "title": "Not a good choice!", "helpfulness": 1, "user": "brocoli", "date": "November 25, 2006", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 2.0, "cleanliness": 2.0, "value": 1.0, "location": 3.0, "rooms": 2.0}, "id": 6174440, "likes": {"liked": "— lack of action by the staff to resolve issues - poor customer service", "disliked": "— don't stay here"}}, {"rating": 3.0, "stay_parameters": "Stayed December 2008, traveled on business", "text": "This hotel was fine in most ways. The room was clean and the bed was comfortable. There was a large indoor swimming pool and an exercise room that was larger than is the norm. The free breakfast was okay with waffles being the hot selection. The price was quite low given the amenities.", "title": "Quite good but strange access to rooms", "user": "MIRay", "date": "December 13, 2008", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 22694617}, {"rating": 5.0, "stay_parameters": "Stayed December 2008", "text": "The only thing that stops me from giving this property a top rating is the access to the quest rooms. The hotel has a large, spread out design that has parking all the way around the building. There are also doors to the outside all the way around - except that just about all of them are “Out” only doors. The key cards pads are still on the door jams but the handles have been removed from the outside of the door. So even though there was parking right outside my room, I was forced to part quite a distance from my room in order to enter the hotel. I can understand security concerns, but I couldn’t understand not having some of there doors being operational with the key card locks that were already there.", "title": "Under new Management", "user": "jtownchief7", "date": "December 9, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 22590974, "likes": {"liked": "— Value, cleanliness, staff", "disliked": "— Nothing"}}, {"rating": 1.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "If you stay here and want to be near an access door, ask for a room with a low room number.", "title": "Call Terminix", "helpfulness": 1, "user": "Swaff26", "date": "September 29, 2008", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "location": 1.0, "rooms": 1.0}, "id": 20479913, "likes": {"liked": "— Not a damn thing!", "disliked": "— It all sucked. It was like being left to sit in a sess pool or go take a bath in the garbage dump"}}, {"rating": 1.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "I booked this hotel on line for an entire youth hockey team, prior to confirming, a few parents found negative comments on this hotel, I called the manager and questioned him on all of the previous reviews. He explained that the hotel was under new ownership and manager, he asked that I give them a chance and that he promised we would want to stay again. To make a long process and story very short, he was a man of his word, the hotel was clean, the staff was great, the price was perfect.", "title": "Worst Hotel Ever -", "helpfulness": 1, "user": "sassy8480", "date": "September 28, 2008", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "location": 1.0, "rooms": 1.0}, "id": 20455582}, {"rating": 2.0, "stay_parameters": "Stayed May 2008, traveled with family", "text": "At $49.00 per night it was everything that our team has recieved for the $100.00+ a night hotels. We will be back!", "title": "Dirty", "user": "DisappointedFisher", "date": "May 27, 2008", "detail_rating": {"front_desk": 2.0, "service": 1.0, "cleanliness": 1.0, "value": 2.0, "rooms": 2.0, "location": 3.0}, "id": 16435176, "likes": {"liked": "— inexpensive", "disliked": "— unclean"}}], "location": {"country": "United States", "city": "Columbus"}, "stars": 2.5, "variance": {"poor": 13, "average": 26, "very good": 62, "terrible": 28, "excellent": 53}, "aka": "Comfort Inn North Hotel Columbus", "slim_ranking": 0.388489208633, "description": "Have great Location,Great Value,Clean Rooms,Delux Continental Breakfast,Big size Pool, Free wireless Internet."}