{"user_rating": 3.5, "review_count": 29, "name": "Comfort Suites Near Stone Briar Mall", "reviews": [{"rating": 2.0, "title": "comfort suite", "text": "Hotel room was not the cleaniest. Window unit was noisy. Beds do not have fitted sheets they work their way off as you sleep. Toilet would not flush. Nice size room with half wall that had sofa/coffee table desk etc. Some of the furniture was well worn. Was told the hotel was 6 years old and had been recently remodeled. Rooms did have microwave, coffee pot, and refrigerator. Over $100 for Thurs. stay.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "April 23, 2006", "id": 4996320}, {"rating": 4.0, "stay_parameters": "Stayed October 2005", "text": "Continental breakfast was a joke. There was cereal, prepackaged muffins, bagels and waffles. The waffle mix hadn't been stirred well enough before it was put in the dispenser and had lumps of flour all in it. They weren't edible. The microwave must have been 20 years old. Apple juice dispenser didn't have apple juice in it, I think it must have been water.", "title": "Loved it!", "helpfulness": 3, "user": "solgirlDallas", "date": "February 6, 2006", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 5.0, "service": 4.0}, "id": 4417739}, {"rating": 1.0, "title": "Will never again", "text": "I must say that I was leary after reading some of the reviews, but it was great!! My husband, myself, and our chihuahua got the Jacuzzi suite. It was awesome! And they are very dog friendly! I would stay there again anytime! We will definately be back.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "August 4, 2005", "id": 3738125}, {"rating": 5.0, "stay_parameters": "Stayed December 2004", "text": "Checked in to discover that they don't honor prepaid online reservations. Had made a reservation through comfort Inn online for non-smoking king suite. They didn't have one available on arrival so gave us the only thing left...smoking, double bed. Bed didn't have sheets on it. Bathroom filthy, air conditioner did not work nor did the elevator. We left and checked in to another hotel. Will never stay at a Comfort Inn again.", "title": "Great room with great beds", "helpfulness": 1, "user": "LMDanley", "date": "January 3, 2005", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 5.0, "service": 4.0}, "id": 2973763}, {"rating": 1.0, "title": "Next time somewhere else.", "text": "My sister's house was full of relatives so we decided to book a motel room for Christmas week. This is a very nice hotel room with wonderful beds. I always worry that I will wake up with a back ache but the beds were perfect. The rooms have a sitting area that is separated from the beds by a half wall. They are large for a motel room. We were very pleased and will use them again if we have a chance.", "helpfulness": 8, "user": "A TripAdvisor user", "date": "June 30, 2004", "id": 2240988}, {"rating": 3.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "We had an event in the area and hadn't planned on an overnight stay. When we decided last minute to stay over, this hotel was chosen because of its convenient location for our event. It was clean enough, but certainly not spotless. The staff was very gracious and helpful. The bed was uncomfortable but the pillows were great; linens were adequate but nothing more; TV worked but was small and had limited channels; wifi was good and free. Breakfast area was crowded, hot, and not particularly well stocked. Don't expect to sleep on the sofa-bed; ours was worn and the pull out parts hadn't been cleaned in quite some time.", "title": "If you're easy to please, you'll be pleased", "helpfulness": 1, "user": "Twoprofs", "date": "November 22, 2010", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 3.0, "sleep": 1.0, "rooms": 2.0, "location": 4.0}, "id": 87884964}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "If you need to be in the area, this hotel will suffice. But don't go out of your way to get here.", "title": "It is a great Hotel", "user": "tntatn", "date": "May 22, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 30536888}, {"rating": 3.0, "stay_parameters": "Stayed August 2008, traveled with friends", "text": "The Hotel has been recently renovated, furniture is in excellent condition, Breakfast is very good quality, staff is very helpfull", "title": "Nice Property", "helpfulness": 1, "user": "JP P", "date": "August 6, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 5.0}, "id": 18692190, "likes": {"liked": "— Proxmity to event, nice and cool.", "disliked": "— Breakfast was limited."}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "After reading the previous reviews, I think that the hotel has made huge improvment", "title": "Staff was great!", "user": "bekrann48", "date": "October 22, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 10219775, "likes": {"liked": "— Friendliness of staff", "disliked": "— N/A"}}, {"rating": 1.0, "title": "Never will I call them for a room", "text": "The property appeared to be well maintained and in good condition. The TV (a little old) was not hooked up properly when we arrived, but were able to get it working after some effort. Bed was a little hard for my taste, but was OK. Hot breakfast was limited to hard boiled eggs and bacon. Decided on to go to the fast food (Chick-fil A) in the area instead. Overall nice property that could use a few minor upgrades.", "helpfulness": 5, "user": "tulsasoftballtravelr", "date": "December 9, 2006", "id": 6349808}], "location": {"country": "United States", "city": "The Colony"}, "stars": 2.5, "variance": {"poor": 4, "average": 4, "very good": 13, "terrible": 3, "excellent": 5}, "aka": "Comfort Suites Near Stone Briar Mall Hotel The Colony", "slim_ranking": 0.75, "description": "The Comfort Suites® Near Stonebriar Mall in The Colony is conveniently located just minutes from the neighboring cities of Frisco, Carrollton, Lewisville and Plano. The hotel is close to popular attractions in the area; the Pizza Hut Park stadium, home of the F.C. Dallas MLS soccer team, the local Dr Pepper Ballpark home to the Frisco RoughRiders Double-A baseball team, and the Texas Motor Speedway. Southfork Ranch event and conference center, Lewisville Lake and Tribute Golf Club are also nearby."}