{"user_rating": 4.5, "review_count": 238, "name": "Comfort Inn Ocean's Edge", "reviews": [{"rating": 5.0, "title": "beautiful hotel by the sea", "text": "my husband and i were traveling the new england states.in our travels in maine we always try to stay at comfort inns. we found the ocean's edge in belfast. we were so glad we chose this one. the people were very friendly and helpful. the rates were reasonable. the view was just awesome from our room. the food was very good at there resturant where we had dinner.the contintential breakfast was very goo also. there was a large selection to chose from . we would highly recommend this hotel when you are traveling through belfast me. also the manager,barry asalone was a very friendly and helpful person. the hospitality was great.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "August 13, 2005", "id": 3759812}, {"rating": 5.0, "title": "A view from the Top", "text": "I spent two days at this property awaiting a cottage rental next door. The views are spectacular. Enormous view of West Penobscot Bay along with inhabited islands nearby. Staff is cordial, courteous and congenial. A fine experience which is recommended to all.", "helpfulness": 8, "user": "A TripAdvisor user", "date": "July 18, 2005", "id": 3680359}, {"rating": 5.0, "stay_parameters": "Stayed May 2005", "text": "One of the cleanest hotels I've been in. The room was a good size and the 2 QBs was a nice change from DBs. The view was beautiful! My kids enjoyed the indoor pool-couldn't get them out of there.", "title": "View is Outstanding!", "helpfulness": 11, "user": "2KoalaBears", "date": "June 9, 2005", "detail_rating": {"cleanliness": 5.0, "rooms": 5.0, "value": 5.0}, "id": 3541126}, {"rating": 5.0, "stay_parameters": "Stayed May 2006", "text": "My husband and I stayed here in early May. I agree with the previous poster who said the staff was very friendly and courteous. It was nice to come across genuinely friendly people who were eager to share their town with tourists. The rooms were clean, the bed comfortable, the view amazing and the adjoining restaurant - Ocean's Edge - very delicious. We thoroughly enjoyed our stay and would stay again and recommend this hotel to anyone!", "title": "Great hotel!", "helpfulness": 5, "user": "Buffy4444", "date": "May 31, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 5288133}, {"rating": 5.0, "title": "great hotel for people with small dog", "text": "i would stay here again. great location. this hotel will always have a place in our hearts. it was the last vacation for our 14 yr old pug. we have many great photo's of her on the well kept grounds with a great view in the background. the staff were very friendly and housekeeping does a great job. the rocky beach area was also nice. my wife loved the restaraunt food and the fact we could bring it back to the room. this hotel makes people with pets and small children feel welcomed. two nights well spent", "helpfulness": 4, "user": "A TripAdvisor user", "date": "April 9, 2006", "id": 4954845}, {"rating": 5.0, "title": "love it love it !!!!!!!!!!!!!!", "text": "i love staying at the comfort inn. the staff is very helpful and very nice. wouldn't consider staying anywhere else. my two dogs enjoyed it very much. the prices were reasonable. the rooms very clean.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "February 2, 2006", "id": 4410427}, {"rating": 5.0, "stay_parameters": "Stayed September 2005", "text": "What a great spot for a hotel. Gorgeous views of the ocean. Sweeping lawn leading down to a small rocky \"beach\" to walk on. Every room has their own balcony, although they are not very private. Breakfast out on the deck was great - they offer the usual cereal, toast, coffee, juice etc. We would definately stay here again.", "title": "Beautiful Views", "helpfulness": 4, "user": "vter", "date": "September 12, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 3.0}, "id": 3896033}, {"rating": 5.0, "stay_parameters": "Stayed August 2005", "text": "Wonderful motel. We had a great balcony with ocean view. The staff were among the most friendly. The continental breakfast was delicious. Lots of fruit and homemade waffles.", "title": "Love Comfort Inn Belfast", "helpfulness": 4, "user": "robyn6002", "date": "August 20, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 3791929}, {"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "We stay here when visiting nearby family. We stay for two or three nights at a time, about 8 times over the past three years. The front desk folks are always pleasant, and fresh chocolate chip cookies on check-in. This must be the best view from any Comfort Inn anywhere. Ask for a third floor room. Every room has a small balcony or patio overlooking Penobscot Bay. The rooms are basic, but we've always found them to be clean. The bath has a nightlight, a nice touch. There is noise through the walls and from the hall, but no worse than most hotels. It was most annoying the weekend a large bridal party stayed there. The Bangor paper is delivered to the room on weekdays.", "title": "Fabulous view, pleasant hotel", "helpfulness": 2, "user": "wunderwoof", "date": "November 28, 2006", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 6230407, "likes": {"liked": "— The view"}}, {"rating": 3.0, "stay_parameters": "Stayed November 2006, traveled with friends", "text": "The king suites on the third floor each have a small refrigerator and microwave in the sitting area (with sofa bed) separated from the bed area by the bath. The down side of these is they're at the top of the stairs and over the breakfast area so they're noisier than most rooms.", "title": "OK Stay", "user": "Nativemainer", "date": "November 12, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0}, "id": 6110975, "likes": {"liked": "— Location, great breakfasts, comfortable beds, pet friendly", "disliked": "— Non smoking room smelled strongly like smoke."}}, {"rating": 4.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "The continental breakfast is pretty extensive, but very carb heavy. They did add hard boiled eggs to the offerings recently, but fruit seems limited to a bowl of apples and oranges.", "title": "Terriffic Place and Friendly Staff", "helpfulness": 1, "user": "GayeL", "date": "October 17, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 5963614, "likes": {"liked": "— Location, location, location", "disliked": "— We had to leave"}}, {"rating": 5.0, "title": "Great hotel / friendly staff", "text": "There's a pool on the first floor, and the smell of chlorine tends to waft through the first floor hall. Surprisingly crowded on a weekend last January... we were told lots of Maine families come to the coast in the wintertime for an escape. Pets are allowed on the first floor for a small fee. Decent onsite restaurant for dinner, tho we haven't eaten there since the chef left to open his own place this past spring.", "helpfulness": 3, "user": "dahm", "date": "August 22, 2006", "id": 5692308}, {"rating": 5.0, "title": "An ideal place for a vacation of any duration", "text": "I have stayed at this facility numerous times, and this is the first time that I can say I have not been totally satisfied. As always, I was traveling with a dog, and the Comfort Inn Ocean's Edge is very pet friendly and has a great area to walk a dog, going right down to the water. No problem there. The room was clean, as usual, and the breakfast was great---the usual waffles, eggs, bagels. cereal, muffins, etc. However, I have smoke allergies, so must book a non smoking room. The plaque on the door SAID it was non smoking, but when I went in, I knew someone had been smoking there. It was very strong, as was the sickly sweet chemical smell they had used to try to mask it. Plus, there was a cig. burn on the rug---more evidence. But, it was late, I was tired, and the hotel had many guests, so I just opened up the window, put on the fan, and endured it. I woke up with itchy eyes and a sore throat. If I had been staying for more than one night I would have insisted on a room change, and if having a non smoking room is important to you, be sure to stress that when you check in. Last year my friends had the same thing happen to them that happened to me there.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "July 8, 2006", "id": 5441135}], "location": {"country": "United States"}, "stars": 2.5, "variance": {"poor": 5, "average": 24, "very good": 71, "terrible": 2, "excellent": 136}, "aka": "Comfort Inn Ocean`s Edge Hotel", "slim_ranking": 0.285714285714, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.0, "location": 4.5}, "description": "Every room has an ocean view, and includes all the amenities you would expect plus a refrigerator and microwave in every room. 2nd and 3rd floor rooms have a balcony, while 1st floor rooms have immediate pool access and a rear door that opens on to our ten acres leading to the water. The property features an indoor heated mineral pool, hot tub and sauna, game room, guest laundry facilities. Free hot breakfast and free WIFI are included. We are connected to Ocean's Edge Restaurant for fresh seafood, steaks and pasta served in a comfortable, casual atmosphere. Join us on the patio in summer for alfresco dining."}