{"user_rating": 4.5, "review_count": 359, "name": "Comfort Suites Bypass", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "We went to Williamsburg to Xmas town and stayed over for a weekend, the hotel was excellent, the rooms were comfortable, clean and the breakfast was very good.", "title": "Excellent hotel!", "helpfulness": 3, "user": "ClaudiaMayer", "date": "January 30, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 151026918}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "The location was great, we had everything near by and the parks were 15 minutes away.", "title": "Eye Popping Decor", "helpfulness": 3, "user": "gogators52", "date": "January 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 150850672}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "We'll definitely come back!", "title": "Comfy and Modern!!", "helpfulness": 1, "user": "Monjay40", "date": "January 23, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 150358000}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "Red, black, silver and Oriental? We picked this hotel from the good reviews here on Tripadvisor and they were honest and accurate. The color combo and theme were never mentioned so maybe other travelers didn't gasp when they entered the lobby BUT we did! We just weren't prepared for the very modern \"look\". I booked by prepaying on line so our rate was fantastic and check in was trouble free. The staff were attentive and helpful, the breakfast area was well stocked, our room was large and very comfortable. While we were there in Williamsburg, it snowed so we made a point to enjoy the hot tub area with the large glass windows that gave us a view of the lovely falling snow! This is a top notch hotel and we will return again if possible.", "title": "Nice hotel in Williamsburg", "helpfulness": 3, "user": "Carol D", "date": "January 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 149463855}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "I stayed here at this for New Years Eve and we werent here for a long period of time but it was a nice experience overall! The room was nice and clean, very modern and spacious! I would recommend this hotel for any length of stay!!!", "title": "Nice hotel with Overstimulating Decor", "helpfulness": 2, "user": "delmarvamom", "date": "January 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 149414826}, {"rating": 4.0, "title": "Great hot tub!", "text": "We planned a romantic getaway and chose this hotel because some rooms have a hot tub right in the room (not the bathroom). We were mostly pleased with our selection. The good: the hot tub! It was big enough for both of us and worked perfectly. The room was clean and I liked the modern decor. The not so good: the bed, while big (it was a king) was not the most comfortable. However, I'd be willing to stay here again so it wasn't that bad. I was also not happy with the breakfast selection. The \"egg\" circles were bad and there were no other options (like hard-boiled) and the cereal selection was very limited. There were no bagels or English muffins, either. So I will keep that in mind if I stay here again. Considering that there aren't that many hotels at this price with hot tubs though, I just might go back. ;-)", "helpfulness": 3, "user": "Aibutiej", "date": "March 17, 2013", "id": 154894551}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled on business", "text": "Very clean and very nice. Great Location. Pleanty of restaurants very close to hotel. Olde town Williamsburg very close. Will be back this summer for personal vacation. The hotel is one of the best I have stayed in for the money. I highly recommend this place.", "title": "Great place to stay", "helpfulness": 4, "user": "Chris W", "date": "March 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 154378716}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "We stay at this hotel a couple times a year and love it. The front desk staff is great. It is located close to most everything in Williamsburg-historic area as well as shopping areas. The hotel is fairly new and decorated very well. I've come with my husband for the weekend and with my sisters for a shopping spree. The beds are comfy and room large. This has become the hotel for us when we want to get away. You won't be dissappointed.", "title": "Beautiful and Comfortable", "helpfulness": 4, "user": "mawmaw2three", "date": "February 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 153219326}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled on business", "text": "I stayed here for 3 days.....would certainly stay here again. This hotel does have a very modern feel to it; stands out from most hotels I've stayed in. An unusual interior decoration, but I liked it.", "title": "Excellent value, great staff, visually different", "helpfulness": 5, "user": "John108Atlanta", "date": "February 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 151621608}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled with family", "text": "We stayed in a double queen bed with a sofa/ living area with a partial divider. Very comfortable, spacious, and easy to work in. It is conveniently located to just about everything, including the college (William and Mary). Breakfast was good and ready every morning for the early risers. The staff were personable and accomodating. And excellently priced; I don't know if it was or there is an off season (January), but for this kind of room, I was pleasantly surprised.", "title": "Great Place !!", "helpfulness": 2, "user": "taelorsmommy", "date": "February 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 5.0, "location": 3.0}, "id": 151546581}, {"rating": 4.0, "title": "Newer, quiet property", "text": "Comfort Suites has not been a brand on my radar for several years but based on past reviews and the price, our family opted to stay here for several nights while visiting the Williamsburg area. Staff was friendly and helpful. Breakfast was adequate and what we expected. The kids loved the chocolate waffle batter a treat! Pool area smelled very strongly of chlorine - much stronger than normal - to the point where I needed to leave the area for fresh air. The room itself was large with plenty of space to spread out. Very convenient to Colonial Williamsburg. It was very quiet, which was very important to us. Overall, a very good experience.", "helpfulness": 3, "user": "MMJ01", "date": "January 1, 2013", "id": 148552182}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "My friend and I stayed here this past weekend with our kids and we really enjoyed our stay. The room was comfortable and clean and the hotel was clean as well! We checked in about 9pm. Quick and easy check in, front desk clerk was very polite and friendly! Our room was nice and clean. Had everything we needed. Girls wanted to go swimming so we went down and let them swim for an hour. The girls enjoyed the pool very much! My friend and I got in the hot tub and it was great! They had towels we could use as well down at the pool. Beds were very comfortable, the pillows weren't very comfy, but they were hotel pillows so I guess its expected. My daughter slept on the pull out couch, had no problems sleeping on it. Shower was hot and great pressure. Breakfast in the morning was the normal fare. Belgian waffles, bagels pastries, cereal, etc. Also finding this hotel was very easy as well, right next to a Golden Corral. Check was fast and easy as well. All in all I really enjoyed my stay here, will def stay here again.", "title": "Very Comfortable, just what we needed", "helpfulness": 1, "user": "jiwdurando", "date": "December 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 147924455}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "We just stayed at this hotel while visiting Busch Gardens Christmas Town (well worth the crowds). Hotel is new. We stayed in the two \"bedroom\" suite, which is actually one large bedroom with a door that separates it from the rest of the suite, which had two queen size beds and a sleeper sofa. Plenty of room for 5 of us, and the price was very reasonable. Breakfast was standard continental style, including waffles and a nice treat for the kids-chocolate waffles. Pool and hot-tub were pretty much the norm for a hotel this size. Overall great value for the price and compared to others. Very friendly staff and cooperative. If using your Tom Tom to get there, I had a little trouble finding it. If you find the Golden Corral, it's in teh same parking lot. Only complaint I have is that like so many hotels, the heat/ac unit is located under the window-standard, but they tend to be loud and constantly cycle on and off.", "title": "Clean, family friendly", "helpfulness": 1, "user": "Rob S", "date": "December 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 147560461}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "We recently stayed at this hotel on the first week of Dec. 2012 for the second time this year. Everything was just as wonderful as it was the first time around. Staff very friendly and helpful,", "title": "Pleasant vacation spot", "helpfulness": 1, "user": "TippyP", "date": "December 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 147457490}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "All the maids and everyone were so very nice. Rooms and the whole hotel were beautiful and exceptionally clean. Breakfast was great, lot of choices. Was very convenient to all restaurants and shopping and activities. Inside pool and hot tub were great. We go to Williamsburg , VA", "title": "Great base for exploring Williamsburg area...", "helpfulness": 1, "user": "mary c", "date": "December 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 147319107}, {"rating": 4.0, "stay_parameters": "Stayed March 2013", "text": "My partner, child, and I stayed here for three nights at the end of March for a family vacation. We visited Busch Gardens, Colonial Williamsburg, and Jamestowne. The hotel is very modern and new, which we liked. The rooms are large, the hotel has a nice indoor pool and spa, and offers a nice free breakfast, which is a great value.", "title": "A great hotel let down by shabby, uncomfortable bedding and furniture.", "helpfulness": 1, "user": "tapdancer77", "date": "April 1, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 3.0}, "id": 156310750}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "There was one major and one minor downside to this hotel: the bedding and the furniture, respectively. The beds themselves were comfortable enough, but the bedding itself (sheets, blankets, pillowcases) was very shabby and did not make for a very good night's sleep. Also, although a new hotel, the furniture already seemed a bit tired...and I'm specifily referring to the fact that the chest of drawers never closed properly. It was minor, but over our stay, it became pretty annoying.", "title": "Clean/Inviting/Convenient/", "helpfulness": 3, "user": "Ieesha", "date": "March 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 155893278}, {"rating": 2.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "Other than that, everything was fine. Staff friendly, we didn't hear too much noise, good location. But, because of the let down of the bedding situation, we might try another hotel next time.", "title": "Cheap and poorly maintained", "helpfulness": 1, "user": "alexman1968", "date": "March 26, 2013", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 2.0, "sleep": 1.0, "rooms": 2.0, "location": 3.0}, "id": 155767740}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "I have stayed at this hotel at least 5 times while visiting Busch Gardens in 2012. Since my first encounter with a tour from one of their friendly staff, I have changed from my previous hotel of choice. The rooms are very clean and spacious. I did have one complaint the first day as children above our room were constantly running. The staff took care of that immediately and was very courteous about it. I like the variety of breakfast choices however, there is not enough space for the lines that tend to build up very quickly (but it was not a mind changer) which is understandable. It is located in walking distance from cracker barrel which my kids love for dinner as well as an all you can eat chinese buffet near the Kmart. With all that you get from the friendly service to the quality of the hotel the price is more than reasonable, and this hotel will continue to be my hotel of choice! Again great job to the friendly staff, it does make a difference!", "title": "Great bargain for a really great visit.", "helpfulness": 2, "user": "Raymondocanuck", "date": "March 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 155502662}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "The hotel is relatively new, but poorly maintained. They do not replenish the breakfast nearly fast enough, but put it away with lightning speed when the time is up. The air hockey in the games room is has no puck, but they have not turned off the machine, and it accepts your money. Both the treadmill and the clock in the tiny exercise room stopped working when we were there. The pool is small and usually crowded. The king suite was small and not really a suite, but a room with a 2' wide glass divider between the bed and the sofa. The double queen suite was a little larger, but still very small. The pull-out sofa was undersized and extremely uncomfortable, even for a 40 lb child. We were placed in a first-floor room, next to the fitness center and opposite the game room. Needless to say, we did not get much sleep.", "title": "Great bargain!", "helpfulness": 1, "user": "Judith G", "date": "March 23, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 155451034}], "location": {"country": "United States", "city": "Williamsburg"}, "stars": 2.5, "variance": {"poor": 7, "average": 26, "very good": 118, "terrible": 1, "excellent": 207}, "aka": "Comfort Suites Bypass Hotel", "slim_ranking": 0.135802469136, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}}