{"user_rating": 4.5, "review_count": 55, "name": "Comfort Suites Wichita", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled with family", "text": "I couldn't believe how nice this hotel was, from breakfast to the rooms to the hotel itself. Had to doublecheck the name of the hotel, definitely a high-end Comfort Inn place. VERY tricky to get to, right off highway near airport, but no exit nearby, call first and sk them the best way to get there, my GPS could not figure it out.", "title": "incredile, new hotel, thought it was a Crown Plaza", "user": "Herk_Driver", "date": "July 28, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 36047402}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled on business", "text": "I travel to Wichita quite a bit and I have never seen a hotel so clean!! I usually stay downtown for I travel from east to west and its the center of the city. I will never stay at another hotel in wichita. I was really impressed by the customer service this hotel provides. When I checked in I recieved a call asking how everything was in the room. Never knew hotels did that.", "title": "Amazing", "user": "Schmidty3434", "date": "April 23, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 28626756}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled on business", "text": "Was here for 2 nights. Rooms were large and it was a bonus to have the 2 Flatscreen T.V's. Beds were comfortable and bathroom was well stocked.", "title": "Clean, comfortable and friendly!", "user": "dee90909", "date": "April 7, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 27586274}, {"rating": 4.0, "stay_parameters": "Stayed March 2009, traveled with family", "text": "Could not get on the WI-FI but that could have been me....had trouble printing from the computer in the lobby as well, but the manager came out quickly and fixed the problem. We were holding interviews for a position in Wichita and they let us use the Breakfast room without any problems. This hotel is very quiet and was a nice place to stay. Only thing is they are not actually on W. Taft...it is really Emerson...We had a hard time finding it as a result. The manager said that they are fighting with the city over this.", "title": "Great Place", "user": "MaudeJennings", "date": "March 21, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 26537464}, {"rating": 5.0, "stay_parameters": "Stayed February 2009, traveled with family", "text": "Stayed here two nights...not consecutive. Hotel is clean and very quiet. There were two double beds and a sofa bed, so it was perfect for travel with two teenagers. ( Two flat-screen TV's in the room, too) Front desk personnel were kind and professional. We arrived very late both nights, and check-in was quick. The only drawback was that breakfast is over at 9:00 on weekdays. This doesn't work for traveling with teenagers....at least my teenagers. And the room was just a tad pricey, especially considering today's economy. But other than that, I highly recommend this hotel if you are staying on the west side of Wichita. Actually, I've stayed in Wichita quite a bit, and it's the best one yet. It's only two years' old as well.", "title": "Amazing!", "user": "gracie1004", "date": "March 12, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 26036363}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "We stayed here for a night in August, 2008. As a general rule, we don't tend to stay in a Comfort Inn property unless we can actually see the building (which we did on this occasion-we didn't book ahead of time since we didn't know we'd be in Wichita) since some of the properties are worn down.", "title": "Extremely Good Value", "user": "4Faulks", "date": "August 7, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 3.0, "rooms": 5.0}, "id": 18701446, "likes": {"liked": "— Very clean.", "disliked": "— Nothing, really, but one of the exterior doors was not operational."}}], "location": {"country": "United States", "city": "Wichita"}, "stars": 2.5, "variance": {"poor": 1, "average": 4, "very good": 18, "terrible": 1, "excellent": 31}, "aka": "Comfort Suites Wichita Hotel Wichita", "slim_ranking": 0.240506329114}