{"user_rating": 4.0, "review_count": 92, "name": "Comfort Suites Madison West", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "When I arrived with my son and lugging in my bags it would have been nice to have sliding doors. Then I walked in the lobby and thought man they have not decorated since the 90's. That is my over all feeling, this place is out dated and needs a remodel. I did get a nice sized room, two double beds and a nice sitting area. I was on the second floor on the pool end. Our first night was fine. Then Friday and Saturday night we shared the motel with a Softball tournament, they were loud. I over heard in the elevator that someone had ants in their room. Then on Sunday driving with my parents who were on the second floor and on the conference room end of the motel said they had ants too. My room was not very clean, it sink had hair around it and the bath tub drain was broken. I bring sani wipes with me so I cleaned the sink and fixed the drain shut to give my son a bath. The pool and hot tub were dirty. The food wasn't good, but made due with what they provided us. They said they had internet and printers, but the printer was out of order when I wanted to go print my boarding pass for my return flight. My next trip to Madison I will pay more to have a clean and more up to date and ant free stay.", "title": "So So", "helpfulness": 1, "user": "sandasavi", "date": "June 21, 2011", "detail_rating": {"cleanliness": 2.0, "sleep": 3.0, "value": 2.0, "service": 3.0}, "id": 114621529}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled with friends", "text": "Friends and I took a shopping trip to Madison and the surrounding areas and had a great stay at CS. There were 3 of us and we had booked a room with two double beds. It was a nice surprise to have 2 double beds AND a pull out couch. Plenty of room for all! The complimentary drink was nice after a full day of shopping....plus free pizza! The continental breakfast was more than enough with pastries, yogurt, freshly made waffles, juices and cereal. I would recommend this hotel to anyone going to the Madison area.", "title": "Great stay - nice \"extras!\"", "helpfulness": 1, "user": "Nanc01", "date": "June 2, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 111110710}, {"rating": 1.0, "stay_parameters": "Stayed March 2011, traveled with family", "text": "The sign by the front desk announces that the pool is open until midnight. That seemed a bit late to me but our room was at the far end of the first floor away from the pool area. What we did not anticipate was screaming children running up and down the hall, rooms with the doors open blaring music and drunken adults shouting slurred profanity. After three attempts to reach the front desk I finally reached someone after midnight and asked them to deal with the situation. She was polite and apologized over and over but the noise persisted until nearly one in the morning.", "title": "If you want sleep this is NOT the place for you", "user": "MoTGK", "date": "March 27, 2011", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 1.0, "sleep": 1.0, "rooms": 3.0, "location": 2.0}, "id": 101724453}, {"rating": 4.0, "stay_parameters": "Stayed February 2011", "text": "We will never come back to this hotel again.", "title": "Comfort and Quality", "user": "bigrockelk", "date": "March 23, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 101322750}, {"rating": 2.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "We stayed at the Comfort Suites with a group for a ski trip in February. The lobby was nicely decorated and the front desk attendants were friendly and helpful. The pool was quite large and the kids loved the game room. For a suites hotel the rooms were a tad small but it was fine for a one night stay. The breakfast was good, the hotel was clean and the rate was great. I would definitely stay here again!", "title": "Hard to regulate temperature control", "user": "squee5ze25", "date": "January 4, 2011", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 5.0, "sleep": 1.0, "rooms": 1.0, "location": 5.0}, "id": 91688754}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled on business", "text": "I have not had good experience with Choice Hotel properties, so when my employer booked me here, I really wasn't looking forward to it. I arrived and really enjoyed the hotel, as it did have the look and feel of a hotel that charges a bit more. The breakfast had a different hot entree each day, which was nice. They also had a happy hour with hot food in the evenings which was also a nice touch. The look was nice, and everyone there was very helpful and friendly. I did think this was a good value for the money.", "title": "Pleasantly surprised", "user": "bakphoenix", "date": "June 7, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 2.0, "service": 4.0, "rooms": 4.0}, "id": 31797911}, {"rating": 2.0, "stay_parameters": "Stayed May 2009, traveled solo", "text": "The one thing that I found I didn't like was the fitness center. It is a few macines in a very small room, with horrible ventilation. I showed up and one other person was in the room excersing. We had the fan on in the room, but it was still incredibly hot and stuffy. They need to vent the air to the neighboring pool area.", "title": "disappointed", "user": "TravelerFL", "date": "May 24, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 3.0, "service": 2.0, "rooms": 3.0}, "id": 30675822}, {"rating": 4.0, "stay_parameters": "Stayed May 2009, traveled on business", "text": "After reading reviews and descriptive info on the hotel website, I was looking forward to my 3 day stay. Firstly, the 'good'.....wifi internet service...fine breakfast...clean room and clean bathroom. Now, the 'not-so-good\"......upon arrival, the desk clerk seemed to have 'a bit ot an attitude'.....something that I find to be rare in my other Madison hotel stays. The couple checking in ahead of me had two small children...and of course, I was assigned a room next to theirs. By the time I arrived at the assigned room, the kids were squalling 'big time'....also the room windows would not open. I returned to the loby to request a move, which I was given. The second room was an improvment, and the windows DID open. A small point....I was not offered a free cocktal coupon for the M-S Manager's reception....so I visited other nearby cocktail lounges. More 'not so good'...upon arrival, the first smell was one of ...'musty'.....the place has dark wood, dark wall paper....dark everything.....rather depressing. Ancient television sets with some major network connections poor to say the least. The 'walls are very, very thin'...and if someone is in the room above you, you could be in for lots of noise. The bathroom fans roar line a 757.....and the plumbing roars. In the room, you have a seating choice of a straight back chair (oh, my aching back) or a sofa.....no comfortable chair. Before 10 a.m. i find a note under my door telling me that housekeeping has honored my do not disturb sign, and if I need service to call the front desk before 11 a.m.......sorry, I'm on vacation and won't work around the housekeeping staff schedule......all in all......next Madison visit, I'll stay elsewhere.", "title": "Great value", "user": "thompstone", "date": "May 3, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 29257815}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled with friends", "text": "Hotel is small compared to the Marriott nearby, but it seemed like everyone was staying here. Great room rates at this place.", "title": "Great value, great location", "user": "erikedge2", "date": "April 21, 2009", "detail_rating": {"cleanliness": 5.0, "location": 4.0, "value": 4.0, "rooms": 5.0}, "id": 28519028}, {"rating": 4.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "Free parking and plenty of it.", "title": "Nice hotel, very comfortable", "user": "casey101", "date": "April 18, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 4.0, "rooms": 5.0}, "id": 28290665}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled with family", "text": "We just returned from a weekend sports tournament and were pleasantly surprised by this hotel.", "title": "Lots of room to spread out", "helpfulness": 1, "user": "sccrmom", "date": "October 16, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 10085420, "likes": {"liked": "— location, room size", "disliked": "— noisy hallway close to lobby"}}, {"rating": 2.0, "stay_parameters": "Stayed May 2007, traveled on business", "text": "The rooms are VERY clean and we love the 100% no smoking atmosphere. We were also very happy with the size of the room. There were only 2 of us but this room could easily accomodate more. The bathroom is sizeable as well and the shower had great pressure. Again all very clean and tidy.", "title": "Decent enough", "helpfulness": 2, "user": "brinav", "date": "May 31, 2007", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 3.0, "cleanliness": 2.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 7724667}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "The beds were comfotable and ample pillows were provided.", "title": "Nice Stay", "user": "spackler34", "date": "March 17, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 3.0, "rooms": 5.0}, "id": 7180112}, {"rating": 4.0, "title": "Nice Facility", "text": "A continental plus breakfast is included and there was a great selection of cold and hot foods- different on both mornings which was nice.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "December 21, 2005", "id": 4254985}, {"rating": 1.0, "title": "Horrid", "text": "The pool was very nice and not over chemicaled like some can be- very spacious atmosphere with a prety decent game room attached", "user": "A TripAdvisor user", "date": "July 30, 2005", "id": 3722763}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled with friends", "text": "I've stayed at this hotel maybe a dozen times, and I'm never disappointed. This time, as always, the front desk staff was top notch, the suite was clean, breakfast was hot, if not thrilling, and now the Sprecher brew pub is open nearby for a fun gathering with friends of both the beer drinking, and root beer drinking varieties.", "title": "Top notch service as always!", "user": "Quilmesgrl", "date": "October 8, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 82594716}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled on business", "text": "The hotel is near a ton of shopping opportunities, and I also enjoy long walks along the streets near the hotel for morning exercise or to walk your dog.", "title": "Great hotel in great location!", "user": "AGS_guy", "date": "September 26, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 81066597}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled with family", "text": "I can't say enough about how nice the people are here. A couple of years ago, we were there with our dog during the holidays, and the staff showed up with small dog treats and toys all wrapped for Christmas. when we've needed to add rooms on the fly, or make reservation changes, these guys are really great.", "title": "Fantastic Family Reunion", "user": "tvgranny", "date": "June 27, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 68864982}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "Hotel is on the beltline, so you're just a quick jump to downtown Madison, or hop over to Middleton easily too.", "title": "Quality stay near Middleton", "user": "gogogadget1", "date": "June 9, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 67029047}, {"rating": 3.0, "stay_parameters": "Stayed March 2010, traveled on business", "text": "I stayed at the Comfort Suites in Madison for 5 nights at the end of August/early September for a business trip.", "title": "Great location - housekeeping disappointing", "user": "dulinh", "date": "March 25, 2010", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 59510657}, {"rating": 4.0, "title": "pleasant stay", "text": "Nice hotel. We had 2 rooms on top floor. One room had 2 doubles with a pull out. The most comfortable pull out bed I've ever slept on! The second room was a two level suite. Upstairs had a king bed with full bath including whirlpool tub. Downstairs had a little counter with fridge and microwave, big table with four chairs, full couch, wingback chair and another full bath. Would stay again.", "helpfulness": 2, "user": "Nicki116", "date": "December 28, 2004", "id": 2954132}, {"rating": 1.0, "title": "Comfort Inn and Suites", "text": "Worst night I have ever spent in my life! Cheap hard mattress with no padding. Cheezy foam pillows. Sheets that didn't fit and kept coming off. Never again!", "helpfulness": 1, "user": "BarbaraL", "date": "September 5, 2003", "id": 1274768}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled on business", "text": "I stayed at the Comfort Suites five days, then the next week for three. My first night back I had no heat in my room. The front desk clerk attempted to get the heat functioning, then the clerk from the next shift attempted it. Once they realized it was never going to happen they offered me the Presidential Suite for my three night stay. I must say, it was a cut above. I appreciate their concern and quick action to solve my problem. I definitely would recommend this hotel based on the great customer service I received my whole stay.", "title": "Wow!", "user": "Flutterbyfly", "date": "March 23, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 59333440}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled on business", "text": "I had an early flight and when I arrived at the hotel, I expected to hear \"sorry, but you'll have to wait until we have a room ready.\" Instead the driver told me I would most likely have my room, but if it wasn't ready he would hold my luggage and drive me to the mall, any restaurant, or even a movie. My room was ready & I took him up on his offer. He dropped me off at the mall, then later took me to a movie, and then picked me up. I was so impressed with the friendliness and the staff went out of their way to make my experience a pleasurable one. The next day we had a meeting at the hotel, again the same friendliness to accommodate anything & everything we needed. We will definitely plan to stay there for our event next year.", "title": "Great Experience", "user": "celebratinghome", "date": "March 22, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 59256371}, {"rating": 5.0, "title": "What a wonderful place to stay!", "text": "My stay at the Madison, WI Comfort Suites was totally unanticipated and a most pleasant surprise! If you are in Madison, Wisconsin for business or pleasure, you might want to consider staying here. The Suites are located in Middleton, which is on the west side of Madison, in close proximity to several shopping areas and with easy access to downtown Madison.", "user": "hurricanemary", "date": "September 13, 2009", "id": 41447550}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "The minute I walked into the lobby I felt like I had been transported back to the 18th Century (being a huge fan of Colonial Williamsburg, this was truly a great find!) The staff was extremely pleasant and helpful, and assisted me with arranging a shuttle to the Badger Bus depot the following morning.", "title": "Excellent location and above average hotel", "user": "littree", "date": "August 17, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 37952787}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "The lobby area was beautifully decorated, with two elevated areas for reading or TV viewing. The dining room/pub was very nice, and I was able to enjoy a brief respite during Happy Hour. The following morning, a tasty, hot breakfast buffet was served.", "title": "Nice hotel - clean, courteous, and convenient", "user": "imattss44", "date": "August 15, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 37743662}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled on business", "text": "I arrived at 11pm on a cold March night and I have to say that my room temperature would not increase. The lady from behind the counter came up stairs to try to fix it. She stayed and helped me moved to another room. She carried my bags and bend over backwards to show me that she cared I was cold.", "title": "Excellent service", "user": "Ester999", "date": "March 30, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 27126001}, {"rating": 1.0, "stay_parameters": "Stayed December 2008, traveled on business", "text": "I'm going back next year and will definitely stay there again.", "title": "Never Again", "user": "funtraveler188", "date": "January 1, 2009", "detail_rating": {"front_desk": 1.0, "business": 3.0, "service": 1.0, "cleanliness": 3.0, "value": 1.0, "location": 2.0, "rooms": 3.0}, "id": 23149224, "likes": {"liked": "— 2-level Room", "disliked": "— Staff & their service"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "First of all, when I called to make a reservation, it was very obvious that the employees do not individualize the phone calls because it almost sounded like a scripted sales call. Also on the phone, I informed the lady that I was coming for business and she went on to tell me how the hotels' location was convenient for shopping and how they had an indoor pool/whirpool.", "title": "Good place for families", "user": "JMGBarcelona", "date": "July 22, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 18145674}, {"rating": 5.0, "title": "Another great stay at the Comfort Suites", "text": "After arriving to the hotel, I stood at the front desk for a while waiting for someone to finally get me checked in. I'm not absolutely sure, however, the employee seemed to be a manager or assistant manager but in my opinion did not act as such. She seemed to rush through her \"spiel\" about the hotel & ammentities. I did not feel fully welcome. When attempting to call down to the front desk a couple times from my room, the phone rang about 15 times before someone answered the phone.", "helpfulness": 2, "user": "bsisvogel", "date": "November 4, 2007", "id": 10601543}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled on business", "text": "Even though it was not a weekend night, the hallways were loud with kids running around. They did have a decent happy hour and the breakfast in the morning had a few hot choices, however, not very tasty.", "title": "Great value, and a great room", "helpfulness": 3, "user": "WisconsinHigh_Miler", "date": "October 22, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 10209838, "likes": {"liked": "— Size and cleanliness of room"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled with friends", "text": "Great hotel with some added bonuses (free transportation to and from airport, but not before 6AM and not on Saturdays), good free breakfast served 7-9AM on weekends. I had to fly out before breakfast and they gave me a bag of snacks to go. Easy walking distance to things in Middleton, but a $25 cab ride to downtown Madison. You can catch the city bus for $2 walking distance from hotel and it's about a 45 min. ride to downtown Madison.", "title": "Great hotel but far from downtown Wisconsin", "helpfulness": 1, "user": "GoBeavs", "date": "September 12, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 4.0}, "id": 118021028}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "The rooms were clean and beds comfortable. Oh yeah and a complimentary drink upon arrival and then 2 for one for hotel guests!", "title": "Very accomodating", "user": "unpaidbill", "date": "August 21, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117033713}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled on business", "text": "We were part of a large gathering of auto enthusiasts on a driving-tour weekend. The check-in was very smooth...we had requested that they not use deoderize spray in the room due to my wife's sensitivity, and they made sure to honor that request. We got an early check-in, which was much appreciated. Everyone at the front desk was extremely helpful with every request. The room was spacious, clean and quiet. Internet access was fine, in-room coffee, microwave and fridge all worked fine. Since our group was made up of 'car nuts', they hotel thoughtfully provided a box of clean, old towels for us to use cleaning up the cars. Breakfast was pretty standard fare, but tasty. Each evening, the management provided a 'happy hour' with a free drink in the bar area. The one night we were able to attend, they were offering TWO free drinks and pizza. Nice touch.", "title": "Great place to stay", "user": "retire11", "date": "July 29, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115942754}, {"rating": 2.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "Very accommodating. Had business with UW Hospital, stayed a week - some nights needed 3 rooms, others 2 some 1. Great continental breakfast each day. Helpful front desk. Clean and quite.", "title": "Eeeeeeeeeeew", "helpfulness": 3, "user": "Packerfan1999", "date": "June 24, 2011", "detail_rating": {"cleanliness": 1.0, "sleep": 3.0, "value": 1.0, "service": 2.0}, "id": 114710540}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "Boy has this place gone down in the last couple of years. We stay here every summer because we liked the 2 floor suite. Sorry to say this year was our last. Where the room is located, the ice machine is right around the corner. Convenient, right?!? Well, not if it ISN'T WORKING! The ice machine as well as the vending machine right next to it were both out of order, with no signs indicating this. So we had to go down a floor every time we wanted ice. Then, one of the upstairs lights by the bed didn't work. A very nice front desk person came up and tried a couple of bulbs, didn't work. She said she would have maintenance check it the next day, since it was night by now. No problem. The next day, he changed the bulb, she said he didn't have a problem. I went to turn it on and SPARKS came out of the plug!! YIKES! Then, there was the pool. That is where EEEEEWWW comes in. There were band-aids all over the floor, only 1/2 the jets worked in the hot tub, the hot tub had dirt on the floor of the tub and all of the corners of the steps and seats, the clock didn't work the whole time we were there. Which would be fine if you didn't have plans and had to keep getting out to check the clock in the workout room outside of the pool. Real convenient. The \"gameroom\" in the pool room was disgusting. There was 1, and I mean ONE toy in the claw machine, there were rubick's cube keychains hanging in one game as prizes and a bunch of the stickers fell off because they were so old. It looked as though no one had entered that room since the games were first put in there. The rooms need major updating. The carpet looked worn, in the room and hallways. The ceiling and walls were dusty from the ceiling fan. There was no vent/fan in the downstairs bathroom. The pull out couch was very uncomfortable to sit on because the cushions were sinking in the middle. You get 3 free drinks. They are one at a time and the breakfast room turns into a bar, that you can't bring anyone under 21 into. That was nice, since we had our 7&9 year olds with. The bartender definitely didn't want to be there and she was incredibly unfriendly, which makes me think all of those tips in her pitcher were put in there by her. Needless to say, I am very sad that this gem we thought we had found, turned out to be a complete dud. Oh well, I'll know this for next year and will start looking into other hotels. ANY OTHER hotel.", "title": "fantastic hotel", "user": "hainzer1", "date": "June 24, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 114707323}], "location": {"country": "United States"}, "stars": 2.5, "variance": {"poor": 8, "average": 6, "very good": 37, "terrible": 4, "excellent": 37}, "aka": "Comfort Suites Madison West Hotel", "slim_ranking": 0.467741935484, "description": "All Suite Madison Wisconsin Hotel is situated walking distance from shopping, dining and more on Madison's West Side. Free hot breakfast buffet daily, free cocktails to the hotel's lounge Mon. - Sat. from 5-7pm, free high speed internet including wireless and free airport shuttle based on availability. Amenities include an oversized pool, whirlpool and fitness center. Relax in a Two Story Suite and/or Whirlpool Suite."}