{"user_rating": 3.5, "review_count": 184, "name": "Comfort Inn Cape Cod", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed May 2007, traveled with family", "text": "I stayed at this hotel for 3 nights with my husband and 4 yr old son. My son loved the pool - the hot tub was closed for renovations till the end of the month but the pool was so warm it didn't matter. They had a a lifeguard on duty. Lots of renovation going on. Most rooms near me were being ripped apart. My room was not recently redone - basic and slightly shabby with tiny bathroom but totally doable especially because I used my Choice Points for all 3 nights. If you have more than a few people perhaps ask for room 202 with the adjoining room so you can open up to two big rooms. You might also ask if a renovated room is available when booking. I had a fridge and microwave which was nice. TV has nintendo you can rent by the hour. They have about 4 or 5 arcade games. Breakfast daily but no hot items - bagels, toast, muffins, etc. Hotel is on a very busy road. Had a hard time turning left towards town. Be extremely careful in the rotary - its very dangerous. Went on high speed ferry to Martha's Vineyard for the day. Highly recommend even though it was pricey - didn't feel the waves at all. Tons of tacky strip malls and even a mall on way to town. Very quaint and tranquil closer to the beach areas. Bring quarters for parking meters. We went on the harbor cruise - it was nice. Whale watch ships are farther away - none nearby. Cute priate mini golf place in S. Yarthmouth with an Christmas Tree shop and discount Cape Cod T-Shirt and Sweatshirt store before the golf place - great prices. Cape Cod potatoe chip factory (free samples) and cape cod beer are also right down the street from hotel. Ate at San Diego's one night - it was a fun place to eat. There is a KMart near the mall area which came in handy for cheap essentials I forgot to pack.", "title": "In the Middle of Everything", "helpfulness": 5, "user": "Southport-TRIP", "date": "May 14, 2007", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 2.0, "cleanliness": 3.0, "value": 4.0, "location": 2.0, "rooms": 3.0}, "id": 7615196, "likes": {"liked": "— Pool", "disliked": "— Heavy Traffic Area, Renovation Noise"}}, {"rating": 2.0, "stay_parameters": "Stayed May 2007, traveled with family", "text": "We stayed here for 3 nights in May. The Hotel is centrally locatd on RT. 132. 1 mile off of exit 6, route 6. Really close to everything in the Mid-Cape area. Location is the best thing about otel. The Rooms are old and outdated. Had the smell to them. We have a 3 year old and she loved the pool. I must admitt the pool area was really nice. They said it was re-done 1 year ago. So if your looking for a central location to explore the Cape, then the Comfort Inn is good. But if you looking for a hotel toay at and enjoy the hotel, then look elsewhere.", "title": "Average - Depending on your needs", "helpfulness": 4, "user": "kunman", "date": "May 14, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 2.0, "value": 3.0, "rooms": 2.0, "location": 4.0}, "id": 7605842, "likes": {"liked": "— Location", "disliked": "— rooms"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "We stayed at the Comfort Inn in Hyannis for three nights at the end of April. Since I got two of the three nights free for using Choice Hotel points, this may result in a slightly favorable spin to the review....", "title": "A good base to explore the Mid-Cape reason", "helpfulness": 3, "user": "TeddyJohns", "date": "April 30, 2007", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 7485564, "likes": {"liked": "— a good location, convenient to exploring the Cape", "disliked": "— The breakfast was nothing special"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "The only negatives I really have are that furniture/decor was a little dated (although we stayed with a dog, so we may have been given a \"pet friendly room\"). Some of the staff were quite friendly; others were not. And the breakfast was just okay--not really enough to make a meal of (we went to a diner two mornings out of three).", "title": "Clean but nothing special", "helpfulness": 2, "user": "bigsam27", "date": "April 16, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 7375639, "likes": {"liked": "— Low price", "disliked": "— Old, dated furniture"}}, {"rating": 3.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "The positives: It's on Route 132, so not only is it close to Hyannis village, it's also in a good spot to take any day trip around the Cape, since Route 6 begins just a mile or so from the hotel. The stretch of highway the Inn is on looks like any commerical strip in urban America, with strip malls, chain restaurants, and other hotels; however, it only takes a few minutes to get into the center of Hyannis, which is a classic \"Cape\" village, with plenty of shops, nice restaurants, and a pleasant harbor.", "title": "Don't expect anything fancy", "helpfulness": 3, "user": "thehippertripper", "date": "December 13, 2006", "detail_rating": {"cleanliness": 3.0, "front_desk": 2.0, "location": 2.0, "value": 3.0, "rooms": 2.0}, "id": 6437269, "likes": {"liked": "— convenient", "disliked": "— poor HVAC"}}, {"rating": 3.0, "title": "Suitable for a nights stopover", "text": "The comfort Inn is ok for one night. Clean and comfortable but in a really bad location. You have to fight through the traffic to get anywhere being located next to a dual carriage way. Staff should be given an award for being the most miserable in the USA!. The buffet breakfast was ok but the hygiene and cleanliness of the juice dispensers were a bit off putting. No restaurant means driving up and down the road to find somewhere. Wouldn't bother staying here again.", "helpfulness": 12, "user": "Ferg64", "date": "October 19, 2004", "id": 2758243}, {"rating": 2.0, "title": "Comfort Inn Hyannis: Okay for a one night stay", "text": "The location of this Comfort Inn is very good, right off a busy highway but surrounded by lush trees and green grass, and there was a pond on the property. My family and friend stayed here one night on the way to Nantucket/Boston for vacation, and we found it sub par. There was a lot wrong with this place. The lobby is truly disgusting, with 5 foot ceilings and no paint on the walls, with chairs scattered around the lobby (I think they were doing renovation when we came). The rooms aren't great either, but after a day of flying and driving they were fine - and our room had a view of the trees and pond. They have thin carpets and hard beds, but they do have good tv channels. The bathrooms were horrid, with peeling wallpaper, and gross yellow crud on the shower and hair where the soap was supposed to go. It wasn't clean. The pool was gross, and my friend and I didnt go in because it looked like it was a breeding spot for bacteria and urine. The \"free breakfast\" was toast, watery juice and soggy waffles, in a small and cramped banquet room off the horrific entrance. Overall, this place is fine to stay at for a short period of time, and the accomodations were welcoming after a long day of traveling; however, it is not a hotel i would recommend to anyone.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "August 19, 2004", "id": 2461822}, {"rating": 4.0, "title": "A great stay!", "text": "This was my third stay at this hotel, and have found it one of the best Comfort Inns I've stayed at. The staff are pleasant and helpful, and will always try and meet your requirements. I hope I\"m able to come back again some day. We had a great time, even though we had lousy weather when we were there. (That's when the pool came in handy. )", "helpfulness": 2, "user": "A TripAdvisor user", "date": "July 7, 2004", "id": 2281679}, {"rating": 5.0, "title": "GREAT DEAL...GREAT STAY!", "text": "Stayed an entire week at this very friendly property. Rooms are extremely neat and clean. The staff was incredibly nice to my family.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "September 17, 2003", "id": 1343929}, {"rating": 4.0, "title": "Friendly staff, convenient location", "text": "My kids knew have of the staff on a first name basis before leaving.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "February 10, 2003", "id": 855468}, {"rating": 4.0, "title": "Good value for the price", "text": "Our family was very pleased with this hotel. Our son loved the pool. The room was comfortable, if a bit small. Nice breakfast buffet in the morning. This is a pet friendly hotel and we could hear a dog barking, although it did not keep us up. There was also a heavy scent of air freshener in the hallway.", "helpfulness": 12, "user": "A TripAdvisor user", "date": "April 4, 2006", "id": 4896311}, {"rating": 4.0, "stay_parameters": "Stayed August 2005", "text": "Two weeks excellent holiday, staff friendly & helpful. Rooms clean and well fitted out.Breakfast ample, internet access & pool a great hit with the three kids. Great base to explore the Cape, would definately recommend", "title": "Great Stay", "helpfulness": 9, "user": "whimbrelboy", "date": "January 2, 2006", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 4316905}, {"rating": 4.0, "stay_parameters": "Stayed November 2005", "text": "In my opinion this hotel should rated 3.5*", "title": "Good-Value", "helpfulness": 8, "user": "Jay P", "date": "December 3, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 3.0, "service": 4.0}, "id": 4159352}, {"rating": 2.0, "title": "Stay not so good", "text": "Positive", "helpfulness": 7, "user": "A TripAdvisor user", "date": "December 1, 2005", "id": 4156113}, {"rating": 5.0, "stay_parameters": "Stayed September 2005", "text": "--Friendly staff", "title": "Another Great Stay", "helpfulness": 13, "user": "oceanbeachgirl", "date": "September 29, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 4.0}, "id": 3947761}, {"rating": 4.0, "stay_parameters": "Stayed January 2009, traveled on business", "text": "I was pleasantly surprised when I recently stayed at the Comfort Inn Hyannis. During the past two months I needed lodging on three separate occasions due to the recent snowstorms. The beds were extremely comfortable; the room was immaculately clean and free Wifi!", "title": "Comfortable bed", "user": "scott s", "date": "January 24, 2009", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 23869800, "likes": {"liked": "— The rooms were quiet and the bedding is new and comfortable."}}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled with friends", "text": "I would definitely stay here again.", "title": "We loved this place!", "user": "Pragmatist10001", "date": "August 29, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 19503252, "likes": {"liked": "— Breakfast, pool, price, comfort", "disliked": "— Bathrooms, no elevator"}}, {"rating": 3.0, "title": "Served it's purpose", "text": "This hotel is NOT the Waldort Astoria, but for $118 dollars a night during busy season - we found a GEM!", "user": "64shelk46", "date": "August 24, 2008", "id": 19314779}, {"rating": 2.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "The hotel is clean, fresh smelling, and the staff was very courteous and helpful with requests. I loved the indoor pool which was large and very clean. And the pool has a lifeguard which is unheard of in a hotel. The breakfast was very nice - waffles, french toast, cereal, bagels, hard boiled eggs, juice, and muffins. Although the hotel was dog friendly, we did not see or detect the presence of one during our stay ( and the hotel was fully booked).", "title": "Good location but tired hotel", "user": "jamesunt", "date": "August 19, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 4.0, "cleanliness": 2.0, "value": 2.0, "location": 4.0, "rooms": 1.0}, "id": 19120060, "likes": {"liked": "— price", "disliked": "— accomodations"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled with family", "text": "Hotel is located right in the middle of the cape which was close to", "title": "Clean Rooms Great Breakfast", "user": "ss1313", "date": "March 10, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0}, "id": 14185594, "likes": {"liked": "— Breakfast", "disliked": "— No Elevator"}}], "location": {"country": "United States"}, "stars": 2, "variance": {"poor": 25, "average": 30, "very good": 47, "terrible": 21, "excellent": 61}, "aka": "Comfort Inn Cape Cod Hotel", "slim_ranking": 0.636363636364, "description": "The Comfort Inn Cape Cod is located in Hyannis, the heart of the Cape. This ideal location offers families many options for planning a fun and memorable vacation. Enjoy Cape Cod’s world-class beaches, museums and shops or jump on the ferry to Martha’s Vineyard or Nantucket. Hotel features include use of indoor heated pool, whirlpool, sauna and fitness center. Free amenities include deluxe continental breakfast, WiFi and parking. Upon request, pet friendly rooms are available. This description is based on information provided by the hotel."}