{"user_rating": 4.0, "review_count": 83, "name": "Comfort Inn", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed May 2009, traveled with family", "text": "Booked one night as an emergency, not very clean. Carpet old and dirty, room had stains on walls and our sheets had stains. Service was poor when we checked in. Much older hotel, we were told when booking over the phone it was a Comfort & Suites, it was just a regular Comfort Inn. We almost left, but it was too late at night and we had to rest. Morning came and we left, would not recommend hotel.", "title": "Would not stay here again", "helpfulness": 1, "user": "kjshurbet", "date": "June 1, 2009", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "location": 2.0, "service": 2.0, "rooms": 2.0}, "id": 31321548}, {"rating": 3.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "This was an older Comfort Inn. We were comfortable in the room & the bed was comfortable - but it was older and very basic. The staff was nice. The Inn itself was definitely older and not very nice looking inside. We appreciated the free internet service in our room.", "title": "Okay Comfort Inn - Nice Staff - Basic", "user": "FloridaFunAdventurer", "date": "May 28, 2009", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 3.0}, "id": 30977855}, {"rating": 3.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "good place if you just want to crash after a long drive.. the room was comfortable and clean.. no complaints..the continental breakfast is a joke..", "title": "A decent place", "user": "svnaa", "date": "April 24, 2009", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 28711640}, {"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "My husband and I stayed at the Comfort Inn for 1 night on our way to Lake Powell. We had tried to make a reservation prior to our arrival at numerous other hotels in Farmington but had failed to find one that was pet friendly. The Comfort Inn was not only pet friendly (very reasonable $10.00 fee) but it was exceptionally", "title": "Nice, clean, pet friendy hotel", "user": "AustinKit", "date": "July 29, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 18393152, "likes": {"liked": "— Comfort of bed, cleanliness", "disliked": "— Nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "clean. Our bathroom was spotless. The bed was one of the most", "title": "Nice property", "user": "dangrad", "date": "July 28, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 4.0}, "id": 18355226, "likes": {"liked": "— breakfast selection", "disliked": "— Premium price due to major event in town"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "We stayed four nights at the Comfort Inn in Ingleside, about eight miles and a free ferry ride from Port Aransas, and we were very pleased. The hotel was nice, clean, and the management throws a two-hour cocktail party Sunday-Thursday with great margaritas! But the best part was the rate was about $100 less per night than what the properties at Port Aransas charged.", "title": "A good alternative when visiting Port Aransas", "user": "justiceron", "date": "October 9, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 3.0, "service": 4.0, "rooms": 4.0}, "id": 46370871}, {"rating": 5.0, "title": "Ingleside Tx Comfort Inn Stay A+++++++++++++", "text": "The Comfort Inn in Ingleside, Texas is highly recommended.", "user": "islandmagic", "date": "May 21, 2008", "id": 16275217}, {"rating": 5.0, "stay_parameters": "Stayed November 2007", "text": "The staff if very polite as well as professional. They went out of their way to make sure our stay was comfortable. We were fishing a tournament and my back went out and I did not think I was going to be able to fish the tournament and they allowed me to go in the Hot Tub after hours and thanks to them, I was able to fish the tournament. They also accommedated us with letting us park the boat in the circle drive. Thanks for making our stay A+++++++++++. Kiran is an A+++++++++++ employee.", "title": "Very Accomodating", "user": "showtime13", "date": "January 10, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 12483744}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled solo", "text": "My family and I came down to Ingleside for my fathers 50th birthday party. We had friends and Family come from all over Texas for the party. We had over 40 people from our party stay at Comfort Inn in Ingleside.", "title": "Great experience in Ingleside, TX", "helpfulness": 1, "user": "manes_d", "date": "January 9, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 12476633}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "For an overnight stay en route to Northern California, this was a good spot. Very pleasant staff, room smelled and looked clean, it was quiet, the window opened, the bed was comfy, close to ocean and Peet's for a morning walk before continuing our trip.", "title": "Pleasant, clean, bare bones", "user": "bcnsontca", "date": "November 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 146265234}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled with family", "text": "I was a bit concerned that the freeway noise would be a problem, but the room was very quiet. The staff is very pleasant and helpful. Everything was clean. I would prefer better lighting to read by, but the lighting is better than many hotels. And, I could read with out straining my eyes. It is easy to get to the town center and the freeway entrance is right there.", "title": "Kimmer", "user": "Kim R", "date": "November 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 145935174}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled on business", "text": "When I drove up to the Comfort Inn in Ventura I was a little dismayed at the location, right on 101. I parked, conveniently right in front, went inside to be greeted by Kenya, a personable and professional front desk person. After a few pleasantries I went to my room on the third floor and found it quiet, clean and comfortable. The coffee in the lobby the next morning was actually good! And there was real half and half available rather than the usual something or other Delight in fake flavors, bonus points from my perspective. Check out was as easy and pleasant as check in. Now the Denny's breakfast experience (you get a voucher) well don't get me started. I would stay again,", "title": "Pleasantly surprised", "user": "EZGoing50", "date": "November 15, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 145454368}, {"rating": 4.0, "stay_parameters": "Stayed October 2012", "text": "Stayed here as a reasonably priced alternative to the v.expensive hotels in Santa Barbara when travelling down the PCH. It was clean, comfortable, well appointed. Room had a useful fridge as std for those staying for a bit longer than we did. Room also had a useful extra sink just outside the bathroom. Hotel was easy to find, just off the highway in a commercialised area. Breakfast was provided but you needed to make a trip over the road to Denny's with a voucher before 9am to use it and being on holiday we didn't want to get up and out do early, so we made alternative arrangements. Free coffee in foyer and 24 hr reception service. In all really happy with the offering for the price we paid.", "title": "Well priced, located, clean and comfortable", "user": "Jodie K", "date": "November 11, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 145136661}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled solo", "text": "i played in a seven day bridge tournament near the comfort inn. on the 3rd day, i got food poisoning from a local fish restaurant and was sick for a few days. the staff mothered me into wellness. they brought me fresh ice water, cared for my malady and helped in all ways requested.", "title": "offering the best and friendliest service possible!!!", "user": "ret_revron", "date": "November 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 145046352}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled with friends", "text": "Worked as a place to stay for a weekend or a long stay. They have very little amenities, so it's nothing fancy, but it's clean and the plumbing worked. I would stay here again, it's a good location, right off the highway and close to food. And you can't hear the highway in the rooms. And instead of nasty hotel breakfast they give you nasty Denny's breakfast, which is of course way better because you get real eggs instead of powdered ones! My only complaint is a small parking lot. They have overflow parking at the in-n-out next door, but it's not as convenient. Get there before 10pm and you'll probably be fine for one of the good spots--I didn't arrive till almost midnight.", "title": "Nothing fancy, nothing roachy", "user": "Meghan L", "date": "November 5, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 144700975}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled with family", "text": "My trip was great! The only thing i would have to say I didn't like was my thank you email. I am not a Mr. and don't want to be adressed as one. Just becasue my name can be a boys name you assume that I am a male. Well I am not and you letter should read Ms. Other than that my trip was great. I enjoyed the Denny's breakfast, the hotel was not nosiey at all.", "title": "Great Trip", "user": "Lab794", "date": "November 5, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 144551896}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "Upon entering the lobby, we were greeted by Katherine with a smile, friendliness and willingness to help. Wesley, the evening staff at the desk was very nice, too. The building is smoke-free and had a fresh, clean smell. Very nice room. Bed was very comfortable. Location is a short 2-block walk to the beach and park. The breakfast voucher provided plenty of food at nearby Denny's, where service from Carol was quick and superb! She was one of the best waitresses we have had and we have been all over the US. The only drawback regarding breakfast is the three crosswalks from the hotel, which could be problematic in inclement weather. Driving would have been more difficult than walking, as the in/out of the hotel is not user-friendly, depending on the direction you need to go. US 101 S on-ramp is right there, which is also not that convenient, as you have to make an immediate left turn after the left turn out of the parking lot, which is at the light. We felt the overall stay was nice enough for our purposes, but quite over-priced given the walk to breakfast and no pool or jacuzzi. (We did have a room with a jetted tub, but that isn't quite the same.) To Doug M... parking fee at Marriott is $13.00 per night according to the sign at the entry of the lot.", "title": "Comfort Inn, Ventura, CA", "user": "laplayalife", "date": "October 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 2.0}, "id": 143804591}, {"rating": 3.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "The staff was excellent and very friendly. Because it lacks amenities it is way over priced. No breakfast. You have to drive or walk accross the street to Denny's (like fast food without the paper wrappers) with a voucher. The Marriott across the street is only $35 more per night and is ten times the hotel. The parking is terrible. I didnt do the math but it seems there is only one parking spot for each room and two of them have \"do not park\" signs which is where we had to park when we came back from our activities. I would not stay there again.", "title": "Comfort Inn Ventura", "user": "Doug M", "date": "October 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 142310447}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "The woman who was working at the desk the morning we left the hotel - I believe her name is Katherine - was the most pleasant, polite, and efficient clerk I have ever encountered. She handled every issue with total confidence and with a professional and affable demeanor. She certainly helped our day begin with a wonderful start.", "title": "staff", "user": "Mark K", "date": "October 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 142149133}, {"rating": 3.0, "stay_parameters": "Stayed August 2013, traveled on business", "text": "I recently stayed at the Comfort Inn in Leamington, Ontario while I was there on business for three nights. I knew that I would only be sleeping there with no down time in between sleeping and work and picked this hotel based on location from my work place. I called the hotel the day before my arrival and had no problem getting a reservation at a decent rate of $85.00 per night, though online the rate was listed at $100.00 per night.", "title": "Clean, no frills but affordable", "helpfulness": 1, "user": "lovlos", "date": "August 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 171726183}, {"rating": 1.0, "title": "Dated but clean", "text": "It's a two story, no elevator hotel with a patio walk out and sliding door. The air conditioning was good and the room was clean and non descript. The breakfast is enhanced continental with breakfast wraps, fresh bagels, cereals and fruit. The staff were very friendly, helpful and accommodating and did their utmost to make me feel welcome.", "user": "KarinS435", "date": "August 5, 2013", "id": 170958893}, {"rating": 3.0, "stay_parameters": "Stayed July 2013, traveled on business", "text": "The biggest highlights in my opinion are the location close to the water and the FREE WI-FI in your room. It was a strong connection and was certainly welcome since I was there on business. I go out of my way to book hotels with free wi-fi and it's a definite selling point!", "title": "No frills, just OK", "user": "comp-aliance", "date": "August 4, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 170704713}, {"rating": 5.0, "stay_parameters": "Stayed July 2013", "text": "If I was in the area again on business I wouldn't hesitate to stay here.", "title": "Excellent stay!!!", "user": "Richard L", "date": "July 21, 2013", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 168393218}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with friends", "text": "We stayed at the Comfort Inn for one night during the Civic Holiday weekend.", "title": "Friendly staff and close to Peele national park", "helpfulness": 2, "user": "Cathy E", "date": "May 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 161021826}, {"rating": 3.0, "stay_parameters": "Stayed October 2012, traveled on business", "text": "Looks nice from the outside and the lobby, but a bit less inside. The elevator was noisy, which is scary, and the hallways show wear & tear.", "title": "Somewhere between Poor & Average", "user": "Ron S", "date": "October 5, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 142070209}, {"rating": 5.0, "title": "\"Clean\" and \"Right next to Freeway\"", "text": "My room was OK, sorta... The bathroom was OK & the bed was comfortable. The mini fridge was actually cold with a good freezer section. The girls at the front desk were all very nice and quite helpful.", "user": "A TripAdvisor user", "date": "October 4, 2012", "id": 141988460}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "The Bad...", "title": "Everything you need for a reasonable price", "user": "Melissa S", "date": "October 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 141787622}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "The rooms have a euro style heater/air conditioner mounted on a inside wall. While it works to cool the room, it also put out a VERY foul mildew smell. When I complained, the manager", "title": "Fantastic", "user": "Mario B", "date": "September 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 141360053}, {"rating": 5.0, "stay_parameters": "Stayed September 2012", "text": "(I believe) stated there was nothing he could do about it. He did offer to move me to another room tho... Luckily this hotel has full sized windows that open ALL THE WAY so I just turned off the AC in favor of fresh outside air. The weather was nice enough (most of the time) but there were times when I would have liked to use the AC, and because of the smell could not. I was seriously surprised that Management didn't send maintenance to clean the AC filter and spray it down with something like Lysol. They could have at least put forth an effort in front of the customer, instead of just saying there's nothing we can do.", "title": "A truly wonderful experience", "helpfulness": 1, "user": "Aiodhan", "date": "September 26, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 141299822}, {"rating": 3.0, "stay_parameters": "Stayed May 2008, traveled on business", "text": "The plumbing noise in my room on the first floor was pushing the level of unacceptable. At least ear plugs helped me get a reasonable nights sleep. And loud is not an understatement.", "title": "Rooms on the fIrst floor may be loud", "user": "Late-Arrival", "date": "June 4, 2008", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 2.0, "rooms": 3.0, "location": 3.0}, "id": 16657138, "likes": {"liked": "— Location", "disliked": "— plumbing noise (like you would not believe)"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled with friends", "text": "The motel had a very nice outdoor pool which was - of course - unavailable.", "title": "nice clean place, friendly staff", "user": "Edgetheow", "date": "January 10, 2008", "detail_rating": {"cleanliness": 5.0, "front_desk": 5.0, "location": 3.0, "value": 4.0, "rooms": 5.0}, "id": 12510888, "likes": {"liked": "— clean rooms, new building.", "disliked": "— location was close to downtown, but not scenic by any means."}}, {"rating": 2.0, "stay_parameters": "Stayed October 2007, traveled with family", "text": "Motel staff were helpful, particularly in assisting me with some needed directions.", "title": "It was just ok", "helpfulness": 1, "user": "nanaMissouri", "date": "December 29, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 2.0, "cleanliness": 3.0, "value": 2.0, "location": 3.0, "rooms": 2.0}, "id": 12057317, "likes": {"liked": "— Location", "disliked": "— Sheets, stairs, breakfast room"}}, {"rating": 2.0, "stay_parameters": "Stayed March 2007, traveled on business", "text": "Parking is a bit tight. There appears to be enough parking spaces for the number of rooms. But only that many. This is one place I would not want to pull into late at night with a reservation and the expectation of nearby parking.", "title": "didnt get what I booked , hotel OK", "helpfulness": 1, "user": "stedmacl", "date": "March 5, 2007", "detail_rating": {"front_desk": 1.0, "business": 3.0, "service": 2.0, "cleanliness": 2.0, "value": 2.0, "location": 3.0, "rooms": 1.0}, "id": 6911954}, {"rating": 4.0, "stay_parameters": "Stayed September 2004", "text": "Good location for taking a stroll along the city river walk.", "title": "Great Overnight!", "user": "FlagstaffMax", "date": "September 6, 2005", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 3846167}, {"rating": 4.0, "title": "Improved tremendously from previous review.", "text": "I was in Farmington for 3 weeks, staying at this Comfort Inn during the week days. I was reluctant to book because of the previous review, but I am usually pleased with Choice properties, esp Midland, TX, not Carlsbad, NM. I decided to give it a shot. The front office is pleasant and responds promptly to any request. The room is clean and the breakfast, while limited, is adequate. I have heard bad comments about the Best Western and the Ramada here, so of those 3, I would suggest the Comfort. Note: it's also right across the street from a VERY nice hiking trail along the Animas River.", "helpfulness": 9, "user": "swimfast", "date": "September 29, 2004", "id": 2607840}, {"rating": 1.0, "title": "AVIOD, AVOID, AVOID!!!", "text": "Cleanliness is kept to a bare minimum. Overflowing toilets, cigarette burned bedspreads, and uncooperative middle eastern staff, with scant grasp of english, or civility. IMO, you DO NOT want to stay here. Should be condemned for health reasons.", "helpfulness": 13, "user": "A TripAdvisor user", "date": "May 23, 2003", "id": 1026464}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled on business", "text": "I have been travelling to Leamington for work for about 2 months. I had asked about this hotel and had gotten miixed feelings from others, however I decided to check it out wanna say that the hotel is clean and affordable, but most of all the staff there are very helpful and wonderfully pleasant. I found the staff to be very approacable and ready and willing to help if and when needed. For me as long as the room is clean, affordable and staff are freindly thats what counts. If I wanted luxury I'm sure I'd be paying much more for the room and possibly still would not have the friendly service.", "title": "Travel for work", "helpfulness": 2, "user": "deanneb98", "date": "April 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 157449499}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "P.S. The pillows are nice and fluffy...love that !!", "title": "Excellent staff", "helpfulness": 4, "user": "jrbarrie", "date": "March 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 154734065}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled on business", "text": "Hello: As the result of my sons sudden death I needed accommodation for several days. As a Choice member I booked on line and in my state of mind double booked the room and it was past 8 p.m. so i could not cancel one of them. The girl at the front desk was very helpful and cancelled one of them for me. She changed the rate to a bereavement rate and was very helpful with blocking rooms for my family.", "title": "Stay in Leamington", "helpfulness": 2, "user": "Luna1961", "date": "March 6, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 153856214}, {"rating": 3.0, "stay_parameters": "Stayed February 2013, traveled on business", "text": "This attention and caring was most appreciated, but what struck me was the next morning when an older couple both visually impaired came into the breakfast area. I overheard them say that they also lost a family member. The front desk staff was so kind to them, they made their breakfast for them and took it to them at the table. This attention and care occurred over the next several days that I was there.", "title": "average", "helpfulness": 1, "user": "ManofTastes", "date": "February 24, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 2.0, "rooms": 3.0, "location": 4.0}, "id": 152912405}, {"rating": 1.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "The Leamington hotel is rated 2 stars, it was clean and sufficient for our needs, if you could rate a hotel on staff alone it would be 5 star plus.", "title": "Very outdated, dirt bag hotel!", "user": "Tammy57", "date": "February 6, 2013", "detail_rating": {"service": 3.0, "cleanliness": 1.0, "value": 2.0, "sleep": 1.0, "rooms": 2.0, "location": 3.0}, "id": 151525982}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "My wife and I stay here every time we come down to visit family and friends and are very pleased with the service that is provided. the rooms are clean and the continental breakfast is free. Having stayed at at many comfort inn hotels in our travels this hotel is by far at the top of our list of places to stay. Yes the hotel is a bit outdated but it is nice to see that things are being updated slowly but surely. Also the staff was great but the phone could deffinitly be fixed as could barely hear individual on the other end while I was making reservations, but over all Excellent experience and hope there will be many more to come.", "title": "Great Hotel with Competative Rates", "helpfulness": 2, "user": "Ryan D", "date": "February 1, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 151183457}, {"rating": 3.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "They have an excellent place to walk your dogs if you travel with them. The hotel is very tired and in desperate need of an update and a good clearing of the cobwebs......the staff is excellent and very helpful.", "title": "Good for pets", "user": "Katherine D", "date": "January 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 2.0, "value": 4.0, "sleep": 4.0, "rooms": 2.0, "location": 4.0}, "id": 150390259}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "This Comfort Inn is hampered by descending from the former Journey's End chain that was cookie-cutter in style and virtually no space for the complimentary breakfast. The rooms are older but clean, the air conditioner/heating system are relatively noisy. The TV has been updated. Staff was friendly and the location was good for our purposes though it's on a quite busy street. Others have raved about the breakfast; I found it fairly basic though the quality was fine. I'd rate this place between average and very good, but am giving it the benefit of the doubt.", "title": "It's good but dated", "user": "Dusty_Archivist", "date": "November 12, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 145227411}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "First the bad news, because there's always bad news. Our room was on the second floor with no elevator so it was a bit of a hassle climbing the stairs with luggage. And the view from the room was unfortunate - over the fence separating the property was a house with an abandoned kitchen stove in the yard. And why do they leave you a bottle of water along with the free coffee and tea fixing with a warning in VERY small print that you'll be charged for the water if you drink it? Many hotels now provide complimentary bottles of water so it's easy to be fooled. However, the room was comfortable, the staff exceptionally friendly and pleasant and the complimentary breakfast was the best we've ever had in the Choice Hotels chain: omelet wraps, waffles, hard-boiled eggs, juices, toast, muffins - the list went on and on. And the price was right for the room. To top it off, the Lakeside Deli and Cafe across the street was a perfect spot for lunch. We would definitely stay there again.", "title": "The view leaves something to be desired, but...", "user": "Mongo_7", "date": "October 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 143375677}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "The name fits perfectly \"Comfort Inn.\" We've stayed here for the past 18 years every time we are in Leamington. The rooms are always clean and comfortable as is the lobby and breakfast area. The Manager and Staff are courteous and accommodate our of all wants and needs. It's also a joy to see the same staff year after year and for them to remember our names. It means the Comfort Inn chain is not only treating customers satisfactorily, but also their staff. Keep us the great job.", "title": "Leamington, Ontario Comfort Inn", "helpfulness": 2, "user": "S M", "date": "October 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 142513889}, {"rating": 4.0, "title": "Clean, comfortable, convenient", "text": "We stopped over here while making our way up the PCH. The two room suite was perfect for us. The location was easily accessible and there are plenty of options nearby for dinner. We didn't do the breakfast at Denny's as there was a local place we chose to visit. The ony exception to an otherwise rest stay was the wifi. Upon arrival we were unable to connect. The front desk told me it was my device which I knew was not the case. They connected me to tech support where I had to spend 15-20 min troubleshooting the issue. The call was disconnected and we decided to leave for dinner and advised the front desk they should take up resolving the issue. After we returned the router had been reset and all was fine as I suspected. Hopefully the front desk staff will learn not to accuse the customer and will make more of an effort to help in the future.", "user": "EP05313", "date": "December 22, 2012", "id": 147880683}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled on business", "text": "After the confusing driving experience to get to the hotel; was in the wrong lane and ended back on the freeway. On the second try were greeted by the neatest front desk lady. Easy check in...follow-up call to check that all was well and if needed anything. The room was normal, but with tons of towels, room items, clean, elevator, coffee in the lobby. Going to Dennys for breakfast (Free or $5 credit per person) was good, we were tired of eating the so-called continental breakfast offered at most motel/hotels...short walk or high technical drive from the hotel...a city block away. A short quiet walk to the beach and San Buenaventura State Park. Good value for the price and location...under a $100.00.", "title": "Great place to stay in Ventura", "user": "Carl B", "date": "December 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 147316564}, {"rating": 5.0, "stay_parameters": "Stayed December 2012", "text": "My judges and I came for one evening. Wesley, at the front desk, was very friendly. I upgraded to the jacuzzi room for $ 20. I marked down the room because the fireplace fire didn't blaze very much and the jacuzzi took FOREVER to full half way. Also, the jets were possessed, varying speeds and pressure on its own. Otherwise, nice beauty. I'm not sure why people complained about the breakfast..it's more than you would get at most continental breakfasts!", "title": "Nice visit", "user": "Tgibs09", "date": "December 10, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 147139859}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "the hotel was clean and quiet. We request handicapped rooms the shower was ok.. The bed was not very comfortable. The fact that we had to eat at Dennys and not the hot breakfast at the hotel was disappointing considering that fact that you could only choose up to 4 items at Dennys. So the Breakfast meal was cheap on the hotel part. The lady that checked us in was very nice.", "title": "oregon trip", "user": "n e", "date": "December 1, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 146580237}, {"rating": 5.0, "stay_parameters": "Stayed November 2012", "text": "Upon arrival I and my wife were greeted by one of, if not the friendliest front desk attendant that we have ever come across. The hotel itself is on the smaller scale but we could see that they use this to their advantage. The room was clean, comfortable, and quiet! The breakfast at Denny's was a nice alternative to the usual stale hotel breakfast. Every staff member we came across had a smile on their face and greeted us and the price was very reasonable for the area. Thank you all and we will definitely be back next time we're in town.", "title": "Couldn't be better!", "user": "leisuretraveler81", "date": "November 28, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 146396422}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "Very comfortable stay. Bedding was clean and little pillows so soft. My husband and I had a very good rest. It was quite full but still did not hear much noise. Might be better to have a better locking system on patio door as could only lock it from the inside.", "title": "comfort inn", "user": "heather b", "date": "October 8, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 3.0}, "id": 142332642}, {"rating": 3.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "My husband and I stayed at this hotel for 3 nights while doing some bird watching in the area. The check in went fine and we were given a room on the south side on the bottom floor which is only accessible thru the lobby and with no automatic doors, it was a bit of a struggle with luggage. The room was clean and well appointed with fridge and microwave but was quite outdated. Our main concern was that the bed was lke sleeping on a slab of cement which means you have to flip flop all night long to relieve the pains on the pressure points. The breakfast was very basic ( cereal, muffins, bagels, hard boiled eggs) and although we were used to more variety at other Comfort Inns, it was fine for us. With the limited number of places to stay in Leamington, I would have to say that this hotel is a good bet as it has a good location and the rooms are clean.", "title": "Not bad but needs updating", "user": "ontheroadtwo", "date": "September 25, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 4.0}, "id": 141232882}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with friends", "text": "The Comfort Inn Leamington is a well located, comfortable and friendly place to stay. The staff were more than helpful with directing us to local points of interest and good restaurants. The rooms were clean and spacious. I would definitely stay at this hotel again and also would recommend it to anyone passing through the area. The proximity to Pelee Island, Point Pelee and the Southwestern Ontario wine route top off the list of reasons to stay at this top notch hotel.", "title": "A Great Place to Stay", "helpfulness": 2, "user": "Pat M", "date": "September 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 141143698}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "This is our third time staying at this motel and we love it . The location is great ... close to shopping and the Pelee Island Ferry . It is a well run establishment ; The rooms are lovely and clean and the continental breakfast is really excellent ; great coffee too . We love the area and will definitely be staying at this motel again in the future !!!", "title": "Really nice place to stay !", "user": "poolq_12", "date": "September 22, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 140928002}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled with friends", "text": "The Leamington Comfort Inn met all our expectations for a motel in it's price range. Great staff, comfortable beds, clean rooms, lots of hot water, easy access to wifi. It's within a short walking distance to the lake front and there's several restaurants within walking distance, which is something we really appreciate after a long day riding a motorcycle.", "title": "Worth the trip to Leamington", "user": "Rinkrat_44", "date": "September 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 140717285}, {"rating": 4.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "Took an unexpected roadtrip from Las Vegas to Ouray CO and stayed at the Comfort Inn. BEST DEAL in town forsure. We called over the phone and made reservations and they lady at the front desk was so nice, she gave me a discounted rate. When we arrived they had fresh baked choc.chip cookies for the customers that were so good. Our room had a beautiful view of the mountains and we were right next to the hot tub. Room was quite and cozy. Breakfast was fresh and FREE! Ouray is an awesome get away from the city life. We ate at Billy Goat Gruff's Biergarten and played pool all night. Their hotdogs are the best around.", "title": "Loved this little hotel", "helpfulness": 2, "user": "teena192", "date": "December 12, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "business": 5.0, "cleanliness": 5.0, "rooms": 5.0, "location": 5.0}, "id": 11513682, "likes": {"liked": "— Staff", "disliked": "— Decor"}}, {"rating": 4.0, "title": "Clean Motel", "text": "Plan on staying at the hotel again this winter, will give an update.", "helpfulness": 2, "user": "mwdoug", "date": "August 24, 2007", "id": 8494111}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled with family", "text": "My son and I stayed at this hotel for 2 nights while day-hiking in the area. The room was a standard motel type room, with newer bedding. The hotel and the room were very clean and tidy. The breakfast was excellent, with many more choices than you'd normally get in a hotel of this type. They offered eggs, sausage, waffles, cereals, breads, bagels, muffins, etc. The breakfast room was very clean and attended. The owners are on-site and involved with the daily operation of the hotel. The price is right for this area and season in a Colorado mountain town. We will definitely stay here again, as we frequently hike in the area.", "title": "Really Well-Run Motel", "helpfulness": 4, "user": "LanSluder", "date": "June 30, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 8030946, "likes": {"liked": "— Good management; quality beds", "disliked": "— Stairs"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled with family", "text": "My family and I stayed two nights at the Comfort Inn in Ouray in late June 2007. I was really impressed by how well run this small motel is.", "title": "Clean, quiet stay", "helpfulness": 2, "user": "lsm10", "date": "June 26, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 8001130, "likes": {"liked": "— Very clean, within walking distance to everything", "disliked": "— nothing"}}, {"rating": 5.0, "title": "Great!", "text": "The on-site owners/managers do a super job from start to finish.", "user": "Sherrillhooker", "date": "November 12, 2006", "id": 6110524}, {"rating": 4.0, "stay_parameters": "Stayed May 2009, traveled with family", "text": "Our one night stay here was great. We had reserved 2 adjoining rooms, and received excellent service. The only drawback is no elevator---all entrances are indoors, but it's a bit of a lug to drag your stuff up the stairs to the second floor. The jaquzzi was broken while we were there and that was a bummer, but hey----things happen! We were pleasantly surprised not only by the price, but after reading some of the previous previews. It was a great overnight stay on the last leg of a road trip, and yes, we would return!", "title": "A pleasant surprise!", "user": "bessiedear", "date": "May 31, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 31187160}, {"rating": 2.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "I had checked on line and saw that there were different hotels in the area for half the price but I was concerned that those other hotels were probably half the convenience as well. I couldn’t have been more wrong. The room at Comfort Inn was $159 with taxes, which was double what the other hotels were. There was no refrigerator, microwave or frills. Worse than that, we were there for Labor Day weekend and it turned out to be rainy so we were stuck at the hotel with nothing to do all day. To make matters worse, the power was out at the hotel for nearly 4 hours stretched out over a 7-hour period. The storm was minor so it was unclear why the power was out in the first place. The hotel had no generator so basically we were there in August with no air conditioning, no TV, no blow dryer, no amenities whatsoever except for the pool which I did use. He zinger was that we were paying twice as much money for a hotel that had no electricity for a good part of the day. When I spoke to the staff, they stated, “it’s not our fault” and gave us no break on the bill. We would have left on Sunday night but they would not let us go. We were stuck paying full amount. I explained that it may not be “their fault” but it surely wasn’t their customer’s fault and as a business, it was their responsibility to take care of their customers. They did not even remotely understand this logic and looked at me as though I was crazy. I will NEVER give them my business again and will be sure to tell as many people as I know.", "title": "Disappointment", "helpfulness": 1, "user": "Tucson125", "date": "September 9, 2008", "detail_rating": {"front_desk": 2.0, "business": 2.0, "service": 2.0, "cleanliness": 3.0, "value": 2.0, "location": 3.0, "rooms": 2.0}, "id": 19940028}, {"rating": 3.0, "stay_parameters": "Stayed May 2008, traveled with family", "text": "We booked this hotel ($127 total for 4 adults) because it was the only one in Snowflake that seemed acceptable besides the bed and breakfast place (which is really nice). Well, after we got there we learned that my cousin had booked a different hotel, the Rodeway Inn Silver Creek for the same night for only $65!", "title": "Go to Rodeway Inn Silver Creek Instead", "user": "tangeloe", "date": "May 21, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "location": 3.0, "rooms": 3.0}, "id": 16265469, "likes": {"liked": "— The beds were comfortable, and they had waffles for breakfast!", "disliked": "— The price was pretty steep."}}, {"rating": 4.0, "stay_parameters": "Stayed July 2005", "text": "I figured that was fine, since his place was probably a dump, but when we compared rooms the Rodeway Inn Silver Creek had bigger rooms, an extra vanity area, fridge, microwave, and the Hotel is part of the exact same chain of hotels as the Comfort Inn! They even had the same decorations! The comforters were better at the Comfort Inn, but that was about it.", "title": "great place", "helpfulness": 1, "user": "AZlovers2", "date": "September 22, 2005", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 5.0, "service": 4.0}, "id": 3931731}, {"rating": 4.0, "stay_parameters": "Stayed April 2008, traveled solo", "text": "This hotel has not been reviewed for a long while; so I thought it was worth it to post a review after staying one night. I was in this area to attend a friends family affair and just wanted a close (not to have to fight RT3 or 128 traffic) location for an evening and early morning committment in Rockland center.", "title": "Decent Comfort Inn", "helpfulness": 1, "user": "kasey363", "date": "April 9, 2008", "detail_rating": {"front_desk": 3.0, "business": 4.0, "cleanliness": 5.0, "value": 3.0, "rooms": 3.0, "location": 3.0}, "id": 14920404, "likes": {"liked": "— Cleanliness/updated rooms/Free wireless", "disliked": "— Nothing to note"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "As of this review the hotel is going through some cosmetic renovations on the interior, on the first floor the paint smell was pretty strong, but I believed they were placing guests (this was during the week) on the 2nd and 3rd floors to eliminate getting affixiated from the smell.", "title": "Wonderful people", "helpfulness": 1, "user": "boattop", "date": "October 8, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 5927901, "likes": {"liked": "— The people", "disliked": "— The television reception was hideous"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2005", "text": "The hotel staff was accomodating and polite. The breakfast was typical Comfort Inn make your own waffles, cereal, and bagels/muffins to toast etc; with juice and coffee. Adequate for eats if you have no time or just to have something in your stomach as you head out early....no other hot items or yogurt and fruit as others have in this type of basic \"included\" breakfast.", "title": "Solid, Value-priced hotel", "helpfulness": 3, "user": "dux86", "date": "February 4, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 4412405}, {"rating": 4.0, "stay_parameters": "Stayed October 2013, traveled with friends", "text": "I was on a Akron AAA bus tour to Washington D.C. and we were booked in Oxon Hill. I, of course, checked Tripadvisor and found a number of negative reviews so I was a bit concerned. There was no need as the room was very clean and attractive. I usually take pictures but forgot this time. The beds were very comfortable and I liked the split toilet/shower and sink arrangement. Even though our room was right next to the third floor elevator and across from the ice machine it was very quiet. Noisy guests are the problem usually NOT the hotel. I think it unfair to review the other guests as I saw in other comments. Breakfast was not the greatest but I never expect great for free. The breakfast coffee was fine however that little depot in the room made terrible stuff.", "title": "Just Fine", "user": "CSturgeo", "date": "October 7, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 180079521}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled on business", "text": "The hotel staff was nice and the manager even allowed our group to use a wheelchair for the day for a guest who was having problems . Oh, and I don't want to forget. The fridge was enormous by hotel standards and we also had a microwave.", "title": "Pleasantly surprised!", "user": "J L", "date": "October 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 179983100}, {"rating": 1.0, "stay_parameters": "Stayed September 2013", "text": "My friends and I decided to stay here during a recent convention at the Gaylord. After we booked our room, I happened to read some disturbing reviews about the cleanliness and safety of this hotel. I was very concerned and almost cancelled my reservation. My friends urged me to keep it, and now I am very glad that I listened to them. Upon entering the hotel, I was surprised to see a modern lobby. The staff was nice and helpful. The room was clean. The shuttle was reliable, but the front desk was kind enough to call me a cab when the shuttle was not running. The free breakfast every morning was good too (coffee, juice, bagels, cereal, eggs and waffles were offered). The wifi was also free, which was appreciated. The area around the hotel seemed fine and I was never concerned about safety. Overall, I would stay here again and recommend this to friends.", "title": "Natu is an awful hotel manager", "user": "brickwall316", "date": "September 28, 2013", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "location": 2.0, "service": 1.0, "rooms": 2.0}, "id": 179002401}, {"rating": 1.0, "stay_parameters": "Stayed March 2013", "text": "I highly recommend finding another hotel! This place was awful. My friend and I stayed here for the Oktoberfest at the national harbor. We liked the price and liked the sound of the shuttle service. I was told at check-in that one of the shuttle times was at 5:30 and we needed to be at the harbor at 6:00 so it was perfect. I called the front desk around 5:15 and asked where I needed to be to catch the shuttle. The lady told me to just come to the front desk. So a few minutes later we left & arrived at the front desk at about 5:25. I asked the lady where the shuttle was and she said it just left. Well I exchanged some words with trying to figure out why it left 5 minutes early, and than walked outside. I eventually walked back in for some more words but before I said anything she told me that a gentleman named Willy would take us once the shuttle for back. When the shuttle arrived we tried to board but was denied by the driver who also happened to be the hotel manger, Natu. We told Natu that his employee Willy agreed to take us but Natu didn't care and proceeded to yell at us in front of the hotel. He told us we were late and had to wait for the next shuttle in an hour. My friend looked at Natus watch and told him it was six minutes fast. Natu still didn't care and kept yelling at us. It was such a terrible experience. He eventually gave up and let Willy take us. Willy was a super friendly guy and it was very much our pleasure to meet and talk to someone like him. Willy was the highlight of our stay and I hope he can seek employment else where because he doesn't deserve working for someone like Natu. Natu should be removed from his position. Besides Willy, this place was awful and no one should have this kind of experience anywhere, especially when your a paying customer. Find another hotel! Choice hotels needs to terminate Natu!", "title": "Ants in and around my air conditioner", "helpfulness": 1, "user": "Misstravellady4u", "date": "July 10, 2013", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "location": 1.0, "service": 1.0, "rooms": 1.0}, "id": 167114827}, {"rating": 1.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "I stayed here a few months back for a convention at Gaylord and I was a mistake..this property is managed horrible they need to have a proactive measure to spray for bugs and ants..this place is dirty..of you have a hotel in a bad area Atleast make the hotel nice by not allowing hookers and drug users to stay there. The top floor of the hotel is used for this purpose comfort should be ashamed and owners should be ashamed for being too greedy for trying to fill up there rooms with shady people just for money and running all the productive citizens out. I will tell very one never to stay here just because I want to. They should charge more for a room to prevent disgraceful people from staying here instead of trying to sell out all the time..that's poor management and ownership..I'm in the hotel business as well and would charge more money so nasty hookers couldn't afford to stay", "title": "One night business trip to area", "user": "BawstinHokie", "date": "May 29, 2013", "detail_rating": {"service": 3.0, "cleanliness": 1.0, "value": 3.0, "sleep": 3.0, "rooms": 1.0, "location": 2.0}, "id": 162372667}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "Clean, spacious rooms. Very friendly staff. Good high-speed internet connection. Rates are very reasonable. Beautiful view from porch.", "title": "Excellent place to stay", "helpfulness": 1, "user": "wsucr1", "date": "August 17, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 5619940, "likes": {"liked": "— Very friendly staff/owner", "disliked": "— Parking space is somewhat limited"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2003", "text": "We were delighted with our overnight stay at the Ouray Comfort Inn. The owners were very friendly and personable. I hardly ever get a room with a \"nice\" view. Lots of times I get the roofs' steam vents from the level below so I always notice a view and have a good laugh whether it's lovely or not. Here we were able to sit on the balcony and enjoy the view of the lovely Telluride Rockies.", "title": "A room with a view!", "helpfulness": 4, "user": "807wheaton", "date": "April 10, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 4956044}, {"rating": 4.0, "stay_parameters": "Stayed January 2006", "text": "The breakfast was very tasty - especially the Belgium waffles. Lots of good food the Sunday morning we were there.", "title": "\"Comfort\" is the Operative Word!", "helpfulness": 5, "user": "JetDealer", "date": "February 5, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 4416252}, {"rating": 3.0, "stay_parameters": "Stayed September 2005", "text": "We had such a good time at Ouray. The scenery is just spectacular. The Comfort Inn is right off the main street and is convenient for the pool and downtown restaurants. We paid $55.61 for our stay. I look forward to the time when I can return and enjoy the pool and scenery again.", "title": "Too much competition for breakfast!", "helpfulness": 4, "user": "akhmc", "date": "October 27, 2005", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "rooms": 3.0, "service": 3.0}, "id": 4065801}, {"rating": 3.0, "stay_parameters": "Stayed June 2005", "text": "I wandered into the town of Ouray during a local ice-climbing exhibition/event (really, you'd have to see it to believe it) without a reservation anywhere in town (though admittedly during an otherwise \"quiet\" time of the year.) I was pondering a real-estate purchase in nearby Ridgeway, and thought Ouray might offer a good cross-section of the small-town \"personality\" I might ultimately be buying into. Frankly, I couldn't have been more pleased (and ended-up closing the deal partly because of my experience at the Comfort Inn.)", "title": "Beautiful Ouray", "helpfulness": 2, "user": "vacationite", "date": "July 14, 2005", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "service": 3.0}, "id": 3666551}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "We spent one night passing by $99, very clean room. The hotel is very clean. Very friendly staff. Close to HEB, not too far from Aransas Pass and the ferry to Port Aransas. Will stay here again. Breakfast is basic, waffles, eggs, cereals.", "title": "Very clean and quiet", "helpfulness": 3, "user": "kjshurbet", "date": "April 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 128088204}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled on business", "text": "Nice hotel with everything you need. Clean and comfortable. Breakfast is excellent as is evening reception which is 7PM-9PM and includes cocktails as well as beer and wine. No problems with this place whatsoever - highly recommended.", "title": "Small, friendly hotel", "helpfulness": 3, "user": "1NicePerson", "date": "November 1, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 120046988}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "Excellent choice. We had stayed here in 2008 and it hasn't changed. It is clean, comfortable and everything you need for the night. The desk clerks are wonderful in checking you in and checking you out. We had such a quiet night that we almost overslept. A little difficult getting into the motel when traveling west, but once you find out you have to double back, its no problem.", "title": "Great Place", "helpfulness": 1, "user": "Podunct", "date": "May 3, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 106729383}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled on business", "text": "I traveled to Ingleside for business in March and stayed at this hotel. I travel intermittently for work and have stayed at other Comfort Inns before however this one was exceptional. The staff was extremely friendly and went out of their way to make sure i was comfortable and happy. The rooms had a modern decor, clean and have free WiFi which made my stay very accommodating, especially for work. As a business owner this hotel has the best bang for your buck not to mention the free hot breakfast every morning. I will be back in Ingleside next month for business and I will definately be staying here again.", "title": "Excellent, Accomodating and Awesome service", "helpfulness": 1, "user": "samg550", "date": "March 24, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 101328302}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled on business", "text": "I recently stayed at the Comfort Inn in Inglside, Tx, and was very happy with the service i received and the hotel itself. It was very clean, breakfast every morning was good, and the pool was very nice. All in all great surroundings and I will definitely stay again!", "title": "Very comfortable and clean...", "user": "princes2593", "date": "October 10, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 46460928}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled with family", "text": "The hotel staff was great! Pat was so sweet and helpful upon check-in. She helped on the way there via phone directions and made sure we were well taken care of upon check-in. The rooms were very clean, spacious and modern for a comfort inn. The bathroom was also very clean and modern. The lobby has free internet access and printing for guests which came in very handy for printing driving directions for another leg of our trip. We didn't try the breakfast because we left before the 6am open time. Overall, a very good stay and a value!", "title": "Clean-New-Bargain Priced and Excellent Staff!!!", "user": "bdgfamily", "date": "May 1, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 29162977}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled with family", "text": "We were just taking the long ay back to NC from NYC. I quickly looked up a room on my laptop. The hotel was what you would expect from a comfort inn. The staff was very nice, the hotel clean, nice pool for the kids.", "title": "Nice rooms, Good Value.", "user": "waxrash", "date": "April 12, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 27885068}, {"rating": 5.0, "stay_parameters": "Stayed December 2008, traveled with family", "text": "This Comfort Inn is one of the nicest budget chain hotels we've stayed in. It looks fairly new, and everything is clean, the rooms are very nice - even the art is better than expected. The bathrooms are very nice - even the pillows and bedding were top quality.", "title": "great place, great price", "user": "gayguydc", "date": "December 13, 2008", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 22702243, "likes": {"liked": "— cleanliness and the quality of all the materials, from the granite counters to the bedding"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "They also provide breakfast, which includes more than your standard fare of pastries and cereal - also included french toast, hard boiled eggs and a make-your-own waffle iron, and coffee available 24 hours.", "title": "Good and new", "helpfulness": 3, "user": "thisaintme", "date": "September 6, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 4.0, "rooms": 5.0}, "id": 19828644, "likes": {"liked": "— Pool and gym", "disliked": "— the coffee"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "We were in toms river on a family matter and needed a place to stay. The hotel is brand new and just opened earlier in the month. The staff was super friendly and just needed to settle in with the operation of a new place.The first room given to us was under repairs from a ice machine that flooded out the room, we were quickly placed in another room .Breakfast was ready right on time every morning and the coffee was a little weak.It's nice to stay somewhere that is brand new if need be we will go back.....", "title": "Love rating you.", "helpfulness": 3, "user": "Lovetorateyou", "date": "July 21, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 18117873, "likes": {"liked": "— The rooms"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2005, traveled on business", "text": "I stayed at this hotel for two nights, and found it to be very clean and comfortable. The belgian waffles that other reviewers mentioned were tasty. I chose this hotel over others because it:", "title": "Comfort in beautiful surroundings", "helpfulness": 6, "user": "river.trout", "date": "May 17, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 3478843}, {"rating": 1.0, "title": "Undisclosed Fee & Poor Communication Skills", "text": "1. allowed pets ($10 charge per pet)", "helpfulness": 9, "user": "A TripAdvisor user", "date": "October 12, 2004", "id": 2699358}, {"rating": 5.0, "title": "Wonderful place to stay!", "text": "2. had wireless internet access, and allowed me to work while my wife was at a conference.", "helpfulness": 8, "user": "javens", "date": "September 1, 2004", "id": 2506412}], "location": {"country": "United States", "city": "Farmington"}, "stars": 2, "variance": {"poor": 6, "average": 13, "very good": 31, "terrible": 4, "excellent": 29}, "aka": "Comfort Inn Farmington", "slim_ranking": 0.173913043478}