{"user_rating": 3.5, "review_count": 1447, "name": "Complejo Calas de Mallorca Resort", "reviews": [{"rating": 2.0, "title": "WOULDNT STAY HERE AGAIN!", "text": "Especially NEVER AGAIN in July or August with NO AIR CON in teh bedrooms!! Me & my partner went here. To say the NICE things about the hotel are the sea views it offers, the food is alright, the service and the facilities (for children) and pools are nice. The beach is within walking distance and AMAZING. (Cala Domingos, cala antenas is known for jellyfish). We were happy when we arrived as everything seemed nice, but when we arrived to our room, it is in EXTREME NEED of renovation! The door was falling off the hinges, and it was a SAUNA when we walked into the room. I knew it had no air con, but figured (as the reviews said) the ceiling fan would help, well, it did NOT help and it made noises when you had it on, I couldnt sleep well and it looked like it would fall from the ceiling! As well, a hotel near by had LOUD and corny entertainment on every night outside until quite late, and it was impossible to sleep because of the loud noise. We ended up changing hotels. If they renovated this hotel and put air conditioning in the rooms and a TV, got rid of the outdoor entertainment from the other hotel, then YES we would go back, but ONLY then. This hotel is more suited to families with children, not young couples.", "helpfulness": 2, "user": "Chicita", "date": "July 31, 2006", "id": 5533660}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "Visited the Hotel on July 4th and stayed for a week with my boyfriend. We both were very anxious about going away as it was our first time without parents. However the deal we got on a few days earlier for a really cheap price (with the excellent tour operator thomas cook) was worth booking!!", "title": "Fantastic Holiday!!", "helpfulness": 14, "user": "shaven_legs", "date": "July 25, 2006", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 3.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5510278, "likes": {"liked": "— Location", "disliked": "— Resturant Staff"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2006, traveled with friends", "text": "Hotel is about a 40minute ride away from airport. The hotel is right on the coast of the resort so that both buildings are over looking the sea from any room. Although the hotel isnt right in the centre of the ton it is only about a 5 minute walk past a few smaller shops and bars until arriving in the resort. My boyfriend and I preferred this as it felt more like we were actually 'going out'.", "title": "great location and great hotel (if a bit dated)", "helpfulness": 7, "user": "Isabella.V", "date": "July 24, 2006", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 5.0, "rooms": 3.0}, "id": 5502239, "likes": {"liked": "— The views were breathtaking", "disliked": "— no air-con"}}, {"rating": 2.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "My husband and I stayed here from the 5th July for 4 nights. We were very disappointed in the hotel and the location. The hotel looked very tired and in desperate need of renovation. The reception staff were very friendly and check-in was easy. We didn't have transport so had to get a taxi each way from the airport which cost over £100 in total. Bearing in mind that we had paid £120 for 4 nights half board this was very annoying! The breakfast was fine but I question whether some of the cold meats were brought out again in the evening, however for families I can imagine it would be great.", "title": "Great views but needs air conditioning and renovation", "user": "iloveholidaylots", "date": "September 16, 2006", "detail_rating": {"cleanliness": 3.0, "front_desk": 4.0, "location": 5.0, "value": 2.0, "rooms": 1.0}, "id": 5806756, "likes": {"liked": "— The view from the room", "disliked": "— No air conditioning"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "On the plus side every room had a sea view and we had a small balcony which was a bonus. There were plenty of loungers by the pool and the pool was cleaned a couple of times a day.", "title": "Nice break", "helpfulness": 4, "user": "sandhills284", "date": "September 13, 2006", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 5795348, "likes": {"liked": "— the views", "disliked": "— a bit dated"}}, {"rating": 3.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "We stayed at the Chihuahuas for 2 weeks, was a bit wary after reading some of the reviews, the hotel was dated as others have said and needs revamping, however the place was kept really clean by the hard working members of staff, whom of all were very friendly and helpfull, The kid club and activities were brilliant, and the place is ideal for families, there were a couple of people I heard moaning about the children, I suggest that they read the description in the brochure before they book a holiday again. The food was really good, however on the second week a little repetative. The pools were really good but be careful on the shallow end of the large pool as the steps are loose, they were checked but classed as ok? The views were spectacular, every room has a great sea view. The resort is quiet, but has a small shopping area close by, which had everything you need from restaurants, bars to present shopping. The beach which was about 10mins walk away was excellent.", "title": "Jolly Hols", "helpfulness": 4, "user": "Stephen-U", "date": "August 28, 2006", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 5715443, "likes": {"liked": "— Cleanliness and sea views", "disliked": "— Hotel decor"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "Stayed for a week in the Sol Chihuahuas, found hotel decor a bit dated, but the place was very clean. Food ok, good for families. Nice quiet resort. Would go again.", "title": "lovely place to stay", "helpfulness": 5, "user": "Crystal47", "date": "August 21, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 5652042}, {"rating": 4.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "We stayed at the hotel Mastines for 1 week from the 1st August", "title": "Great Holiday", "helpfulness": 8, "user": "Oscargold", "date": "August 1, 2006", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 2.0, "location": 5.0}, "id": 5535732, "likes": {"liked": "— The view", "disliked": "— No air conditioning"}}], "location": {"country": "Spain", "continent": "Europe"}, "stars": 3, "variance": {"poor": 149, "average": 336, "very good": 550, "terrible": 123, "excellent": 289}, "aka": "Sol Calas De Mallorca Hotel Manacor", "slim_ranking": 0.5, "detail_rating": {"service": 3.5, "cleanliness": 4.0, "value": 3.5, "sleep": 3.5, "rooms": 3.5, "location": 4.0}}