{"user_rating": 4.0, "review_count": 606, "name": "Concorde Hotel Singapore", "reviews": [{"rating": 4.0, "title": "Spacious", "text": "A happy stay only for 1 night. Not much to comment. Got a room with spacious toilet : ) If you need a quiet corner in the room to do your business / office work, you can ask for it, they have room that comes with \"hidden workstation\", quite spacious too.", "user": "Trip K", "date": "August 3, 2013", "id": 170548544}, {"rating": 3.0, "title": "Centrally located", "text": "Hotel Concorde is in a prime location at 100 Orchard street in the heart of this well-known shopping area. The hotel is literally a 5 minute walk from the Dohbi Gaut MRT station (adjoining Singapura Plaza) so very convenient for accessing all parts of the city. If you're coming from Changi Airport by MRT to Dohbi Gaut it requires several easy line changes and takes about 30-40 minutes.", "user": "dagopakar", "date": "August 2, 2013", "id": 170509505}, {"rating": 3.0, "title": "Acceptable", "text": "To get to the hotel from Dhobi Gaut, you walk a short distance past the entrance gate to the Presidential Palace and you're there. Some people may be put off by several karaoke bars, massage parlours and a sex shop you also have to pass on the ground floor of the Concorde Shopping Centre. But if you're wearing a pair of \"blinkers\", you probably won't even notice! Access to the hotel is a bit confusing as you must first enter the Concorde shopping centre and then take to lift to the hotel lobby on the 3rd floor. The entrance is a bit off putting (especially for a 5 star hotel) but, apparently, there are moves afoot to build access to the hotel lobby directly from Orchard Road, starting some time this year.", "user": "Simon B", "date": "August 1, 2013", "id": 170365938}, {"rating": 5.0, "title": "Another great stay", "text": "The Concorde is an older hotel but has recently been fully refurbished (apparently, it used to be the Le-Meridien). My room on the 7th floor, facing Orchard Road, was a reasonable size, comfortable and I hadn't any complaints whatsoever. Everything worked. It was spotlessly clean, bed comfortable and the shower/bath worked well. There was a good selection of international channels on the flat screenTV and the in-room Wi-fi internet worked well, easy to use and quite fast. There were free tea and coffee making facilities (two free bottles of water) and lightly stocked mini-bar. There was also a small safe for storing valuables which I found very useful.", "user": "Iain M", "date": "July 29, 2013", "id": 169582727}, {"rating": 4.0, "title": "Great service, perfect location.", "text": "All staff I encountered were pleasant and helpful. I can't comment on the food. I chose not to eat in the hotel but at the Singapura Plaza, which has many good cafes and restaurants is, as I mentioned, only 5 minutes walk away. For those who need their Starbucks fix, there is a 24 hour store, just on the left as you enter Singapura Plaza. In the evening, it's quite nice to sit out front of the Mall on one of the \"boulder\" seats.", "user": "SarahDee123", "date": "July 29, 2013", "id": 169574221}, {"rating": 4.0, "title": "Good location and great service", "text": "We stayed at the hotel for four nights and the first impression when we arrived at the hotel was fabulous, a warm welcome by the doorman and helpful concierge. The front desk was courteous and efficient so as the housekeeping. The room size is just right for parents with a young child travelling along but, however, an upgrade to the bathroom will be a value-added. Although it is an aging hotel but two-thumbs up for its maintenance.", "user": "Martin W", "date": "July 28, 2013", "id": 169435999}, {"rating": 5.0, "title": "Excellent hotel", "text": "Lobby is at level 3, a bit of inconvenient because to get access to the main road we need to switch elevator to the shopping mall. Location is perfect as the hotel is between two MRT stations (Somerset and Dhoby Ghaut - the latter one is closer and it is an interchange) and surrounded by malls (save time than to travel).", "user": "Molly22_12", "date": "July 27, 2013", "id": 169260085}, {"rating": 5.0, "title": "Does not disappoint!", "text": "Overall, we were so pleased with the hospitality.", "user": "BatyPerthWA", "date": "July 24, 2013", "id": 168862733}, {"rating": 4.0, "title": "22nd July 2013", "text": "The hotel looks old and jaded from the outside but dont be fooled! The lobby looks new, the room is awesome and the service is simply great! Full marks for cleanliness, bed and pillow was very comfortable. Overall it was an amazing stay! I highly recommend this hotel.", "user": "Willjoh", "date": "July 22, 2013", "id": 168514156}, {"rating": 4.0, "title": "reasonably good", "text": "This was our third visit in 2 years. Once again we took advantage of the Premier Club room. This room gives the option of the Premier Club for breakfast (very quiet) and of course Happy Hour. This benefit alone is worth it - free flow spirits, wine and champagne plus delicious nibbles from 6pm to 8pm. The check in/out process was smooth, with the added plus of a slightly later check out to suit our return flight. Faridyah and the team in the Premier Lounge made everything so easy. Rooms are spacious with very comfortable beds and pillows. Premier Club rooms are also entitled to free wifi in the room and 2 pieces of laundry per room per day. This hotel is a 5 minute walk to Dohby Ghaut subway and about 15 minutes in the other direction to Ion and Tangs. There is a fabulous shopping centre at the subway - Plaza Singapura has everything you need including a Carrefours. There is a very cheap but very yummy food court underneath the Hotel and an open air one along the side street. This one is open quite late. Starbucks is on the next corner. You cannot go past the Concorde for value, location and service. Cannot wait to return to Singapore and the Concorde.", "user": "pavlova83", "date": "July 22, 2013", "id": 168492137}, {"rating": 3.0, "stay_parameters": "Stayed August 2013, traveled with friends", "text": "Nice hotel but not up too standard..", "title": "Orchid Rd", "helpfulness": 1, "user": "Susanna61", "date": "August 22, 2013", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 173471805}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "dirty glasses left in room first day", "title": "Very happy", "helpfulness": 2, "user": "AdelaideZac", "date": "August 21, 2013", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 173313755}, {"rating": 3.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "second day no towels left in room", "title": "Not Hygienic and Cold Service!!!", "helpfulness": 3, "user": "RAWM72", "date": "August 18, 2013", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 172789570}, {"rating": 3.0, "title": "Not impressed", "text": "Tv didnt work", "helpfulness": 3, "user": "AncaDumi", "date": "August 17, 2013", "id": 172697531}, {"rating": 5.0, "title": "Good and cozy hotel for family holiday", "text": "big wait for breakfast", "user": "Hari N", "date": "August 16, 2013", "id": 172500433}, {"rating": 5.0, "title": "Spacious & clean Room with very good breakfast", "text": "Stayed to this hotel again on our holiday last May 2013. still convenient because Of a Clean and spacious room. Breakfast was Very good but had to there earlier for avoid crowd. Service for check in a little bit long but quick check out. near to MRT and shopping mall because its location.", "user": "dewikartini", "date": "August 14, 2013", "id": 172297448}, {"rating": 4.0, "title": "Great location!", "text": "We stayed here for 3 nights and I must say I was generally impressed. The location is central and close to the shopping. Its only a 5 min taxi ride to Clarke Quay and 30 mins from the airport.", "user": "convict79", "date": "August 14, 2013", "id": 172214339}, {"rating": 4.0, "title": "Right in the heart of shopping heaven", "text": "Check in was smooth and efficient with the reception staff very friendly. The rooms were spacious and clean and quiet despite overlooking Orchard Rd.", "user": "Airynsh", "date": "August 6, 2013", "id": 171116676}, {"rating": 4.0, "title": "Good", "text": "We ordered room service one night after a long flight and the food was amazing!", "user": "Aditya K", "date": "August 6, 2013", "id": 171051415}, {"rating": 4.0, "title": "Good place to stay for business and shopping", "text": "Now for a few negatives:", "user": "gpilona", "date": "August 5, 2013", "id": 170828625}], "location": {}, "stars": 4, "variance": {"poor": 36, "average": 141, "very good": 286, "terrible": 15, "excellent": 128}, "aka": "Le Meridien Singapore", "slim_ranking": 0.295138888889, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.5}, "description": "Strategically located on the world famous Orchard Road and within the commercial and shopping district of Singapore, Concorde Hotel Singapore (former Le Meridien Hotel) is just minutes away from Suntec City, Marina South, The Esplanade, Boat Quay, Clarke Quay, Chinatown and other major tourist attractions.The hotel's 407 rooms and suites have been designed to meet the needs of both business and leisure travellers. All the guestrooms are equipped with a work area and other modern amenities to ensure they provide guests with a satisfying stay in Singapore. Free Wi-Fi is also available to Hotel Guests in their rooms, in the lobby, by the pool, and other selected public areas. For an exceptional dining experience, our newly refurbished Spices Cafe presents an interesting mix of local and Western cuisine. The extensive menus will spoil diners with a wide variety of tantalising meat, seafood, vegetables and desserts. In addition, the hotel is also home to chill-out venues that have a wide selection of beverages and snacks.Be it a seminar, banquet, workshop, product launch, gala dinner, birthday, wedding, family reunion, dinner and dance or simply a business meeting in Singapore, we can offer unparalleled meeting and event facilities with our pillarless ballroom, ten other function rooms that can accommodate up to 800 guests as well as impeccable service.This Singapore hotel is situated only 25 minutes away from Changi International Airport by car or taxi."}