{"user_rating": 4.0, "review_count": 620, "name": "Confortel Auditori", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "After reading many hotel reviews, we decided to stay at the Confortel Auditor and we were not disappointed.", "title": "Great Hotel!", "helpfulness": 1, "user": "Dunkeld10", "date": "August 25, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 3.0}, "id": 8504576}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "The hotel is in an ideal location for transport links, only 2/3mns walk from the Arc De Triomf Metro Station (use the Naples exit as closer to the hotel the the others) and the Nord Bus Station, good for airport transfers. Even being close to the transport links, the hotel was in a quiet residential street, nice to come back to after a busy day.", "title": "Fantastic hotel!", "helpfulness": 2, "user": "glengirlBelfast", "date": "August 14, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 8418138, "likes": {"liked": "— location", "disliked": "— size of pool"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007", "text": "The room was very comfortable, modern with plasma tv screen and complimentary mini-bar. Free internet access was available in the hotel lobby, aswell as fitness room and small pool on the rooftop. We didn't have breakfast in the hotel, used the bakers across the street, lovely.", "title": "even the cab drivers weren't sure", "user": "herts_rick", "date": "July 28, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8247849}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "A 15/20 mns walk takes you to the busy Las Ramblas area. We found it quite nice to walk back to the hotel and leave the buzz of Las Ramblas behind. If you're too tired to walk, use the Metro.", "title": "Fantastic hotel short stroll from tourist tat area....", "helpfulness": 2, "user": "Viz66", "date": "July 25, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8231646}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "Overall, we had a lovely time in Barcelona, staying in a comforable and clean, modern hotel that we would certainly use again.", "title": "A good hotel in BCN", "helpfulness": 1, "user": "paris1949", "date": "June 29, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 3.0, "rooms": 4.0}, "id": 8027206, "likes": {"liked": "— Clean, well equipped, friendly staff, quiet room", "disliked": "— A bit of a hike to the closest metro station"}}, {"rating": 5.0, "title": "Great Hotel, Close to Metro", "text": "We recently spent one night at the Confortel and it was great. We arrived early before check in and they were able to hold our bags for", "user": "emccic", "date": "June 29, 2007", "id": 8026516}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "us. We stayed for one night after debarking a cruise ship. Taxi to the hotel from the port was around 15 euros. La Sagrada Familia was a 10 minute walk away. Reception staff pointed us in the right direction. Found the staff to be helpful and friendly. They seemed to all speak some English, although we are also Spanish speaking and found it easiest to communicate in Spanish. The metro station was less than a 5 minute walk away. The room was clean, quiet and had great air conditioning. Taxi to the airport cost around 25 euros and took approx. 30 minutes. We were there on a Sunday so most things in the neighborhood of the hotel were closed. But again, it's a quick walk to the metro. Overall a great hotel in a good location. We would", "title": "Excellent Tourist Hotel", "user": "Wafto", "date": "June 29, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 8024802, "likes": {"liked": "— Cleanliness and position", "disliked": "— Nothing"}}, {"rating": 2.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "We stayed at this hotel 4 nights in september to celabrate out first anniversary. The locatin is very good as very close to metro station and also from the bus station where there are direct buses for Girona airport.", "title": "Good location", "user": "micky73", "date": "September 11, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 2.0, "value": 2.0, "location": 5.0, "rooms": 3.0}, "id": 19975349, "likes": {"liked": "— location", "disliked": "— bedding"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2008, traveled with friends", "text": "The room was cleaned and the towels were changed daily but what put me totally of this hotel was the bedding. The sheet was torn is two places and the pillow had a big blood stain which was visible through the nearly transparent pillow case. Also when the bed was changed after 3 nights the new bedding had stains on.", "title": "Reasonable", "helpfulness": 1, "user": "joylls", "date": "September 9, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 19904702, "likes": {"liked": "— Fast free wi-fi access", "disliked": "— air-conditioning"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "You could definitly see this was part of a chain hotel as the staff would hardly raise their heads from the computer in the morning to say good morning.", "title": "Excellent Quality and Great location", "user": "toon_ada", "date": "September 7, 2008", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 3.0}, "id": 19850274}, {"rating": 4.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "I would not stay at this hotel again and not recommend it to anybody.", "title": "Confortable Confortel", "helpfulness": 1, "user": "JCB88", "date": "September 5, 2008", "detail_rating": {"front_desk": 3.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 19806455, "likes": {"liked": "— location", "disliked": "— Not many sun loungers, could be too fair away from city centre for some"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "It is a superb 3-star hotel in terms of price (skip breakfast in return of a free minibar and 100 euro per room daily). Trendy room design and quiet surroundings. Easy to access major tourist attractions.", "title": "Modern Hotel with free mini bar and internet", "user": "mick_here555", "date": "September 4, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 19775882, "likes": {"liked": "— Modern design, free minibar"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2008", "text": "I have recently came back from this hotel following a 3 day visit in late August with my girlfriend.", "title": "Pretty much agree with what other people say.", "helpfulness": 2, "user": "IanH82", "date": "August 27, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 19433994}, {"rating": 3.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "As many people have indicated in the past the hotel is within a residential area so is off the beaten track rather than the centre, and to be honest I don't think that was a bad thing.", "title": "Great hotel but in wrong location", "user": "hazzy1008", "date": "August 17, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 2.0, "rooms": 4.0}, "id": 19034236, "likes": {"liked": "— Good standard accomodation", "disliked": "— Location"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "We arrived on the mid afternoon into Barcelona City Airport and caught the train into Barcelona Train Station and the connecting journey to the Arc de Triomph, due to my inability to remember the map we had to wing it when we arrived in the area and after some scratching heads we go there. If you do have the same problem this MAY help. If you exit and you are facing the Arc de Triomph building then follow the road round to the left and head towards the bus station which you should see. Once at the bus station there is are a number of entrances to the bus stop but if you have a look for the restaraunt Otobre (or very similar) the hotel is on your right (apologises if there is an easier way to go, but is is where the locals directed us to!), the other exits are actually out at the bus terminal.", "title": "Clean central & good value", "helpfulness": 1, "user": "dw842", "date": "July 25, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 3.0, "rooms": 4.0}, "id": 18232144}, {"rating": 3.0, "stay_parameters": "Stayed June 2008", "text": "The hotel was described as many other, free mini bar with water, juice and non-alcoholic lager, a digital safe and air con. The bathroom was equipped with a shower and hairdryer.", "title": "Not for Sunshine Lovers", "user": "euphrates78", "date": "July 17, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 3.0, "location": 3.0, "rooms": 2.0}, "id": 17984467, "likes": {"liked": "— Lobby.", "disliked": "— Darkness of the room!"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "I do agree that the rooms do not have the best natural light and our room looked into some sort of void into the centre of the hotel so no natural air coming into the room, but as it was only somewhere to rest our heads this is a very minor detail.", "title": "Decent Hotel for a Decent Price", "helpfulness": 1, "user": "jeetdragon", "date": "July 11, 2008", "detail_rating": {"front_desk": 2.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 17790339, "likes": {"liked": "— Location", "disliked": "— Location"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "Just returned from a 5 day break at this hotel, have to say it is the best 3 star hotel we have ever stayed in, rooms were clean and mini bar was a great bonus, the staff were helpful and friendly. Weather was 30 degrees,Only downside was not many places to eat, the Italian on the corner opposite the hotel was awful, waitress was rude and abrupt and the food tastless would not recommend. The Oriential Restaurant opposite the bus station was nice and resonable around 8 euros for a 3 course meal. If you are arriving into Barcelona airport the bus will take you into Placa Catalunya for 4 euros we then caught a taxi to the hotel for 6 euros. Las Ramblas was expensive we ordered 2 cokes and paid 12 euros, there is a few Irish bars off Las Ramblas if you fancy a change from local beers! the walk into Las Ramblas was about 20 mins, we walked to the beach this was about 25 mins and Sagrada about 35 mins, decided not to get the tourist bus as we wanted to walk and see the sights. If you are visiting FCB Stadium then the number 54 bus near the hotel will take you there for 1.30 euros and drops you off right outside a nice little find!. Overall we really enjoyed our city break in Barcelona we travel often and normally don't go back to the same place twice but we will be returning next June and staying at the Confortel. Excellent!!!", "title": "Great Break", "user": "WestMidlandsAnn", "date": "June 28, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 17318379, "likes": {"liked": "— cleanliness", "disliked": "— nothing"}}, {"rating": 2.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "The hotel is clean and the staff are friendly but there were a number of issues which made our stay quite disappoining. Firstly part of the reason we booked the hotel was due to the fact it had a pool. In reality the \"pool\" is a 2 metre by 2 metre square stuck in a tight corner on the 7th floor of the hotel which we refered to as \"the cattle dip\". There was no seating or loungers around the\"pool\" and only 5 or 6 sun loungers crushed into a tiny area just below and to the left of the \"pool\" area with two umbrellas which meant, due to the size of the space, that even if you were able to get a seat up there - which would mean queuing for the door to be unlocked at 9.30am, then quite often you could not actually get out of the sun once it was at a certain position in the sky. For a hotel which has a \"pool\" as one of it´s main selling points I´m not sure that the area actually provided to guests qualifies, especially given the number of hotel rooms and so guests to the actually facilities offered. The free mini bar also sounded great but realistically all it contains is a couple of small bottles of water, coca cola and some non-alcoholic beer. Once you take into account the fact that the pool and mini bar promise is not quite what it seems you are left feeling particularly peeved when the hotel staff tell you they do not have an iron or ironing board in the whole hotel and that you have to pay the extra to use the hotel laundry facilities. For us who were attending a wedding the hotel managed to fleece us out of just under 30 Euro simply to have a suit and shirt ironed!", "title": "Disappointing!", "user": "KatRay2012", "date": "June 24, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 1.0, "location": 3.0, "rooms": 2.0}, "id": 17179492, "likes": {"liked": "— Cleanliness", "disliked": "— Pool andno iron or ironing board avilable to guests, had to pay extra for laundry facility for this."}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "Some other more minor issues included the air con in the room being so weak that I hardly noticed it was on and spent most of our stay absolutey boiling, admitedly it works in the hotel foyer but not in the upstairs corridors or seemingly our room unfortunately. The restaurant is more like a canteen with the tables in the lobby area and the menu leaving a lot to be desired. This is not really a restaurant but more a cafeteria if they are being honest. The room is very minimalist, to the point that there is so little lighting I spent most of the time in my room feeling like a mole as I scratched around to try and find things in the dark. Finally the bathroom was so small and built in such a wierd shape that you had to close the door just to get to the toilet, only the door didn´t propery close. The shower screen also did not fit properly so with each shower the floor flooded meaning that any attempts to actually exit the tub became a game of \"lets not break your neck\" on the flooded tiled floor.", "title": "Great Find!", "user": "alieninny", "date": "June 23, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 17145553, "likes": {"liked": "— free wifi and great staff!", "disliked": "— Location was a bit futher than i imagine from the hotspots..."}}, {"rating": 4.0, "stay_parameters": "Stayed June 2008, traveled with friends", "text": "All in all this hotel does not offer a very good deal unless you are happ poor value for your mony. From looking at other places during our stay I can honestly say we would not be staying with them in future and that your money could be much better spent elsewere and provide a much more pleasurable stay in Barcelona.", "title": "great location", "user": "eagleeye73", "date": "June 11, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 16845425, "likes": {"liked": "— the location,free mini bar every day,x2 water x2 juice x2 beer", "disliked": "— no tea and coffee facilites in the room"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled with family", "text": "Just got back from Barcelona... stayed at Confortel Auditori for five nights.", "title": "Group liked this hotel", "user": "barb25", "date": "June 4, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "rooms": 5.0, "location": 3.0}, "id": 16669177, "likes": {"liked": "— The overall service was great!", "disliked": "— The hotel location could have been closer to the action."}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "We've just come back from a 3 night/2 day long weekend and stayed at the Confortel Auditori.", "title": "Lovely hotel, just a little far out.", "helpfulness": 1, "user": "Golden_Vision", "date": "July 9, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 17707025, "likes": {"liked": "— Clean, stylish, modern with a free mini bar!", "disliked": "— Just 5 minutes too far from La Ramblas"}}, {"rating": 3.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "It's a great hotel, very modern, very clean and has a free mini bar with fruit juice, water, coke and beer which is replenished everyday.", "title": "above average 3 *", "user": "mcfc20", "date": "July 8, 2008", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "location": 3.0, "rooms": 4.0}, "id": 17642620, "likes": {"liked": "— new hotel", "disliked": "— lack of bar /small poola rea"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "The pool is admitedly very small but we didn't plan to use it so it didn't matter to us.", "title": "Uneven Experience", "user": "ChiMagMile", "date": "July 5, 2008", "detail_rating": {"front_desk": 3.0, "business": 5.0, "service": 3.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 17553546, "likes": {"liked": "— Location, cleanliness, convenience", "disliked": "— Uneven service"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "The hotel is based in a residential area but we quite liked being able to escape the hustle and bustle at the end of the day. La Ramblas was in walking distance but probably would have taken between 25-35 minutes depending on how fast you wanted to walk. For us, having been on our feet exploring all day, we got a taxi to take us there in the evenings. On average it cost about 5 or 6 euros which we didn't mind paying.", "title": "a little gem with a great location!", "user": "jamoinoz", "date": "July 1, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 17396298, "likes": {"liked": "— location and area", "disliked": "— -"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "We did take a leisurely stroll to La Sagrada on the Sunday and that only took about half an hour.", "title": "Good but advertising a bit misleading", "helpfulness": 1, "user": "Ollie99", "date": "June 30, 2008", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 3.0, "cleanliness": 5.0, "value": 4.0, "location": 2.0, "rooms": 4.0}, "id": 17368327, "likes": {"liked": "— Clean, large and modern room", "disliked": "— Location"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "Hotel Confortel Auditori is situated slightly aside from the main streets and center of the city, but especially if you know your way around in BCN, the location is good. Metro stop is nearby and you could basically walk to Placa Catalunia too. Hotel is neat, quiet and rather stylish. Rooms are comfortable and furbished in Scandinavian style. The customer service at the lobby was excellent and staff spoke fluent English. Free WLAN is available throughout the hotel and you can also use the public computers at the lobby. The swimming pool is small, but offers nevertheless a chance to refreshen after a long day at the city or in the morning. The free minibar was a nice surprise too, especially since it was refilled everyday! We were more than pleased with our experience and can warmly recommend this hotel to other travellers as well.", "title": "Exellent service and comfortable rooms", "helpfulness": 2, "user": "Losviages", "date": "September 12, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 3.0, "rooms": 4.0}, "id": 8701069, "likes": {"liked": "— Comfortable rooms, peace and calm", "disliked": "— Hotel is slightly away from the center"}}, {"rating": 2.0, "stay_parameters": "Stayed September 2007", "text": "This hotel seemed to me overrated in comparison to many other hotels I have been. For a superior three star I do not expect not to have an iron and a board available for self-service (not in the room, but at least in the building). The answer to my request was that there is a price list in the room. Sure, this means that you may give your shirt or whatever to iron for at least 6 euro per piece during certain hours. How convenient...also, the free minibar is a marketing trick, do not expect normal minibar beverages, the only \"alcoholic\" drink being light beer. Also, the room I got was an uncomfortable corner room (maybe this is what internet bookers get). Next time I will use a different hotel in Barcelona.", "title": "OK, but could be better", "helpfulness": 1, "user": "tajabone2003", "date": "September 10, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 2.0, "location": 3.0, "rooms": 1.0}, "id": 8687278}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "Stayed at this hotel for a week at the end of August 2007. What can I say, only that this is a fantastic hotel.The room we had was on the first floor at the back of the hotel. There was absolutely no noise....from outside or other guests. The location was just perfect - it is next to Barcelona Nord Bus Station and 5 minutes walk to Arc de Triomf Metro Station (which will take you right into the city centre within 5 minutes) and 15 minutes max walk to the Sagrada Familia (and the metro station which will take you to the Nou Camp). If you do not fancy shopping in the overpriced and overcrowded shops in the City Centre, then take the metro from Arc to Triomf to a shopping complex 2 stops in the opposite direction from the city centre to a place called Glories - it has everything that the city centre has and appears to be the place that locals go (which is also a good sign).", "title": "Just Brilliant", "helpfulness": 3, "user": "pbsDublin", "date": "September 7, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8670113, "likes": {"liked": "— Clean and Comfortable", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "A taxi ride from the city centre to the hotel is around €6 (on the nights you do decide to venture into town). Up by the Sagrada Familia is also good for eating and the hotel have a Pizza Menu, which if you a feeling lazy, you can order from. Don't feel that you necessarily have to go into town!!", "title": "Great choice in Barcelona", "user": "subbyc", "date": "September 6, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 8666572, "likes": {"liked": "— Room and amenities", "disliked": "— Not a lot of great eating places close by"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled with friends", "text": "The hotel itself is spotlessly clean, and mini-bar was stocked daily. Hotel room was left spotlessly clean every morning by staff. Reception staff are friendly and helpful at all times, and speak good English (which was great)!!! Air conditioning in the room was brilliant and did not rattle along like other air conditioning systems.", "title": "design hotel at a very good price", "user": "steukerb", "date": "August 27, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 8515230}], "location": {"country": "Spain", "region": "Catalonia", "continent": "Europe"}, "stars": 3, "variance": {"poor": 25, "average": 109, "very good": 289, "terrible": 10, "excellent": 187}, "aka": "Confortel Auditori Hotel Barcelona", "slim_ranking": 0.472275334608, "description": "The Confortel Auditori is located in the heart of Barcelona, just 10 minutes walk from Arc de Triomf train and metro station and 1.5 km away from the Sagrada Familia. The famous Barcelona Auditorium is just a 5-minute walk from the hotel.The Confortel Auditori offers a gym, a sauna and a spectacular rooftop pool from where guests can enjoy breath taking views of Barcelona. All rooms have contemporary decor and offer free Wi-Fi, free bottled water, flat- screen TV, satellite TV, free safety deposit box and air conditioning. The hotel offers free use of sveral PC’s located in the main lobby with free internet access"}