{"user_rating": 4.5, "review_count": 1062, "name": "Conrad Tokyo", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled on business", "text": "I spent 7 nights in the Conrad Tokyo for business. Firstly, the \"plus points\". Very clean and well maintained overall, including the rooms and common areas, modern \"business class\" hotel with all the usual conveniences. Efficiently run. Staff are very competent and helpful and make the effort to enable you to feel welcomed. The concierge staff go out of their way to help in whatever way possible, which is very useful especially if you don't speak Japanese or if you don't know the city well. The rooms are slightly dated, but still well maintained and housekeeping is excellent and responsive. The Chinese restaurant in the hotel is apparently very famous and the chef creates innovative dishes worthy of any one with a discerning palate. However, the prices are very expensive.", "title": "Excellent hotel but let down by its location", "user": "SingaporeGuy10", "date": "September 26, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 2.0}, "id": 178693311}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled solo", "text": "Now the \"minus points\". The location is definitely not good. While the \"Bay View\" rooms have a lovely view of Tokyo Bay, this hotel is not well located and the distance to the nearest Metro Station is quite a walk away (about 10 - 15 minutes). The breakfast is quite limited. I opted for the Japanese option on a few days and found the food rather disappointing.", "title": "My favorite hotel in the world, Top Notch", "user": "shichiroku", "date": "September 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 178649124}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "All in all, while it is a well run and highly efficient business hotel, I'm not sure that I would recommend it to the tourist who needs convenient access to the main attractions.", "title": "Top-level Luxury with Exceptional Service", "user": "absolutepalate", "date": "September 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 178430890}, {"rating": 3.0, "stay_parameters": "Stayed September 2013, traveled on business", "text": "If a hotel deserves 6 stars, this one does. Absolutely brilliant, beautiful facilities. Everything about the hotel, from the lobby on the 28th floor, with the bar and the view of Tokyo Bay, to the interior decor of each floor, the spacious rooms, the amenities, all top notch. The lounge offering is not the best, food is more like appetizers, but food is Japan is so good, this is a good place to start your evening plans with a couple of drinks and snacks before you head out. Location is convenient as well. You are not far from Shimbashi, and Ginza is walking distance away. It's a treat I give myself once a year to stay here. Simply fabulous!", "title": "Not good for business travelers, even worse for leisure", "user": "Will S", "date": "September 18, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 3.0}, "id": 177655427}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled on business", "text": "My wife and I cherish our stays in luxury hotels worldwide. We have stayed at many Relais & Chateaux properties, for example. This Conrad rates high on our overall list. The lobby is on the 28th floor and the hotel occupies floors 28-37. We stayed on the 37th, Executive Floor, next to the Executive Lounge. The decor is elegant and attractive. Special to us was the spaciousness and quality of the rooms, as well as the many amenities. The power shades were not only efficient, but they truly were room-darking. The rooms also were very, very quiet. So, we had superb sleep and could sleep late in a very dark environment. (The closet door did not block the hallway, as it occupied 50% of the passage.) We could not contemplate anything more for the room in this high-rise hotel in a major city. The restaurants we attended, for which separate contributions are placed on TA, were quite good in general, albeit not tops in Tokyo, except for the buffet breakfast at Cerise (see below). Service was spectacular: housekeeping, turn-down, information, restaurant staff, and concierge. Indeed, this hotel had the best concierge service imaginable. We got reservations at top, hard-to-reserve, restaurants with limited seating; excellent sumo and kabuki tickets; travel instructions/ directions; etc., etc. You just name it and these folks delivered with verve and efficiency. As for location, the hotel is around the Shiodome area, which is a short walk from the Ginza shopping district, a walk that can be done largely underground or on and elevated walkway. We had taxi rides of 15-20 min to all of the fabulous restaurants that we opted to dine at. As to the breakfast (see separate TA review on Cerise), yes, the Eggs Benedict mentioned elsewhere, which we were wise enough to not order, looked pretty poor on another table. But what can one really expect for this dish in Japan. My wife is an Eggs Benedict fan and they rarely please her anywhere in the world. The absolute best was at the NYC Plaza's Palm Court some years ago, and we have not had anything comparable since. You could smell the lemony Hollandaise in that dish from 10 feet away; it was perfect and there was plenty of it. The point about Cerise for breakfast are the great selections at the several buffet tables; an amazing diversity of food items! So, if you are staying at the Conrad, it is highly recommended that you stick with the outstanding full buffet. The free standard internet was adequate for all of our many needs, not slow, but we did not stream video. We could have had free premium internet, as Hhonors Gold people, but we had no reason to do so, and we used our computers and devices a lot. The Exec Lounge was very good, not excellent.", "title": "could be a better value for money than other 5 star s in tokyo", "user": "QualityMattersMost", "date": "September 15, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 3.0}, "id": 177316990}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled solo", "text": "Conrad Tokyo hotel is excellent hotel. The room is very big and the view is fantastic. The hotel is located near the shinbashi station and it is very comfortable to reach ginza or roppongi. There is beautiful carden near the hotel good for walking. By yurikamome (fully automated transit system operated between shimbashi and toyosu) you can easily get to Odaiba(large artificial island in Tokyo Bay)", "title": "Comfort hotel", "user": "Heeyoung K", "date": "September 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 175842996}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled on business", "text": "Hotel is very nice and comfortable by western standards. Food prices are very high. Usually you can only find one TV station that is in english. BBC and CNN are voiced over in Japanese which can be frustrating.", "title": "Long term stay", "user": "762SueS", "date": "September 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 175632445}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled solo", "text": "Staying at Conrad due to enthusiastic recommendation of a friend brings me not only to a superb city hotel but also a new area of Tokyo. At first it seem a bit far away but it is not. This is a modern new business and leisure area that is easily walkable to Shinbashi station and Ginza. Ultra modern hotel with impressive high-ceiling lobby, with views over Tokyo Bay and a Palace park, or city view of neat skyscrapers on the other side. Very comfortable rooms, well-decorated yet homely. Room amenities first class. Executive Lounge facilities adequate and service good. Evening snacks can come in a tray set with your drinks, and breakfast is good. Other highlights are the Chinese and Japanese restaurants. The Chinese is the only hotel Chinese restaurant that has a Michelin star, with very innovative dishes by a Hong Kong chef. The Japanese restaurant is fantastic too. This hotel will be one of my preferred Tokyo addresess after my \"discovery\".", "title": "Excellent Hotel Experience", "user": "awhw", "date": "September 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 175484007}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled on business", "text": "I travel a lot and I've never stayed at a better hotel. Fabulous service and staff. The executive lounge has a very good morning breakfast and a nice evening reception with snacks and drinks. Great location. Can't wait to stay again!!!", "title": "Tokyo Trip", "user": "James R", "date": "September 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 175650039}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled on business", "text": "Was here for 2 nights in late August. I haven't got one bit of criticism for this property. It delivers fully completely.", "title": "Nothing but greatness at the Conrad", "user": "Stoaks", "date": "September 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 175361794}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled on business", "text": "It is difficult if not impossible to find a first class hotel in Tokyo with such generous room size, such modern amenities and superb and functional design. Detailing is hall mark in this hotel which is conveniently located. No fuss and yet most efficient in every may thus make every stay a pleasant and memorable experience. It will be my base whenever I visit Tokyo whether on business or private", "title": "First Class Hotel with a Unique Features", "helpfulness": 1, "user": "David Mung Pang O", "date": "August 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 174251109}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled on business", "text": "Only one night but an excellent hotel, well-situated, with over-sized rooms. Accomodating and friendly staff. Room decor/design was similar to some Peninsula hotels, with all aspects of room deliberately larger than needed without appearing to be underfurnished or having \"open\" space. Upgrade to bayview well worthwhile, and breakfast buffet included in my rate was excellent and included french-press coffee. Bed was most-comfortable I've had in all my Japan stays, and floor-to-ceiling windows made for one of the brightest rooms in any city hotel.", "title": "Outstanding Property", "user": "davidandrose1", "date": "August 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 173986236}, {"rating": 5.0, "title": "Precise, gracious and friendly service!", "text": "Easy walk to Ginza area and fish market, only disappointment was the Narita airport service i accepted on Friendly Airport limo. Convenient hotel pickup and reasonable $30 rate, we had lengthy stops at several area hotels (however fewer stops than I might have expected) but a painfully slow driver and a 90+ min drive that might have been much quicker on a nearby train.", "user": "EixampleAusiasMarc", "date": "August 25, 2013", "id": 173914878}, {"rating": 5.0, "stay_parameters": "Stayed August 2013", "text": "We are amazed with this hotel! Great property, very well located, beautiful and zen design but above all, the service is the best thing that this hotel offers.", "title": "Outstanding Concierge staff", "user": "barcelonatravelers", "date": "August 21, 2013", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 173398882}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with friends", "text": "The rooms are spacious and the sofas in the room are very Cousy just to sit down and enjoy the views of the bay and the park.", "title": "Lovely hotel with fantastic views", "user": "Wendy B", "date": "August 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 173329251}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled solo", "text": "All I can say about this hotel is amazing. The service, the staff, the room is all amazing. From the minute you walk into this hotel you feel the passion of the service at the hotel. My room was quite large and decorated beautifully. I stayed on the Executive floor and the service was amazing. They served breakfast and evening snacks with cocktails. The concierges at this hotel are fantastic and helped me find a hard to reach store. The gym, the spa facility and the food were great too.", "title": "Beautiful and AMAZING service", "helpfulness": 1, "user": "nychellzkitchen", "date": "February 24, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 13814018}, {"rating": 5.0, "title": "Loved the Conrad", "text": "I stayed at the Conrad for 4 nights for vacation and was very happy with my experience. The room was very well-decorated and spacious, with more of a modern style. From the room, there was a sweeping view of the Tokyo Bay skyline, which was one of the best aspects of the hotel. I would definitely stay at the Conrad again when I'm back in Tokyo.", "user": "ASD234", "date": "February 10, 2008", "id": 13435477}, {"rating": 2.0, "stay_parameters": "Stayed January 2007, traveled on business", "text": "First the good part. The hotel itself is okay and the rooms are comfortable and clean. Amenities are more than satisfactory and beds are nice.", "title": "Nice hotel but some problems with staff, restaurant", "helpfulness": 6, "user": "GlobalFoodie", "date": "January 26, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 3.0, "location": 3.0, "rooms": 5.0}, "id": 13004721, "likes": {"liked": "— Clean, nice room, amenities", "disliked": "— Pretentious waiting staff at the Gordon Ramsay Restaurant"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "Now the problems: Some staff seem to lack attention where it counts the most. A lot of hotel staff float around the hotel, but they are not really helpful at all when you need their help. Which leads to the biggest problem, the Gordon Ramsay restaurant: The food is actually pretty good (although I think the New York restaurant was honestly one notch better). However beware because, the service is very, very slow. The waiting staff try to act courteous, but really lack attentiveness. When we had lunch there, we ordered their recommended courses, but our finished plates were left on the table for over ten minutes, dessert took 30 minutes to arrive, and another 20 minutes for coffee. This is unacceptable in a busy city like Tokyo where guests would like to enjoy the atmosphere, but not spend the whole afternoon there. (We had to delay an important appointment afterwards.) But, the real killer was that during our lunch, the waiting staff were extremely courteous and prompt to their OWN hotel staff - as we watched a manager of the hotel who was dining some friend, arrive later, receive better service and finish eating much earlier than we did! I understand that the waiting staff would like to get on the good side of their boss, but this should not happen at the expense of other guests getting delays in their service. I consider that unacceptable and this really annoyed us. So my recommendation: the rooms are nice so you'll enjoy your stay, but if you are going to eat lunch or dinner and need prompt service, eat outside the hotel.", "title": "One of the Best in the World!", "helpfulness": 2, "user": "Mattsaab", "date": "January 18, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 12773716, "likes": {"liked": "— The stunning hotel--decor, rooms, design, comfort", "disliked": "— Not good for those scared of heights"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "This is one of the best hotels in the world--and my absolute favorite in Tokyo! The location is wonderful, on the Yamanote Line, accessable directly to Narita, on the bay with stunning views of Daiba and Rainbow Bridge.", "title": "Great Service, Great Room!", "user": "canelle7", "date": "December 19, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 3.0, "location": 4.0, "rooms": 5.0}, "id": 11699628, "likes": {"liked": "— amazing service, great room", "disliked": "— expensive, a bit of a walk to Ginza main strip"}}, {"rating": 2.0, "stay_parameters": "Stayed September 2007, traveled with family", "text": "I have been visiting Tokyo at least once a year in the past 10 years or so and of all the hotels I stay at, Conrad Tokyo has got to be the most overrated 5 stars hotel in Tokyo.", "title": "Disappointing", "helpfulness": 6, "user": "SW1London", "date": "October 13, 2007", "detail_rating": {"front_desk": 1.0, "business": 3.0, "service": 2.0, "cleanliness": 4.0, "value": 1.0, "location": 3.0, "rooms": 3.0}, "id": 10072953, "likes": {"liked": "— View", "disliked": "— Poor Service"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled with family", "text": "Pros:", "title": "valuefor money", "helpfulness": 1, "user": "holee", "date": "October 5, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 10043193, "likes": {"liked": "— clean and spacious rooms, quality service and modern hotel", "disliked": "— city view is facing office blocks"}}, {"rating": 2.0, "stay_parameters": "Stayed August 2007, traveled on business", "text": "1. Location - close to shopping district, around 5-10 mins by taxi to Ginza and Nihombashi", "title": "Sexually repressed", "helpfulness": 6, "user": "XXX007", "date": "September 20, 2007", "detail_rating": {"front_desk": 1.0, "business": 3.0, "service": 1.0, "cleanliness": 5.0, "value": 3.0, "location": 3.0, "rooms": 5.0}, "id": 8827833, "likes": {"liked": "— Bathrooms", "disliked": "— Rude staff"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2006, traveled with family", "text": "2. View – Spectacular Tokyo Bay view", "title": "the best", "helpfulness": 3, "user": "s2000imp", "date": "July 3, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8053011, "likes": {"liked": "— decor", "disliked": "— price"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled on business", "text": "Cons:", "title": "The Conrad is Spectacular", "helpfulness": 4, "user": "AliceBowie", "date": "April 7, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7291840, "likes": {"liked": "— decor", "disliked": "— The location."}}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled on business", "text": "Wonderful hotel, with excellent rooms with all the luxury you can wish for.", "title": "Very nice design rooms", "helpfulness": 1, "user": "Wereldreizigster", "date": "December 2, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 3.0, "rooms": 5.0}, "id": 11212421, "likes": {"liked": "— the rooms and the service!", "disliked": "— the area around the hotel does not offer many choices but with a taxi you are quickly in ginza"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled on business", "text": "The restaurants are very good and the sushi was out of this world..", "title": "Conrad is a first class hotel", "helpfulness": 3, "user": "fudy", "date": "December 1, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 11187272, "likes": {"liked": "— Service, hotel decor", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled with family", "text": "Pity that the hotel is not in an area with some shops and restaurants, only the Hama gardens and the Tsukiji fish market are near.", "title": "Amazing Hotel!!!", "user": "penguinlee", "date": "November 4, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 10578623, "likes": {"liked": "— Cleaniness and services"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2007", "text": "I was on business in Tokyo and stayed at the Conrad for one night.", "title": "Outstanding Stay at the Conrad", "helpfulness": 6, "user": "Seacliff1", "date": "November 3, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 10576814}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "I found the waitstaff to be quintessential polite Japanese with great attention to detail, humility and supreme politeness.", "title": "Awesome!", "helpfulness": 2, "user": "pinkbootpootle", "date": "October 29, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 10424063, "likes": {"liked": "— First class service"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled on business", "text": "As charming and spectacular as Tokyo is, I don't think I'd have loved it quite so much if I hadn't been fortunate enough to stay in this excellent hotel. Located in the uppermost section of a Shinbashi skyscraper, the views were awesome and the accommodation and service were also of the highest standards. Room size is slightly above average for Tokyo, furnishings and decor of great quality but all very understated. Other highlights - Great lobby bar with excellent views to the harbour, well presented pool and gym - the latter with more great views and a Gordon Ramsay restaurant. Any downsides, can only think of one.....its slightly tricky to navigate to the hotel by car - it even stumped a taxi driver who was so ashamed he refused his fare. Apart from that the only thing I'd urge you to consider is the location. This part of town is all high density, ultra modern high rise apart from the vista out to the harbour - so if that isn't your thing perhaps consider another hotel in a different part of town.", "title": "Really excellent hotel", "user": "Andrew M", "date": "September 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 177253015}, {"rating": 5.0, "title": "Perfection", "text": "This place is the epitome of a perfect hotel. The foyer and check in area feels like you are on the set of the Matrix. The rooms are how you would imagine a perfect hotel would look in your dreams ... Except this is REAL. Highest quality everything ... even their complimentary slippers felt like designer gear. The gym pool and spa area is world class.", "user": "aab1976", "date": "September 12, 2013", "id": 176823302}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled on business", "text": "Good location, great views etc BUT getting around Tokyo is HARD, and finding the rail system via the underground passageway from the hotel confused the hell out of us ... perhaps the hotel could creates signage or produce a map with written instructions because the well intentioned staff only aided our confusion unfortunately.", "title": "Perfect holiday or business hotel", "user": "Abby M", "date": "September 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 176690461}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled on business", "text": "For a big hotel the Conrad has somehow managed to style all of the hotel with colours and materials that give it the feeling of a more luxury boutique hotel. Lots of gorgeous fabrics, wood and glass have really warmed up the hotel. The rooms are huge and come with the unique gadgdest you'd expect in Japan such as the toilet with more buttons that plane cockpit and remote control window black out blinds. The breakfast was included in the room and is a mixture of buffet as well as the choice of one alacart option. Its one of the best hotel breakfasts i've experienced in the region and was a great way to start the day both for work days and when i was their for pleasure on the weekend. The staff are very helpful and friendly. The only negetives i have is that we were told we'd have to pay to use the pool so if you're somone who is choosing the hotel with use of the swimming pool in mind, i'd make note of this. Also, the location was great for my work but not so good for access to the subway for sightseeing.", "title": "Business Stay in Tokyo", "user": "John M", "date": "September 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 176703592}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled on business", "text": "Excellent service, friendly helpful staff! Luxurious accommodations. Food pricey but an excellent dinning experience. Located in the heart of Tokyo, in Shinbashi. The hotel was near to most of my customers. This was most helpful considering traffic. One night my cell phone fell out while paying for the taxi. The hotel staff were friendly and extremely helpful in locating and obtaining my phone. Incredible service!!!!", "title": "One of the best hotels in Tokyo", "user": "akiraoz", "date": "September 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 2.0}, "id": 175763731}], "location": {"country": "Japan", "region": "Kanto", "continent": "Asia"}, "stars": 5, "variance": {"poor": 15, "average": 57, "very good": 260, "terrible": 11, "excellent": 719}, "aka": "Conrad Tokyo Hotel", "slim_ranking": 0.0108695652174, "detail_rating": {"service": 4.5, "cleanliness": 5.0, "value": 4.5, "sleep": 4.5, "rooms": 5.0, "location": 4.0}, "description": "Welcome to the Conrad Tokyo hotel, where legendary Conrad excellence meets the calming and inspiring design of modern day Japan. The Conrad Tokyo hotel is conveniently located just 5 minutes from the famous Ginza Shopping Street."}