{"user_rating": 4.5, "review_count": 1885, "name": "Conrad Chicago", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "THe Conrad always gives me first class service.", "title": "review", "user": "brandon f", "date": "March 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 126778121}, {"rating": 5.0, "stay_parameters": "Stayed March 2012", "text": "I appreciate what they do.", "title": "Excellent Quality!", "user": "A2Russ", "date": "March 27, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 126736649}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "I could not have asked for a better experience. The staff went out of its way to be helpful. The room and bathroom were cleaned meticulously, and the bed was very comfortable. We only had breakfasts in the hotel, but food and service were high quality. We will be back the next time we go to Chicago.", "title": "Great Hotel Great Location", "user": "Ken P", "date": "March 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 126731445}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "We love visiting the city and nothing beats staying at the Conrad. Close to shopping and the wonderful Michigan Ave. Rooms are spacious with great views of the city. We have stayed 8 times over the last year and will continue to go back.", "title": "Excellent service!", "user": "nycrussell", "date": "March 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 126730683}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled solo", "text": "Excellent, genuinely friendly service! We stayed over the weekend and had 2 separate reward reservations which I thought might be a problem. The desk staff made the process effortless! Thanks from a loyal diamond member!", "title": "Would stay in the Bathroom!!", "user": "KimBux", "date": "March 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 126694538}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "great hotel--central--good for shopping and restr.,", "title": "super hotel", "user": "drtcoghlan167", "date": "October 20, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119514351}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled on business", "text": "room v comfortable--good pillows and beds'", "title": "A Perfect Hotel", "user": "MarioNaples", "date": "October 19, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119474431}, {"rating": 2.0, "stay_parameters": "Stayed August 2011, traveled on business", "text": "16th floor v quiet and good lift service", "title": "treated poorly, noisy room", "user": "businesstraveller038", "date": "October 19, 2011", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 1.0, "sleep": 1.0, "rooms": 3.0, "location": 3.0}, "id": 119465130}, {"rating": 5.0, "stay_parameters": "Stayed October 2011", "text": "staff super.", "title": "Amazing staff at amazing location!", "user": "jazzlover2112", "date": "October 18, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 119455969}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled on business", "text": "Have been at Conrad last week for a Corporate meeting. Everything was fabulous, from the room (the exact word would be \"flat\", a 5 people family would have been confortably accomodated in my room), the food was of excellent quality, portions not exceeding the size a normal person would be able to eat, prepared in excellent way. The staff was professional and polite, the cleanininess excellent, the terrace offered the chance for a cocktail looking at the marvellus Chicago skyline. The Hotel is located in the center of Chicago. Nothing more to demand from life!", "title": "Excellent", "user": "suee9999", "date": "October 18, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 119448375}, {"rating": 3.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "Stayed at the Conrad Chicago so that my daughter could attend the University of Chicago's open house for prospective students. The location is perfect, an easy walking distance to both the loop and the magnificent mile. The room was much smaller than I expected, but very clean and comfortable. The bathrooms are huge. The bed was very comfortable, and everyone we encountered, from the front desk to room service, was very friendly and accommodating. We ordered dinner and breakfast from room service, and the food arrived quickly, and was delicious. But minor issues did ultimately add up and negatively impact our enjoyment. The rooms have a mini-fridge, but they are not stocked. You must place a room service order off the mini-fridge menu, and pay the 18% service charge plus $5 delivery charge to stock anything in the fridge, which I found rather ridiculous. I've never stayed in a hotel with an empty minibar. The Conrad Indianapolis fully stocked their mini bar, so this perplexes me. The TV is hooked to a Bose surround sound system, which would have been great - if it worked. Our speakers were full of static, and after a call to the front desk, an engineer was immediately dispatched to our room. He simply unhooked the TV from Bose. I was given the impression that this was not an uncommon problem, so why bother to offer the Bose if it doesn't work? Also, on our last night we ordered takeout from a nearby restaurant, and found after the delivery person had already gone that utensils were not in the bag. Room service was happy to provide us with forks, but we had to pay a $5 delivery charge. Seriously? The room was upgraded to a high floor (15), with a city view, but the view was mostly of the HVAC units on an adjacent roof top several floors below, and a very close office building. Finally, while the wireless internet service is free, I had to re-log in multiple times per day, which was frustrating. Finally, at check-in the desk clerk noticed that my birthday was that same weekend, so I was hoping for maybe a small treat sent to the room, or even a discount coupon as a happy birthday. Would I stay there again? Probably not. If asked, I recommend other hotels in Chicago first, such as the Hotel Indigo, the Hilton on S. Michigan,or the Palmer House.", "title": "Expected Luxury but Minor Issues Impact Enjoyment", "helpfulness": 1, "user": "ilona06", "date": "April 5, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 2.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 127320790}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "I stayed at the Conrad for the first time March 30 - April 3 2012 and have put it in my \"must come back\" list. I was upgraded to a Pure room on the top floor and let me tell you, what an incredible room this was. From the bed, to the TVs and the bathroom everything was in perfect working order. The staff was very, very welcoming at the front desk. The restaurant breakfast buffet personnel was also very gracious. I used the gym once, which was spacious and clean. The location is absolutely perfect as you are 1 block from the magnificent mile, yet without the nose from all the tourists. Great job and please keep it up!", "title": "An incredible experience at an excellent value", "user": "Neburazo", "date": "April 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127317866}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "Stayed here for our anniversary, had a \"suite location\", nice rooms. Breakfast in the restaurant was delicious. You cannot beat the location/price/style ratio. Views are nice and tsaff was excellent. No complaints.", "title": "Excellent stay, beautiful hotel, exellent location", "helpfulness": 1, "user": "Tiredboy69", "date": "April 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127180986}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "Fab hotel with stylish rooms, delicious room service breakfasts. Perhaps best of all, perfect location on the magnificent mile. Our suite was glamourously outfitted with several TVs, two WCs and the all-important top of the range coffee maker. Fluffy bathrobes and free wifi helped us stay comfortable and on top of work while on holiday.", "title": "A Chicago gem", "helpfulness": 1, "user": "Kristine S", "date": "April 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127151922}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "The Conrad is a very nice hotel; upscale and nicely finished with a very attentive staff. But what really makes the hotel is the location. Where else can you walk out of a hotel lobby and take a elevator down to Nordstroms?! The hotel restaurant is fine for breakfast or a quick lunch but not sure I would do dinner there. But the Conrad is on the Magnificient Mile of Chicago with hundreds of terrific restaurants within walking distance, so that's absolutely not an issue. We were able to get a great rate for this five star hotel which really made for a wonderful weekend. Would go back in a heart beat!", "title": "Great Hotel in an Awesome Location", "user": "d z", "date": "April 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 127098494}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled with friends", "text": "We came into the city looking for a girls night out. The Conrad staff were extremely helpful right from the start and never ceased. We wanted to be central to all of our fun that evening and the Conrad was it. We were able to walk to dinner and enjoy the sights and sounds of the city. Our room was unbelieveable and surpassed all of our eexpectations. We had a terrace that overlooked the magnificent mile that of course was a great photo op. THe taste and style of the rooms were impecable--very crisp and clean, modern and very comfortable. I did not want to leave and have been wanting to go back ever since I left.", "title": "great service + great view", "user": "allstaranna", "date": "October 13, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119260503}, {"rating": 4.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "It's a very nice hotel and we stayed here after looking for a good deal on a 5 star hotel on Priceline. We had never heard of the Conrad. LOCATION: We were surprised at this hotel's location-- right in the heart of the Gold Coast, you can walk to *everything* good. Especially for the shoppers among us. ROOMS: Yes, very good, comfortable. And we loved the pillow menu-- what a nice touch. STAFF: Unobsequious and very attentive. True to the Chicago style of friendly and professional. OTHER: This place is a find and we liked it almost as well as the Ritz or the Four Seasons. The rooms are slightly less sophisticated but you're also getting a price break. It's comparable to the Westin on the Chicago River (River North), and I'd choose the Conrad over the Westin.", "title": "Surprisingly Good, and Loved the Pillows!", "helpfulness": 3, "user": "Travelathon", "date": "October 11, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 119199759}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled on business", "text": "I've stayed at this hotel several times, and have taken a liking to it. It is centrally located on Michigan Ave., has a very nice dining room that is underutilized at dinner, and a good bar with excellent service. A very nice, up-to-date gym. The rooms are very good, the larger rooms with a separate bath tub. Unfortunately the hotel is situated close enough to the buildings around it that in some rooms it picks up the local HVAC noise. And the highest rooms, on the 17th and 18th floor pick up the hotel's HVAC buzz. But lower floors are fine. The lobby needs a new lay-out, there is a lot of wasted space. Still, this hotel feels like a boutique, and trumps the chains around it. It is not like the Conrad Hong Kong, but is darn nice. Good service.", "title": "Very good hotel in the Heart of Chicago", "helpfulness": 1, "user": "kev1438", "date": "October 11, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 119197388}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled on business", "text": "I stayed here recently on a one-night business trip to Chicago; this was my second time at the Conrad. Though I didn't spend much time at the hotel the experience was excellent. The room was large, modern and nicely decorated. The TV was large and there was a hook-up for my I-pod for both the room stereo and the bedside radio. Check-in and check-out was quick, efficient and friendly. There are many restaurants within short walking distance. I recommend it.", "title": "Excellent hotel", "helpfulness": 1, "user": "timminn", "date": "October 11, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 119192632}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "This hotel is really dog freindly ! Upon our arrival they came up with a dog bed, leashes, and stainless steel dog dishes. Staff was really freindly and helpful.", "title": "great time staying at the Conrad Hilton in Chicago with our dogs", "user": "timbenimble", "date": "October 11, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119180750}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled solo", "text": "My stay at the Conrad Chicago ranks very high up on the list of my best-ever hotel stays. I have stayed in hotels on four continents, in several different countries, and this was one of the most enjoyable stays that I have ever enjoyed. Top marks on all counts.", "title": "Wow! What a fantastic stay!", "user": "Maclock", "date": "March 31, 2012", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 127000282}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "The staff was customer friendly and at the ready to be of assistance. The room was wonderful. Comfy bed. Spacious bath. Plenty of large towels. I especially liked the electrical plug at the desk because we usually have to bring a power cord when we stay in a hotel. But, not at the Conrad in Chicago. The location was within walking distance of water tower place, navy pier. we went to howl at the moon duel piano bar which was within walking distance. oh and the Conrad connects to Nordstrom and the mall there. So shopping was a plenty. Which was great because this was a weekend for mom and daughters. I would definately stay at this place again and would highly recommend it to others.", "title": "Outstanding Stay", "helpfulness": 1, "user": "T M", "date": "March 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 126995247}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "This review is for a stay in July 2011. I’m just now getting a chance to write it. But write it I must.", "title": "It just dosen't get any better than this.", "helpfulness": 1, "user": "ifloat", "date": "March 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 126977358}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled on business", "text": "It simply does not get any better than the Conrad Chicago. I’ve had the privilege of traveling the globe and can comfortably say I’ve never stayed somewhere that impressed me as much. Service at check-in is not only friendly but quick. The breakfast (staff & food) are absolute knock-outs; you must try the fresh fruit plate, it’s heaping and better than anything I’ve had in the islands. The rooms are fabulous and the pillow menu is a must-try (I recommend Lavender). Trains are right around the corner, if you need them as the hotel is with-in easy walking distance of the Art Institute, Grant Park, Downtown, the waterfront, and The Gold Coast.", "title": "Nice business hotel", "user": "finnishbird", "date": "March 30, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 126967865}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "I won’t even consider another hotel when I need a place in Chicago. A stay here reminds me of how hotels used to treat their clients and the way they still should. Outstanding!", "title": "Amazing! Unbelievable! Stay here!!", "user": "vak_10", "date": "March 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 126910016}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled solo", "text": "Stayed overnight on Oct 16, 2011. This is a fine business hotel. My overall hotel experience was very good to excellent. The staff is excellent, was able to check-in at noon. My king bed room was average in size but well appointed. Clean with upper-end appointments including plush towels, great bedding, and large HD thin screen TV. Excercise room was relatively large with standard, modern equipment including free weights, balls, and treadmills. Restaurant looked nice but did not visit. Bar is relatively small but centrally positioned on the reception floor with a modern feel. The location is very good as the hotel is accessible elevator to 5th floor reception area via (North) Michagan Ave through a mall that houses Nordstrom. Intercontiental Hotel is across the street and Marriott hotel is a few buildings north up Michigan Avenue. I used honors points. I would stay again if the price is right.", "title": "Conrad Chicago 1 night stay", "helpfulness": 1, "user": "evergreenjoe", "date": "October 18, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119438936}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled on business", "text": "We stayed three times at the Conrad Chicago in July, August, and September 2011 and have generally been very satisfied with our experiences there. We also anticipate that we will stay at the Conrad Chicago for future visits to Chicago. Our rooms were all spacious. The TVs have Bose sound systems. The beds are comfortable. Conrad Chicago bathrooms are usually quite generous (although one room we were assigned had a significantly smaller bathroom about one half the size of other rooms we had been assigned). The bathrooms have a separate deep tub and shower and a separate room for the toilet. Service at the Conrad is quite good, and the staff is friendly, helpful, and very well trained. Internet access is free and fast as compared with most hotels where we have stayed. Although we had a problem during one stay with Internet access, we did not have any other major problems during our stays. Breakfast service at the Conrad Chicago could be improved because it is often quite variable. At times breakfast comes quickly, but at other times service is quite slow. We saw more than one customer actually walk out after being seated for extended periods without being served. As it may be difficult to predict the speed of breakfast service, we suggest leaving plenty of time for breakfast. The Conrad location is excellent. It is just north of the river and is in a complex that includes Nordstrom. It is centrally located in terms of transportation options (on Michigan Avenue near multiple bus lines and the Red Line) and is near a multitude of good restaurants.", "title": "Excellent Staff and Service", "helpfulness": 1, "user": "tsogl", "date": "October 16, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119350537}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled on business", "text": "Great location at the Conrad to take a good walk around the Shopping and Restaurants areas enjoying the good city air and smell. The service at the hotel is impecable from front desk till room service; although a little expensive. There was an emergency with a broken water pipe at a room next to mine and the maintenance crew reacted inmediatelly to fix the problem so next morning nobody knew there had been a problem.", "title": "Great comfort at the Conrad", "helpfulness": 1, "user": "ElviraCL", "date": "October 15, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 119338446}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "I really recommend it if you want to have a good memory of Chicago.", "title": "Great Location and Service!", "user": "TorontoTravelfan", "date": "October 15, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119332548}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled on business", "text": "I stayed at the Conrad for three nights recently and was very happy with my choice of hotel. The room was large which was great because I was traveling with two 16 year old girls. The beds were very comfortable and the bathroom was quite large. We also had a roll away bed put in the room ($20 extra a night) and it was very comfortable (an actual bed on wheels). The location was great. The hotel is attached to the mall on the Magnificent mile that has Nordstrom's in it. The service was excellent and my daughter particularly liked the complementary coffee station set up in the mornings as you leave the elevators to go to the lobby. It was very convenient to grab a coffee on your way out. In the afternoons they had some ice cold lemon water in the same spot. Just what you need when taking a break from shopping and sight seeing! The hotel is also close to lots of good places for breakfast like the Corner Bakery. I would definitely stay there again.", "title": "Another wonderful stay", "helpfulness": 1, "user": "busymomtraveller", "date": "October 13, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 119267052}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "Courteous front desk upgraded my room and provided the room upon arrival even though we arrived at 9:00am. Room is very clean, comfortable, and decorated nicely.", "title": "Very nice", "user": "Tabi101", "date": "March 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 126881522}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "Electrical plugs at the desk and night stand is very nice too.", "title": "The only hotel I will stay at in Chicago!", "helpfulness": 1, "user": "Casey H", "date": "March 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 126837808}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "I gave 4 stars only because there was no coffee or tea set in the room.", "title": "Conrad Chicago", "user": "Sasha_G_UK", "date": "March 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 126836115}, {"rating": 5.0, "stay_parameters": "Stayed March 2012", "text": "My wife and 6 yr old stayed here for 4 nights over Spring Break. Location, Location, Location! You really can't be in a better spot. Easy access to Michigan Ave, and a 15 minute walk to Navy Pier. The Chiacgo River is not even a block away and we took a boat tour ride just because we were in the right location. Probably the cleanest hotel room I have ever stayed in also which is a big plus. The lobby is on the 5th floor, because floors 1-4 are the Shopps at Northbridge with a Nordstrom as the main store there. Seriously how many 4 star hotels sit on top of an awesome mall? We only ate breakfast in the restaurant and the food was great. My son could eat the chocolate chip pancakes every day! I would recommend staying at the Conrad to anyone! Top Notch!", "title": "I LOVE staying at the Conrad.", "user": "Hhoffenberg", "date": "March 28, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 126811154}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "Excellent hotel in all respects. the only slight disappointment is that they don't have swimming pool in the hotel (but i think there is an option to go to sister hotel nearby).", "title": "Great Location", "helpfulness": 8, "user": "LVETOTRAVEL", "date": "March 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 126783294}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled on business", "text": "You will enjoy your stay at the Conrad in Chicago. Compares nicely with the four seasons.", "title": "you will like it", "user": "ives", "date": "October 23, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 119629266}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "hotel location was excellent; just right on the magnificient mile.", "title": "Perfect Location; Excellent Frontdesk staff", "user": "monato", "date": "October 23, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119614252}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled on business", "text": "the rooms were clean and so was the bathroom", "title": "Perfect location, perfect appointments", "user": "Jonathan F", "date": "October 21, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 119568698}, {"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled with family", "text": "bed was comfortable", "title": "excellent hotel", "user": "memantillam", "date": "October 21, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 119563875}, {"rating": 5.0, "stay_parameters": "Stayed October 2011", "text": "room service was excellent and prompt", "title": "Conrad Chicago - nice upscale option", "helpfulness": 1, "user": "fortwaynemom", "date": "October 20, 2011", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 119526070}], "location": {"country": "United States", "city": "Chicago"}, "stars": 4.5, "variance": {"poor": 27, "average": 87, "very good": 421, "terrible": 9, "excellent": 1341}, "aka": "Conrad Chicago Hotel", "slim_ranking": 0.0722891566265, "detail_rating": {"service": 4.5, "cleanliness": 5.0, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 5.0}, "description": "Complimentary Internet access in guest room, Complimentary remote WiFi printing, complimentary pillow selection from the Sleep Menu, Complimentary 'Conrad Chicago' App through iTunes, Complimentary daily coffee & tea service, Hilton Honors points and more... The Conrad Chicago hotel is a perfect downtown Chicago destination to experience the Magnificent Mile, ‘One of the Great Avenues of the World.’ The downtown Chicago location of the hotel is the ideal destination for shopping excursions within walking distance to the Mag Mile. Shopping Mavens will enjoy perusing leisurely through closely located Michigan Avenue retailers like Nordstrom, American Girl Place, The Shops at North Bridge, Water Tower Place, 900 North Michigan Shops, the Apple Store and Niketown Chicago. Our downtown Chicago hotel is within walking distance of many Chicago attractions, including Lake Michigan, Millennium Park, Navy Pier and the Museum of Contemporary Art Chicago, just minutes to the Loop-Chicago's historic business district, the Field Museum, Shedd Aquarium and Adler Planetarium. The contemporary residential style of the 312 guestrooms and suites combines a warm color palette with deep texture finishes and plush fabrics synonymous with Conrad Hotels & Resorts' signature décor. Each room features a custom-quilted headboard, pillow top mattress, bedding accents, ergonomic leather chair with ottoman, modern art, soft lighting, and spacious bathrooms with granite detailing. Additional amenities include 42-inch flat screen television, Surround Sound system, iPod alarm clock with docking/charging station,and complimentary nightly turndown service upon request.Guests of the Conrad Chicago can enjoy a choice of modern accommodations, including Deluxe, Executive, Deluxe Suite,Executive Suite and Terrace Suite. All 100% smoke free. The Conrad Chicago is a pet-friendly hotel. The Conrad team welcomes you to visit the Conrad Chicago Hotel in downtown Chicago and experience tailored service for the modern discerning traveler."}