{"user_rating": 4.0, "review_count": 69, "name": "Conyngham Arms Hotel", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled with friends", "text": "Recently re-opened under new management who have kept the character of the old building while giving it a fresh look. Met a friend for lunch. Menu offers good choice from club sandwich to 3 course lunch and prices ranged from five to thirty euro. Food was very good. Serving staff were pleasant and attentive though the reception staff needed to be more welcoming in a venue that has just reopened for business. We had a peek at the newly refurbished bedrooms which are beautifully decorated with en-suite.", "title": "Well worth a visit", "helpfulness": 2, "user": "NavanViewer", "date": "July 15, 2012", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0}, "id": 134413174}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "My wife and I stumbled across this hotel while trying to find Newgrange (the GPS was utterly confused - another story) on our last day on our trip in Ireland.", "title": "A beautifully revived GEM in Ireland", "helpfulness": 5, "user": "Il-uvatar2010", "date": "July 14, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0}, "id": 134386718}, {"rating": 4.0, "stay_parameters": "Stayed August 2012", "text": "My review is for lunch only in the newly opened hotel which has been bought over by the same people who own tankardstown another favourite place of mine. The decor in all the dining areas is beautiful with little finishing touches of candles and pretty clocks. The menu for lunch is not extensive or expensive certainly cheaper than tankardstown but something to suit most people even my vegetarian friend and a kids menu which kept my son happy. I had the club sandwich which was delicious. The service was good and friendly will definitely return soon.", "title": "Lunch", "user": "harryandbill", "date": "August 11, 2012", "detail_rating": {"cleanliness": 4.0, "location": 4.0}, "id": 136868066}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "My husband and I called in last Sunday afternoon to check out this establishment. We were frequent customers in the old days and always liked the hotel. When we called the place was buzzing and we were met with very polite staff who offered us a table, but we decided to sit at the bar as we didn't want a full meal. I had the ceasar salad starter,, which was delicious and filling and my husband had the roast beef from the lunch menu. This dish was plentiful and according to my husband very tasty indeed. We were looked after at the bar by Jason, whom I recognised from another establishment and he was a delight to deal with, professional and charming. I like a glass of lightly oaked chardonnay with my meal, they didn't have this, but what they did have suited me fine (just cannot recall the name of the wine at this moment). The decor is very appealing and the furniture and soft furnishings are similar to Tankardstown. Well done all and we will be back very shortly.", "title": "NICE TO BE BACK", "user": "Berna47", "date": "August 10, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0}, "id": 136797130}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled solo", "text": "I wasnt planning on staying in this hotel but had to for 1 night & boy am I glad I did, the last time I visited the hotel was about 4 years ago for Sunday lunch & was very disappointed - now however I can only praise this lovely little hotel.", "title": "Brief but excellant stay....", "user": "harryp44", "date": "August 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 136139102}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "All staff were very friendly, very helpful & courteous, my room was gorgeous - Room 1 although I shouldnt say that as I will never get the room again! Breakfast in the morning was delicious I have no negatives about this hotel.", "title": "Reopened, new management, really nice", "helpfulness": 3, "user": "Notmyrealname32", "date": "August 1, 2012", "detail_rating": {"value": 5.0, "service": 5.0}, "id": 135963260}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled on business", "text": "Little touches made the stay even better ie tea lights lighting all reception, room toiletries in lovely packaging.", "title": "Welcome Re-opening of Grand Old Hotel of Character in Slane", "helpfulness": 1, "user": "Erneside", "date": "July 18, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0}, "id": 134734234}, {"rating": 3.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "We stayed on a Sunday night for B&B. It was 130 euros. Our room was lovely. We had a four poster bed. The bed linen was far too heavy for a summer and we were sweltering overnight. There was no air conditioning and the windows barely opened. We had bar food in the evening. We thought the food was very nice, and reasonably priced. However the waiting staff seemed to be rushed off their feet, and after we received our main course, we did not see sight nor sound of anyone to take away our plates or suggest a dessert or tea/coffee. We left our seats and paid up. I had a full Irish breakfast the next morning and the food is very nice. My wife had pancakes and found them lovely too. The freshly squeezed orange juice tasted weird. It tasted like punch ! On the whole, the staff are nice. The place is only just opened, so any problems with staffing or service need to be given time to be addressed. Nobody was rude, just very busy. The pricing of the rooms is a bit off for a Sunday. We will definitely come back for dinner again, but we will give the rooms a skip as it is very dear for what you get. The new owners also own Tankardstown House which we believe is the last word. However, they are making a mistake, if they price the rooms too high at the Conyngham. If you are staying here, make sure to walk up Chapel Road and follow the signs for the Hill Of Slane. Exceptional views and a wonderful historical setting.", "title": "Stylish but expensive. Needs time to improve", "helpfulness": 3, "user": "BurstYourBubble", "date": "August 28, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 2.0, "sleep": 2.0, "rooms": 4.0, "location": 4.0}, "id": 138723447}, {"rating": 3.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "My partner is a local", "title": "Disappointed expected better", "helpfulness": 5, "user": "emo-9", "date": "August 25, 2012", "detail_rating": {"value": 3.0, "location": 4.0, "service": 4.0}, "id": 138352827}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "In slane.... Have been to tankards town house and food excellent so decided to try conyngham arms . We went for an evening meal we eat out a lot and I would be well into my food and cooking I got goats cheese tart to start.. Could barely taste any goats cheese onion marmalade was also disappointing.. My partner had the ribs.. They were not cooked enough and the dip tasted like mayonnaise not the blue cheese dip which was on the menu?! The main was ok I has sea trout it's was a bit watery . The problem I had we both had was no veg potato etc with main course it has to be bought as a side! A side is not basic stuff like this .... Should be included with the main, 3euro for a small portion of carrots to accompany meal.. I have to say a rip of in this economic climate.. The wine was lovely though we had the merlot. Disappointed it wasn't what we were hoping for...", "title": "'fantastic'...we will be back", "user": "kipclo", "date": "August 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 138318383}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled solo", "text": "Booked this hotel at the last minute as a half way stop between Malin Head & Waterford, it was recommended to us by the receptionist in Tankardstown House. From the moment we arrived we could see that this hotel was something special & this was backed up by a wonderful warm welcome.The hotel has been stylishly renovated with wonderful warm bright colours throughout, our bedroom was really lovely with a really nice comfy bed. We ate a superb meal in the restaurant, the home cured salmon was delicious and the fish and chips was without doubt the best we have ever eaten (their skinny homecut fries are also to die for). We met 3 lovely & chatty members of the team whilst we were in the restaurant for dinner. Breakast the following morning was also superb and again we were served by friendly & chatty staff. The quality of the food in this hotel is superb, they have put a huge emphasis on using local produce which is reflected in their menu. This is a beautiful hotel with great food and more importantly welcoming & friendly staff...we will definetely return again soon.", "title": "What a Gem!", "helpfulness": 1, "user": "fairlady4t", "date": "August 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 137576458}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "You must visit this hotel! Having attended a wedding at Tankardstown,(sister hotel) I got a last minute cancellation at this hotel for Bed and Breakfast. Beautifully decorated and quet room, in my own four poster bed. Even the toiletries provided were 'special' - (beautiful hand made grapefruit soap)", "title": "Great lunch stop", "user": "DublinKaty", "date": "August 18, 2012", "detail_rating": {"value": 5.0, "service": 5.0}, "id": 137568781}], "location": {"country": "Ireland", "continent": "Europe"}, "variance": {"poor": 2, "average": 7, "very good": 19, "terrible": 5, "excellent": 36}, "aka": "Conyngham Arms Slane", "slim_ranking": 0.666666666667, "description": "The Conyngham Arms Hotel is located in the heart of the historical village of Slane. Since January 2010 the hotel was taken over by the Redmond family who have guaranteed a new lease of life for the hotel. Serving breakfast, lunch and dinner daily it makes the perfect place to visit. There are 4 luxury 4 poster bed suites along with 11 standard rooms. It is an ideal location for a family or romantic getaway. The hotel boasts old world charm but also has all the modern services that guests require."}