{"user_rating": 4.5, "review_count": 1150, "name": "Copacabana Palace Hotel by Orient-Express", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled on business", "text": "I am very fussy, but have no complaints about this stay. I booked with Amex Platinum which included breakfast, a possible upgrade and amenity. The rate was not much above the hotel internet rate. (about $415.00 per night including tax) Sure enough I was upgraded to a suite (I asked if it was possible) in the building overlooking the pool and ocean and given the amenity of two free massages! That is the best amenity I have ever seen in the program and the they were excellent! There was also no charge for the internet.(Intercontinental hotels are off my list for this reason) The front desk, Linea especially, was expert and professional. Note the closest ATM for Americans is in the train station about two blocks away. Local bank ATMS will not work. There is an excellent hair salon Camarim, around the corner that is reasonably priced. The Cipriani Restaurant, in the hotel, was excellent and obviously has a different chef from the hotel kitchen that provides room service. The room service food (dinner one night) was very average. I made an interesting day trip to Petropolis. The concierge was quite helpful. Speaking directly to car drivers will save you money especially on your return trip to the airport. For those who may be concerned about safety.....I always felt completely safe in this hotel and when working with their drivers.", "title": "They could not have been nicer!", "helpfulness": 1, "user": "celebrationtiger", "date": "May 16, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 64290507}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled with family", "text": "We spent one night in the hotel. It is perfect!", "title": "Excellent", "helpfulness": 1, "user": "Vinicius N", "date": "April 26, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 62542917}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled with family", "text": "Excellent Staff, great room, great pool and good beach service.", "title": "\"A Magic Place\"", "user": "Dehoare", "date": "April 22, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 62126708}, {"rating": 4.0, "stay_parameters": "Stayed April 2010, traveled solo", "text": "We just had wonderful time at this fantastic hotel in Rio.", "title": "old world luxury and comfort but some services especially concierge needs attention", "helpfulness": 2, "user": "paul026", "date": "April 21, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 62101619}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "It is a hotel with \"a soul\"...\"a magic place\"", "title": "Copacabana Palace Wedding", "helpfulness": 1, "user": "rafkam", "date": "April 21, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 62055350}, {"rating": 3.0, "stay_parameters": "Stayed April 2010, traveled with family", "text": "Stayed at the Cop for 10 days at easter. During the worst weather that Rio had ever seen!! The hotel is an old charming hotel, but we had ocean view suites in the main building and found the suite very dark and certainly not up to the standard of most 5 star hotels. The new tower block seemed to be a lot more modern and airy and the suites all have balconies. Food in the hotel is excellent and the breakfast buffet certainly can't be faulted. The waiting staff at night at the garden bar were very friendly especially Andre who knew exactly what we wanted to drink every night. The hotel gneral manager Andrea and her team were always very friendly and nothing was a problem to them. The only thing i think this hotel lacks is a little bit of 21st century 5 star, i understand it is a heritage hotel with charm and character but so is the Carlton in Cannes and it far surpasses the luxury feel of the Cop. Rio on a whole i would not recommend it is a very dirty city and the crime rate makes you feel very unsafe. The beach area is not the cleanest in the world and the sea is very dangerous as the tide and the currents make it very difficult to swim, non swimmers or weak swimmers should not attempt to take on the sea in this area.", "title": "not 5 star anymore", "helpfulness": 1, "user": "nikkistewart", "date": "April 16, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 61661757}, {"rating": 5.0, "stay_parameters": "Stayed February 2010", "text": "Beautiful stay with front beach view. Room with separate sitting room and bedroom. Morning buffet breakfast has a large assortment to choose from, and setting in a garden style right off the pool.", "title": "Old Royalty beauty with new upgrades in some areas.", "user": "acuni", "date": "April 5, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 60472083}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "Bar drinks very expensive. Service was great in all areas, particular the room maids.", "title": "Grand Old Hotel", "helpfulness": 1, "user": "PoisonPrincess", "date": "March 16, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 58749421}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled with friends", "text": "We stayed in this icon for our first visit to Rio; beautiful, elegant and superb service! This place allows you to experience the beach culture of Rio while being absolutely pampered by fine service. Nothing was too much trouble for the staff, who were always friendly and helpful. I was particularly impressed at the beach. The hotel has their own area (identified by certain color of umbrellas). The beach attendant provided towels, umbrellas, cold bottled water, refreshing snacks and even sprayed the sand with water so our feet would not become too hot! So, could I tell that the bathroom was not circa 2010? Yes, but so what? I would love to return to this great hotel.", "title": "Love the Copa!!!!", "helpfulness": 1, "user": "GoldStandard1", "date": "March 14, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 58558924}, {"rating": 4.0, "stay_parameters": "Stayed February 2010, traveled with family", "text": "This was our first trip to Rio de Janeiro and I’m happy we stayed at the iconic Copacabana Palace. The hotel met all our expectations. The service was superb in all areas of the hotel.", "title": "Nice property but service is lacking", "helpfulness": 1, "user": "Claes71", "date": "March 12, 2010", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 58369469}, {"rating": 3.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "We spent 3 nights of our honeymoon at the Copacabana Palace and were disappointed to say the least. We left the amazing Hotel Santa Teresa also in Rio, to spend our last 3 nights in this city for what we hoped would be a spectacular hotel to finish off our honeymoon in style.", "title": "Disappointing and Overrated", "helpfulness": 4, "user": "mgirishrover", "date": "June 25, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 1.0, "sleep": 3.0, "rooms": 1.0, "location": 5.0}, "id": 68634711}, {"rating": 4.0, "title": "Great Hotel", "text": "The building itself is extremely impressive from the outside, however the interior is dated and in need of refurbishment. After checking in, we went to our room which disappointed us, it was like walking onto the set of an episode from Hercule Poirot. It was old fashioned and tired, and after paying USD 500 a night to stay here without breakfast, it was overpriced. For a 5 star hotel our room didn’t scream luxury. The room had 2 single beds and a large flat screen t.v. which was placed at the base of our beds making it awkward to move around this section of space. The carpet was worn and the décor was in dire need of a revamp, in general there was little to write home about with this room. The bathroom was sizeable with marble tiles from floor to ceiling and was plentiful with towels and toiletries; it was the only part of our room which suggested that we were indeed staying in a luxury hotel.", "helpfulness": 1, "user": "luizbranco", "date": "May 25, 2010", "id": 65295913}, {"rating": 3.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "We did however enjoy the pool area. It was extremely relaxing and had a good bar and food service. We didn’t even stray over to the beach as we didn’t want to leave this oasis of calm! They provide guests with towels and pillows to ensure an even more comfortable rest on the sun loungers! The hotel is located directly across the road from Copacabana beach which is beautiful, they also have an area reserved on this beach for guests only which is an added bonus.", "title": "Cannot claim 5 diamond status! A shame", "helpfulness": 5, "user": "Disney76", "date": "May 24, 2010", "detail_rating": {"service": 2.0, "cleanliness": 5.0, "value": 1.0, "sleep": 5.0, "rooms": 2.0, "location": 4.0}, "id": 65218308}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "On leaving the hotel going to the airport, we were asked by one of the hotel’s porters if we needed a taxi. He offered us the hotel taxi at a set rate of BRL 120 which we declined as we felt it was too expensive. He returned a moment later and offered us a “special rate” for the hotel taxi, it was now reduced to BRL 80, again we declined and hailed a taxi from the street. It cost BRL 37 to get to the airport in heavy rush hour traffic so please be warned, there’s nothing attractive about their “special rate”.", "title": "AMAZING", "helpfulness": 1, "user": "BANMK", "date": "May 23, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 65105557}, {"rating": 4.0, "stay_parameters": "Stayed April 2010, traveled on business", "text": "In general I feel this hotel is somewhat living off its reputation of its past luxury. In contrast with other hotels in this category, the Copacabana Palace isn’t in the same league; it was only an ok stay with a 5 star price tag.", "title": "The Grand Hotel of Rio, but expensive", "helpfulness": 1, "user": "JerseyBean007", "date": "May 17, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 64429059}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "I've lived in Rio for twenty years but am now moving to another city. So I decided to make our last night as residents of Rio one to remember for my wife and me. Where else but here? Booked a room with sea view for the one night and they upgraded us to a junior suite. The weather was poor (rained nearly all the time) but the room was wonderful, especially the soundproofing. We ate at the Pergula restaurant and that was excellent too.", "title": "Great way to leave", "helpfulness": 2, "user": "JeffStranks", "date": "December 12, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 121659511}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "Found the service to be fine but then we weren't there long. Expensive it certainly was, but as far as I'm concerned, worth it.", "title": "Outstanding experience, perfect location, professional staff", "helpfulness": 3, "user": "coockie", "date": "December 6, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121466224}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled on business", "text": "My husband and myself spent 3 nights in the hotel from 19th November till 22nd November. As we had an early flight arriving to Rio, our room was not ready when we arrived to the hotel. However, they gave us the possibility to take a shower and get changed in the Spa which was welcomed after a 10 hours flight from Europe. We had room 756 with city views and it was extremely clean and well maintenanced. The bathroom was huge and with lots of toileteries.", "title": "It is THE hotel on Copacabana beach but...", "helpfulness": 3, "user": "cjatlanta2", "date": "December 3, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 2.0, "rooms": 5.0, "location": 5.0}, "id": 121348286}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled on business", "text": "All staff from the hotel were professional and always trying to satisfy your needs. On our last day we had an issue with the tour operator that should bring us to a 8 hours tour ( please keep away from Ipacom Tours!!) and they didn't show up or,at least call, to say that the tour was cancelled. We raised our concern to the concierge and he organised us a private tour with an English speaker driver in 10 mns! It was great as even if we had to pay a lot more for a private driver, we manage to visit the placed where you must go in Rio: Corcovado; Sugar Loaf and Mirador de Santa Marta. We highly appreciate the pro-activity of the Concierge of the hotel (I'm afraid I can't remember his name but he was pretty tall, maybe Luciano)", "title": "Smooth as the Bossa Nova", "helpfulness": 2, "user": "FranknDebbie", "date": "November 29, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 121211401}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "We did not have breakfast at the hotel as we usually take a croissant and a coffee in the morning. Therefore, aprox 35 eur per person for breakfast was pretty expensive. We used to go for breakfast to the coffee bars around the hotel.", "title": "Incredible. Plain and simple.", "helpfulness": 2, "user": "Alex K", "date": "November 28, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121142174}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "We arrived midnight but received excellent welcome and exactly the room we had booked- de luxe with sea view. Wonderful view of Copocabana beach and large airy room with perfect air conditioning and high ceilings. This hotel is built in the style of Carlton Hotel in Cannes. Wonderful, large swimming pool, excellent breakfast choice and pricy but good dinners, with choice of outside or inside dining. Very professional service and lovely ambience in all public rooms. Very helpful concierge for booking tours. We stayed 3 days followed by a Silversea cruise and other passengers complained about stays in different Rio hotels but every one who had stayed at Cop Palace was delighted", "title": "excellent 5 star hotel", "user": "QuentinUk", "date": "March 6, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 57856043}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "Stayed there for 2 nights. We had booked an ocean view room and were offered a free upgrade to a junior suite. Room was excellent and the service outstanding. We had a wonderful time and highly recommend this hotel. Nice swimming pool, pleasant dinner at the Cipriani.", "title": "Superb", "user": "Themis_13", "date": "February 22, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 56771162}, {"rating": 4.0, "stay_parameters": "Stayed January 2010, traveled on business", "text": "Beautiful property", "title": "Famous, historic, beachfront, great hotel.", "helpfulness": 1, "user": "JacquieCrouse", "date": "February 22, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 56723087}, {"rating": 5.0, "title": "A great hotel at a great location", "text": "Across the street from Copacabana Beach", "user": "taups", "date": "February 4, 2010", "id": 55212430}, {"rating": 4.0, "stay_parameters": "Stayed November 2009, traveled with friends", "text": "Very good service, great food, nice atmosphere", "title": "Best hotel in Rio", "user": "Karlhansen", "date": "January 31, 2010", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 54879282}, {"rating": 3.0, "stay_parameters": "Stayed November 2011, traveled on business", "text": "Sloppy service, no coffee but there is a kettle? Tough if you don't speak Portuguese.", "title": "Orient express-really?", "helpfulness": 3, "user": "globetrotterplus", "date": "November 28, 2011", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 121129379}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "Food poor and service very slow.", "title": "Great hotel in a beautiful city", "helpfulness": 2, "user": "LauraP186338", "date": "November 26, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121062729}, {"rating": 3.0, "stay_parameters": "Stayed January 2011, traveled with family", "text": "Nice old building though.", "title": "Beautiful Hotel - But....", "helpfulness": 3, "user": "beachbug", "date": "November 25, 2011", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 3.0, "sleep": 1.0, "rooms": 5.0, "location": 5.0}, "id": 121027563}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled solo", "text": "We stayed in a junior suite (pool ocean view) at the Copacabana Palace in November 2011. The hotel was immaculate and the staff were incredibly helpful - In particular, the man in the green t shirt by the pool (sorry we can't remember his name!) was really nice to us when we arrived giving us a fruit platter and generally being helpful throughout our stay, remembering our names and small details, which we must have mentioned at some point, which was a really nice touch! Would definitely recommend this hotel.", "title": "Totally Opulent", "helpfulness": 1, "user": "Lalcee", "date": "November 24, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121007736}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled on business", "text": "Tried the restaurant (Pergula) and the food was some of the best we had during our stay at Rio. We also tested out the night club (although it was quite quiet when we were in there).", "title": "The Grande Dame hotel in Rio", "helpfulness": 1, "user": "Roadwarrior1000", "date": "November 24, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120994192}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "My husband and I just got back from an 11 day honeymoon in Brazil. Rio was our last stop and we were spending 2 nights in the Copacabana Palace Hotel. We arrived late (about 10:00 p.m.) and check in was fast and friendly. They even upgraded us to a beautiful suite for our honeymoon. We were just blown away by the room itself and the charm and ambience of the hotel.", "title": "Wonderful way to end our honeymoon", "helpfulness": 1, "user": "snydeka", "date": "November 15, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120636806}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "We decided to have a late dinner at Cipriani Restaurant in the hotel. It was a wonderful experience. Both the serivce and the food was top notch. To top our meal off, they offered us a complimentary dessert.", "title": "Joyous, superb hotel!!!", "helpfulness": 1, "user": "stillersLondon_UK", "date": "November 15, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 120608105}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled with friends", "text": "The location is ideal for getting around Rio.You are right on Copacabana beach, within walking distance to various restaurants and shops and a short taxi ride from most major attractions.", "title": "It doesn't get any better than this!", "helpfulness": 2, "user": "David M", "date": "November 8, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120344683}, {"rating": 5.0, "title": "Enjoy the luxury for an hour!", "text": "It was just a wonderful, relaxing enviroment and the perfect way for us to wrap up our honeymoon. We are already talking about going back to visit for our 5 or 10 year anniversary.", "helpfulness": 1, "user": "mau083", "date": "November 5, 2011", "id": 120188162}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled on business", "text": "Wow is all I can say. I loved this hotel and my first ever trip to Rio. We stayed for 10 nights in early November and loved every minute. The hotel was grand and made you feel like a somebody every time you walked through the door. People outside having their photos taken with the hotel in the background gave a real sense when you walked through the door of exclusivity.", "title": "Old-fashioned Grand Hotel", "user": "Dagger0815", "date": "October 22, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119594671}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled with friends", "text": "In general I prefer smaller boutique hotels over large ones, but I am sensitive also to standout, innovative newish hotels of any size, or to great old icons. Copacabana Palace fits of course into the old icon category, and yet its not just an old dinosaur, I can say the place is still super-lively, giving the guest the sense of really being in the tourism ‘heart of Rio’ (where a celebrity might pop up at any moment!). But as lively as it is, and impressive as the 100-year-old building remains, its not enough to earn this my choice as favored place to stay in the city", "title": "Great iconic old hotel, but not my first choice in Rio", "helpfulness": 5, "user": "alwaysapleasure", "date": "October 13, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 119250992}, {"rating": 1.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "In fact in recent trips to Rio the past couple years for leisure I’ve started to stay in the Santa Teresa neighborhood, just a much much more local energy and actually much better for taking strolls around than staying on the beach (and full of nice little restaurants and bars). With a group of friends on this September trip everyone wanted to be by the beach, and I hadn’t been in Copacabana in years, so here I found myself", "title": "Amazingly horrible service!!", "helpfulness": 13, "user": "irxraydoc", "date": "October 11, 2011", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 2.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 119168433}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled on business", "text": "The hotel is probably in better physical shape than when I visited around 5 years ago. With my group I saw 3 different rooms, all in great condition. However the old rule here remains as what a friend told me the first time I stayed; do not even consider getting a room that doesn’t have an ocean view. The city-view rooms just don’t even feel like being in Copacabana. Just pay the extra and see the sea, well worth the money", "title": "Outstanding hotel in Rio, deserves number 1 position", "helpfulness": 2, "user": "RonaldvanderBoom", "date": "October 3, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 118882222}, {"rating": 5.0, "stay_parameters": "Stayed October 2011", "text": "The rooms are classical in decor, and even though my oceanview suite seemed to have been redone fairly recently (with some impressive sound-proof windows) there was no awkward insertion of modern touches that just never seem to fit in these places. Nothing spectacular to write about regarding the décor of the room, but the size was pleasant enough", "title": "Superb base for rio", "user": "em2ray", "date": "October 1, 2011", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 118813428}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "The restaurants of the hotel are very good, though one is northern Italian and I don’t visit Rio to eat that (though I did dine-in as was too tired to go out day-of-arrival and the food was excellent). Breakfast is great, and actually nice for people-watching as breakfast and afternoon tea are in the area near the pool, and this is really perhaps the most iconic feature of the hotel. The pool is just giant and pretty spectacular, big enough for really getting a workout even if one chooses to swim laps, though most seem to just lounge around here and it's a nice way to pass a day", "title": "Stay in style", "user": "Kanwalkwilltravel", "date": "September 24, 2011", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 118545070}], "location": {"country": "Brazil", "continent": "South America", "city": "Rio de Janeiro"}, "stars": 5, "variance": {"poor": 28, "average": 76, "very good": 250, "terrible": 13, "excellent": 783}, "aka": "Copacabana Palace By Orient-Express Hotel", "slim_ranking": 0.00980392156863, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "An elegant hotel located alongside the beach, convenient to business & entertainment districts. Copacabana Palace has a great variety of accommodation with a majority of suites, which have recently been re-designed and given a new lease of life with new fabrics and furniture. The hotel has a marvellous Semi-Olympic Size Pool, one Tennis Court, a modern Fitness Centre, a three-floor Spa and a new Lounge Bar 'Bar do Copa' open from Wed to Sat with a selection of DJs playing each night. The Hotel Cipriani Restaurant is the hotel's gastronomic flagship, a sophisticated Italian restaurant serving classics and innovative dishes from the restaurant’s namesake in Venice. The Pergula Restaurant serves Brazilian Buffet breakfast, lunch buffet and dinner a la carte by the pool. Copacabana Palace offers you a great and unique experience in the heart of Rio de Janeiro."}