{"user_rating": 3.5, "review_count": 490, "name": "CopenHagen Plaza", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "As soon as we entered the lobby we were greeted with smiling faces. & check in was hassle free The rooms were small , the furniture was well placed so we didn't bump into one another. Extremely clean. facilities, comfortable bed and a terrific view of Tivoli Gardens.", "title": "The Plaza", "user": "grammebaby", "date": "September 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 175535543}, {"rating": 3.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "Just back from 3 nights stay at The Plaza. The good points; right next to the central train station so need for a taxi from the airport. Check in was swift, easy and efficient. The lift is a bit quaint but at least it has one. The room is clean and tidy though very worn (loads of scuff marks in the paintwork and along the walls, the bed-spead is so worn it has many holes in it. Despite this the linens are fresh. A bit bizarre for a Brit but the double bed comes with two single duvets. Works for me as the wife could not steal my half. Rooms have WIFI and it works though you have to log in each time and it is slow - I stayed on 3G in the end. Very central location. Literally next door to Tivoli gardens and all the key sights are within walking distance of the hotel. We did not use one taxi while in Copenhagen. Bathrooms are pretty basic but just about functional. No shelf in the shower is always a pain...", "title": "It's fine for central Copenhagen", "helpfulness": 1, "user": "Neil P", "date": "September 3, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 2.0, "location": 5.0}, "id": 175527449}, {"rating": 3.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "Breakfast was fine. In fact pretty good but loses marks for not having a toaster (yep, no toaster in the hotel!). Apart from that the buffet has something for everyone and the food was good, fresh and reasonable quality. It gets busy at peak times and be ready to be close to your neighbour or sharing a table....", "title": "great location. Dated hotel", "helpfulness": 1, "user": "stentdoc", "date": "September 2, 2013", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 1.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 175327533}, {"rating": 2.0, "stay_parameters": "Stayed August 2013, traveled with friends", "text": "Great bar (The Library) - exudes atmosphere. We timed out but well worth a visit.", "title": "Glad it was only one night", "user": "irishdpd55", "date": "September 1, 2013", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 2.0, "rooms": 1.0, "location": 3.0}, "id": 175061767}, {"rating": 3.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "I suppose I am borderline Average to Very Good. The reason for average is against the hotel rating and price versus the quality of rooms (always a key measure) I am going for an \"average\". The hotel is OK but tired and in need of a revamp.", "title": "disappointed", "helpfulness": 1, "user": "livemusictouring", "date": "August 29, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 2.0, "location": 5.0}, "id": 174625364}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "We took this hotel because of its location, next to the main train station, easy access to Tivoli park, tour buses around the corner, tourist office and walking distance to the city center. The room was quite spacious, clean, good bed, well insulated, with good internet connection. The breakfast was good, a good selection. It may be worth considering to separate families with children, as it does get very irritating when you have screaming kids early in the morning! Otherwise, we like the hotel, and their service.", "title": "Perfect Hotel!", "user": "Adelaida Gigi P", "date": "August 25, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 174018500}, {"rating": 4.0, "title": "Excellent Locatiom!", "text": "This property is 100 years old ... Very quaint and comfortable. Excellent location just a few steps from central station. We walked everywhere. Would definitely stay here again. Staff is super friendly.", "user": "mmdy", "date": "August 25, 2013", "id": 173967120}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "This hotel came up on several internet searches and when I checked with a local friend, he confirmed it was a great spot. It was indeed the perfect location for our three day stay and close to everything we needed...including the train station. If you are traveling without a car and are using the train station you can't ask for a more convenient location. It was within walking distance to Tivoli Gardens and we were able to walk to Nyhaven...it took about 20 minutes but we didn't mind. Rosenborg Castle (must see) was also within walking distance. The staff was friendly, our room was spacious and clean, and the complimentary breakfast that was included with our stay was perfect. We had a room on the 4th floor that had a balcony which allowed us to view Tivoli's fireworks from our balcony. Overall, I would recommend this hotel to all who are visiting Copenhagen.", "title": "Perfect location with all the amenities we needed", "helpfulness": 1, "user": "chefbynature", "date": "August 17, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 172735197}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "This is a great hotel in a great location. plaques in the reception showing all the famous people that have stayed there and I can see why. It is near the station, Tivoli gardens, buses and shops including the hard rock cafe which was a great place to eat.", "title": "Great location", "helpfulness": 1, "user": "Patricia T", "date": "August 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 170791175}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "We recently spent four days in Copenhagen. This was our first visit to Denmark and we will certainly go again! The City is clean, well laid out (although a great deal of building work is being undertaken at the present time in connection with the metro). Tivoli Gardens are a delight and this hotel is directly opposite to the Gardens so you get the added advantage of seeing the Fireworks from your hotel room if you request a room on the front of the building. The hotel is literally 5 minutes from the railway station - ideal after a flight! The hotel is clean, comfortable and the breakfast fantastic. We would thoroughly recommend this hotel to anyone planning to visit Copenhagen.", "title": "Great Place!", "helpfulness": 1, "user": "southportsooty", "date": "August 4, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 170705049}, {"rating": 1.0, "stay_parameters": "Stayed September 2013, traveled on business", "text": "Stale urine in the toilet and apparently it's my responsibility to find an iron and ironing board!", "title": "A £200 travelodge", "helpfulness": 1, "user": "Shaun S", "date": "September 11, 2013", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 2.0, "rooms": 1.0, "location": 5.0}, "id": 176769177}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "Staff were not especially helpful and blamed my companies party for hem being so busy. Incredible for a capital city.", "title": "Good hotel, great location", "user": "Dr Y A", "date": "September 11, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 176745977}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "Kitsch, overpriced and dirty. Avoid like the plague.", "title": "Nice Hotel", "user": "Thombtc", "date": "September 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 176531039}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "An old style, lovely hotel with wood panelling & a 1930 feel to it. Could benefit from a bit of refreshing. It is in a great location, close to the central train station & opposite Tivoli. The bar is full of character & a great place to spend an evening listening to some jazz. Choose a room on the side facing the Tivoli. We stayed in room 605. It is a sort of an attic room but it has a wall of windows giving you a panoramic view of the city& Tivoli gardens. Just amazing.", "title": "Great Location", "user": "Marianne B", "date": "September 5, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 175873775}, {"rating": 3.0, "stay_parameters": "Stayed September 2013, traveled with friends", "text": "Definitely consider this hotel for location and service. We wanted to know if a taxi was needed to get to a certain restaurant or if we could just walk it, and the concierge got out a map and his computer, showing us the location and how we would walk there. Very helpful!", "title": "Not What expected", "user": "Cecilia D", "date": "September 4, 2013", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 175808064}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "I enjoyed this hotel. We had a room on the first floor, which isn't the main floor of the hotel, but one above. Our room had a balcony on the Tivoli side, not directly across from Tivoli, but when Tivoli fireworks went off at midnight we had no problem seeing them! The room was small but adequate. It was clean. There were several closets, which was great because we had several suitcases to put away. There was a mini fridge, and it wasn't one of those that cost something if you lift up an item, this was more of an honor system, you wrote down what you used and tell them later. The breakfast buffet was free and offered the standard breakfast. Breads and coldcuts, some fruit and hot offerings of eggs and bacon. Also yogurt. It was busy and I did notice a shortage of forks, and had to wait, but it wasn't too long a wait. I was able to find tea, I saw one review that said no tea, but I did find some. I would stay again. This hotel had a bar that I would have loved to sit in, but with a 3 year old, I didn't find the time to sneak away.", "title": "Plaza stay", "user": "lola72", "date": "September 16, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 177449822}, {"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled on business", "text": "Not sure what people expect when they book a hotel that was built 100 years ago. Of course this is not the Marriott or Hyatt. Rooms were quaint and very basic, but unless I was blind I never had a problem with it being dirty. I arrived for a business trip only to find out that my travel agent didn't book me in as requested. The staff behind the desk were so helpful and instructed me they could give me a room for only 1 night, and that I can ask in the morning for an extension as they were full for the rest of the week but there were always cancelations so you never know. Luckily for me there was and I got to stay for 2 nights here. My room was on the 3rd floor, elevator was out of action day one but used service lift which was fine by me. Breakfast was good and basic. Had hot coffee and food was fresh. Location was excellent next to train station, although a fair walk from my office, but that was fine by me. All in all a pleasure to stay here in such an historical building. Just dont expect it to be 5 star, like some people here. I think the staff and the owners have done a great combination of keeping the heritage look and feel and modern enough to make most people comfortable.", "title": "Had a pleasant Stay", "user": "LittleRedBug", "date": "September 16, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 177325169}, {"rating": 2.0, "stay_parameters": "Stayed September 2013", "text": "Stayed at the Plaza for 1 night.", "title": "Not helpful, not clean, not new", "user": "Suzzie0", "date": "September 14, 2013", "detail_rating": {"cleanliness": 1.0, "value": 2.0, "location": 4.0, "service": 2.0, "rooms": 2.0}, "id": 177083524}, {"rating": 2.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "Everything is old and well used. My bathroom hadn't been cleaned properly as there was still woman's make up splattered up the wall. There was a lack of hot water and upon emptying the bath the water came back up through a drainage pipe and flooded the floor. Staff did not seem too rushed to assist. I was eventually given another room but had to go down to reception to fetch the key and move myself. The new room was tiny but a bit cleaner.", "title": "Desparately Needs to be Renovated", "helpfulness": 1, "user": "hanna_10", "date": "September 13, 2013", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 1.0, "sleep": 3.0, "rooms": 2.0, "location": 5.0}, "id": 177074946}, {"rating": 3.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "Whilst at the conference a number of requests were made for more coffee which took ages to come, water which they eventually brought us but then they never brought any glasses.", "title": "Really a 3 1/2 stars.", "user": "CTKath", "date": "September 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 176942465}], "location": {"country": "Denmark", "region": "Zealand", "continent": "Europe", "city": "Copenhagen"}, "stars": 4, "variance": {"poor": 37, "average": 117, "very good": 212, "terrible": 23, "excellent": 101}, "aka": "Copenhagen Plaza Hotel Copenhagen", "slim_ranking": 0.330275229358, "detail_rating": {"service": 4.0, "cleanliness": 3.5, "value": 4.0, "sleep": 3.5, "rooms": 3.5, "location": 4.5}, "description": "Traditional Club-like Hotel with classic, grand-hotel ambiance, built by King Frederik VIII."}