{"user_rating": 4.5, "review_count": 552, "name": "Copthorne Hotel Commodore Christchurch Airport", "reviews": [{"rating": 3.0, "title": "good hotel", "text": "Whilst near to the airport this proved no problem in getting about into Christchurch. Get from the airport via free hotel shuttle and phone near the airport doors and 10 mins later your there. Friendly family run hotel. Good enough standard rooms but we didnt get the business rooms which others wow about. A good restuarant with good reasonably priced food. The hotel will give you a free pass into town via the bus stop outside (20 mins). Hotel pool was useful with good hot spa bath but sauna never got up to temperature. HIghly recommend a drive of the ridge top road past the gondola if you have a hire car. Better than the gondola and superb scarey views. The original settlements on the other side have super beaches and worth the visit as Christchurch was lovely but a bit sleepy when we were there.", "helpfulness": 2, "user": "watchitLondon", "date": "September 8, 2007", "id": 8677125}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "From the minute we were collected by the hotel shuttle the friendly hotel service started and didn't finish until were were dropped off at the airport the next day.", "title": "Friendly Staff, Great Food & Comfortable Rooms", "helpfulness": 2, "user": "Jetboy787", "date": "August 23, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 8483369, "likes": {"liked": "— Friendly Staff"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled solo", "text": "Arriving at 9.30pm after a long flight the driver asked if we required a meal and called ahead to make sure the kitchen did not close until we had arrived. Only 2 minutes from the airport, this hotel is popular with airline staff and the rooms large and nicely appointed.", "title": "Nice hotel, eventually, despite the cat", "helpfulness": 2, "user": "Irish_Jet_Set", "date": "August 17, 2007", "detail_rating": {"front_desk": 2.0, "business": 4.0, "service": 4.0, "cleanliness": 3.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 8441567, "likes": {"liked": "— The 'Business Level' Room", "disliked": "— The filthy cat that lurked around and on reception desk, disgusting!"}}, {"rating": 2.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "Having read the very positive reviews on this site we booked the hotel direct on the internet. The reception staff were very friendly and welcoming, our room very comfortable, but the continental breakfast was most disappointing with very little choice. We drew this matter to the attention of the Duty Manager, who assured us he would look into the matter. Not the best start to our holiday.", "title": "First night in South Island", "helpfulness": 3, "user": "Nerano", "date": "March 8, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 3.0}, "id": 6935559, "likes": {"liked": "— Locatio-near airport", "disliked": "— The breakfast"}}, {"rating": 5.0, "title": "Great Place to Stay -- Will do so again", "text": "Great hotel where the staff goes out of their way to meet your needs -- had co-workers stay here & recommended the location. Hotel is close to the airport and approx 5 miles from center of town -- hotel provided free bus passes that take you into town. There is also a hotel shuttle that is willing to take you to close attractions (Antarctica Museum -- must see) and other places you'd like to go. Room, hospitality and ammenities (pool, jacuzzi and food) are excellent -- you will not go wrong staying here. The Patterson's (General Manager) and the staff make for wonderful stay.", "helpfulness": 1, "user": "FoxTraveler", "date": "March 8, 2007", "id": 6932710}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "To be honest, I was sceptical about booking an airport hotel but decided to give it a go after reading the reports on this site. I am so glad I did. It is brilliant! So much so, that I changed a future booking that I had made for another hotel in Christchurch so that I would be able to stay here again a few weeks later.", "title": "One of the best", "helpfulness": 5, "user": "megsnan", "date": "January 3, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6546758, "likes": {"liked": "— Comfort, food, location - everything!", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled with family", "text": "On the first stay, we were collected from the airport after calling from the courtesy phone. At the hotel we were greeted by cheerful, friendly reception staff and directed to our room. When I had made the booking, the rate was so good that I had not realised it was for the business floor. What a room! The bed was the most comfortable I had slept in for years, the sheets crisp and white, the TV was huge and there was a comfortable sofa, and a desk. But, it was the bathroom that amazed me, with a huge bath, a walk in shower and a big window between the bathroom and the bedroom so that you could lie in the bath and watch TV, with the sound piped in to the bathroom. Of course, it worked the other way, so you could lie in bed and watch your partner in the bath (or worse) but there was a switch on the wall which lowered a blind for privacy.", "title": "Stay there!", "helpfulness": 2, "user": "antmel", "date": "December 20, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 6476973, "likes": {"liked": "— Location and helpful staff", "disliked": "— Some room were dated"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled solo", "text": "When I made the second booking, I was given the same rate as I was an existing guest but this time the room was a brand new business room and even better than the first. The bed was as comfortable as before, and the hotel is so proud of the beds, they even offer a service where you can buy one. I wasn't sure they would mail it to the UK for me though! The room had a run of cupboards along one wall which concealed drawers, hanging space, fridge and tea/coffee making equipment but the doors were hinged so that they swung completely out of the way when necessary, and the interior was lit. This time the bathroom had the same big window but the shower and loo were contained within their own frosted glass cubicles which gave a bit more privacy without having to keep lowering the blind. If you really didn't want to be seen in the bath there was still an electronic blind.", "title": "Definitely recommend (especially if using Eye Clinic option)", "helpfulness": 3, "user": "KiwiKong", "date": "December 19, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 6473807, "likes": {"liked": "— The free shuttle service from the airport and to the Fendalton Eye Clinic, attentitive staff", "disliked": "— No complaints."}}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "The Commodore was a great place, and is highly recommended whilst in Christchurch. It is about 5 minutes from the airport, but you don’t hear the planes at all. The room was quite large, and the grounds peaceful with landscaping.", "title": "Friendly, comfortable place", "user": "MikeBoulder", "date": "March 9, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6938268, "likes": {"liked": "— Friendliness of staff"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "I booked this hotel after reading the reviews on this web site and we were not disappointed. Stayed here with my husband for 3 nights after two and a half weeks on the South Island before flying back to UK. The staff were lovely, very friendly and helpful - no request was too much - courtesy transport to Antartic Centre and Airport and free bus passes into the City - approx. 20 mins by local bus. The restaurant was excellent - can highly recommend the beef fillet! Room was very nice and bed extremely comfortable. We made good use of the hotel pool - plenty of clean towels. The only down side was the weather on our first day - but hey, not much the hotel could do about that! I would recommend this hotel without hesitation and will definately stay there again on our next trip to NZ.", "title": "Perfect End to a Wonderful Holiday", "helpfulness": 5, "user": "suepat", "date": "November 24, 2006", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 3.0, "rooms": 4.0}, "id": 6171738, "likes": {"liked": "— Friendly staff, comfortable bed, convenience for airport", "disliked": "— Nothing to dislike!"}}, {"rating": 3.0, "stay_parameters": "Stayed October 2006", "text": "Good Points...Free Shuttle Service: Nice Bar and Restaurant: Large Clean Room.", "title": "Good and Bad", "helpfulness": 4, "user": "allanmc", "date": "October 17, 2006", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 2.0, "cleanliness": 3.0, "value": 2.0, "location": 2.0, "rooms": 3.0}, "id": 5962940}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled on business", "text": "This is my second stay at this hotel, and both times have been a treat. Hotel rooms and service can become a bit ho-hum, but this one truly stands out. I'm sure the difference is that this is a family business: two of the Pattersons attended to us, and their pride in their hotel and genuine hospitality are wonderful. Both times we have stayed in the the new business suites, which are the nicest hotel rooms I have stayed in. Very fresh, clean and comfortable. A nice touch is that the hotel is really owned by a very friendly cat, that just might follow you back to your room!", "title": "It even has a cat!", "helpfulness": 2, "user": "Wydeye", "date": "March 14, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 7162787, "likes": {"liked": "— Staff and rooms", "disliked": "— Long corridors"}}, {"rating": 5.0, "title": "Kudos for Copthorne", "text": "Just want to echo all the postive reviews. After reading them I clicked on Travelocity, et al and all said sorry, fully booked. But I was persistent and telephoned and got in. And so glad we did. People had mentioned they were upgraded to next notch up so I asked. The desk attendent said she was sorry but they didn't have any upgrades for 3 but if we were just 2 she would have moved us up. But she did give us a special room with our own view of the garden and dimuntive waterfall thru the french doors. Beautiful plants. A small kitchen and great room, bath, etc. They gave us coupons for the bus. And were friendly and welcoming. The room was spotless. Free computers with Internet access in the lobby. If you find it full on line just call you won't be sorry you spent the extra money. Enjoy.", "helpfulness": 2, "user": "nkp", "date": "March 12, 2007", "id": 7149127}], "location": {"country": "New Zealand", "region": "South Island", "continent": "South Pacific"}, "stars": 4.5, "variance": {"poor": 2, "average": 40, "very good": 177, "terrible": 5, "excellent": 328}, "slim_ranking": 0.0802919708029, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "Situated on Christchurch’s Memorial Avenue, The Copthorne Hotel Commodore is just minutes away from the Christchurch International Airport and ten minutes into the centre of Christchurch. With an idyllic setting featuring award-winning native New Zealand gardens on seven acres of land, you can be assured of a tranquil stay.The hotel features 137 guest rooms, conference facilities, and extensive free parking. Our 'resort style' leisure facilities include an indoor swimming pool, spa, sauna and gymnasium."}