{"user_rating": 4.0, "review_count": 479, "name": "Copthorne Hotel Wellington Oriental Bay", "reviews": [{"rating": 4.0, "title": "Great Location, Quiet Retreat", "text": "Stayed two nights at this gem and enjoyed it immensely. The location is perfect for a Wellington visit - easy to walk all attractions and on a less-congested section of the harbor front. The hotel is well-appointed, comfortable and attractive. We stayed in the front section and had a fantastic balcony view of the harbor - a bit of traffic noise, but not bothersome. The room was a generous size, with tasteful dark wood decor and a large bathroom. The staff was super helpful with tips and directions. I really enjoyed morning walks, turning right out the font door and strolling the harbor front towards Mount Victoria. Also, this hotel has the fastest elevator I've ever experienced - a nice perk when you're tired after a day of much walking.", "user": "KSchmidt", "date": "March 15, 2013", "id": 154608087}, {"rating": 4.0, "title": "Great Location", "text": "We thoroughly enjoyed our short stay in Wellington at the Copthorne. The staff were all outstanding and the front desk/concierage did everything they could to make our stay as enjoyable as possible. The International Sevens Rugby festival certainly made for an exciting time in Weliington. Our room, on Oriental Bay, was perfect in every respect. The buffet breakfast was very good. The hotel is within easy walking distance of many restaurants and bars.", "user": "gapcmp", "date": "March 14, 2013", "id": 154502025}, {"rating": 5.0, "title": "Location, Location", "text": "We stayed one night to visit the city and the Te Papa Mueseum particularly. Its a great location and you can walk everywhere, its very near the world class museum.", "user": "Erica055", "date": "March 14, 2013", "id": 154495567}, {"rating": 5.0, "title": "The Best Position in Wellington", "text": "We booked a room with sea views and enjoyed looking at the commercial harbour and leisure craft. Very comfortable room with luxurious fittings. Excellent overall. Parking was pricey but actually the norm for city hotels in New Zealnd now, I believe.", "user": "VM2", "date": "March 12, 2013", "id": 154400495}, {"rating": 4.0, "title": "Good hotel, lovely location", "text": "Short drive to the Interislander Ferry Teminal. Helpful staff.", "user": "GordonHeather", "date": "March 12, 2013", "id": 154325325}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "One of the better hotels we have stayed in. Unbeatable views from our room's 9th floor balcony overlooking the yacht club; easy 10 minute walk to the CBD and restaurants. Helpful staff. Free wifi in the lobby areas was a big plus in comparison to other hotels.", "title": "Superb Views of Wellington Harbour", "helpfulness": 1, "user": "R S", "date": "February 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 152591751}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "Stayed at Copthorne Oriental Bay with the family and it is a highly recommended hotel to stay at - easy access to restaurants, walking distance to Te Papa Museum etc. The rooms were clean, checking in was a breeze and a request for a late check out was not a problem. The Reception staff were great, the food and beverage team was efficient - good room service menu and the concierge desk was also helpful. Last but not least, the Housekeeping team also did a fabulous job!", "title": "Great hotel", "helpfulness": 1, "user": "rtsrka", "date": "February 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 152390602}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled solo", "text": "I stayed at this hotel and what an investment it was. Great service, great location and lovely bedroom. A must have if you would like to enjoy the beautiful scenery of Wellington and the beach. I will definitely be coming back here again A++++ Accommodation.", "title": "Excellent", "user": "AGarrett", "date": "February 7, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 151638048}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled with family", "text": "Cheers Copthorne for the stay, money well spent =)", "title": "Family two night stay", "helpfulness": 1, "user": "Penny d", "date": "February 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 151331218}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "As we had two children we were looking for a hotel that would have separate sleeping areas without having o purchase interconnecting rooms. This property did not disappoint. We got the Kid n All package booked directly to friendly responsive Receptionist.We were on the second floor looking out onto harbour. Fully functional bathroom separated a King size bed and twin beds which was perfect . Room was perfect had everything we needed and was quiet which is a big thing for me. Pool was perfect for children as the weather was insanely hot, a tad tired could do with some more seating for adults and a paint but otherwise children did not care and was very refreshing and good depth for children (6 & 7) and adults. As part of package children ate free so had a fabulous buffet breakfast both mornings. Did not have a evening meal there. The children got free mocktails and have to say their Mojito was one of the best i have had. Fabulous location Oriental parade on your door step with a quick easy stroll to Te papa and Courtney place really lovely walk along waterfront to Lambton quay / shops & bars. All staff we tentative, engaging & friendly nothing a problem. Would go back in a heart beat when we next return to Wellington.", "title": "Great location", "user": "Larry D", "date": "February 3, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 151285156}, {"rating": 2.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "We booked our room 4 months in advance for a 3 night stay and they still stuffed it up, arrived off the ferry at 10pm to find our room had 2 queens instead of 1 queen and 2 singles,Then told that the Hotel is fully booked and that is the only room avalible, After having to raise the tone of our dissatisfation they suddenly found a 3 bedroom room for the night and would sort out a room in the morning and will call us in the room.", "title": "Need to lift there standard", "user": "Malcolmhills", "date": "March 12, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 154312974}, {"rating": 3.0, "stay_parameters": "Stayed March 2013, traveled on business", "text": "After waiting until 11.30am and losing a few hours sightseeing we had to ring reception to find out what was going on.", "title": "Beware!", "helpfulness": 2, "user": "Ed C", "date": "March 6, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 153827814}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "Told leave all your bags in the room and we will put in the next room when ready, we also told them that we had things in the fridge and not to forget them, Well they did no surprise.", "title": "Great Location", "user": "Michael B", "date": "March 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 153577063}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "Everything from there went smoothly until checkout.", "title": "Great location and a room with a view!", "user": "AsianTrekker48", "date": "March 1, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 153422494}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "I had instructed the hotel to take full payment from my credit card 4 months prior when booking to save having a large card bill when we got home as we were away for 5 weeks.", "title": "Brilliant customer service", "helpfulness": 1, "user": "Cracker73", "date": "February 27, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0}, "id": 153315353}, {"rating": 4.0, "title": "Excellent hotel", "text": "Great location and friendly staff. Upgraded to a suite which was modern and well equipped.", "user": "pjh50", "date": "February 26, 2013", "id": 153172776}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled with family", "text": "Parking was charged, but thats to be expected in the city centre.", "title": "As good as it gets for the money", "user": "dalmart", "date": "February 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 153099500}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled with family", "text": "I'd give it 5* if the wifi was completely free.", "title": "Great family rooms & excellent water views", "user": "FranBoNZ", "date": "February 25, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 153080799}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "I would recommend this hotel to anyone. The staff were very friendly and helpful. the room was spacious clean and comfortable and recently refurbished.The room was serviced every day promptly in the mornings The location was excellent with the centre of Wellington a short level walk away.", "title": "Very comfortable and a great location", "user": "Superpear", "date": "February 22, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 152825121}, {"rating": 4.0, "title": "Great location", "text": "Our family of 4 were upgraded to a 3 bedroom apartment on level 1 so of course were were delighted with the hotel from the very start, but the rest of the stay was just as great.", "user": "Nick Z", "date": "February 21, 2013", "id": 152732124}], "location": {}, "stars": 4.5, "variance": {"poor": 22, "average": 55, "very good": 202, "terrible": 7, "excellent": 193}, "aka": "Copthorne Hotel Wellington", "slim_ranking": 0.137254901961, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.5, "rooms": 4.0, "location": 4.5}, "description": "Where location is everything! A $10 million refurbishment and its prime waterfront position overlooking one of the world'€™s most beautiful harbors makes the Copthorne Hotel Wellington Oriental Bay one of the most luxurious accommodation experiences in Wellington. Contemporary decor, exceptional dining options, heated indoor swimming pool and state-of-the-art technology with all the convenient comforts you would expect from a modern city hotel such as broadband internet, modem points and a large wall-mounted LCD TV."}