{"user_rating": 4.5, "review_count": 3654, "name": "Coral Sea Holiday Village", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "The best holiday I have ever had. If you have kids 15 years or younger then this is the holiday for you. The food was amazing and the choice was endless. The three al la cart restaurants were good for the Chinese, excellent for the Indian and out of this world for the Mediterranean. They were also up on their hygiene and insisted everyone used anti-bac gel before you used the restaurants. The pools were spotless and were constantly checked for hygiene levels and water purity. The public toilets were constantly staffed and cleaned. The Egyptian staff were amazing and could not do enough for you, in fact we had a extra day at a five star resort due to flight delay and the staff at coral red sea were far more accommodating and pleasant. Our room was cleaned every day and you could smell the pleasant aroma of freshness once this had been done. Fresh towels and bed sheets were supplied every day and made to hospital standard. Kids clubs and creche were fantastic and this is one of many reasons why we will be going back next year. The day time activities kept everyone of all ages amused throughout the day and were included in the holiday at no extra charge. The day time entertainment staff were the best I have seen and encouraged you to take part in the day without being overbearing, all our family and many others had fun. The good thing about this you got talking to so many people that you would not have in a different environment. Cameron and his 'i 5 live' in the evening were also fantastic the characters of farmer jack and Russell the brussel will live with me forever top memories. entertainment for the kids with an adult twist, well done team. Simply if you want an amazing holiday where you and the kids will be entertained for two weeks with a little time off from being mum and dad then this is the one for you", "title": "already booked for next year", "user": "Stuarty_Bhoy_Innes", "date": "June 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 165108577}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "My girlfriend and I traveled to the Holiday village in June this year and had an amazing time! I should probably start by saying we are both in our 20's without any children. a lot of reviews talk about how this is not a place for couples without children, but we disagree. As long as you know what to expect before you go then you should have an amazing time. Yes there are a lot of children but we were told the hotel was at 95% capacity and bearing this is mind we had a surprising relaxing time.", "title": "Holiday Village", "helpfulness": 7, "user": "Jamie2brooks", "date": "June 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 165091407}, {"rating": 5.0, "stay_parameters": "Stayed April 2013", "text": "Arrival.", "title": "Lovely place relaxing stay.", "helpfulness": 4, "user": "TheShowans", "date": "June 24, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 165074257}, {"rating": 4.0, "title": "Great family holiday", "text": "We got to the hotel at about 9pm on Friday and check in was very quick and efficient. We were then shown to our room which was in block 12. Dinner was available until 10 which meant we were able to get something to eat.", "helpfulness": 8, "user": "little-angie12", "date": "June 24, 2013", "id": 165070301}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "Room.", "title": "Holiday village Red Sea", "helpfulness": 2, "user": "p0llyanne", "date": "June 24, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 165055060}, {"rating": 2.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "stayed at this hotel 27th May 2013 to 10th June 2013 rooms were dated in need of refurb rooms 3202 & 3203 disappointed but got on with holiday. On the third day my wife and daughter both took ill sickness and diarrhoea and were given free tablets from the clinic which didn`t cure the problem but made your holiday bearable still suffering 2weeks after getting home been to the doctors twice next step is to send a sample for testing.There was also pooing in the pool while we were there as reported in other reviews didn`t help by being served warm watered down soft drinks.The dinning room was chaos long queues and tables not cleaned from previous users waiters wandering around looking busy. On a good note the first choice boys and girls from the chrece to the kids entertainers did a great job adult entertainment is another story. This was our fourth visit to Egypt and would not recommend this hotel but it is not typical of Egyptian standards", "title": "Hotel with a serious problem", "helpfulness": 1, "user": "ian380", "date": "June 24, 2013", "detail_rating": {"service": 1.0, "cleanliness": 2.0, "value": 1.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 164997620}, {"rating": 5.0, "stay_parameters": "Stayed June 2013", "text": "Just got back HV with my wife and two children. After reading some of the negative reviews on here we were very apprehensive about going. We didn't need to be worried, we all had a fabulous time. I agree that this hotel is a little shabby and could do with updating but for the money it was excellent. The staff work very hard and really want you to have a good time. As for the 'illness' don't let it put you off, it only happens to a small percentage of people and tablets from the on site clinic sort it out straight away! You've got to remember you're in Egypt and this hotel has 1000's of people visiting each week. If there was a problem there would be 100's of illness related reviews. I wasn't a fan of the buffet style food but it was ok. We would happily visit again as this place is perfect for kids and mine had the time of their lives. Well done holiday village and all the staff, just wish you got the recognition you you deserve.", "title": "Had a great time", "helpfulness": 2, "user": "Algerken", "date": "June 24, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 164994513}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "This was the first time we have visited Egypt and we loved it. I have two girls 7 and 2 and they loved it, especially the evening entertainment, the team were brilliant. Eldest went to kids club a couple of times and liked it but we didn't use the creche as didn't feel we needed too.", "title": "Great Family place", "helpfulness": 1, "user": "cheeky_twiglet", "date": "June 24, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 164993405}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "Temps in the late 30's early 40's but didn't feel that hot as it wasn't humid.", "title": "Fantastic swim up room", "helpfulness": 1, "user": "Annevans1961", "date": "June 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 164944234}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "We were in block 10 which was near reception and we had a kids Den room, which was perfect, shame we weren't on the ground floor, which would of topped it off, but we did have a lovely view of the quiet pool.", "title": "2nd time here , cant wait to go again!", "helpfulness": 1, "user": "glenn n", "date": "June 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 164906983}, {"rating": 3.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "We have just returned from 14 nights at the Holiday Village Red Sea (6 June - 20 June 2013) and its hard to write this review as some aspects were really good and others not so!", "title": "Genuinely Mixed Review!", "user": "LeaHJ", "date": "June 25, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 2.0, "rooms": 4.0, "location": 4.0}, "id": 165201480}, {"rating": 4.0, "stay_parameters": "Stayed June 2013", "text": "Staff: Brilliant!", "title": "Great family holiday", "helpfulness": 4, "user": "donna r", "date": "June 25, 2013", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 3.0}, "id": 165161444}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "All the staff are really helpful, nothing seems to be too much trouble. We went with a 3 year old who attended Kids Club - The Staff were very good, made her time really enjoyable and bubbled with enthusiasm all day. Our Room Guy, Mohammed was a treasure, making towel animals to keep the little one entertained.", "title": "Discraceful 'First Choice'", "helpfulness": 10, "user": "MrandMrsBob", "date": "June 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 165155384}, {"rating": 2.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "Grounds: Immaculate", "title": "Red Sea Holiday Village", "helpfulness": 1, "user": "Elizabeth L", "date": "June 25, 2013", "detail_rating": {"service": 2.0, "cleanliness": 1.0, "value": 1.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 165155242}, {"rating": 5.0, "stay_parameters": "Stayed June 2013", "text": "The Ground Crew do a fabulous job keeping the grounds looking so groomed. There's never a bit of rubbish or dead bush in site - brilliant.", "title": "Amazing!!!!", "helpfulness": 9, "user": "tina m", "date": "June 24, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 165112481}, {"rating": 5.0, "stay_parameters": "Stayed December 2012", "text": "I stayed here with my family a couple of years ago and could not fault the place. The beach was closed for some of the time but that was due to a shark attack further up the coast. The food was good the staff were very helpful and friendly the pool area was always clean and tidy the room was of a high level as were the garden areas.", "title": "Nice place.", "user": "Brad123kate", "date": "June 23, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 164905962}, {"rating": 4.0, "stay_parameters": "Stayed December 2012", "text": "I saw this place on watch dog a little while ago and thought I had to defend it. I just hope it hasnt gone to the dogs since my stay. I stayed here in 2010", "title": "Great place for families", "user": "bizzylizzy777", "date": "June 23, 2013", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 164861976}, {"rating": 5.0, "stay_parameters": "Stayed June 2013", "text": "Bit of a late review as we stayed in in Dec 2012. Was a little apprehensive as I had seen the watchdog report but the reviews were good and I hoped the hotel had got its act together.", "title": "Brilliant", "helpfulness": 5, "user": "danielsk300", "date": "June 22, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 164820404}, {"rating": 1.0, "stay_parameters": "Stayed June 2013", "text": "On arrival we found our room to be dirty. There was dead insects on the floor, the bath was really old, scratched and grubby and the travel cot for our baby was filthy!", "title": "Worse hotel ever!!!!!!", "helpfulness": 2, "user": "Kel-1986", "date": "June 21, 2013", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "location": 2.0, "service": 2.0, "rooms": 4.0}, "id": 164715679}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "I spoke to guest relations who quickly changed us to the room upstairs which was much cleaner and nicer! We had booked a kids den room which was perfect for our 2 boys.", "title": "amazing for kids", "helpfulness": 2, "user": "adeledigger", "date": "June 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 164686754}], "location": {"country": "Egypt", "region": "Red Sea and Sinai", "continent": "Africa"}, "variance": {"poor": 154, "average": 329, "very good": 900, "terrible": 91, "excellent": 2180}, "aka": "Coral Sea Holiday Village Hotel Sharm El Sheikh", "slim_ranking": 0.162280701754, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.0, "rooms": 4.5, "location": 4.5}, "description": "Offering the unsurpassed panoramic views of the Red Sea, Coral Sea Holiday Village Resort presents a comprehensive under-one-roof concept that meets the need of every discerning leisure traveler. This 5-star resort houses: 484 elegant guest rooms with modern amenities, superbly-designed facilities and 13 exciting dining and lifestyle choices for a multi-dimensional experience. It is our privilege to enchant our guests with courteous and attentive service that is the hallmark of Coral Sea Holiday Village Resort; we deliver only the best!"}