{"user_rating": 4.0, "review_count": 485, "name": "Coral Princess Hotel", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "Corel Princess is a cute little hotel with charming furnishings, decent décor and wonderful staff and it’s all worth the price of $125 a night (without taxes). Located on a one way street a mile from the main 26 freeway, it’s a short walk to many restaurants in Condado and a block away from Walgreens and the beach. Jose, the desk clerk was a very nice, amiable, very helpful, polite and accommodating. There is a small shallow swimming pool on the first floor, a Jacuzzi and pool table on the 3rd floor and a piano on the 1st floor. Deli meats, toast, croissants, bananas and yogurt are available for breakfast which is served from 6-10am each morning. There is cable and a fridge in the room which useful for stocking up on snacks and my only very minor issue was the shower which seems to change from hot to cold constantly so we resorted to talking baths in the nice Jacuzzi style bath tubs in the rooms. If you are renting a car there are only a couple of spaces available outside the hotel (which were always in use), but we were able to find parking spots each day across the street from the hotel so never had to pay to park. I am truly a fussy traveler and it took me several months of researching before I settled for this charmer (thanks to previous posts!!) and it was truly worth the money. The rooms are rather small (not as small as some in Europe) and I took a peek into 3 other rooms which are all similar in size and décor. Overall it’s a charming little find!", "title": "Great little Inn", "helpfulness": 8, "user": "SOAP", "date": "January 18, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 6616377, "likes": {"liked": "— location", "disliked": "— shower issues"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "We just got back from a long weekend at this hotel and we loved it. We loved the hot tub on the roof and spent almost every night up there for sunset. The staff was superb. They helped us with directions, restaurant recommendations, and set up a tour of El Yunque for us. My boyfriend especially appreciated Jose's help. The room was really nice and clean and was a bit small but we spent very little time in it. Yes, the water temperature does fluctuate a bit, but honestly, it's not a big deal. Our room had a fridge where you could purchase cheap bottles of water and soda. My boyfriend thought there was a bit too much hallway noise, but compared to other hotels I've stayed at I think it was pretty minimal. There was a continental breakfast which was completely purchased things from Costco, but it was adequate. And they served it until 10:00 which was nice. Finally, the pool is small, but was very cute and nice. It is shaded in the afternoon, which was nice for me with my fair skin. There were plenty of nice outdoor spaces to relax, a reading room, a pool table, a kitchen, and laundry facilities.", "title": "Loved this hotel!", "helpfulness": 7, "user": "beth_n_shiloh", "date": "January 17, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 6611225, "likes": {"liked": "— The staff.", "disliked": "— The size of the room."}}, {"rating": 4.0, "title": "Little Princess", "text": "Fun modern boutique property with many common areas. Hotel is about five years old. Short on info in room but the staff is very helpful. Great artwork and attention to landscape and design. Pool is tiny but usable. Fairly quiet in the rooms given that its all hard surfaces - stone, tile, etc. Recommend for adults. Taxi to airport $14; to Old San Juan $12. A $120 room is $150 with taxes. Would stay again.", "helpfulness": 13, "user": "Kort", "date": "January 1, 2007", "id": 6532883}, {"rating": 5.0, "stay_parameters": "Stayed August 2005, traveled as a couple", "text": "This was a great hotel to stay at. The room was very clean and nice. The hotel staff were very friendly. I loved it and would go back again!!!", "title": "Great Place!", "helpfulness": 7, "user": "littledaisies", "date": "December 30, 2006", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 6518093, "likes": {"liked": "— I love the style of the hotel.", "disliked": "— I loved everything about it."}}, {"rating": 4.0, "title": "nice place, helpful staff, great location", "text": "I would agree with the generally positive reviews of the Coral Princess. It is a nice, small property in a great location. They are a few blocks from many restaurants, 2 blocks from the beach and 1 block from Wallgreens (in case you forgot anything!)", "helpfulness": 13, "user": "admglick", "date": "December 22, 2006", "id": 6480830}, {"rating": 4.0, "stay_parameters": "Stayed April 2008, traveled with friends", "text": "Our party of 6 stayed for 3 nights at the Coral Princess Inn,in early April.It is small and quaint but clean and in a good location.The staff were informative and competent.The rooms were clean but really tiny;our suitcases had to be pushed into corners between the bed and the wall ,but we overlooked that small inconvenience since there were so many positive things.While our room,(room 3) was tiny,(with a tiny window over the bed that looked out onto a corridor)one of the other couples had room 4,which was much bigger for the same rate.It had a window that looked outside.The couple that had room 8 near the breakfast area also ended up in cramped quarters,but like us,considered it a minor inconvenience.The breakfast(which was included with the cost of the room)was more than adequate for our needs and the casual atmosphere was lovely.We could make our own toast/bagels,tea/etc.,choose what we wanted(cheese slices,ham slices,pastries,yogurt,fruit,etc)and then sit in the courtyard while we ate,and listened to the birdsong.We absolutely loved it!The pool was very small but the beach was only a few minutes away;right across the road.On the third floor there is a hot tub that is open till 9 P.M. (though the staff allowed my friends and I to stay in until 11,which was considerate).The food at the nearby Cafe Angel(try the mofongo if you want a taste of the national dish)was excellent;reasonably priced and huge portions.Also the Black Angus Steakhouse serves the best steaks that you could ever ask for.There is a Walgreens around the corner.If you want to go to Old San Juan or the mall(The Plaza of the Americas)you don't need to waste your money on a cab;the B21 bus runs right near the inn and drops you off there as well(every 20 minutes).It costs just .75 cents each way.The exact change is required.Overall,I would certainly recommend this hotel to anyone who is budget conscious and just wants somewhere clean and homey to stay for a short time.It is no Hilton,but then you don't pay Hilton prices either. At 125.00 a night it's not bad,as rates go in San Juan.", "title": "Excellent atmosphere at Coral Princess", "helpfulness": 4, "user": "graceCP", "date": "April 27, 2008", "detail_rating": {"cleanliness": 3.0, "front_desk": 3.0, "location": 3.0, "service": 3.0, "rooms": 3.0}, "id": 15413403, "likes": {"liked": "— The charming and casual atmosphere.", "disliked": "— Small rooms."}}, {"rating": 2.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "I saw all of the good reviews on trip advisor for this hotel and started to search around for prices. I found them listed on hotels.com with a price of $115 per night, but no mention of the bed size, and we wanted a queen or bigger. I decided to contact the hotel directly and they offered me a queen bed at $135 a night, which seemed a little high, but I decided the extra $20 per night would be okay. Watch out for the additional fees, though. They charged an additional $9.00 per day as a \"maintenance fee\" or something like that, and there is a 14% tax on top of that. We ended up paying $682 for 4 nights, or $170 per night.", "title": "The value just wasn't there...", "helpfulness": 4, "user": "gypsywmn", "date": "April 23, 2008", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 2.0, "location": 5.0, "rooms": 3.0}, "id": 15261047, "likes": {"liked": "— location", "disliked": "— value for the money"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "Now, I was looking for a small, quaint hotel that would bring with it the charm of the local community, and a sense that we were experiencing a part of Puerto Rico. This hotel just didn't offer that. This was a $100 per night hotel at best. For $170 a night, we shouldn't have had the following problems:", "title": "Nice location while visiting San Juan", "helpfulness": 1, "user": "ponsib", "date": "April 21, 2008", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 3.0, "location": 5.0}, "id": 15206989, "likes": {"liked": "— location", "disliked": "— small room"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2008, traveled with family", "text": "The first night there, the water would only turn on cold. There were 2 of us, and we turned the knobs every which way trying to get hot water in the shower. Finally, we asked at the desk. They agreed to look at it in the morning while we had breakfast. After, they brought us in, and \"showed us\" how to turn the knob and said the hot water was working all along. There is no way it was working prior to that. Why couldn't they just apologize for having to turn on the water heater?", "title": "Suited Our Needs", "helpfulness": 3, "user": "RamblinHoosier", "date": "April 13, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 5.0}, "id": 15008617, "likes": {"liked": "— Front desk help", "disliked": "— Cold pool"}}, {"rating": 2.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "In addition, after breakfast, we brought our coffee back into the room with us while we were getting ready. When they cleaned the room, they didn't remove the empty, used coffee cups. For the price we were paying, I would expect the room to be perfect when we returned for the evening. I ended up having to bring 2 days of coffee cups back out to the breakfast area myself.", "title": "We all wish to be in hot water--at least in a hotel room!", "helpfulness": 3, "user": "FirstDuck", "date": "April 8, 2008", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 2.0, "cleanliness": 3.0, "value": 2.0, "location": 4.0, "rooms": 3.0}, "id": 14883962, "likes": {"liked": "— outside eating area", "disliked": "— lack of hot water"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "Quaint, charming, and in a great location. After a hot (and fun) day of walking around Old San Juan, we went back to the Coral Princess and got in the rooftop hot tub. We had it all to ourselves and those foot massage jets in the bottom of the hot tub were the perfect remedy to our sore feet. Afterwards, we played a game of pool in the upstairs suite, which is open to all guests. I wish we'd had stayed longer than two nights.", "title": "King and Queen at the Coral Princess", "helpfulness": 3, "user": "SeattleRican", "date": "February 27, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 6851855, "likes": {"liked": "— Location", "disliked": "— N/A"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2007, traveled with friends", "text": "We decided to stay here after reading the reviews of another hotel we had already booked for the two night stay after our cruise. The reviews of the other hotel were so bad and this one so good for just a few dollars more that we weren't sure what we would find. We were very pleasantly suprised to find it just as described in the reviews and in their webwsite. The rooms are very clean and comfortable. The common area upstairs is just great if you have friends stop over to say hi or just to relax with a good book. The front desk clerks are extremely helpful and always pleasant. For all the amenities available here at such a great price, I would not hesitate to book it again. The only drawback was the hot and cold water flucuates back and forth when taking a shower but being only two blocks from the beach and resaurants certainly makes up for the minor inconvienence.", "title": "Nice and comfortable", "helpfulness": 3, "user": "Jonsdivetravel", "date": "February 25, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 6839831, "likes": {"liked": "— All the quiet common spaces", "disliked": "— the changing hot water"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "This hotel is a gem among the generic “inns” and the", "title": "A Gem", "helpfulness": 6, "user": "kot_in_boots", "date": "February 25, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 6838965, "likes": {"liked": "— art work, hot tub, roof top, proximity to all the action", "disliked": "— nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "monstrous high rises. It is clear that the owners make", "title": "Tropical surroundings in a quaint hotel", "helpfulness": 1, "user": "sundaynewz", "date": "February 24, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 6834941, "likes": {"liked": "— location", "disliked": "— n/a"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "an effort to create a memorable and comfortable place", "title": "Good value", "helpfulness": 4, "user": "fruitflyboy", "date": "February 19, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 6812214, "likes": {"liked": "— location", "disliked": "— No complaints"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2007, traveled with friends", "text": "My friends and I stayed here from jan 13-17 and we had a great time. We kept saying how cute the hotel was. We were mostly in the room to shower and sleep but we felt right at home. The hotel is located on a quiet street parallel to a main busy street. Sometimes I felt like I was in Miami.", "title": "Cute Coral", "helpfulness": 12, "user": "armanicoco", "date": "January 20, 2007", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 6628960, "likes": {"liked": "— location", "disliked": "— too quiet"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled with family", "text": "Recently stayed there with my mom (2/8-2/13) and knew we would have a great time based on all of the reviews I had read. I was pleasantly surprised at how quaint this inn is. Our room was on the second floor towards the back (#21) and it was so nice and quiet and peaceful. Felt like home. In the morning my mom would drink her coffee outside in the little outdoor sitting area. At night after dinner we would sit upstairs on the third floor to wind down.", "title": "Great Little Inn in the heart of Condado", "helpfulness": 5, "user": "MJ24", "date": "February 28, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 6891915, "likes": {"liked": "— How quiet and peaceful it was.", "disliked": "— Nothing."}}, {"rating": 4.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "We just returned from a four night stay at the Coral Princess ( Feb 10-14th). As many others have stated, it is a great little boutique hotel in a convenient area. We liked the hotel and were glad that we stayed there. All of the staff were excellent and very helpful. The weather was sunny and in the 80’s every day. Having read all the reviews, there were a few things that we didn’t expect. The rooms are small and have no closets, only a half sized armoire. There are no security safes in the room, you have to rent them. There were none available our whole stay. The pool only has space for about three sun recliners. When the hotel is at capacity the breakfast area can get very crowded and seating is a problem. All in all it is a nice little property within walking distance to three beaches: Condado (great for kids), Ocean Park (long stretch of sand with warm water but rough surf) and the beach around the corner that has chairs for rent. It is also central to all the night life. The area seemed very safe to us.", "title": "Decent Place", "helpfulness": 3, "user": "Foxboro", "date": "February 18, 2007", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 4.0}, "id": 6809397, "likes": {"liked": "— close to everthing, price was good.", "disliked": "— No closet or in room safe"}}, {"rating": 4.0, "title": "just right!", "text": "Coral Princess Inn was the perfect little hotel for us. It was in a great location, about 3 blocks from the beach, 2 blocks from walgreens, 2 blocks from the bus to old san juan, and surrounded by lots of restaurants and shops. There are also other larger hotels, such as the mariott, nearby if you want to take advantages of things such as spa services or casinos.", "helpfulness": 4, "user": "lcosette", "date": "February 10, 2007", "id": 6777329}, {"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled with friends", "text": "We stayed at the Coral Princess Inn for 5 nights, and the price was incredibly reasonable for what we received. The room was small, but was clean and the bathroom and floor were marble, which was nice. We had cable and high-speed internet access. There are many places to sit, and a nice walkway with lots of plants. The hotel has a small pool and hot tub which we didn't use, and breakfast every morning from 7-9 which i never woke up early enough to use, but my friend said the breakfast was 'okay'. This is not a luxury hotel, so don't expect lots of amenities. But you can expect all of the basics a hotel should have.", "title": "Beautiful Little Inn", "helpfulness": 9, "user": "Hombregrandedearuba", "date": "February 1, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 6720828, "likes": {"liked": "— The location", "disliked": "— The parking"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2007, traveled with friends", "text": "overall, i'd definitely stay here again because of the location, cleanliness, friendly staff and mostly because of the price.", "title": "Good value/location", "helpfulness": 5, "user": "bigfol", "date": "January 31, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 6719705}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "The rooms were ok. nothing special, but about what you would expect for this price and they were clean. The best parts of the place were the location and the very friendly and helpful staff who work there.", "title": "Perfect combo - Hip hotel without the attitude", "helpfulness": 11, "user": "seg110", "date": "December 4, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6331014, "likes": {"liked": "— Close to everything! Beach, Old San Juan, Airport, the strip."}}, {"rating": 4.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "Breakfast is very simple, but fine and in a nice setting. there is a great deal of common and outdoor space for a hotel of this size. in fact, the number of nice sitting areas almost seems excessive if that is possible. There is a hot tub on the roof which is very nice, but when we went to use it, it was cold! The staff said they couldn't do much to fix it, so we didn't try it again.", "title": "Thanksgiving Stay", "helpfulness": 7, "user": "chasmccabe", "date": "November 30, 2006", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 6310132, "likes": {"liked": "— inexpensive, good location, friendly staff"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "One other strange complaint is that the lobby was always cold. The lobby is very small and is just basically the check in desk and the elevator, so you don't spend much time there, but I felt bad for the staff who had to work there, they all seemed to bring sweaters and sweatshirts.", "title": "Wow, what a deal!!!", "helpfulness": 6, "user": "DrRhythm", "date": "November 23, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6169292, "likes": {"liked": "— The value", "disliked": "— The parking"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "I would definitely stay here again when visiting PR. The place had some minor issues, but it was clean, charming, helpful staff and in a great location at a great price compared to other options around.", "title": "Helpful staff, good location", "helpfulness": 6, "user": "SagarMung", "date": "November 15, 2006", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 6133674, "likes": {"liked": "— Friendly staff", "disliked": "— Early checkout time"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "We really enjoyed the Coral Princess. It's in a great location in Condado a short walk to the beach and very close to great restaurants and shopping. A quick cab ride to Old San Juan. The hotel was very clean and the staff was extremely helpful. I would definitely recommend it to others.", "title": "A great hotel and a great Value!", "helpfulness": 3, "user": "Rob1975", "date": "April 7, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 14869952, "likes": {"liked": "— Great rooms, pools, decks...just a great facility. Staff were awesome as well", "disliked": "— Spotty Internet Service"}}, {"rating": 3.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "We stayed in the Penthouse suite for one quick night, and on first impression it was very cool! Definitely a smooth decor: very modern. The whole hotel has a random chic appearance with antique furniture blended with bold colorful paintings and modern lines. Only upon settling in did we begin to be disappointed. The toilet paper, a priority for my D.H., was the cheapest quality one could purchase, the shower was plumbed directly into the jacuzzi tub, which was a little awkward to step in or out of, there were cheap soaps and, a female's favorite, \"conditioning shampoo\". I don't know a female that doesn't appreciate conditioner!! There weren't even kleenex in the room! The cheap t.p. had to suffice! There were doors that opened directly onto the roof-top deck that had no instructions and were impossible to open. The a.c. was an individual unit mounted on the wall controlled by a remote that, apparently, had been dropped so the LCD screen was unreadable. I spent the night either roasting or freezing not being able to find a happy medium. Another disappointment for me was that the hotel was a $12 (one way) cab fare away from Old San Juan. The last, but not least, missing commodity in our PENThouse sute was an alarm clock!!!! All that said, the bed was very comfy, the staff friendly and the hotel fairly clean. Probably wouldn't stay there again, or wouldn't pay *$200* dollars for maybe what a lesser room would've offered.", "title": "Coral Princess a let-down", "helpfulness": 3, "user": "joelsmama", "date": "April 5, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 2.0, "location": 3.0, "rooms": 2.0}, "id": 14813790, "likes": {"liked": "— comfortable bed, nice sheets", "disliked": "— a.c. unit impossible to figure out, no alarm clock!"}}, {"rating": 2.0, "stay_parameters": "Stayed April 2008, traveled solo", "text": "Just stayed in Coral Princess last 3 days, really nothing special, I looked next door at the Consulate hotel, a few more bucks and it’s a lot nicer.", "title": "OK, but felt scammed when i left.", "helpfulness": 5, "user": "Max S", "date": "April 4, 2008", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 2.0, "rooms": 2.0, "location": 4.0}, "id": 14799746, "likes": {"liked": "— Location", "disliked": "— Feeling i was scamed"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "Location on Condado is excellent. Rooms showed wear and tear, air con works either ice box mode or nothing.", "title": "Excellent Hotel - more than expected!", "helpfulness": 2, "user": "lcstine", "date": "April 2, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 14742034, "likes": {"liked": "— very clean, friendly staff, update everything!", "disliked": "— location was good - but could be better"}}, {"rating": 4.0, "title": "the informal place to stay", "text": "Hotel was not forthright about there true room rate, and at end of stay they added 10 bucks a day for nothing.", "helpfulness": 2, "user": "philpetrus", "date": "March 27, 2008", "id": 14577326}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "Staying here after a cruise was a restful bridge before returning home. We disembarked the ship and arrived at the hotel before we could check in, but there was a room for storing our luggage and a restroom so we could change and enjoy the small pool and the breezeway where we relaxed until our room was ready. Marcia, the desk clerk, was extremely helpful and friendly.", "title": "Coral Princess--A Respite before Returning to Reality", "helpfulness": 2, "user": "StickSister", "date": "June 27, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 3.0}, "id": 17270524, "likes": {"liked": "— Attractive room, hospitality", "disliked": "— Stairs"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled solo", "text": "Our attractive room was very comfortable with a much welcome working ac and ceiling fan. The stairs were difficult to navigate with our luggage, but that is the only negative I could post. The room was very clean as was the bath. It felt like a place of retreat and warmth and I would have enjoyed staying another day just lazing around and looking at the beautiful orchids in bloom in the walkway area. This was not an ornate or extravagant hotel--but one with its own charm.", "title": "Nice Room, Great Rate!", "helpfulness": 3, "user": "BrnzBarbie22", "date": "June 17, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "business": 3.0, "cleanliness": 4.0, "rooms": 4.0, "location": 4.0}, "id": 16989961, "likes": {"liked": "— Close to the action, but not too loud."}}, {"rating": 4.0, "stay_parameters": "Stayed June 2008", "text": "After reading all the reviews on the Coral Princess, I was pleased to find this hotel delivers what most positive reviews had to say. Overall, it was a very charming hotel that will definitely stay on my short list of favorites in the San Juan area.", "title": "Great stay marred only by credit card problem", "helpfulness": 2, "user": "bugleTA", "date": "June 15, 2008", "detail_rating": {"front_desk": 3.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 16953349}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "I was traveling single and I stayed in room 19. It was one of the smaller rooms, but still very adequate. The room was very clean and room service was dependable. The ceiling fan worked great - so much that I could go without the air condition at night.", "title": "A princess stay at the Coral Princess Inn!!", "helpfulness": 4, "user": "WildCat75", "date": "May 28, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 16471276, "likes": {"liked": "— The Spanish Feel to the Hotel and the Friendly Helpful staff", "disliked": "— Nothing :)"}}, {"rating": 3.0, "stay_parameters": "Stayed April 2008, traveled with friends", "text": "Here are a few things I didn't see in other reviews that might be helpful.", "title": "A princess in commoners clothing", "helpfulness": 4, "user": "Travelsof2", "date": "May 11, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 4.0}, "id": 15911124, "likes": {"liked": "— value and charm ,location ,clean, security"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "We stayed at the Coral Princess from May 2-4, 2008 for a weekend getaway.", "title": "Coral Princess - Convenient and Clean", "helpfulness": 5, "user": "AMBUWS29", "date": "May 5, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 15658896, "likes": {"liked": "— Location, cleanliness, staff", "disliked": "— Dirty hot tub and fan in room"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "- Location: Ideally situated a block from Condado Beach and near many small restaurants (loved Cafe Del Angel). Easy bus ride on the B21 to Old San Juan.", "title": "Definitely recommend", "helpfulness": 5, "user": "vvv3", "date": "May 2, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 15600563, "likes": {"liked": "— Friendly staff, good value", "disliked": "— Dust coming out of A/C at times"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled on business", "text": "- Cleanliness: Mostly very clean. Bathroom was spotless. Only complaints were that the fan in our room was covered in dust and the rooftop hot tub's water smelled funky and needed a cleaning.", "title": "An excellent choice in Condado", "helpfulness": 4, "user": "knoxfencer", "date": "May 2, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 15582230, "likes": {"liked": "— Charming atmosphere", "disliked": "— Somewhat noisy air-conditioner"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "- Room: Room 16 is small, but clean and quiet, on the second floor overlooking the lovely courtyard with plants and a small, but very clean pool. It has a jacuzzi tub.", "title": "Coral Princess Inn", "helpfulness": 3, "user": "Movintovieques", "date": "April 30, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 2.0, "value": 3.0, "rooms": 3.0, "location": 4.0}, "id": 15500008, "likes": {"liked": "— The rooftop patio", "disliked": "— The bathroom"}}, {"rating": 4.0, "title": "Great location and lovely inn", "text": "- Breakfast: Breakfast was adequate, but nothing to write home about.", "helpfulness": 5, "user": "fayeg859", "date": "April 29, 2008", "id": 15481773}, {"rating": 4.0, "stay_parameters": "Stayed November 2006, traveled with friends", "text": "I really recommend this hotel because it is between Old San Juan and the airport, yet has excellent beaches and won't break the bank while still providing continental breakfast. I will be staying here again, definitely, and so should you!", "title": "Great Small Hotel", "helpfulness": 2, "user": "JOHNJAX", "date": "November 13, 2006", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 3.0, "rooms": 4.0}, "id": 6122531}], "location": {"country": "Caribbean", "city": "San Juan"}, "stars": 2.5, "variance": {"poor": 14, "average": 54, "very good": 196, "terrible": 13, "excellent": 208}, "slim_ranking": 0.170212765957, "description": "Coral Princess Hotel is an elegant 25-room boutique-style hotel offering the business traveler and families an excellently priced alternative in a cozy and comfortable atmosphere. Managed by its owners, you will receive personalized quality service that will surely make you feel at home. Located a two-minute walk from famous Conado Beach, Coral Princess Hotel is a block from boutique shops, over 15 restaurants, coffee shops, and casinos. It is centrally located just 5 minutes from Old San Juan and the Puerto Rico Convention Center, 10 minutes from Hato Rey business district, and 10 minutes from the international airport and Isla Verde. Enjoy your complimentary Deluxe complimentary continental breakfast served daily at the hotel’s courtyard, stroll down Ashford Avenue, or swim and sunbathe at our pool or nearby Condado Beach. We'll make you feel at home! You will sure want to come back. Complimentary high speed internet access in room and WiFi in public areas."}