{"user_rating": 5.0, "review_count": 86, "name": "Coral Stone Club", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled with family", "text": "Beautiful condo with a balcony literally over the sand. Very well equipped kitchen. Wonderful housekeeping service and Corinna in reception was very helpful and knowledgeable on the local area. Perfectly located with a supermarket 2 minutes walk away. Quietest, sandiest beach in Cayman with loads of available beach chairs and space was the best feature of the Coralstone Club. Would definitely return.", "title": "NICEST CONDO IN GRAND CAYMAN", "helpfulness": 4, "user": "Aussies1", "date": "January 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 123370975}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled with family", "text": "My husband, daughter (18 months) & I just returned from a 10 day stay at the Coral Stone Club on Seven Mile Beach. We were beyond impressed with the accommodations! The location was excellent as it was centrally located on the beach & the grounds were fabulous! The pool & all common areas were meticulously maintained & managed by extremely helpful & kind staff. We were on the first floor and enjoyed being steps from the pool and beach. The condo was well equipped with all the latest modern conveniences & a pleasing decor. Overall, we were thrilled with our choice of Coral Stone Club & would revisit in a heartbeat!!", "title": "Fabulous Accommodations!", "helpfulness": 1, "user": "Kelly F", "date": "January 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 122997410}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "We worked with Corina to plan our beachfront wedding on the Coral Stone beach. It was the ideal location, and the staff of Coral Stone worked wonderfully with us to ensure everything would go off without a hitch. Unfortunately my fiancé passed away suddenly a month before our wedding, so we didn't get to hold our dream wedding here, but the staff handled a very difficult situation with grace and kindness. I cannot thank them enough for their kindness during this difficult time.", "title": "Amazing, helpful staff.", "helpfulness": 2, "user": "brooklynblondie", "date": "December 30, 2011", "detail_rating": {"value": 5.0, "service": 5.0}, "id": 122284699}, {"rating": 5.0, "stay_parameters": "Stayed December 2011", "text": "This area of Seven mile Beach is one of the best areas for wading and hanging out on the beach. The Coral Stone condos have a nice kitchen for making small to large meals. The 2 bedrooms have king sized beds and the third has 2 twin beds so would not be great for 3 couples but good for families.", "title": "Each condo overlooks the beach and the beautiful pool and was great for being able to lounge all day long. The Ritz is next do", "helpfulness": 1, "user": "mfctennis", "date": "December 26, 2011", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 122115296}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "There is a nice screened in porch and an open porch. The Maid service was good but don't take a shower mid day because there may not be any towels to be found until later in the afternoon. Corrina and Valerie communicated well on the internet and phone and got us a two for one deal at dolphin cove. We like to try. We like to try new places when we go back to an area but Coralstone has placed the bar high for us.", "title": "Great value on all levels", "helpfulness": 9, "user": "filter14", "date": "August 14, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 5.0, "service": 5.0}, "id": 116718587}, {"rating": 5.0, "stay_parameters": "Stayed August 2004, traveled with family", "text": "Lovely Condos. Loved having the space we needed and able to cook in our home for the week. The staff was very friendly. It was nice to be able to just walk right out onto the beach. Very private and calm area", "title": "Nice Place to Stay", "helpfulness": 2, "user": "Carribeanmom0307", "date": "November 22, 2008", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 22094012, "likes": {"liked": "— Great pool scene", "disliked": "— Older Travlers"}}, {"rating": 5.0, "title": "Idyllic Grand Cayman", "text": "We recently returned from 6 nights at the Coral Stone Club and loved it and the island of Grand Cayman. Having 3 bedrooms and 3 baths is a big plus. Everything was included and there was a washer/dryer which helped as we spent as much time as possible on beautiful Seven Mile Beach. Words cannot describe how lovely the beach is. The water is warm and crystal clear, while the sand is soft and clean. The condo has one screened-in porch and one with no screen. The view cannot be beat as you can tell by the attached picture.", "helpfulness": 1, "user": "dcoak", "date": "August 25, 2008", "id": 19354392}, {"rating": 5.0, "stay_parameters": "Stayed June 2008", "text": "We took a Native Way tour of Stingray City, Reef Garden and Rum Point which was fabulous. Seeing the stingrays was a lot of fun, and the snorkeling at Reef Garden was wonderful. Rum Point is worth seeing as it is truly idyllic. We also did some good snorkeling at Smith's Cove which was a beautiful location with snorkeling right offshore.", "title": "Loved the Coral Stone Club! Perfect location...beautiful view!", "helpfulness": 1, "user": "jpblanton", "date": "July 4, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 17531986, "likes": {"liked": "— The view, the beautiful spacious rooms, kitchen, everything!", "disliked": "— I cannot think of anything I didn't like!"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled with friends", "text": "George Town is cute, though everything but the restaurants closes at 5. Lots of great restaurants on the island, but we especially enjoyed Casanova's and The Lighthouse.", "title": "Loved it all", "helpfulness": 1, "user": "sherikay615", "date": "March 28, 2008", "detail_rating": {"front_desk": 3.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 14613502, "likes": {"liked": "— that it was a condo... full kitchen, multiple bedrooms and bathrooms, washer/dryer", "disliked": "— can't think of anything..."}}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled with family", "text": "Coral Stone is in a great location within an easy drive of George Town and shopping. I highly recommend the condo and all of Grand Cayman.", "title": "Beach Paradise", "helpfulness": 3, "user": "robpaula", "date": "March 8, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 14148917}, {"rating": 4.0, "stay_parameters": "Stayed March 2011", "text": "Nice facilities. Clean, well appointed. Perfect location. Great for folks without children. However, we had a very bad experience with a security guard who made very inappropriate comments to my 19 year old daughter. When we complained we got nothing but a lame apology for a ruined vacation. Don't bring children or daughters to this cono.", "title": "Very nice condo. Bad experience.", "helpfulness": 7, "user": "MarkDMcC", "date": "March 11, 2011", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 2.0, "rooms": 4.0}, "id": 99835903}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled with family", "text": "Stayed for a week in mid february, and was very satisfied with every aspect of Coral Stone Club...From the immaculate rooms to the impeccable beach..Maid service was a plus,and the crowd free beach was perfect..Take a look at the ridiculous crowds at the Ritz beach next door,and wonder why on earth anyone would stay there...Close proximity to grocery stores and restaurants,and liquor stores almost negate the need for a rental car...Very pricey, but worth every nickel..", "title": "One of the finest vacations ever", "helpfulness": 2, "user": "qdog1989", "date": "March 27, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 59650790}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled with family", "text": "This is the 4th time we have stayed at the Coral Stone Club because it is so perfect. Three bedrooms , three bathrooms, three TVs, huge modern kitchen and the bedrooms are so comfy. You get maid service and a beautiful pool and hot tub too. The condo is right smack in the middle of 7 mile beach and your balcony looks right over everything. Forget the hotels this is way better. oh yeh, book far in advance this place is popular with those who know. See you next year.", "title": "Keeps Us Coming Back", "helpfulness": 2, "user": "sandybeachsareus", "date": "January 7, 2010", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 52859978}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled with family", "text": "We stayed here 12/20/09-12/27/09 and it was great. Very nice beach with lots of room. We always had plenty of room and were not piled on top of other guests like the folks at the Ritz which is next door. The condo was nice with plenty of room for 6 adults and a great view of the beach. We were on the top floor which was the 3rd floor so it was easy to come and go with stairs or an elevator available. They also have 2 very nice grills for the guests so cooking out was easy. The housekeeping staff was excellent and could have not been more helpful. Great location within easy walking distance to the grocery store and the liquor store as well as some excellent resturants. They have a nice workout room and a nice tennis court. We would definitely stay here again. Al M. Germantown,TN.", "title": "Great Place to Relax", "helpfulness": 3, "user": "IRONMANTENNESSEE", "date": "December 29, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 52090527}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "We recently visited the Cayman Islands and stayed at the Coral Stone Club (unit 14). It was a good place to stay and in a great location. The room was decorated beautifully and had everything we needed. The cleaning staff was very good at their job and always friendly. The location on Seven Mile Beach was ideal; they are right next to the Ritz and just down the street from the Governor's House. This put us right in the middle of everything. This meant we could walk to several great restaurants as well as the grocery store.", "title": "Great Location and Great Condo", "helpfulness": 1, "user": "toddWallentine", "date": "June 14, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 32313106}, {"rating": 5.0, "stay_parameters": "Stayed June 2011", "text": "We stayed at Coral Stone the last week of June. We were on the bottom floor which was wonderful for our kids and convenient for us. Place was beautiful, next to Ritz, rooms were gorgeous and place was immaculate! Highly recommended over the crowded Ritz and Westin. Walk to Governor's Beach and snorkel. Absolutely wonderful!", "title": "I would stay here again!", "helpfulness": 1, "user": "annieislandbound", "date": "July 17, 2011", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 115465718}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled on business", "text": "Coral Stone Club is well located on the 7 mile beach right next to the Ritz Carlton . The 3 bedroom condos are in great shape and well furnished. This small enclave has a nice large beach area compared to the crowded ( but elegant ) Ritz next door. Their website gives a true depiction of the club. We are used to a more \"islandy \" feel when visiting our favorite Caribbean islands , but Grand Cayman has its pluses. Quite built up, it is easy to get groceries, restaurants, and the roads are good for sight seeing. The Club caters more to families rather than singles. We will bring our family and grand children for the next visit because everything was so convenient, but for just the 2 of us , it will be back to St. John for that Island-fee.", "title": "Excellent upscale property for families", "helpfulness": 6, "user": "Delilahs", "date": "June 13, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 113202061}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled with family", "text": "This was recommended by friends who have stayed here. We loved the CSC for its great location, wonderful views, and the relative privacy compared to surrounding resorts/hotels. The staff were very appropriate and anticipated to our needs. Maureen, our housekeeper was most helpful. Valerie, the manager, helped us with reservations when we could not make them ourselves. The pool and beach never felt crowded even though we traveled during the Easter season. The grocery and liquor stores and nearby restaurants were very convenient as well. Once, we wandered over to the beautiful Ritz next door for lunch, and enjoyed the meals and drinks, but were so happy to return to our little slice of paradise.", "title": "wonderful experience at Coral Stone Club", "helpfulness": 6, "user": "bigdumbandugly", "date": "April 22, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 105072936}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled with family", "text": "Our families took a private Eco boat tour with John MIchael Stafford to Stingray City, Rum Point and snorkeling. This was a highlight of our trip. Two of us dove with Ambassador Divers on the reef and Kittiwake wreck. Once again, we loved the smaller boat and the ability to tailor the dive trip to our particular desires.", "title": "Great Place, Great Location, Great Beach!", "helpfulness": 4, "user": "CindyLu48", "date": "March 31, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 102360394}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled with family", "text": "The rooms were really nice. When combined with service, beauty, location and amenities, I cannot imagine needing/wanting to stay elsewhere in Grand Cayman.", "title": "Fantastic stay at Coral Stone!", "helpfulness": 7, "user": "fowlcay", "date": "March 30, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 102175302}], "location": {"country": "Caribbean"}, "stars": 4, "variance": {"poor": 0, "average": 1, "very good": 7, "terrible": 0, "excellent": 78}, "aka": "Coral Stone Club Hotel", "slim_ranking": 0.157894736842, "description": "Coral Stone Club is the perfect setting for your family vacation. All of our units are beachfront and include a patio or terrace overlooking our zero-entry infinity ledge pool, safe for children yet enjoyable for adults. Whether you prefer to walk straight out on world-famous Seven Mile Beach and tickle the sand with your toes, or perch higher up for magnificent views of the beach and ocean, our spacious units - each with 2 or 3 bedrooms and 2 or 3 bathrooms - will make you feel right at home, yet somewhere special. Conveniently located walking distance to eighteen restaurants, three spas, a liquor store, supermarket and other shopping, you and your family can easily stock up on items for quick rejuvenation (and wheel the cart into your unit and leave it in our parking lot when finished). Local attractions include a turtle farm, Sting Ray City, and the Caribbean's largest man made wave, located within a skate park."}