{"user_rating": 4.5, "review_count": 1448, "name": "Corinthia Hotel Lisbon", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "I booked 3 nights in the Corinthia at the beginning of October. It's a nice hotel very close to the tube station. The room was fairly small, although since we were out all day and only used the room for sleeping then this wasn't a problem. Breakfast was amazing, a huge selection of hot and cold food and eggs made to order. There is free wifi in the lobby which was a nice addition. The location is out of Lisbon city centre but given the hotel was a 2 minute walk from the metro, we were in the centre of Lisbon within 15 minutes.", "title": "Nice hotel", "user": "ymous", "date": "October 21, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 84327228}, {"rating": 2.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "My only disappointment was with the spa. €20 for using the jacuzzi for 30 minutes is far too much money.", "title": "Not worth it", "helpfulness": 2, "user": "WallaceCheese", "date": "October 19, 2010", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 1.0, "sleep": 2.0, "rooms": 3.0, "location": 2.0}, "id": 84033911}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled on business", "text": "We selected the Corinthia Lisbon on seeing a special offer for a two night stay. It was a birthday trip so we decided to treat ourselves to a 5 star hotel. Big mistake!. It has 5 stars and prices to match. If you like impersonal hotels with additional “charged” services, this is the one for you. Our check-in experience left a lot to be desired. We had travelled by car from Madrid with our one year old. It was a Friday afternoon and we asked if there was parking in the area. “Parking is available at €18 a day beneath the hotel”, we were advised by the surly receptionist. We asked if street parking was available but she responded that it was all pay parking. We reminded her it was a weekend and she grudgingly admitted that it was free Saturday and Sunday. When we got to our room, we found a supplementary bed had been put in the room rather than a triple room which we thought we had ordered. On reading the small print of the booking form, it became evident that even though the booking engine said Triple Room, the printed booking form stated supplementary bed. We moved the two single beds to one side of the room so we could ensure our child was safe beside us for the night. It felt like too much work to talk to the reception again. We noted the €2.49 bottle of water on the desk. We checked the tea and coffee facilities, 2 decaffeinated coffee sachets, 2 tea sachets, 2 sugars and 1 milk portion. No real coffee. This was taking the “chargeable” element a bit far. We went across the road a bought a litre of milk so as to have our morning coffee next day. The room was clean but basic. The bathroom was again clean and the shower and bath were good with strong water pressure. Bath gowns were provided with slippers. The air conditioning in the bedroom was very loud and we had to turn it off so as not to wake the child. The room became quite stuffy overnight even though the weather was cool outside. The door staff in the hotel were all very pleasant and attentive. The hotel is quite a distance from the centre of Lisbon but is right beside the Metro. We found a number of excellent cafeterias/bars in the immediate vicinity of the hotel. We took a full lunch menu (soup, choice of up to 10 different main courses and dessert and coffee for less than €5 each and a breakfast the following morning for €2.50 each. These were the regular Portuguese prices and the quality was superb. The hotel is in quite an industrial looking area so other than the local eateries, it is best to head directly into Lisbon. There is a zoo in the park nearby, but we did not check it out. All in all, I think we would have been better booking another hotel with a more personable reception staff and more generous in their facilities. It started to feel like Ryanair with a price on everything.", "title": "Incredible value", "helpfulness": 2, "user": "Cliffordpaul", "date": "October 15, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 83628695}, {"rating": 4.0, "title": "well worth it", "text": "The Corinthia is a big hotel, make no mistake but the service and surroundings made for a very comfortable stay. Stunning breakfast buffet catering to most tastes, an indoor pool but with a huge retractable section for fresh air all in a very spa like setting and a lounge that spilled into the outdoors with very comfortable seating. Location while not perfect was very convenient to the excellent metro system and taxis are very affordable. Even the restaurant next door offered excellent authentic food!", "user": "corkgirl40", "date": "October 5, 2010", "id": 82150544}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "just back from the corinthia hotel lisbon, booked in at around 8.30pm on friday night. The man at reception wasnt the most pleasant and offered us twin rooms with a conjoining door (perfect if you have kids staying with you, but we didnt) i explaine we had booked two superior double rooms and in fairness the mistake was quickly rectified. The man checking us in mellowed a little and was quite pleasant after that even recommending a fish restaurant across the road which was superb. we had booked superior doubles with breakfast. All the rooms in hotel are either superior double or suites. The room itself was small but perfectly fitted out. bed was comfy, plenty of pillows, flat screen tv, the only gripe i had was whilst the mini bar was payable (as it usually is in most hotels) they did supply a bottle of water but it was 2.95 euro for same. i feel for a 5 * hotel it would have been nice to supply a bottle of water and maybe a turndown service free of charge. bathroom was adequate with a few toiletaries. rooms, corridors etc were spotless. we had booked breakfast and i must say this was absolutely womderful. plenty of tables, you never had to wait and the hotel did seem full. there was something for everyone from a diet section(which we didnt bother with), hot buffets with the most wonderful omelettes cooked to your liking, cold buffets, absolutely everything, the waiters and waitresses were constantly around to top up your coffee, a few hotels ive stayed in should take note. foyer, bar, toilets, gardens, shop all superb. the bar was small and fairly expensive but i suppose you would expect this in a 5* hotel. The pool is small but is lovely and relaxing, a couple of the railing dividing the childrens section with the main pool were broken and in need of attention. we didnt use the gym but it looked very well equiped. the hotel is out a little, about 5 euro for a taxi into town, however we used the metro right across the road (jardim zoological) is the name of the station and is on the blue line. the metro is perfect for getting around this small city and you can buy a multi day pass which does the buses and the trams. all in all i was delighted with the corinthia hotel and would definitely stay there again", "title": "Fantastic", "helpfulness": 2, "user": "Debstwo", "date": "October 4, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 82083945}, {"rating": 5.0, "stay_parameters": "Stayed September 2010", "text": "We spent there 3 nights and was perfect.The breakfast and the bar and the staff 5 star.", "title": "Perfect in everything", "helpfulness": 2, "user": "Gumilabu", "date": "September 18, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 80069980}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled on business", "text": "Thanks", "title": "Do you want to be able to sleep in your hotel room?", "user": "FailteEire", "date": "September 18, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 2.0}, "id": 79987211}, {"rating": 1.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "If you are looking for a hotel in Lisbon within which you can get a great nights sleep then this is the hotel for you. With good function rooms and a range of conference facilities this hotel is ideal for business meetings.", "title": "A Spa Hotel That Charge's It's Customers Extra For Using The Spa", "helpfulness": 2, "user": "himpantsou", "date": "September 16, 2010", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 1.0}, "id": 79787928}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled on business", "text": "I booked the Corinthia specifcally because I wanted a spa hotel with a little luxury. Nowhere did it state on it's website that to use the jacuzzi/sauna after a long day sight seeing costs extra. It's absolutely outrageous that any hotel, let alone a 5* luxurious one, charges it's guests for us of the swimming pool. It really spoiled my trip hence the 1* rating.", "title": "Excellent both for business and leisure", "helpfulness": 2, "user": "vdbgeo", "date": "August 30, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 77486764}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "Corinthia Lisbon hotel offers excellent service for both business and leisure. Executive rooms on the top floors offer a nice view on the city of Lisbon and include complimentary services on the very elegant 24th floor such as free WiFi, business center, free drinks in the afternoon, a more personalised breakfast service etc. Meeting rooms on the 1st floor are quite convenient and staff is extremely helpful. Good quality coffee breaks and lunch buffets available. Nice environment and hotel is maintained very well; no significant signs of aging or inconvenience otherwise. Very nice and clean hotel overall. Elevators, hallways etc. however tend to be a bit hot and the hallways might need some ventilation to allow some fresh air coming in. I personally feel the air-conditioning in the room was rather limited in power (even though I turned it to 16-18°C the room would never really cool down as expected - this was not really a problem because I kept the curtains closed but a more powerful system would have been appreciated in this range of hotel). Housekeeping, bell-boy, front desk, and other staff members were all very efficient and friendly. Hotel is not located in the center but a taxi would get you right to the center of Lisbon for less than EUR 5 on average (in less than 10 minutes). Hotel is close though to the El Corte Ingles and Cobra shopping malls and within walking distance of the Gulbenkian Museum. For a wide choice of restaurants just take a taxi to the center or the 'docas' area (would recommend 5 Oceanos at Doca de Santo Amaro).", "title": "Nice stay, with a few quibbles", "user": "Amberine", "date": "August 25, 2010", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 76806648}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "The room was really bright our room was on the 20th floor so we had a magnificent view over the city the metro stops right across the street wich is very easy.", "title": "Fabulous Holiday", "helpfulness": 1, "user": "Laurens T", "date": "August 25, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 76775067}, {"rating": 3.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "In our room we had a nespresso machine with 3 types of cupes and the gave us everyday new vanity kits shower caps and the usual bottles of conditioner shampoo bath foam and body milk", "title": "Great value, but not 5 star", "user": "Julie029", "date": "August 23, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 3.0, "location": 2.0}, "id": 76537883}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled with friends", "text": "The breakfast in the skylounge is overwehlming there was a lot to much to choose 9 different types of coffee 9 different types of tea you could order your eggs as you like and the prepared it in front of you it was to much to choose. from 16.00 until 22.00 there were canapees pastry and a lot of drinks for free.", "title": "Magnifique hôtel", "helpfulness": 1, "user": "tessMons_Belgique_", "date": "August 23, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 76447317}, {"rating": 4.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "IF I COULD I WOULD LEAVE AGAIN", "title": "pleasant, comfortable with great views", "user": "ATH04KAR", "date": "August 20, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 76069922}, {"rating": 2.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "We stayed for 4 nights at the beginning of August, for a super rate of 58 euro a night for the room. The staff at the front desk seemed distracted and not very helpful, and as the hotel was full, there were long queues each morning at reception. We arrived late on the first night, so we ate in Tipico Restaurant, which was quite tasty. The staff in the bar were nice, but service was very slow. Our room on the 10th floor was fine, but not to the standard of a 5 star hotel. The pool area was quite dated, and could do with a revamp. As other reviewers have mentioned, the hotel is out of the centre - there are no decent restaurants nearby, so I probably wouldn't stay in this area again. Overall, it was excellent value for money, and our stay was quite pleasant, but a 4 star hotel at best.", "title": "Not as expected for a 5 star", "helpfulness": 1, "user": "crocettesontour", "date": "August 20, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 1.0, "rooms": 1.0, "location": 3.0}, "id": 76063361}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "The hotel location is great, close to the underground station (4 minutes away) on the blue line which takes you directly to the town center, Baixa.", "title": "Nice breakfast, incredible staff, good location", "user": "traveling_peach2", "date": "August 19, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 75872572}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "The breakfast is really all you would expect for a five star hotel: cold food, hot food, a chef preparing waffles, omelet and fried eggs on request, and a lot of fruits. You can also have breakfast on the terrace which is pretty nice in these summer days.", "title": "Executive Lounge terrific - Executive floor room not so terrific", "user": "EarlJ", "date": "August 13, 2010", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 5.0, "sleep": 5.0, "rooms": 3.0, "location": 4.0}, "id": 75073638}, {"rating": 3.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "The only surprise was the room, which is not as large as you would expect for a five star hotel. It was clean and all that, but not very big. The bathroom is really big with bathrobes and slippers; the windows in the room work their magic in keeping the noise outside.", "title": "Superb breakfast and OK hotel amenities at good price - but no five stars for room!", "helpfulness": 1, "user": "Karin_H_Gbg", "date": "August 11, 2010", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 2.0, "location": 3.0}, "id": 74779178}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "The swimming pool is rather small, but you are also given towels and bathrobes. They have an outside area where you can sunbathe.", "title": "Large modern hotel located on outskirts of city close to airport.", "user": "Noniem", "date": "August 11, 2010", "detail_rating": {"service": 2.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 74720144}, {"rating": 4.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "Another good \"asset\" of the hotel is the staff: they are really helpful in explaining whatever you need. Their English is perfect. We rented a car from the reception and they were more than nice, we asked for directions and we were helped every time, check in and check out went smoothly.", "title": "Lovely hotel beside the Zoo", "user": "dollyw", "date": "July 5, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 69733022}], "location": {"country": "Portugal", "region": "Estremadura", "continent": "Europe", "city": "Lisbon"}, "stars": 5, "variance": {"poor": 44, "average": 130, "very good": 463, "terrible": 22, "excellent": 789}, "aka": "Lisbon Corinthia Hotel", "slim_ranking": 0.0954545454545, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.0}, "description": "Style and modernity conveniently located in the heart of Lisbon financial district, the Corinthia hotel is a landmark of the city. Overlooking the 18th Century Aqueduct and Monsanto Nature Park the Corinthia is only steps away from the Calouste Gulbenkian Museum, the Zoo and the most upscale shopping areas. Comfort and detail were put into the design of the guestrooms and suites. The Executive Club guests enjoy the exclusivity of the rooms and suites located from 20th to the 23rd floors, featuring direct access to the Executive Club Sky Lounge with special privileges. From leisurely to al fresco breakfasts to formal fine dining, our restaurants and bars lead you to discover the best of Portugal’s exquisite flavours."}