{"user_rating": 4.0, "review_count": 702, "name": "Cornell Hotel de France", "reviews": [{"rating": 1.0, "stay_parameters": "Stayed September 2008, traveled with friends", "text": "Stayed 9/22-23/08. We were four couples travelling together, booked by the same travel agent. Room was dinky, and it was one of the larger of two sizes offered; we were the only room with a fan, and needed one badly (A/C) would have been nice; we need a refrigerator/freezer for medicines, were told the restaurant refer/freezer would be available; turns out the restaurant folks didn't care much for that, they had done a lot of painting without marking fresh areas, so I ruined a shirt trying to get to the refer/freezer. Free breakfast is choice A or B, no menu; Service in restaurant was slow, with a sultry server. Front desk person (man) was rude when asked about internet use, getting medicine from refer/freezer. Phone calls are billed whether they are connected or not. Hotel is next door to male strip club with heavy outdoor advertising.", "title": "Disappointing facility and personnel", "user": "FatAlaskan", "date": "November 1, 2008", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 2.0, "cleanliness": 2.0, "value": 3.0, "location": 3.0, "rooms": 2.0}, "id": 21459933, "likes": {"liked": "— Price", "disliked": "— Staff & facility"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2008, traveled with family", "text": "Won't be staying there again. Will advise agent to not book others there.", "title": "Vraiment Francais!", "user": "Corpus", "date": "October 22, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 21101435, "likes": {"liked": "— Location", "disliked": "— Some street noise"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "This hotel in SF is real French! Lavishly decorated hallways and rooms and a French landlady. Our room was relatively spacious for two adults and a 2-year-old, with a bathtub/shower and all necessary amenities.", "title": "Charming place", "user": "nurselindam", "date": "October 3, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 20582150, "likes": {"liked": "— location and comfort", "disliked": "— room size"}}, {"rating": 1.0, "title": "Seriously Sub-par", "text": "Breakfast is included in the price and served in Jeanne d'arc, the basement French restaurant. The breakfast is simple but sufficient and not lacking in quality. Tips are not included.", "user": "haleygolightly", "date": "September 19, 2008", "id": 20203494}, {"rating": 1.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "The hotel is situated very conviniently, 30 meters from a cable car stop and within walking distance of Union Square (shopping galore!), Chinatown (2-3 blocks) and Market Street (4-5 blocks). The neighbourhood is nice, we experienced no problems walking there at nighttime.", "title": "Awful!", "user": "delilah86", "date": "September 7, 2008", "detail_rating": {"front_desk": 1.0, "business": 3.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "location": 4.0, "rooms": 1.0}, "id": 19860529, "likes": {"liked": "— location", "disliked": "— Room, service, price"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2007, traveled with family", "text": "My teenage daughter and I go to SF every year and like to occasionally try hotels we've researched in advance. We always stay in the Union Square area. We stayed at this older hotel 2 nights in Feb 2007 and loved it. It's just around the corner from Powell street. We happen to enjoy the sound of cable cars and could hear them a little.", "title": "loved the Cornell", "helpfulness": 2, "user": "SMLJ", "date": "April 29, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 7482814, "likes": {"liked": "— LA Times and Trip Advisor"}}, {"rating": 4.0, "title": "Interesting Hotel. .. and affordable", "text": "The Victorian-style Deluxe Queen room and bath were very clean, quaint, and had a pretty chandelier and two windows. Most importantly, the bed had very nice, soft linens and was more comfortable than more expensive hotels. The room temperature was fine and there were plenty of pillows. The claw-foot tub and shower were really great, looked new, and had better pressure than many other hotels. The only down side was the black vinyl couch-it really was unappealing and tacky. The elevator was really charming and the hotel's decor includes French paintings.", "helpfulness": 2, "user": "mickers5", "date": "February 28, 2007", "id": 6891572}, {"rating": 1.0, "title": "Not so hot.", "text": "The owners were accommodating, we could check in by 11:30 am and they had no problem holding our luggage for a few hours after we checked out. The complimentary breakfast was just right and the dining room was really adorable, it was fun and decorated in a Joan of Arc theme.", "user": "Edskid", "date": "February 15, 2007", "id": 6797445}, {"rating": 4.0, "title": "Sweet Boutique Hotel", "text": "We did learn you canNOT catch a cable car on that corner, waited through 4 cars, then just walked down to the turnaround and got on. As an aside, Sears Fine Food is really good, just down Powell, and the Daily Grill has delicious dinners. For the price, location, and comfy room, we would definitely stay here again.", "helpfulness": 4, "user": "Lightpost", "date": "February 7, 2007", "id": 6757391}, {"rating": 4.0, "stay_parameters": "Stayed December 2006, traveled with family", "text": "Spent 6 nights in this hotel in Jan., 2007. It is a small hotel right off of the Powell St. Cable Car line about 2 blocks from Union Square. It is easy to get to from the BART if you do not mind climbing a steep hill.", "title": "Great location", "helpfulness": 1, "user": "S_S", "date": "December 28, 2006", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 3.0, "value": 4.0, "rooms": 3.0, "location": 5.0}, "id": 6509182, "likes": {"liked": "— Location", "disliked": "— Room was too small for 3 people"}}, {"rating": 5.0, "title": "A wonderful little hotel", "text": "This is a lovely hotel. Flowers welcome you as you enter the lobby and the entire facility is in pristine condition. In my opinion, the location is the best in town. The Cable Car stop is practically at your doorstep. Union Square, Market Street, and Chinatown are all within easy walking distance. There are restaurants and shops galore.My single room was tastefully decorated and could not have been cleaner. The bed was a dream to sleep on. In addition, the room was unbelievably quiet.", "helpfulness": 7, "user": "nmsouthwest", "date": "March 23, 2004", "id": 1741126}, {"rating": 4.0, "title": "San Francisco charm", "text": "Breakfast was included in the rate and it was delightful. Served in the dining room, each table was covered with linen and adorned with fresh flowers. A different juice was served each morning along with a robust coffee. A choice of hot cereal was followed by a delicious combination of eggs, hash browns, bacon, toast and slice of fruit. French Toast was also an option. The staff was absolutely great!By all means, dine at the hotel restaurant. I took advantage of the weekly rate and enjoyed five marvelous French meals. Each included a hearty soup and generous basket of delightful bread. Salads were fresh and creative, entrees were expertly prepared, and deserts were absolutely divine. I cant say enough about the superb service. My waiter, Dan, was perfectly attentive without being fussy.I adore the Cornell - a fantastic discovery. I cant wait to go back.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "December 15, 2003", "id": 1518039}, {"rating": 1.0, "title": "Doesn't deliver, not even close.", "text": "We spent just three days in November at the Cornell and found it charming with all the character of an older San Francisco boutique hotel that we expected. I have used at least 15 San Francisco hotels over the past few years ranging from the best to moderate hotels and this is the first time I will definately book our next visit at the same place. When staying dont forget to greet the owners wonderful dog \"Bon Jour Noel\" and he will respond accordingly.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "November 29, 2003", "id": 1501778}, {"rating": 4.0, "title": "French Style and Charm, Great Location, Incredible Value", "text": "My \"medium size\" room was not worth the ninety dollars plus 15% tax plus sixteen dollars a day parking. It had very noisy steam heat that worked only part of the time and there wasn't even a toilet paper holder in the bathroom. There was just a roll of paper sitting across the b'room--not at all convenient. The prix fix dinner was just fair.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "November 23, 2003", "id": 1496874}, {"rating": 5.0, "title": "NY Times travel section does it again!", "text": "Veggie overcook and potatoes stale. I left early so I wouldn't have to stay in that flop-house room.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "July 29, 2003", "id": 1153365}, {"rating": 4.0, "stay_parameters": "Stayed May 2005", "text": "The Cornell is a cozy gem at a great price (it is SF after all, \"cha-ching\"), especially since it incuded a large and tasty breakfast. Everything about the building oozes old world charm and loving care, from the gargoyle corbel at the room's ceiling and the carved cherub on the bathroom door, to the artwork and stained glass in the hallways. Even the restored elevator was lovely, and it made our day when Noel the Golden Retriever greeted us. It's SO nice to stay in a place that feels like a home away from home, instead of a sterile box under a chain hotel sign.", "title": "Charming building, kind staff, central location, good value", "helpfulness": 11, "user": "Tammy Q", "date": "May 25, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 3500513}, {"rating": 4.0, "title": "Great location, great value", "text": "We were in a medium sized room for four nights and never felt cramped. We had ample closet space to get luggage out of the way, a nightstand at each side of a comfortable mattress, two reading lamps, and a bathroom large enough for free movement around the claw foot tub. Everything was spotless and every single staff person we crossed paths with was kind and helpful. City noise did come through the windows, but that's life in an old building that rests in a busy city. Reservations and paperwork were a breeze.", "helpfulness": 1, "user": "Marshall M", "date": "December 15, 2004", "id": 2883034}, {"rating": 4.0, "title": "good & bad", "text": "The location is great for coming and going to the airport. For five bucks each, we got on the BART train at SFO airport and then got off at the Powell/Market stop about five blocks from the hotel. No need to transfer or anything. The walk from the Powell/Market stop was simple enough with luggage, and only took us a few minutes -- although the last block was steeeeep. When it comes to getting around the city, the cable car is just a few doors away, and within a couple blocks there are a few bus lines to choose from.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "October 6, 2004", "id": 2623390}, {"rating": 5.0, "stay_parameters": "Stayed August 2004", "text": "The only thing we would do differently for a return trip would be to move down a few flights. We were on the top (6th) floor, and even though the radiator was turned off, it was hot in our room. You can't stop heat from rising, but you can request a room on one of the lower few floors.", "title": "A Marvelous Little Hotel", "helpfulness": 5, "user": "elevatorguy", "date": "September 14, 2004", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 2571231}, {"rating": 5.0, "title": "Stopping at the Cornell; intimate, excellent restaurant!", "text": "The only thing stopping me from giving the Cornell a 5-star rating here is that we didn't have the option to say \"no linen service today.\" Given the number of hotel rooms in a large city, the waste that goes into washing never-used fresh towels and still-clean sheets every day is overwhelming. In our opinion, the least we can do is be good stewards and curb our wastefulness, and we wish we had had the opportunity to do our part.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "September 14, 2004", "id": 2571065}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "What a treat this was. Sometimes things look better on the internet than they do in Real Life - not so in this case. The real thing is much better than it looks on line.", "title": "An amazing place - in an amazing place", "helpfulness": 2, "user": "mohicans", "date": "August 26, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 8509889, "likes": {"liked": "— Elegant Hotel, fantastic location.", "disliked": "— Had to pay for internet use."}}, {"rating": 2.0, "stay_parameters": "Stayed August 2007, traveled on business", "text": "This property is historic - almost 100 years old. It has an old fashioned elevator and rooms that are up to date, however with the integrity of the building's history intact. Very tastefully and elegantly decorated - all things French. The staff are friendly, but not in-your-face. The breakfast that is included is the best we had in California - and we toured the entire coast. If you have the money, don't miss out on the set menu dining experience in the resaurant - it is outstanding. Have a glass of wine - their house white is the best I've ever had.", "title": "So-so experience", "helpfulness": 1, "user": "Arapahoe", "date": "August 25, 2007", "detail_rating": {"front_desk": 2.0, "business": 2.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 3.0, "rooms": 2.0}, "id": 8504006, "likes": {"liked": "— Price, cleanliness, French decorating, inexpensive Internet in lobby, location, Chinese employees", "disliked": "— Hot room, French owners seem ed irritated by questions"}}, {"rating": 2.0, "stay_parameters": "Stayed August 2007, traveled with friends", "text": "The location can't be beat - hop a cable car a couple of doors down. Or walk down the hill to Union Square. We will not stay anywhere else now, I think we really found a gem with this place!", "title": "Mildew smell not good for allergies", "user": "lseut", "date": "August 21, 2007", "detail_rating": {"front_desk": 1.0, "service": 2.0, "cleanliness": 2.0, "value": 2.0, "rooms": 2.0, "location": 4.0}, "id": 8461494, "likes": {"liked": "— location, breakfast", "disliked": "— mildew, no A/C, evening front desk man,"}}, {"rating": 4.0, "title": "Cornell Hotel is a hidden gem!!", "text": "I stayed at the Cornell Hotel de France several years ago and enjoyed it. However, when I returned for a five-day stay from August 16th through the 21st of 2007, I was disappointed.", "helpfulness": 2, "user": "hamn", "date": "August 2, 2007", "id": 8281635}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "My daughter had booked a \"cozy\" room with one queen bed because that was the only room available that weekend. Our one window opened onto a ventilation shaft, which was unattractive and provided no ventilation. The overhead fan helped some, but it was too hot to sleep well. Since the room wasn't on the street, it was quiet. I never missed air conditioning in San Francisco before, but it was a problem this time.", "title": "A Great Find!", "helpfulness": 1, "user": "Casacarajo", "date": "May 22, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 7671916, "likes": {"liked": "— Excellent location near shopping and transportation", "disliked": "— No complaints"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2006", "text": "I stayed at this hotel for four nights during the week of my 40th birthday celebration. Absolutely loved the place! The rooms may be a bit on the small side, but they are cozy and feel like a bedroom as opposed to a sterile, generic hotel room from one of the chains. The rooms are clean, and there's plenty of closet space and good water pressure in the showers. I will gladly stay at this hotel on my next trip to San Fran, but I will bring my own hairdryer next time. There is one in the room, but it was pretty weak and didn't work very well. This is a very minor complaint--everything else was fabulous. The staff was warm, friendly and very helpful. The price and location can't be beat, and I felt totally at home. I had my 40th birthday dinner there, and the chef prepared my soufflet with a birthday candle! My waiter sang \"Happy Birthday\" to me too--it was so sweet and so appreciated. I highly recommend this hotel and can't hardly wait to go back.", "title": "Totally loved this hotel!", "helpfulness": 3, "user": "JeanAnderson", "date": "June 6, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 5315090}, {"rating": 4.0, "stay_parameters": "Stayed May 2006", "text": "We spent ten days at The Cornell for a four-generation family reunion, and had not been there for 17 years. Much had changed, and all for the better. Knowing it was small, quaint and had few public spaces, we worried about whether it would work for our grandchildren (5, 3 and 2 months) as we knew the hotel was not used to small children. But it was fine, and the little ones adored the dog, the glass elevator, running up and down the stairs, and the medieval decor in the restaurant. 20 family members from 2 months to 91 years gathered here, and no one had any complaints other than some rooms being too warm and one window in a room with kids having no screen. (Be warned though that the connecting rooms available for families are quite small and somewhat less upscale than the others.) All others were much more than adequate, and contained everything to make for a comfortable stay, including good matresses, ample closets, good water pressure, hair dryers, TVs, and superb cleanliness. Ours, in the back on the 4th floor, was not at all crowded, and delightfully cool. And unlike some of the reviewers, we heard no internal noise from other rooms, not even our infant grandson crying just across the hall. Yes, there was outside city noise, but I found the cable car clanging to be a charming lullabye at night! The staff were incredibly warm and friendly, the breakfasts were excellent, and the two dinners we had at the well reputed and very attractive restaurant were outstanding. This may not be a hotel for the business traveller who wants the high tech gizmos, or the yuppies who are accustomed to the anemities of a a $400 a night hotel room. But it is an outstanding European style small hotel in an outstanding location in San Francisco, at a very affordable price, including the parking across the street. I recommend it very highly. And if you go, pat the dog for me, and say hello to Madame and Monsieur for me as well.", "title": "Ready to go Back", "helpfulness": 4, "user": "VTDFR", "date": "May 24, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 3.0, "service": 5.0}, "id": 5205333}, {"rating": 3.0, "stay_parameters": "Stayed September 2005", "text": "DFR, S. Strafford, VT", "title": "This Little Gem Needs Some Polish", "helpfulness": 13, "user": "Take_Me_Home_Now", "date": "September 21, 2005", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "rooms": 2.0, "service": 3.0}, "id": 3928075}, {"rating": 5.0, "stay_parameters": "Stayed September 2005", "text": "My partner and I recently returned to the Cornell Hotel after having stayed here once before in 1998. Not much has changed, which is both good and bad.", "title": "A wonderful litte French Hotel", "helpfulness": 6, "user": "BAFeller", "date": "September 17, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3911795}, {"rating": 2.0, "title": "Service was awful", "text": "First, the good: you can't beat this hotel's location, just off of Union Square. You also can't beat this hotel's price, which includes a yummy full breakfast in a restaurant decorated like a castle (which is located in the hotel's basement!); just remember, press \"B\" in the elevator for \"Breakfast.\"", "helpfulness": 6, "user": "Gigi-on-the-Go", "date": "June 14, 2005", "id": 3554703}, {"rating": 3.0, "stay_parameters": "Stayed October 2006, traveled solo", "text": "I spent 5 nights at the Hotel de France for vacation in San Francisco. The location is excellent close to the cable cars and within walking distance of Union Square and Market St. There are many restaurants close by and the hotel provides a breakfast that is free with your stay. That said the breakfast is just average and there is no choice of juice, something which I found inexplicably annoying.", "title": "Value for Price", "helpfulness": 1, "user": "PARIS182", "date": "November 27, 2006", "detail_rating": {"front_desk": 3.0, "service": 2.0, "cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "location": 4.0}, "id": 6181062, "likes": {"liked": "— Location", "disliked": "— Varfiable service"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "The rooms are of average size, clean but a tad down at heels. Mine had an ugly black vinyl sofa that somewhat spoiled the effect of any attempt at \"decor\" that might have been attempted. That said the rooms are clean and the baths are more than adequate and there is a huge claw foot tub. (If someone in your party is physically challenged this may be a problem.)", "title": "Recommended", "helpfulness": 1, "user": "ed30", "date": "November 15, 2006", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 6132589, "likes": {"liked": "— Location", "disliked": "— lack of keys."}}, {"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "Public areas are quaintly charming and the elevator is amusing and works remarkably well for its age.", "title": "Great Location", "helpfulness": 1, "user": "stlcurly", "date": "October 15, 2006", "detail_rating": {"front_desk": 3.0, "service": 3.0, "business": 3.0, "cleanliness": 4.0, "rooms": 3.0, "location": 5.0}, "id": 5956242}, {"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled with family", "text": "They have an excellent dining room, however I am not sure as I would recommend the package that they offer due to the many dining choices offered in SF.", "title": "Charming hotel", "user": "katpaws", "date": "October 11, 2006", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 3.0, "value": 5.0, "rooms": 3.0, "location": 5.0}, "id": 5943687, "likes": {"liked": "— location and price", "disliked": "— small bathroom"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2006, traveled with friends", "text": "Service is wildly variable and I agree with a previous reviewer that the gentleman who owns the hotel does not always seem like he wishes you were there. There also seems to be an unseemly emphasis on the bill, and while I only ate one of the two meals in the dining room, nothing was deducted from my bill.", "title": "Loved the Hotel Cornell de France!", "user": "Marell", "date": "October 6, 2006", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 5923874, "likes": {"liked": "— value for cost", "disliked": "— slow elevator"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2006, traveled on business", "text": "Booking via email and phone was easy and they responded promptly We originally booked one night, and while there we decided to stay another, and the staff was very helpful in making this happen conveniently, which involved a room change.", "title": "great hotel for the price.", "user": "stacydi", "date": "September 22, 2006", "detail_rating": {"front_desk": 2.0, "business": 2.0, "service": 3.0, "cleanliness": 2.0, "value": 5.0, "location": 5.0, "rooms": 2.0}, "id": 5828346, "likes": {"liked": "— Location", "disliked": "— Size of room"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "I would definitely stay there again, hopefully for longer.", "title": "perfect place to stay in SF", "helpfulness": 2, "user": "hildig", "date": "September 13, 2006", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 5797509, "likes": {"liked": "— location and price", "disliked": "— Nothing not to like"}}, {"rating": 3.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "I stayed at Cornell while traveling on business by myself. It's in a great location. You can walk to anywhere in Union Square, the Financial District, and even South of Market for work. Since I didn't have a rental car, it was also nice to be able to walk to Chinatown or even Nob Hill to get something to eat. (by the way, try Bar Cruda's chowder-best I've ever had!!)", "title": "Basic, but great location", "user": "Aling", "date": "August 22, 2006", "detail_rating": {"front_desk": 1.0, "business": 4.0, "service": 1.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 5691779, "likes": {"liked": "— Location", "disliked": "— Staff"}}, {"rating": 1.0, "title": "Nice location but very poor customer service", "text": "I am surprised to read some reviews by people that criticize this hotel. It is in a perfect location, and most rooms are under $100 a night including breakfast. Good luck finding anything that compares to this. My room was small with little to no flair. But, I was not in my room very much and it suited me just fine. It is a little bit dated, the carpet in my room looked like it had been through a bit. I wouldn't label it as clean, but I also wasn't disgusted.", "helpfulness": 7, "user": "FlowerLover77", "date": "July 1, 2006", "id": 5415594}], "location": {"country": "United States", "city": "San Francisco"}, "stars": 3, "variance": {"poor": 21, "average": 55, "very good": 301, "terrible": 18, "excellent": 307}, "aka": "Cornell Hotel San Francisco", "slim_ranking": 0.102127659574, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.0, "rooms": 4.0, "location": 4.5}}