{"user_rating": 4.5, "review_count": 34, "name": "Coronet Motel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "Like several other reviewers, we needed a simple, inexpensive place to stay for one night near Stanford. Based on TA reviews, we chose this place. It's not perfect but, value for money, it's the best bargain around Stanford. The **only** drawback this place has is that it's on El Camino, which is a busy 4-lane street, so there is some traffic noise. I sleep with ear plugs anyway, so it wasn't a bother for me. The woman working at the front desk was extremely helpful, even bringing us a lightweight blanket more to our liking that the duvet on the bed. It was 80+ degrees when we arrived and I smiled when I saw the air conditioning unit -- It was just like the ones we encountered in Southeast Asia, super efficient. The rooms have been recently remodeled and they are very nice. The bathroom, with the glass-enclosed shower stall and tile walls and floor, was definitely a step above any similar-priced place I've ever stayed. There was a little kitchenette, a good desk and office chair, and free WiFi. Back when I was traveling for business this would have been ideal. HIghly recommended", "title": "Thank you, Trip Advisors!", "helpfulness": 1, "user": "jbullock47", "date": "October 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 143084753}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "Needed to stay somewhere one night to visit Stanford. Most places in Palo Alto are very expensive or very questionable. I booked here based on other reviews.", "title": "Inexpensive for Palo Alto, close to Stanford", "helpfulness": 1, "user": "frontrangeskiier", "date": "October 17, 2012", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "location": 5.0, "value": 5.0, "rooms": 5.0}, "id": 143009132}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled on business", "text": "When we pulled up, my wife thought I had made a big mistake. From the outside, just an old questionable motel. But the rooms were very updated, and very nice, and the beds very comfortable. It was also very clean, even the bathroom sparkled. It was plenty good for a quick stop for the night.", "title": "Slept like a baby!", "user": "Kaylee B", "date": "September 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 140368181}, {"rating": 5.0, "title": "Great Updated Motel near walking street", "text": "My wife was a bit sketchy with the location on the strip, but I've stayed in Palo Alto on the strip before (at Creekside) and was not worried about it.", "helpfulness": 1, "user": "nolatravel", "date": "September 14, 2012", "id": 140211423}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled on business", "text": "And Izzy's Brooklyn Bagels was right around the corner. And the Stanford visitor was about 7 blocks away. That worked for me.", "title": "Awesome!", "user": "Sarah B", "date": "August 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 138733840}, {"rating": 4.0, "stay_parameters": "Stayed August 2012", "text": "Very clean, newly renovated rooms. Great friendly staff, a little road noise. Very comfortable bed. I just can't say enough nice things about this place. Great value! Staff was so helpful with public transportation schedules. Did I tell you wAs a single woman alone on this stay and felt VERY safe! Don't miss this jewel", "title": "I'm coming back to this one!", "helpfulness": 2, "user": "Luv2goplaces2", "date": "August 20, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 137743360}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled on business", "text": "This place is very clean and has a simple elegance. I had a very enjoyable stay at this motel, and the front desk was very courteous. Even though it is a motel, it is probably better than many hotels. It is also close to many restaurants and Stanford University.", "title": "Excellent place to stay with great rate", "helpfulness": 1, "user": "airahmed", "date": "May 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130280115}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "we were in palo alto for a conference, and stayed for two nights in Coronet motel. it was a nice place, great location, very clean and the mangers were very kind. we really enjoyed our stay at the motel.", "title": "it was great", "user": "Kbarare", "date": "May 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 129982321}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "The Coronet Motel is a good little motel on El Camino Real, off California Avenue. The owners are a lovely couple who looked after us so well during our stay there. It's convenient on foot for a number of locations including restaurants, buses, and the Caltrain. The rooms are kept very clean and pleasant, and are a good size with decent amenities. I'd stay here again or recommend it to friends. The only downside is it's a little noisy, being so close to such busy roads, and breakfast was a basket of fruit and muffins in the motel office lobby. This wasn't such a problem with the amount of excellent places to eat in the area though!", "title": "Great owners, super convenient location", "helpfulness": 2, "user": "ZenithBlue81", "date": "April 4, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 127226594}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled on business", "text": "I am in town for a business trip and wanted to find a place close to the business. I googled the address of the business and the Coronet was the closest place to there. Since I will be in Palo Alto for 4 weeks, I figured I would try this place based on other reviews.", "title": "Very Nice for the price", "helpfulness": 3, "user": "Todd F", "date": "January 18, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 123240123}, {"rating": 4.0, "stay_parameters": "Stayed November 2011", "text": "Stayed for business and loved it. Rooms have been redone and beds were so comfy. Owners are delightful and I loved being there. Delivery trucks in the wee hours can be noisy but didn't bother me. Can't wait to return!", "title": "Little gem", "helpfulness": 2, "user": "Annfhg", "date": "November 9, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 4.0, "rooms": 5.0}, "id": 120403490}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled on business", "text": "I loved my home away from home! I spent a week at the Coronet for a seminar at Stanford. The proprietors were very nice and helpful. I expected a normal motel room but was ecstatic to find a little 2-room APARTMENT! with a lovely newly remodeled bathroom and a vanity, bid closet, ironing board, kitchen with granite counters, refrigerator, big desk Anne lamp and a couch. the linens were new and luxurious, the pillows enviable. The living room was perfect as a study, with a floor lamp. The TV was large. They were remodeling on the outside and are planning new landscaping. Breakfast included fruit and juice bottles,chocolate milk, and water bottles, not just pastries. Don't remember if there was cereal. Marguerite Shuttle to Stanford stops right nearby, parking free in front. I recommend. Surrounded by great interesting restaurants on California St. Olive garden next door.", "title": "Suite was a wonderful surprise.", "helpfulness": 3, "user": "Traveler438", "date": "August 28, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117366876}, {"rating": 4.0, "stay_parameters": "Stayed February 2011, traveled with family", "text": "The Coronet Motel is in a great location for visiting the Stanford campus (thanks to the shuttle stop, and proximity to the campus itself) and for getting to and from Palo Alto via Caltrain (thanks to the nearby station). The room was big and comfortable, the bathroom was well-lit and private (none of the dreaded sink-and-mirror-outside-the-door), with a good shower, and the proprietors were very helpful. Restaurants and shops are nearby.", "title": "very nice!", "helpfulness": 2, "user": "Viatores", "date": "February 20, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 97326845}, {"rating": 3.0, "stay_parameters": "Stayed October 2010, traveled on business", "text": "My mother stayed here for about 3 weeks with different family memebers spending the night with her while dad was at Stanford Hospital. The new rooms are very nice and the owner did everthing they could do to make my mom's stay comfortable. Fun to be able to walk down California street for dinner!", "title": "new rooms", "helpfulness": 4, "user": "4funFairOaks_CA", "date": "October 28, 2010", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 85178461}], "location": {"country": "United States", "city": "Palo Alto"}, "variance": {"poor": 1, "average": 2, "very good": 11, "terrible": 0, "excellent": 20}, "slim_ranking": 0.0833333333333}