{"user_rating": 4.5, "review_count": 367, "name": "Cortiina Hotel", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed June 2005", "text": "I appreciated the Cortiina's sense of minimal style -- but the room was just plain dysfunctional. I doubt that any of the designers ever spent a night there. There wasn't a lamp that could be used for reading or a comfortable chair to sit in. The shower was a mystery and if you closed the bathroom door, it was a struggle to reopen. The clothes rack in the closet was so high up only the tallest of Germans could reach it with any ease. But the bed was wonderfully comfortable. And the location is great. For what you get at the price they charge, however, the Cortiina is definitely overpriced.", "title": "Minimal to the Point of Dysfunctional", "helpfulness": 9, "user": "JamesV79", "date": "July 19, 2005", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 2.0, "service": 4.0}, "id": 3682530}, {"rating": 4.0, "title": "Fabulous", "text": "Loved the Cortiina. The service was excellent, the breakfast was excellent, the room was very nice (hated the pillows). The location is perfect for sight seeing. Highly recommend.", "helpfulness": 7, "user": "hibi428", "date": "May 17, 2005", "id": 3478659}, {"rating": 5.0, "stay_parameters": "Stayed April 2005, traveled on business", "text": "Discovered the Hotel Cortiina through a popular tv travel program and they were not wrong. Located on a narrow lane in the warren of the old city, Hotel Cortinna offers guests a bargain. The studio single suite I occupied for seven days was one of the best and friendliest experiences of my trip to Europe. Surrounded by wonderful array of little shops, services, and restaurants in the old city center, this place is a treat for those who like the smaller full-service hotels. I had a fourth floor enormous room with separate seating area and desk work station. The room could be connected to a larger suite. Modern, comfortable, and great amenities in the ultra-modern bathroom was perfect.", "title": "Italian Chic with Boutique Style", "helpfulness": 11, "user": "azindn", "date": "May 1, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 4.0}, "id": 3428926}, {"rating": 4.0, "stay_parameters": "Stayed June 2004", "text": "Breakfast was a real meal with fresh breads, yogurts, loks and bagels, juices, cereals, and pastries served with fresh coffee or assortments of teas. Loading up at breakfast carried one through the day. At night, the hotel restaurant was popular and loud with the bar a social scene for the fashionista. Excellent foods everywhere, wonderful selection of choice wines and beers made dining a treat. I'd stay here again and again.", "title": "Great style, service, & location", "helpfulness": 13, "user": "EuroTrav", "date": "January 3, 2005", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 4.0, "service": 5.0}, "id": 2971778}, {"rating": 4.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "The Cortiina is a good, small hotel with a superb location close to the Marienplatz, the Viktualienmarkt and Maximilanstrasse shopping area (much nicer than the hotels near the Hauptbanhof). There are lots of good places to eat, walk and shop within easy walking distance of the hotel, and it's an area that's just a pleasure to stroll through.", "title": "Good hotel, great location", "helpfulness": 3, "user": "MarkoP", "date": "February 12, 2007", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 6781470}, {"rating": 4.0, "stay_parameters": "Stayed February 2006", "text": "The rooms vary in size but even the small ones are reasonable; bathrooms in the smaller rooms are quite tight. Good shower with good pressure, easy to use; nice bathtub; generously-sized Kiehl's products. Note the bar is very popular on weekend nights and if you're concerned about noise, you might request a room at the back or on a higher floor.", "title": "very nice", "helpfulness": 2, "user": "idopollak", "date": "November 24, 2006", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 3.0, "rooms": 4.0}, "id": 6171187}, {"rating": 4.0, "stay_parameters": "Stayed June 2006", "text": "The beds are some kind of foam and are pretty comfortable; the pillows are extremely thin.", "title": "Nice modern hotel...", "helpfulness": 6, "user": "Member in Philadelphia", "date": "June 26, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "service": 4.0}, "id": 5391715}, {"rating": 5.0, "title": "Fantastic Oasis in the Heart of Munich", "text": "Breakfasts are very good (I recommend the delicious salmon) - fresh orange and grapefruit juice, good coffee, fresh bread, good cheese, jogurt, fruit and fruit salad, served in the lounge with a large gas fireplace.", "helpfulness": 10, "user": "usact", "date": "June 23, 2006", "id": 5376503}, {"rating": 4.0, "title": "Design, style, in a special boutique hotel...", "text": "Front desk service was uneven - everyone tried to help, but some of the staff seemed defeated by even simple questions (e.g. location of international press stand; neighborhood directions).", "helpfulness": 9, "user": "A TripAdvisor user", "date": "October 29, 2005", "id": 4070412}], "location": {"country": "Germany", "continent": "Europe"}, "stars": 3.5, "variance": {"poor": 9, "average": 22, "very good": 122, "terrible": 7, "excellent": 207}, "slim_ranking": 0.0416666666667}