{"user_rating": 3.5, "review_count": 449, "name": "Cortona Inn & Suites Anaheim Resort", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed February 2006", "text": "Maybe the Cortona Inn and Suites is improving because of past reviews, I don't know, but our experience was definitely better than previous reviews. We had also just spent one night down the street at the Super 8 which was disgusting ( to say the least) so the Cortona was very pleasant for us.", "title": "Was Great!", "helpfulness": 8, "user": "madlexi", "date": "March 2, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 3.0}, "id": 4568857}, {"rating": 4.0, "stay_parameters": "Stayed February 2006", "text": "We called the hotel direct to reserve a kid's suite. I was able to get them to lower their price to $80.00 a night with AAA membership... a very good deal!", "title": "Good Hotel for the Price", "helpfulness": 4, "user": "3562543", "date": "February 20, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "service": 3.0}, "id": 4473926}], "location": {"country": "United States"}, "stars": 2.5, "variance": {"poor": 54, "average": 93, "very good": 158, "terrible": 54, "excellent": 90}, "aka": "Cortona Inn & Suites Anaheim Hotel", "slim_ranking": 0.576576576577, "description": "Welcome to the Cortona Inn & Suites Anaheim Resort and proudly serving guests from around the world since 2004. Located just a block and a half away from the Disneyland® Resort and adjacent to the Anaheim Convention Center. Thoughtfully set-back off Harbor Boulevard, the Cortona Inn & Suites allows you to enjoy our peaceful and quiet surroundings yet still be within footsteps of everything the Anaheim Resort has to offer. The Cortona Inn & Suites offers a choice of all non-smoking deluxe rooms with king bed or two queen beds as well as one-bedroom Siena Executive Suites and one-bedroom Toscana Kids’ Suites. For larger families, we also offer a spacious Two-Room Family Suite. All rooms and suites feature free internet access/wireless internet, refrigerator, microwave oven, color cable TV, iron/ironing board and more. Enjoy our complimentary deluxe continental breakfast with hot items each morning and parking at no additional charge. Relax, unwind and enjoy your visit to the Anaheim Resort and Disneyland® Resort Parks at the Cortona Inn & Suites."}