{"user_rating": 4.0, "review_count": 1052, "name": "Cosmopolitan Hotel - Tribeca", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "We stayed 25-28 Sept as all our priors were well over $500./night. (Embassy Suites on North End Ave is $189. next Feb, but over $600. last week).", "title": "Great Location, but....", "helpfulness": 1, "user": "mikemo", "date": "October 3, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 5.0, "value": 3.0, "location": 4.0, "rooms": 2.0}, "id": 10033804, "likes": {"liked": "— location", "disliked": "— tiny room"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled with friends", "text": "The room was quite clean, but very tiny; the location in back was very quiet, but the view was appalling.", "title": "outstanding value", "helpfulness": 2, "user": "Chesspain", "date": "September 25, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 3.0, "location": 5.0}, "id": 10002747, "likes": {"liked": "— Clean & Affordable"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2007", "text": "The window A/C is quite LOUD!", "title": "Fantastic Hotel", "helpfulness": 2, "user": "laurac1", "date": "September 24, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 8885078, "likes": {"liked": "— Location", "disliked": "— small bathroom, but very clean so not a problem"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled with friends", "text": "Location is great with the 123 subway just out the door and the 456 just X the city hall park.", "title": "What a GREAT find!", "user": "ZimDuluth", "date": "September 19, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8754981, "likes": {"liked": "— Quiet, cool room perfect for sleeping!", "disliked": "— The elevator was shakey at times"}}, {"rating": 4.0, "title": "Cannot find a better deal in Manhattan", "text": "Have family living in Battery Park - a 4 minute walk.", "helpfulness": 2, "user": "journalistjenni", "date": "September 18, 2007", "id": 8740727}, {"rating": 4.0, "title": "Good price, good location, good room", "text": "After searching around trying to find a hotel that was within our budget yet still provide some degree of comfort we stumbled across the Cosmo at Tribeca. When we booked it the room prices were some of the cheapest and the location appeared to be fairly central when we looked on a map.", "helpfulness": 3, "user": "BristolUK_traveller", "date": "July 6, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 8066782, "likes": {"liked": "— Location", "disliked": "— Noisy air-con"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled with friends", "text": "Located right outside a subway entrance, a few blocks away from the WTC and opposite a very nice (and convenient) deli (go out, cross the street, walk past the HSBC on your right and you can't miss it) made the location perfect.", "title": "Great Location, Great Hotel, Great Value", "helpfulness": 3, "user": "lbell12", "date": "June 20, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7951980, "likes": {"liked": "— Location"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled with friends", "text": "Inside the room was clean and the bathroom well stocked with towels. [warning: gross bit ahead] After a long journey we had some toilet issues of our own doing which required some unblocking of the lavatory. Phoning reception provided an immediate response with a maintenance guy up immediately. The service was very swift.", "title": "Clean, cheap and perfectly located hotel", "helpfulness": 4, "user": "massimo1975", "date": "May 28, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 7709099, "likes": {"liked": "— location and cleanliness", "disliked": "— grupp"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled with family", "text": "The room was a decent size, not large but not small. Many of the rooms face the street outside but we requested a room on the back of the building which was pretty quiet. The only thing which disturbed our sleep was the noisy window air-con unit.", "title": "A well kept Tribeca secret", "helpfulness": 4, "user": "Soccermum21", "date": "May 20, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7655688, "likes": {"liked": "— Cleanliness"}}, {"rating": 4.0, "title": "Terrific in tribeca", "text": "I'd highly recommend this hotel as we had no problems with it and is very well placed.", "helpfulness": 2, "user": "DakotaNJ", "date": "May 17, 2007", "id": 7636347}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "This is a great hotel in a great location at a great price! Very clean, safe and well maintained. Staff were excellent. On the street level there is a convenience store, cafe and great little restaurant- The Soda Shop I think it was called. We did a few breakfasts there and they were terrific. Many restaurants in the neighbourhood at all price points. 10 min walk to Little Italy, Chinatown and Canal St. About the same to Ground Zero. Short walks to finance district- Soho and Greenwich. Quick taxi to Times Square etc. Nicer area to stay than the noisy higher priced hotels in the Times Square district. -Highly recommend this spot and we will visit it again.", "title": "Fabulous Find!", "helpfulness": 2, "user": "KLPHamilton", "date": "September 15, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 8718598, "likes": {"liked": "— The Location"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled with friends", "text": "Myself and 2 friends stayed at the Cosmopolitan Hotel from August 27 - 30. I had read all the reviews on Tripadvisor, and was only mildly concerned that our room would smell of cigarette smoke. However, when we checked in the woman at the reception desk asked if we wanted smoking or none, so obviously we took non. I didn't smell a hint of smoke the entire time we were there. We got the room with two queen beds and a pullout couch and it was HUGE! We had a full bathroom plus another countertop, mirror and sink outside so that 2 people could get ready at once. The television was huge, and we got lots of stations. There wasn't a fridge but we didn't need one. Ice was available upon request. We were on the inner courtyard so the view wasn't great but it was quiet at night. We didn't hear a thing from other guests. You could tell that it was newly renovated, but they kept the old feel with actual keys for the rooms instead of magnetic cards. We didn't fly out until 9pm on the 30th, so they stored our luggage for us at no extra cost, and called a car to take us to the airport. Slightly more than a cab, but it was much less of a hassle. (Too bad the flight was cancelled but that's no their fault :) ). The hitch was that when we got back to the room at 11:30 one night, there were posters in the elevator saying that by order of the New York public works the water was shut off until 6am. I think it was the whole block, so not the hotel's fault, but it was still an inconvenience. As far as location, we walked to Battery Park, South Street Seaport, and Ground Zero. The Subway to Times Square is literally right outside the front door, so that's easy. The Metrocard is $24 and good for a week. All in all, I would definitely recommend this hotel to my friends, and if I return I'll be staying here as well.", "title": "Exceeded expectations", "helpfulness": 1, "user": "mys24", "date": "September 4, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 8656315, "likes": {"liked": "— Comfort and cleanliness.", "disliked": "— I liked everything,"}}, {"rating": 2.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "Great location, great price(for NY) you can walk or catch the subway to just about anywhere. Safe and clean, new fittings, well appointed. Only problem was we found the loft room just too claustraphobic and the noise from the outside airconditioning unit very difficult to cope with, we had no light in the room and couldn't see the sky from our window as it faced the adjoining building. Anyone over 5'7 would find it hard to stand up in the loft bedroom. The room was very narrow and the stairs very steep. The airconditioning didn't work the first night, they were obliging and had it fixed. We saw one the regular rooms and they looked fine but they couldn't move us as they were fully booked. We stayed four night, loved NY but were glad to be out of that room!", "title": "Claustraphobics avoid the loft rooms", "helpfulness": 1, "user": "mindyhobart", "date": "September 4, 2007", "detail_rating": {"front_desk": 3.0, "business": 5.0, "service": 3.0, "cleanliness": 4.0, "value": 2.0, "location": 3.0, "rooms": 1.0}, "id": 8616306, "likes": {"liked": "— convenience, fittings, free internet acces", "disliked": "— small loft room - we were physically affected by it, it was so bad"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "After living a Nightmare at Hotel 31, we moved to this outstanding hotel in all senses.", "title": "A GREAT Choice!", "user": "MexicanSpirit", "date": "September 3, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 8615263, "likes": {"liked": "— Cleanliness", "disliked": "— The bed was noisy"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "Staff were very polite.", "title": "Very nice hotel", "user": "ukyo123", "date": "August 19, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 8452677, "likes": {"liked": "— The room was modern and clean.", "disliked": "— I had to call the front desk every time I wanted ice; the machine is not available for guests."}}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled solo", "text": "The location is great if you want to explore the lower part of manhattan. It's comfortable walking distance from everything from the brooklyn bridge to soho to both the east & west villages to battery park and the rest of lower manhattan. Keep in mind that I think 20 minutes is a comfortable walk. The rooms are very small (typical nyc room) with no decoration, but are very clean. The staff was very helpful when my airport transportation fell through and found a replacement almost immediately. If you are looking for a hip atmosphere or anything fancy, this is not for you. If you are not planning on spending much time in your room and really just need a place to sleep and leave luggage, this is an ideal hotel. I think it is one of the best priced hotels in the city for location.", "title": "Great location and price", "helpfulness": 2, "user": "chigal82", "date": "August 4, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 3.0}, "id": 8350126, "likes": {"liked": "— price and location"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled solo", "text": "I've actually stayed here quite a bit and I even live in NYC. When friends or family come into town and my small apartment isn't big enough they all stay here. I've stayed here 4 times in the past and each time it is pleasant, CLEAN and friendly (staff). A modest hotel but it's comfortable, good price and lovely. My mother who grew up in Paris tells me that the inside (hallways and such) remind her of the small modest european hotels.", "title": "Charming Euro-feel hotel", "helpfulness": 2, "user": "vsminimoose", "date": "July 27, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 8245582, "likes": {"liked": "— CLEAN, friendly, excellent Tribeca location", "disliked": "— No Room Service - but you can get anything delivered in NYC :)"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "Never had a bad stay here and neither has a friend or family member! it's my favorite little spot. GREAT restaurants VERY close by. Great area.", "title": "Great budget hotel", "user": "mash55", "date": "July 19, 2007", "detail_rating": {"front_desk": 3.0, "business": 5.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 8190392, "likes": {"liked": "— Location", "disliked": "— TRaffic noise"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "The two floor or \"loft\" rooms are fun but keep in mind your bed and a tv is upstairs and everything else is downstairs. It feels less roomy and you can't completely stand up on the bed floor you sort of have to squat. I've stayed in a loft room once, it was ok but I much prefer basic rooms.", "title": "Great Hotel", "helpfulness": 5, "user": "Bigdom1971", "date": "July 14, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 5.0}, "id": 8116313}, {"rating": 4.0, "title": "Best all around in NYC today", "text": "My husband and I stayed at the Cosmopolitan Hotel in May and we thought it was great. The room was clean and larger than rooms in other similarly-priced hotels we've stayed at in NYC. The bathroom had stone tiled walls (nice touch) and a decent-sized tub. The window AC unit worked fine and helped drown out the noise of the traffic outside. Other reviewers complained about thin walls and noise from the other rooms, but we experienced none of that. We stayed four nights and our room was tidied and the bed made every day, although our sheets were changed only once. As for location, you can't beat it. There's a Starbucks next to the hotel, as well as a variety of restaurants on every block around the hotel, so you have no problem walking somewhere close for a meal. There's an Amish market a block or two south of the Cosmopolitan that had a great deli and bakery. We will definitely stay here again when we go to NYC.", "helpfulness": 2, "user": "RiaPB", "date": "July 13, 2007", "id": 8112938}], "location": {"country": "United States", "city": "New York City"}, "stars": 3, "variance": {"poor": 53, "average": 143, "very good": 505, "terrible": 43, "excellent": 308}, "aka": "Cosmopolitan Hotel New York City", "slim_ranking": 0.534988713318, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 3.5, "rooms": 3.5, "location": 4.5}, "description": "If you want to experience New York City, the Cosmopolitan Hotel is a good choice for clean, comfortable rooms at a reasonable price. All of our rooms are recently renovated, featuring Frette linens,complimentary high speed internet access, ipod docking stations and HD channels. We are located at the crossroads of Tribeca and the Financial District. We offer excellent service and a boutique hotel environment.The excitement of the city is just outside our door. Ideal for the business traveler and tourist, the Cosmopolitan Hotel offers affordable rates and state of the art amenities. The Cosmopolitan is the place to stay when you want to stay downtown. You can stroll the cobblestone streets and enjoy the historical architecture while you sample the hottest bars, restaurants and nightclubs in New York City. From our front door you can easily walk to: Wall Street, The South Street Seaport, Soho, Chinatown, Little Italy and Greenwich Village. Midtown and Times Square are only a fifteen minute subway ride away."}