{"user_rating": 4.5, "review_count": 2306, "name": "Costa Adeje Gran Hotel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled with family", "text": "We have just arrived back from the Costa Adeje Gran Hotel (01.08.06). Like the previous traveller, I too had read all the reviews on this hotel and was not disappointed. We had the best service we have ever had. The hotel is spotlessly clean and the food good. We had a lovely room overlooking the pool. The area in which the hotel is situated is great. A stroll down the hill (hike coming up!) takes you down to the lovely del duque beach which was very picturesque with some really pretty bars and shops. I heard people in the hotel restaurant complaining about the bacon and the sausages not being English. Why holiday outside the UK if that is going to be your gripe!", "title": "Excellent Service", "helpfulness": 10, "user": "Folkestone", "date": "August 2, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 5544931, "likes": {"liked": "— cleanliness and imposing", "disliked": "— nothing"}}, {"rating": 5.0, "title": "Great rooftop pool 360 views!", "text": "Stayed here from July 10-14th 2006. The hotel was awesome!! We especially loved the rooftop pool with the 360 views. We had half-board and the food was really good with variety and change every day. The hotel is in a great location towards the end of the hotel area with other more upscale hotels in the area. The beach is a short walk down the hill and to the right. This beach was a lot nicer than to the left with whiter sand and beautiful blue water. Loved it!! the day we left, we were able to check our luggage and go to the beach. The hotel let us book a shower room for free to change later before we were picked up for the airport. WE didn't use any of the spa facilities, but they looked nice (of course there was extra charges for all this). Nightly entertainment was nice for families and kids, but the talent was lacking. We were able to book day trips from the hotel and did the trekking trip to Masca that was just spectacular with a great boat ride and lunch. They picked up and dropped off at the hotel. This was the highlight of our trip, but the beach and rooftop pool were a close second). Our airconditioning didn't work in our room the first night, but they fixed it promptly in the morning. Other than that, I would highly recommend this hotel.", "helpfulness": 13, "user": "nonethname", "date": "August 1, 2006", "id": 5536648}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled with family", "text": "Just returned from a week at the Adeje Gran and will definitely be going back. We read the reviews here and were not disappointed! The entrance is very impressive (like a Palace!!)with a lovely bar and live piano player singing every night. You can sit in the bar or up in one of the seating areas to listen. The hotel is on such a large site you never feel it is crowded even though it was fully booked. Our room overlooked the pool and ocean- This gave us great day and night views. We were a little worried our 15 year old son would be bored on holiday with mum and dad but he soon made plenty of friends and the pools are so large you don't need to worry about them getting in anyone's way. You must try the roof terrace for a late afternoon swim- it is something else- so quiet and peaceful. We stayed half board and there was loads of choice for breakfast (full cooked/ continental/cheese/ham/pastries selections) and evening with chefs cooking seasonal food, fish, meat, steak, chicken and plenty of side dishes/salads/sweets/icecream- you could really experiment (octopus/cuttlefish) or stay safe (steak chips) whatever took your fancy- we loved the variety! Don't worry about the sun loungers- just take your towels down with you when you have breakfast- unless you want to be right next to the pool- I recommend the terrace overlooking the sea- you get a lovely breeze and its much quieter. Take a walk to the new shopping centre (5 minutes)- open til 10pm so you can go when its cooler- there are some good perfume shops and clothing stores. Then carry on to the beautiful white sand beach of Del Duque- it is so pretty and the shops and bars are new and clean. (Nothing like Playa de las Americas) A lovely lovely place.", "title": "Fantastic luxury for half the price", "helpfulness": 23, "user": "Chappers100", "date": "July 31, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 5533533, "likes": {"liked": "— The Spacious an opulent surroundings", "disliked": "— There is a new villa complex being built in front of the hotel- not particularly intrusive though as its down the hill a little"}}, {"rating": 5.0, "title": "Fantastic Hotel", "text": "Just got back from a weeks holiday in Tenerife. We stayed at the Costa Adeje Gran Hotel. The hotel was absolutely fantastic! The rooms were spacious and clean with a maid service daily. The staff were always friendly and dealt with any requests promptly. We stayed bed & breakfast and the choice of breakfast was very good - full english breakfast (no english sausages though!), choice of cereals, fresh fruit, pastries and yoghurts. It was served between 7am - 10am.The hotel was in a good location, just a short walk to the (black sand) beach where there are plenty of restaurants to choose from. We had a lovely holiday and would definately go back to the Costa Adeje Gran Hotel and highly recommend it!", "helpfulness": 21, "user": "A TripAdvisor user", "date": "July 3, 2006", "id": 5420379}, {"rating": 5.0, "title": "very good value for money", "text": "we have just returned from a weeks stay at the adeje gran for a second time in 2 years, i must say we were happy last year but the hotel seems much improved this year. the staff were execellent, always happy to help with anything, the rooms were clean and spacious.didn't have a pool veiw this time but one advantage is the back veiw rooms are very quite!! no noise from the pools", "helpfulness": 13, "user": "cazzarex", "date": "June 25, 2006", "id": 5381559}, {"rating": 2.0, "stay_parameters": "Stayed January 2006, traveled with friends", "text": "Stayed for new year and first week of january. dont kid yourself your going to a 5 * hotel because your not. First week was bedlam,meal times were crowded and noisy, rooms are also noisy with very little sound proofing and no privacy on balcony. Managed to change rooms for second week but things did not improve. Food average, pools o k, adeje area good. If your a family with young children on a budget its probably good value but if your the least bit fussy and appreciate a bit of quality do yourself a favour and give it a miss - its to big and is starting to look tired and warrants no more than 4*at the most. -- Tripadvisor member BRIGHTON", "title": "More like 3* plus", "helpfulness": 3, "user": "jardines", "date": "October 7, 2006", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 2.0, "value": 2.0, "location": 4.0, "rooms": 2.0}, "id": 5925510, "likes": {"liked": "— position in costa adeje", "disliked": "— to big and noisy"}}, {"rating": 5.0, "title": "Fantastic Hotel!", "text": "My Family and I stayed at the Costa Adeje Gran for a week which we felt was definitely not long enough! We all had such a fabulous time.", "helpfulness": 6, "user": "Ann020462", "date": "October 7, 2006", "id": 5924779}, {"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "There were 3 different choices of pools for my daughters to choose from which they enjoyed. At times it was so quiet they had one of the pools to themselves. Although you have to get up early to find a sun bed as they can be taken up very quickly with other peoples towels.", "title": "Gran value for money!", "helpfulness": 13, "user": "AdejeGran", "date": "October 7, 2006", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 5924303, "likes": {"liked": "— overall comfort and facilities", "disliked": "— not enough lifts and always breaking down"}}, {"rating": 3.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "The staff throughout this hotel are very helpful and friendly, nothing was too much trouble.", "title": "Not upto 5* standard", "helpfulness": 6, "user": "DevonLad", "date": "October 5, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "rooms": 4.0, "location": 3.0}, "id": 5912693, "likes": {"liked": "— Rooms And Pools", "disliked": "— Food"}}, {"rating": 3.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "We had our meals at the restaurant La Finca which had plenty of choices, even one of my daughters managed to cope and she is a very fussy eater.", "title": "sadly another disappointment", "helpfulness": 5, "user": "argus123", "date": "October 2, 2006", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 2.0, "rooms": 4.0}, "id": 5899825, "likes": {"liked": "— It was a very relaxing place", "disliked": "— its a long walk down a very step hill for some other entertainment"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "My Husband & I have just arrived back from 1 week of pure unadulterated pleasure & relaxation wishing we had booked for 2 weeks!", "title": "Book it, book it, BOOK IT NOW!!!!", "helpfulness": 3, "user": "lismart", "date": "September 29, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5890012, "likes": {"liked": "— too hard to choose probably the food & the room was gorgeous", "disliked": "— Older ( English ) customers complaining ( what on Earth could they possibly have to complain about! )"}}, {"rating": 2.0, "title": "Dissapointing", "text": "Well, where to start? The room was gorgeous, 2 wardrobes with interior lighting, his and her sinks in bathroom, balcony overlooking the swimming pools. Sofa & chair also in room adding to the overall feeling of spaciousness. Small complaint of only having Sky news & CNN in English on the tele although there were around 3 channels each in all other european languages French, dutch & Italian, but just Sky news for us Brits!", "helpfulness": 4, "user": "Carly Webster", "date": "September 27, 2006", "id": 5881518}, {"rating": 5.0, "stay_parameters": "Stayed June 2006, traveled as a couple", "text": "Swimming pools are 1 located on roof (looked gorgeous when dark) & 2 pools on ground floor that were beautiful to look at and swim in.", "title": "Best holiday yet", "helpfulness": 11, "user": "Sarah1986*", "date": "September 11, 2006", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5790540, "likes": {"liked": "— The Bars and the hotel room", "disliked": "— The poolside beds"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "Bar on ground floor near swimming pool was delightful (wonderful service behind bar) & overlooked Adeje below. Surrounding area appears to be undergoing a period of great developement so a few cranes and building sites near the hotel but in fairness no noise or disturbance felt & appears whole of the area is being renovated & developed.", "title": "Great all rounder - we have a toddler and a teenager to entertain!", "helpfulness": 27, "user": "CaptainAndo", "date": "September 7, 2006", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 5776325, "likes": {"liked": "— Good allrounder", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "The food was delightful! I defy anyone to moan there was nothing to eat as I have never had the pleasure of so much choice (often resulting in plates overfilled with food!) There is a salad bar with cheese/ham/ crackers etc, then a hot buffet area with dishes of excellent cooked dishes & also a grill area where a chef cooked fresh a couple of dishes i.e steaks or chops. An area of fresh desserts & ice-cream & a fresh fruit stand completes the restaurant area. All food was constantly replenished & appeared fresh & was very tasty. Note, there are no free drinks at dinner & you have to buy them but we found them to be very competetive so no real problems there.", "title": "Beautiful", "helpfulness": 18, "user": "cantfindone", "date": "August 27, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5712684}, {"rating": 5.0, "title": "Fantastic hotel", "text": "We stayed in the Royal Suite from 8th August to 15th August, we regretted not booking for the two weeks! The hotel is wonderful, the rooms were huge and the views over the Atlantic were lovely. If you stay in a suite you get free use of the La Laja Buffet, which basically is a quieter restaurant where they cook your choice of meat whilst you wait. The Finca restaurant is the main eating area for all other guest rooms and can be quite busy at times, although our teenagers preferred to eat there as they could meet up with friends. We ate breakfast at the Laja as it was a peaceful and unrushed way to start the day and then some evening meals at Finca. The food is good if you are a meat eater, although two of our party (myself included) are vegetarians and it was basically salads with chips or cauliflower cheese, although they did have a good selection of veg they tend to put bacon or bits of chicken in with it! Anyway, don't want to go on about the food side as the hotel offers much more. The pools are lovely, the roof terrace views are amazing, the maid service is daily and is very good, I personally did not see any sunburned Brits with tatoos as the previous person has mentioned! The staff are all Spanish speaking, but they do make an effort to understand the guests. To comment on their lack of ability to speak English is just arrogant and ignorant! You are in their country! Our teens made friends with Spanish boys who said that the people in Tenerife speak with a different accent to mainland Spain and even they had trouble understanding each other. Reception staff all speak good English, so if there are any problems you can always get help from them. We went to the Aqualand water park for a day out, but to be honest it is so small you can get around it in a couple of hours. The water rides are good fun, try the new Boomerang ride! One thing to note is that you have to pay for the rental of loungers once inside and the food and drink counters are quite expensive, so take extra Euros with you. The Dolphin show is amazing. Try to queue up early so you can sit on the front row and they may pick one of your children to take part. We walked to the Duque beach one evening and the little bars and shops along the front are lovely, as is the view from the cliffs. The resort of Adeje is far quieter than Americas or Cristianos. We felt very safe and were not pestered by any ticket touts. We went to both Americas and Cristianos during our stay and we got the feeling that they are very \"tired\" resorts and could do with a bit of a facelift in parts. Adeje is a newer resort and, without meaning to sound snobby, a little more \"elite\". We are hoping to go back and it is now on our \"will return\" list.", "helpfulness": 19, "user": "pedzeus", "date": "August 25, 2006", "id": 5708035}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "We spent a week at Costa Adeje Gran Hotel this August and we could not have asked for more. The Hotel is beautifully clean and designed with the feeling of masses of space. The staff were really friendly and helpful at all times. The food was delicious with excellent variety. Our room was clean, a good size and had everything we needed. The pools were lovely all four of them, including the roof top one. Plenty of room for comfortable sunbed and clean towels whenever you wanted one.", "title": "Excellent, fantastic week", "helpfulness": 10, "user": "Wolsey", "date": "August 25, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5707957, "likes": {"liked": "— Roof top pool and area", "disliked": "— all great"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "Entertainment is same as most hotels but fun and the amination team were a friendly bunch.", "title": "This hotel is excellent !", "helpfulness": 14, "user": "clawson", "date": "August 22, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 5699157}, {"rating": 2.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "You can walk each evening down to the beach and along the lovely coastal paths, passed bars, restaurants and shops, also sit and watch the sun go down in any of the beach bars.", "title": "good hotel but do not expect 5star service!", "helpfulness": 7, "user": "dolphinseeker", "date": "August 12, 2006", "detail_rating": {"front_desk": 5.0, "business": 1.0, "service": 3.0, "cleanliness": 3.0, "value": 2.0, "location": 4.0, "rooms": 4.0}, "id": 5603098, "likes": {"liked": "— size of the room", "disliked": "— noisy, no foreign languages spoken"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2006, traveled with family", "text": "My only slight grumble which is not the hotel's fault as this is not run by the hotel, was the gym. The equipment was disappointing and needs fixing, and the staff were not helpful.", "title": "Good Value Hotel", "helpfulness": 10, "user": "banksy677", "date": "August 4, 2006", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 5559759}], "location": {"country": "Spain", "continent": "Europe"}, "stars": 5, "variance": {"poor": 63, "average": 280, "very good": 817, "terrible": 35, "excellent": 1111}, "aka": "Gran Hotel Adeje", "slim_ranking": 0.277777777778, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.0}, "description": "COSTA ADEJE GRAN Hotel, a 5 star hotel located in Costa Adeje area in the south of Tenerife, has 485 rooms (double standard rooms and suites). Free WIFI access in all Hotel areas, and a huge variety of services and installations, as restaurants, bars, pools, sun terrace, shops, mini market, etc. Perfect for your family holidays as well as for couples and friends. We are also a perfect option for conferences, events and weddings, as our Hotel counts with several conference rooms."}