{"user_rating": 4.5, "review_count": 247, "name": "Cote Loire Auberge Ligerienne", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "Thierry, the manager, stayed late one evening for our arrival and took the time to show us where to park and to get us situated in the hotel and oriented to the town. He also oversaw a delicious continental breakfast the next morning. The hotel has the ambience of a country inn, without sacrificing bed or bathroom comfort. The location is easy to find and is within a few minutes easy walking to the center of the old town and the chateau, which is most impressive. This is a truly French experience for those not tied to high-rise four-star hotel travel.", "title": "Great service, atmosphere and location", "helpfulness": 1, "user": "2012Steve", "date": "May 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 160166457}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "My son and I stayed here three nights in September. Our room was Mme de Sévigné, plenty of comfort and roomy. The Inn has a very warm atmosphere. Theirry is a great host. All meals were very enjoyable. Perfect location for touring the Loire and Blois. I suggest early morning walks by the river. Noticed locals at dinner. Several English tourist were there during our stay. Easy parking. This was one of the truly special places we stayed during our month in France.", "title": "Outstanding room", "user": "Marion R", "date": "May 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 159741526}, {"rating": 4.0, "title": "Comfortable Stay by The River Loire", "text": "I visited Blois in mid-September and enjoyed my stay at Cote Loire. It is a very cozy inn - more akin to a B&B than a hotel. The double rooms are quite small and I would recommend them only to single travelers with limited luggage. Couples should opt for larger rooms or those with 2 beds. As mentioned by a previous reviewer, some of the furnishings are a bit dated and I would love to see some upgrade of the decor, since this is a fine old, historic building with charm. The building lacks air conditioning so it may be a concern for visitors staying during the hottest months. The above concerns notwithstanding, the Cote Loire has a wonderful location on the River Loire, the owners are cordial, the service is friendly and efficient, and the rooms are clean with comfortable beds. Of particlar note, the Cote Loire has a restaurant which serves very good food and a nice selection of regional wines and armagnac (brandy). Your stay must include at least one dinner here!", "user": "Debi B", "date": "November 27, 2012", "id": 146304222}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "I have stayed here twice as a base for bicycling in the Loire. It is a very pleasant and cozy inn. Warning: the small rooms are very small, but the large rooms are wonderful. From the first floor (or 2nd floor in US convention) the view - sadly, over a parking lot - of the river is quite serene. The restaurant must be one of the great bargains of central France, and the owners have even managed to find drinkable wines from the region.", "title": "Very comfortable", "helpfulness": 1, "user": "MickBoston", "date": "November 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 145266924}, {"rating": 3.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "After the first visit I read this in Henry James \"A Little Tour in France\" published in 1884: \"… a clumsy but rather attractive little inn on the edge of the river will offer you a certain amount of the familiar and intermittent hospitality which a few weeks spent in the French provinces teaches you to regard as the highest attainable form of accommodation.\" I did not ask the owners - they have only been there since about 2004 I think - but I hope it was the Cote Loire.", "title": "A charming shambles", "helpfulness": 1, "user": "Bibsley", "date": "November 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 2.0, "value": 3.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 145026194}, {"rating": 3.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "The rooms are clean but only useful for sleeping, either two small people or one larger person. A larger person probably could not get around the bed or fit into the very small shower. The breakfast was good and the hotel is charming. I would spring for the largest room you can get.", "title": "Broom closet turned into a bedroom.", "helpfulness": 2, "user": "charliesmimi", "date": "July 7, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 2.0, "location": 3.0}, "id": 166640885}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled with friends", "text": "This was a very comfortable small hotel with bags of character; the room we had overlooking the river was large enough and interestingly furnished but with a spacious comfortable bed - one small niggle, no soap dish/basket in the shower.", "title": "A good place to stay", "user": "dougbonnar", "date": "July 2, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 166093725}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "The owners were helpful if a bit cool and measured in their reponses - I couldn't quite work them out!", "title": "Good value, good location", "user": "Freeway_Doggy", "date": "June 30, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 165775029}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "The restaurant was fabulous - the most delicious food at dinner (make sure you book) and a substantial breakfast.", "title": "Large room, great location in blois", "user": "funtraveling_10", "date": "June 27, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 165439539}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with friends", "text": "If you're like me you'd rather spend more money on the restaurant and less money on the room, and this is the perfect example. The room, though unexceptional, was very cheap (57 Euros). The meal in the restaurant, however, was exceptional and you need to reserve a table to guarantee a place. The location is perfect - just on the edge of the old quarter and within easy walking distance of everything you'd want to see. Parking was fine - there is a public parking lot in front of the hotel (payant) and some free spaces around too. The nice man on reception moved his car so we could take one of the free spaces - how kind is that!", "title": "Charming experience in Blois", "user": "Pollyoh", "date": "June 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 164749722}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "What a lovely little auberge this is. A lot of thought has gone into the facilities and comfort of the rooms and food, it is comfortable, clean and of a very high standard. The owners are welcoming and helpful and speak enough english to manage. This auberge is within a very short walk of both the centre of Blois and the Loire. You can park the car outside the auberge and leave it there for the whole of your visit. Highly recommended.", "title": "Ideal base for exploring Blois", "user": "sueberry12", "date": "June 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 163886457}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "This Auberge was recommended to us by dear friends. Our experience was wonderful. The staff is friendly and helpful. Our rental car was not working and the person who checked us in and who was there most mornings was extremely helpful in calling the rental agency and translating with the mechanic who came out to inspect the car. We ended up driving back to the Orly airport to return the car and the desk person could not have been more attentive. We stayed for three nights, wandered about the town and had a fabulous dinner in the auberge. Highly recommend staying there, I know we will. Have nothing bad to say about our stay and the way we were treated.", "title": "May 2013 Vacation to France", "user": "jlopez2266", "date": "June 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 163357123}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "We could not have asked for a better place to stay than the Cote Loire Auberge LIgerienne! We had a spacious, clean, very comfortable room (#7) (even my 6'3\" husband fit). We were lucky enough to eat dinner in the restaurant downstairs and it was the best meal we ate in all the Loire! Make sure you make reservations - The home cooking and family recipes make for an unforgettable meal. Each morning breakfast was robust and delicious - highly recommend taking that option as well. There is a pay-parking lot right in front of the hotel but if that is full, there are other spots near by. The Blois Chateaux was only a 5 minute walk from the hotel and the city center was just a few minutes more. And lastly, the front desk manager was the nicest, and most helpful person we encountered on our travels... We would stay there again in a heartbeat because for the price, it was an exceptional deal and wonderful experience!!! Highly Recommend it!", "title": "Fabulous location, Fantastic place to stay", "helpfulness": 1, "user": "iheartparis77", "date": "June 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 163316790}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "We stayed at cote loire for one night and the experience was great. We didn´t want to spend much money so we stayed in a small room in the second floor for only 57 euros (and WITH breakfast, and you should see what breakfast!) so the value was extraordinary. The room was small but nice, clean and tidy. The house is 500 years old (or more maybe 700, can´t remember) and there is a chef but as we arrived late, we could not taste the meals - but I am sure they are excellent. I never ate as good as I did in France and specially at the Loire valley. Thierry , who is very nice, was waiting for us to arrive and send us to a restaurant that was opened till late where we had a very nice meal . I would love to return and recomend it as it is also very well located. Also we liked Blois very much.", "title": "very good auberge!!! nice experience", "user": "littletheresa", "date": "June 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 163301920}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with friends", "text": "We stayed one night and our room oerlooked the magnificent river.", "title": "Lovely setting.", "user": "UKguest_12", "date": "May 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 160821560}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled with friends", "text": "The Cote Loire is a quiet, comfortable hotel right on the river in Blois. Decorations are very tasteful and clean. Our room had easy chairs for reading and a large modern bathroom. Breakfast was well worth the extra charge (unlike a lot of other hotels we visited in France). The owners are very cordial and helpful.", "title": "Lovely hotel in a wonderful location", "user": "vsmith43", "date": "November 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 145021129}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "We were able to walk to all the sights that interested us in Blois. No need to use your car! We used the Cote Loire as a base to visit the chateaux and wineries in the Loire Valley--it was a good choice. Right next door to the hotel is a small museum about the French Resistance in WWII that was well worth the visit.", "title": "Small, Cozy Hotel with Splendid Service & Great Food", "user": "Island_Wave", "date": "October 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 143948810}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "This classic, old hotel offers only half a dozen sizable, very comfortable rooms. It’s a really cozy place, with truly outstanding service. The reception room is actually a tiny tavern. The nicely-decorated dining room is to the left. And an extremely charming patio is out the door to the right – although few people use it, since they mistakenly conclude the area is private.", "title": "Excellent choice to start a castle tour", "user": "Irioux", "date": "October 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 143576505}, {"rating": 5.0, "title": "Superb and relaxed dinner", "text": "We stayed two nights, enjoying very well-made, tasty breakfasts. And we also dined there one evening. The evening price wasn’t cheap, but it was one of the most excellent meals we had in France – well worth the splurge, with wonderful French ambience. They take great pride in their food.", "user": "ski_bum2205", "date": "October 20, 2012", "id": 143293585}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with friends", "text": "When we were departing for the train station, we had hoped to catch the occasional city bus that stops out front. But when we asked the hotel owner about the schedule, he insisted on taking us to the station. He really took great care of us.", "title": "What an amazing hotel", "helpfulness": 1, "user": "jennie w", "date": "October 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 142361492}], "location": {"country": "France", "region": "Centre", "continent": "Europe"}, "variance": {"poor": 2, "average": 17, "very good": 99, "terrible": 1, "excellent": 128}, "aka": "Cote Loire Auberge Ligerienne Hotel Blois", "slim_ranking": 0.03125, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.0, "location": 4.5}, "description": "Nestled back from the road that follows the bank of the Loire—a five minute walk to the Blois châteaux—the Côté Loire is hidden behind foliage of the tree that shades the square. Do not judge this hotel by its two star rating. It is an intimate, 7-room hotel that was just purchased by Thierry and Laurent. With their care and attention to detail, it will soon become one of Blois’ most charming small hotels."}