{"user_rating": 4.0, "review_count": 78, "name": "Cote Patio Hotel Nimes", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled with family", "text": "I stayed here for three nights with my mother. We enjoyed the hotel and would stay here again. It was tough arriving at 8 pm and lugging our rolling suitcases down the very bumpy and dark street to the hotel, but once we arrived we were happy. The receptionist was very friendly and helpful with restaurant recommendations. On the street towards the center there are 2 good pizza places and one nicer restaurant, which is convenient. It is less than 10 minutes to walk into town, basically on one street. We liked the quiet location and did not find it \"shabby\" as another reviewer called it. It's just a regular residential district, which is less fancy and kept up than the downtown area -but I like that. The rooms were cheerful and the bathroom clean and fine. I would stay here again.", "title": "Simple and cute", "user": "pepoling", "date": "June 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 132302797}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "We stayed here for one night in October 2010, before flying out of Nimes airport the next day. The location of the hotel is really unattractive and not easy to find, it's also hard to navigate luggage through narrow sidewalks with a lot of impediments.", "title": "a long walk from the centre, not the best location, but a clean and charming hotel", "user": "anibani", "date": "October 29, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 2.0}, "id": 85287392}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "But the hotel itself is clean and comfortable. The double room we got (no. 10) was away from the road and quiet. Decor was simple but functional and thoughtfully done, we had somewhere to hang our clothes and gear, bathroom had sufficient shelves, room painted in a nice reddish shade. Outside our room was a small breakfast area and a bigger lounge room that was well-lit and had books and comfortable chairs. We didn't use this room, but had we stayed longer, I would have found it a nice place to sit, read and have a drink.", "title": "Basic and in a grotty area, but quite good value", "user": "dominicp", "date": "October 28, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 2.0}, "id": 85121356}, {"rating": 4.0, "stay_parameters": "Stayed October 2010", "text": "The hotel owner was also very helpful and friendly in recommending restaurants and giving us directions to different places. We felt very welcome there.", "title": "Stayed here with the family for a couple...", "user": "gillej", "date": "August 16, 2010", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 3.0}, "id": 75388466}, {"rating": 3.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "Other facts -", "title": "Good 2 Star Hotel but in rough area", "user": "inspiredtravels", "date": "May 19, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 2.0}, "id": 64719142}, {"rating": 4.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "Cote patio is a lovely place with friendly staff, a short walk to the centre of town, arena, etc. The rooms are nicely decorated, clean, with good showers.", "title": "Great hotel, but beware which room you are given!", "user": "SJC_NZ", "date": "April 6, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 2.0, "rooms": 3.0, "location": 3.0}, "id": 60549183}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled with friends", "text": "But, we did have a problem with the room which people should be aware of. We booked a 'comfort double' room with 'view to patio', which from the photos I assumed meant the outdoor courtyard. We instead got a room with a window onto the internal breakfast room! Definitely a conservatory room, NOT a patio. This was not good - it was very dark to begin with with no sunlight being able to get through, and then in the morning we were unable to open our curtains as people having breakfast could see us when we got up. NO privacy, and a little noisy.", "title": "A great little hotel", "user": "gsailor", "date": "March 2, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 25444907}, {"rating": 4.0, "title": "good value for money", "text": "I complained in the morning but was told they did consider that a patio, and it was also a 'comfort room' not a standard - so was the same price as the rooms with views to the real, outdoors, patio (these rooms would have been lovely). Which is ridiculous. I told them I thought this was false advertising. At least the receptionist apologised.", "user": "stevos", "date": "April 19, 2008", "id": 15141171}, {"rating": 4.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "In fact, the staff overall were very nice. Also, the breakfast (which you do pay for) was excellent - perfect bread and croissants. So it's a shame we were annoyed with the room, or this review would be glowing. Stay here, but check what room you are getting!", "title": "Convenient and friendly hotel.", "user": "KES23", "date": "October 8, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 5927340, "likes": {"liked": "— Location and staff", "disliked": "— Noise at front from road"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2006", "text": "This hotel was a really good find in Nimes. Easy to find from the train station, the hotel had a really homely feel. Our group of 7 had 3 rooms, all of which were decorated differently in a very quaint way. The patio was absolutely excellent in the summer weather, and breakfast out there was also fantastic. In some ways this hotel felt like a home- we didn't see many of the other guests so the hotel didn't feel overcrowded, and the staff were really helpful and attentive. Would definitely recommend for a relaxing break in beautiful Nimes.", "title": "Did the job", "user": "BandiB", "date": "March 14, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "service": 4.0}, "id": 4615993}], "location": {"country": "France", "region": "Languedoc-Roussillon", "continent": "Europe"}, "stars": 3, "variance": {"poor": 3, "average": 16, "very good": 43, "terrible": 2, "excellent": 14}, "slim_ranking": 0.255813953488, "description": "Cet hiver est encore dédié aux rénovations! 5 chambres de plus rénovées, ajout de climatisation pour 3 chambres, et surtout la décoration complète du Patio qui vous offre été comme hiver un endroit de calme et de sérénité"}