{"user_rating": 4.0, "review_count": 499, "name": "Cotswold House Hotel & Spa", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "Having been upgraded to the \"finest room in the hotel\" what couldn't possibly be perfect. Just a couple of things, but I'll do those last.", "title": "Almost perfection", "helpfulness": 1, "user": "JMuk", "date": "November 13, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 184606673}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled as a couple", "text": "The room was amazing. Living area downstairs with open fire and comfortable sofa. Huge comfortable bed upstairs, Elemis products, lovely linen, huge towels, robes, and REAL COFFEE, CAFETIERE and MILK in the fridge. Such a simple thing but more hotels should do this. The room was beautiful and the private hot tub was a treat, we stayed in there til late.", "title": "Wow!", "user": "zebrazebrano", "date": "November 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 184364204}, {"rating": 5.0, "stay_parameters": "Stayed November 2013", "text": "Some things this hotel could do better: small things but considering how wonderful the room was but you pay big $$$ for a night here so these are the things that count.", "title": "We found a hidden treasure during our two night stay at the Cotswold Spa Hotel: The Dining Room.", "user": "Acciano", "date": "November 10, 2013", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 184247342}, {"rating": 2.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "- no flannels/wash cloths in the bathroom", "title": "Not recommended", "helpfulness": 1, "user": "chemin", "date": "November 8, 2013", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 2.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 184098065}, {"rating": 4.0, "title": "Automatic service charge??? ", "text": "- underpowered shower that didn't keep temperature", "helpfulness": 1, "user": "pink_phantom", "date": "November 5, 2013", "id": 183679409}, {"rating": 4.0, "stay_parameters": "Stayed October 2013, traveled with family", "text": "Our whole family stayed here for a 70th birthday weekend and we had a fantastic time - the rooms were very comfortable and to a high standard and the staff were very accommodating, particularly the events team who had really helped us prepare everything well in advance, including setting up a side room for dinner with table plans and candles etc.The breakfast could have been a little more copious but it was all very delicious so a small thing really. For our birthday meal we went across the road to the sister hotel, the Noel Arms, where we had a fantastic curry and again the staff were incredibly helpful.", "title": "Wonderful hotel and customer service", "user": "Mattman7", "date": "October 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 181224344}, {"rating": 4.0, "stay_parameters": "Stayed October 2013, traveled with family", "text": "Thanks to all who made our weekend really lovely and I would very much recommend the hotel for its comfort, setting and customer service. A very special thanks to Vicki who helped organise the weekend with us and made it so very memorable.", "title": "Birthday Treat", "user": "CME1943", "date": "October 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 180483532}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "My lovely children kindly took me and their mother for a surprise weekend break to celebrate my 70th birhtday. Chipping Campden is spectacular and it looked and felt very splendid in the last good weekend of the Autumn. The hotel is lovely, sort of faded in places, but overall a very nice feeling. Our room was a little care-worn, but immaculately clean - a nice big bed! The evening meal was nice, served in a specially set-aside room for my birthday clebrations. The staff were very attentive and extremely helpful. Breakfast was quite nice, but not the best Full English I have eaten, Unfortunately the whole building very hot and we found it difficult to lower the temperature - we left our window open overnight , and being on the front of the building we suffered a lot of late night and very early morning noise. Parking arrangements are a bit stressful. Unfortunately a selfish guest parked across the entrance and my son ruined a brand new tyre negotiating a sharp pavement. The duty manager was very helpful and kindly offered a £50 discound towards the cost of a replacement tyre: this was a very kind gesture. We rate this hotel and its staff highly.", "title": "Just idyllic", "user": "kmcottrell", "date": "October 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 180442533}, {"rating": 3.0, "title": "Mostly good but a few things could be improved", "text": "It is hard to imagine how our stay here could have been improved.", "helpfulness": 2, "user": "Joandgav", "date": "October 4, 2013", "id": 179737271}, {"rating": 5.0, "stay_parameters": "Stayed August 2013", "text": "The location is excellent, and the facilities first class.", "title": "Pure class", "user": "Phil T", "date": "October 2, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 179481678}, {"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "Just spent a two day break with spa treatments at the Cotswold House Hotel and Spa in Chipping Campden. The room was very pleasant with five star fixtures e,g. B&O TV, luxurious soaps and gels etc. However the water system was noisy and the decor beginning to get tired. First night we ate in The Grill as the restaurant was closed. The food was OK - somewhat \"fine dining\" - in other words fancy and small portions. Breakfast was a real disappointment on the first morning. Full English served with streaky bacon that was far from crisp! Second morning was a little better. The second evening we ate at the company's second hotel across the road - The Noel Arms. This was altogether a better dining experience. Separate review follows!", "title": "Good, but pricey!", "helpfulness": 1, "user": "Godfrey S", "date": "October 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 179418800}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "The spa was delightful with excellent masseuses and good facilities The gardens are lovely and well kept. The town of Chipping Campden is delightful, if a bit surreal with so many tourists of all nationalities rubber necking the period buildings and the locals apparantly going about their business in isolation. In fact my wife and I felt it would be the perfect setting for a sequal to Hot Fuzz the movie!!", "title": "A delightful experience", "user": "bjn1", "date": "September 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 179083208}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "Overall it was a good break, but had we not been on a special deal it would have been very over-priced. Do take the time to visit the museum, craft centre and church and do pop over to Broadway which is a delightful village.", "title": "Lovely hotel", "user": "Tracey139", "date": "September 22, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 178121062}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "This was a thoroughly enjoyable short break and excellent value for money. All of the staff we met were charming and helpful and we even had our luggage carried up to the room for us. An upgrade meant that we had a beautifully quiet room at the back of the hotel with a balcony overlooking the garden. Nice weather enabled us to enjoy a bottle of champagne sitting on the balcony (and indeed in the enormous bath!) before dinner at the Grill. Food was good and the restaurant staff attentive. Cleanliness was spot on and our bed was turned down each night with water replenished and towels checked. We were also provided vouchers towards Spa treatments (situated at the end of the garden) which we took full advantage of. Chipping Camden is a delightful town and we will be sure to visit again.", "title": "Evocative and memorable", "user": "LoisSW", "date": "September 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 175812155}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "We stayed in the Langdon Suite and it was lovely. There was a separate sitting room, own private garden with hot tub, bathroom and bedroom. The rate included breakfast and one evening meal. The breakfasts were lovely. Dinner was very good but a little spoiled by the shortage of staff so it did take a while to get served. One previous occupant of the suite had complained of the noise of a wedding, I spoke with the manager about this and was assured that the suite would now be rented with all hotel parties as the function room is very close by. Overall, a lovely break and a fab spa. I would go back", "title": "Didn't want to leave", "helpfulness": 1, "user": "Spottysuitcase", "date": "September 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 175313041}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled with family", "text": "As an 80th birthday treat for my mother my two sisters and I took her for a night to the Cotswold House Hotel. It was extremely relaxing, the staff were very helpful and attentive, the food was good, the location was lovely, we very much enjoyed the spa and had a lovely stay overall.", "title": "Lovely place and very relaxing", "helpfulness": 1, "user": "JoD50", "date": "October 25, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 182341132}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with friends", "text": "Visited this lovely hotel with friends for 1 night and had a wonderful stay. Our room was furnished in quality antiques and the bed was very comfortable. Yes the TV was small and had limited channels but there are so many things to see and visit in the stunning village including the hotel's Spa we did not have much time to watch TV. Food was excellent in the restaurant and staff very friendly. We will be visiting again and stay longer next time.", "title": "Great place to chill", "user": "ChesterBlue", "date": "October 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 182218040}, {"rating": 4.0, "title": "Charming hotel in lovely surroundings", "text": "We stayed over a weekend and it was our second visit. First impressions were that it needed a lick of paint, but our room, which was upgraded to a Junior Suite, was beautiful. It had a small balcony which overlooked the pretty garden at the back of the Hotel.", "user": "connell66", "date": "October 21, 2013", "id": 181823897}, {"rating": 4.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "The staff are all very pleasant and welcoming but very young and a little lacking in sophistication. The breakfast is fine, but could be arranged more invitingly. Dinner was mediocre.", "title": "Good...but could be even better!", "user": "audrey b", "date": "October 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 181344124}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled with friends", "text": "The Spa again could do with a re-vamp, but the treatments were good and reasonably priced.", "title": "A weekend stay for 19", "user": "Mercedesman3", "date": "October 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 181269042}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "variance": {"poor": 40, "average": 69, "very good": 151, "terrible": 10, "excellent": 229}, "aka": "Cotswold House Hotel Chipping Campden", "slim_ranking": 1.0}