{"user_rating": 4.5, "review_count": 529, "name": "Cottage Inn by the Sea", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "Stayed 1 night as part of route 1 holiday. Lovely little place, room had fireplace (thankfully not needed), and the bed was so soft! Perched on the cliffs overlooking the beach, the views and the sunset were spectacular. A little gem.", "title": "Lovely location", "user": "Kerzy", "date": "August 20, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 116977222}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "I booked a room a month ahead of our 20th Anniversary and paid a little more for the 2nd story ocean view room. We stayed here a couple of years ago and enjoyed our stay. When booking the room I noted it was our 20th Anniversary not expecting anything but congratulations. When we arrived at the lobby for check in there is our name and a Happy 20th Anniversary plaque sitting on the counter welcoming us.(WOW) When we get to our room (same 1 we stayed in 2 years ago) there is a bottle of champagne and to glasses along with a Happy Anniversary card on the bed for us!!!!! What a pleasant surprise...The room and the view is awesome. They went above my expectations and made for a special stay..Thanks for all the little surprises, we will be back again for sure!!!", "title": "Anniversary surprise", "user": "Jeff B", "date": "August 19, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 4.0}, "id": 116947110}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "My wife and I are from the busy Boston area, and on this trip to CA we were not looking for the \"luxury resort\" experience, but rather a simple 'rest' by the sea. We got just that at the Cottage Inn. We had an excellent room (clean, comfortable decor and roomy enough for us, with a mini fridge, electric fireplace, etc.), that opened out to a patio garden that ran about 50 feet to the cliff (with a railing!) by the sea. It was really beautiful. We could take long walks on the surprisingly empty, huge beach below, and then come back and sit out on the patio and watch the sun set, and then fall asleep in a very comfortable bed with the windows open to the sea - tremendous! Add in an included, expanded continental breakfast (hard boiled eggs, fruit, waffles, etc.), a pleasant staff (\"Service\" rating is only because we had very little need for service while there), a small, but clean pool with a large 'hot tub', and very reasonable rates for the area and season, and it made a great time for us. We would definitely come back and recommend to friends.", "title": "A great rest by the sea", "helpfulness": 1, "user": "1001_hotel_nights", "date": "August 17, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 4.0}, "id": 116866496}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "An amazing place. Rooms fantastic. Beds very comfortable and an fabulous nights sleep. We have necer been to Pismo Beach and this hotel was great. Location was perfect. What a view!!", "title": "Fantastic, Fantastic", "user": "HHKS", "date": "August 17, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116863830}, {"rating": 1.0, "stay_parameters": "Stayed August 2011", "text": "Breakfast was great, and the waffle maker was great fun, if not a little baffling for us English. Ha Ha", "title": "The Hotel Lacks commitment!", "helpfulness": 1, "user": "Clampyvw", "date": "August 14, 2011", "detail_rating": {"cleanliness": 5.0, "value": 1.0, "location": 5.0, "service": 1.0, "rooms": 5.0}, "id": 116721172}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "My husband and I loved it here. It's intimate and cozy with great views of the bluffs and ocean. And what a great value!", "title": "Gem of a place", "user": "shanna_q_leonard", "date": "July 28, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115924893}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "I recommend booking the ocean room because you can open the window and hear the ocean all night. It's fantastic. There's also a small hot tub and pool outside.", "title": "Can't wait to get back!", "user": "msalisburyus", "date": "July 28, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115906726}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "Pismo is a sleepy beach town and is walkable to many restaurants. They don't have food or a restaurant, but that really wan't a big deal for us, as we wanted to get out and about. Enjoy!", "title": "\" A bit of heaven \"", "user": "roadcall", "date": "July 28, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115904882}, {"rating": 5.0, "stay_parameters": "Stayed July 2011", "text": "BEAUTIFUL! The room was fantastic - decor and cleanliness A1. And couldn't be happier with the service from the staff. And for a hotel that offers free breakfast we never expected the wonderful hot meal and many options to start our day off right. Just wished we planned to stay more than one night - probably will try to get back for at least 5 days next time.", "title": "Perfect California Beach Hotel!", "user": "hotelife", "date": "July 28, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 115885161}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "This was the first time to stay in Pismo Beach for my wife and I, and first visit to the Cottage Inn. (We usually stay at Avila Beach, a few miles further up the coast.) The Cottage Inn was a perfect getaway. The staff was accommodating and friendly. The English country style buildings are clean, quaint and as fully equipped as we could ever want. Throw in a very good comp breakfast, a small but clean pool and spa, convenient parking, and you think you have a bit of heaven-- and that's even BEFORE you see the very accessible wide, clean beach great for our daytime walking and even better for surf-aided nighttime sleeping. Our oceanfront room was more than we usually pay but", "title": "\"Memorable Moments\"", "user": "shanna_q_leonard", "date": "July 27, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115853105}, {"rating": 3.0, "stay_parameters": "Stayed August 2011", "text": "on arrival the staff were very helpful and attentive. first impressions before entering the room were reserved. but on opening the door, the room was a nice size. long, with built in wardrobes, fridge, fan, safe and fireplace. we had swans on the bed with 8 pillows, the following day it was an elephant! free wi fi was a bonus and worked well with no connection problems. the English cottage feel was ok with the furniture, decor and linens then there was the view. the ocean looks great from high up. looking across we can see the pier, just beyond the tree which slightly obstructed the view to the left. my wife did actually see dolphins go by early one morning. the free breakfast was good enough to start the day with a good choice of pastries, fruit and if you were adventurous, make your own waffles.overall it was a nice stop off for a couple o f nights. although I couldn't spend a week here, I would stay again as a stop off. if I had to find fault it would be the long walk to the beach down the steep steps, a balcony would have been nice on the second floor and the windows could do with clean on the outside.", "title": "great ocean view", "helpfulness": 1, "user": "Guitar_mark", "date": "August 14, 2011", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 116699043}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled with friends", "text": "Should have been forewarned by the use of pens as hair clips by really friendly staff that this was not quite the norm as hotels go . Origami with towels and face flannels greet you when you enter your well appointed room. No A/C but free fridge and ceiling fan to keep you cool. Free self service breakfast is good and interesting if you have time to watch both the expert waffle makers and the not quite got the idea people like me . Long walk down to beach but can drive further down to get a lot closer . Beach goes for a long way with impressive sand dunes to the south.", "title": "towel twisters", "user": "sausagepoo", "date": "August 9, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116491911}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "We spent a night at the Cottage Inn whilst travelling up the Pacific coast. We paid extra for an ocean view and it was worth it. The room was very comfortable - easily the most comfortable bed of our holiday. The staff were friendly and helpful and we would certainly stay here again.", "title": "Lovely views of the ocean", "user": "Turtle021", "date": "August 2, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 116178756}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "We have been to Pismo Beach many times but never stayed at the Cottage Inn. People were friendly, place was clean and view was perfect. Room was a little small and being by the pool was not good. Gate slamming was annoying but we never asked to be moved. All in all pretty good experience.", "title": "Beautifuk view", "user": "Bigcarguy", "date": "August 2, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 2.0, "service": 4.0}, "id": 116177282}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "We just got back from our central california vacation. I am so glad we stayed in Pismo Beach-especially @ The Cottage Inn. We had an ocean front room-great view! The staff is extremely friendly & the rooms are immaculate. There is fairly easy access to the beach-might be too much if you are physically challenged. However, you are not far from the pier & there is definately easy beach access there. I enjoyed the garden area in the mornings while sipping a cup of coffee. I found Pismo Beach to be the perfect desitnation for all the surrounding attractions. It's an easy drive to Hearst Castle, Morro Bay & Solvang....BTW-you just have to have a chocolate eclair @ Mortensens Bakery in Solvang...to die for!!! Would definately enjoy staying there again!!", "title": "Location, location, location!!", "user": "Rosebud65", "date": "July 30, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116019597}, {"rating": 2.0, "stay_parameters": "Stayed July 2011", "text": "I had really high expectations for this charming looking hotel - from the website they do a great job advertising and also was recommended by a friend who stayed there in march 2011. We were traveling as a family with our little dog. As a pet friendly hotel and with an ocean view room, we figured we were set to enjoy my husband's birthday.", "title": "Do not stay in ro 518- pet friendly ocean view", "helpfulness": 2, "user": "Bellabellymamma", "date": "July 25, 2011", "detail_rating": {"cleanliness": 1.0, "value": 2.0, "location": 4.0, "service": 4.0, "rooms": 2.0}, "id": 115777857}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled on business", "text": "As it turns out, the ocean view was. lovely from our room, the little courtyard with chairs outside of our room were very charming. But our room smelled and was musty. There was mildew in the bathtub and the paint on the baseboards were cracked and dirty. I dared to look under the bed and it was filthy!!! The room was just old and badly needs updating. The only reason why we stayed was because the staff was so nice. I did mention it to the girl at the front desk and asked", "title": "Beyond Expectations", "user": "21dlk21", "date": "July 22, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115665431}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled on business", "text": "if all of the rooms were like our", "title": "Great place to stay.", "user": "PLP13", "date": "July 21, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115616410}, {"rating": 1.0, "title": "Deceptive Advertising", "text": "room. She said they are all the", "helpfulness": 3, "user": "Homejohn33", "date": "July 19, 2011", "id": 115510975}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled on business", "text": "same and that the carpet was brand new.(I don't see how this is possible as the carpet looked and smelled like it was from 1972) regardless, she would have given us a different room had they not all been checked into already. So we stayed there, did not sleep a wink- the queen size bed was mire like a full. We have a queen at home and this was much much smaller. Rom 518 is great for the location but quality of the room is terrible. For the $220 we paid to stay there, I would not recommend or stay there again. As someone had previously mentioned, there is nothing that great about pismo beach but the view. Nobody tells you that the walk to the beach is down 100 plus wooden steps -", "title": "Home Away From Home!", "user": "casbabco", "date": "July 18, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115494112}], "location": {"country": "United States", "city": "Pismo Beach"}, "stars": 2.5, "variance": {"poor": 24, "average": 58, "very good": 148, "terrible": 9, "excellent": 290}, "aka": "Cottage Inn By The Sea Hotel Pismo Beach", "slim_ranking": 0.321428571429, "description": "The Cottage Inn by the Sea is located on the Bluffs of Pismo Beach, California, overlooking a dramatic stretch of the Pacific. Our hotel features English country décor, stunning views, an inviting sundeck and pool overlooking the ocean."}