{"user_rating": 4.0, "review_count": 215, "name": "Country Inn & Suites Virginia Beach Oceanfront", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "Stayed for two nights. The beds were uncomfortable and almost unbearable for one with back issues. Fortunately, Josh at the front desk was able to go purchase foam mattress toppers and we placed two of them on top of the mattress. Josh was very professional, courteous and wanted to make sure we were comfortable. There was another gentleman at the front desk that also assisted but I didn't get his name. So, they get 5 stars for customer service. But they get 2 stars for cleanliness and overall \"tiredness\". The bathroom especially needed attention - there was mold on the grout around the tub. It is in a great location. I don't think I will stay there again due to the tired room or suite as they call it - because there is a small half wall the separates the beds from the sofa. The room is in need of a deep cleaning and updating. The free breakfast was typical but it was so crowded you could barely get through.", "title": "In need of a deep cleaning!", "user": "kgdspd", "date": "August 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 2.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 137410112}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "I paid $279/night for this plus taxes and fees. I thought that was a bit pricey. It's a nice place, but not a $300/night motel, even on the oceanfront and in peak season, and that's what it came to after all was taxed on. One thing I did notice was how cordial and accommodating the staff was at every point! The maids were smiling and speaking; the janitors and maintenance men were helpful with directions; and the front desk staff were extremely helpful and tried hard to accommodate our needs. The breakfast was really good and free! That was a plus since there were a total of seven of us! It was crowded though after 9am so a word to the wise: GET up and get down there for breakfast early so you can enjoy it and not have to fight for your coffee :-)", "title": "A little pricey, but the nicest staff I've ever encountered", "helpfulness": 1, "user": "DrPudden", "date": "August 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 137392744}, {"rating": 3.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "This is a very clean hotel ! We were only here for about 30 mins and found out that our TV remote would not work and the safe said low battery. Called front desk very nice, send someone up shortly ! Shortly never came, we wanted to go out but could not due to waiting. Called again about 2 hours later about our problem. Again very nice, be right there shortly ! Shortly never came again ! tired of waiting I went to front desk because we wanted to go out. Very nice again the fellow said he could not see where we had called ?! He said he would send someone ! I explained to him our room was HOT and it was set on 65. He said oh, it is a engery saver ! I am okay with that expect, at night it was VERY HOT!! For the PRICE stay at the Marriott next door !!!!!!!!!! SAME PRICE BETTER HOTEl. Checking out was a total disaster !!!!!!!!!!!!!! Can not get to the breakfast either.Not enough room for everyone. Went and purchased breakfast every moring else where !", "title": "Clean BUT HOT !", "user": "l156", "date": "August 5, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 1.0, "sleep": 1.0, "rooms": 3.0, "location": 4.0}, "id": 136337071}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "We had a great time in this hotel. My family of 6 stayed comfortably during the sand soccer tournament. The hotel was in a good location. Everything was in walking distance and we did not have to leave for anything. The room was a tight fit, however, being in Va beach, we didn't stay in the room for long. The balcony gave a beautiful view of the ocean. There is easy access to both the street or the beach. The buffet breakfast was great and very filling. There was also plenty of seating. The cleanliness of the room was pretty good. We did notice a few things but there was nothing major. The children loved the pool which was a great size. Parking garage was very tight, however, we maneuvered it just fine in out mini van. We enjoyed and will definitely be staying at this hotel again.", "title": "Enjoyed our stay!", "user": "BCwarrior", "date": "August 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 135981834}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "We came here after moving from the \"Rathole\" Travelodge down the street. Luckily they had a room for us on such short notice. The desk clerk even took us to see the unit before taking it. The breakfast bar was great, there was always someone cleaning,and the staff were very nice. The only complaint I have is that the pool was a little under maintained. Otherwise we were very happy.", "title": "A little expensive but worth it!", "helpfulness": 1, "user": "Jeff R", "date": "August 1, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 135960701}, {"rating": 2.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "We paid about $800 for 3 nights for a 1bedroom suite. I wrote the hotel in advance and I'm still waiting to hear from them, they never emailed me back. The room was okay but the tub and the bathroom needed a good cleaning. The front desk and housekeeeping staff seemed to be upset to be there. The free breakfast was okay, specially because it was free, but too crowded so we ended up eating some where else the other 2 mornings. We will not be coming back to this place the next time we visit Virginia beach. The pictures look nothing like the place.", "title": "Average and overpriced", "user": "travel74Travel74", "date": "September 9, 2012", "detail_rating": {"service": 2.0, "cleanliness": 1.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 139851860}, {"rating": 4.0, "stay_parameters": "Stayed August 2012", "text": "We stayed here for 4 days and 3 nights. We love the views of the beach and the rooms were clean. However the bathrooms were looking old and poorly maintained. I loved the morning breakfast, there is usually eggs, sausage or bacon, and waffles. Also someone removed my wedding band from the room without my knowledge. Overall it was an enjoyable stay.", "title": "Good Hotel but it's showing its age inside the rooms!!", "user": "YFEN2KDZ", "date": "September 4, 2012", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 139366303}, {"rating": 2.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "Disappointing. Was expecting better based on other Country Inns and the price. Front desk staff was ok. Cleaning staff seemed to be having personnel issues. Breakfast was stressful - extremely crowded, and poor design for access to food. Folks in management and the corporate office should bring the family and give it a try - then hire a professional to observe and start from scratch with the space. Milk ran out, cereal choices were odd, and the cooked food was not worth eating. The hallways and elevators were extremely hot, and the wait for the 2 elevators was always long. Ice machines ran out. The beachfront location and beach were nice, but why stay here with so many other choices?", "title": "Good location but hotel", "helpfulness": 1, "user": "StreamsAndCities", "date": "August 27, 2012", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 138612039}, {"rating": 1.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "The bathroom was disgusting. The walls were lined with mold, the ceiling had collapsed at some point and instead of fixing the ceiling, they screwed on a metal plate to patch it. With the price I paid, I expected a clean bathroom at least. Also, I had a few questions for the staff and each of them were rude when answering. I guess with the great location, they have a steady flow of customers and don't care if you're not happy. The location is great, but the place needs to be cleaned, and the staff answering the phones at the front desk need customer service training.", "title": "Gross hotel", "helpfulness": 2, "user": "Tanyaop", "date": "August 24, 2012", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 2.0, "sleep": 2.0, "rooms": 2.0, "location": 4.0}, "id": 138216915}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "This is a nice hotel. If you're not used to Country Inn and Suites you will be ok with it. Its right on the beach--great location. But it doesnt have the Country Inn and Suites look or feel. I was in VA Beach for 2 nights but couldnt get boths nights at this hotel or the one near the airport. So I stayed near the airport on Thursday and this one on Friday night. So I had to check out near the airport by 12 noon on Friday. For some reason I thought I might be able to check in early (I am a Club Carlson member), at least by 2pm. Check in time at this hotel is not until 4pm.", "title": "Not the Country Inn and Suites You're Used To", "helpfulness": 1, "user": "JamaicaJ", "date": "August 21, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 2.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 137955239}, {"rating": 3.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "Stayed here for 4 nights with my family last week. The location is really, really good. Was our first time to VA Beach and we were pleased to have so many things to do without taking the car our of the (FREE!) parking garage. With 4 kids, we typically look for suites hotels and generally find something spacious. This was very small compared to what we were expecting.", "title": "Location is great- Value not so much", "helpfulness": 4, "user": "tajurach", "date": "July 28, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 2.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 135647314}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "Room was clean but carpet had that wet-towel-on-the-floor smell. I suppose that's typical at the beach, but doesn't make it pleasant and there are ways to freshen up the carpet between guests. Housekeeping staff were friendly but not the most professional. We opted for 'clean towels only' in lieu of full service on our 2nd day ... and that's exactly what we got. Ran out of shampoo and toilet paper and had to go to front desk for those. Staff who worked the breakfast were excellent and pleasant. Staff at front desk professional and friendly as well.", "title": "Excellent staff", "helpfulness": 2, "user": "chopin333", "date": "July 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 135432246}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "Overall I would not hesitate to recommend this property; just know that for the price, this is not anything luxurious. You are paying for the location.", "title": "ok stay, but nothing more .", "user": "BergenRoy", "date": "July 23, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 135117965}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled with friends", "text": "I booked a hotel down the street andI encountered extremely rude people at the front desk. After cancelling the reservation, I happened into the Country Inn & Suites, and stayed for two nights. Every single employee went above and beyond to help and make our stay wonderful. The rooms are nice, clean and the patio opens steps from the beach. Breakfast is one of the best around, and proximity to shopping is good. I can't remember the names of the incredibly kind lady and young man at the front desk, but you know who you are! Thank you.", "title": "Courtesy Beyond Compare", "helpfulness": 2, "user": "skoolmom", "date": "July 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 134524239}, {"rating": 3.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "Nice view, beachfront, free wifi, ok breakfast, ok staff", "title": "Good location", "user": "mac4216", "date": "July 13, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 134322091}, {"rating": 1.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "My family and I stayed one night at this hotel and it was just awful! Upon entering the room, I checked the bed for bedbugs and found bedbug blood stains on the fitted sheet. I called the front desk and an employee was dispatched to change the bedding but the front desk called back and offered us a new room which happened to be two doors away. Upon entering that room, I found the bathroom to be disgusting because the shower and tub had a lot of stains and the sink drained extremely slow. The ceiling was cracked from previous water leak/damage that had not been properly repaired. We visited the pool and it was cloudy and dirty looking. The onlyn good thing about this hotel is the breakfast!", "title": "Terrible, terrible, and slightly okay", "helpfulness": 2, "user": "A M", "date": "July 12, 2012", "detail_rating": {"service": 4.0, "cleanliness": 1.0, "value": 3.0, "sleep": 2.0, "rooms": 1.0, "location": 5.0}, "id": 134236672}, {"rating": 3.0, "stay_parameters": "Stayed July 2012", "text": "Pros: nice view, free parking, direct beach access, in the center of shopping area, decent included breakfast.", "title": "Average experience", "helpfulness": 2, "user": "lnhanna", "date": "July 12, 2012", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 5.0, "service": 2.0, "rooms": 3.0}, "id": 134188345}, {"rating": 3.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "Cons: rooms not spacious so felt cramped for a family of 5; staff took a long time to bring extra pillows and towels so we went down ourselves to get them; long waits at the elevators; fitness room was small; pool area is dark; breakfast area very crowded -- they need a layout so people can get to areas blocked by others waiting for toast or waffles; A/C on top floor room really struggled to keep room cool with high 90's temps.", "title": "Family of six would return", "helpfulness": 2, "user": "PUJtravel", "date": "July 9, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 133952010}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "Great location on mid boardwalk area. Lots of activities always going on around there. Good breakfast. It's not the Cracker Barrell or the local pancake shop - keep that in mind, but it's better than continental breakfast. They had waffles with toppings, oatmeal with toppings, coffee, juices, toast, bagels, pastries, cereal and some kind of hot food like french toast, sausage links or patties, biscuits, scrambled eggs, ham, etc... each morning. We never left hungry. If you have a car with a topper on it, it won't fit in the parking garage. We had to unload everything on top before entering and load it up outside the garage upon leaving. However, it is free parking and it's so nice to leave your floor (we were on the 5th) and walk straight outside to your car on your floor level. Plus everything is monitored, so no beach people are walking in. Every door on the outside is opened with a key, and even the lobby floor restroom. A lot of people use that entrance next to the hotel to get to the beach though. The showers on the beach were located right next to the hotel and usually being used by someone. There are ice cream and yogurt places all around there! The only down side for us was not having an outside pool, but not a lot of the hotels we saw there on the ocean side have one, or it's inside but with a nicer atrium type surrounding. The inside pool was bigger than I thought it would be, but uninviting. No outside light or windows and actually kind of dark inside. I did use the exercise room; it was ok. Our room smelled like smoke when we got there, but they deodorized it the next day. The balcony is tiny. And once you get six people in the room with all their luggage, it gets tiny, too! We did have some problems here in there, but they were always quick to attend to it.", "title": "Great location!", "helpfulness": 1, "user": "Natasha M", "date": "July 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 133406592}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "I read the reviews of this hotel before we went and was leery. But I must tell you my family had a wonderful time. The location was amazing. We walked everywhere, the hotel is right next to the 17th street stage. The hotel staff was great and friendly and helpful. The hotel staff were always cleaning. We just had a wonderful time.", "title": "Nice hotel, price and location", "helpfulness": 1, "user": "S N", "date": "June 24, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 132628000}], "location": {"country": "United States", "city": "Virginia Beach"}, "stars": 2.5, "variance": {"poor": 20, "average": 37, "very good": 80, "terrible": 11, "excellent": 67}, "aka": "Country Inn & Suites Virginia Beach Oceanfront Hotel", "slim_ranking": 0.359649122807, "description": "Welcome to the Country Inn & Suites Virginia Beach Oceanfront hotel! Located on the beach and just steps away from the world-famous Virginia Beach Boardwalk, our hotel provides easy access to the beach, area dining, souvenir shopping, entertainment and more. Every room features spectacular views of the Atlantic ocean along with a private balcony, microwave, refrigerator, and coffee maker. With its convenient amenities like complimentary hot breakfast, free high-speed wireless Internet access, heated indoor pool, fitness center, oceanfront restaurant, and on-site parking, our oceanfront hotel in Virginia Beach, VA is sure to please leisure and business travelers alike. Come visit us for a fantastic beach vacation!"}