{"user_rating": 4.5, "review_count": 42, "name": "Country Inn & Suites Iron Mountain", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled with friends", "text": "My friend and I stayed at this hotel for one night and were treated very well. Upon check-in we even received a small bag of mixed candy as a thank you for staying there, even though our rate was very low.", "title": "Great service but far from the centre", "user": "Gnopps", "date": "November 12, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 3.0, "service": 5.0, "rooms": 4.0}, "id": 49033359}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "The only bad thing about this hotel was the location; walking to the town centre took quite a while.", "title": "Excellent hotel with great staff and rooms", "user": "SolaraMinnesota", "date": "August 19, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 38181397}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "I have no complaints. It is a great value for very nice rooms. The breakfast was excellent for a free breakfast.", "title": "Great Experience...Best Hotel in Area!!!!", "user": "Walker1206", "date": "July 6, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 34065460}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled on business", "text": "This hotel is a true gem in in the heart of the upper midwest. We checked in at 11:00pm and the front staff was as courteous as had we arrived mid day. They had fresh, warm chocolate chip cookies for us, as I had told them we would arrive late. This is an award winning touch of hospitality. The rooms are immaculate and spacious, the indoor pool/hot tub are excellent, and the breakfast is fantastic. All the staff at the hotel were extremely courteous and helpful with any assistance we required. The free wireless internet worked flawlessly...I have also stayed at this hotel previously for business and never have had any issues whatsoever with superb Internet access. This is truly the best hotel within 50 miles of Iron Mountain, and located right by shopping (Wal-Mart/Home Depot/K-Mart) and fine dining. I would highly recommend the Storheims restaurant directly across from the hotel...great breakfast/lunch/dinner and treats. Other fine restaurants are Fontanas, Romagnolis, and B's Country Cafe.", "title": "My favorite hotel in Iron Mountain", "user": "torotech", "date": "March 10, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 25965541}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled solo", "text": "If you are traveling to the Upper Peninsula or northern Wisconsin, this is definitely the place to stay!!!", "title": "New hotel", "user": "late74C", "date": "August 26, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 19382499, "likes": {"liked": "— new hotel", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "My sister and I were on the road and needed somewhere to stay. As soon as we drove into Iron Mountain, the Country Inn & Suites was the first place we saw. When I walked in to inquire about availability, friendly Phil at the front desk couldn't have been nicer. He entered our reservation for a two-bed room, and just from general chit chat, he discovered that we were in town for a funeral, qualifying us for the funeral rate. The rate we received was a great deal for what we got.", "title": "Everything I expected - and more!", "user": "desert-drivel", "date": "August 10, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 18827052, "likes": {"liked": "— The comfortable bed & the friendly staff", "disliked": "— No cell phone service (not their fault though!)"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled on business", "text": "The rooms are all interior entrances, which is a bonus for two female travelers. The room was clean - very clean - which is #1 on my list of priorities. I didn't even mind walking barefoot in the room. The beds were large (queens I think) and ranked high on the comfort scale. We both slept til 9am which was highly unusual for us!", "title": "Best room in Iron Mountain!", "helpfulness": 1, "user": "honeymoonin", "date": "May 18, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 16159165}], "location": {"country": "United States"}, "stars": 2.5, "variance": {"poor": 1, "average": 2, "very good": 11, "terrible": 0, "excellent": 28}, "aka": "Iron Mountain Country Inn", "slim_ranking": 0.181818181818, "description": "The Country Inns & Suites of Iron Mountain is located in the beautiful Upper Peninsula of Michigan. We are an 84 room hotel with a wide variety of room types from standard to executive extended stay. We provide all of our guests with a deluxe continental breakfast, free high speed internet, and enough fresh baked cookies to go around. We are sure that after staying with us you will be saying I love this country!"}