{"user_rating": 3.5, "review_count": 55, "name": "Country Inns & Suites O'Fallon", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "Country Inn and Suites has a great reputation and usually does not disappoint....this one does and it is a shame it carries their name. It is a non-smoking, non-pet hotel, which is fine. You sign and initial that you do not smoke/have pets, or you are charged an exorbitant fee. You would expect it to be fresh and clean smelling.....right? The problem is that the enitre property reeks of smoke and strange odors. It is dated, but clean. The smell is what really gets you. Obviously not an original Carlson property, but one that has been bought and refurbished. The rooms were small....we did not need a suite, so requested a king room. It was tight, to say the least. Great desk/chair, but no overstuffed chair for sitting/reading/relaxing. The bathroom is tiny, but clean. The towels were extremely thin and worn....definitely not a plus. Room had a microwave and fridge, but both had to be plugged in. Very strange. Great flat screen TV, and the staff seems to be family, and very friendly. The spa looked OK and usually had people in it, but the pool looked green. Gross! It was ok for the 2 nights we were here and gone all day, but definitely not a place you would want to hang out and relax. We stayed here due to the great price and proximity to St. Louis activities, but will not be back.", "title": "Not a fave!", "user": "bessiedear", "date": "June 16, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 2.0, "location": 3.0}, "id": 67653101}, {"rating": 1.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "Where do I begin? Over the course of two nights, we had a total of three rooms. The first room had no tissue, no soap for the shower, the carpet had not been vacuumed, and it was very clear that housekeeping had made the bed without changing the sheets (there was hair in the bed). YUCK! The towel rack over the toilet was pulling out of the drywall. We complained at the front desk, and she cheerfully gave us another room. The air conditioner in this room was out of order. The third room had a broken towel rod over the sink. The overworked desk clerk was trying to run the front desk, bake the complimentary cookies, and do the laundry. She wasn't even supposed to be any of these -- she was supposed to be the night auditor. The breakfast area was a mess, as well. The tables were not being kept clean, the food was not being replenished, the orange juice was watered down, and no one was emptying the garbage container, so paper plates and cups and scraps of food were spilling onto the floor. The daytime desk clerk was trying to run the kitchen as well as the front desk. And this is purely personal: kids from the pool area were in the eating area with bare feet. Isn't that against the health code? When we requested that all charges be removed from our bill, the manager asked if we would like a free night. You've got to be kidding!!!", "title": "Never, ever again.", "helpfulness": 1, "user": "youvealwayshadit", "date": "May 3, 2010", "detail_rating": {"service": 4.0, "cleanliness": 1.0, "value": 1.0, "sleep": 3.0, "rooms": 1.0, "location": 3.0}, "id": 63130703}, {"rating": 1.0, "stay_parameters": "Stayed June 2009, traveled on business", "text": "The bathroom floor had not been cleaned for weeks it looked like. The toilet had brown stains in it. The stair wells were dirty and unkempt. The management refused to move us. The next morning when checking out I was asked by one of the managers if I had a nice stay. I said it was not. He said, \"oh, that's too bad.\" I know we will never try to stay here again and I doubt if we every try Country Inns again.", "title": "Bathroom so dirty we only stayed one night instead of 3.", "helpfulness": 1, "user": "ron-diane", "date": "November 9, 2009", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "location": 2.0, "service": 2.0, "rooms": 2.0}, "id": 48847651}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled with family", "text": "Country Inn always surpasses our expectations. We stayed here for our visit to the Scott Air Force Base Air Show. They are located right of I-64 and 15 minutes away from St. Louis. There are a few restaurant within walking distance and even a gas station with all kinds of beverages and snacks. There are TONS of restaurants within a 5 min drive.", "title": "Nice place close to St. Louis", "user": "CyberguyPR", "date": "October 8, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 46196333}, {"rating": 5.0, "stay_parameters": "Stayed July 2009", "text": "The room was clean and looked in great shape. The nice 32\" LCD TV as well as the microwave and fridge worked perfectly. The only thing that looked out of date was the extractor fan in the bathroom, although the rest of the bathroom was in good shape.", "title": "Very impressed- An amazing bargain", "user": "alanpsych1", "date": "July 23, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 3.0, "rooms": 4.0}, "id": 35573708}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled with family", "text": "Lived up to all the great reviews! Would stay again. Easy to find - right off interstate. Near lots of restaurants and shopping. Breakfast in enough to get you going. Very quiet rooms", "title": "Lived up to great reviews!", "user": "vocomail", "date": "June 17, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 32530164}, {"rating": 4.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "We stayed here while traveling through the area. My first impression was that the lobby area was not as clean/tidy as I might expect - nothing specific but just seemed a bit dingy. The room, however, was fine and the beds were good. There was a nice flat panel TV and the internet worked well. There did seem to be a problem with the bath/shower control - it appeared something was missing - and it was very hard to turn it totally off. Maybe because this was a room with 2 queen beds instead of a king there was no comfortable chair - just a straight-back chair. I find that unusual.", "title": "OK Country Inn", "user": "ClaudiaB", "date": "April 27, 2009", "detail_rating": {"cleanliness": 3.0, "location": 4.0, "value": 3.0, "rooms": 4.0}, "id": 28863129}, {"rating": 4.0, "stay_parameters": "Stayed October 2008, traveled on business", "text": "Traveling from Orlando, FL, to Chicago, on the way i stayed at this hotel for one night and the rooms were so clean and big. They had flat panel TV, and the bed was really comfortable. The hotel had really good breakfast, even though it was continental breakfast, it seemed like it was gourmet breakfast. With hot waffles, bagels, muffins, biscuit, gravy, fruits, yogurts, eggs, milk and serial, fresh coffee, and three different juices, cheese omelet. Also, the swimming pool and hot Jacuzzi was a great treat. Over all the staff was really wonderful and kind. I absolutely recommend this hot to everyone.", "title": "Great calm and relaxing feeling", "user": "aparekh04", "date": "January 28, 2009", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 23985973, "likes": {"liked": "— Room was very clean, and had all the aminities i needed"}}], "location": {"country": "United States", "city": "O'Fallon"}, "stars": 2.5, "variance": {"poor": 7, "average": 7, "very good": 18, "terrible": 9, "excellent": 14}, "aka": "Howard Johnson O'fallon", "slim_ranking": 0.636363636364}