{"user_rating": 3.5, "review_count": 78, "name": "Country Inn Sonora", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "Clean, remodeled in modern motif. Bed was comfortable but the matress cover made a lot of noise getting out of bed.", "title": "Hotel was okay.", "helpfulness": 2, "user": "paull2002", "date": "August 27, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 3.0}, "id": 138551817}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "WATCH OUT FOR THE BED! It bites! No, not bugs but it's a plattform bed. The frame extends about 4 inches past the matress. In the middle of the night while walking from the bathroom to the far side of the bed I smashed my shin into the frame. THAT HURT!!! The other issue is the breakfast is not served until 7:30am. ???? Don't these people realize that some folks like to get an early start? Otherwise, the hotel is a bit out-of-the-way but a good value for the money.", "title": "Decent Price for great room", "helpfulness": 3, "user": "Rodders1964", "date": "August 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 138279775}, {"rating": 4.0, "stay_parameters": "Stayed August 2012", "text": "Stayed in on road trip with my family. Two rooms with twin queen in one and king size in other. Clean and comfy rooms. We all had a great sleep. Absolutely boiling outside but fine in teh rooms. Breakfast included was fine - mix of hot cooked food and continental. To be honest they could have stuck with teh cold continental and it would have been fine. There is no dining room so you take your stuff to your room. Not a problem. Free wifi to suited the kids. We went into Sonora for evening meal and there was nothing in sight. All of the places to eat seem to have shut down. Not closed for the night, shut totally. We ended up at Subway!!", "title": "Very nice hotel", "helpfulness": 2, "user": "Evabog", "date": "August 15, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 137308871}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "My boyfriend and I have stayed here after going to Yosemete,a little far from there,but saved us a lot of money.The rooms were clean and the place had a really good vibe. I would deffinitly stay here again .", "title": "Clean, Modern and Great Value", "helpfulness": 2, "user": "IamMrsSmith", "date": "August 14, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 137183591}, {"rating": 2.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "Was traveling with older relatives who were not into the ghost-town-feel of downtown Jamestown. This hotel is literally a 3-minute drive if you need the conveniences of downtown.", "title": "What happened to the towels?", "helpfulness": 1, "user": "Lou M", "date": "August 14, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 1.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 137131224}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "Rooms respecting the Country Inn standards. Quite big, comfortable and clean. Around the hotel there is almost nothing, you need to drive to Sonora to find restaurants and shops. Wi-fi working quite good. The breakfast was a joke: served in a small room close to the front desk, no place to seat and you have to serve yourself directly from the fridge! In that case was better not to write \"Breakfast included\"!!! Air conditioning quite noisy", "title": "Close to Yosemite National Park", "helpfulness": 1, "user": "Rik_Milano", "date": "August 11, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 136893678}, {"rating": 3.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "Took a tour of California's Gold Country and chose lodgings based on reviews and travel guides. I was sorely disappointed. The hotel was off the beaten track and miles away from the actual towns it represented. It was misleading to hear it was in 'the heart' of anything. The directions they provided were difficult and confusing.", "title": "Did not have the guest's best interests in mind,", "user": "Edye P", "date": "August 8, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 2.0}, "id": 136684859}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "The hotel itself was nice and comfortable and the rooms were great. It was noisy and intrusive as our room was near the pool. Parking towards the end of the day was troublesome. The breakfast scene was chaotic and crowded and definitely not with the guest in mind. You were expected to carry your tray of food to your room (for me, it was up 3 flights of stairs and down a long corridor) and there were no provisions made to help visitors open the door to carry out their breakfasts. The coffee makers in the rooms were a joke and there were no vending machines. This was did not have our best interests in mind.", "title": "nice rooms... bad breakfast", "helpfulness": 2, "user": "austrokiwi", "date": "August 2, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 136044558}, {"rating": 3.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "we liked the country inn case of the rooms: big, good sleeping comfort, clean.", "title": "Served its purpose", "helpfulness": 1, "user": "MfromTX", "date": "July 12, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 2.0, "location": 3.0}, "id": 134190672}, {"rating": 1.0, "stay_parameters": "Stayed July 2012, traveled with friends", "text": "there is also a nice pool and a lots of parking places near the rooms.", "title": "Not the best location to stay", "helpfulness": 2, "user": "Annymous123", "date": "July 8, 2012", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 3.0, "sleep": 3.0, "rooms": 1.0, "location": 1.0}, "id": 133802389}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "We used this hotel as a 2-night base to allow us to ski at Dodge Ridge mountain. Easy access within an hour.", "title": "Great value for money", "user": "shonky", "date": "December 29, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 148289040}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "The hotel itself is great value, new beds/tvs, perfect for 2 adults + 1 toddler. The bathrooms are a bit dated but great shower (much valued after a long day at the snow).", "title": "Watch your shins!", "user": "Jerie R", "date": "November 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 145021499}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "All in all a clean, comfortable, very quiet room. Stayed in Room 321 on November 5 & 6, 2012. It was a smoking, 2 queen bed room on the back side of the building. Nice, clean room (except carpets needed shampooing) with microwave and frig. In room coffee. No toiletries provided except soap (no lotion, shampoo, shower cap, etc). Nice flat screen TV w/ remote, clock & phone in room. Table & Chairs provided and luggage rack. Breakfast was available from 7:30-9:30 but we did not have breakfast. Comfortable bed with 3 standard pillows on each. No bedspread or comforter which is fine. Wall unit heat and air (under window) which worked well. No screens on windows. Staff in office were very nice. Tub shower combo with low shower head and OK water pressure. BE AWARE OF PLATFORM BEDS.........although comfortable for sleep, you must be constantly conscious you don't hit your legs on them or you will get a big bruise on your shins like my husband did.", "title": "Reasonable for an out-of-Yosemite experience", "helpfulness": 2, "user": "Brook O", "date": "October 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 143880006}, {"rating": 2.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "Clean. Quiet. Reasonably priced (for Yosemite area). Hotel owners are extraordinary - very friendly and helpful, far beyond expectations. Drove into Sonora for a lovely dinner. It was pleasant weather in October so we did not need to turn on heat or air. An easy drive to Yosemite the next day.", "title": "Not the best", "user": "mjcvh", "date": "October 21, 2012", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 3.0, "sleep": 3.0, "rooms": 2.0, "location": 3.0}, "id": 143345717}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "We stayed for one night on our way out of Yosemite. The reception area looks like it has not been touched for decades. They serve breakfast in the lobby, however there is a sign asking you to take it to your room to eat as there is nowhere to sit. The rooms seem to have new beds, desks and a very large flat screen television, however the fixtures and fittings are old and worn. The room was not very clean, the headboard of the bed seemed to have been wiped with a dirty cloth and overall it felt dirty. The bedlinen looked clean, but the towels had yellow stains on. The wallpaper in the bathroom was peeling off the wall. The shower fixing was faulty and pretty much came off the wall as it was switched on. We had a nice dinner at Diamondback Grill in Sonora, which was very good and had a nice atmosphere. We booked this hotel based on the convenient location for our trip and although we knew not to expect too much for the price we were paying, the other reviews were fairly positive. Overall, we were disappointed.", "title": "Very nice hotel, great front desk person", "user": "weatherman19", "date": "October 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 143143100}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "We only stayed one night as we were en route to Sacramento and needed stopover. If we could have we would have stayed another night.", "title": "Fantastic place to stay and great value!", "helpfulness": 4, "user": "MaryCamberley", "date": "October 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 142610418}, {"rating": 1.0, "stay_parameters": "Stayed September 2012, traveled with friends", "text": "On arrival we received a warm welcome and the key to our room. We were in 314 which is third floor, but owing to a road that goes round the back of the building, was a room entered at ground level. No stairs to carry heavy bags up.", "title": "NOISY! NOISY! NOISY! FIND ANOTHER PLACE TO STAY", "helpfulness": 2, "user": "Denise G", "date": "October 5, 2012", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 1.0}, "id": 142079288}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "We'd booked a room with king-size bed, but never dreamt it would be so good. Very large room with king bed, sitting area with sofa and coffee table, work desk and chair, good sized fridge, microwave and large flat screen TV. It was clean and well decorated. As with most of the motels/hotels we've stayed in, the washbasin and mirror is outside the bathroom, the shower was powerful and water plentiful and hot. The bed was comfortable and all bedding very clean. Wi-Fi access fairly fast too.", "title": "Very nice place", "helpfulness": 2, "user": "Tomer_31", "date": "October 2, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 141859796}, {"rating": 2.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "Continental breakfast included and all for a very competitive price.", "title": "Ok but I would not stay there again", "helpfulness": 2, "user": "Randyclements", "date": "September 25, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 2.0}, "id": 141290360}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "This motel is situated on the edge of Jamestown which is only a 1-2 minute drive away and a lovely historic town. There is also a wonderful historic railway yard, Railtown, complete with old locomotives and carriages, railway turntable and historic station buildings.", "title": "Very comfortable and clean", "helpfulness": 4, "user": "RiccO12", "date": "September 2, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 139207650}], "location": {"country": "United States", "city": "Jamestown"}, "stars": 2, "variance": {"poor": 11, "average": 23, "very good": 22, "terrible": 7, "excellent": 15}, "aka": "Country Inn Sonora Hotel Jamestown", "slim_ranking": 0.75}