{"user_rating": 4.5, "review_count": 109, "name": "Country Inn & Suites By Carlson", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "My wife and I stayed at this hotel for a long weekend. We travel to State College every year around this time of year, and our other hotel was booked for the weekend. So we tried the Country Inn and Suites based on reviews, and we were not disappointed!", "title": "Wonderful stay!", "helpfulness": 1, "user": "Double-D-Sharp", "date": "June 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 131664520}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "The hotel is a relatively new hotel that is sparkling clean in all areas. The hotel staff was very friendly and helpful from the time we walked in the front door until we left a few days later.", "title": "Great Stay!", "user": "moo53449", "date": "May 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 130294476}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "The breakfast area was very well stocked each morning with eggs, potatoes, sausage, biscuits/gravy, pastries, cereal, fruit, yogurt, and breads. The food was kept hot, and the staff did a wonderful job keeping it fresh and stocked. For those who didn't have time to eat, there were small \"to go\" bags prepared with fruit and a pastry.", "title": "New Favorite in Happy valley", "helpfulness": 1, "user": "liltraveler46", "date": "May 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130034620}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with friends", "text": "We took advantage of the hotel pool and hot tub which was in an area in the back of the hotel. The pool was very clean and was kept at a very comfortable and refreshing temperature. The nearby exercise room had modern equipment that we also used during our stay.", "title": "Cozy & Clean", "helpfulness": 2, "user": "Katie M", "date": "May 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 129920298}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "Our room was a whirlpool room with a king-sized bed. The room was maintained very nicely, and contained a small refrigerator and small microwave. We took advantage of the FREE unlimited long distance telephone calls to contact family back home during our stay. Our 2-person whirlpool was quite refreshing, and simply added to our enjoyable stay.", "title": "Fantastic!", "helpfulness": 1, "user": "amthim", "date": "April 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 128243604}, {"rating": 3.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "The hotel was fine, and the staff was great. Apparently whoever manages the hotel, or the buffet, requires extra training in planning for a sold out facility. And its not like they didn't know at least a week a head of time that the place was full. If not for the disaster of the buffet, I would have given the place 4 or 5 stars.", "title": "If you crave a buffet that actually has food, don't come here.", "helpfulness": 1, "user": "JinglesNewtown_Pa", "date": "April 16, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 1.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 128011297}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "We went down to the buffet breakfast at 945 AM on Sunday, April 15. This is well before closing of the buffet, at 1030 Apparently there was hardly anything left to eat. All the mixed fruit was gone, the waffles irons kept blowing out the circuit breakers, and could not be used. There was no coffee, unless you kept asking for the pots to be refilled. All the danish was gone. And I could go on and on. Only thing left was some bagels, muffins, and sausage. This was not the fault of the buffet staff. There where running around, trying to accommodate everyone, but appeared short of help. The hotel was full. EXTREMELY POOR PLANNING on the part of management. They knew the hotel was fill, but did nothing to make sure enough staff was working, or ample food was available. When we asked the staff, they said they had run out of all the above mentioned items, and there would be no more. So for $180 for one night, the price was way to high, and what was promised as far as a free buffet was a joke. My first stay here, and will probably be my last. I have stayed at numerous State College Hotels over they past 4 years, and never had encountered a buffet, where the food was gone 45 minutes before closing.", "title": "Great new hotel in State College.... hot breakfast included!", "user": "vacayisfun", "date": "March 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 126706969}, {"rating": 5.0, "stay_parameters": "Stayed March 2012", "text": "We stayed at the Country Inn and Suites this weekend while travelling to Penn State for a swim meet. Our reservation was booked under a swim team group. I didn't realize we were going to be staying in a brand new hotel property, so I was pleasantly surprised. The hotel, built in Oct. 2011, is conveniently located a few minutes from downtown and the university. There were plenty of restaurants nearby without the hassles of parking downtown.", "title": "Superb Customer Service!", "helpfulness": 1, "user": "Divapeart", "date": "March 24, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 126600288}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled solo", "text": "The front desk staff was very helpful and pleasant. Our room and the hotel common areas were spotless. The lobby decor was warm and inviting. A hot buffet breakfast was included in the room rate. The perishable items on the breakfast buffet were all fresh. In fact, the scrambled eggs tasted fresher than I have come to expect at a hotel breakfast buffet. Immediately after we checked in and reached our room, the front desk staff called to make sure we were satisfied with our accommodations. What a nice touch! I would definitely stay at this property if I were in the Penn State area in the future. I liked the hotel so much; I joined their Rewards Program!", "title": "Nice visit to State College", "helpfulness": 2, "user": "Checklist", "date": "February 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 125427231}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "The entire team at \"The Country Inn and Suites\" was \"Excellent\".Amanda at the Front Desk went above and beyond to accommodate my family needs and I was also impressed with Craig \"Superb\" customer service skills, who offered to move his car so my husband could park his car closer to the hotel entrance! We \"Enjoyed\" our stay and highly recommend \"The Country Inn and Suites\" and look forward to staying there in the future!", "title": "Good value and very helpful staff", "helpfulness": 2, "user": "CookieCahill", "date": "February 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 124943342}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled with family", "text": "Attending our first THON weekend as parents of a PSU student, so a nice place and \"comfortable\" bed after standing each day was the wish. This new facility (new as of Oct. 2011) granted the wish. Quick check in and friendly folks at the front counter. The room itself was very nice. Just a traditional room (2 King beds) Worked well for 4 of us (wife & myself & 2 kids under 14). Microwave in the room and small fridge. Very comfortable beds and clean all around.", "title": "Country Inn & Suites During THON 2012", "helpfulness": 1, "user": "JmRaze", "date": "February 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124927733}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "We had to run out to get seats at THON (which we couldn't sit in! The irony) so we did not take advantage of the FREE breakfast. It was a hit & run stay but I highly recommend due to it's newness and friendly staff. There are doors on each end you can access with room key which was helpful for a bit less walking with hands full at the end of the evening.", "title": "Great Hotel, great staff", "helpfulness": 2, "user": "BDH1106", "date": "January 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 122757449}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "We stayed just one night for a tour of Penn State, and we had a very good experience at this hotel. It's just outside of campus, but it's very easy to get in and out. It took us about 5 minutes to drive to the prospective student info session site, right near the stadium. The staff members at the hotel were very welcoming, and even though we had just booked a regular 2-queen room, we were given an upgrade to a suite on arrival as I am a Club Carlson member. Nice surprise, and we were happy to have the extra space. The cookies at the entrance were a nice touch. We did use the pool and spa which were great, and the room was spotless. Breakfast was pretty basic, but there were some hot items (scrambled eggs, potatoes, ham) and the make-your-own waffle station was popular. The room rate was extremely reasonable and we felt we got a lot for not a lot of money. We would definitely stay at this hotel again!", "title": "Great service and convenient location", "user": "StJohnFan", "date": "July 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 133400229}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "Stopped by my Alma Mater on a trip to the East Coast and found this to be a VERY nice addition to the accomodations available in the area. I had wanted to stay within walking distance of campus, but the accomodations that are that close to the University are quite a bit more expensive and offer only small rooms. Country Inn and Suites offered a variety of rooms sizes. We stayed in a one-bedroom suite and were extremely comfortable. i was traveling with 4 teenagers, so the extra room came in handy. The hotel is a only a few minutes drive from downtown State College, and it offers lots of free parking. The cookies available in the lobby on check-in are always a nice touch. Beds were very comfortable. Wifi worked well and kept the kids happy. The pool was small, but adequate to cool down after a hot day. We have stayed at Country Inn and Suites in various locations around the country, and the breakfasts are always a nice addition. There are always quite a few choices, and it is a money saver when traveling with a family. The only negative I have is that the front desk clerk acted like she REALLY did not want to be there. When we checked in, no one else was in the lobby, but she was busy doing something on her computer and I stood there for several minutes before she even acknowledged me. Then she went back and got her manager to help me. I would stay here again, but hopefully will get a better reception next time.", "title": "Good, Comfortable Accomodations Close to PSU", "user": "Wildwoodatheart", "date": "June 28, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 133006776}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled on business", "text": "Clean and quiet hotel, convenient location near highway exit and near university. Only problem was that the WiFi did not work.", "title": "Clean, quiet, and adequate", "user": "Autumnsky", "date": "June 26, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 132851149}, {"rating": 5.0, "title": "we'll be back", "text": "Stayed 3 nights in 1 bedroom suite. Friendly staff, clean room, good a/c, clean & well maintained pool (my kids swam 8 times in 4 days), cookie jar in lobby...yum, close to downtown.", "user": "ShipU2002", "date": "June 24, 2012", "id": 132693700}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "Huge parking lot in rear...bring your kids' bikes!", "title": "Fabulous home away from home", "user": "Taryelle", "date": "June 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 132445317}], "location": {"country": "United States"}, "stars": 2.5, "variance": {"poor": 2, "average": 5, "very good": 31, "terrible": 0, "excellent": 71}, "slim_ranking": 0.0384615384615, "description": "The Country Inn and Suites in State College is the area's newest lodging property, that offers 113 clean, comfortable and consistant accommodations with a touch of home! The hotel features a complimentary hot breakfast, indoor pool and spa, fitness room, and meeting room. We're located just minutes from the Penn State Campus, on College Avenue/Route 26 at the US 322 Intersection. Come be our guest at the Country Inn and Suites!"}