{"user_rating": 4.0, "review_count": 110, "name": "Country Inn & Suites Atlanta-Airport North", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "Great hotel for the price. Room clean and big. Shower has good pressure. Bed comfy with nice bed linen. Staff friendly. Breakfast is the expected-waffles and steam table of American food. Indoor pool and jacuzzi year round. Parking free and right out front. Have not stayed at any other airport hotel but will return to this one. Only spent a Saturday night. Definitely will recommend.", "title": "Definitely recommend", "helpfulness": 2, "user": "WadeAtlanta", "date": "November 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 145595016}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "We stayed here overnight to make a flight connection. The hotel is well located; the staff was pleasant and helpful and the breakfast met our expectations. The shuttle was especially helpful. Our flight was late the next day and we were able to store our bags and use the shuttle to get to the metro to tour Atlanta. We then used the shuttle to get back to the hotel and retrieve our bags and return to the airport for our flight. We would definitely stay here again.", "title": "Good choice", "user": "Bob732", "date": "November 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 145001375}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled on business", "text": "Our group had a great experience staying at this Country Inn and Suites. It was convenient to Altanta Metropolitan State College where we were attending a conference. Stephanie, the Director of Sales, worked with us on group reservations and did an excellent job. Everyone from her to the staff we meet on site were wonderful. Very clean!", "title": "Nice place to stay", "user": "amyptkadvisor", "date": "November 5, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 144593209}, {"rating": 3.0, "stay_parameters": "Stayed October 2012, traveled solo", "text": "I decided to stay here the night before a morning flight due to some positive reviews.", "title": "Served my purpose", "user": "Deepslumber", "date": "October 16, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 142999865}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "Well, I was somewhat disappointed. I checked in at about 11 pm and there was another customer trying to get a refund for his internet service. He apparently paid to upgrade to the faster service which wasn’t working. Receptionist didn’t know what to do and told him to talk to the manager in the morning. One minor problem – he was leaving on an early morning flight before the manager came to work.", "title": "no complaints!!", "helpfulness": 1, "user": "tntt", "date": "September 30, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 141680802}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled on business", "text": "I stayed at this hotel in early September for two nights for a weekend business trip. Upon check-in I was upgraded to a suite which was very nice. The hotel staff was very courteous and friendly during my stay and even helped to recommend dinner restaurants in the area. The only down-side to my stay was that the TV remotes didn't work and the room and furnishings just seemed a little dated. The cleanliness seemed ok but it just felt like the room needed a good deep cleaning. There was a also some mold developing in the shower. But, overall, the room was adequate and the A/C was cold and I was able to get a good nights sleep. Breakfast was standard fare for CI&S so no complaints there. Traveling on business for just a night or two, I would stay there again.", "title": "Nice hotel with good customer service", "user": "32Romeo", "date": "September 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 2.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 141314899}, {"rating": 3.0, "stay_parameters": "Stayed September 2012, traveled solo", "text": "I stayed here because I had points to spend. I was using my club carlson points, and they upgraded me to a suite, but I wonder if the regular room wouldn't have been better.", "title": "Great Breakfast, Room Passable", "helpfulness": 1, "user": "David_NY_USA", "date": "September 12, 2012", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 140096908}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled solo", "text": "Carpet was stained, towels were stained, cockroach in my bathroom overnight. TV was good, bed linens were clean and fresh. Bathroom was a bit rugged. Internet worked great.", "title": "Atlanta's Best Keep Secret!", "helpfulness": 1, "user": "Sandria P", "date": "September 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 139997043}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled on business", "text": "Would I stay here again? If I had paid the $77 a night I guess it would have been OK.", "title": "Experience a Real Home away from Home", "helpfulness": 1, "user": "rmckayserve", "date": "September 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 139962568}, {"rating": 3.0, "title": "Safe bet but tired...", "text": "If you ride the bus from the airport, MAKE SURE YOU NOTE THAT THE NAME OF THE HOTEL IS NOT ON THE FRONT OF THE BUS, or you might be waiting a long time.", "user": "randix", "date": "September 6, 2012", "id": 139553707}, {"rating": 3.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "Our overnight stay started badly. We had a long cold wait for the airport shuttle. called the hotel who said it would be along in 30 minutes. In response to my reminder that we had already waited 20 was told that it would be another 10 in that case!! Eventually hitched a ride with one of the shuttles going to a neighbouring hotel. Had a non too friendly reception from check in so started off not being too well disposed to the hotel and my impression did not improve when noted that the towels and bed linen seemed somewhat grey and since the bedlined was very crumpled we had to trust that it had not been slept in previously.", "title": "OK for overnight", "helpfulness": 1, "user": "travguy", "date": "January 10, 2013", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 149328478}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "Breakfast was the usual budget hotel fare - cereal, waffles ad ersatz eggs.", "title": "Wonderful staff, comfortable accommodations and great price!", "helpfulness": 1, "user": "Pat W", "date": "December 23, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 147959941}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "Waited for the shuttle - had been told it was neither necessary nor possible to book. Shuttle arrived a little late but to no avail since there was no room on it. The driver called around and confirmed that no other shuttle could pick us up either and since by then we were becoming concerned that if we waited for the next and a similar situation occurred we were at risk of missing our flight. The shuttle driver told the receptionist to call a cab which she did. This arrived reasonable promptly and was charged to the hotel. The airport was busy and we had about 20 minutes to spare at the gate - so glad we did not risk the next shuttle even though this should have been due 15 minutes after we left. It seems that the shuttle service is some sort of joint arrangement between local hotels so out of the control of individual hotels. Be very careful you allow plenty of time for a flight. We would not risk it again, Shuttle issues apart this is a standard 2 - 3 star establishment with comfortable bed and large rooms and if the price is right could be worth a try", "title": "Took good care of our injured party.", "user": "Duece1623", "date": "December 14, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 147450698}, {"rating": 3.0, "stay_parameters": "Stayed December 2012, traveled on business", "text": "With our son who is in the Navy came home for the holidays. We wanted to see our cousin in Atlanta so looked for a place that could accommodate 3 adults at a reasonable price. Since we were driving from Tampa, the indoor pool and hot tub was a reason we booked. The price was truly affordable. We arrived in the middle of the staff holiday party and scavenger hunt. The hotel manager explained and apologized as staff searched for items on the list. No problem. Check in was fast and easy. The front porch with rocking chairs and warm afternoon sun was pleasant. The suite spacious. Finally a hotel with more than enough outlets on the living room desk. The wet bar, with its high granite bar and mirror was great to do my makeup. The jacuzzi fantastic! Breakfast was average but fine before heading to the Aquarium. It is near the airport. You will hear the planes. But they stop around eleven and it is quiet until around seven. Also the staff was wonderful when our son had a mishap with the waffle batter machine. Fresh cookies a great treat. And the to go bags with fruit thoughtful. Would stay there again.", "title": "Good value for the money, but nothing special", "user": "Skinnywater", "date": "December 7, 2012", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 146932252}, {"rating": 3.0, "stay_parameters": "Stayed November 2012, traveled on business", "text": "Had an injury while in the Carribean, couldn't get a straight flight home. Had to do a layover in ATL. They did what they could to accomadate us and we were very grateful. Close to Airport for an excellent price after an expensive and disappointing trip.", "title": "Nothing special...", "user": "Patricia K", "date": "November 18, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 145672566}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "Our family of 5 was comfortable in our King suite! Overall great experience with all staff!! Room was clean and well kept. This property does seem a bit older, as the refrigerator and microwave are older, but the staff definitely made up for it! It was a comfortable place to stay for a family who had been traveling for 8+ hours. Hotels are not going to be perfect and you can't stay next to the country's busiest airport and not expect to hear the take off's and landings. Breakfast was perfect for our family and had variety which met the various tastes of us all. Overall, would recommend!!", "title": "Great value for family of 5!", "helpfulness": 2, "user": "Ammfamily5", "date": "August 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 137487096}, {"rating": 2.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "Room was very dirty, I have 2 little children, I was not comfortable to let them walk around in the room. Towels were stained, and looked nasty.", "title": "Dirty hotel", "helpfulness": 2, "user": "GSfamilyof4", "date": "August 12, 2012", "detail_rating": {"service": 2.0, "cleanliness": 1.0, "value": 1.0, "sleep": 2.0, "rooms": 1.0, "location": 4.0}, "id": 136990377}, {"rating": 1.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "Pool was great, but people that were there was not. Some people running and screaming all the time.", "title": "YUCKY - Nasty room; horrible food - NOT RECOMMENDED", "helpfulness": 1, "user": "Packrat7", "date": "August 7, 2012", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 3.0, "sleep": 1.0, "rooms": 2.0, "location": 1.0}, "id": 136509398}, {"rating": 1.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "Breakfast was average, shuttle to airport was not on time.", "title": "One of the worst hotels I have ever stayed in!", "user": "mharvey30", "date": "August 1, 2012", "detail_rating": {"cleanliness": 1.0, "sleep": 2.0, "location": 5.0, "service": 4.0, "rooms": 2.0}, "id": 135973115}, {"rating": 4.0, "stay_parameters": "Stayed June 2012", "text": "I'd not recommend it.", "title": "Great value. Close to airport.", "user": "timetotravelboston", "date": "July 7, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 3.0, "service": 3.0, "rooms": 4.0}, "id": 133671166}], "location": {"country": "United States", "city": "Atlanta"}, "stars": 2.5, "variance": {"poor": 10, "average": 16, "very good": 40, "terrible": 5, "excellent": 39}, "aka": "Country Inn & Suites Atlanta-Airport North Hotel", "slim_ranking": 0.515625}