{"user_rating": 4.5, "review_count": 120, "name": "Country Inn & Suites Duluth North", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "We had stayed in a country inn & suites in Lewisbugh and were happy to discover another. The two hotels were alike but this one did not have fresh fruit at breakfast. A good sized room with fridge and two beds. Everything clean and comfy. Breakfast good.", "title": "Slept well", "user": "HMoo", "date": "June 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 165480930}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "Very nice affordable hotel.We walked in the room and it even smelled clean. Turned out the place was spotless, literally! I can't find one bad thing to say about this hotel. Be sure to take Hwy 53 East and see the view of the bay the from top of hill! Location is great if flying into airport, good food across parking lot at Outback. 5 minutes to the mall and shopping and many more restaurants. Nice staff!", "title": "Very Clean Rooms", "helpfulness": 1, "user": "Joe W", "date": "June 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 165254978}, {"rating": 5.0, "stay_parameters": "Stayed May 2013", "text": "We just got back from a long and stressful travel for one night. We had payed in advanced so they checked us in, gave us our key cards, and on our way we went. The location was perfect, the hotel was the nicest flat rate room we've ever stayed in, it was so clean an bright, and the ppl in the elevator were so friendly and seemed to really enjoy themselves. The complimentary breakfast was decent,with all of your choices, and checkout was painless. I recommend this to anyone who has to stay in Duluth for a night or even a family for a weekend stay to enjoy the pool and relax. I would stay here again for sure :)", "title": "Great place to stay after a long trip.", "helpfulness": 1, "user": "lush_82", "date": "May 23, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 161626521}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "Great service and close to all locations to eat and places to visit. Easy to get to and close to the airport too which I did not have to use. Great place for kids. It has a swimming pool and gym. Very clean and friendly folks, Breakfast is included and it is a healthy menu.", "title": "Great place to stay", "helpfulness": 2, "user": "racquetman_MN", "date": "May 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 161265355}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "This was my first time staying here. I would go back in a heartbeat. The rooms are very comfortable and quiet. Never heard anyone else in the building during my entire stay. The check in/out staff wonderful and very friendly. I could not have asked for a better place to stay.", "title": "Out of the Way, but Worth the Stay", "helpfulness": 3, "user": "Soevcgn", "date": "May 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 161101216}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled with family", "text": "We go to Duluth to shop a few times a year. His is by far the best place we have stayed. The suites offer that extra room that is needed. Service was great and the breakfast was first class. I am recommending it to all my friends who travel to Duluth!", "title": "Our Place to stay in Duluth!", "user": "Carol W", "date": "February 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 152667991}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "Once again the reviews for this hotel were completely accurate. The service was exceptional from the front desk. We took advantage of the park and stay and Laura at the front desk managed to get us an early check in upon return. The room was huge, the bed the most comfortable we had ever slept in, a spotlessly clean room and a microwave and fridge. What more can a girl ask for. Oh and the breakfast was amazing as well, a very nice variety of food to enjoy. Beautiful decor! The shuttle to and from the airport had great service with experienced drivers. Thanks girls!", "title": "Wonderful Stay!", "user": "shelleydk64", "date": "February 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 152482483}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled on business", "text": "The only downside was the temperature control for the room.. it was too hot, then too cold, we could not seem to get the right adjustment.", "title": "Not my first stay here, but again OUTSTANDING service!", "user": "David P", "date": "February 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 152278746}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled with family", "text": "Recently had to come to Duluth area on business. I had encountered bad weather and road conditions for my whole drive. I called the front desk from my car and spoke with Brea I advised her I would be arriving a few hours early and asked if I could possibly get an early check in.. She said she would talk to housekeeping to see that a room was ready.", "title": "A perfect stay", "helpfulness": 1, "user": "LovesAVaction", "date": "February 6, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 151564562}, {"rating": 5.0, "stay_parameters": "Stayed January 2013", "text": "Upon my arrival as promised a room was ready...I checked in and proceeded to my room. There was a small problem with my room (not hotel problem just a proximity to elevator) so I went back and ask for a different room if possible... Brea, searched and found me another room.", "title": "Very comfortable stay here.", "user": "Gliere", "date": "January 20, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 150134676}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "Clean, comfortable and friendly - What more can you ask for? I was able to enjoy the fitness center, have a quick breakfast all before work. Easy access to many resturants and shopping. I will deffinetly chose to stay here again for my next trip!", "title": "Clean, comfortable & convienent", "helpfulness": 2, "user": "tlhendry", "date": "May 13, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 160605810}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled with friends", "text": "I have stayed at this hotel many times, whether it be for a visit to Duluth or to stay overnight before I fly out the next day. It is in a great location, one mile away from the airport. Very comfy beds, front desk staff is nice, just a great hotel.", "title": "Great place to stay for a visit to Duluth or use as a park-fly", "helpfulness": 2, "user": "diane s", "date": "May 7, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 159909687}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "Nice clean hotel; very quiet. The rooms were clean and comfortable. Hotel is close to shopping and many restaurants; Outback Steakhouse shares the same parking lot as the hotel. Good selection for breakfast. Will stay here again.", "title": "Nice hotel", "helpfulness": 1, "user": "Northshorelover88", "date": "April 29, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 159125321}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "The Minnesota Area Lutheran Marriage Encounter has been booking weekends at this location for years. We have been involved for only two years but every time we are on the presenting team and stay here we are impressed. The staff is friendly, the breakfast is great, and the rooms are clean and comfortable. We held a weekend recently at the Holiday Inn in Alexandria and experienced a conference room that was not ready for us, cold (and late) food, and a multitude of other issues. We will NOT be returning to that location. Thank you to the entire staff of this fine lodge for another outstanding weekend!", "title": "Lutheran Marriage Encounter LOVES Country Inn & Suites Duluth North", "helpfulness": 1, "user": "LMEsteve", "date": "April 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 157359211}, {"rating": 5.0, "stay_parameters": "Stayed March 2013", "text": "The location is great in regards to the shopping (mall, kohls, target, SAMs etc). There are lots of restaurants around and the complementary breakfast in the morning is great!! The staff are friendly and helpful. The pool is great for the kids. The rooms are spacious and clean. Comfy beds. What more do you need?", "title": "Great place to stay if you are going to Duluth to do some shopping.", "helpfulness": 1, "user": "ibucourtney", "date": "April 8, 2013", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 157111539}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "Four of us stayed here for one night recently on the way home to Ontario from Florida, so we arrived late and left early but all of us thought the hotel was excellent value for the money ($117 total, including taxes). The hotel room was clean and comfortable, but it's the breakfast that all of us appreciated. There is fresh fruit salad and yogurt, a big pot of made-from-scratch oatmeal and fresh make-it-yourself waffles, along with the standard breakfast cereals and bagels. And best of all there isn't a disposable dish in sight (although they are available on request). Very much a 5 star breakfast!", "title": "Excellent value and service", "helpfulness": 1, "user": "writingwoman", "date": "April 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 157069307}, {"rating": 4.0, "title": "Nice getaway", "text": "We stayed here for one night, just to have a springtime getaway. We got a call a day before our check-in to tell us the water slide would be out of order. It was a disappointment, because that's part of why we chose this facility, but we appreciated the notification. Then when we got there, we were pleasantly surprised to find that the waterslide was fixed. The facility was clean, all the staff members we dealt with were very friendly and helpful, and my advance request to have a room in a quiet part of the hotel was honored--we had a peaceful night. The only downside was that the pillows had definitely seen better days, and the mattresses are close to ready for replacement. Other than that, it was a great stay, and the service was excellent. We'll be back again someday.", "helpfulness": 1, "user": "P J", "date": "March 30, 2013", "id": 156100863}, {"rating": 5.0, "stay_parameters": "Stayed February 2013", "text": "I spent a week at this hotel and my stay was absolutely wonderful. I had a one bedroom suite on the third floor. It was very quite and spacious. The room was well lit and furnished nicely. The breakfast was very nice and had hot items that would change every day. The staff at this hotel is some of the best I have seen.", "title": "Had a great stay.", "user": "dugan_11", "date": "March 3, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 153653177}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled on business", "text": "Stayed overnight after flying into Duluth. Really close to the airport and other shops and services. Great hospitality and they make you feel welcome. My room had a microwave and fridge which is really nice.", "title": "Comfortable, homey feel", "user": "travelsalot35", "date": "March 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 153618497}, {"rating": 2.0, "title": "too loud to sleep", "text": "The people next to us spent most of the night making a lot of noise. I complained three times. Each time, the front desk person spoke with them. It did not solve the problem, and I did not sleep. Since it is not a cheap hotel and no discount was offered, I was not happy with the stay. I did complain privately, but the response was that they had done their best. What do other hotels do? Do people have a right to be so loud that others cannot possibly sleep?", "user": "tiredDuluth", "date": "February 25, 2013", "id": 153101810}], "location": {"country": "United States", "city": "Duluth"}, "stars": 2.5, "variance": {"poor": 2, "average": 4, "very good": 45, "terrible": 2, "excellent": 67}, "aka": "Country Inn And Suites Duluth North", "slim_ranking": 0.290322580645}