{"user_rating": 4.0, "review_count": 102, "name": "Country Inn & Suites By Carlson Cincinnati Airport", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "We stayed one night at the Country Inn & Suites in August 2008. We visited the Creation Museum in Petersburg, KY and stayed at this hotel because they offer a museum package. The hotel is only about 7 miles from the museum. The hotel was very nice...clean room and bathroom. The indoor pool was also nice with a hot tub. The hotel provides a hot continental breakfast that includes make-your-own waffles and other hot items. Very clean and modern appearance and the staff was very friendly.", "title": "Nice Stay at Country Inn & Suites", "helpfulness": 3, "user": "tomfromauburn", "date": "August 25, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 19349958, "likes": {"liked": "— Room was large enough to accommodate rollaway bed; hot breakfast was very good."}}, {"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "Once we found the place, it was worth it. The beds were comfortable, the breakfast was delicious and loved the toiletry items (pantene pro-v). We stayed four nights and never had a problem. If I had to point out a problem it would be that the pool area smelled really bad of chlorine, they need a little better ventilation system in there. We stayed there to go to Creation Museum (a must do). We ate at a little restaurant called Mr. Herbs, very delicious and had a to-die-for pecan pie! I would definately stay here again.", "title": "Great stay!", "helpfulness": 2, "user": "jfpTexas", "date": "July 31, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 18461828, "likes": {"liked": "— beds", "disliked": "— chlorine smell in pool area"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "Our group of 5 families stayed at this hotel on our road trip from Florida to the Creation Museum in Petersburg, Kentucky ( A Must See! [--] ) The hotel is apparently very new as all our accomodations reflected that. The front desk staff was extremely efficient and courteous, even upgrading one of our group who did not select a suite in their reservations. All the suites had a sofa bed, small dining table, kitchenette, very large bathroom and a separate bedroom with 2 queen size beds. Very clean, comfortable beds, and the free breakfast was a huge plus!! I would highly recommend this hotel to anyone visiting the Cinicnatti area.", "title": "Excellent Hotel and Staff!", "helpfulness": 2, "user": "Traveling_Family92", "date": "July 16, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 17939652}, {"rating": 4.0, "stay_parameters": "Stayed January 2007", "text": "Due to a missed flight connection caused by Delta they put their passengers up at this hotel.", "title": "Nice little hotel", "helpfulness": 4, "user": "Canuck_Enroute", "date": "January 21, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0}, "id": 6636195}, {"rating": 5.0, "stay_parameters": "Stayed May 2006", "text": "The staff was very supportive of the fact that we were thery unexpectedly and offered deoderant, toothbrushes and other items. The rooms were clean and very well-equipped. (Iron, hair dryer, coffee maker, clock radio w/alarm, loads of towels.)", "title": "So quiet near the airport and complimentary breakfast!!", "helpfulness": 11, "user": "Drene", "date": "May 17, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 5146642}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled on business", "text": "New and clean with good rates. Convenient to airport, freeway, and west side of Cincinnati via the ferry. Friendly and helpful staff. Very good housekeeping. Excellent easy to use wireless internet. Comfy bed. Open electricity outlets near bed and table/desk. Brand name shampoo/lotion. Coffee, refrigerator, and microwave in room. I am a frequent business traveler and I will stay here again.", "title": "Great Choice", "user": "MIRay", "date": "October 21, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 47410252}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled on business", "text": "My only complaint, if you are sensitive to noise, request a room that is not over the pool. We stayed two nights, and both nights there were shrill screeching screaming children in the pool well past 10 pm. Other than that, this is a well-appointed property, for a very reasonable price. However, the last reviewer is correct, there are no nearby restaurants, but it is very close to the airport, maybe five minutes away. Jet noise was never a problem, just the screaming kids in the indoor pool. Breakfast was excellent. The entire property is very clean. I would definitely stay here again. The Creation Museum is about a 15 minute drive away. This is one of the closest lodging facilities to The Creation Museum.", "title": "Near Airport, Great Stay", "helpfulness": 3, "user": "Cruiser100", "date": "June 8, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 31904201}, {"rating": 3.0, "stay_parameters": "Stayed May 2009, traveled solo", "text": "I thought this would be a step above Comfort Inn and such, but it was the same. Not bad but underwhelming. The outside and lobby look promising, but the room was dated and tired. Breakfast was lackluster. The employees were very nice. I liked the free parking, airport shuttle, Internet and location very close to the airport. The only dining option within walking distance is the restaurant at the adjacent Marriott.", "title": "Unremarkable", "helpfulness": 1, "user": "zbenye1", "date": "June 1, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 31315586}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled with family", "text": "If in the area again, I'll probably pick something else which might offer the same level of quality at a lower price.", "title": "Best hotel stay ever!", "helpfulness": 1, "user": "mommy2tendai", "date": "March 22, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 26632347}, {"rating": 5.0, "stay_parameters": "Stayed February 2009, traveled with family", "text": "Our stay at this hotel was absolutely wonderful! The hotel was welcoming, clean, well-maintained and comfortable. The hotel staff were absolutely wonderful. Members of the staff were personable, attentive, professional and efficient. I can honestly say that this hotel is one of the best I've ever stayed at. Also, the pool area is beautiful and the breakfast area was well-stocked (continually throughout breakfast) and had a wide selection of offerings. We stayed for four nights and we will DEFINITELY be returning to this hotel again.", "title": "comfortable place to stay and close to Creation Museum!", "helpfulness": 1, "user": "mrsdoodlepunk", "date": "March 6, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 25692275}], "location": {"country": "United States", "city": "Hebron"}, "stars": 2.5, "variance": {"poor": 7, "average": 14, "very good": 38, "terrible": 1, "excellent": 42}, "aka": "Country Inn And Suites By Carlson Cincinnati Airport", "slim_ranking": 0.4}