{"user_rating": 3.5, "review_count": 53, "name": "Country Inn & Suites By Carlson, Warner Robins", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed November 2006, traveled with family", "text": "We stayed at this hotel as an affordable stop on our way to Orlando. The price was the best we could find in this hotel class along the 75 corridor. The pictures on the website our over-rated as usual. The hotel had just recently switched from a smoking/non-smoking to completely non-smoking hotel and I think we got one of the old smoking rooms because the smell was horrible, but I lived with it because it was just the night. It has an indoor pool, the water was a little murky. The hot tub was not working at the time. The room was clean and decent. The breakfast was sub-par compared to other breakfasts I've seen. The location was good, only a couple miles from 75 and there are lots of dining options and shops right there, not just a truck stop area but an actual community. I would probably stay in the same area, but try a different hotel next time. But for the price, I just might stay there again if I had to.", "title": "It's Okay", "helpfulness": 1, "user": "tpitboy", "date": "February 16, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 2.0, "location": 4.0, "rooms": 2.0}, "id": 6802490, "likes": {"liked": "— dining options", "disliked": "— smell"}}, {"rating": 1.0, "stay_parameters": "Stayed December 2006, traveled with family", "text": "We booked this hotel late at night as we were traveling. I've always wanted to try a Country Inn and Suites, so it seemed like a good choice. The lobby was very nice and the premises was advertised as smoke-free. We got to our first room and the smell was terrible. It smelled like smoke. After calling the front desk, we were given and second room and told that the former guest would be charged for the first room and the room would be thoroughly cleaned. The second room was the same. We told them not to charge anyone, it seemed like a general problem. Even the halls had a weird smell. The third room was worse.... smoke mixed with body odor and sweat! We stayed anyway since at that point we were exhausted. Breakfast was good, but I wouldn't recommend unless them can get a handle on the odor. Every sheet and towel has the same awful smell! UGH!", "title": "Would have been OK, but the smell ruined it all!", "user": "TravelAngel7", "date": "December 28, 2006", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 2.0, "value": 1.0, "rooms": 1.0, "location": 3.0}, "id": 6510890, "likes": {"liked": "— Breakfast", "disliked": "— Smell"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled with family", "text": "This was the perfect place for our family. The hotels nowadays are just having such a commercial look, we were so happy to see the beautiful lobby with the perfect touch of home feeling.", "title": "Perfect place to stay", "user": "Marla.Brown", "date": "September 15, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5802243, "likes": {"liked": "— service and cleanliness"}}, {"rating": 1.0, "stay_parameters": "Stayed July 2006", "text": "The staff were very friendly and seemed to love their jobs. The place was well kept, clean and away from the noise of the main road.", "title": "Disappointment !!!", "helpfulness": 3, "user": "Paradise4171", "date": "July 5, 2006", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "service": 1.0}, "id": 5429733}, {"rating": 2.0, "title": "Adequate, breakfast poor", "text": "We ALWAYS have had great luck at \"Country Inn & Suites\". So, when we needed lodging in this area I naturally chose this chain first. Here's a lesson well learned, never choose lodging late at night (11pm) when you are too tired to care !! This property appears to be an older, tired, worn out building that is poorly kept up !! The first room we were given was dirty, the carpet had a HUGE stain and the bedding had hair and cookie crumbs in it !!! I should have left right then, but again too tired to care !! If I had been travelling with children I would have left. This place is TOO UNCLEAN to take a child into !!! Our second room was minimumally clean. There were only cookie crumbs on the bathroom floor. The entry doors were NOT clean, nor were the elevator doors. Every ceiling had cobwebs and every air duct had great layers of dust. I asked for a tea bag, and was taken into the dining area where a HUGE roach lay right in the middle of the floor. Hey at least he was dead !!! The staff is the most poorly trained staff I have ever encountered !! I asked a few questions of the 3-11 shift, her stock answer was \"I don't know\". I asked a few questions of the 7-3 shift and her absolute stock answer was a resounding \"I don't know\" to every single question I asked. Not even an offer to find out !!! And these were not hard questions, one line of questioning referred to Country Inn and Suites \"Book It\" program. They do not have a business center. They also cannot process a debit card payment. Now there a REAL inconvenience !!!! A major MAJOR dissatisfaction with Country Inn and Suites here !!!!", "helpfulness": 1, "user": "A TripAdvisor user", "date": "February 22, 2006", "id": 4477818}, {"rating": 5.0, "title": "Restful and Homey", "text": "Fairly new, clean, quiet, warm decor. Homelike woodtone lobby decor and setting. Rooms are large and suites are nicely furnished. Fireplace, modest library shelf, and free cookies in lobby. Exercise room with basic equipment. Nice continental breakfast with more choices than most.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "March 21, 2003", "id": 921914}, {"rating": 5.0, "title": "Baby Friendly!", "text": "As a new working mother, I tend to dread what I once loved...business travel. I recently had a meeting in Warner Robins and brought my 8 month old and nanny along as I'm still nursing.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "September 26, 2002", "id": 704945}], "location": {"country": "United States", "city": "Warner Robins"}, "stars": 2.5, "variance": {"poor": 5, "average": 8, "very good": 16, "terrible": 8, "excellent": 16}, "aka": "Country Inn Warner Robins", "slim_ranking": 0.590909090909}