{"user_rating": 4.0, "review_count": 78, "name": "Country Inn & Suites Macon North", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed June 2010, traveled on business", "text": "We stayed at this Country Inn and Suites due to the safe location of the hotel. We also liked the fact that this is a brand new hotel. Check in is at 3 but normally we are allowed to check in a little early. I've never been to a hotel where I was forced to wait to check in AFTER the alloted time....until now. Also, at 8:27am on a Saturday morning, housekeeping came around to every door, knocking wanting to come in and clean. WHAT? Check out isn't even until 12pm!!! Then to top things off, we were told that the continental breakfast was until 10:30am. We went down on our way out to our event at 9:45am and there was NO food except for a few frosted flakes...WHAT? How do you close a breakfast bar that you advertise open until 10:30am? The staff was very nice as was the manager on duty...lots of apologies. I just think there needs to be a little more organization to get the normal things done. The rooms were very clean and new.", "title": "New hotel but staff is disorganized!", "user": "HonestTraveler_7", "date": "June 26, 2010", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 68771348}, {"rating": 3.0, "stay_parameters": "Stayed June 2010, traveled with family", "text": "We stayed here twice, on our way to and from Walt Disney World. The location is great---just off the interstate, with Carrabba's & a steakhouse next door. The front desk staff was very nice. The first night there was no tv remote in our room. In just a few minutes, front desk brought one to us. Any questions I had were immediately answered. We had different rooms on different floors for each trip, so I'll break it down that way:", "title": "Mileage on Your Room May Vary", "user": "whitney37354", "date": "June 25, 2010", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 68651482}, {"rating": 4.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "1. First floor, end unit, at the front of the hotel. This room had two queens with a desk & straight back chair, and one additional chair. Standard room. This room had seen some wear & tear. It looked like someone had either been kicking the bottom of the inside of the door, or running something up against it; very worn. The bathtub had a film on it, so I had to rinse it out before putting our daughter in for her bath. The caulk didn't look professionally done. There was a small tear in the shower curtain. Other than not having the remote, I found no other problems. We were given a choice of three floors that night, and I guess I just chose the wrong floor. I was looking for the easiest way to get in and out and get on the road early the next morning. Less distance to haul luggage.", "title": "Easy stay, a jewel", "user": "Chaucer39", "date": "May 15, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 64221402}, {"rating": 4.0, "stay_parameters": "Stayed April 2010, traveled with family", "text": "2. Second floor, middle of the hall, back of hotel. This room was larger. In addition to two queen beds & desk with chair, there was at least one wingback chair, maybe two. There was plenty of room for our daughter to spread out her toys and play in the floor. The room was clean & in repair, but the caulk in the tub was, again, not a professional job, and it was brown; most likely mold & mildew. We showered and didn't touch it. For one night, it was fine.", "title": "Wonderful Beds, Nice Hotel", "helpfulness": 1, "user": "DeeMomma", "date": "April 12, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 61155158}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled with family", "text": "Being able to walk to Carrabba's for dinner & having a short drive to Cracker Barrell for breakfast was great.", "title": "Great Hotel, friendly staff, we will be back!", "helpfulness": 1, "user": "DebH2007", "date": "April 8, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 60748240}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "Rooms are nice and the hotel is new....so its a great place to stay if you are just traveling thru Macon.", "title": "Very Nice and New Hotel", "user": "pavbama", "date": "March 22, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 59243593}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "On our way to Florida, needed to rest on the south side of Atlanta, found this hotel through Tripadvisor. We used the exercise room, the indoor pool and spa. We enjoyed the breakfest.", "title": "Everything we needed for one night stay", "user": "Eighty8", "date": "February 22, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 56811177}, {"rating": 5.0, "stay_parameters": "Stayed January 2010", "text": "We normally stay at Holiday Inn Express, but after reading the reviews for the one located on Riverside, we decided to try this Country Inn & Suites. Very impressed with the room and service we received. Building is bran-spanking new so the room was immaculate. Large bathroom with brand name toiletries. Beautiful lobby with comfy chairs for reading. They even have books u can borrow and return later. Whole building smells like their fresh baked cookies (they melt in your mouth - best cookies ever). The only negative thing I have to say is skip the waffles for breakfast - better yet, skip the whole breakfast unless you like toast and cereal. Eggs were cold, milk was warm, and saus biscuit was microwaveable, but the breakfast room was kept clean. Overall I would still rate this a 5 out of 5. A clean room and comfy bed are more important than breakfast. I would definately recommend this hotel!", "title": "Super clean - new facility", "user": "Maxeslady", "date": "February 19, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 56470497}, {"rating": 3.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "Great for us to basically just check-in, sleep, eat breakfast and be back on the road from TN to Ft Lauderdale for a cruise. You can tell the property is new and pretty easy to find. Check-in was quick and they still had lots of cookies even late in the evening.", "title": "Good hotel when traveling I-75", "user": "snwarf01", "date": "January 9, 2010", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 4.0, "service": 3.0, "rooms": 3.0}, "id": 53033052}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled on business", "text": "Room was clean, but bare-bones (not that we expected anything else). It was quiet and I slept well. Breakfast was pretty good but they have a VERY chatty hostess. She was very friendly, but if you aren't up for hearing someone's life story before you've had coffee...well, you've been warned! :) She makes the waffles for you, but in hindsight seeing her cough, clean, etc. I wouldn't have eaten it (not that she touched it that I recall with her bare hands). Every time you needed someone at the front desk (check-in, check-out) they were outside on smoke brake. They always came in quickly, but it would get old if you stayed there for any length.", "title": "Great value in a new hotel!", "user": "Cotonmom", "date": "October 8, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 46215396}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "We stayed at Country Inn & Suites because of a coupon they offered in one of the travel discount magazines offered at the rest parks. The walk in rate was only $58. It's ridiculous to pay much more when checking in late and night and leaving to hit the road again early i the morning.", "title": "Great value", "user": "aunry79", "date": "July 27, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115874933}, {"rating": 3.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "The front desk staff was very welcoming and even had fresh, warm cookies baked and available to guests upon check in. The room was very large with new furniture, a flat screen tv and a refrigerator and microwave. The beds were very comfortable and offered several pillows.", "title": "Could've Been A Lot Better", "helpfulness": 1, "user": "1SouthernBoy", "date": "June 18, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 2.0, "value": 2.0, "service": 3.0}, "id": 114213282}, {"rating": 3.0, "stay_parameters": "Stayed May 2011", "text": "The morning breakfast was ok. Nothing spectacular, but decent - the typical free hotel breakfast.", "title": "Older but clean", "user": "travel24x7", "date": "May 28, 2011", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 3.0}, "id": 110298906}, {"rating": 2.0, "stay_parameters": "Stayed March 2011, traveled with family", "text": "This was a little out of our way, but well worth it for the price compared to other hotels in the area.", "title": "I would not go back again", "helpfulness": 1, "user": "KurlyQ", "date": "April 1, 2011", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 2.0, "sleep": 1.0, "rooms": 5.0, "location": 1.0}, "id": 102460632}, {"rating": 3.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "My family of four stopped off here for a night when we were on our way to South Carolina. The first thing I noticed when we checked in were the little bags of ear plugs on the dresser. Immediately, I realized there was a railroad nearby. I never heard a train, but at 2:30 am the fire alarm went off, so the earplugs came in handy. There was not a fire, and the hotel manager said that an alarm had not been pulled; they had no idea why the alarm was activated. Nice!", "title": "Just an average hotel, with average customer service!", "user": "aspertame", "date": "March 28, 2011", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 3.0}, "id": 101942716}, {"rating": 4.0, "stay_parameters": "Stayed March 2011", "text": "This is a new hotel. We were on a stop over on the way to Florida. It was a great place to spend the night. Good location with places to eat nearby. We would have stayed here again on the way back but they were full.", "title": "Another great place to stay.", "user": "bbmom4life", "date": "March 17, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 100550846}, {"rating": 4.0, "title": "Nice Hotel", "text": "Stayed during our recent trip to Florida based on reviews. The hotel was very clean, our number one criteria, the elevator, hallways, pool area, workout room, eating area were all clean, no garbage laying around. Our room was also very clean and the bed was comfortable. We didn't notice any train noise as one of the previous reviews mentioned,but when we entered our room there was a package of ear plugs on the bed which makes me think the hotel is aware of a noise problem. The heating/air conditioning unit worked great which is always a plus and the TV is a flat screen with good reception. The internet was strong and we experienced no problems with logging on. Breakfast was your typical hotel breakfast nothing fancy but adequate and the dining room was very clean. The only downside is the hotel was somewhat hard to find as it's about two miles off exit 171 as are the other hotels in the area. I'm guessing there's no exit ramp where the hotels are located but I did notice a entrance ramp to the interstate, Also one of the lights next to the bed had a broken switch which didn't work (actually missing) something I would think the cleaning staff would be aware of and report to mainetance. The new flat screen TV's are great but what would it take to update the channel listing in the room so one doesn't have to flip through the entire channels to find a station although men are used to this. Overall we would definitely stay again as clean hotels are somewhat hard ot find and this one meets that criteria.", "user": "DSchmidtNekoosa_Wi", "date": "March 17, 2011", "id": 100482058}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "This hotel is new,staff is so friendly, rooms and beds are comfortable. Would stay here again. This was a stopover on the way to Florida on the way down and the way back.", "title": "Nice New Clean Hotel-Great Staff!", "user": "GWN61", "date": "February 21, 2011", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 97443916}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "We stopped here on the way to Florida. It was the second Country Inn and Suites we stayed at along the way (the other in Bowling Green KY). We were checked in by LaQuina who was very helpful and personable. They were out of cookies but that was OK. When we got to our room there were earplugs on each bed which was the tip off it could be noisy. There was a train outside but it really wasn't that loud. Breakfast was very good and came with the room.", "title": "Nice place for overnight stay", "user": "Klink1000", "date": "February 1, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 95237754}, {"rating": 1.0, "stay_parameters": "Stayed August 2010, traveled on business", "text": "I have stayed a few times at this hotel in the past. The first stay was good with the exception of being woken what seemed to be hourly by a train on the railway line behind the hotel. After that I requested a quiet room and was placed in a room at the front of the hotel where there was no noise.", "title": "bugs and trains", "helpfulness": 1, "user": "Frequent_Traveler_JP", "date": "August 21, 2010", "detail_rating": {"cleanliness": 1.0, "rooms": 1.0}, "id": 76179330}], "location": {"country": "United States", "city": "Macon"}, "stars": 2.5, "variance": {"poor": 7, "average": 11, "very good": 21, "terrible": 4, "excellent": 35}, "aka": "Country Inn & Suites Macon North Hotel Macon", "slim_ranking": 0.307692307692}