{"user_rating": 4.5, "review_count": 2758, "name": "Couples Negril", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed November 2013, traveled as a couple", "text": "This was our 9th stay at a couples resort, the 7th time here. We have not been to couples in a few years, as we have found other places we prefer on the island.", "title": "Beautiful grounds, but a plastic experience.", "helpfulness": 7, "user": "Hussyband", "date": "December 2, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 186570433}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled as a couple", "text": "The resort as a whole is beautiful. The grounds are simply amazing. Not a night went by that I was not in awe over what I referred to as the Jurassic Park plantings. The grounds staff and maintenance staff are to be commended for their effort.", "title": "Another week in paradise", "helpfulness": 3, "user": "PhilipSDTraveler", "date": "November 30, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 186349096}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled as a couple", "text": "Rooms: the layout of the resort is two U shaped groupings of rooms. The buildings themselves are very much like a typical stateside motel in terms of functional layout. Some of the buildings are undergoing complete renovation, and from what has been completed, they will be nice when all are done. Even the older rooms are still well maintained however. This trip, I chose a garden room, and rather enjoyed the location (building four) having always chosen a suite or \"ocean view\" room in the past. I have to say though... From actual experience in the rooms, there is minimal difference in an ocean vs. garden room for view. The garden view rooms are slightly superior to my mindset, simply for the beauty of that side of the resort.", "title": "Continue to Return", "helpfulness": 5, "user": "Richard B", "date": "November 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 186256725}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled as a couple", "text": "Food: very hit or miss. I had some quite good dinners, and some pretty awful meals while there. Lychee seemed to be pretty consistent, but their menu does not change as far as I saw. I ate their on lobster night, and while the rest of the food was good, the lobster was not fresh, and was tragically overlooked. Hellaconia was generally good. Cassava terrace dinners were simply not good on any of the evenings we ate there. The repeaters dinner was, as usual very good. Breakfast is hard to mess up, and generally I was pleased with the results. It would be nice to see more Jamaican offerings at breakfast, but I understand those might not go over well with everyone. The few times I did see Jamaican offerings at breakfast, they were not bad. Desserts have never been my favorite at couples, but this year, there were some definite standouts in the crowd. I had one surprise when a tray of cheesecakes was marked as \"chilly cheesecake\", but was in fact chili cheesecake... Not my favorite, nor what I was expecting! Service at all of the restaurants was quite good... Not the typical \"Jamaican time\" you often hear about. One night was funny -- at hellaconia, I did not eat my meal one evening. I was not feeling the best that night, and most likely should have skipped dinner. The server gave me such a look I felt like a recalcitrant child who did not eat their vegetables (this is not a disparagement of her, simply an amusing side note) when I left food on my plate and did not want her to take it back to the chef.", "title": "Our wedding & honeymoon @ Couples Negril", "helpfulness": 2, "user": "Juliejustmarried", "date": "November 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 186153145}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "As many meals are served open air, the presence of birds, bugs etc is to be expected. Honestly, the birds were a source of entertainment in their own right, stealing a fry from a plate that was not closely watched. To see an entire dessert table literally crawling with wasps/bees (not sure which they were) was more than a bit off putting however. The staff covered the morning pastries / desserts with plastic wrap in an attempt to keep them out, often this resulted in them being kept in, and in many cases in large numbers. I do not remember this from past trips, possibly it is simply a bad year for them.", "title": "COUPLES NEGRIL JAMACIA", "helpfulness": 3, "user": "Debbie21360", "date": "November 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 186095540}, {"rating": 4.0, "stay_parameters": "Stayed November 2013, traveled as a couple", "text": "We were at Couples 11/9-16/13. The staff was great and made you feel welcome. While things move at a slower pace, that's what we needed to get away from it all. It is not the most modern deluxe resort, but the rooms are clean, the food and drink plentiful, the beach and the water is beautiful. The dive program is outstanding. It rained a few times in the evening, which I hear is to be expected at this time of the year, but the rains happened in the late afternoon and were over in time for you to enjoy the golden sunsets. The mornings are amazing! Get up early, stake out your spot on the beach and enjoy. This is a low-key resort, which is what we were looking for. Other resorts blast loud music and announcements, which Couples thankfully did not.", "title": "We had a wonderful time!", "helpfulness": 1, "user": "Poodlepook", "date": "November 17, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 185002836}, {"rating": 4.0, "stay_parameters": "Stayed November 2013, traveled as a couple", "text": "We stayed at Couples Negril from Nov 4th - 8th 2013. I will start from the beginning:", "title": "We had a great time!!", "helpfulness": 4, "user": "Stacy C", "date": "November 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 184872530}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled as a couple", "text": "Airport/Transfer: The Couples \"lounge\" at the airport is OK, but nothing to rave about. They serve Red Stripe beer and soda, and they have a restroom to use while you wait for your transfer. We waited about 20 minutes. The ride from the airport is about an hour and 20 minutes. We stopped for drinks once along the way at a local bar. Be prepared, these are not free drinks. The trip was not bad at all, with lots to look at and hear about along the way.", "title": "Can't Wait to Return!", "helpfulness": 10, "user": "Tim S", "date": "November 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 184786326}, {"rating": 4.0, "stay_parameters": "Stayed November 2013, traveled as a couple", "text": "Check-In/Rooms: Once at the resort, check-in went pretty smoothly. Our room was not ready (at 5 pm) so they immediately upgraded us to a deluxe beachfront room in building 6. We ended up switching rooms the next day because we were right next to the main lobby/restaurant and that is also where they have entertainment each night. If you prefer a quieter room, stay further away from the lobby area. Trust me, it is loud! We switched to building 9, which was much quieter.", "title": "Total Relaxation", "helpfulness": 3, "user": "Mona B", "date": "November 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 184645881}, {"rating": 4.0, "stay_parameters": "Stayed November 2013, traveled as a couple", "text": "In my opinion the rooms are fine. Nothing fancy but clean, spacious enough, and the air conditioning worked really well. The bathrooms on the other hand are in desperate need of upgrading. I know they are in the process of doing so, and I hope they do this quickly so they are upgraded when we return! Speaking of returning, it seemed most people we met had been to Couples before. I think that speaks volumes!", "title": "The Diaries Of An Overseas Newbie", "helpfulness": 2, "user": "Cameon S", "date": "November 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 4.0}, "id": 184487001}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "Unfortunately I sprained my ankle really bad on the first night there. The next day several staff members asked my friends how I was doing. I spent the rest of my trip in a wheel chair & nearly every staff member that came past me checked to make sure I was ok. This was our second time there & I'm sure we'll return.", "title": "The Staff Are Awesome", "helpfulness": 1, "user": "fleurdelady", "date": "June 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 131928750}, {"rating": 3.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "My husband and I traveled to Couples Negril in October 2011. I have tried to group our experience below.", "title": "Amazing Staff Disappointing Food", "helpfulness": 5, "user": "qtypie617", "date": "June 12, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 131867580}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "Airport Transfer", "title": "Wonderful honeymoon at Couples Negril", "helpfulness": 2, "user": "destinytravels", "date": "June 11, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 131771057}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "This process was so quick from the time we got to the lounge at the airport we were moved to a bus and off we went. We had just enough time to use the restroom and down 2 Red Stripes. This was the smoothest transition and experience related to transfers, ever.", "title": "Couples vs Sandals", "helpfulness": 14, "user": "bronwynLondon", "date": "June 11, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 131747655}, {"rating": 3.0, "stay_parameters": "Stayed June 2012", "text": "Couples Grounds", "title": "Not luxury but very comfortable", "helpfulness": 6, "user": "Kylesmic", "date": "June 8, 2012", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 3.0, "service": 5.0, "rooms": 3.0}, "id": 131551774}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "My husband and I vacationed at Couples Negril from 6/1-6/6 to attend a wedding. Here are the details...", "title": "Can't wait to return!!", "helpfulness": 9, "user": "Jen4637", "date": "June 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 131551166}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "Arrival: After about a 1.5hr drive to CN we were warmly greeted with chilled towels and champagne. Perfect after a long day of traveling! Check in was a breeze and despite our early check in of 1pm our room was ready.", "title": "My favorite place", "helpfulness": 1, "user": "Alock115", "date": "June 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 131490748}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "Room: We opted for a Deluxe Garden. It was clean, comfortable and roomy. You are provided a large amount of shampoo/conditioner, body wash and body lotion(pump dispensers) so no need to bring those if you don't want. A/C was nice, one word of caution though. One day we left it on after turning it down to 18degrees and came back to some condensation on the table and floor below so be careful. Usually it was more than enough to leave the fan on overhead and the room was chilled nicely. Housekeeping was a hit or miss on the times they came by but always thorough in cleaning and restocking towels. We utilized the room safe everyday, electronic and easy to use. The bed was very comfy and in between hard & soft. We were in building 4 which is near the tennis courts and nurse station. It was not far from everything but we'd probably ask to stay in building 7 next time after seeing our friends' room and the location of it to the pool & beach.", "title": "Wonderful Vacation", "helpfulness": 14, "user": "kentuckygirl88", "date": "June 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 131433434}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "Food: Delicious!! Every place we went had great food choices and we never left hungry. Cassava Terrace has a nice breakfast buffet, omelette station and fresh coconut juice & smoothie bar. It seemed every other night they did a dinner buffet or a la carte dining. Beach Grill & Heliconia were delicious as well. Never had a chance to eat at Lychee or Otaheite. Get the snapper sandwich or jerk chicken at the Beach Grill, so yummy!! I can't get over how good the food was at CN, you will love it! And it's not all \"vacation food\", there are plenty of healthy options too. Drinks that we ordered and loved were the rum punch, BBC, mojitos, bloody mary's and monkey brain shot.", "title": "A vacation fit for Royalty", "helpfulness": 11, "user": "Leshadanadventure", "date": "June 5, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 131370811}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "Beach: Wow, absolutely pristine beach. Soft, white sand and crystal clear teal waters. One day I walked north of CN and found the other resorts didn't clean and rake the beach as well as CN does. We never had an issue finding a beach chair and there are plenty of areas with shade. WiFi also on the beach. I loved floating for hours during the day. The water is definitely more calm in the morning/early afternoon hours. A simple \"no thank you\" was all you needed for vendors. Definitely don't say \"maybe later\" unless you mean it because they will ask you when. I loved the guitar guy who serenades everyone and the guy selling cigarettes, I miss hearing them both! Red flag service was awesome, never waited longer than 10 minutes for a drink. There's even a beverage hut with fountain sodas and liquor for your convenience.", "title": "Couples,Negril is the ultimate package for first-time couples!!", "helpfulness": 5, "user": "ForsterHelen", "date": "June 4, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 131270897}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled as a couple", "text": "My husband and I recently returned from our third visit to Couples Negril. As always, we had a fantastic time! Special thanks to our travel agent, Mitch Toren at Trip Guy, who made sure everything went perfectly! He's the greatest. He even managed to arrange a special dinner for us at Otaheite complete with the staff singing Happy Birthday to us and presenting us with a delicious birthday cake! Thanks again, Mitch!", "title": "Another week in paradise!", "helpfulness": 1, "user": "Susan C", "date": "November 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 185801987}, {"rating": 3.0, "stay_parameters": "Stayed November 2013, traveled as a couple", "text": "PROS- This resort has the most beautiful beach we've ever found in the Caribbean. The staff keeps it groomed to perfection. The water is crystal clear and absolutely gorgeous. One of the reasons we keep coming back is the calm waters of Bloody Bay. The floats provided by the resort make for many hours floating in that gorgeous, calm water!", "title": "Water was fine", "user": "papagush", "date": "November 24, 2013", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 185738488}, {"rating": 3.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "- The decor at the resort is just what we're looking for - it's not fancy but it's the perfect beach resort. Everything is laid back and relaxing. The housekeeping staff is wonderful.", "title": "couples negril", "helpfulness": 2, "user": "lori c", "date": "November 23, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 2.0}, "id": 185635722}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled as a couple", "text": "- The size of the resort is ideal. Everything is close by and can be reached within a 5 minute walk.", "title": "Great Honeymoon and resort!", "helpfulness": 4, "user": "Marco P", "date": "November 22, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 185534938}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "- The staff is amazing. They always greet you with a smile and make you feel that you truly are \"family\". Special thanks to Elkie, Ivylyn, Camille, Tanya, Stacey, and the great crew on the glass-bottom boat! What a fun time!", "title": "Had a wonderful time!", "helpfulness": 1, "user": "K S", "date": "November 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 185082208}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "We've stayed at 10 of the all-inclusive resorts on the island and rate Couples Negril our third favorite. While the rooms are a bit tired and the facilities could use some modernization...the resort is one of our favorites on the island. The Couples brand delivers outstanding value at their resorts. Food is good and varied so there's something for everyone at every meal. Entertainment is ok and pretty much on average for the nice resorts on the island....but that's not what this resort is really all about. Relaxing Index ....a 9. Brind your good reads, loose clothing, sunscreen and kick back and forget about the rest of the world for a week.", "title": "Tired rooms but great resort", "helpfulness": 2, "user": "werseabee", "date": "November 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 4.0}, "id": 185995470}, {"rating": 4.0, "stay_parameters": "Stayed November 2013, traveled as a couple", "text": "We returned to Couples Negril 11/16-11/23 for our 5th trip and brought two other couples with us to share in the love we have for Jamaica and CN.", "title": "Almost perfect", "helpfulness": 4, "user": "cleversole", "date": "November 26, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 185987624}, {"rating": 4.0, "stay_parameters": "Stayed November 2013, traveled as a couple", "text": "The airport wasn't bad and we were through immigration in about 20 minutes and then off to the Couples Lounge. There seemed to be more people arriving at the same time than we have seen before but they had it under control and within about 10 minutes, we were off. Vincent was our driver and was probably one of the quietest we have ever had. I had asked for some information and he gave it for a while but then it kind of died off. I really enjoy hearing the drivers talk as I learn something new every time.", "title": "Very good resort and worth another visit", "helpfulness": 1, "user": "steve m", "date": "November 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 185900519}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "We got to the resort and they had our romance rewards gifts ready, and it was correct. We had asked for third floor and got building 4, 4303, third floor as requested. We have always been on the other side of the resort but really liked the view from this room, and it was near the tennis courts and we love to play, so it was convenient. The room was ready, clean, just as nice as we have always found the rooms. Housekeeping kept it clean during the day, and the evening turn down is always a nice touch. People complain about road noise in the buildings but we have been in 8, which many people complain about and I know they do in four as well, but we simply didn't notice it or didn't perceive it to be a problem. It certainly never kept us awake at night. After all the food, drinks and playing tennis, we were lucky to even catch any evening shows for very long before we hit those beds, which are some of the most comfortable I've ever slept on.", "title": "Late Review but worth a thumbs up", "helpfulness": 5, "user": "hwtj", "date": "November 25, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 185895876}, {"rating": 4.0, "title": "Relaxing", "text": "The food was as good as always. I like the buffets because of the variety of foods and the awesome desserts. Sometimes in the past the food wasn't always hot, but that was absolutely not an issue this time. The food was hot and fresh and the choices were great. I am kind of picky and never had trouble finding food. Otaheite had some great snapper, and we had good dinners in Heliconia and Casava as well.", "helpfulness": 1, "user": "Kim C", "date": "November 25, 2013", "id": 185888163}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "We have been to a few all inclusive resorts in Jamaica, DR, Riviera Maya, Turks & Caicos, Aruba and this might just be the best one. (see my other reviews)", "title": "Enjoyed Ourselves", "helpfulness": 17, "user": "steph44w", "date": "June 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 132467606}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "The ride from the airport isn't that bad. Our driver didn't say much. When we got to the resort we were greeted w/ champagne and a cold washcloth. Surprisingly our room was ready even though we got to the resort early in the morning. The bellhop took out bags and showed us our room and how everything worked. We got a garden view room on the 2nd fl of building 2 (2210). I knew to not expect a shiny new, granite, marble type place so the room was comfortable and fine. The view from the balcony was lush foliage. The bathroom window was a bit weird that it had shutters and no screen. Maid service left extra towels and the turn down service each night made towel art.", "title": "Jamaica fun in the sun", "helpfulness": 3, "user": "Littleeagle22", "date": "June 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 132466159}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "The food was good. Probably better than any other all inclusive I've been to. We ate at all the restaurants at least once. We tried the snapper sandwich, jerk chicken, beef patties, beef tenderlion, pad thai, fresh fruit smoothies at breakfast, made to order omelets, waffles, pancakes (they had whole wheat and egg whites too) bob marley shots, the coffee is excellent- all the stuff I had heard about. Only meal I didn't care for was the ravioli at Heliconia, but hey I'm from NY and we were in Jamaica.", "title": "3rd Time is the Charm", "helpfulness": 2, "user": "DoreneBrooklyn", "date": "June 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 132460194}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "The beach was one of the best I've been to and I've been to a bunch in the Caribbean. It was right up there with Turks and Caicos. Calm, clear, not deep, warm, perfect. Never had a problem getting a chair under a tree for shade. There isn't too much shade by the pool, but with a beach like that we didn't get to the pool until the 4th day and my husband is a pool guy. Nice to take the floats into the ocean. The red flag service was fine. The pool bar and the self service station on the beach is a 1 minute walk if you can't wait. The last day they served fruit skewers and cold wash cloths. Not sure where those were the rest of the week.", "title": "A Relaxing, Sexy, Unique Jamaican Experience", "helpfulness": 10, "user": "Beachlover420", "date": "June 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 132446417}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "Staff and service were excellent.", "title": "Great Getaway", "helpfulness": 5, "user": "Wanderlust_FW", "date": "June 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 132380713}, {"rating": 5.0, "stay_parameters": "Stayed February 2006, traveled as a couple", "text": "Our week spent at the Couples Resort was one to remember. When we arrived at the airport, we were greeted at the lounge with a red stripe and a smile….only to find out that they had no record of our reservations!!!! Expedia messed up big---but that is another story for another day.", "title": "An amazing resort, amazing people.", "helpfulness": 33, "user": "rjlovestotravel", "date": "October 20, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 5975201, "likes": {"liked": "— Location, the service, the clientele (everyone looked like a model here), the food, the....too many to name.", "disliked": "— The room that we received was a tad on the misty side (but we were hardly in there)"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "+++: Quick bus ride", "title": "Fantastic Vacation", "helpfulness": 36, "user": "lexuswoman", "date": "October 13, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 5950904, "likes": {"liked": "— Resort was not crowded.", "disliked": "— Relax and have fun."}}, {"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "We took the bus ride to the resort---a must if you want to see some of the locals as well as some of the sites. The ride, although fast, was not as scary as previously mentioned. Guess it depends on the driver that you get. But we definitely arrived quickly.", "title": "Just a few comments", "helpfulness": 23, "user": "cplre", "date": "October 12, 2006", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 2.0, "rooms": 3.0}, "id": 5945805, "likes": {"liked": "— close to the beach", "disliked": "— no nightlife"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "+++: Greeted with warm towel and champagne.", "title": "Back to Jamaica after 23 years", "helpfulness": 47, "user": "tbber", "date": "October 7, 2006", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 3.0}, "id": 5924778, "likes": {"liked": "— Very good all inclusive", "disliked": "— Rain everyday in the afternoon...sometimes 5 hours worth"}}, {"rating": 2.0, "stay_parameters": "Stayed September 2006, traveled with friends", "text": "Since Expedia screwed up our reservations, we found out that the resort overbooked their suites. That sucked because we did reserve one. Instead they put us up for one night in a garden view room with a promise to move us to an oceanview once one became available. They also gave me a check for the difference of the price of the room. This is unheard of to me because they are not the ones who screwed up. I was very grateful", "title": "Cheesy and unaccomodating", "helpfulness": 7, "user": "energie028", "date": "October 4, 2006", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "location": 4.0, "service": 1.0, "rooms": 3.0}, "id": 5909887, "likes": {"liked": "— location on beach", "disliked": "— staff"}}, {"rating": 5.0, "title": "As Jimmy Buffett would sing, \"I wished Lunch could last forever\"!", "text": "September 3, 2006", "helpfulness": 52, "user": "A TripAdvisor user", "date": "September 3, 2006", "id": 5765830}, {"rating": 5.0, "stay_parameters": "Stayed September 2005, traveled as a couple", "text": "Florence, South Carolina", "title": "Loved it, loved it, loved it!!!", "helpfulness": 59, "user": "akley23", "date": "August 17, 2006", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 5619810, "likes": {"liked": "— atmoshere", "disliked": "— leaving"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "My husband and I went to Couples Negril for our 25th wedding anniversary the week of August 15-22nd. All I can say is that it was wonderful. It was so beautiful and relaxing. The hotel was nice and clean. The staff was very friendly and helpful.", "title": "Taste of Paradise!!", "helpfulness": 43, "user": "Love2Chill", "date": "August 16, 2006", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 5618141, "likes": {"liked": "— Everything", "disliked": "— Everything was great"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "The ride from the airport was not bad. The bus was clean and and airconditioned. We stopped about 1/2 way to a break to get something to drink. When we got to the resort, we were greeted by staff and received a glass of champagne and a cool washcloth. We were then escorted to our room which had a nice view. We had a garden view room. We quickly got into our bathing suits and headed for the pool. That's were we met Franklin, the best bartender there. I had my first of many hummingbird drinks. Boy, I sure wish that my favorite bartender here in the States could make a hummingbird drink.", "title": "Beautiful, relaxing and romantic", "helpfulness": 61, "user": "ashtonian", "date": "August 15, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 5615645, "likes": {"liked": "— The sevice and the overall atmosphere", "disliked": "— The water pressure failure on two occassions"}}, {"rating": 4.0, "title": "CN will give you the Honeymoon of Your Life", "text": "The beach was awesome. It was so beautiful. The staff at Couples raked the beach sand each day. The best part about being on the beach, along with the clear water and white sand was the red flag service. You didn't even have to get out of your chair to get a drink. All you had to do was put your red flag in the sand and they would come and take your drink order. Talk about service.", "helpfulness": 40, "user": "caycam", "date": "August 15, 2006", "id": 5614547}, {"rating": 5.0, "title": "Simply fabulous!", "text": "We stayed at Couples Negril for 2 weeks in June, in a Deluxe Garden Room.", "helpfulness": 63, "user": "Tisme", "date": "August 13, 2006", "id": 5605720}, {"rating": 4.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "Positives:", "title": "Good AI for Jamaica and for the price!", "helpfulness": 45, "user": "smittygirl1966", "date": "August 8, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 2.0, "location": 5.0}, "id": 5580024, "likes": {"liked": "— Didn't like the accomodation - rustic, basic and no minibar", "disliked": "— very clean, consistent maid service"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "Room – very clean with very comfortable 6ft bed. Air conditioning worked really well. TV had about 30 channels (mainly US ones). Plenty of towels and toiletries left by the maids daily. Iced water and tea/coffee topped up each day by maids. View from balcony was lovely. Small but secure safe in room.", "title": "A great place for relaxation", "helpfulness": 31, "user": "Rainy049", "date": "August 7, 2006", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 3.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 5574311, "likes": {"liked": "— The resort is just beautiful.", "disliked": "— Go - have fun and RELAX !"}}, {"rating": 2.0, "stay_parameters": "Stayed February 2006, traveled as a couple", "text": "Dining – plenty of places to eat, although we mainly used the Cassava Terrace. Food in the buffets was always hot, never lukewarm, and delicious. Plenty of variety each day. A la Carte evenings were always delicious, with enough choice to ensure we never ate the same thing twice in the 2 weeks we were there. I have a dietary allergy, and the chefs were fabulous at ensuring I always had a wonderful meal each night (thank you Morice!).", "title": "Enjoy it But Beware", "helpfulness": 20, "user": "digiguy", "date": "August 4, 2006", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 1.0, "cleanliness": 2.0, "value": 3.0, "location": 4.0, "rooms": 2.0}, "id": 5560380, "likes": {"liked": "— beach and water.", "disliked": "— food"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "Beach – swept clean and raked over each morning, always plenty of sun-loungers to choose from & plenty of shade to lie in. The drinks bar on the beach always had enough cold drinks to see us through the day & each morning a staff member would bring around small but delicious ‘fruit kebabs’ to all the sunbathers. The red flag service appeared to work well (although we never used it ourselves). The sea was calm, clear and warm each day. Very quiet and relaxing.", "title": "Excellent Couples Experience - Would go again in a heartbeat!", "helpfulness": 26, "user": "jaymi", "date": "August 4, 2006", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 5560099, "likes": {"liked": "— great service", "disliked": "— afternoon showers"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "Just returned a few days ago from Couples Negril. From the time we landed at the airport to the time we were dropped of we were treated great. We were greated at the airport at the couples room. They took our luggage while we had a restroom break and grabbed a red stripe and then straight to the shuttle bus we went. The ride to couples was long (but maybe only seemed that way since I was anxious to get there). We were greated with champagne and a cold towel and directed to our room. We stayed in beach front room. I have read several reviews stating that it was not worth the upgrade b/c there was no real view of the ocean. I completely disagree. We were in room 6203 and had a GREAT view of the ocean. The food was pretty good. Breakfast was the same every morning but had a good variety. There were 2 options for lunch....one was lunch buffet (varied from day to day), the other option was made to order burgers, wraps fries....that sorta thing. The dining at night was very good. The restaurant that requred reservations was AMAZING. The samon there was so very good. I could have eaten there every night (we did twice). We did the catamaran cruise...it was good. The snorkeling was also good.", "title": "Nice Get Away", "helpfulness": 10, "user": "krystal b", "date": "June 19, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 132337463}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "So, after reading all of the post regarding Couples vs Sandles Negril we selected Couples Negril; without we regret we had an awesome time! I'd like to know how sandles can be any better than couples but doubt that we'll ever find out as there is no way we'd take a chance on being dissapointed. I happen to work for one the most creditable & reputable hotels chains in the hospitality industry so I'm very selective and picky about my accommodations moreover, SERVICE! Although,I must be honest and say that I was slightly dissapointed that we paid for an \"ocean view\" and received a swamp view. Nevertheless, it still worked out bc we actually didn't return to the room until after midnight anyway. If you're social and active at the resort I'm not so sure that any particular view matters so save your $$ and go for the Garden View if available or perhaps the \"Beachfronts\" on the 1st floor. Otherwise, the food, cocktails & activities were great EVERYday and the service was outstanding, we will definitly return!", "title": "Couples Negril", "helpfulness": 5, "user": "Nikki W", "date": "June 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 132319111}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "Couldn’t have had a better time at Couple Negril from 5/31-6/6", "title": "Had an absolutely amazing honeymoon!!", "helpfulness": 4, "user": "Hmaclauchlan", "date": "June 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 132163515}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "We did a lot of research for honeymoon all inclusive resorts and finally settled on this one after reading reviews and talking to a relative that is a travel agent. We were not disappointed! However, if you are a snobby traveler that expects marble facades and 1000 thread count sheets, like many of the negative reviews on here, you will probably be a bit disappointed that you’re not staying in the lap of luxury. We found that if you just enjoyed the service, activities, no children and beautiful beaches, you’ll love everything about Couples Negril! You also need to remember, you’re not in the US or a major city in Europe, you’re in Jamaica, so have realistic expectations!", "title": "Elbow Room", "helpfulness": 7, "user": "Wayne H", "date": "June 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 132154117}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "For starters, we had NO PROBLEM booking our flight and hotel through Allinclusiveoutlet.com. It was an incredibly easy process, our booking agent contacted me on several occasions and made us feel confident that our trip was going to be worry free. Our flight in was great, though if you don’t have children or the patience for them, I would recommend avoiding a layover in Orlando. Once we got to Montego Bay, we were greeted promptly by two gentlemen that took our bags and assured us that they would be on the shuttle bus with us. We were able to enjoy a few Red Stripes in the lounge and use their WiFi to let people back home know that we’d made it. Our shuttle arrived promptly, our bags were loaded and we were on our way to the Resort.", "title": "Most Relaxing week ever", "helpfulness": 9, "user": "Kurt M", "date": "June 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 132044655}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "My husband and I have been to numerous Club Med and Sandals properties and decided to give Couples a try on the recommendation of our travel agent...and we are SOOOO glad we did!", "title": "The Best All-Inclusive Caribbean Vacation Ever!!", "helpfulness": 52, "user": "spowrie", "date": "September 25, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "rooms": 3.0, "location": 5.0}, "id": 5836458, "likes": {"liked": "— Service and food were EXCEPTIONAL", "disliked": "— Rooms were a bit worn and basic"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "While the rooms at Couples Negril were a bit run down and pretty basic, the service and food were EXCEPTIONAL. Everyone we encountered bent over backwards to be friendly and accommodating; it was the BEST attitude we’ve encountered anywhere in the Caribbean. There was plenty to do, the house band was fabulous, the grounds and beach and restaurant areas were lovely, and attention to detail was evident in most everything they did. In mid-September, they were at about 50% capacity, which meant no lines anywhere, and the weather this time of year on Jamaica is PRIME--not so hot as to be uncomfortable with an average of 40 minutes' rain per day. The clear, shallow water off the beach was like stepping into soft, warm bath.", "title": "Best Honeymoon", "helpfulness": 34, "user": "lwolfe729", "date": "September 19, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5817654}, {"rating": 5.0, "stay_parameters": "Stayed September 2005, traveled as a couple", "text": "We did a ton of snorkeling including a night dive, took the sunset catamaran twice, spent time at the beach/pool/game room/gym and bars…and never missed a meal in 9 days. I've spent most of my life in New York City, and I can say from experience that the food at CN is truly excellent.", "title": "1st class!!!", "helpfulness": 33, "user": "kookie12", "date": "September 17, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5810633, "likes": {"liked": "— Diving", "disliked": "— Housekeeping phoning room."}}, {"rating": 3.0, "title": "Not bad, but not excellent", "text": "For a relaxing, romantic, decadent beach vacation...try Couples Negril. You'll be glad you did!", "helpfulness": 21, "user": "Wasnee", "date": "September 14, 2006", "id": 5800418}, {"rating": 3.0, "stay_parameters": "Stayed November 2005, traveled as a couple", "text": "We went to couples on our honeymoon in early August. We are both 24 and this was the best place we could have decided on. We had a blast. We stayed for 3 nights and then moved to the Rockhouse for 2. Big mistake. We wished we stayed at couples the whole time. The Rockhouse was a little too secluded and rustic for our tastes. There was always something going on at Couples. We woke up to Dirty Bananas and the bartenders would stay open late for the few of us that hung around. The grounds were great, beautiful beach and calm ocean. The floats were great too. We did the Catamaran Cruise and had a blast. Other than that, we ate drank and were happy. we signed up for scuba but were too hungover to go. The pool is awesome and the only food I didn't like was in the main dining hall when there wasn't a buffet. The ice cream machine was a neat touch. The rooms were nicer than I expected and ice cold. We booked a garden view and it was great. Massages were nice. The shopping center accross the street was interesting but we got some good deals. Buy from here, it's cheaper than when vendors come to the resort. They give you robes and cold water at night. We loved it and are already planning our trip back. The bus ride was no big deal and didn't seem long at all.", "title": "Not as good as the first time!! Sad to say", "helpfulness": 35, "user": "ocean4me", "date": "September 9, 2006", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 1.0, "value": 3.0, "location": 4.0, "rooms": 2.0}, "id": 5784671, "likes": {"liked": "— Food", "disliked": "— Extremely dirty rooms and bathrooms, too much seaweed in ocean!!!"}}], "location": {"country": "Caribbean"}, "stars": 4, "variance": {"poor": 101, "average": 168, "very good": 644, "terrible": 35, "excellent": 1810}, "aka": "Couples Negril Hotel", "slim_ranking": 0.161290322581, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.0, "location": 4.5}, "description": "Couples Negril. A brilliant balance of elegant and eclectic. At Couples Negril, style surrounds and infuses everything in sight. From the laid-back charm of the swim-up bar to the intoxicating allure on an in-suite Jacuzzi, there’s just something about Couples Negril that says chic. Defined by imaginative, artistic features and possessing a beautiful balance of elegant and eclectic, Couples Negril is 18 acres of all-inclusive luxury, personality and pleasure. All expertly carved into the captivating landscape of Negril, Jamaica. And while our unique appointments set us apart from any other resort, our unwavering attention to your every desire has earned us recognition as the premier all-inclusive resort not only in Jamaica, but the entire Caribbean"}