{"user_rating": 4.0, "review_count": 109, "name": "Courtyard by Marriott Grand Junction", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled on business", "text": "Stayed at Courtyard for 2 nights for work. The conference was held at Courtyard. I have stayed at many properties in GJ....this is definitely one I will be back to! Clean and accomodating rooms. No fridge or microwave which is something I really like to have in a room, but it wasn't a huge issue; free wifi, nice lobby/deck area. Bed comfy. Location is easy, if you are coming from the airport this is probably your best bet!", "title": "First stay at Courtyard...I'll be back for sure!", "user": "Amandi34", "date": "August 27, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 117316502}, {"rating": 3.0, "stay_parameters": "Stayed August 2011, traveled solo", "text": "My only complaint: When I was checked in they did not key my key for 2 nights....so after trying to get into my room for a couple minutes I had to go back down to the front desk to rekey...no biggie, just a small inconvenience.", "title": "Clean & Quiet, But No Breakfast", "user": "TucsonCurt", "date": "August 11, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 4.0, "value": 3.0, "service": 3.0}, "id": 116583184}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled solo", "text": "Spent one night at the Courtyard, which is out near the airport, while driving from Denver to Tucson. Got a great rate on Priceline. The room was clean, comfortable and quiet, which is all I really wanted for a place to spend the night. The airport isn't very busy so not much of a problem with airplane noise. The restaurants in the area are pretty average, though they get better if you're willing to head more into town. My only real complaint is that for whatever reason, Courtyard doesn't provide any kind of breakfast along with the room, only complimentary coffee. Nearly every other hotel out by the airport includes breakfast. Why Marriott takes this approach with their Courtyard label is a mystery.", "title": "Nice Courtyard, a couple of blocks from the Airport", "user": "denssull", "date": "July 25, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115770723}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "This is one of the nicest Courtyards I've stayed in. The king room has a couch that converts to a bed. The hotel appears to have been recently re-done and is in great condition. As usual those Courtyard beds and pillows are hard to beat. Everything about it is great, especially for an early flight because it is so close to the airport. ( from the hotel to airport parking and rental car return is about 2 minutes). And one of the best parts is the price. A lot of value for the price in this hotel.", "title": "CLEAN and COMFORTABLE Hotel!", "user": "yankedog", "date": "July 18, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115485362}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "We stayed at the Courtyard for one night. The hotel was easy to find, parking was plentiful and the front desk person was very cordial! The room was spotless! The hot tub was hot and VERY clean! Just the ticket after a long day of driving. The bed and bedding was soooo comfortable! The shower was perfect and when we discovered we had forgot a comb or brush, we called the front desk and they had one for free! I would definitely stay here again!", "title": "Very nice hotel in nice part of town.", "user": "Vivian_03", "date": "July 13, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115338071}, {"rating": 2.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "This property may have at once time been number one, but has since gone downhill. First and foremost, the price charged should include a free breakfast. I could have stayed at Best Western or Comfort Inn and gotten a free breakfast for 30% less. This property charges $10 each for they buffet breakfast! That's crazy.", "title": "Number 1 in GJ?? That's sad!!", "user": "cub1970", "date": "June 13, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 1.0, "service": 2.0}, "id": 113318494}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "We also ran into a couple of issues with the room. The hairdryer promptly blew up as soon as we turned it on. This was late at night and when we called the front desk, they said we had to wait until the next morning to get a new one. REALLY??? Next we had problems with the internet connection. We we could connect, it was extremely slow. When we reported it the front desk said 'yea, AT&T has been having problems'. No offer for a discount on the room, no offer of a free breakfast buffet, nothing.", "title": "Very Nice, New Hotel", "user": "maxmanmom", "date": "June 13, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 113202920}, {"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled on business", "text": "The stay had a few pros though. The room was clean and the AC worked well. The towels were plush and comfortable. The beds were very comfortable as well. Al in all it wasn't a total loss. If this is the #1 hotel in Grand Junction, I feel really sorry for frequent travelers to G.J.!!", "title": "Nice stay for a business trip. Typical Courtyard.", "user": "nicolecd", "date": "May 31, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 3.0, "value": 3.0, "service": 4.0}, "id": 110803497}, {"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled with family", "text": "The Courtyard by Marriott is fairly new. We rented two rooms while attending a high school graduation. The rooms were spotless. Beds were comfortable and the hotel was quiet at night. The breakfast buffet (not free for us) was better than average with lots of healthy choices as well as the standard bacon and eggs. We found the service to be excellent. Only one complaint--a plate a leftover food (room service?) was left in the hallway all evening and into the next morning. Not very appealing. Otherwise a great stay! We got a good rate using a senior discount, and wi-fi was free.", "title": "Great Airport hotel", "user": "Redrockgirl99", "date": "May 12, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 107956582}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled on business", "text": "Nice hotel. Newer building and furniture. My only complaint is that there was a constant ringing in my room. It sounded like a hot water pipe that rings/squeaks when being used. It sounded all night long. I called the front desk to complain. They said that it was probably someone taking a shower and would probably stop soon. But it never stopped.", "title": "Very Nice Hotel", "user": "jeffwa", "date": "May 3, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 106660150}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled with family", "text": "This place was wonderful, except I wish we could have had breakfast included. The staff were the friendliest I have ever seen. Very accomodating in every way. The room was nice and the hotel was nice. The pool area was small, which would be the only negative. Close to airport and CMU. Will always try to stay here!", "title": "Best place at great price!", "helpfulness": 1, "user": "greecelightning", "date": "September 19, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 118327387}, {"rating": 3.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "Stayed here as passing through on our way to Boulder from LA. I was excited when we booked this place online. Room was pretty standard, modern and comfortable. Service was fine as well. I was really annoyed that we went to the buffet style breakfast, and then got a bill for about $18 for two people. We booked online, so perhaps we didn't get the breakfast \"coupon\" but basically that added another $20 to the price of this hotel, which makes me hesitate to give it above 3 stars. However, my understanding of Grand Junction is that all the hotels are pretty high given the location.", "title": "Nice stay, a bit pricey and no free breakfast!", "user": "wakayamachan", "date": "September 13, 2011", "detail_rating": {"value": 2.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 118046543}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "We stayed at the Grand Junction Courtyard a total of 3 nights; one on our way to Moab, UT and two nights before we headed home. We had no problems at all during our stays. Mackenzie was working both times when we checked in. She was very efficent and friendly. Free wi-fi and small fridge in the room are nice touches. Bed was comfy and room immaculate. We used the airport shuttle which was very prompt. The location of the hotel makes it the perfect to stay before or after a flight.", "title": "Great Stay", "user": "lady pilot", "date": "September 12, 2011", "detail_rating": {"value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 118039407}, {"rating": 2.0, "stay_parameters": "Stayed August 2011, traveled solo", "text": "very disappointing for the price of a Marriott Courtyard; we've stayed at them lots of time. The bed was soft with sleeping wells and we both woke up with backaches, nothing a new mattress wouldn't solve. However, the plumbing was so loud that there must not be insulation in the walls. When the room above us was taking a bath we thought they had a hot tub in the room and when they let the water out, way too much noise! The next morning we were awakened by everyone taking showers. Didn't help that the head of the bed is against the wall where the pipes are. It is a beautiful hotel, nicely decorated, and maybe all rooms don't have this problem. If you try it, don't stay in room 301.", "title": "Won't go back", "user": "Charlene S", "date": "August 31, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 1.0, "value": 2.0, "service": 3.0}, "id": 117500950}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "Excellent Courtyard, good breakfast, comfortable room!", "title": "Comfortable, clean and stylish..", "user": "Tom T", "date": "August 30, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 3.0, "service": 5.0}, "id": 117460352}, {"rating": 3.0, "stay_parameters": "Stayed October 2011, traveled solo", "text": "Brand new hotel with good facilities. However, I was disappointed that I did not receive a top floor room. That being said, the staff was nice and I did get a restful night's sleep.", "title": "Good Facilities though no recognition for Platinum Members", "user": "dnumgis02", "date": "January 7, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 122709005}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "The staff was extremely accommodating in meeting every request. Free WI-FI, use of a computer and printer. Room was small and bedding smelled of smoke. Did not have enough time to have room changed. Airport is 100 yards away and shuttle very efficient.", "title": "Great service near airport", "user": "gabeg", "date": "November 4, 2011", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 120139915}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "For some reason our Sat Nav had real trouble finding this address! We ended up at the opposite side of town completely and took a good 1/2hr finding it. The hotel is away from the main downtown are abut not a problem for us as we had a car and were only staying for 1 night. Once there though, reception were very friendly and helped with advice on local attractions and dining options.", "title": "Nice place for overnight stay", "user": "boydsmad", "date": "October 20, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 119522553}, {"rating": 3.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "Room was clean and spacious and the bed was nice and comfy. We enjoyed a trip to the downtown area which was quite arty and had some lovely quaint shops. Our breakfast was included and we really enjoyed it - they even had a microwave to heat up any food that wasn't quite piping hot-good idea.", "title": "Average place to stay.", "user": "Oimaronap", "date": "October 17, 2011", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 119417931}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "On our way to Moab we decide to go and drive the Colorado National Monument which was a lovely first introduction to the red rocks - and at 9-10am in October was also nice and quiet! Recommended.", "title": "Very good hotel, esp given the $125 price.", "user": "John L", "date": "October 11, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 119202723}], "location": {"country": "United States", "city": "Grand Junction"}, "stars": 3, "variance": {"poor": 7, "average": 12, "very good": 44, "terrible": 3, "excellent": 43}, "aka": "Courtyard By Marriott Grand Junction Hotel", "slim_ranking": 0.555555555556, "description": "In an area known for its beautiful national parks, the Courtyard Grand Junction offers guests comfortable accommodations, close to the deep canyons and sandstone towers of Colorado National Monument. After a day of hiking, biking or skiing, the indoor pool and outdoor whirlpool are great for relaxing. Guests will also enjoy the proximity to I-70 and Mesa State College, as well as the high-speed wireless Internet Access offered throughout the property."}