{"user_rating": 4.5, "review_count": 422, "name": "Courtyard by Marriott Denver Downtown", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled on business", "text": "Stayed here w/ a friend on a trip to Denver/Boulder for a couple nights. Had dinner and drinks at the restaurant on the first floor on the 16th St Mall side one night. Great location and service. Had breakfast there the next AM, very good food, nice Bloody Mary bar!!! Hotel beds were comfortable, location was very convenient (right on the 16th St Mall) and walking distance to everything in downtown Denver. Staff was very friendly and the complimentary PCs and Internet in the Biz Center downstairs is a plus. If I were going back to Denver on business or leisure, would definately stay here again because of it's cleanliness and location!!!", "title": "Great Location, Very Clean Rooms", "user": "mainetoday", "date": "October 14, 2007", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 10079603, "likes": {"liked": "— Very Clean and Convenient Location"}}], "location": {"country": "United States", "city": "Denver"}, "stars": 3, "variance": {"poor": 15, "average": 39, "very good": 147, "terrible": 7, "excellent": 214}, "aka": "Courtyard By Marriott Denver Downtown Hotel Denver", "slim_ranking": 0.227586206897, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.0, "location": 5.0}, "description": "Our boutique-style Denver Marriott hotel is ideally located on the famed 16th Street Mall, just 4 blocks from the Colorado Convention Center and close to the best restaurants, attractions and shopping in the city. Visit the Pepsi Center, Coors Field, Larimer Square, Denver Pavilions and the Denver Center for the Performing Arts. Our Denver downtown hotel's stylish rooms and suites feature first-rate amenities, including luxury bedding, stylish decor, beautiful artwork and high ceilings. We are housed in a beautifully renovated historic building, and offer distinguished meeting space ideal for corporate gatherings. Guests are invited to enjoy our fitness and business centers, and free Wi-Fi throughout the hotel. Be sure to visit our on-site restaurant, Rialto Cafe, offering award-winning cuisine. The Courtyard Denver Downtown hotel delivers comfort, convenience and style!"}