{"user_rating": 4.0, "review_count": 174, "name": "Courtyard by Marriott Fort Worth Downtown/Blackstone", "reviews": [{"rating": 3.0, "title": "Not bad, not cheap", "text": "The hotel itself is decent, the rooms are nice and if you're on the upper floors you have a nice view usually. It's a little pricey for a Courtyard, but then you are in the center of Ft. Worth and there are a lot of bars and restaurants within easy walking distance.", "helpfulness": 2, "user": "B_Spriggs", "date": "April 25, 2006", "id": 5007015}, {"rating": 1.0, "stay_parameters": "Stayed March 2006, traveled on business", "text": "The thing that gets me most is that you pay about $200 a night (incl taxes) and then you have to pay them $10 to park your car in their lot regardless whether you're a guest. Add a tip for the attendant and you're starting to get into NYC range, in Ft. Worth Texas.", "title": "Absolutely never again....", "helpfulness": 4, "user": "jcarol1406", "date": "March 8, 2006", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "service": 3.0}, "id": 4593350}, {"rating": 4.0, "stay_parameters": "Stayed November 2005", "text": "All in all I'll probably continue staying there as there are not a lot of great options in the area. Maybe that's why they can charge what they do.", "title": "Well worth it", "helpfulness": 6, "user": "Easy180", "date": "November 17, 2005", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 4123675}, {"rating": 5.0, "title": "Perfect!", "text": "A total embarrassment for Marriott. The lobby is shabby to say the very least. The bar has no martini glasses and water is served in plastic cups. My non-smoking room smells of smoke. And I would have a stronger signal and a faster connection to the internet if I dialed up than I have on this wireless network. A very unpleasant experience.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "September 30, 2005", "id": 3976515}, {"rating": 3.0, "title": "Comfortable, clean and centrally located hotel.", "text": "Stayed at the Courtyard for a Saturday night in Fort Worth to go out downtown. Received a great last minute weekend rate of $89 from Marriott so we gladly switched from the La Quinta, which was not downtown. Great location and easy valet parking ($10 daily). Very quick valet service which was surprising. Even when we checked out at 11:00 on Sunday morning only had a 5 minute wait on our car. The lobby is quite nice with a little bar and our room was extremely clean. My wife worked out in the small exercise room with a couple of treadmills, bike and a weight machine. We thought downtown Fort Worth was actually better than Dallas. Had numerous restaurants and bars within an easy walk from the hotel. If you are in your 20's or early 30's would definitely recommend 8.0's bar. Puts most Dallas bars to shame and has an awesome patio. All in all would certainly recommend the Courtyard and downtown Fort Worth for those of us who usually take weekend trips to Dallas. Great change of pace.", "user": "A TripAdvisor user", "date": "September 4, 2005", "id": 3842302}, {"rating": 3.0, "stay_parameters": "Stayed July 2005", "text": "The hotel room was clean enough. And the bed was very comfortable. I had to wait a long time to be checked in, even though there was only one person ahead of me and there were two people working the desk. It seemed like they engaged in a lot of personal chit chat and one took a personal phone call before I was even aknowledged. I don't think I would choose this hotel again.", "title": "Just okay", "helpfulness": 4, "user": "stace120", "date": "August 15, 2005", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "rooms": 4.0, "service": 2.0}, "id": 3763462}, {"rating": 4.0, "stay_parameters": "Stayed July 2005", "text": "We were hesitant about staying at this hotel based on some of the reviews, but were pleasantly surprised. Because this Marriott Courtyard is in an old hotel, the lobby is nice and inviting. Based on some other reviews we asked for a room on one of the upper floors. Our room on the 11th floor was great. It looked like it had been newly remodeled. The bed was very comfortable and the room was spotless. We had a great view of the downtown. We reserved our room through Travelocity for $98 a night, plus tax, which is a good rate based on our check of the other downtown Ft. Worth Hotels. We also highly recommend the Cowgirl Hall of Fame. We will stay at this hotel again when we travel to Ft. Worth.", "title": "Good Hotel, Great Location", "user": "Margaret D", "date": "July 19, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 3681406}, {"rating": 4.0, "stay_parameters": "Stayed July 2005", "text": "After reading the other view posted for this hotel we nearly didn`t stay here however, we left it late to reserve a room and we ran out of hotel options. I was slightly concerned about the hotel but was pleasantly surprised! The hotel lobby is welcoming the check in staff were very friendly - offering advice on where to eat. The rooms were not the biggest I have stayed in but they where very clean - no threadbare carpets in sight! After 30 mins of being in our room we received a courtesy call checking that everything was alright and asking if we needed anything. The beds were very comfortable, the location was great, the Corner Bakery for breakfast served up a lovely meal. We were very impressed and would stay there again.", "title": "Not so bad after all!", "helpfulness": 3, "user": "steambug", "date": "July 4, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "service": 4.0}, "id": 3634205}, {"rating": 3.0, "stay_parameters": "Stayed May 2005", "text": "This was a nice historic hotel with an ornate facade. The inside was not fancy. It was a typical Courtyard. Our room was located on the 6th floor in the corner. It smelled like a typical old building would smell. The room was small, but for the two of us, there was plenty of room.", "title": "Nice location, older hotel", "helpfulness": 2, "user": "pilarkitty", "date": "May 18, 2005", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "rooms": 3.0, "service": 4.0}, "id": 3481709}, {"rating": 4.0, "stay_parameters": "Stayed May 2005", "text": "The staff was helpful and the location was perfect for an evening out in Sundance Square.", "title": "clean, comfortable, and friendly", "helpfulness": 1, "user": "kgoeding", "date": "May 16, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 3475516}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled with family", "text": "My two sons and I took the train from OKC and the hotel was within walking distance from the station. It was also a short distance from the hotel to Sundance Square, the Sid Richardson Museum (free), and several great restaurants. We booked a terrace room because we wanted to be sure to be on a higher floor, and we loved it. From our 16th floor patio we could see all of downtown Ft. Worth and beyond. We brought in dinner from the Chili's across the street, and ate it at our table on the terrace. The room itself was very clean and well-appointed, but was pretty cosy when we had the rollaway brought in. If you want lots of room, get a suite. We were shown one, but decided to sacrifice the space for the terrace. The staff was very friendly and professional, and the little desk clerk who checked us in , Shaunte, was especially accommodating. The kids loved having Internet access, a plus, and the only minus I can think of is no on-site restaurant (therefore no room service), although there is a little cafe connected to it that serves breakfast and sandwiches.", "title": "A wonderful stay!", "helpfulness": 2, "user": "Sherylmac", "date": "April 2, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 7268300, "likes": {"liked": "— Location", "disliked": "— No room service"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled on business", "text": "'Stayed here while attending a downtown convention. It was great! We were within walking distance of the convention and the entertainment district called Sundance Square. Lunch was available at several downtown eateries. Downtown Fort Worth was a very nice surprise. 'Thinking of going back for a weekend get away. We didn't have a room with a view but we didn't think to ask for one higher.", "title": "Location, location, location...", "helpfulness": 2, "user": "ls1202", "date": "October 21, 2006", "detail_rating": {"front_desk": 3.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 5981960, "likes": {"liked": "— Location", "disliked": "— Plain, dull lobby for such an old hotel... lacked ambience"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2006", "text": "If you get a western, upper floor room, you'll have a great view. Service was fine, room was clean, no frills typical of Courtyard Marriott. Walking distance to everything downtown.", "title": "Good deal for downtown", "helpfulness": 3, "user": "EllBoo", "date": "June 28, 2006", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "service": 4.0}, "id": 5397405}, {"rating": 5.0, "title": "Loved the Courtyard Blackstone/Marriott", "text": "Part of the room smelled like smoke and so did the halls. If you smoke, please don't book a non-smoking room -- you are not entitled to one that smells better only to stink it up and inflict your habit on non-smokers. Management can't really do anything about this - just my sidebar comment.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "May 23, 2006", "id": 5204605}, {"rating": 4.0, "stay_parameters": "Stayed May 2006, traveled on business", "text": "The only caveat is if you are staying on a weekend, you may have a noise factor from the bars nearby - the live music is quite loud. This didn't bother me. Overall a nice hotel for the money.", "title": "Best location in fort worth", "helpfulness": 2, "user": "Silverio33", "date": "May 8, 2006", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "service": 4.0}, "id": 5043301}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "The Courtyard in downtown Fort Worth was first rate. Absolutely spotless, nicely updated rooms. Service was up to Marriott’s always high standards. The opportunity to order room service from the Corner Bakery and Chili’s was a nice option. Yes, stay there!", "title": "Great place to stay!", "user": "sanantoniopete", "date": "October 17, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 10094087}, {"rating": 2.0, "stay_parameters": "Stayed August 2007, traveled on business", "text": "The Blackstone is in the heart of downtown Fort Worth, providing walking distance to several restaurants and the convention center. Parking was a little pricey and inconvenient if you need to drive your car anywhere. Our room was on the 8th floor and the beds were pleasant, comfortable and clean. The bathroom on the other hand was disgusting. There was hair all over the floor -not cleaned at all. I'm not talking about 2-3 \"hairs\". I'm talking about 20-30 all over the floor. I used some toilet paper to sweep them behind the toilet - youck. The next day was not much better. It was as if the mop was so dirty is was leaving behind more hair - just gross. I will NOT stay here again.", "title": "Dirty at the Blackstone", "user": "DDeee", "date": "September 23, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 2.0, "cleanliness": 1.0, "value": 2.0, "location": 4.0, "rooms": 1.0}, "id": 8862557, "likes": {"liked": "— location", "disliked": "— cleanliness"}}, {"rating": 3.0, "stay_parameters": "Stayed August 2007, traveled on business", "text": "My husband and I stayed at this hotel on a Friday night. The valet parking is very nice given the traffic and craziness of downtown. We did have some trouble finding it and had to circle the block. Our room was on a very high floor and was a little dated. But the view was amazing! My only complaint was the noise from a local club or something. We could hear clubbing music well into 3 am. I don’t know if sound carries or what but it was the first time I’ve had to fall asleep with a TV on to drown out noise!", "title": "Ok but loud on a friday night", "helpfulness": 1, "user": "Jenwee", "date": "September 4, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 5.0}, "id": 8656164, "likes": {"liked": "— location", "disliked": "— Noise!"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "We chose this hotel for its location to the convention center (its about three blocks away). It was a nice place to stay and I think will be very nice once the renovations are complete (the pool was closed when we were there).", "title": "Great location, Good Hotel", "user": "Tamon", "date": "August 12, 2007", "detail_rating": {"front_desk": 3.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 3.0, "location": 5.0, "rooms": 3.0}, "id": 8400975}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled on business", "text": "Stayed at the Courtyard Downtown Fort Worth last night. We chose the hotel for its great location in the heart of Sundance Square. The hotel is undergoing some renovations but this did not disrupt our stay at all. We stayed in room 1812 which is a corner room that shares no walls with other guest rooms (quiet). The room was fairly small but I imagine it would be perfect for a business traveler. Room was well cleaned. The 5th floor rooftop pool isn't much to look at but was great to get out of the 100 degree heat. The hotel offers parking for $10/nt. If you are there for a weekend visit, know that the city parking garages are free on the weekends. If you do decide to use the overnight parking valet, be sure to allow yourself time for them to get your car. It can take a bit of time, especially at common check out times. Overall a good hotel in a very convenient location.", "title": "Great location! 4 star amenities at 3 star quality", "user": "FMDtraveler", "date": "August 6, 2007", "detail_rating": {"front_desk": 3.0, "business": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 8361530, "likes": {"liked": "— Location"}}], "location": {"country": "United States", "city": "Fort Worth"}, "stars": 3, "variance": {"poor": 8, "average": 40, "very good": 53, "terrible": 10, "excellent": 63}, "aka": "Courtyard By Marriott Fort Worth Downtown/Blackstone Hotel Fort Worth", "slim_ranking": 0.333333333333, "description": "Experience old-fashioned luxury, fully updated with the latest technology, at the historic Courtyard Downtown Fort Worth Hotel. Marvel at the spires and terraces of the stunning 23-story, 1929 art deco building; a local landmark. Formerly known as the Blackstone Hotel, our establishment was a favorite of John Wayne, Clark Gable, & many of history's biggest celebrities. Our Fort Worth, TX hotel in Sundance Square is just four blocks from the Convention Center and ten minutes from the restaurants and shops of the famous Fort Worth Stockyards."}