{"user_rating": 4.5, "review_count": 96, "name": "Courtyard by Marriott Stuart", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled on business", "text": "We were passing through Stuart, FL & saw the new Courtyard right off I-95. The hotel staff was extremely helpful. The rooms were appointed nicely. We did not use the pool because we just stayed overnight, but it looked like a beautiful pool area. We asked for a room away from facing I-95 & it was very quiet. I do not know if the rooms facing the highway were noisy. The restaurant was adequate, but with a very willing to help staff. You can have a quick bite, but if you're looking for fine dining you'll need to go off premises. A nice touch in the restaurant was that some of the tables had TV's & we enjoyed watching while waiting for our food.", "title": "New, Clean Hotel", "helpfulness": 1, "user": "gayler104", "date": "July 28, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115928262}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "My husband and I were waiting for our rental to be ready, and we'd just moved across the country. This was a great place for that, because there was plenty of room for our stuff and the hotel is pet-friendly. It was clean, stylish, with comfortable bed and spacious bathroom, fridge, microwave, coffee... The only thing I'd say is that breakfast isn't free, which it should be for $119 per night. There's a bistro downstairs and you can buy food and drink anytime. Laundry facilities available. Next door to a Cracker Barrel!", "title": "Fantastic place to spend a week while working", "helpfulness": 1, "user": "Marj0rie", "date": "July 28, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 115912477}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "Very clean! Wonderful staff. Ralston was very kind. I thought I had left my son's medication at the hotel and called in a major panic. I was really freaking out...and he was wonderful! I don't know if I would have stayed so calm. (I had the medication all along:(). Will stay there next time I'm in town.", "title": "WOnderful Hotel", "user": "RoadWarrior0219", "date": "June 22, 2011", "detail_rating": {"cleanliness": 1.0, "sleep": 1.0, "value": 1.0, "service": 1.0}, "id": 114648310}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "It was clean, new, modern and even had a starbucks. The staff was nice too", "title": "Amazing Hotel, Clean and Everything you Need", "user": "beachiechick", "date": "May 31, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 110796077}, {"rating": 5.0, "stay_parameters": "Stayed February 2011", "text": "Our only regret about this hotel is that we arrived late and left early due to a hectic schedule. The hotel was easy to reach just off the i95, yet noise was not an issue for us. The lobby and dining area were well designed, modern, stylish and clean. Service was professional. We particularly liked the breakfast seating in booths with integrated TVs. Our room was compact but furnished to a good standard with a nice bathroom too. The hotel deserves its high ratings- we'd definitely go back if passing through again.", "title": "Fantastic hotel near the i95", "helpfulness": 1, "user": "City99", "date": "April 24, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 105256563}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "Newer facility with well appointed lobby area. Coffee and free Wi-Fi offered 24 hours. Nice outside pool area and state of the art fitness room. Room was nicely furnished with TV/ Fridge/Microwave/WiFi.", "title": "Very impressive hotel", "user": "JOSATCS", "date": "August 21, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 76165773}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "Bed was very comfortable and room was quiet after dark.", "title": "clean & new, BUT, no free eats!", "helpfulness": 1, "user": "thistle6436", "date": "August 4, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 73721358}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled on business", "text": "Bistro offering is certainly different than most Courtyards..but breakfast can come with the room ( for a charge) or simply order from the menu. Prices seemed to be in line with Florida offerings at other locations.", "title": "What a great stay!!!", "user": "MDfamily1", "date": "April 22, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 62200808}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "Would certainly stay again and recommend to other travelers.", "title": "Excellent hotel", "user": "greenthum", "date": "March 18, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 58890936}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "Very clean and new room. They had all the comforts of home. The only complaint that we had is that there wasn't any free breakfast. The Starbucks cafe area, although lovely, was expensive. Thank goodness there was a McDonald's right in front! In the past, we stayed in other hotels in the area that did have free breakfast. The bottom line would be, we would stay again.", "title": "Amazing Stay", "user": "Johnbuckeye", "date": "March 17, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 58824308}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled on business", "text": "I had a business meeting with a client in Stuart and came across this hotel. Perfect Wireless connection (from every location), very comfortable chair and desk in the room, great lobby area with what I call a Business lounge (not only a business center), decent food and great service. The fitness room is small but there was no need to wait for a turn at the treadmill machine. Great bed too!!", "title": "Ideal for Business", "user": "adelcarpio", "date": "January 27, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 54547585}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled with family", "text": "I have never stayed in the new, updated Courtyard and was very pleased. The lobby is very spacious containing different sitting areas, couches and some individual televisions. We spent some time here as a family, some watching football while others tuned in to kids shows. They have four computers in this same area. There is a large eating area that is open during meal times. The service on the weekend was slow, as this seems to be more of a business hotel. The outside area featured a nice sitting area and a fire pit. The workout room was small but had new equipment and was well maintained. I liked my room, was in room 231, although the dust ruffle had coffee or something spilled all over it. yuck. Overall loved this hotel.", "title": "Loved the lobby and Outdoor area", "user": "vthokie91", "date": "October 23, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 3.0, "rooms": 5.0}, "id": 47598464}, {"rating": 4.0, "stay_parameters": "Stayed June 2009", "text": "I love Marriotts and the changes they have made, but the beds are so uncomfortable. They are like sleeping on a cement block. I also dont like that there is no vending machines, you have to go to the lobby market. Most of the time we are in our pj.s when we decide we want something out of the machine and most people dont want to have to go to the lobby half dressed. This Marriott is very beautiful, if they would change the beds and give us vending machines this would be the perfect hotel.", "title": "Beautiful but uncomfortable!!", "user": "potcake62", "date": "June 24, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 3.0}, "id": 33041707}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled on business", "text": "Really a nice hotel at a good value. The room had easy to use free wifi, a nice desk with a roll out and a office chair. The lobby has a nice business center and ample places to sit and get some work done.", "title": "Nice hotel, looks pretty new.", "user": "divebluewater", "date": "June 15, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 32416798}, {"rating": 4.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "The gym has all new free weights, treadmills, stairclimbers and bicycles. The equipment has built in tv screens, so bring your headset.", "title": "Nice but with some housekeeping issues", "user": "travelingcats14", "date": "June 7, 2009", "detail_rating": {"cleanliness": 3.0, "value": 5.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 31809544}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "This place can put some of the luxury hotels to shame. My husband and I usually stay at high end/luxury properties but were coming for a wedding in Stuart Fl and found this place. The pictures on their website do truly represent the hotel as you really never know what you are going to get. The young lady, Ashley, at the desk was so nice and pleasant at check in and really helped with our first impression and set the tone for the rest of our visit. This place is a really nicely kept and very clean hotel with a modern feel without being over the top like some Court Yards can be. The entire staff is definitely on top of their game. If we have a need to go to this area of FL again we will stay here.", "title": "The Place to Stay When in the Stuart Area", "helpfulness": 2, "user": "snshnst", "date": "April 1, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 102486193}, {"rating": 1.0, "stay_parameters": "Stayed March 2011, traveled on business", "text": "In February I prebooked a room at this hotel for a business stay with another friend. We were given a confirmation and called again 1 day prior to traveling to reconfirm room as we'd arrive in late afternoon. Once arrived with bags in hand we were told the room was not available and we were \"walked\" to another local hotel in a cheaper room at their expense. The hotel knowingly overbooked itself and even Marriot Client Services could do nothing. Worst of all, the manager on duty while in office would NOT make herself available. Immediate management and staffing changes are appropriate, so travel carefully and consider checking in very early !", "title": "Can You Say Overbooked !!", "user": "FloridaBlankC", "date": "March 29, 2011", "detail_rating": {"service": 1.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 102029382}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled on business", "text": "I stayed here when it first opened in 2009, it was one of the first new concept CY's with the bistro and modern lobby. I'm happy to report it is still an excellent choice. There is now a Cracker Barrel next door as well as a McDonald's (ugh). The property is right off I-95, great location if you're headed to downtown Stuart or Jensen Beach. The AIA beaches are a good 20 minute drive. There is a good local pub about 1 mile away, Charlie's, above average pub food. I went to Mulligan's downtown, also a good choice. There are dozens of restaurant choices, although the front desk does not have a list created, only a binder of select menus. Overall an outstanding choice, great shape and pleasant staff.", "title": "Repeat customer- superb Courtyard!", "helpfulness": 1, "user": "edtoby007", "date": "March 27, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 101738830}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "New styled Courtyard. Great location, friendly staff, wireless internet, exercise room, small pool. Room wasn't the largest but more than adequate. Would definitely recommend.", "title": "Courtyard Excellence", "user": "BuckyRottweiler", "date": "January 31, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 95085082}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "We stayed here during a trip to escape a cold, northeast December. The property is beautiful and well-maintained, and the staff courteous, well-trained and gracious. It happened to be a bit chilly (for Florida), but that made sitting around the fire pit in the courtyard even better. Since the hotel is at the meeting of the Florida Turnpike and I-95, it is convenient for travelers who like to explore the surrounding area. Connecting to the free internet was easy, and the connection speed was very good. We are not breakfast people, but loved having our morning Starbucks in the nicely appointed lobby.", "title": "A pleasant stay at a beautiful hotel", "helpfulness": 1, "user": "LKAstier", "date": "January 7, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 92126622}], "location": {"country": "United States", "city": "Stuart"}, "stars": 3, "variance": {"poor": 1, "average": 5, "very good": 17, "terrible": 3, "excellent": 70}, "aka": "Courtyard By Marriott Stuart Hotel", "slim_ranking": 0.166666666667, "description": "The Courtyard Stuart is a brand new hotel boasting both high-style & high-tech. It's a perfect home base when you're visiting Florida's Treasure Coast for business, a nearby MLB spring training game or just relaxing on the beach."}