{"user_rating": 4.0, "review_count": 536, "name": "Courtyard by Marriott Fisherman's Wharf", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "Booked here because of the convenient location. This was our first big trip with our toddler. We wanted to stay somewhere with easy access to transportation, food and attractions. This was perfect. Plus, they offered a free mini-fridge in the room which made it easy to keep snacks for our son. To be honest, that was one of the deciding factors- free fridge, and free crib. The room was clean and of good size. Bed was comfortable. Staff was very helpful. F Street Cars just a short 2 blocks away. Bus #30 line was right behind hotel. Easy few blocks to Fisherman's Warf and Ghirardelli Square. I'd recommend to families because of the convenience inside and outside the hotel. We'd stay again.", "title": "Comfortable, Clean and conventient", "helpfulness": 2, "user": "sarahbear760", "date": "March 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 126781714}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "My parents and i stayed at this hotel for about a week, and it was pretty mush what we expected from a Marriott hotel. The location was fantastic for it is close not only to Fisherman's Wharf, it was also close to a trolley station and cable car station where you have access to much of the city (check your map -- the trolley and the cable car takes you to two different parts of the city). There are also two car rental places pretty much on the premise (next door to the hotel). We rented at the Avis (the pother one is Hertz) and not only was the price reasonable ($34.00 a day), we were able to return it to the parking lot without any cost (parking can be up to $36.00 a day). There are also various tour companies nearby that can take you anywhere you want -- the concierge at the desk is helpful for these things, Although the hotel Bistro only serves breakfast (it's not bad, but it could be better),there are many places to eat within the hotel area. Breakfast was probably the best at the Denny's a block away located in the Holiday Inn. But as far as restaurants, there are plenty more nearby and it's also two blocks away from Ghirardelli where you can get chocolates and ice cream (as well as food).There are many shops nearby, including a Walgreens just a block away for basic needs (you can also buy souvineers there for a much cheaper price -- this advise was given by a front desk staff).", "title": "Great Location! Spacious Rooms! Safe!", "helpfulness": 1, "user": "jonjoncapy", "date": "March 26, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 126702374}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "The room was very clean and spacious, and very comfortable. I would recommend this hotel and would stay here again for a future trip.", "title": "Great Location, Comfortable Stay", "user": "Ginnynj4133", "date": "March 22, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 126509595}, {"rating": 1.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "A quick overnight at one of my favorite spots on the Wharf. Walkable distance to all good wharf eats, transportation and the general ambience of the Wharf, which is why I stay there when I can. Seagulls, fog horns and the bay all make this a favorite stop even for a day. Helpful staff at the Courtyard, comfortable slleping and great internet connections. Stay if you can.", "title": "Rude Front Desk Manager - Pathetic Service", "helpfulness": 3, "user": "Neil K", "date": "March 21, 2012", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 1.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 126429960}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "The hotel location is good, does NOT serve breakfast, NO ROOM SERVICE, no drinking water, absolutely pathetic staff, atrocious service. Stay here only for the location, NOTHING ELSE.. MARRIOTT does not deserve to be in such a good location. Make way for a better hotel.", "title": "Perfect Location", "helpfulness": 3, "user": "AnitaH4300", "date": "March 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 126362488}, {"rating": 3.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "My partner and I stayed at the Courtyard Marriott for the Memorial Weekend. Over the next 3 days this hotel won us over. I will say that when we pulled up our driver said \"oh this used to the old Howard Johnson\" which made feel like we had made a mistake. But after staying at the other Courtyard across town many times, I thought I'd give it a chance. Overall, the service was great and attentive, the lobby has free coffee in the morning, and we used the market a lot for healthy snacks and toiletries (which were all between $1-$3 - they didn't price up anything! Corona was only $3 too!). We were on the 3rd floor facing the parking garage. It was a bummer, but we're adults and knew we couldn't have everything we wanted in our price. I would ask for a room facing Beech street if possible for the additional windows (they protrude out). Location was amazing and was perfect for our needs. The Bistro on the second floor served really good food and was conveinant right before we left for SFO. I wish we would have known that there was a bike rental in the back courtyard of the hotel that connects it to In N Out. That would be have been so much easier than what we did. Also wish there was a pool. Gym was OK - newer with towels. Bathroom was normal and room was normal. After three days we really felt we got our money's worth!", "title": "Most Bang for Your Buck", "helpfulness": 2, "user": "ohiocouple", "date": "June 1, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 66047189}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled with family", "text": "We started our family vacation (of 8) in San Francisco and let me tell you, we couldn't have picked a better hotel to start our trip. The staff at the Courtyard Marriott are the friendliest around! Everytime you enter or exit the building, they greet you with a smile:) They are eager to help you any way they can. We pre-paid 3 rooms (2 rooms with 2 queens and 1 w/king) and received a reasonable rate in doing so. They were very accommodating and kept the rooms close together and even gave us connecting rooms for the queen rooms. Check-in was fast and we were in our rooms within minutes. The rooms were spacious and clean with nice amenities, including a fridge to hold a few cans of cold beer and bottles of water. The beds are very comfortable and they supplied plenty of pillows which is something my husband and I like because we are pillow hogs. The hotel is also very quiet and we did not hear any noise from outside or the hallways. The hotel is centrally located to the wharf and if you exit out the back, you'll be on the main street that takes you to the eateries and down to Pier 39. But you don't need to go far to find a quick bit to eat. In the courtyard you'll find Hooters and In and Out Burger. Across the street is pizza and in the side alley Subway. Just up the street is a Joanie's which is a great place for breakfast with killer pancakes! My husband's favorite, a beer store right beside the hotel so he never had to go far to restock:) A great spot to try for dinner is out the back doors and up the street to the left a couple blocks to Cioppino's which is an outstanding place to eat. (Check out my restaurant review on Cioppino's for more details). There is parking available for $34/day with in/out privileges which really isn't bad compared to other cities we've stayed in. The only downside, there are no safes in the rooms, which would be nice to hold your valuables when you leave the room. However, if you ask them at they desk, they will put them in a safe downstairs for you if you like. All in all, this a very clean, friendly, wonderful hotel that I would stay at again without hesitation.", "title": "Love This Hotel", "helpfulness": 3, "user": "filmmaker55", "date": "May 21, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 64911328}, {"rating": 5.0, "stay_parameters": "Stayed May 2010", "text": "Newer hotel near Fishermans wharf. Very clean rooms. Great location for the wharf and for transportation to the rest of the city. Parking was $32/day but is in/out all day and the lot is just next door.", "title": "Clean, convenient, good value and great location", "user": "Afcase", "date": "May 9, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 63611316}, {"rating": 4.0, "stay_parameters": "Stayed April 2010, traveled with friends", "text": "Our first room 227 faced the parking deck was very noisy. Called the front desk and were offered a new room with upgraded windows.", "title": "Very Pleased !", "user": "talkn2ya", "date": "April 30, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 62905832}, {"rating": 4.0, "stay_parameters": "Stayed April 2010, traveled with friends", "text": "You could still hear some street noise but not much.", "title": "Great location- comfortable rooms", "user": "bestboxers", "date": "April 25, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 62411847}, {"rating": 3.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "I have stayed at a lot of Courtyard properties. These places do a good job at providing decent places to stay with minimal amenities. This one also offers a great location for San Francisco touring. Located at the West end of the Fisherman's Wharf area, it is close to a lot of great sites and sights. It is a part of Anchorage Square, a mostly empty shopping area that I hope is just under renovation. We had a room with a \"courtyard\" view, and it looked down the interior of Anchorage Square that was being fixed up and had people milling about. The noise level was OK - tended to quiet down by about 11 p.m. I asked for a room that was above the street, and was on the 3rd floor - out of 4 - so it was OK.", "title": "Location is good", "helpfulness": 3, "user": "ErinLeary", "date": "April 5, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 127320744}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "Parking was an extravagant $41 a night with tax. I did use it since having the valet get it was helpful. Lots of places to walk to and great places to eat very near by. One in particular was the Beach Street Grill. We ate there for breakfast a couple of times and it was very good.", "title": "Great family spot- close to pier", "helpfulness": 2, "user": "Uphill_from_Denver", "date": "April 4, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 127246976}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "Overall, it was a fine stay - nothing too special, but the location more than makes up for the fact that it's fairly basic.", "title": "good location!", "user": "LYNNE M", "date": "April 2, 2012", "detail_rating": {"value": 3.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 127157472}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "Big rooms, real queen sized beds. Stylish lobby. My family and I stayed here for 5 nights over spring break. We had a great time. Our room was quiet, and had a nice balcony but NO view whats so ever of anything. The hotel was very up front about this both over the phone and during checking. Perhaps higher rooms might get a bit of a city view? It was an eaasy walkt to the pier 39, fishermans wharf, and the trolley/street cars as well as the cable cars. Parking is a bit expensive, other than that no complaints", "title": "Great location - a little outside city noise, but otherwise just fine", "helpfulness": 2, "user": "Karen R", "date": "March 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 126948755}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "We enjoyed our stay at Marriott fisherman’s wharf. The staff is friendly and the location is very convenient. We tried to have a late check out but we couldnt but that was understandable", "title": "Walt to Cable Car and the Wharf", "helpfulness": 1, "user": "cardman760", "date": "March 29, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 126934768}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled with friends", "text": "Great location, completely renovated, good service. Hotel looks like new on the inside, very large rooms complete with usual flat screen TV and small frig, complementary wi-fi, large bath with amenities. Beds were very comfortable and the room suprisingly quiet. Only thing that keeps it from being a five star is the fact that there is no restaurant on site. No problem, the place is surrounded by every kind of dining one could want, all within two-three blocks. Good internet rate was available (for the Wharf), very competitive property now and would prefer this hotel to others further away and more expensive.", "title": "four stars plus", "helpfulness": 1, "user": "notnecessary", "date": "May 15, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 130011010}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "Good hotel with acceptable rates, no pool (which wasn't a factor for us - we were too busy). Excellent location within walking distance of nearly everything (Pier 33 was a bit far to walk (Alcatraz departure pier)). Clean, modern rooms that felt large. We tried both the 1 bedroom suite with a rollaway (1 bathroom was large but tough with all girls). Then we went to two adjacent double queen rooms. The queen rooms felt large as well, with good bathrooms. No complaints on the rooms or hotel whatsoever. If we were pushed, someone could have easily slept on the floor in the double queen rooms, unlike many other tourist hotels we've stayed in. Free wifi but not breakfast. The 1 Bedroom suite faced Beach street which was busy and noisy but our bedroom had double windows (including a sound proofing window) so we heard very little, only rumbly trucks got our attention. Other than that it was nearly silent in the room. The 2 queen bed rooms faced the parking garage (E side), it didn't have double windows but still had no sound complaints. There is a walkway below between the hotel and parking garage but it wasn't heavily used. It is unbelievably difficult to find 1 hotel room in San Francisco to accommodate a family of 5 (without small kids). Their 1 bedroom suite was the only room in town. It's too bad we couldn't get it for all 4 nights we were there.", "title": "Highly Recommended", "user": "Awesomeaustin", "date": "May 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 129742977}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "My husband and I recently stayed here during an extended weekend trip to San Francisco. Having stayed at many more full-service Marriott properties and Residence Inns than Courtyard Marriotts, this was suprisingly clean and the rooms were good-sized for San Francisco. I thought the bathroom had a unique layout with the sink being right on top of the toilet - but this is not typically people's main concerns. The free wi-fi is a nice touch. The staff is extremely friendly - as I was welcomed back every single time I walked in the door and by several people. This is probablly one of the friendliest front of the house staff that I have encountered. The front desk, however, did not seem to be particularly knowledgable when posed questions regarding where to dine and were not engaged in giving recommendations, either. They could have been more \"Marriott\" helpful there. Ask for a room away from the alleyway - if possible - it's quite loud with the Subway and other businessess that house their storefronts there. If you are looking for a place to have breakfast in the morning - I highly recommend The Hollywood Cafe - which is a couple of blocks away.", "title": "Great value and location for a Marriott property around the Wharf", "helpfulness": 3, "user": "amybojo", "date": "April 30, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 129140580}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with friends", "text": "Overall - for what you pay - this is a good value in a very convenient (to the Pier, tourist stuff on the Wharf etc.) area.", "title": "Close to everything, nice friendly staff", "helpfulness": 1, "user": "mutigerbell", "date": "April 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 128620505}, {"rating": 5.0, "stay_parameters": "Stayed April 2012", "text": "Oh - for all of you In N Out burger fans - it's right around the corner....and the only one in the city :)", "title": "Great family hotel in heart of San Francisco", "helpfulness": 2, "user": "PNWTraveler99", "date": "April 23, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 128418834}, {"rating": 3.0, "stay_parameters": "Stayed November 2009, traveled with family", "text": "The hotel was in a good location, right around the corner from Fisherman's Wharf. Hotelstaff were helpful. HOtel is undergoing renovations, so there is only one, very slow elevator operating. There is also no restaurant in operation, so only food option is the simple continental breakfast (no charge). If you have Marriott points stay here. If you are asked to pay over $150 a night I would think you can find something else.", "title": "Good location, hotel undergoing renovation", "user": "martycommack", "date": "November 9, 2009", "detail_rating": {"cleanliness": 5.0, "value": 2.0, "location": 4.0, "service": 2.0, "rooms": 3.0}, "id": 48797968}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled solo", "text": "The main entrance is almost complete with the new Courtyard lobby. The lounge and business center are in tip top shape. The rooms are magnificent! I love the colors and the excellent use of space. The location couldn't be better. Literally 1/2 block from the F-line.", "title": "Fabulous & Impressive Renovation", "user": "WorldHotelCritique", "date": "November 2, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 48353815}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled with family", "text": "Being remodeled October 2009. Great size rooms. Walk to Fisherman's Wharf (just through the courtyard), boat-launch to Alcatraz, bike/segway tours, Pier 39, restaurants and cable car routes. Lots to see and do. No car needed but you can rent one for the day if you want to visit wineries, Muir Woods or Saulsilito or just to drive across the Golden Gate and down the crookedest street. Free continental breakfast. Booked on the internet and got great rates.", "title": "Great family hotel located near Fisherman's Wharf", "user": "KarenEman", "date": "November 1, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 48251349}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled with family", "text": "The remodeling was nearly done when we visited mid-October 2009. New fitness center and casual restaurant were not finished, but remodeled rooms were spacious, bright and comfortable. Two queen beds and a sleeper sofa - great for families. No pool, though. Highly recommended. Will stay there next time we are in S.F.", "title": "Great room - perfect location", "user": "LarsDane", "date": "October 27, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 47900000}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled with family", "text": "We should stay for 3 nights in San Francisco before continuing our trip in California. We chose the hotel because it was near Fishermans Wharf, public transport (it is located between two cable car turnstiles and the historic streetcars running on the F-line ).", "title": "Highly recommended!", "helpfulness": 1, "user": "stingfantoo", "date": "October 23, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 47543106}, {"rating": 4.0, "stay_parameters": "Stayed March 2010, traveled with family", "text": "This hotel was centrally located to allow us to knock out all of the main San Francisco area sites in a few days. The staff was very attentive and responsive, the room was well maintained, and the lobby provided many conveniences (i.e. free coffee, free computer/internet usage, TV, etc.). The cable car line is just two blocks away and Lombard street is just up the hill, along with Fisherman's Wharf. Walking to Pier 33 for Alcatraz takes 10-15mins, or you can take the tram for $2 person, simply catch on the corner by Walgreens. Biggest downside is that parking costs $34 per day.", "title": "Great Location", "user": "barkwood66", "date": "April 5, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 60430816}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled on business", "text": "Typical Courtyard Marriott, quiet, comfortable, safe, just an easy place to stay, no troubles at all during our stay, with great beds. We stayed three nights at this hotel after checking into another hotel our travel agent had booked (lets just say it was scary) and out again within the hour. There was a conference in SF that weekend which took up most of the available bedding in the city, finding a place for six adults for three nights was difficult, but the staff at the hotel were friendly and helpful where other front desks were indifferent. The breakfast was good, the rooms were spacious and well appointed, the beds were fabulous and the tariff was affordable. We walked out at night to Fishermans Wharf, and explored the city easily from this position, and would recommend it to anyone looking for a home away from home in San Fran.", "title": "comfortable and close to the tourist spots", "user": "stephandsimon", "date": "April 2, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 60165566}, {"rating": 4.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "We really enjoyed staying at this hotel. We chose the Courtyard because the rates were reasonable ($119) and they allowed up to 4 people in the room. Many other hotels in SF restrict it to 2 people and/or make you pay extra, so that is a benefit. The hotel itself is located in a very convenient location in the Fishermans Wharf area on Beach Street, just a street up from the main street, Jefferson, where all the action is. It's a basic hotel room, but clean and well appointed. The staff could not have been more friendly and nicer. You really can't go wrong.", "title": "Really good option!", "helpfulness": 3, "user": "Eurotravel", "date": "March 25, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 59473164}, {"rating": 3.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "As far as getting there, we realized there isn't an easy way to reach Fishermans Wharf from either airport (Oakland or SFO), unless you don't mind dragging your luggage from BART to streetcar (and streetcars don't always run on schedule as we unfortunately learned on a rainy, cold day). We elected to take a taxi from SFO ($45), which with 4 people really made sense anyway, as it would have cost us nearly the same to buy BART and streetcar fares.", "title": "Terrible shower, won't be back", "user": "scdaren", "date": "March 23, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 2.0, "location": 5.0}, "id": 59329302}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled with friends", "text": "The hotel breakfast option was probably the only aspect that wasn't great. Maybe it was just circumstance, but when we went down for breakfast one morning, there was a long line and the staff had difficulty keeping up with the orders. You order at the counter and some of the food was given immediately and some was delivered to the table about 10 minutes later...we enjoyed breakfast at two eateries which are located diagonally across the street on Columbus Street, Pergamino Coffee & Tea (really cute and quaint place with HUGE pancakes) and Happy Days Diner (good standard fare). The Boudin Bakery is also a nice option for lunch or light dinner. It's affordable and during the day you can watch them make bread which they shape into crabs and other sealife. Most restaurants in Fishermans Wharf are terribly overpriced and the menus all seem similar. Try McCormick and Kuletos happy hour that starts at 3pm, it's really reasonable. A wonderful find for dinner was Bocce Cafe in the Italian district at 478 Green Street. It's a brisk 15 minute walk from the hotel up Columbus Street, and well worth it. The food is good and reasonably priced and the atmosphere is great, with live music. Excellent. We will definitely go back.", "title": "Great Service, Great Location, Great Value.", "user": "Chingay", "date": "March 2, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 57581674}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled on business", "text": "I brought a group to the Marriott Courtyard Fisherman's Wharf in December of 2007. I was surprised at the fair rate considering the amazing location. It is close to everything. The beds were comfortable and rooms fine for what we needed - nice but not overly fancy. I understand it has been renovated since our stay which is even better. The manager welcomed us at our arrival and was helpful in every way.", "title": "Location. Location. Location", "user": "fancylittlelaminated", "date": "January 7, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 52877673}, {"rating": 4.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "We used Marriott points to stay at the Marriott Courtyard Wharf before a trip to Napa. For the price, it was wonderful (we did pay for an extra night too). Great location, walking distance to many tourist atttractions, friendly staff and nice rooms. I really have no complaints. Parking is expensive but that is expected in a city. You can park yourself for $32/day with no in-and-out priviledges or $39/day with in-and-out availability. Overall, a nice hotel with reasonable prices.", "title": "Convenient location for tourist activities", "helpfulness": 2, "user": "RCRGator", "date": "November 29, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 50275007}, {"rating": 4.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "We chose this hotel for several reasons:", "title": "Good choice for stay at Fisherman's Wharf", "helpfulness": 1, "user": "Kitters", "date": "November 24, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 49937923}, {"rating": 4.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "Close to Fisherman's Wharf", "title": "Nice place to stay", "helpfulness": 1, "user": "mdm", "date": "November 16, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 49354063}, {"rating": 3.0, "title": "Fishermans wharf", "text": "Marriott Rewards member", "user": "malernnj", "date": "November 14, 2009", "id": 49203339}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "Great location for our family's visit. Walked to Pier 39, Fisherman's Wharf, Historic Ships, Ghiradelli Square! (never heard any street noise in our room.) Better rate & larger room than neighboring options. Typical Marriott... clean & stylish room, attentive staff. Avoid $36 nightly parking and park in lot next door $20 with in/out privileges.", "title": "Great location, Marriott-level Service", "helpfulness": 8, "user": "SJKKH", "date": "April 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 128178584}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "Don't miss the National Parks Historic Ships one block away. Fantastic displays, fun for kids to explore the ships, and their Visitor's Center across the street does an amazing job of immersing you in the history SF wharf life. Our kids were fascinated!", "title": "Good location, good room, very clean", "helpfulness": 1, "user": "Mary789", "date": "April 11, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 127703041}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "Had Marriott points to use, so chose this location - matched my 'points' budget, and easy access to public transportation. The area can be noisy - we were on the 4th floor in the back, overlooking the mostly empty Anchorage plaza, so not bad there. No view, but not expecting a view. Staff friendly and facility very clean. Queen bed was very comfy, minifridge was unexpected surprise that helped with beverages, and the room was larger than I expected. Plenty of room for a cot or crib, if you were there with kids. \"Bistro' hours are breakfast only, and closes precisely on time - so plan ahead or you will miss out! Selection was good, tho, and easy to take back to room to eat. No pool or room service.", "title": "Great for our family.", "helpfulness": 2, "user": "travelingmamaof2", "date": "April 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127584553}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "This hotel was perfect for our stay in San Francisco. We have two small kids and stayed in a suite that perfectly suited our needs. It isn't the fanciest hotel, but it is clean and comfortable and has everything you need on site. I am picky about hotels and was very happy here. The location is fantastic. There are a lot of sights/attractions down at the wharf, and when you're ready to see the rest of San Francisco, the public transportation is right there! Rooms were quiet, breakfast was on site, and the staff was helpful. Overall a great place to stay for us!", "title": "Great location at the Wharf.", "helpfulness": 1, "user": "geethree w", "date": "April 9, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 127527817}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "It was a men's trip. Me, Son, Grandson. This place offered a roll-a-way bed for free! All the places on the Wharf are just a few blocks away. Beware $40 a night to park a car? What's with that!!! The room was clean, lobby was nice, coffee in the morning, not bad. Room price went up $40 a night when tax was added??? San Francisco...It almost seems they will pad the bill in every possible instance. Hint: Stay away from the Imperial Palace restaurant in Chinatown, the one off Grant and Washington. Bad food and the worst/rude service I have ever encountered. The Stinging Rose on Columbus is great, prices are a little high, but worth it.", "title": "Excellent as Expected!", "helpfulness": 4, "user": "ObjectiveUnknown", "date": "April 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 127503198}], "location": {"country": "United States", "city": "San Francisco"}, "stars": 3, "variance": {"poor": 13, "average": 78, "very good": 244, "terrible": 10, "excellent": 191}, "aka": "Courtyard By Marriott Fisherman`s Wharf Hotel San Francisco", "slim_ranking": 0.2, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.0, "location": 4.5}}