{"user_rating": 4.0, "review_count": 1135, "name": "Courtyard by Marriott Isla Verde Beach Resort", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "My husband and I stayed one night at The Courtyard by Marriott Isla Verde Beach Resort as we could not make our connection and needed a place close to the airport. We were pleasantly surprised with this hotel. Check-in was easy, but a bit long as it seemed this is the hotel distressed travelers were being sent to so it was a bit crowded at check-in. However, the room as adequate if a bit small for a longer stay. You could definitely hear the jets from the airport, but also the waves from the beach. We had a meal at Sirena Restaurant located off the main entrance on the beach. Scallops were great, Paella was not. Free Mojitos (twice for each of us) helped immensely! The Casino and lounge were hopping and the pool is open 24 hours. We also had morning breakfast at Bananas Ice cream parlor/cafe in the lobby and it was fine. Coffee especially good! I would stay here again for a night.", "title": "Nice, easy-from-airport, hotel", "helpfulness": 2, "user": "islandtrav07", "date": "July 22, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "location": 3.0}, "id": 18135575, "likes": {"liked": "— Close to airport, good dining options", "disliked": "— close to airport"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled on business", "text": "My husband and I stayed here post cruise. We were impressed by the very professional and friendly staff. Everyone from the bell staff, front desk, housekeeping, and restaurant personnel were smiling, and eager to please. Check-in was a breeze.", "title": "Very nice experience", "helpfulness": 2, "user": "savti", "date": "July 15, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 17924409, "likes": {"liked": "— beach view"}}, {"rating": 5.0, "title": "Wonderful Honeymoon!", "text": "We were especially impressed by Rafael, a waiter at the breakfast buffet. We ate outside, with a beautiful view of the beach.", "helpfulness": 2, "user": "luv2trvl07", "date": "July 7, 2008", "id": 17621071}, {"rating": 5.0, "stay_parameters": "Stayed June 2008", "text": "We enjoyed the casino, and loved the band and trio in the lobby bar, which is a fun place to spend the evening.", "title": "A little bit of heaven in Isla Verde...", "helpfulness": 6, "user": "GOD-BLESSED", "date": "July 6, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 17570917, "likes": {"liked": "— The staff - Mr. Arroyo is fabulous! Such great customer service", "disliked": "— Having to leave"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "The rooms were clean, spacious, with remodeled baths, and very comfortable bedding. The view of the beach from our balcony was stunning. The beach was wide, and clean. The ocean was clear, warm, and calm when we were there. It was great to have the hammocks by the beach!", "title": "Enjoyed This Hotel", "helpfulness": 1, "user": "NENASABIA", "date": "July 1, 2008", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 17398020}, {"rating": 5.0, "title": "Felt like royalty, Much better than I expected - Thanks Alfredo!!!", "text": "I was looking for a reasonable hotel that was family friendly as I was traveling with a 4 month old and a 19 month old. After doing my research and reading reviews I settled on this hotel.", "helpfulness": 3, "user": "cocoanellie", "date": "June 26, 2008", "id": 17266051}, {"rating": 2.0, "stay_parameters": "Stayed June 2008, traveled with friends", "text": "I paid $160 a night for an ocean view room on the hotels website. At the time I booked my room I could not get the two queen beds, cribs or early check-in confirmed for me. Since we had the kids all these things were really important to me. After referencing the posted reviews I got Alfredo's (Assistant General Manager) email address (aarroyo@sjcourtyard.com) and sent him an email. He responded to me very quickly and confirmed that all my requests granted upon my arrival.", "title": "Disappointing", "helpfulness": 3, "user": "pr237", "date": "June 14, 2008", "detail_rating": {"front_desk": 2.0, "business": 2.0, "service": 2.0, "cleanliness": 1.0, "value": 2.0, "location": 3.0, "rooms": 2.0}, "id": 16921980}, {"rating": 5.0, "stay_parameters": "Stayed May 2008", "text": "When we arrived the doorman was very helpful and took our luggage right away. After a short wait the front desk clerk was very polite and quickly got our keys to us. She gave us a quick rundown of all the dining and we were on or way to our room.", "title": "Wonderful place!", "helpfulness": 2, "user": "ccumomsc", "date": "June 12, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 16887378, "likes": {"liked": "— Friendly staff", "disliked": "— Location is not close to golf courses"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "Once we got to our room I was blown away by the most magnificent view of the ocean. It was truly unbelievable to me and I have seen many of ocean views. There were water, fruits, cookies and chocolates waiting for us which were a nice touch since we had only eaten airplane food.", "title": "Great", "helpfulness": 1, "user": "LadyBug04", "date": "June 11, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 16848416, "likes": {"liked": "— Many things in just one place.", "disliked": "— Service sometimes was slow."}}, {"rating": 3.0, "stay_parameters": "Stayed May 2008, traveled with friends", "text": "We knew coming into it that room service would be limited to breakfast so we weren't at all annoyed by the lack of that. As for the food in the hotel we didn't eat any of it as there were just too many local inexpensive Puerto Rican restaurants that we were told about beforehand. They do make a pretty good mojito in the bar and on Thursday nights they have free salsa lessons which were awesome.", "title": "Nice beach but noisy", "helpfulness": 1, "user": "kellir", "date": "June 2, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 3.0, "rooms": 3.0}, "id": 16625636}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "We enjoyed a week and a half at the Isla Verde Courtyard Marriott and loved every minute! The 12th Floor beachfront Suite had a stunning view of the beach, ocean and San Juan skyline. The evening sunsets on the balcony were exactly the relaxing moments we were looking for.", "title": "Isla Verde at it's best!", "helpfulness": 1, "user": "NootskiWauankeeWI", "date": "September 5, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 19804515, "likes": {"liked": "— The whole package - we had it all - and the beach right out the door.", "disliked": "— Could have had more bathroom hooks/lines for wet swimsuite, towels, etc."}}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "We were impressed by the service we received at every level at the resort. From the moment we arrived at the front door and were helped with our vehicle and bags, we felt like we were welcome and knew we would be well-cared for. The front desk personnel were always helpful and pleasant. The room was exceptionnally maintained by the staff. The enitre resort property was immaculate and cared for - it made our stay so enjoyable.", "title": "Amazing Stay - Can't Wait to Go Back!", "helpfulness": 1, "user": "Ralph L", "date": "August 26, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 19388596, "likes": {"liked": "— Location right on the beach, great food, good pool scene", "disliked": "— The $6 beach chairs - make them apart of the resort fee!!"}}, {"rating": 2.0, "stay_parameters": "Stayed August 2008, traveled with friends", "text": "Our suite became our \"home away from home\" - the beds were very comfortable, and we had plenty of room to spread out with our kids. With the Olympics on TV during our visit - our kids really enjoyed the nice television set - and allowed us to enjoy the nightlife a the resort. The staff was so respectful of our time in our room - going to great lengths to clean it around our schedule.", "title": "Custumer doesn't matter, It's all about the $$$", "helpfulness": 2, "user": "4girlss", "date": "August 25, 2008", "detail_rating": {"front_desk": 1.0, "service": 4.0, "cleanliness": 4.0, "value": 2.0, "rooms": 3.0, "location": 2.0}, "id": 19347079}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "The Restaurants were fabulous. The food at the Salsa Restaurant provided the authentic Puerto Rican cooking that we were looking for. Although it's always good to get out and enjoy the variety restaurants in the neighborhood have to offer - it would have been very easy to eat every meal right at the resort. The beach front higher end restaurant Sirena was just relaxing, delicious experience. The Fish and Polenta dish I enjoyed was out of this world! The breakfast buffet was large and provided a delicious breakfast to all of our different tastes. Our kids loved \"Banana\" - getting their nightly treat there to enjoy in the room!", "title": "Peaceful, relaxing, excellent staff.", "helpfulness": 4, "user": "Ray57Rules", "date": "August 24, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 19314559, "likes": {"liked": "— The beauty", "disliked": "— Price of breakfast."}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "The pool was wonderful - surrounded by beautiful palm trees and the beach just steps away. Our whole family enjoyed every moment we spent in the sun and water! The staff was so helpful in getting to the tourist sites as well - their directions to the Bacardi Factory were right on and made the trip so easy.", "title": "I Loved my stay at this Hotel", "helpfulness": 1, "user": "jandaroe", "date": "August 19, 2008", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "rooms": 5.0, "location": 5.0}, "id": 19122429, "likes": {"liked": "— Everything was great", "disliked": "— The pool by the middle of the week"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled with family", "text": "I was a little hesitant to book this hotel, since my previous experiences with Courtyard has not been great; not at this Courtyard. The hotel is in tip top shape, everybody was attentive and friendly. Beach is beautiful, even though a little rough (watch your kids), and the pool was nice and clean. Food is kind of expensive but good and plenty of choices for kids. At our arrival we were met and escorted to our room by Mr. Aroyo and he kindly explained hotel amenities and local attractions. We were very impressed with the level of service at this little hotel!", "title": "Nice little hotel.", "helpfulness": 4, "user": "dantemiami", "date": "October 6, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 5.0, "rooms": 4.0}, "id": 10047431, "likes": {"liked": "— Service", "disliked": "— Food expensive"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "We stayed there from Sept 27-29 and words just cannot express how fantastic everything and everyone there is. From the warm greeting we got at the front desk to the wonderful bartender at the pool. We were celebrating my girlfriend's birthday and also a quick honeymoon.", "title": "Amazing stay, superb staff", "helpfulness": 5, "user": "annie_10_pr", "date": "October 6, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 10045689, "likes": {"liked": "— Their pool bar", "disliked": "— Lots of pigeons around when you eat"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "The pool was great, the bartender Axel was very very nice and attentive with us. We told him we were celebrating a birthday and he gave my gf a free drink in her honor.... His mojito is WONDERFUL !!! And we also tried their burgers and wrap and they were really good and not expensive at all.", "title": "Outstanding Hotel !!!!!", "helpfulness": 7, "user": "robboh24", "date": "September 13, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8708030, "likes": {"liked": "— The assistant manager gave excellent service", "disliked": "— That we had to leave :("}}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "Overall, I would definetely stay there again. Their pool was just the best and the beach is not bad at all... I like the beach at The Ritz Carlton better...I plan to visit again in Nov.", "title": "Fantastic Labor Day Weekend at a great resort", "helpfulness": 4, "user": "ellyaponte", "date": "September 10, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 8690312}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled with family", "text": "We have just returned from our vacation at the court yard marriott in san juan Puerto Rico as we entered the hotel at check in the top notch service began. The staff and management greeted us at the front desk making us feel great and they were wainting for us to arrive. The room was so nice i didnt want to leave it. The bed was so soft and you sleep very well.The food was excellent,everything you need is within in a few steps away from you this hotel is clean and well put together. Throught the entire stay at the courtyard the management team greeted us with a handshake asking if we needed anything, they called the room checking up on us. I have stayed at many resorts and I am a world traveler and I'd have to say this was the best hotel I have ever stayed at - I do recommend this as the best hotel out of the thousands of hotels i have been to. By far the service ,food, management and staff were nothing less than stella. i hope you read this review and decide that this is the hotel for you , you will not be disapointed with you stay.", "title": "Hats Off!!!!!", "helpfulness": 4, "user": "mecaNewYork", "date": "September 8, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 8677381, "likes": {"liked": "— Service"}}, {"rating": 3.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "After a 10 hour flight to San Juan, we arrived at the Courtyard by Marriott Isla Verde, a hotel highly recommended by many Tripadvisor readers. A short unspectacular driveway from the street to the hotel and a reception area that is overwhelmed by adjacent casino activities did not provide an initial \"wow\" factor, and we immediately questioned ourselves whether the long journey was worthwhile. (It also made us think twice about tripadvisor comments). The spacious room and comfortable bed compensated our feelings. However the carpet was very damp and the room air much more humid than at other Caribbean hotels we stayed. (We asked about the carpet situation the following day, but did not receive a response). Daylight revealed a nice beach, however the water was more of a surfer's delight. The pool and surrounding garden area were unspectacular.", "title": "Mixed feelings", "helpfulness": 2, "user": "dkona", "date": "February 11, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 3.0, "value": 3.0, "location": 2.0, "rooms": 3.0}, "id": 13448173, "likes": {"liked": "— Room size, Good bed"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2008, traveled with family", "text": "Overall our positive feelings about the hotel are:", "title": "Highly recommend", "helpfulness": 10, "user": "NewYorkIlt", "date": "January 24, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 12952937, "likes": {"liked": "— Service staff"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2008, traveled on business", "text": "-The room was a good size, clean and with a comfortable bed (although feather/down pillows were scarce).", "title": "Great Value, Great Music but Air Traffic Noise a Problem", "helpfulness": 11, "user": "BlueMarlinDave", "date": "January 22, 2008", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 12902242, "likes": {"liked": "— Great Value and room. Great Bar with Outstanding Live Puerto Rican music", "disliked": "— Loud aircraft noise"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled with family", "text": "-The staff members are excellent- friendly, and helpful.", "title": "Best bang for the buck", "helpfulness": 12, "user": "sunitharay", "date": "November 24, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 11021057, "likes": {"liked": "— service, location", "disliked": "— casino, high prices of restaurants"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "-The night music is great- the place really swings during weekends with locals who dance fantastic.", "title": "Great Place", "helpfulness": 12, "user": "zamku", "date": "November 19, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 10924031, "likes": {"liked": "— Clean & friendly", "disliked": "— Overpriced food at the hotel"}}, {"rating": 1.0, "title": "A vacation i would love to forget!", "text": "I think your rooms are very nice and your hotel is situated in a beautiful place. waking up to that beach every day was amazing! But I would love to forget the dinig experience I had in your restaurant. Salsa restaurant is a poor excuse for a restaurant the food was horrible and the service dreadful! I think thereyou should re-train an employee she was very rude to me and my husband. She was an older lady with long black hair. It`s a shame that you have people like that working for such a great company like it is Marriott!!", "user": "linanewjersey", "date": "September 3, 2007", "id": 8615399}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled on business", "text": "The Courtyard Marriott is a decent hotel on a good beach. It is certainly not in an interesting area for tourists, basically across the street from the airport if that interests you (see the photo). Being walking distance to the Ritz Carlton and their restaurants and casino is nice but other than that, nothing to do in the area but walk on the beach. Rooms were just ok, nothing fancy although you get a walk out balcony with 1/2 the rooms facing the ocean. Ask for a room with the new plasma/lcd tv. Their website makes it sound like all rooms have them, and that's not true yet.", "title": "Decent hotel on nice beach", "helpfulness": 4, "user": "Rusty2280", "date": "August 27, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 8514899}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "I recently stayed for 4 nights with my 2 teenage daughters.Our room was ready when we arrived,and had 2 comfortable beds,a flat-screen TV,CD player,coffeepot, and mini-fridge with complimentary bottles of water.There was a balcony witha table and chairs with a beautiful ocean view.The beach behind this hotel is the nicest on the strip in Isla Verde,with white,powdery sand,palm trees for shade,and even a few hammocks for lounging.The staff wil bring your drink to you on the beach,or you can cool off with a cocktail at the pool's swimup bar.There is also a kiddie pool,and hot tub.My only complaint here is having to pay $6 for a beach chair-just increase the daily hotel rate for Pete's sake,and don't charge for the chairs.There are a few restaurants on the premises,as well as limited room service. The breakfast buffet at Salsa was good,with made-to-order omelettes and Belgian waffles among the offerings.However,the dinner buffet at Salsa was not good.The salads,side dishes, and desserts were good,but all 4 entrees (turkey,chicken,pork,and mahi-mahi) were dry and underseasoned.The food at the bar,Picante,was good,as were the lighter dishes available at Bananas,and the poolside grill.There is an outdoor restaurant called Sirena also,but we didn't get a chance to try it.The inhouse casino was fun,and there are 3 computers available in the lobby with free internet access .My daughters spent time on the computers,because there wasn't much for them to do at night.There were families with young children,couples,and some business travelers,but not a lot of teenagers around.We rented a car for 24 hours;just enough to spend an afternoon and evening browsing around old San Juan,and a half day at El Yunque rainforest.The hotel staff is helpful and pleasant-they genuinely seem happy to assist with any questions or requests.Overall,I would definitely recommend the Courtyard,and hope I stay again in the future.", "title": "A great trip with a few caveats", "helpfulness": 6, "user": "beatfeet", "date": "August 25, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 8505238, "likes": {"liked": "— beautiful beach", "disliked": "— no activities for teens at night"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled with friends", "text": "I'm a frequent business traveler so I had used my marriott rewards points for my stay here. I was worried that since I was using points, I would not end up with a nice room. But to my surprise, all of my requests were met - including my request for an upgrade. I was extremely pleased with my room. It was clean, spacious, and had a gorgeous view. I also liked that the rooms had free wireless internet access. The hotel staff was excellent - very friendly and helpful. Good service seemed to be a priority for them, and that plays a huge part in my choice for a hotel. The live music provided for great entertainment (be ready to dance!). The hotel is literally right on the beach, which was the best part of all - I had several lovely naps on the hammocks lining the beach. I highly recommend this hotel.", "title": "Fantastic stay...", "helpfulness": 3, "user": "soumya23", "date": "August 19, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8454103}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled on business", "text": "We had the luck to be invited to Puerto Rico for a wedding at the Marriott. We had a problem with getting a room and at 3:45 with no sleep the night before as we had to be at the airport at 4am, I was starting to get upset. Well between Jose and Alfredo the problem was taken care of right now. Our room was a mini suite and we were so comfortable. I never got the name of our maid but we were in rm 1024 and she was great. Our room was spotless every day we came in. She left us extras of anything we needed. What can I say about Alfredo and Jose? Everytime I saw them they called us by name and wanted to make sure we were taken care of. We travel alot and that really impressed my husband and I. Pool was great, ocean was clean and men right there to take care of your needs. I gamble alot and enjoyed the casino, or should I say the casino enjoyed me as i didnt have much luck. Went to el San Juan to gamble and that was not good at all. The planes did not bother our party at all. Salsa music was a great treat. And the wedding they took care of was beautiful. what a great place to get married. We danced by the pool and just had the best of times. My hat is off to Alfredo and his staff. We are already planning our next trip.", "title": "Loved the staff", "helpfulness": 3, "user": "no1meemaw", "date": "August 16, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 8434583, "likes": {"liked": "— staff and how they care.", "disliked": "— cant think of anything"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "room came with 2 coupons for alcoholic drinks, had wonderful dual pools (very large!!) with swim up bar and pool-type food, right on the beach with hammocks, nice restauraunt (and seperate ice cream parlor) with live music right next to the casino......marriott gave us 25$ in match play so we could double our earnings at the casino....in room fridge, tv has DVD AND VCR PLAYER! (not many tv channels)...very nice staff, 24 hour fitness center (stairmaster, treadmill, bike, weights). we had a car, so that helped us see more of the san juan area. the hotel is very nice, much nicer than any courtyard ive stayed at, and i would stay at this one again. you wont be disappointed! PS-- free wireless in room!", "title": "much nicer than any courtyard ive seen", "helpfulness": 7, "user": "veggggyy", "date": "September 26, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5877278, "likes": {"liked": "— right nearby airport", "disliked": "— airplanes taking off noise (but u cant hear it in your room)"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2006, traveled with family", "text": "My two young children and I were accompanying my husband on a business trip.We opted for this hotel because there was no availability at the San Juan Marriott and I wanted a hotel on the beach.This has a really great beach front with surprisingly good hammocks.", "title": "A relaxing family experience.", "helpfulness": 5, "user": "adriellesmum", "date": "September 23, 2006", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 3.0, "value": 4.0, "location": 3.0, "rooms": 4.0}, "id": 5829412, "likes": {"liked": "— The rooms were clean and a good size.Ocean view spectacular.", "disliked": "— The bathrooms could use some updating and the beds and linens weren't the best."}}, {"rating": 4.0, "stay_parameters": "Stayed September 2006, traveled with family", "text": "We booked a corner suite and the connecting king room.Both had balconies and faced the ocean.", "title": "Be prepared to relax", "helpfulness": 6, "user": "sfltraveler", "date": "September 21, 2006", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 5822028, "likes": {"liked": "— nice beach/pool area--large rooms", "disliked": "— distance to restaurants"}}, {"rating": 2.0, "stay_parameters": "Stayed August 2006, traveled with friends", "text": "The suite was very large and had a decent sized kitchen with a full sized fridge/freezer.Apart from some cups and glasses from the bathroom,there are no utensils,plates or cutlery of any kind.", "title": "Too far and little to do.", "helpfulness": 5, "user": "RosiNYC", "date": "September 1, 2006", "detail_rating": {"front_desk": 3.0, "business": 5.0, "service": 2.0, "cleanliness": 4.0, "value": 2.0, "location": 1.0, "rooms": 3.0}, "id": 5761395, "likes": {"liked": "— Clean rooms", "disliked": "— bathroom and location"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2006, traveled solo", "text": "We had a rental car and ended up buying plastic plates etc.bottled water and some cereal from a local Walgreens.", "title": "Very nice stay", "helpfulness": 7, "user": "craigking", "date": "July 28, 2006", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 2.0, "rooms": 4.0}, "id": 5524057, "likes": {"liked": "— Good service", "disliked": "— Out of the way"}}, {"rating": 3.0, "stay_parameters": "Stayed May 2006", "text": "I stayed at the Marriott for my birthday from 5/17 to 5/21/06. The hotel is nice for the price. Our check in was a little slow but the rooms were nice. The hotel is right on the beach...please be aware that the beach is public and the water is very sandy. I did discover some beautiful and odd sea shells. However,you may want to visit another beach such as Liquillo beach to experience what a caribeean beach shoud look like. The hotel beach had sand fleas and they got us really bad. The pool area is nice and so are the beach hammocks. The hotel is close to the airport but after a couple of drinks the plane noise fades out and you get use to it. The hotel staff was helpful and accomdated us when our toliet overflowed and we had to be moved to another room. For the inconveince they sent us breakfast and a nice fruit basket. The hotel is walking distance from many resturants pharmancies and groceries stores. The bus stops right near the hotel and is only 75 cents to Old San Juan...Also do not take the tour to the Barcardi factory to get a more scenic route take the A5 bus to the last stop and walk over to pier 2 catch the ferry and then a cab to the factory...the entire trip cost us $4.75 per person one way. The hotel will try to charge you $40 for the tour so be aware. The Puerto Rican people were so friendlyand nice.", "title": "Nice and reasonable", "helpfulness": 16, "user": "POSITIFFANY", "date": "June 4, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 3.0}, "id": 5296415}, {"rating": 5.0, "title": "A Wonderful Anniversary", "text": "My wife and I decided to visit Puerto Rico for our 1st year anniversary during the Memorial Day Weekend.", "helpfulness": 8, "user": "A TripAdvisor user", "date": "June 3, 2006", "id": 5294671}, {"rating": 1.0, "title": "This was a mistake", "text": "Initially, we were booked to stay at another hotel, but when we checked in, we checked right out . We were in a bind since all the hotels were booked up for the Memorial Day Weekend Holiday.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "June 2, 2006", "id": 5293697}, {"rating": 1.0, "stay_parameters": "Stayed April 2006, traveled on business", "text": "We ended up by getting one of the last few rooms at this hotel. Be advised that this hotel is directly across from the airport. You do hear planes take off but it isnt so bad if you have a room not close to the airport side of the building. We complained at the location of our room and were immediately changed and upgraded.", "title": "Below average", "helpfulness": 8, "user": "MariaLaboy", "date": "May 11, 2006", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "service": 1.0}, "id": 5056353}, {"rating": 4.0, "title": "Loved the Courtyard Marriott at Isla Verde", "text": "The pool and beach are nice. They have plenty of chairs and umbrellas and a nice pool with a swim up bar but be aware that you do hear planes take off. It reminded my wife of the show 'Lost'.", "helpfulness": 14, "user": "A TripAdvisor user", "date": "April 19, 2006", "id": 4989463}, {"rating": 4.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "First, I do not recommend booking with Orbitz because they had billing mistakes that undercharged us. On the last day of a 4 day and 3 night stay, we were almost charged over $300 for the 5th person in our room. There were house rules we were not aware of and not listed in the Orbitz confirmation. To the credit of Marriott's management, the woman I spoke to followed up with Orbitz to correct the issue and she asked us to disregard the bill. Excellent customer service!", "title": "We didn't want to leave!", "helpfulness": 6, "user": "SizzlingSisig", "date": "August 13, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 18934539, "likes": {"liked": "— Clean room with free bottled water and coffee, distance to and view of the beach", "disliked": "— Better prices for hotel restaurant and would have liked authentic house specialties of PR meals"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "As far as Isla Verde and the hotel is concerned, it is about a 5 minute cab ride from the airport. There were occasional plane rumbles from the take-offs that could not be heard from the rooms unless the sliding doors of our partial view terrace was open. The noise didn't bother us at the very least and it didn't detract from the serenity of enjoying the view.", "title": "great place~", "helpfulness": 3, "user": "BAR2AG4", "date": "August 12, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 18880456, "likes": {"liked": "— everything! The beach, the room, the staff. Everything was great!", "disliked": "— we liked everything."}}, {"rating": 4.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "Another thing about our sliding doors, it solved the mystery of why our air condiitioner stopped working. I commend Marriott for rigging the AC power to the sliding doors to conserve energy. When the sliding doors are open the AC shuts off. Brilliant! They also conserve water through the low flow faucet and the option of reusing towels. The shower by the way may have been low-flow? I'm not sure because the different settings did the job in pulsing that water to blast any sand off after a day at the beach.", "title": "Pretty Good", "helpfulness": 1, "user": "kevinkmt", "date": "August 5, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 18662191}, {"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "And yes they do charge for the beach chairs but they do not charge for the beach towels. Before 6pm, you can obtain towels from the booth by the pool and bring them to the beach. There are also hammocks that I didn't get to test drive but looked wonderful - by the beach with the beautiful view of the blue skies and clouds. The pool was also a great option with plenty of room in the 3 feet area and the 5 feet side has the swim up bar. We were ableto use our key cards to get free cups of water in the gym which was about 20 feet from the whirlpool during our evening soaks. Behind the tall bushes surrounding the bar is the 3 feet deep kiddie pool-it's a good size for a few kids to jump in and enjoy.", "title": "Beautiful Beachfront", "helpfulness": 3, "user": "tropicalfan", "date": "August 5, 2008", "detail_rating": {"cleanliness": 3.0, "front_desk": 3.0, "location": 4.0, "value": 4.0, "rooms": 4.0}, "id": 18638679, "likes": {"liked": "— Beach location", "disliked": "— Charge for beach chairs"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2008, traveled with family", "text": "There is also great music in the evenings from the live band in the lobby bar and restaurant which serves draft medalla-a light puerto rican beer that I miss ohso much. Someone suggested that there should be lessons-I AGREE!!! I think that there should be lessons every hour of the basic steps of salsa and merengue. I would be more than eager to come back and drag all my friends and cousins with me for that. It will give us another reason to stay in the hotel and drive more of singles in our age group in. Our group was composed of a married couple and 3 single women in their 30s. As far as nightlife, when you exit the hotel, make a right. Trust me, to date, everything that is in walking distance is to the right when you exit the hotel and stay on the right side of the street because the sidewalk there makes it easy to walk alongside the wide streets. You will pass the Ritz Carlton and you will see a Denny's. Then you will see the parking opening for a strip mall on your right and the sign for Drums. The restaurant used to be called Shots. This is a good place for nightlight on Friday and Saturday nights after 10pm. If you want food though, don't enter the parking lot on your right. Instead, look to your left and you will see an island on the street with bus stop vestibules. Further across, you will see Metropol which doesn't look like a big restaurant from the facade. It opens at 11:30am and closes at 10:30pm and serves big portions of cuban and puerto rican meals. The portions are large and it could have been enough for two people. The sampler appetizer alone could have been the meal. My friend ordered and loved fiesta cubana and I enjoyed my friend's red snapper. The chicken was great as well (and contrary to my cousin's jokes, the chicken could not have been from the cockfighting arena next door. And even if it was, it was incredibly delicious.) I also enjoyed the grounded beef and make sure you try the puerto rican hot sauce...it is definitely based in vinegar and chili peppers. Also when they bring you the garlic buttered bread, make sure you ask for mayoketchup (aka thousand island dressing). Most locals use that sauce for the bread and it is also delicious.", "title": "All the conveniences", "helpfulness": 1, "user": "ccurtis", "date": "August 1, 2008", "detail_rating": {"cleanliness": 5.0, "front_desk": 5.0, "location": 4.0, "business": 3.0, "rooms": 4.0}, "id": 18505635, "likes": {"liked": "— music", "disliked": "— it was all fine"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled with family", "text": "My husband, sister and I just spent a glorious week (11/3/07 - 11/10/07) at the Courtyard by Marriott Isla Beach Resort.", "title": "BEST of The BEST!", "helpfulness": 17, "user": "greatscott2", "date": "November 13, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 10793262, "likes": {"liked": "— The Personal Service, room, beach, view, casino, food, internet", "disliked": "— Nothing! Everything was just perfect!!!"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled with friends", "text": "I, too, had checked out Tripadviser reviews before our trip and even emailed the Assistant Manager, Alfredo Arroyo, with a few questions prior to our arrival...His prompt replys led me to believe this was going to be a SUPER week and we were not disappointed!!!!", "title": "Great Hotel", "helpfulness": 3, "user": "OhioGirl7", "date": "October 28, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 3.0, "rooms": 4.0}, "id": 10408539, "likes": {"liked": "— I loved the location--right on a beautiful beach!", "disliked": "— Hearing airplanes take off from the nearby airport"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled with family", "text": "Perla at the reservation desk checked us in .... gave us info about the resort, including 3 free drink tickets and $25 in match bets to use in the casino....About 5 minutes after we got in our room, Mr. Arroya called and welcomed us to the Marriott and wanted to meet us. WE WERE TOTALLY BLOWN AWAY WITH THIS PERSONAL SERVICE.... We met at the beautiful outside restaurant (Sirena) and Mr. Arroya was so gracious and introduced us to some of the staff....the food was beautifully prepared and excellent in taste. Service was A+ at this restaurant, as well as the Salsa Buffett and Bananas. You can sure tell that Management and all the employees at this resort respect each other and aim to give their very best in personal service to all their guests. We have never EVER been treated so nice before in all our travels....", "title": "Great management saved my opinion!", "helpfulness": 3, "user": "varipaul", "date": "October 21, 2007", "detail_rating": {"front_desk": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 10201838, "likes": {"liked": "— The management response to our concerns", "disliked": "— The pool was not operational"}}, {"rating": 2.0, "stay_parameters": "Stayed October 2007, traveled on business", "text": "We had a great room overlooking the beach and pool with a large-screen t.v., small refrigerator (that is stocked each day with FREE bottled water) coffe pot and coffee, CD player, DVD/VCR player, black-out curtains and the most comfortable beds and luxurious linens. The maids were wonderful and gave us extra coffee and bottled water when we asked and we were more than pleased to reciprocate with a nice tip each time.", "title": "Didnt live up to the Marriot brand.", "helpfulness": 1, "user": "rayaberry", "date": "October 21, 2007", "detail_rating": {"front_desk": 1.0, "business": 3.0, "service": 1.0, "cleanliness": 2.0, "value": 2.0, "location": 4.0, "rooms": 1.0}, "id": 10200535, "likes": {"liked": "— The location", "disliked": "— The service"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "The Casino was fun and something we have never encountered before....they serve FREE drinks, sandwiches and soup on the casino floor, but be sure and give these hard-working people a nice tip. One of our favorite servers in the casino was \"Angel\" and he was an angel...We couldn't get over the trays he would carry with so many drinks, and food on it and then remember who got what.", "title": "A real value among beachfront Isla Verde resort hotels!", "helpfulness": 6, "user": "mimart", "date": "October 17, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 10097443, "likes": {"liked": "— The beautiful beach and the casino.", "disliked": "— The limited menu items available at the restaurants that were open for lunch."}}, {"rating": 5.0, "title": "Had A great time!!!!", "text": "I stayed at this resort from July 13-18th. We had a wonderful stay! The resort has a casino, 3 restaurant and nice entertainment. Every night there is a live salsa band playing at the bar...it gets so packed. The rooms are very nice and clean. We had an ocean view room. The food there is good...I wouldn't recommend the outside restaurant Serena, it has steep prices and food that I never heard of before. They had a buffet which I only went to for breakfast because there was really no food that looked good for dinner. Its only 12.00 for breakfast and they give you A LOT of food to chose from, it’s a great deal. The pool and beach area are very nice and the beach isn't too crowded like some of the other beaches we went to on the island. The beach is wonderful and the water is nice and blue. The pool has a great grill restaurant that is good for lunch. Reasonable prices and great food. I enjoyed the swim up bar at the pool, they make good drinks :) This resort is about a 10 min walk from other resorts and night life. If you take a taxi to these places or anywhere in Isla verde it will cost between $6-8 one way. There are a couple excellent restaurant near by. We went to the \"ranch\" in the el San Juan hotel which is on the 10th floor of the hotel and is completely open and overlooks the whole city....its so pretty at night to see San Juan lit up. All the waiters were dressed up like cowboys and they make the place actually look like a \"ranch\". The prices were actually very reasonable. They ranged from $12-22. We also went to Outback Steakhouse located in the Embassy Suits. Both of these restaurant are exactly $6.00 cab rides one way.", "helpfulness": 12, "user": "Trishy86", "date": "July 21, 2006", "id": 5495002}, {"rating": 4.0, "stay_parameters": "Stayed June 2006", "text": "When you get to the resort I would recommend booking the snorkeling excursion The beach they bring you to is breathtaking...the water is clearer than my swimming pool. The rainforest excursion was fun also. The tour guys is really funny and makes the excursion interesting. Overall, I had a wonderful stay. They are doing some major renovations on this hotel and its going to be 10 times bigger and better according to the model of it in the lobby. I would Def. stay here again!!!", "title": "You can't go wrong with the Courtyard!", "helpfulness": 13, "user": "step", "date": "July 5, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 5428669}, {"rating": 5.0, "stay_parameters": "Stayed June 2006", "text": "I am an avid reader of the Trip Advisor reviews when I travel. I typically read the bad reviews first to see if there is any continuity than the good to get an overall impression. I do extensive research before we stay at hotels for quality and price. The courtyard delivered both and then some. We stayed at the Courtyard in Isle Verde a day before our cruise. It is a very nice hotel, though I don't think I would spend more than a few days here due to the city around the property. Airport noise was very loud outside. I could handle it for a couple days though, I would prefer to be more removed from the hustle and bustle.", "title": "No complaints!!!!!!!", "helpfulness": 11, "user": "knokkak", "date": "June 26, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 5391344}, {"rating": 5.0, "title": "Has it all", "text": "An early check in went smooth. The room was a ocean front, very clean and fresh and worth the extra money for a great view. The bed was fine, not sure what why other review complained.. Bar area was festive with live band. The pool was GREAT!! very tropical. Swim up bar, quick food at restaurant outside very good. The dinner buffet was not the greatest! Go off property! We don't gamble so all casino's look the same. Beach was clean. I would stay again. Last time (2004) we stayed at El San Juan and had a great experience, though after reading many bad reviews we decided to switch. It was a good choice!", "helpfulness": 9, "user": "A TripAdvisor user", "date": "June 18, 2006", "id": 5357740}, {"rating": 5.0, "title": "Awesome week at Courtyard in San Juan", "text": "I have absolutely no complaints....", "helpfulness": 9, "user": "A TripAdvisor user", "date": "June 8, 2006", "id": 5325073}, {"rating": 5.0, "title": "\"Loved The Courtyard\"", "text": "My Fiance and I just got back from Puerto Rico we spent five days there and had a great time!! I read alot of reviwes before and after booking my trip and I was not sure if I had made a good choice but I must say do not go by what you read off of the internet as far as reviwes go this hotel was not bad at all. The place is great and you have to be there on the weekend and enjoy ther live bands the place gets packed great music if your not a party pooper!! Get out of the hotel enjoy what's near by there is alot to do and good places for dinner in the area that is not as expensive as the hotel. You can go to Metropool, Shotz, and the 101 Lounge good food great music and it's all in walking distance. We really enjoyed ourselves and will be returning soon this hotel is worth it the others are to pricey and over crowed. This was a great trip so do not go by what you read it is not all true belive me I know!", "helpfulness": 6, "user": "ZOE D", "date": "April 18, 2006", "id": 4985970}, {"rating": 5.0, "stay_parameters": "Stayed April 2006", "text": "We just returned from a short cruise, followed by a stay at the Courtyard Marriott. The hotel is fantastic. The rooms are large and the hotel is very clean. Everyone was extremely friendly and helpful. The beach is beautiful and the pool area is very comfortable with food and drinks available.", "title": "A little piece of heaven", "helpfulness": 4, "user": "witchcitytraveler", "date": "April 13, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4971411}, {"rating": 3.0, "stay_parameters": "Stayed April 2006", "text": "Yes, there is the airport noise, but I had so much fun with my friends (we decided on this group vacation after many years of friendship...I won't say how many!) that the noise didn't affect our enjoyment of the hotel. I really didn't notice much noise at night, but maybe that's because I slept so well in the very large and comfortable bed. The food was good, especially the buffets (breakfast and dinner) at Salsa. There are other dining choices at the hotel, but we did feel it would be nice to have one more inside restaurant. Needless to say, we were sad to leave the beauty of Puerto Rico and the comfort of the Courtyard Marriott!", "title": "Just average for us", "helpfulness": 6, "user": "orr333", "date": "April 13, 2006", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "service": 4.0}, "id": 4970440}, {"rating": 5.0, "title": "The most beautiful place in the world", "text": "First of all, PR is completely overpriced. Having visited islands and resorts all over the US and Carribean, the rates for what you get in PR are outrageous.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "April 11, 2006", "id": 4964549}, {"rating": 4.0, "stay_parameters": "Stayed March 2006", "text": "POSITIVES", "title": "Murphy's Law", "helpfulness": 9, "user": "jacobian", "date": "April 11, 2006", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "service": 5.0}, "id": 4964171}], "location": {"country": "Caribbean"}, "stars": 3.5, "variance": {"poor": 71, "average": 162, "very good": 439, "terrible": 41, "excellent": 422}, "aka": "Courtyard By Marriott Isla Verde Beach Hotel", "slim_ranking": 0.285714285714, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "description": "Located on a powdery expanse of Isla Verde beach in San Juan, the newly renovated Courtyard by Marriott Isla Verde Beach Resort is the perfect location for business or pleasure. The first hotel in San Juan to offer FREE Internet & wireless services it makes business a breeze! For families, babysitting & play services, game room & the beautiful pool & beach make any holiday perfect."}