{"user_rating": 3.5, "review_count": 144, "name": "Courtyard by Marriott Aguadilla", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with friends", "text": "We went the hotel as part of a Senior Trip with my 12th grade class. Being from PR, we had already seen the hotel and liked it, but this was our first time staying. We checked in on friday quickly, we were at our room in less than 10 minutes. Our room was a bit distant from the lobby, since it was in the other building (connected via a bridge), but there was no noise from the casino/bar (more on that soon). Room is new and very clean and beds are very comfortable. The elevators malfunctioned in our 2nd day, but that night they were fixed.", "title": "Wonderful Senior Trip", "helpfulness": 1, "user": "Gars129", "date": "May 27, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 130706024}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "We ate breakfast buffet at the restaurant (RB), it was very good, lots to choose from. The waiter was especially attent. Only complaint here is that tickets for breakfast should be by person, not by families. We didnt have lunch at the hotel however.The hotel has two pools, one for children, which had an aquatic playground with slides, and one for the adults, which has slightly warmer water, but no slides. Pool is open till late. We saw people in the pool after 9pm.", "title": "Fantastic Fitness Center", "user": "RebeccaMinneapolis", "date": "May 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 129664046}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "The lobby is very nice, has computers, free wifi (you have to ask for the password), tv's, and a Davids Cookies. The casino is very lively , there is live music on weekends, and a bar. There are event facilities as well.", "title": "An Enjoyable Stay", "helpfulness": 1, "user": "cpac9", "date": "May 7, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 129537806}, {"rating": 3.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "Hotel is located less than two minutes from the Aguadilla Airport, but it is an around 10 minute drive from Highway 2 (main route to San Juan and Mayaguez). We choose the hotel because there are lots of beaches and atractions in the Aguadilla area. There is a bowling alley and golf course nearby in the neighborhood, and the University of PR- Aguadilla is right in front of the hotel. This is mainly a quiet residential neighborhood now however. Other nearby atractions are the Ice Skating Rink in downtown Aguadilla and Las Cascadas water park.", "title": "Family hotel", "helpfulness": 1, "user": "Formandy", "date": "May 4, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 129382076}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "Overall, hotel is great. Its the only large hotel in Aguadilla and one of the few ones in the west. It might be a bit noisy for some, but we had a great time.", "title": "Nice comfortable room, friendly staff", "helpfulness": 1, "user": "Carmen G", "date": "April 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 128527987}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "Celebrated my sister's birthday at this hotel. Everything was so nice. Location, staff was very friendly, nice place to eat, rooms were excellent. Their casino was super, live band was outstanding. Then, so close to Ramey's golf course and Crash Boat Beach.", "title": "Wonderful place to stay", "user": "maryanncr", "date": "January 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 123809760}, {"rating": 3.0, "stay_parameters": "Stayed January 2012, traveled with family", "text": "I would ideally like to give it 3 1/2 stars, but since the rating system won't allow it, the hotel gets 3 stars due to my personal experience which many others probably won't have. The hotel is pretty much what you want from a Courtyard but it is in a building that used to be an old military hospital which means the room layouts (at least mine) are not optimal for a hotel. I am in a wheelchair and although I did not specify an accessible room, I have never before had issues with accessibility in the walking space around the bed but this time I could not move around the room at all. Luckily, I could get next to my bed since it was right beside the door. Since I was traveling with my father for just an overnight stay, it wasn't worth switching rooms. I had reserved a 2 bedroom suite and was a bit surprised by the layout. The 1st “bedroom” doesn't have a door and is basically just an adjacent area to the sitting area. The 2nd room has a door (due to be old building, the doors were just wide enough for my chair but not by much) but is very long and narrow with 2 large comfortable beds. The ceilings are incredibly high and the windows are higher than normal which meant I could just barely see out of them, but couldn't look down. The bathroom was very small compared to other Courtyards I have stayed in. Admittedly, an able-bodied person shouldn't have my issues and would probably give the hotel a 4 out of 5.", "title": "Typical Courtyard in an atypical building", "user": "sbenus", "date": "January 28, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 3.0}, "id": 123760776}, {"rating": 4.0, "title": "Fun time", "text": "Other than the room, the staff were courteous and helpful. Check-in and check out went smoothly. We arrived late at night and the restaurant was closing but they let us in and served us. The club sandwich was good. The hotel's furnishing look almost brand-new, well-kept and pretty clean everywhere. The floor was a very nice tile. The Marriott bedding has always been one of my favorites and we slept very well in the comfortable beds. The lobby has a David's Cookies, business center, lounge area with television, and Wi-Fi. The casino is open 24/7 and had live music at the bar. We didn't play but just walked through to check it out.", "user": "Newporter2551", "date": "January 19, 2012", "id": 123332718}, {"rating": 1.0, "stay_parameters": "Stayed December 2011, traveled on business", "text": "The location isn't the best for tourists but then again if you are staying here, it's probably for business, or some other reason other than leisure so it shouldn't affect you much.", "title": "Noisy and uncaring staff", "helpfulness": 1, "user": "srbonilla", "date": "January 17, 2012", "detail_rating": {"service": 1.0, "cleanliness": 5.0, "value": 4.0, "sleep": 1.0, "rooms": 5.0, "location": 5.0}, "id": 123206448}, {"rating": 4.0, "stay_parameters": "Stayed November 2011", "text": "I would probably recommend the hotel to someone if they were looking for a place to stay in the specific town.", "title": "Nice and quiet", "helpfulness": 1, "user": "labeba", "date": "January 11, 2012", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 122947300}, {"rating": 5.0, "stay_parameters": "Stayed March 2012", "text": "I find this Hotel to be very consistent in its excellent, well kept, clean and pleasant place to stay. The staff are well trained and appear very happy to be working there. After a hard day sunning on the beach or enjoying the vista's around the area it is a nice place to return to. The chef is very good and his speciality is one of my favorites..Arroz Mampostiao, which my wife and I usually have with other accompaniments for lunch. They pretty much have the monopoly on upscale Hotels in the area and it's nice to see that they maintain a very high standard.", "title": "A very reliable and consistent Hotel", "helpfulness": 1, "user": "CliveTPR", "date": "March 12, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 126016725}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "I stayed at the Courtyard Aguadilla from February 6th through the 10th on a work related visit. The room was very spacious, clean and the internet service worked very well. The casino was located on-site, and had both slot machines and table games. The hotel is located near a few nice surfing beaches (wilderness, Ocean front, & Boat Wreck beach). I would recommend this hotel if you need to visit this area of PR.", "title": "Large Clean Room at Nice Hotel", "user": "savakirc", "date": "March 9, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 125855664}, {"rating": 4.0, "stay_parameters": "Stayed February 2012", "text": "I realize this used to be a hospital but it still feels like one. The pool is strictly a \"kiddie\" pool. No ambiance. The restaurant is like a Denny's. The whole area will be skipped next time. Don't like staying on a military base.", "title": "Very sterile", "helpfulness": 2, "user": "leisuresusie", "date": "February 29, 2012", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 2.0, "service": 4.0, "rooms": 2.0}, "id": 125413275}, {"rating": 2.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "To be fair, I like Marriott. I can feel confident that the beds will be good and the bedding clean. I currently have Marriott Gold so I was shocked when I checked in today to be given this tiny cramped dark hole and told it was my room. There was less than 5 feet between the wall and the bed on every side. The \"window\" was 5 feet up and had a view of a wall with chipped paint. I went back to the desk and requested a room with a view and was given a room that feels twice the size with a nice view of the pool. I am a little worried about the sound of the waterpark pouring all night.", "title": "Be careful of the room with no view", "helpfulness": 2, "user": "Kelly H", "date": "February 12, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 2.0}, "id": 124494232}, {"rating": 3.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "Living in Aguadilla, we have often gone to the Marriott for dinner and the casino, and once we lost power, we stayed in the hotel...very mediocre...refrigerator was broken, bed was extremely uncomfortable. The resturant is OK....save your money and head out to One Ten Thai or Cocina Creativa...better food and a better price and the service is excellent, in stark contrast to the Marriott. Casino isnt much better, music is always TOO LOUD.", "title": "A condo would be better", "helpfulness": 1, "user": "kim c", "date": "February 7, 2012", "detail_rating": {"service": 1.0, "cleanliness": 2.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 4.0}, "id": 124242443}, {"rating": 2.0, "stay_parameters": "Stayed November 2011, traveled on business", "text": "The place was generally nice but the building is not sound proof which wouldn't be too big of a deal if the pool hours were enforced and there wasn't a regional airport across the street! The food was a joke. There was one dining hall that looked like a Perkins. The other option is to eat at the casino bar where the food is equally atrocious and the bartenders are horrible. I stayed there on business for the Marriot points but next time I am in the Aguadilla area, I will stay at one of the small hotels in Jobos Beach instead.", "title": "LOUD! Everywhere.", "helpfulness": 1, "user": "ICUHEN", "date": "December 29, 2011", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 3.0}, "id": 122239634}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "My husband stayed at the Marriot on 2010 & 2011. We enjoyed the Casino and the pool. The rooms are so sexy and confortable. We enjoy the stay. I recommend it. Eventhough my mother in law lives 10 minutes from the hotel, we really enjoy staying and the privacy.", "title": "Beautiful!!!!!!!!", "helpfulness": 2, "user": "Zoraida A", "date": "December 1, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 121296423}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled solo", "text": "Mr. & Mrs. Luis Gonzalez", "title": "(yawn), it's a Marriot", "helpfulness": 2, "user": "ronbonbfhon", "date": "December 1, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 121292433}, {"rating": 2.0, "stay_parameters": "Stayed November 2011, traveled on business", "text": "This place was very typical for a domestic US hotel, with a little latin flavor. The room was very spacious and comfortable, with a coffee maker and a safe. It has a nice hard wired internet access in the room, as well as WIFI, and computers in the lobby. Everywhere in the hotel was nice, and clean, and all the staff was pleasant and/or professional. I did not eat in the restaurant, too expensive. They have a small casino with a few table games (lost a fast 50 on craps, left). They casino will sell you a drink for a decent price. There is a nice little coffee bar in the lobby, a little pricey of course. My only real complaint is the price, $125 for a single room, allegedly holiday rate. They may try to get you to pay for parking, be sure to question that. There is a big pool area, kids will love it. If you want a cheaper room, EL Faro is right next door, with typical motel type rooms for $75. El faro actually has a nice tiki bar with decent food also. (The some ownership at both hotels)", "title": "Mr. Ruiz... Take some notes !!!!", "helpfulness": 3, "user": "John K", "date": "November 3, 2011", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 2.0, "sleep": 2.0, "rooms": 2.0, "location": 4.0}, "id": 120120315}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled solo", "text": "As a US Foreign Service Officer, I have stayed in millions of hotels. This hotel is located at a former US Air Force Base during the Cold War and this particular hotel was the Base Hospital during those days. The physical facilities are OK. In front of the Hotel we have a US Immigration and Customs Enforcement station. So security at the nearby hotel is a plus and the pool area is a blast for families with kids. However, Mr. Ruiz, ( Manager ) there are certain things to keep in mind. You have an unprofessional staff and is inefficient. No customer service at all. Some of them really couldnt care less. No personnel helping with your luggage, so you will have to carry your own bags to the room and the casino bar is useless. Our staff was very disappointed.", "title": "Very Nice Hotel!", "helpfulness": 2, "user": "hobiecatsailor", "date": "November 1, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 120048642}], "location": {"country": "Caribbean", "city": "Aguadilla"}, "stars": 3, "variance": {"poor": 24, "average": 31, "very good": 44, "terrible": 6, "excellent": 39}, "aka": "Courtyard By Marriott Aguadilla Hotel Aguadilla", "slim_ranking": 0.166666666667}