{"user_rating": 4.0, "review_count": 123, "name": "Courtyard by Marriott Anaheim Buena Park", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled with family", "text": "Our stay at the Courtyard Buena Park was perfect in everyway! Excellent staff and service, beautiful, spacious rooms, and wonderful cooked to order breakfast off the lobby. Breakfast is included with some rates, but not ours. However, the food was great and the price was right! Jill, our server for each breakfast was INCREDIBLE!!!! Not only did she do an outstanding job serving, taking orders, and keeping everything well stocked in the buffet area, but provided a wealth of information on our activities for the day. It was a short 5 min. drive to the Disneyland parking garage from the hotel. We will most definitely stay here again on our next trip to Orange County. Marriott never disappoints and Courtyard at Buena Park is a real winner!", "title": "Perfect!", "helpfulness": 1, "user": "bessiedear", "date": "July 8, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 8077640, "likes": {"liked": "— everything!", "disliked": "— nothing!"}}, {"rating": 2.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "Stayed at this hotel on business/vacation trip July 23-26. The good: Clean rooms, close to Knotts Berry Farm and Disneyland. The bad: Hotel filled with vacationing families and screaming kids in the pool, do not stay here if on business travel. The ugly: Hotel placed a $250 smoking charge on my bill after checkout and never notified me of the charge. I found it on my credit card a week later when I checked the bill. Called the hotel manager and asked her to remove the charge from my bill, she refused. She claimed the maid \"found evidence of smoking in the room after checkout.\" No one smoked in the room during the stay, my girlfriend had a few cigarettes on the outdoor balcony during our stay. Informed the manger of this, she claimed \"the balcony is part of the room.\" What? Had to waste time disputing the charge with my credit card and writing a letter to Marriott Customer Service. In my opinion it's the same thing as if the maid stole $250 out of my wallet during my stay. Hotel management is sleazy and unethical, don't stay here.", "title": "Placed $250 bogus smoking charge on bill after checkout", "helpfulness": 2, "user": "terminator33", "date": "July 6, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 1.0, "cleanliness": 5.0, "value": 2.0, "location": 5.0, "rooms": 4.0}, "id": 8066508}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled with family", "text": "We stayed there from June 15-17 and really enjoyed it. The grounds were nice, room was spacious although a little musty, and the location was great. It was about a 15 minutes walk for us to Knott's, but that was with 4 little kids. Medival Times and Pirates Dinner was right across the street and next door was Burger King, Outback Steakhouse, and Poor Folks Restaurant. We wanted a microwave in our room, requested it at the front desk and it was delivered within minutes. Very helpful staff. If I was planning another visit to Knotts I would definately stay here again.", "title": "Great day at the Courtyard Buena Park", "user": "jewlsoregon", "date": "June 28, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 3.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 8019786, "likes": {"liked": "— Location", "disliked": "— Room a little musty"}}, {"rating": 3.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "My husband and I decided to head down to LA for a long weekend- a much needed one at that. We wanted to keep it on a budget so we cancelled our original reservation at the Hyatt in LA and found this bargin. We paid $85/night which you cant beat- and knowing BP area very well, we decided we'd sacrafice the location (a distance from LA) and stayed at the Courtyard. It's location is ideal for families. It's near Knott's Berry Farm- just down the street, and across the street from Med. Times and a Pirate's Dinner Show. There's a Burger King next door and the Outback- so even though there's no resturaunt in the hotel- there's plenty of choices within walking distance. If you're coming in the area for Disneyland- it's not that far from Anaheim, only about 10 mins on the highway...but if you're coming for Disneyland- I would recommend going to a hotel/motel near the park.", "title": "Weekend Getaway in LA", "helpfulness": 1, "user": "Foodiegrl", "date": "April 24, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "business": 3.0, "cleanliness": 3.0, "rooms": 3.0, "location": 3.0}, "id": 7421211, "likes": {"liked": "— cheap", "disliked": "— close to a busy road/ street noise / just noise in general"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2007, traveled on business", "text": "The hotel features a gym and a hot tub- which are both average at best. They also offer a buffet breakfast for $10/person- features fruit, breads, eggs, bacon, sausage...it's OK...but you could get bfast at BK and be just as satisifed. There's construction in the area, some road work so we were awaken to that our first night there. The hotel rooms are near a busy street, so you hear everything! Cars racing by (we had that wonderful experience since there were a bunch of Mustang owners for some show or cruise)..lucky us, we were awaken the following night to their racing and side showing on the streets around 3 am! And since it was a Marriott Courtyard- all the parking is in front of the rooms- so you hear everyone's car alarm....that was the biggest fault, te road noise, outdoor noise, etc....you can hear everything in the room.", "title": "Fair Marriott Courtyard", "helpfulness": 1, "user": "Catlover4", "date": "January 17, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 6612465}, {"rating": 4.0, "stay_parameters": "Stayed September 2006, traveled on business", "text": "I stayed at this hotel for three nights in Oct in room 241. When I checked in, I told the staff that I need a quiet room so I got it. The room has some minor problems but I could see that they tried hard to make it look and feel good. The high speed internet is a plus at no charge; the king-size bed is reasonably good with a lot of small and heavily used pillows. The room has a mid-sized refrigerator and one bottle of water for $2.50. I used their outdoor heated swimming pool and indoor whirlpool, both are in good condition.", "title": "Nice Place to Stay", "helpfulness": 3, "user": "Steve88", "date": "October 22, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 5983860, "likes": {"liked": "— heated pool, spa and high speed internet", "disliked": "— none"}}], "location": {"country": "United States"}, "stars": 3, "variance": {"poor": 4, "average": 20, "very good": 59, "terrible": 3, "excellent": 37}, "aka": "Courtyard By Marriott Anaheim Buena Park Hotel", "slim_ranking": 0.105263157895}