{"user_rating": 4.0, "review_count": 80, "name": "Courtyard by Marriott Columbia", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "Four of us stayed here as an affordable alternative to the inner harbor during the Orioles/Red Sox series. A quick 20 minute (if that) ride to the inner harbor was very convienient, as the hotel is right off of Rt 95. Only 30 minutes to Washington DC. The hotel was very clean, and we were impressed with the housekeeping service. One day, we didn't leave the room until after 2PM and wasn't expecting housekeeping to visit our room, but when we came back at 9PM, our beds were neatly made, and new toiletries were added to the room. There was 1 couple, one single, and one teen in our room, and the room was large enough to accommodate not only the 2 queen beds, but also a roll-away bed (for the teen) without overcrowding the room. There's a nice indoor pool and jacuzzi that is open until 11PM - which our teen was happy about. Our only complaint was that the AC was in the corner, next to the computer desk, so the airflow was not optimal, and the room got very warm around 3AM. Breakfast was included on Saturday and Sunday. It wasn't anything special, and we skipped it on Sunday so that we could eat on the road to DC. You will definately NOT be at a loss for dining options within a 5 mile radius of the hotel. Our favorite was the Greene Turtle on McGaw Rd. We are planning to stay here again next year when Sox are in town.", "title": "Nice hotel for the price", "helpfulness": 1, "user": "mellifera75", "date": "August 14, 2007", "detail_rating": {"front_desk": 3.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 8418919, "likes": {"liked": "— Location, Value and Service", "disliked": "— AC located in weird spot, indoor pool only"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled with family", "text": "I am always worried about these chain hotels, and reading the reviews didn't really help. But this was a pleasant surprise. The room was a good rate, comfortable (including the bed), and clean. Location is quiet and safe yet near dining and shopping and major roads. Breakfast was good. Cons: We were supposed to have a refridgerator and didn't, so that was annoying. Also the low flush toilet was a pain.", "title": "Better than Expected", "user": "KennyfanFairfaxVA", "date": "June 7, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 7800325, "likes": {"liked": "— Clean and quiet", "disliked": "— No fridge"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2006", "text": "A group of us just stayed for one night at the Courtyard. Staff at check in were friendly and nice. Check in / out was smooth and the staff was very helpful and informative on recommending restaurants in the area.", "title": "Comfy Beds and Pillows at the Courtyard", "helpfulness": 3, "user": "p2travel", "date": "April 24, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 5006871}, {"rating": 3.0, "stay_parameters": "Stayed July 2005, traveled on business", "text": "The rooms were nice and clean and the beds were extremely comfortable. The beds have lots of pillows!", "title": "Hair Dryer Search", "helpfulness": 4, "user": "dave1013", "date": "July 10, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 2.0}, "id": 3654529}], "location": {"country": "United States", "city": "Columbia"}, "stars": 3, "variance": {"poor": 5, "average": 12, "very good": 42, "terrible": 3, "excellent": 18}, "aka": "Courtyard By Marriott Columbia Hotel", "slim_ranking": 0.833333333333, "description": "Courtyard Columbia hotel is located near the Columbia Business Park and in close proximity to Baltimore Washington International Airport (BWI). This suburban Baltimore hotel is convenient to downtown Baltimore; the Baltimore Convention Center, Ravens football stadium, Baltimore Inner Harbor, and Camden Yards. In addition, the Courtyard Columbia hotel is situated between Columbia Pike/Route 29 and Interstate 95, providing easy access to both the University of Maryland and Washington DC. Designed for the business traveler, yet inviting for all, Courtyard Columbia knows what is important to its guests."}