{"user_rating": 3.5, "review_count": 69, "name": "Courtyard New Haven Orange", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "small beds, but room is spacious: kind of a strange combo. Toiletflush sounds like an airplane flush, meaning noisy. we stayed with kids on a ground floor room. Perfect for them because of the pool, but a pin in the !@#$ for us parents: ceilings are made of beams and wood so you hear everything from ' upstairs'. As if an elephant was moving around. I'll bet you have a better sleep if you don't stay at ground floor level.", "title": "noisy room on ground floor, but overall acceptable", "user": "mvm1", "date": "August 21, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 3.0, "value": 4.0, "service": 3.0}, "id": 117027601}, {"rating": 1.0, "stay_parameters": "Stayed July 2011, traveled on business", "text": "Price acceptable, staff was professional and access from I95 is very convenient. Nothing fancy, but good enough for a roundtrip night's stay.", "title": "No Air Conditioning During Heat Wave!", "helpfulness": 2, "user": "MarcusFenix74", "date": "July 30, 2011", "detail_rating": {"cleanliness": 1.0, "sleep": 1.0, "value": 1.0, "service": 1.0}, "id": 116019516}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled on business", "text": "Recently stayed at the Courtyard Marriott in Orange, Connecticut in mid-July (happened to be during an extreme heat wave). I booked a king suite a week in advance.", "title": "Comfortable with petty issues", "helpfulness": 1, "user": "Saffy2", "date": "July 24, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 5.0, "service": 4.0}, "id": 115738478}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled on business", "text": "Upon arrival at the hotel, was informed that BOTH air conditioning units in my room were barely working! I was then forced to choose between a king suite room with no AC or a much smaller room with AC. Why should I be forced into this situation at the very last moment, with no prior notice? Why couldn't the hotel take the room out of service days earlier, work on fixing the AC unit and book me in a king suite with working AC? The room also had a terrible musty smell to it when we walked in to inspect it.", "title": "NICE HOTEL", "user": "buffy2EastOrange", "date": "May 14, 2011", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 108245021}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled with family", "text": "Desk clerk was also very impatient, hurrying me (and my guest) to pick a new room, as new guests were calling for rooms on the phone. Shouldn't I have priority over a new guest, having booked in advance and being given a \"broken\" room? Also had issues with electrical outlets not working.", "title": "Very impressive and close to the highway...", "user": "11travelmom11", "date": "October 7, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 82515849}, {"rating": 4.0, "stay_parameters": "Stayed February 2012", "text": "Late arrival and was quickly checked in. Had a room on a high floor which was clean and spacious. Comfortable bed. Early departure but liked the free newspapers and coffee. Cannot comment on value as was on paid for business travel", "title": "Convenient and clean", "user": "NatsDad", "date": "February 25, 2012", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 3.0, "rooms": 4.0}, "id": 125178502}, {"rating": 3.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "Stayed here for three nights in Early February ... some thoughts", "title": "Not great- just okay", "user": "jvanryn", "date": "February 7, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 2.0, "sleep": 2.0, "rooms": 5.0, "location": 4.0}, "id": 124261238}, {"rating": 3.0, "stay_parameters": "Stayed January 2012, traveled on business", "text": "Good -", "title": "Not impressed", "helpfulness": 1, "user": "khagerty2002", "date": "January 28, 2012", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 2.0, "sleep": 2.0, "rooms": 2.0, "location": 3.0}, "id": 123735154}, {"rating": 2.0, "stay_parameters": "Stayed January 2012, traveled on business", "text": "Had a very nice room (suite)", "title": "Lousy experience!", "helpfulness": 1, "user": "EmilyC123", "date": "January 20, 2012", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 2.0, "rooms": 2.0, "location": 3.0}, "id": 123356549}, {"rating": 3.0, "stay_parameters": "Stayed March 2011, traveled on business", "text": "Easy on/off highway", "title": "Good place", "helpfulness": 2, "user": "Lozio", "date": "December 22, 2011", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 2.0}, "id": 121981382}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled on business", "text": "This was my second stay at the Courtyard and this time I requested a room on the top floor because last time when we were on the ground floor it sounded like elephants lived above us. We were facing outwards towards the I95 but it was still pretty quiet even with the window open. Unfortunately this room still had the same dank smell that our ground floor room had so I kept the window open all the time. The hot water on the 3rd floor takes a little while to get going and then you have to be careful not to adjust too dramatically or else you end up burned or extremely cold. The room servicing was really great, our son's toys would be neatly lined up on the bed and they provided plenty of towels and extra trash bags for us. We stayed for a week and it was really comfortable, I love the fact that the room has a fridge and microwave and good storage in the bathroom. The wireless was ok, we could Skype fairly reliably but it was a little slow.", "title": "Great Stay", "helpfulness": 1, "user": "Saffy2", "date": "December 5, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 121422980}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "This hotel looks like most of the other renovated Courtyards except they missed a few things. All of the furnishings in my room were brand new but the mirror on the closet door was cracked and the sheers covering the windows were torn. The hotel is pretty big and seems to host a lot of visiting college athletic teams. Three teams were there during my visit but there was little indication that they were there except for the large bus parked outside. The hotel was pretty quiet. The location is not too far Route 1, which is filled with shopping, chain restaurants and a couple of diners. It is close to the highway and almost everything you need is no more than a two mile drive.", "title": "Nicely renovated but they missed a few details", "helpfulness": 1, "user": "sevenstates", "date": "October 2, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "location": 4.0, "value": 4.0, "rooms": 4.0}, "id": 118867351}, {"rating": 3.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "Hotel is clean and well located. Very near shopping and lots of restaurants. It is right next door to an Outback Steakhouse and they will deliver to the hotel. Staff is friendly. Very noisy air conditioning which went on every 4 minutes. Also, you can hear people walking above you so I would suggest a room on the 3rd floor.", "title": "Okay experience", "helpfulness": 1, "user": "debs0712", "date": "September 29, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 118739437}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled solo", "text": "The best use of this hotel is a one-night stopover on a long trip. It's close to an Outback Steakhouse and the exit ramp off of I-95, but not much else. I saw one listing that showed a movie theatre nearby but I think that is closed. You will not want to be walking in this neighborhood as there are no sidewalks on the busy streets, and aside from the Outback, nothing to walk to.", "title": "Decent exit-ramp hotel", "helpfulness": 1, "user": "MarkLBoston", "date": "September 9, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 3.0, "value": 4.0, "service": 4.0}, "id": 117857540}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled on business", "text": "The rooms are large and adequately furnished. There's a large flat-screen TV but no real HD channels. The TV lineup is basic motel style with 2 HBO channels and a small, business oriented lineup of basic cable channels. Wifi is fast and free. The lobby has a bar and small restaurant with a basic menu and breakfast in the morning, but I saw few people taking advantage of these fairly expensive services. One of the nicest features here is the individual meeting pods for groups of 4-6 people, each one featuring a TV monitor.", "title": "Property is very nice , and we will stay again", "user": "LoveDC2011", "date": "September 1, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117554939}, {"rating": 3.0, "title": "Fine, if you get a Priceline rate", "text": "The reviewer below who complained about the rooms was exactly right. The AC unit was noisy, and the noise from upstairs was loud. But, we had a decent rate from Priceline, the hotel was close to the Interstate, and we were happy to stumble next door to Outback after a long drive. If all you're looking for is a place to stop over for the night, this place is not unbearable.", "user": "onfire444", "date": "July 19, 2010", "id": 71571185}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled on business", "text": "I came to stay for 4 night stay for a tennis tournament. Everything I requested prior to my stay was given to me (top floor, quiet room). Unfortunately our air conditioning unit was not working properly. The room was clean and the staff was stellar in their concerns and attentiveness. The room was not as cold as I wanted it so when I called, someone came up and told me they thought the unit was working but would have maintenance look at it the next morning. Because of MY schedule, I wasn't around the next day. When I entered my room, it was much warmer and I knew something must be wrong. They said they had a record of my call and would get someone there first thing in the morning. Again, I was gone most of the day and didn't want anyone in my room when I wasn't there. The third night, the room was a sauna. At 11:30 pm they offerred to move us to a different floor, but it was too late. Bottom line: they moved us the next day and comped us two days for our inconvenience. They were truly gracious (Jennifer, Elaine) and the service at the food bar was fabulous. Everyone is friendly, curteous and poltie. I was truly impressed by the hospitality I felt with EVERYONE who worked there. I am a very picky person and I highly recommend this hotel for it's cleanliness, service, hospitality and kindness. I will stay there again anytime I'm in the area. Thank you.", "title": "What an attentive and genuine group of people!", "user": "LeslieG007", "date": "July 1, 2010", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "location": 5.0, "service": 5.0}, "id": 69385023}, {"rating": 4.0, "stay_parameters": "Stayed May 2010, traveled with family", "text": "Not expecting much after a last minute scramble for a room, and this place was very friendly and much better then we expected. Foyer was nicer the rooms, but rooms okay. Nice pool area.", "title": "Surprised us in a good way.", "user": "Simon123", "date": "June 1, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 65992961}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled on business", "text": "We had a storm. After 48 hours I was still without power, heat, hot water, cable, phone, or Internet. It was time to look for a place, any place, to shower, shave, charge batteries, and do e-mail. I looked for a room, any room, but the closest that I could find was this Courtyard thirty miles east. As a frequent traveler, I did not have high expectations of this hotel.", "title": "Shelter from the Storm", "user": "whmurray", "date": "March 19, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 59004966}, {"rating": 1.0, "stay_parameters": "Stayed November 2009, traveled on business", "text": "I was very pleasantly surprised. Warm welcome from the staff, quick check in, amenities, beautiful public space design, seamless wireless Internet, large comfortable room, great in-room coffee. in-room refrigerator and microwave. Popcorn and Haggen-Daz, wine, beer, and lesser necessities on sale in the lobby.", "title": "Don't Do It", "user": "blondeenuff", "date": "November 6, 2009", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "location": 1.0, "service": 3.0, "rooms": 2.0}, "id": 48622084}], "location": {"country": "United States", "city": "Orange"}, "stars": 3, "variance": {"poor": 5, "average": 19, "very good": 24, "terrible": 7, "excellent": 14}, "aka": "Courtyard New Haven Orange Hotel Orange", "slim_ranking": 1.0}