{"user_rating": 4.0, "review_count": 337, "name": "Courtyard by Marriott Atlantic City", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "Family travelling with 3 kids. Lovely new hotel, one block from the beach. Large rooms, plenty of space, mini fridge, coffee maker, large bathroom, comfy beds and pillows. The only thing missing is a pool, but hot tub and gym are really nice. Staff friendly and helpfull, valet parking in and out as you please for 12 $ a day. We really felt our car was in good hands. Losts of restaurants close by. We travel to Atlantic City every summer and this Marriott was by far our best room so far.", "title": "Loved the hotel, away from all the noise but close enough to walk", "user": "tristantarzan", "date": "August 10, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 18825899, "likes": {"liked": "— The large room and bathroom. plenty of space for a family, short walk to the beach (one block)", "disliked": "— Hotel doesn't have a pool"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "I went to the Courtyard Friday, Aug 1st for one night with my fiance. Chose it because 229 was a great rate for AC on a Friday night and I'd rather stay at a non-smoking hotel than a smoky casino.", "title": "Great hotel, kind of Shady area", "user": "perrystreet", "date": "August 7, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 2.0, "rooms": 5.0}, "id": 18719097, "likes": {"liked": "— Great clean new rooms", "disliked": "— location"}}, {"rating": 3.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "The valet was quick and almost overbearing but nice and not too expensive ($12). The check in was a bit slow but the people were nice. Its a new place so I'm assuming they need to get some kinks out.", "title": "Best for budget and basics; but not for everyone", "user": "jcindc", "date": "August 7, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "cleanliness": 5.0, "value": 4.0, "rooms": 3.0, "location": 3.0}, "id": 18706298, "likes": {"liked": "— Price", "disliked": "— On-site amenities"}}, {"rating": 2.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "Room was really nice. I've stayed in a lot of great hotels and this room was top notch. All the amenities you would need. Nice bathroom. There is a decent size gym (for a hotel) with a hot tub. Halls smelled fresh and clean. Lobby is nice. Bed super comfy. It all felt totally new. Much fresher than the Sheridan or Trump Marina where I've stayed before.", "title": "Not until the staff is retrained", "helpfulness": 6, "user": "aemt006", "date": "August 5, 2008", "detail_rating": {"front_desk": 1.0, "business": 3.0, "cleanliness": 4.0, "value": 2.0, "rooms": 2.0, "location": 3.0}, "id": 18659538, "likes": {"liked": "— The valet", "disliked": "— The rest of the hotel"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled on business", "text": "The area is not the best though. Its a little desolate at night. We're in our 30's with no kids so we hopped on the jitney and went down the street to the Knife and Fork, where we had a fantastic dinner (go there if you want great food without the cheeseyness AC can bring). Then we walked back on the boardwalk and to the hotel. The walk from the Boardwalk felt a bit quiet but there were some people around. The strange part was that we walked to the outlets Saturday afternoon and between the hotel and the outlets there were a lot of people looking very strung out and we even passed a two men doing a pretty obvious drug deal. This was not in front of the Marriott but not far. I'm from NYC so this stuff doesn't really phase me but I\"m sure it would bother some people.", "title": "Good Value- Nice & new", "user": "phtessler", "date": "July 7, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 3.0, "rooms": 5.0}, "id": 17615509, "likes": {"liked": "— Suite was very comfortable for family of 4.", "disliked": "— Had to ask for an upgrade because regular room was too small."}}, {"rating": 2.0, "title": "\"not ready for prime time\" motel in dreary Atlantic City", "text": "Stayed recent Sat night with daughter. We usually only go for the day as overnight options are very limited- either very expensive casinos or dumpy motels- but when I saw Marriott had opened a Courtyard decided to try it as usually have good experiences with them. This was the exception. Property just opened, so you can expect some kinks, but not sure these can all be worked out. 1. Location- not good. Property is down S. Carolina Ave, which is not safe at night. Yes you can walk through Resorts, but then you have to still have to walk around an unlit parking lot. OK walk during the day, though. 2. Security- you enter through front where valets are or in back from parking lot with key. It is very easy for someone to follow someone in the back door. Further, there is no visible security in lobby or near elevators, and drunks in the elevator- even early in the evening- can be unpleasant. I did not like the fact solicitors from area restaurants were able to roam the motel and slip menus under doors. It is also a no pet (except service animal) facility and this was not enforced either.3. Housekeeping- ok, Towel quality is poor. I left phone charger in room near coffee pot and called to see if found, and never even got a response back. 4. Reception- not the greatest. Need some training in guest relations, and they also need a concierge. 5. Noise level- could always hear people in the hallways. On the positive side, the manager was very helpful in fixing an internet connection problem and getting us a soda and aspirin and I think he will try to remedy guest concerns. The valets were exceptional- always willing to flag cabs, assist with luggage- these guys would probably make a fortune in Las Vegas for same job. AC itself is a disaster- has gotten worse, not better, over the years despite the shops at the Pier at Ceasers and some upscale restaurants. (Red Square is still great). Be careful with cab drivers- one tried to extort an illegal rate from us, and when we refused, dropped us off on a dark street near the Tropicana. I knew how to get back to the Boardwalk, but not every tourist would have.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "June 2, 2008", "id": 16597738}, {"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "My fiancee and I were the first geusts in the room. It opened the day before. It is a very comfortable bed and very clean. The staff were extremelu helpful and very nice. The hotel is a quick walk to the boardwalk. (I think it took us 2 -3 minutes to get to the boardwalk) The only downside was the breakfast was a-la-cart. I was expecting that to be included. A great experience overall.", "title": "Great Hotel", "helpfulness": 1, "user": "NY_Jayhawk", "date": "May 27, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 16432167, "likes": {"liked": "— It was new!", "disliked": "— Per charge at breakfast"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled solo", "text": "Very nice hotel, very friendly staff. Great whirl pool and gym. Only bad thing was the only way to park there was valet parking at $12. Reasonably priced breakfast. Would stay at the hotel again there again, but dont plan on returning because Atlantic City is an over priced dump that hasn't been updated since the 1980's. If you have been to Vegas before, prepare to be disappionted.", "title": "great hotel", "user": "shaunk2455", "date": "September 4, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 19752623, "likes": {"liked": "— room", "disliked": "— $12 a day valet parking the only option for parking"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2008, traveled with friends", "text": "I stayed at the Courtyard Atlantic City for the weekend 8/22/08 - 8/24/08 with my boyfriend and another couple. It was a great hotel! I was a little nervous about the area after reading previous reviews, but I did not feel unsafe for one second. It is Atlantic City so it's not the nicest area in the world and you should still be smart about walking around late at night, but it's not any less safe than being a few blocks from the boardwalk in any other part of the city.", "title": "Great hotel!", "user": "mau_nj", "date": "August 25, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 19360091, "likes": {"liked": "— Newly opened, the hotel was spotless and everything was perfectly decorated.", "disliked": "— It was a little far from the main area of casinos."}}, {"rating": 4.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "We checked in late on Friday night and went across the street to Atlantic City Bar & Grill‎ for a late dinner. We shared delicious buffalo calamari and then all had dinners and drinks we really enjoyed. Later we checked out the whirlpool in the hotel. I wish the hotel had a pool, but the whirlpool was the next best thing.", "title": "Good value", "user": "Arubalover60", "date": "August 25, 2008", "detail_rating": {"front_desk": 3.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 19345955, "likes": {"liked": "— Price", "disliked": "— Street to get to the boardwalk"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2008, traveled with friends", "text": "The next day we walked to 6ix in Bally's for breakfast. It's not the cheapest breakfast in the area, but it was really, really good. I had the Caribbean french toast which was absolutely delicious ($10). We then went to the beach for the day which is just a few minute's walk from the hotel. Later that night we took a cab to get dinner at Mexico Restaurant on Ventnor (really good food) and then went to some of the casinos. The hotel is closest to the Taj, Resorts and the Show Boat, but the Jitney (a bus that runs around town) is just $2.25/person and you can take that to any of the casinos if you'd like to go a little farther.", "title": "Great Hotel!!!", "user": "BellaMami", "date": "August 24, 2008", "detail_rating": {"cleanliness": 4.0, "front_desk": 5.0, "location": 3.0, "value": 4.0, "rooms": 4.0}, "id": 19300623, "likes": {"liked": "— room", "disliked": "— the location its a bit far from boardwalk"}}, {"rating": 4.0, "title": "LOVED the Courtyard Marriott!!! \"Somewhat Shady Area Though\"", "text": "All in all we had absolutely no complaints about the hotel. It was very clean, very well decorated, the staff was courteous and efficient and the location was really not a problem. We would definitely return!", "helpfulness": 1, "user": "A TripAdvisor user", "date": "August 21, 2008", "id": 19202876}, {"rating": 2.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "After arriving at the hotel one evening, we found several police cars in front and the valet unavailable. We had to find our own parking (in a shady area). When we rode the elevator and got off on our floor the entire floor reeked of marijuana. There were a few people sitting on the floor in the hallway and it was obvious they had been smoking. Our room also smelled like marijuana (smell traveled from the hallway). I called the management and all they said was \"we'll take care of it.\" No one from the Marriott staff called me again or said anything after that. I had to spray my perfume all over the room to remove the awful smell just so that I could sleep. I travel a lot of business and always stay at the Marriott especially so that i can accummulate rewards points, but this Marriott was very shady and attracted really shady characters. I should have known when I saw the many police cars in front! I would not recommend this hotel.", "title": "Ok, but encountered some major problems", "helpfulness": 5, "user": "icechica", "date": "July 7, 2008", "detail_rating": {"front_desk": 3.0, "service": 1.0, "cleanliness": 2.0, "value": 1.0, "rooms": 3.0, "location": 1.0}, "id": 17604524, "likes": {"liked": "— room size was good", "disliked": "— shady area!"}}, {"rating": 3.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "Just returned from a last-minute getaway for the holiday weekend. Here is what my family (2 adults, 10yo, 3 yo) experienced :", "title": "Depends on what you are looking for...............", "user": "shardog", "date": "July 5, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 3.0}, "id": 17564698}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled with friends", "text": "Location: not the best area, but then again, much of Atlantic City is kinda run down. Wouldn't walk to the boardwalk through the back parking lot at night because it is rather desolate, but we felt ok walking on the main streets. Proximity to beach and boardwalk is great, but the actual beach and boardwalk do not seem very family-oriented. We ended up driving 35 minutes to Wildwood NJ and had a FANTASTIC TIME on the very clean beach and fun boardwalk. Ok, back to the hotel itself...", "title": "Great Place to stay in Atlantic City", "helpfulness": 1, "user": "jerzegirl42", "date": "July 4, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 17530967, "likes": {"liked": "— Extremely clean rooms, comfortable beds, no noise"}}, {"rating": 3.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "Structure: front lobby is nice and the rooms. hallways, etc were all very clean and modern (the hotel was just renovated after all). Our room was fine for our quickie trip, but the view was not nice (a run-down bar on a back road behind the hotel), and the walls are pretty thin. The room itself was very clean and the flat-screen tv was nice.", "title": "Good hotel in shady part of town", "helpfulness": 1, "user": "raringvt", "date": "June 25, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 1.0}, "id": 17200379, "likes": {"liked": "— Marriott Consistenty good service, clean hotels.", "disliked": "— It's in the GHETTO! Felt unsafe outside the hotel."}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "Service: this is probably where I give the hotel the highest marks. The valets, servers during breakfast ( btw, pretty good selection and very reasonably priced) , and during check in/out were very pleasant. When we checked in, we were first given a room directly across from the ice machine, then changed (at our request) to a room directly next to the elevators and then changed again(again, at our request) to a room that was further away. These changes were all conducted with a smile and genuine apologies for our trouble.", "title": "Why Pay More?", "helpfulness": 2, "user": "mamaprib", "date": "June 16, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 16979783, "likes": {"liked": "— price, location, staff", "disliked": "— no pool"}}], "location": {"country": "United States"}, "stars": 3, "variance": {"poor": 17, "average": 51, "very good": 151, "terrible": 14, "excellent": 104}, "aka": "Courtyard Atlantic City Hotel Atlantic City", "slim_ranking": 0.0655737704918, "description": "Atlantic City's upscale Courtyard by Marriott® is conveniently located just one block from the Beach and the historic Atlantic City Boardwalk. The hotel's location is ideal for easy access to world famous casinos, fine dining restaurants, shopping and entertainment. Just 12 blocks away enjoy the areas top events and headline entertainment at Boardwalk Hall. If you're here on business you'll be pleased to know the Courtyard Atlantic City is minutes from the Atlantic City Convention Center. Shopping is also in walking distance with The Walk Outlet Shopping Center offering over 100 shops and restaurants. For a more upscale shopping experience The Pier at Caesars and The Quarter at Tropicana are also very close by. When you return to your room you will find comfort in our exclusive our lavish bedding, flat screen HDTV and free internet access. Whether traveling for business or leisure to the Atlantic City area our new Courtyard by Marriott® Atlantic City is the perfect base for all of your activities."}