{"user_rating": 4.0, "review_count": 114, "name": "Courtyard by Marriott Long Island MacArthur Airport", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with friends", "text": "Rooms are clean and wonderful to sleep in. Everyone was very nice and willing to help us in our stay anyway they could!", "title": "Great Service", "user": "Kristen B", "date": "April 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127195133}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "I recently went to this hotel for a business meeting. The conference rooms were great, equipped with all the technology I needed which can be really hard to find at times. The staff was really friendly. I was on the new floor, they recently redesigned their layout on the top floors and it looks outstanding! I have another event at the end of the month, that will include food and I'm excited to see if the food is up to par.", "title": "Great spot for Professionals", "user": "Nelly B", "date": "April 3, 2012", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0}, "id": 127189231}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "What a great hotel, not only for sleeping purposes but great for events! Spacious, & beautiful interior!", "title": "5 star rating", "user": "Jessbluchip", "date": "March 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 126691097}, {"rating": 3.0, "stay_parameters": "Stayed March 2012", "text": "Unfortunately the decor, cleanliness snd odors in this hotel were pretty bad. I will be honest that I tend towards Hilton properties... That said, the HGI up the street is only slightly better than this hotel. It might be the area, IDK. If it weren't for work I wouldn't have been there. The entire hotel needs an update. I gave the place three because the employees were very nice and helpful.", "title": "Ughhh", "user": "stomjoh", "date": "March 9, 2012", "detail_rating": {"cleanliness": 2.0, "value": 3.0, "location": 2.0, "service": 4.0, "rooms": 2.0}, "id": 125868135}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "Very good hotel. Typical Marriott property. Clean, Courteous Staff. Also has 2 restaurants in their parking lot, Red Lobster & Smokey Bones. Hotel was going through a decor upgrade in all their rooms. Rooms are spacious and clean.", "title": "Great Hotel -", "helpfulness": 1, "user": "John R S", "date": "February 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 125391110}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled on business", "text": "I had heard that Marriott Courtyards were getting a makeover (the last time I stayed in one was 2004 in Chattanooga TN), but had not stayed at one until this past month (June 2012). It really was like walking into a New World. First, there are those things that are pretty standard. The parking was accessible and all around the building. There were two restaurants directly across the street and the hotel had what I would call a bistro available for breakfast, lunch and dinner. I decided to try their breakfast one morning and learned that you could eat in house, but they also put together a travel bag for you with breakfast, utensils, and any condiments that you might need. It seems that anyone who works on that main floor has been trained to make Starbucks coffee so even when the folks behind the counter were unavailable, you could still get a latte and have it taste like all the other lattes.", "title": "Better than I expected", "helpfulness": 1, "user": "mmwrussell", "date": "July 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 133876739}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled on business", "text": "The rooms were spacious, comfortable and clean. I know that this hotel had recently had a makeover, but I was still impressed by how fresh smelling and non-dusty things were. The beds were comfortable and the views were wonderful.", "title": "Pleasantly Surprised", "user": "Nikki W", "date": "July 9, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0}, "id": 133849833}, {"rating": 2.0, "stay_parameters": "Stayed June 2012, traveled on business", "text": "I also like that there were two business areas. One area for surfing the net, email, etc. and one area specifically for printing out boarding passes. Great idea and one long overdue.", "title": "Over-rated and over-priced.", "user": "Gourmet1Guy", "date": "June 22, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 2.0, "sleep": 1.0, "rooms": 2.0, "location": 2.0}, "id": 132552097}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "Overall, I enjoyed my stay and would definitely recommend this hotel.", "title": "A great place to stay", "user": "Heather M", "date": "June 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 131864774}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "I recently attended a networking meeting at this hotel and I was pleasantly surprised! The staff was attentive and the breakfast layout was great! I didn't know how much they had to offer to the business community with their meeting space...", "title": "Price and location are great", "helpfulness": 1, "user": "KM66027", "date": "May 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130462844}, {"rating": 3.0, "stay_parameters": "Stayed August 2012, traveled with friends", "text": "What can be said? It lives up to the Courtyard name. It is walking distance to Red Lobster, overlooks the highway, but does not disappoint. The place is clean, the upkeep acceptable. I would stay here again. I will not be actively trying to return.", "title": "A Courtyard's Courtyard", "user": "Highclasslowrent", "date": "August 15, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 2.0}, "id": 137283203}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "We stayed for one night and were impressed by the size of the room. Clean, comfortable, quiet. I also appreciate that this hotel is 100% smoke-free. As always, I wish that the Marriott chain would begin including breakfast in their room rate - that is an important factor in my family choosing a hotel.", "title": "Beautiful!", "user": "Jessica L", "date": "July 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 135693333}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled on business", "text": "I went to a networking event here and it was an awesome experience. The staff was very helpful in directing you to where you needed to go, the conference room was set up very comfortably so people had room to network and weren't cramped and they put out a delicious and generous light fare breakfast. I would gladly come back here for another event or to host one myself.", "title": "Well executed event", "user": "Mary P", "date": "July 26, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 135465905}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled on business", "text": "I hosted a luncheon with a group of colleagues who were traveling from both the east end of the Island and the west. The Courtyard Long Island MacArthur in Ronkonkoma was a great in between meeting spot. The hotel staff was helpful in setting up a shuttle to pick up and drop off guests from the train. The Little Italy Buffet was delicious and well stocked. Meeting rooms were good size and they had a wide variety of room sizes to choose from. The Courtyard also offered a special discounted rate for any of the guests I had who may want to stay the night in the area. It was a great overall experience that I would recommend to anyone hosting such an event. I was pleasantly surprised how smooth and easy the luncheon was to book.", "title": "Smooth and easy booking", "helpfulness": 1, "user": "Jessica B", "date": "July 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 134018189}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled on business", "text": "Stayed here for business for a week. Had a room facing away from the highway and encountered very little noise. The rooms were clean and plenty spacious for a double room. The shower was pretty good as well.", "title": "Normal type of chain hotel- with free Wifi (that gains a star!)", "user": "Mark J", "date": "July 9, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 133911558}, {"rating": 5.0, "title": "Best in Islip", "text": "Best business hotel in Islip / Ronkonkoma - have been there always and will go there always. Happy hour in lobby a plus.", "user": "saiku88", "date": "May 7, 2012", "id": 129540115}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled on business", "text": "Did weekend stay, hotel is newly renovated, so everything is brand new and clean. King room was large, bed comfortable, and was nice having sofa and coffee table for take-out dinner. I will stay here again in future.", "title": "Newly Renovated", "user": "itbetterbeclean", "date": "April 26, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 128647571}, {"rating": 3.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "very average hotel for this area. Bed was comfortable, service was good. I had booked for 3 people but only had 2 towels and the sofa bed was not made up even though I had called the day before. It was made up quickly after I called the front desk. I stayed on a high floor so the construction was not bothersome and the room was recently renovated. There was a lot of noise however from some kind of revival meeting on another floor that started before dawn and went for several hours. The little bistro in the lobby had some nice morning treats.", "title": "fine for a night or two", "helpfulness": 1, "user": "malibumomof7", "date": "April 25, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 128618155}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled on business", "text": "I'm gonna be honest up front. I have been a platinum member in marriott rewards for 12 years. I have gotten tired of the cookie cutter Courtyard. This hotel is different. I was given an upgrade (It is one of the few benefits of the 115 nights a year I give Marriott). The rooms are not your standard Courtyard rooms. They are larger and nicer. Same familiar furnishings though. They even have the usual \"Thai Brothel\" carpeting that Courtyard is using. The room I had in it had 2 TV's in it. The jacuzzi was amazing. It has a high water alarm which I have never seen before and the level they put it on is probably a lttle too low. The lobby is not the usual Courtyard layout. The new Courtyard lobbies are usually smaller so the \"prison orange\" they splash around is a lot. This lobby is nice and spacious. The service was great. The shuttle driver explained the LIRR to me and made me feel comfortable with my virgin experience on the Long Island Rail Road. The service for sure blew me away. New Yorkers are not known for their hospitality. If the staff did not have the usual Amy Fischer accents you expect that is truly authentic Long Island you would think they bus them in. The service could not be better. I saw other reviews on here about upgrades. Four things about that: 1. it doesn't impact most guests, 2:They are not guaranteed at all, 3: They are at the hotel's discretion. 4: Suites area excluded (it says so in all Marriott material, although a hotel would be crazy not to upgrade a platinum member) These are not supposed to be easy to get. They are a reward for your loyalty. I have had the Ritz Carlton upgrade me to a presidential suite as a thank you. I've also had the Fairfield Inn say they can't upgrade me. You don't make guarenteed reservations on something you might get. That is just crazy. This is a different type of Courtyard and a such a nice one. I never would have picked this location. A friend did. It is 45 minutes from my meetings. There is a full service Marriott 10 minutes from their. I will ALWAYS stay here when I come to Long Island.", "title": "How do you not like this place!", "helpfulness": 3, "user": "Richard M", "date": "April 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 128566691}, {"rating": 2.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "I used to like this hotel a lot. Whenever I am on the middle part of the island, I would either stay here or the Hilton Garden Inn a little further down the road. In fact, I stayed at this hotel 4 times in the past month on 4 different occasions. After the last time, I won't be back.", "title": "Won't be back thanks to bad staff treatment", "helpfulness": 1, "user": "AVeryPickyTraveler", "date": "April 10, 2012", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 127624742}], "location": {"country": "United States", "city": "Ronkonkoma"}, "stars": 3, "variance": {"poor": 4, "average": 8, "very good": 42, "terrible": 10, "excellent": 50}, "aka": "Courtyard By Marriott Long Island Macarthur Airport Hotel", "slim_ranking": 0.4}