{"user_rating": 4.5, "review_count": 504, "name": "Courtyard Chicago Downtown/Magnificent Mile", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled on business", "text": "I stayed here 2 nights over a weekend for business. It was a great location close to everything downtown. Their rates were more reasonable then some other hotels. I had some minor problems with the internet access but was able to get what I needed in the business center. The staff was helpful with downtown information. I also got a good pizza recommendation to go to Uno down the block.", "title": "Had a great time. Great Location.", "helpfulness": 3, "user": "AZTrainer", "date": "October 6, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 10046796}, {"rating": 5.0, "title": "Highly recommended!!!", "text": "My husband and I just got back from Chicago last night. I thought I would leave a quick review because before I book a hotel, I read lots of reviews and they help me soo much.", "helpfulness": 5, "user": "Sdallen", "date": "October 1, 2007", "id": 10027634}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "Anyways, the hotel was wonderful. Location! Location! Location! it's a block from Michigan Ave and just close to everything. The attached parking garage was $28.00 for 24hrs with in/out priveleges. Everything was really clean and comfortable. I would definately stay there again!!!", "title": "A Fine Place", "helpfulness": 6, "user": "lemons1", "date": "September 8, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 8677643, "likes": {"liked": "— location", "disliked": "— Very little."}}, {"rating": 5.0, "title": "Very fabulous front desk", "text": "We booked directly through their website, and found the rate as good as or better than the discount sites. Frankly, I think one is treated better that way and more apt to be upgraded. Arrived at the desk ten minutes after the terrible windstorm that came through the last weekend in August, having parked in the garage that is on the lower floors of this building (a very narrow garage; strongly advise not trying it after an evening of drinking...) and were graciously upgraded to one of the little suites when we said we would like a room with - well, a little more room. Good bed, good shower, very clean, very quiet. Affable front desk staff, pleasant doorman. The location is fabulous; this is a great neighborhood for walking. We didn't have dinner reservations, but managed to get into Tru, which is a block and a half north, and for those looking to eat late, they were seating people after 10 p.m., although it is waaaay not a budget eatery. (Very expensive, but delicious and a heaven for dessert lovers.) The garage has in-and-out privileges once you manage the rather odd ticket system included in the $28-a-day price.", "helpfulness": 2, "user": "holamexico", "date": "September 7, 2007", "id": 8672342}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "We had a wall sconce bedside lamp that didn't work, and it was replaced within an hour. Our coffee maker didn't work, although we didn't discover it until 2 days into our stay, and it never did get replaced despite a couple of requests. That's our only quibble. I wish I could find this size room and this kind of rate in New York City. Chicago has gotten more expensive over the years and is closing in on NYC when it comes to hotel and restaurant costs, but this spot offers good value for the money.", "title": "Pretty Nice Hotel- Great Location!", "helpfulness": 5, "user": "angeliz172", "date": "September 5, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 5.0, "rooms": 4.0}, "id": 8661025, "likes": {"liked": "— The Location was Great!", "disliked": "— The room was not exactly what we had expected."}}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled on business", "text": "Excellent Hotel stay Dec 17-21. Excellent service from doorman, Sith. Room equipped with double queen sized beds that were very comfortable. Room attendant very flexible in cleaning times. Room climate control was precise. Iron, board and hair dryer conveniently stored in closet. Only drawback would be internet in room was wired to a very short cord, wireless internet in lobby work area only. Business center in hotel lower lobby fully equipped with 3 computers and printers including a fax machine. Hotel is walking distance to AMC movies 3 blocks, one block off of Michigan Ave and all the excellent department stores. Access to Navy pier, Water tower Plaza, John Hancock Building, Museums all within walking distance.", "title": "Excellent Service", "helpfulness": 1, "user": "mamiya22", "date": "December 27, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 11999780, "likes": {"liked": "— The service and location"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled on business", "text": "Stayed at this hotel for one week. The front desk and concierge people were extremely helpful. The information they gave about restaurants turned out to be spot on. The Viand restaurant in the hotel was reasonably priced and the food was nice. Rooms were clean & large. Asked for a different room when our son came to stay with us and was accomodated within minutes at no extra charge. The fitness center and pool were adequate.", "title": "Excellent, no-hassle service", "helpfulness": 2, "user": "Mtgurel", "date": "December 24, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 11932837, "likes": {"liked": "— The service", "disliked": "— The view"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled with family", "text": "The location was perfect and within walking distance of almost every attraction including the beach. This was our fourth hotel stay in Chicago and we would definitely stay again in this hotel.", "title": "Great Hotel and Location", "helpfulness": 7, "user": "jwachh", "date": "December 22, 2007", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 11894115, "likes": {"liked": "— Size of room and cleanliness", "disliked": "— ?"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled with family", "text": "We recently spent three nights at the Courtyard on Ontario St. We were just 1 block off of Michigan Ave. about halfway between the river and the watertower. What a GREAT LOCATION! We were in easy walking distance of just about everything. We did use a cab to go to the Shedd Aquarium though.", "title": "Clean, quiet, comfortable", "helpfulness": 6, "user": "KirkHarrod", "date": "November 5, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 10619634, "likes": {"liked": "— location", "disliked": "— parking garage is narrow"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled on business", "text": "The hotel was very clean, and our room large and comfortable. I was also very impressed by the friendly and courteous staff. There is a Starbucks right off the lobby which we used daily. We also had good experiences at the nearby Grand Luxe Cafe, Gino's East Pizza and Portillo's. In addition, there is a Trader Joe's within a block or so,which is a great place to pick up bottled water or some snacks at a very reasonable price.", "title": "Great Hotel! The LOCATION is perfect", "helpfulness": 3, "user": "deenad", "date": "November 4, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 10599189, "likes": {"liked": "— Location"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled on business", "text": "This is the second time I've stayed at this hotel for business and think this is a great hotel - staff is very professional and the property and rooms are very clean and well kept. The location is excellent - it is just a block away from the Magnificient mile and close to restaurants and sights.", "title": "Nice hotel, excellent location", "helpfulness": 1, "user": "DaveySF", "date": "April 6, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 14821758, "likes": {"liked": "— Location and Cleaniness and smoke-free property", "disliked": "— Lobby is kind of small"}}, {"rating": 4.0, "title": "If you are looking for location, go there!", "text": "With my stay this time, I noticed this hotel has become a totally smoke-", "helpfulness": 2, "user": "ZorglubWaterloo", "date": "March 24, 2008", "id": 14506627}, {"rating": 4.0, "stay_parameters": "Stayed February 2008, traveled with family", "text": "free hotel - great for us non smokers. For smokers, there is a dedicated area in outside front of the hotel for smoking.", "title": "Wonderful Experience!", "helpfulness": 2, "user": "devandmisc", "date": "February 18, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 13659852, "likes": {"liked": "— Really liked almost everything", "disliked": "— No hot tub in pool area"}}, {"rating": 3.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "This is also one of the few hotels that actually don't bother you or try to enter your room when you place a \"do not disturb\" sign on your door.", "title": "Average", "helpfulness": 2, "user": "Pookerpug", "date": "February 18, 2008", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 5.0, "rooms": 3.0}, "id": 13658053, "likes": {"liked": "— location", "disliked": "— room size and pool size/lack of jacuzzi"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2007", "text": "Overall, great hotel for a reasonable price.", "title": "Great Place! Would Do It Again!", "helpfulness": 1, "user": "1967mom", "date": "December 29, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 12038567, "likes": {"liked": "— Location to all the sights and all the great information given by the staff. Very friendly!"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2007", "text": "My adult daughter and I stayed at this property for four nights. It's moderately priced (for Downtown Chicago). When I travel, I always try to stay in a place that is centrally located and this property certainly fits that description. Just half a block from the Magnificent mile and 5 blocks to the West of the navy pier, the walking distances are very manageable. The red subway line is about 6 blocks away(about 10 minutes) and if you take a bus on Michigan Av to the subway, it's just steps away. The hotel itself is not luxurious but very clean. It has one restaurant/bar that was usually busy and a very helpful concierge & front desk staff. A great feature I loved was 3 computers in the office center for use free of charge, internet & printer included. My only quibble was the room we ordered, a king bed with a sofa bed in a seperate room. There is no door or any kind of covering whatsoever between the \"bedroom\" and the sofa area so opposite sex persons staying in the same room or parents with small children might want to be aware of this. Check with the hotel first if this is important to you. But otherwise, this is a good choice to stay in downtown Chicago if the price is right.", "title": "Wonderful Location", "helpfulness": 2, "user": "SG4prez", "date": "September 3, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 8615387, "likes": {"liked": "— Great location, moderate price", "disliked": "— Room a little small & odd layout"}}, {"rating": 3.0, "stay_parameters": "Stayed August 2007, traveled on business", "text": "This hotel is a block off Michigan Ave so you can't beat the location in downtown Chicago. It is a \"typical\" Marriott Courtyard (that has not been given the update)....hotel furniture, TV on dresser, desk and chair, small bathroom with shower and the sink outside the bathroom. The bed is a bit updated with white sheets but unfortunately, is not the new \"Marriottt bed\".", "title": "Great location and value in downtown Chicago", "helpfulness": 1, "user": "rhkfreespirit", "date": "September 3, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 8614352, "likes": {"liked": "— location in downtown chicago", "disliked": "— typical Courtyard decor....old fashioned, dark and dated"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "The lobby area is updated and the staff very friendly and accommodating.", "title": "Nice hotel, good location", "helpfulness": 3, "user": "jayjaymag", "date": "September 1, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8603815, "likes": {"liked": "— The staff were great.", "disliked": "— the pool was a let down."}}, {"rating": 3.0, "title": "Okay - not The Talbott", "text": "Clean and sufficient for a night's stay with a much lower price per night than other hotels in the area .", "helpfulness": 1, "user": "secnin", "date": "August 14, 2007", "id": 8421565}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "My sister, daughter and I spent two nights here because we snagged tickets to Oprah. We checked in with no problems a bit early at 2 . When we got to our room we realized that the two queen beds would be small for both my adult daughter, my sister and I so we called down to the front desk to request a roll away bed. The front desk informed us that extra beds in the rooms were against code in Chicago and that someone would be up shortly with keys to another room. . About ten minutes later the bell captain came up with our keys and offered to take our luggage to the new room but was gracious when we said we really didn’t need help since we each only had a carry on. The new room had a sofa bed and two queen beds in it on the 22nd floor. It was perfect, large and spacious with a sink outside of the bathroom which is always a plus with three women in one room. We did have to bother the desk twice more for extra towels and to find out the location of the hair dryer and they were quick and courteous. (The hair dryer is in the top shelf of the closet behind the iron.)", "title": "Great Stay - Great Staff", "helpfulness": 2, "user": "gvldiva", "date": "July 26, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8240130, "likes": {"liked": "— Concierge", "disliked": "— Business center computers were too slow"}}], "location": {"country": "United States", "city": "Chicago"}, "stars": 3, "variance": {"poor": 7, "average": 37, "very good": 182, "terrible": 5, "excellent": 273}, "aka": "Courtyard Chicago Downtown/Magnificent Mile Hotel", "slim_ranking": 0.192771084337, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 5.0}, "description": "Experience the grandeur of the Windy City at Courtyard Chicago Downtown Hotel near Magnificent Mile. Enjoy newly renovated lobby and guest rooms with 32\" LCD televisions, full-service amenities, an Art Deco-inspired design and the renowned value and service of a Courtyard. Our Chicago hotel near Magnificent Mile is ideally located, just minutes from the Loop business district, Navy Pier, Lincoln Park Zoo, McCormick Place and premium shopping at Macy's, Tiffany & Co., Nordstrom's, and Neiman Marcus along Chicago's famous Magnificent Mile. Pamper yourself with an indoor pool & fitness facility, a Starbucks Coffee Shop, and an upscale restaurant, as well as over 3,700 square feet of space, nine meeting rooms, on-site catering, and complimentary fiber optic high-speed Internet access. Offering upscale, affordable lodging in the city, we're a leader among Downtown Chicago hotels near Magnificent Mile. Discover the thrill and excitement of the Windy City at the Courtyard by Marriott Chicago Downtown/Magnificent Mile Hotel."}