{"user_rating": 4.0, "review_count": 180, "name": "Courtyard Newark Elizabeth", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "We (2 adults + 2 kids) stayed for one night after an evening transatlantic arrival at EWR.", "title": "Nice hotel near EWR", "user": "fraire", "date": "September 1, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 77861203}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with friends", "text": "The complimentary shuttle to the hotel was quick and efficient, as was check-in, and we were soon tucked up comfortably in our spacious and immaculately clean double queen room . Marriott beds are always great and these were no disappointment.", "title": "Great Hotel for the Price and Location!!", "user": "marcia0222", "date": "August 25, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 76881192}, {"rating": 4.0, "stay_parameters": "Stayed May 2010, traveled with family", "text": "The close proximity to EWR does mean that there is some plane noise, but we (or rather my husband and kids - I'm a really light sleeper) got a good night's sleep regardless, which was important for us before a drive north the next day.", "title": "Good Experience", "user": "DLCATravellers", "date": "June 18, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 67885556}, {"rating": 3.0, "title": "Very convenient for a layover", "text": "Breakfast was a little pricey, but fine, and there is complimentary coffee etc. in the lobby for those just wanting a cup of something hot.", "helpfulness": 1, "user": "lori05", "date": "June 11, 2010", "id": 67194152}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "To sum up, this hotel is an excellent option before or after a flight or even if you've shopped til you dropped at Jersey Gardens Mall opposite.", "title": "fantastic", "user": "sona47", "date": "June 11, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 67185607}, {"rating": 4.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "Positives: Large and newly renovated rooms, friendly and capable staff, nice lobby and relaxing area with internet and printers available, free coffee and tea, free shuttle to airport and outlet mall, outlet mall in walking distance, ruby tuesday restaurant in walking distance - Negatives: Daily trip to NYC takes time, money and good planing.", "title": "Large rooms, good service, friendly atmosphere", "helpfulness": 2, "user": "braun-global", "date": "December 12, 2009", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 51122497}, {"rating": 3.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "We have stayed at this Courtyard several times over the last several years and we have seen all the changes. The lobby changes are very new, sleek and modern. Nice conversation areas, boarding pass printers, departures listed by the elevator. Rooms have been redecorated very nicely. Nice little sofa in our room with new mattress on our king size bed. But, gone are the elements that made it where I liked to stay. Free parking and internet aside (and good prices), the Bistro idea needs to be totally redone, including the continental breakfast. Gone is the omlette station that made it special with the included reasonably priced breakfast. Gone are the nice simple dinners that one could get with a nice glass of wine and enjoy. Gone are the comfortable breakfast tables with plates and cups and glasses of orange juice and endless coffee. Gone with the service are the tips that at least gave the staff an opportunity (if not incentive) to make some extra money and give rudimentary service. The breakfast menu cries out for some decent variations other than just egg scramble. We had a snippy \"Well, you both want coffee and orange juice\" after we gave the waitress our breakfast voucher, a program Marriott has yet to perfect. We not only waited 10 minutes to get waited on at the counter, I had to ask for coffee that should have been offered to me. They offered no glasses for the orange juice, only the bottle out of the cooler, and one cup of coffee (granted Starbucks) with no obvious attempt to refill. To be fair, coffee is still available 24/7 at the coffee bar but I miss real cups and the pot of coffee on the table. If they are trying to cut down on expenses, they have succeeded beyond their wildest dreams. But, I think this microwave and pre-packaged Bistro lacks not only imagination but any kind of consideration for the people they want to attract. Tall tables and bar stools are not good for seniors, children or families. The message: we don't want you. You expect overpriced items in New York (and the Marriott) but this menu pushes the limits of garbage food and poor service.", "title": "Renovation Not Complete", "helpfulness": 3, "user": "BeanOhio", "date": "December 1, 2009", "detail_rating": {"cleanliness": 1.0, "location": 1.0, "service": 5.0}, "id": 50449263}, {"rating": 3.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "My message is that the old Courtyard is gone and it's too bad. Don't look for any kind of service for breakfast or the Bistro itself. Attitude from the staff may result from the fact that I saw no one tip for breakfast, and with the attitude, was not inclined myself to reward such medicore food and service.", "title": "Friendly staff", "helpfulness": 2, "user": "SORCEL", "date": "November 21, 2009", "detail_rating": {"cleanliness": 2.0, "value": 4.0, "location": 3.0, "service": 4.0, "rooms": 4.0}, "id": 49773253}, {"rating": 4.0, "stay_parameters": "Stayed August 2009", "text": "Location for NYC is great! The shuttle can get frustrating when you have pilots and air crew boarding. They get taken to their individual terminals even though the sign on the window in the shuttle bus says it is forbidden by airport poicy to take anyone to terminals. These delays in getting to P4 can delay your entrance into NYC, because the trains from New Jersey Transit are timed every half hour. We just missed a train because we dropped 3 pilots off and a passenger. But, that's part of doing business for everyone. It is a free shuttle.", "title": "Great stay", "user": "wpbdle", "date": "October 12, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 46682807}, {"rating": 1.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "$15 dollars to get into NYC and $15 back. Bargain because you don't have to drive in NYC.", "title": "I'd rather sleep on bench in the airport", "user": "Ronit_Greenberg", "date": "September 30, 2009", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "location": 2.0, "service": 1.0, "rooms": 2.0}, "id": 45478086}, {"rating": 1.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "We stayed one night at this hotel and it was a complete nightmare. Check in was easy. However, the first room we went to the bed was not fully made. It looked like someone took a nap in it. We went back down and told the receptionist and he gave us another room. In the second room the phones were not working, the carbon monoxide was going off and the television remote would not work properly. Now we are on our third room. The room was much bigger but had a problem to, the phones were not working. We had to use our self phones to call the receptionist to bring us towels. Horrible.", "title": "Bad Experience", "helpfulness": 1, "user": "mellemel", "date": "September 16, 2009", "detail_rating": {"cleanliness": 1.0, "value": 2.0, "location": 4.0, "service": 4.0, "rooms": 1.0}, "id": 42265890}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "The rooms are pleasantly decorated but bathroom tiles need updating. It would not be a bad hotel if we had not experience these problems for the price we paid.", "title": "Very good stay", "helpfulness": 2, "user": "bluebells22", "date": "August 29, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 39182311}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled on business", "text": "Pros: Parking and continental breakfast, accomodated disocunt on stay", "title": "cute, clean & comfy beds", "helpfulness": 1, "user": "desertfogz", "date": "July 23, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 35582468}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled on business", "text": "Cons:The hotel reception area going to renovation, telephones not working and remotes not working", "title": "Highly recommended!", "user": "amysa", "date": "July 21, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 35349212}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "We stayed here one night. Airport Shuttle bus took us to the hotel, schedule from P4 is 10past the hour and 20 to the hour. Our room was super, lovely bed and pillows, clean & cool.", "title": "Great hotel, even better service!", "user": "BKR1986", "date": "July 14, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 3.0, "service": 5.0, "rooms": 5.0}, "id": 34748511}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled with family", "text": "I have stayed at this hotel numerous times, most recently for 2 nites in March 2010. The hotel is everything you would expect from a Courtyard - modern lobby, business center, clean rooms and friendly staff. The hotel is located across the NJ Turnpike from the Newark airport so there is the usual airplane noise. There is a Ruby Tuesdays right in front of the hotel and the Jersey Gardens mall across the street.", "title": "Best Value in the Area!", "user": "KLord47", "date": "May 18, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 64483960}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "The only issue we had was that the key card would never work to get us out of the parking lot and we had to buzz the front desk each time to manually open the gate.", "title": "Excellent Staff", "helpfulness": 1, "user": "robsarah1", "date": "March 13, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 58433071}, {"rating": 4.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "Great hotel. Great rates. We would stay here again!", "title": "Exceptional staff", "helpfulness": 1, "user": "BeachLovers9", "date": "February 25, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 57123634}, {"rating": 4.0, "stay_parameters": "Stayed January 2010, traveled with family", "text": "Myself and my husband checked into this hotel after having our flight cancelled due to weather conditions, we weren't expecting much and were just glad we were able to get a room as our flight wouldn't be going for 48hrs! What a surprise we got, from arriving at the hotel we were immediately given outstanding service. They allowed us to check in early and also to check out late - for no extra cost. The manager borrowed me his phone charger as ours were locked in our cases and the reception staff couldn't do enough for us. If ever we are stranded in Newark again we will not hesitate to return to this hotel!!", "title": "Easy for early flight next morning", "helpfulness": 1, "user": "kirra99", "date": "January 23, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 3.0, "rooms": 4.0}, "id": 54195177}, {"rating": 4.0, "title": "Trip to bethel", "text": "Stayed here 2/10 (night of the blizzard) for a flight out of Newark on 2/12. From the time we arrived till we left the next morning, everyone we encounted on the staff was very friendly & helpful. The only negative thing we found were the prices for food, drinks & snack were alot higher; we are from a small rural community so maybe that is expected closer to the city. Driver for shuttle to & from the airport was pleasant & helpful. I would definatly stay at this hotel again.", "user": "sirvojs", "date": "January 21, 2010", "id": 54017267}], "location": {"country": "United States", "city": "Elizabeth"}, "stars": 3, "variance": {"poor": 11, "average": 23, "very good": 82, "terrible": 6, "excellent": 58}, "aka": "Courtyard Newark Elizabeth Hotel Elizabeth", "slim_ranking": 0.333333333333, "description": "Step out of the same old business travel routine when you step inside our Courtyard Elizabeth Hotel near Newark Airport. Perfect for business travelers, this Elizabeth hotel boasts four meeting rooms and a state-of-the-art lobby with inviting, flexible spaces to work or relax in, free Wi-Fi & easy access to the latest news, weather & airport updates via our GoBoard™. The highlight of our lobby is The Bistro - Eat. Drink. Connect.™, which provides guests with healthy food & beverage offerings in the morning and evening dinner service with cocktails. Guests of our Elizabeth hotel can relax in comfort in our contemporary accommodations featuring designer bedding, relax at our indoor pool & whirlpool or workout in our 24-hour fitness center. Our hotel is across from Jersey Gardens Mall and only 15 minutes from Port of Bayonne and the NJ Prudential Center. We are also central to UMDNJ, Rutgers & Kean University. The Courtyard Newark Elizabeth Hotel near Newark, NJ is designed to work the way you do."}