{"user_rating": 4.0, "review_count": 488, "name": "Courtyard by Marriott Washington Convention Center", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "This Courtyard is conveniently located, so we walked practically everywhere. It is across the street from the Smithsonian American Art Museum and the National Portrait Gallery. It is about 3 blocks from the Ford Theater. The Gallery-Chinatown Metro stop is a block away, and there are many restaurants nearby. This area (F St. and 7th St.) is very safe and very lively. As for the hotel itself, our room was clean, comfortable, and quiet (ask for a room away from the vending machines where are very noisy). The service was excellent.", "title": "\"Very Good Location\"", "helpfulness": 1, "user": "ccg20", "date": "September 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 176066527}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "Stayed at the courtyard by Marriott for 3 days recently and absolutely loved it. What a lovely hotel. So close to the national mall, just around the corner from where hop on, hop off bus tour leave, plenty of places to eat nearby and there is a metro stop just up the block as well. The staff were all very friendly, in particular the valets and concierge, the bistro staff and the reception staff. Would definitely recommend this hotel to anyone looking for a central place to stay in DC and would absolutely stay here in the future.", "title": "Great hotel, close to everything", "user": "kismith", "date": "September 4, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 175827927}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "Great place to stay, close to numerous attractions and walking distance to the Mall. We stayed three nights and service was great (with the exception of never having coffee replenished by the coffee maker). The swimming pool is also much smaller than one is let to estimate from the pictures available on the internet.", "title": "Great place to stay", "helpfulness": 1, "user": "Gabriela673", "date": "September 4, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 175706499}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled solo", "text": "I have stayed at the Courtyard Washington Convention Center a few times in the past six months. When in town for leisure, this hotel is my number one choice.", "title": "Best stay in the DC area", "helpfulness": 3, "user": "JuanyDinero", "date": "September 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 175619351}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "The hotel is located close to Chinatown, the Convention Center, Verizon Center, and a few other local attractions. For instance, Ford's Theater is just around the corner, the Spy Museum is about two blocks away, the US Navy Memorial is approximately three blocks away, Archives not that much farther away. Most attractions are within a reasonable walking distance. More importantly, there is a metro stop (Gallery Place / Chinatown - which serves the green, yellow, red lines) less than two blocks away.", "title": "DC trip", "helpfulness": 1, "user": "Seamegmom", "date": "September 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 175500661}, {"rating": 2.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "If you look at my other reviews, you will find that I am a pretty satisfied traveller and usually give really good reviews so that shows what I thought about this hotel.", "title": "Love D.C.! The Courtyard is another story.", "helpfulness": 3, "user": "wrighj9", "date": "February 9, 2011", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 2.0, "sleep": 2.0, "rooms": 3.0, "location": 5.0}, "id": 96019401}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled on business", "text": "First of all the good:", "title": "Nice business hotel in the center of Washington DC", "user": "xyz1999", "date": "January 23, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 94111009}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled with family", "text": "1) Location is excellent. An easy walk to the Chinatown metro station. There are lots of things to do in the general vicinity of the hotel. Ford's theater is about a block or two away.", "title": "Very Welcoming Stay", "user": "Trip333_11", "date": "January 17, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 93458012}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled solo", "text": "2) The bar/restaurant downstairs has pretty good food and is the restaurant serving the room service. All in all, the room service was excellent however a little pricey.", "title": "Great Location and Nice Staff", "user": "NJOY909", "date": "January 11, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 92536595}, {"rating": 4.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "And now the bad:", "title": "Great Hotel, Great Location", "user": "Nate226", "date": "January 1, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 91330358}, {"rating": 3.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "I'm generally satisfied with Courtyard properties, but mismanagement and annoyances prevent me from feeling the same way about this one. General maintenance is lacking. Climate control was not functioning in our room and we had no air conditioning for the first of 3 nights. The door deadbolt lock wouldn’t engage and the TV remote did not work. We moved to a different room the next morning. In this room the sink faucet would not stay on unless on full blast (splashes clothing). Every morning our room/elevator key cards stopped working and we had to visit the front desk to have them reactivated. We had purchased a room with daily breakfast and upon check-in the clerk failed to acknowledge that or give meal tickets. I’m guilty of forgetting that breakfast was included given that reservations were made 6 months in advance; however the hotel should not have to be reminded. We had breakfast only 2 of the 3 mornings. On day 3 the kitchen was not staffed properly per the rooms that had been rented and the breakfast line was terrible. The location is excellent. Outside of the maintenance issues, the room was adequate although there was only one chair provided for two guests. Overall I feel this could be a good property if they overhaul management and catch up on maintenance.", "title": "Mismanaged - Requires Change", "helpfulness": 3, "user": "kekeman", "date": "June 1, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 3.0, "service": 2.0}, "id": 110950935}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "I live in Washington, DC and was looking for a reasonably-priced, centrally-located hotel to put up my sister and her husband for a weekend visit focused on Lincoln and Ford's Theatre. My brother-in-law also happens to be a banker, so the fact that this hotel is in a retro-fitted former bank building fit the bill. They and I could not have been happier with the choice. First off, the location could not be better, just a block's walk from Ford's Theatre and across 9th Street from the Smithsonian's National Portrait Gallery and Museum of American Art in the historic Pension Building--my favorite Smithsonian museum. Other sites, like the Spy Museum, the Verizon Center sports arena and the Shakespeare Theatre's two houses, are immediately nearby, as are two metro stations--Gallery Place and Metro Center. There is also an abundance of quality Penn-Quarter restaurants in the vicinity. The hotel has retained the high-ceiling/marble column grandeur of its former status as a prestige bank building. The rooms are small but cozy, and my picky family members reported that the bed was extremely comfortable. Most of all, the staff was among the friendliest and most helpful we have encountered in any hotel. (For a hotel in this price range that appeals to tourists, friendliness is sometimes in short supply.) My guests had a top-floor room facing the back, which meant that there was not much of a view, but they avoided the noise of both 9th and F Streets, which can be very loud, especially on weekends. We had one meal at the popular Gordon Biersch restaurant on the ground floor, and we found the food to be mediocre, despite the bustling crowds. Valet parking is available at the F Street entrance, which is great whether or not you plan to use your car in the city. We were happy to leave the car for the weekend and depend solely on walking or public transportation and taxis.", "title": "Put up family here for a weekend visit with great results", "user": "Ingmar53", "date": "May 29, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 110372079}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "We stayed here for three nights and had a wonderful time. The staff provided perfect service; friendly and very approachable.", "title": "A wonderful stay", "user": "NoraKate", "date": "April 22, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 104979218}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled with family", "text": "When we checked in I mentioned our number one concern was for a room in a quiet locaton. We were given one away from the elevator and didn't hear anyone or thing while we were there.", "title": "Excellent Hotel. Best Overall Marriott I've Been to Ever!", "helpfulness": 4, "user": "Liz98765", "date": "April 21, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 104911035}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled with family", "text": "The room had a small refrigerator and flat screen TV.", "title": "Courtyard Marriott Convention Center outstanding service", "helpfulness": 1, "user": "patnorthcarolina", "date": "April 10, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 103486143}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled with family", "text": "We were pleasantly surprised by almost every aspect of this hotel. Most importantly, the staff was really accommodating, putting us in a room with a sofa sleeper and delivering a crib for no extra charge so the whole family could fit in the one room we booked. The room was not huge but definitely larger than average for DC. The building is very elegant and the lobby was much more luxurious than most Courtyards - the room decor is not modern but also not bad. The pool was smallish but kept warm, and this is a rare resource for a DC hotel especially at this price level - we really appreciated it. The one gripe for me is the mandatory $32 valet parking charge - you can find slightly cheaper options in the neighborhood. But the location is truly \"perfect\" - you're across the street from the Portrait Gallery, you can easily walk to the mall (most DC hotels in this \"zone\" are much farther), and you are less than 5 minutes walking distance to all 5 DC Metro lines, so you can get anywhere fast!", "title": "Great Experience for My Family", "user": "Pearl_Yonick", "date": "November 19, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 87571400}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled with family", "text": "We arrived early about 10am I didn’t expect a room to be ready they did offer me a standard room immediately but offered an upgrade which would be ready later. We were heading out sightseeing so left our luggage with the bell boy and headed out. Just before we headed out we were given Poker chips which entitled us to free frozen yogurts at a place just round the corner. They were amazing and just the ticket after a drive.", "title": "Great friendly staff, fantastic location", "helpfulness": 1, "user": "GlenElgin", "date": "November 8, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 86447958}, {"rating": 4.0, "stay_parameters": "Stayed November 2010, traveled on business", "text": "We returned later and were given an upgraded room as promised. The rooms are not very large but were in good order and clean. My wife and son used the pool (large bath) it was a little on the small side and they didn’t stay long. We were given breakfast vouchers for the duration of the stay which was nice as we didn’t ask for them. The new style courtyard eatery was pleasant and everything was freshly cooked.", "title": "Will stay again", "user": "earthtravlr", "date": "November 7, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 86221544}, {"rating": 5.0, "title": "Warm, friendly, extremely helpful staff. Great location", "text": "Overall the stay was very good, the staff were very professional (they always addressed me by name even when we were just passing through the lobby.) Yes the rooms are smaller than normal and the pool is tiny but you’re in the heart of DC and there is so much to see and do who needs a pool. If you want a friendly hotel in the heart of the city this is the place.", "user": "msamh", "date": "October 20, 2010", "id": 84245779}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "Great hotel and location, was 3 blocks from all the museums on the mall. Easy check in, polite and helpful staf. Comfy bed and room. Small bathroom didn't quite match the suite I was in however. I had a sitting room and a bedroom with a king bed, but the bathroom was small and didn't make sense architecturaly, functional but oddly small for the size room I had. Had a great resturant in the lobby and was was located close to other resturants.", "title": "The Courtyard Marriot in DC is beautiful", "user": "delilah528", "date": "October 15, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 83632387}, {"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled solo", "text": "For some reason, Marriott loves to turn old banks and office buildings into Courtyards. Well, this is a typical Courtyard. My room was spotless, had fast wi-fi and an average bathroom and sink area. It was nice to have a mini-fridge (emphasis on the mini, however) in the room, which is often missing in hotels at this level. I did find the duvet situation a bit odd -- it was a duvet with a sheet on top, but just bare duvet on the bottom. I hope this means that they wash and change the duvet for every guest? Regardless, it felt a bit odd to me, as a European-style duvet should be entirely covered. Staff were all very friendly. Steps to Gallery Place/Chinatown Metro, which has access to both green/yellow and red lines -- two stops from Union Station. Just three short blocks from Metro Center. Got a Priceline (bidding) weekend rate of $63/night, which I thought was very good value.", "title": "Friendly staff, good location, clean rooms", "user": "travelwiz13", "date": "October 2, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 179457136}, {"rating": 3.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "My husband and I stayed here for a long Labor Day Weekend. The location is excellent - close to many of the most popular Smithsonian museums - Natural Science and American History, among others. It is literally around the corner from the National Portrait Gallery and Spy Museums. The hotel itself felt a bit run down though our room itself was fine. As others have noted elsewhere, it is housed in an old bank which leads to something of an awkward layout. In addition, while we were there, there were issues with the elevators so service was slow. The morning buffet was pricey and underwhelming. That said, I would stay here again, if the price was right.", "title": "Nice location, close to many of the DC sites", "user": "smokeytx", "date": "September 29, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 179111665}, {"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled with family", "text": "Nice accomodations. Clean. Friendly and helpful staff. Breakfast was very good. Within walking dustance to all the sites. Parking was a bit expensive, but we found a place around the corner that was cheaper.", "title": "great location, nice", "user": "squitty1", "date": "September 25, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 178621568}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled on business", "text": "I have spent a weekend during my business weeks. Hotel is perfectly located. Close to everything and with metro stop almost infront of the main entrance. You can do the walking tour directly from the hotel and reach all major attractions in the range of 15 minutes walk.", "title": "Good location,good value, nice rooms", "user": "George1133", "date": "September 21, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 178041864}, {"rating": 3.0, "title": "Dumpy", "text": "Othervise hotel is nothing special, but it gives to you comfortable rooms, nice pub near to the lobby and bargine price.", "helpfulness": 1, "user": "roadwarrierMD", "date": "September 21, 2013", "id": 177999848}, {"rating": 5.0, "title": "The staff is very hospitable and welcoming.", "text": "Every member of the hotel staff was genuinely friendly and warm. Everyone was smiling! The hotel itself was very clean. The bathrooms, bedroom, halls, lobby, workout room, meeting rooms and breakfast area extremely clean. Had a wonderful stay while attending a family wedding this past weekend.", "helpfulness": 2, "user": "Onesowner", "date": "September 2, 2013", "id": 175361357}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "Great location, close to mall. Front desk, concierge, and valet all very friendly, efficient and helpful. Had suite, it was roomy and clean. Not much of a view but hey you can walk to everything. Ellas pizza a block away was excellent. Pool small but 10 year old daughter loved it after a day of touring.", "title": "Dc family vacation", "helpfulness": 2, "user": "Kent R", "date": "August 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 174745331}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "After 6 hours of driving, to pull into the front of this hotel and be greeted which such helpful, friendly people was a delight. It was the evening after the 50th anniversary of the March on Washington and although I am sure the staff at the hotel had been super busy all day, they took their time helping us organize our packed car before they took it away. Checking in we were offered a room more suited to our needs, 2 adult and 2 children, then the one I had reserved online. The concierge, who's name I can't recall, was so helpful with certain questions I had and very friendly also. The next morning, although we checked out early, they kept our car for us while we walked around. As we left for our 6 hour journey home, one of the bellman offered us all cold waters for the drive. Definitely a nice touch. The location is great, just check out Marriott's website.", "title": "The Friendliest Staff in an Awesome Location", "helpfulness": 2, "user": "willa66", "date": "August 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 174330172}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled solo", "text": "The Courtyard Marriott Convention Center in Washington, DC provided me with 2 glorious days of comfort and closeness to the National Mall. It was my first visit finally to Washington, DC. Marriott offers luxury for an affordable price.", "title": "Comfort at Courtyard Marriott Convention Center", "helpfulness": 1, "user": "DSuarez0802", "date": "August 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 174234954}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "My family enjoyed our trip to DC - we saw all the museums and monuments. This hotel is located in a great place and close to the metro so we could get around town with ease. The rooms are nice and price is comparable with other hotels in the area. The staff was courteous and it was an overall nice place.", "title": "Nice hotel!", "helpfulness": 1, "user": "Laurie P", "date": "August 26, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 174114310}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled with friends", "text": "My friends and I stayed here in order to run the RnR Marathon in March, 2013. We got a deal on the price through the event website and were very happy with our choice of hotels. We were centrally located; within walking distance of the White House. The rooms were nice and clean and there was a McCormick & Schmick's downstairs that we found to be very convenient; Especially on the night we arrived (during happy hour) and after our race (we ate and then went to bed for a few hours). The building is an old bank building - very \"DC\".", "title": "Nice hotel - Good value", "user": "Julie D", "date": "September 11, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 176808168}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "My wife and I stayed here for an overnight getaway, and we're glad we did. The location is great as long as you can do some walking. Lots of things to see right around the hotel, and not a bad walk to the National Mall area. (highly recommend Ford's Theatre....literally half way around the block) We went with a Living Social deal, which turned out to be quite a deal. It included valet parking ($38), hot buffet breakfast ($28) and a bottle of wine ($30).", "title": "Great Location", "helpfulness": 1, "user": "mike b", "date": "September 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 176446325}, {"rating": 5.0, "stay_parameters": "Stayed September 2013", "text": "The hotel is clearly older, but seems to have been redone to maintain a lot of its character. Our room was very comfortable and the bed was great. The service was great, from check in, to baggage handling, valet parking and room service. Everyone was very nice and helpful. We can't wait to do another overnight to DC and will definitely consider staying at Marriott again.", "title": "Great value for money", "user": "Vandalski", "date": "September 7, 2013", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 176231444}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "Good location, clean and specious rooms, good wifi coverage, excellent stay during my first visit to DC. Highly recommended to anyone visiting the city. Only the trip to Dulles airport surprised me and we missed our flight. Very costly mistake. Had no idea how unreliable a bus service can be", "title": "Weekend in DC", "helpfulness": 1, "user": "hammelburg", "date": "September 7, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 176152471}, {"rating": 5.0, "title": "Great location!", "text": "Weekend tariffs so that made us (tourists) go to this hotel. Next time again. The room was just perfect for us; clean (and a little bit small). The location was perfect. Next to the Smithsonian American Art Museum, between the Whitehouse and the Capitol and next to a place with delicious pizza's. Perfect weekend in DC!", "helpfulness": 3, "user": "Jason T", "date": "September 6, 2013", "id": 176109449}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "The Courtyard is in a great location for exploring the sights of DC! Check-in was a breeze and our room was very comfortable and clean. The bed was fantastic and the floor (4th) was quiet. Valet and Bell staff were very friendly. Hotel is convenient to so much: Interntnl Spy Museum, Smithsonian American Art & National Portrait Gallery, Verizon Center, Ford's Theater, The National Mall, White House, etc. China Town is two blocks away and there are lots of restaurants on 7th St. Zola is great for fancy cocktails (next to Spy Museum). Highly recommend Courtyard and would return without a doubt!", "title": "Great stay at the Courtyard!", "user": "Love2Travel004", "date": "April 8, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 103257189}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled with family", "text": "This is such a find. We were greeted at the front desk with complimentary wine, cheese, stew, fresh fruit. We were offered free bottled water from their bar. The room was spacious, recently remodeled. The breakfast area was very stylish and hip, food was excellent. The swimming pool was small, but there was a swimming pool (not common in Washington) which the kids enjoyed. Excellent location, great restaurants around. We probably got lucky at $200 a night including breakfast. We found this was such a wondeful hotel, staff was really friendly. We LOVED it!", "title": "What a wonderful hotel!", "user": "Enilec", "date": "April 5, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 102854990}, {"rating": 3.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "Usually we can find great deals in DC but this time rooms were running extraordinarily high. We were going to a concert at the Verizon Center so proximity to this location was key. As members of Marriott rewards, we decided to use our points instead of parting with a fistful of cash at another property. We were really disappointed that the full service Marriott got such poor ratings so we chose the Courtyard since it faired better.", "title": "A mixed bag", "helpfulness": 2, "user": "6tareg", "date": "March 10, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 99696254}, {"rating": 5.0, "stay_parameters": "Stayed February 2011", "text": "The locale was outstanding. Some great restaurants around and very close to The Mall. I liked the fact that the building that now housed this hotel used to be a bank. Nice architectural details could be found throughout.", "title": "Great location & comfortable rooms.", "helpfulness": 1, "user": "mrspeddle", "date": "February 21, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 97519435}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "Door and desk service were swift and courteous. I was hopeful at this point until I pressed the elevator button. As the doors opened I was scared to step inside. We thought it was a freight elevator since it was draped in big swatches of dirty fabric. With trepidation we entered and pressed our floor number.", "title": "A Quick Getaway", "user": "AuntAnnie", "date": "February 14, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 96645519}], "location": {"country": "United States", "city": "Washington DC"}, "stars": 3.5, "variance": {"poor": 22, "average": 65, "very good": 171, "terrible": 10, "excellent": 220}, "aka": "Courtyard By Marriott Washington Hotel Washington Dc", "slim_ranking": 0.263565891473, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.0, "location": 5.0}}