{"user_rating": 4.5, "review_count": 193, "name": "Courtyard by Marriott Bangor", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled on business", "text": "Very nice concept for Courtyard. This new property contains a bistro, where you can order breakfast or dinner and drinks. The lobby is extra spacious and well appointed, has specific work areas, free printing of boarding passes, and computer access. We very much enjoyed our stay. The room was clean and the bed super comfy. The only items worthy of complaint/comment are: The screwed up parking lot, where an island of plantings separate parking from the front door -- you have to drag suitcases down a little muddy gully and back up to the other side -- what an oversight of design on a brand new property! Also, the dusty flower arrangement on the shelf by the armoir, and the lack of appropriate lighting in the bathroom.", "title": "Gorgeous Property, Great Staff", "user": "deputysher", "date": "November 2, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 85794865}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "This hotel is off the beaten path, but near the Bangor Mall as well as the Sam's club.", "title": "Very modern look, close to shopping!", "user": "Loves_Snorkeling", "date": "September 9, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 1.0, "sleep": 3.0, "rooms": 5.0, "location": 3.0}, "id": 78939237}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "I was very impressed with the look of the hotel. It was decorated very modern. My only negative is that the breakfast is not included in the price. There is however an on-site restaurant for dinner or breakfast.", "title": "Amazing spotless perfect hotel!!!", "user": "deerislander772", "date": "August 21, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 76228517}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "The price for their rooms is a little higher then what I am used too. All in all I was very satisfied with our stay.", "title": "Huge room; great lobby", "user": "VirginiaSusieQ", "date": "August 10, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 74691366}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "The Courtyard Marriot hotel in Bangor is an amazing place. I really can't even think of a bad comment about this hotel. The pool at the hotel is a beautiful saltwater pool and the hot tub is also very nice. The staff were very friendly. It has very nice modern decor and it is SPOTLESS. The price does look high at first glance, but this hotel is worth every penny. I would suggest this hotel to anybody that likes a nice, modern, clean hotel.", "title": "Outstanding Courtyard", "user": "DrAnn", "date": "August 5, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 73959564}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled on business", "text": "Wow, I was really blown away by how much different this hotel was from the Courtyard I was expecting. This is a totally modern hotel with great furnishings and comfortable bed, fresh decor, and great breakfast options. The staff was really excellent and the room (even the minfridge) was spotless.", "title": "Totally surprised--GOOD SURPRISE", "user": "bigtrvlr", "date": "June 9, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 67025477}, {"rating": 4.0, "stay_parameters": "Stayed May 2010, traveled on business", "text": "I was assigned a room near a colleague (as we requested) but was hesitant to stay in the room because it faced the interstate, but the lady at the front desk mentioned that if it was any problem at all, she'd gladly send keys to another room. In fact, I didn't hear a thing! Great windows?", "title": "Excellent Property, just not easy to find", "user": "DownSouthUS", "date": "June 3, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 66378676}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "I really felt like I was NOT in a typical Courtyard. Keep up the good work!", "title": "Swanky Stay in Bangor", "user": "libertylovers", "date": "May 22, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 65024817}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled on business", "text": "Hotel is new and reflects the latest in Marriott Courtyard designs. Everything worked.", "title": "I came back and it was still great!", "user": "RRSAMIC", "date": "May 12, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 64001119}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled with family", "text": "Not particularly easy to locate .. seems to be at the end of a road. . but once you are there it is great.", "title": "Nice, new, modern hotel", "user": "Melrosetravelmom", "date": "April 25, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 62427792}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "We were making a quick stop in Bangor on our trip to Prospect Harbor and were pleased to be greeted at this inviting new Marriott property located just off the main road connecting to the Bangor Mall. They have a small Starbucks coffee and snack concession located opposite the registration area and a very comfortable/tastefully decorated lobby area. We were pleased and will be back again.", "title": "Pleasant, Quiet Location", "user": "Bob R", "date": "April 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 157773868}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "Very nice and friendly staff from the moment we walked in. It was a quick trip to Bangor to visit my daughter after she had surgery. We got in late and left early the next morning but we were very happy with our stay. We have stayed in many hotels in the area over the years and Courtyard is on the top of our list for the next visit!!! Only one comment would by parking. There is parking close to entrance, but if that is full you have to park on the other side of a long ditch with a wooden rail type fence. There is no walkway across so you have to carry your luggage all the way around the parking lot. If we weren't so tired from the drive and the cold evening it might not have been a big deal just inconvenient.", "title": "very nice one night stay", "user": "Carrolnsteve", "date": "April 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 157104538}, {"rating": 2.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "This is the worst place for noise that I have stayed in .Both my husband and I did not sleep at all that night.The noise seem to come from upstairs above our room ,we had room 208.I was very disappointing since it was my first stay at Courtyard, I was expecting more.The room was really nice and clean.", "title": "Very Noizy", "user": "Gilles C", "date": "April 8, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 2.0}, "id": 157052946}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "We stayed 2 nights over Easter weekend, very comfortable, clean, great staff. We will certainly stay here again! Large rooms with a couch. Close to shopping, but in a very quiet area. Beautiful pool, great food, all was great.", "title": "Best place to stay in Bangor", "user": "Nicole B", "date": "April 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 156544703}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "Another enjoyable stay at the Courtyard Marriott. The staff is always very friendly and helpful. We booked a suite, which is very spacious. There is a microwave and fridge as well as a pull out sofa to provide more sleeping area. The pool, whirlpool and fitness room are fun.", "title": "Everything our family of four could ask for...", "user": "SherT", "date": "March 31, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 156194485}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "The hotel room and lobby was spotless. The staff was friendly and helpful. Great coffee was available 24/7. I would return to this hotel when staying in Bangor. We got a great price using Priceline. Friends we traveled with thought this hotel was much nicer and we paid half of what they paid. The only drawback to this hotel is the location. It's down a dark road next to a empty factory with graffiti.", "title": "Excellent hotel in Bangor Maine", "user": "S C", "date": "June 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 164206776}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "Recently stayed here on a trip to Maine for a wedding. After an exhausing drive (we're from NY) it was a delight to see such a beautiful hotel. My husband researched hotels in the area and decided on this one based on price, and trip advisor comments and I couldn't have been happier.", "title": "Above expectations!", "user": "MrsKnicki", "date": "June 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 163631178}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "Hotel: A fresh, modern hotel in Bangor, within 2 minutes of the local mall, gas stations, grocery stores, etc. We were greeted at the front desk and were able to check into our room quickly.", "title": "NO Airport shuttle--but nice hotel", "user": "HiHo143", "date": "June 10, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 3.0}, "id": 163627029}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "Our room: Beautiful king bed room. Really liked the modern and clean look. Everything was obliviously updated recently. Crisp white sheets, small couch/fold out bed, coffee tables, a cool movable desk w/ extra table and flat screen tv. Bathroom was clean and roomy with a huge shower/tub. Views of the back courtyard with gazebo and seating. I'm a pretty light sleeper and had no issues with sound either from the hallways or outside at night, a very quiet neighborhood.", "title": "Very good choice.", "helpfulness": 1, "user": "SMH71", "date": "June 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 162938619}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "Amentities: The hotel had all you needed and more. Cafe/bar in the lobby was a great place to grab breakfast in the morning that was quick, adordable, and tasty. We even got late night munchies there (I recommend the BBQ flatbread) with drinks. A nice crowd at the bar and really nice cafe staff to chat with. Starbucks coffee in the morning, meant I didn't even have to go out for that, had some extra time to get ready! Multiple computers with printers if you needed to get work done and plenty of room to spread out. Large screen tv in the lobby area with a sectional if you had a large group of friends or the game was on. Pool was clean and surprisingly empty for a weekend! Hot tub was awesome, and again empty. Workout room, laundry all in the same area.", "title": "Bangor's best!", "user": "sshs3", "date": "June 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 162756307}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "This hotel was way beyond the norm, from the Starbucks cappuccino's in the lobby to the incredibly good breakfasts. The staff was really friendly and the whole layout of the hotel and lobby was a real surprise to me. Marriot has raised the performance level several notches with this one.", "title": "Absolutely excellent!", "user": "willisjw", "date": "July 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 167833795}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "Love the location of this hotel. The decor and cleanliness is outstanding. My check in took less then 60 seconds as everything was ready for me as soon as I gave my name. The private courtyard is beautiful and the grounds are well kept.", "title": "Love this hotel", "user": "Zacharysmimi", "date": "July 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 167035241}, {"rating": 4.0, "stay_parameters": "Stayed July 2013", "text": "My husband and I stayed one night here while he was traveling for work. The room we stayed in was a king bedroom. The room was exceptionally clean and bright and spacious. The bed was very comfortable although the pillows are not very comfortable as they are flat and small. The linens in the bathroom were great and so were the bed linens. The bathroom is beautiful and very spacious and modern. Air conditioner works perfect. The lobby also is very unique and modern, I loved the atmosphere and colors. The front reception upon check in was swift, friendly and very accommodating. There was also an outdoor garden/courtyard area that is beautiful and looks very inviting. In the lobby breakfast area are little pods with televisions which would be wonderful with children during breakfast meals. The only two drawbacks were the pool is very small so if I had my children it would be disappointing to them. Also I was quite surprised to see that although the breakfast area is nice, you have to PAY for breakfast. It was only my husband and I so it was inexpensive; however if I were traveling with my children I would have been shocked. I am used to courtyard Marriots being continental breakfast free of charge. I feel unless it is a full fledge restaurant on site that we should not have to pay for breakfast on top of hotel fees. The staff at the breakfast bar were not very friendly, unlike the front desk staff who were very friendly. Also at 8am they were out a few things on their limited menu. I would definitely stay here again if it were just my husband and i, because of the beauty and cleanliness of the hotel. I would not stay if traveling with my children, due to the small pool and the breakfast not being continental free.", "title": "Clean and Modern", "user": "Sue R", "date": "July 9, 2013", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 166902657}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled with friends", "text": "The staff was friendly, informative about the area, and helpful with maps and directions. Conveniently located near shopping, but not on a main drag that gets a lot of noise. Hotel restaurant offered a good variety of foods for the weary traveller's first night in town. Did not use the spa- not even sure if they had one on site, but the exercise room was a welcome sight for the end of a long day to work out a few kinks.", "title": "Good choice and will use this hotel again", "user": "GoliadNomad", "date": "July 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 166026434}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled solo", "text": "I reserved the room at a ridiculously low price through Priceline. Close parking is limited. Check in was very friendly and very efficient. I was given a room on the second floor right next to the elevator and the ice machine was a few doors down. The Ice machine was one of the noisiest I have ever heard. The room itself was very nice and spacious. One of the lampshades next to the bed was in a little disrepair and cracked. A hotel of that quality could very easily replace the broken lamp shade. I was a little concerned being right next to the elevator but there no evening noise at all. First thing in the morning was a completely different story. It sounded like Grand Central Station outside my room. The house keeper was very loud with her good mornings. Even though check out was noon she started knocking on doors well before that. It gave me the impression she was giving guests unwanted wake up calls. I would have given the hotel a rating of five but the noise detracted from the quality of this Marriott. Stay away from room 211.", "title": "Very, very nice", "user": "NanaP155", "date": "June 30, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 165724405}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled on business", "text": "This was my family's first stay at the Courtyard by Marriott Bangor. We have tried nearly all of the hotels in Bangor, especially all of the hotels closer to the airport, on Odlin Road. I am very impressed with this property in both terms of the service received and overall comfort/cleanliness. First, service was wonderful from check-in to checkout. The staff was the most pleasant that I have encountered in all of my stays in Maine. They were always smiling and easy to converse with. Our room was great, without any concern whatsoever. The bright décor and sharp design give the room a trendy feel. Many hotels in the Bangor area are stuck in the 1980s with their room décor; this is not the case with the Courtyard. The bed offered a nice sleep with plenty of pillows. Each room is equipped with internet access. Not once did we think about dirt, as the room (and bathroom) was spotless. The lobby is spacious with a trendy feel. It certainly would be welcoming to the business traveler for those quick meetings or to find a place to socialize with coworkers. The lobby offers plenty of spots to kick back and relax or to catch the big game. Next to the check-in desk is “The Market”, a signature amenity of the Courtyard properties. The Market is a 24-hour pantry, offering snacks and beverages and other items that you may need during your stay. Another central feature in the lobby area is the Bistro. The Bistro offers a small food menu as well beverages. Alcoholic beverages such as bottled beer cost between $4-$5 while a glass of wine cost between $7-$9… price right to avoid making the lobby into a bar. Guest can find complimentary coffee in the lobby as well, and a full service business area with computers with internet and printers access. The hotel offers onsite laundry service (coin-operated machines). The pool was a bit of a disappointment with it’s size (approximately 20 ft x 14 ft) though I must say the water left our skin feeling unusually clean and smooth (I can not say that a public pool has ever done that before!). There is fitness room adjacent to the pool. The late checkout (12 noon) is wonderful as well. A few items worth mentioning: the hotel does not allow pets and is with a short drive to the Bangor Mall. There is a Starbucks onsite in the lobby Bistro Bar. This hotel is certainly in my top three for hotels in Bangor (if not number one), and I intend on return again soon!", "title": "One of the top three in Bangor!", "helpfulness": 3, "user": "StandingRoom", "date": "March 12, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 99937213}, {"rating": 4.0, "stay_parameters": "Stayed January 2011, traveled solo", "text": "I was in Bangor for some shopping and decided to stay at this property because of its proximity to the local area shopping area. My overall impression of this hotel is positive. The staff is courteous and professional. The building was constructed in 2008 making it a newer hotel. It offers full service and has a pool, fitness, and business centre. My room choice was honoured and the room was clean, well appointed, and had an ample supply of amenities. Complementary wired or wireless Internet is available. I did not experience any connection or speed issues. Although you can see the interstate from the front of the property, it sits far enough away that highway noise cannot be heard. A short drive from the hotel is where the bulk of the shopping can be found including the mall. There is also shopping choices downtown, which is another short drive away in the opposite direction. I look forward to staying here again. I would recommend this hotel to anyone seeking accommodation in the Bangor area.", "title": "Comfy Courtyard", "user": "RAW9", "date": "January 11, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 92554808}, {"rating": 4.0, "stay_parameters": "Stayed January 2011, traveled with family", "text": "Only a couple of minutes from the Bangor Mall. The room was quiet even though it faced the Interstate. Breakfast cost extra but it was very high quality. The pool was a bit small and the water was quite cold. Hot-tub was nice though. Staff were very professional.", "title": "Newest hotel in town.", "user": "CBM_20", "date": "January 1, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 91317137}, {"rating": 5.0, "title": "WOW", "text": "We were making a very quick trip to northern Maine. Just an overnight up and back. We decided to stay overnight in Bangor. I am a Marriott Rewards customer, so Marriott is always my first preference. I chose the Courtyard and am so glad I did. While I believe this Courtyard is more geared toward the business traveler, we were so impressed with this property.", "helpfulness": 1, "user": "AmyBeck49", "date": "December 31, 2010", "id": 91204037}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled on business", "text": "Our room was spacious with a king bed and pull out couch. It felt homey and not business like. The ONLY thing I would say is I was disappointed there was no full length mirror in the room. My significant other also suggested there should be a small shaving mirror in the bathroom (would also be helpful to me when putting on make-up). If you could add this to your rooms it would be 100% perfect.", "title": "Best in Bangor", "user": "honeymoonin", "date": "December 12, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 89663152}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "I am a great fan of Marriott hotels and this one does not disappoint! Excellent location for Bangor Mall. We stopped for one night on our way to the White Mtns in New Hampshire, and were very happy with our choice. The hotel is stylish and very comfortable. The rooms were well laid out and the beds were very comfy. The Starbucks coffee was a treat- Thanks!", "title": "Excellent hotel in Bangor area", "helpfulness": 1, "user": "WorldwideTravelerNS", "date": "May 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 162354950}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "We stayed here for one night when travelling from NYC back to Halifax, Nova Scotia.", "title": "Very nice", "helpfulness": 1, "user": "Jackson_Griffin", "date": "May 15, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 160778769}, {"rating": 2.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "A nice, modern hotel, big rooms, clean and a super quick check in.", "title": "A gift redemmed...", "user": "MLPreston", "date": "May 12, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 2.0, "sleep": 1.0, "rooms": 4.0, "location": 2.0}, "id": 160482103}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "We've stayed at a couple of the Marriott Residence Inn's, now, and they include free breakfast, so it was a shame the Courtyard doesn't. Otherwise, it was a good experience, and I would definitely stay here again if we were in the area.", "title": "Great place!", "user": "jacmoor", "date": "May 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 160081772}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with friends", "text": "For Christmas I received a gift card to the Courtyard. My boyfriend and I decided to stay there last Friday since we were celebrating our recent engagement. Upon arrival, the first thing I noticed was an abandoned building covered in graffiti sitting right on top of the hotel's property which made the overall feel cheap. Then entering the lobby I was immediately pleased, the colors of red and black gave the entrance a modern look. There was even a Starbucks and sandwich counter. My boyfriend and I entered the elevator and rode to the third floor. The elevator smelled bad and the rug was very worn. We found our room to be very pleasant and very spacious.", "title": "Weekend Trip", "user": "Isaac R", "date": "April 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 157873298}, {"rating": 4.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "i loved this hotel. it was ideally located (some people think it is out of the way but it's perfect as it's away from the highway yet close to all the shopping). i had only one issue with our stay and that was our room door. it was extremely tight to close so we really had to pull hard on the handle, which caused ALOT of screeching noise which i am sure the other guests did not appreciate. Other than that, I would go back and plan to do so as soon as i can!!", "title": "VERY enjoyable relaxing stay!!", "user": "caper169", "date": "April 21, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 62056859}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled on business", "text": "I frequently stay at this hotel....and it is always a great experience! I enjoy Courtyard's new decor and the breakfast set up. I would recommend this hotel to anyone! All of my colleagues stay here. The best part is how well the staff takes care of each guest!", "title": "Another GREAT stay!", "user": "precious06", "date": "March 30, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 59933237}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled on business", "text": "This hotel opened about a year ago on Sylvan Drive and it was clean and comfortable and met my every need", "title": "Excellent in everyway - will definitely stay again", "user": "Jo Maine", "date": "January 21, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 54022743}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled with family", "text": "I stayed here on New Year's Eve with my husband and in-laws on our way through to Sugarloaf. The hotel was conveniently located close to shopping and restaurants (though not within walking distance, if that is what you are looking for), and it was very clean and quiet. The decor was very nice, the beds comfortable, and the service nice. The rooms were a very good size, with a king bed, a sofa bed, mini fridge and bathroom. They had tea and coffee in the lobby, which was nice to have after a long drive. It was a great place to stay for our stopover.", "title": "Very nice hotel", "user": "Callaregie", "date": "January 4, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 52586510}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "First I want to address a couple negative reviews. 1) Being given a hard time with special rates ie. Friends and Family. My mother works for the Marriott and I receive her discount....with proper documentation. I was treated the very best at check-in. I presented the authorization form and was asked for a piece of photo id (which the form states is required). I was given my room cards and on my way. Very quick and with a smile. 2) Highway noise. One reviewer figures that if one has a room on the front side of the hotel the highway noise would be nearly unbearable. I can tell you that I could BARELY hear the interstate traffic standing in the parking lot. I cannot imagine being able to hear any traffic noise inside.", "title": "Great hotel, Great location", "user": "FreddyChick", "date": "December 12, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 51127062}], "location": {"country": "United States", "city": "Bangor"}, "stars": 3, "variance": {"poor": 6, "average": 10, "very good": 60, "terrible": 4, "excellent": 113}, "aka": "Courtyard Bangor Hotel Bangor", "slim_ranking": 0.166666666667, "description": "Experience true Maine hospitality at the new Courtyard by Marriott. As one of the premier hotels in Bangor, Maine, the new Courtyard by Marriott design offers the latest technology, amenities and décor that exceed the expectations of today's business and leisure traveler. Yes, you can get there from here! With quick access from our Bangor, Maine hotel’s location near I95, travelers are just minutes from the Bangor International Airport and area corporations, including the University of Maine Orono (Go Black Bears!), Eastern Maine Healthcare, Husson College, Cianbro and General Electric. Maine's famous lakes, mountains and coastline are just a short, scenic drive away from our hotel. Additionally, as one of the most accommodating hotels near Bangor, ME, our friendly, knowledgeable staff can direct you to top attractions and local favorites like Bar Harbor and Acadia National Park, The Maine Highland region and Baxter State Park."}