{"user_rating": 4.5, "review_count": 282, "name": "Courtyard Halifax Downtown", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled on business", "text": "Sometimes the room just makes the hotel. Marriott has provided the Halifax hotel market a shakeup with their extraordinary value King hot tub room including floor to ceiling windows which face the harbour. If you are considering an escape or just like to relax in your private two person jacuzzi then this is the place to give your keys to the valet.", "title": "Rub a dub king with hot tub", "helpfulness": 5, "user": "roomtoview", "date": "January 13, 2008", "detail_rating": {"front_desk": 2.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 12589465}, {"rating": 3.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "A couple of extras include", "title": "Nice new hotel", "helpfulness": 1, "user": "Nick_and_Michael", "date": "January 12, 2008", "detail_rating": {"front_desk": 2.0, "service": 3.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 12555568, "likes": {"liked": "— Location", "disliked": "— The pillows"}}, {"rating": 4.0, "title": "Loved it!", "text": "1. The Saturday morning Halifax Farmer's Market is mere feet away on the same block.", "helpfulness": 5, "user": "Sher83", "date": "December 8, 2007", "id": 11346306}, {"rating": 2.0, "title": "So so.............", "text": "2 The Interlude Spa is located in the same building and will provide the pampering you deserve.", "helpfulness": 6, "user": "Citygirl0", "date": "November 1, 2007", "id": 10520938}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "Nice place. Great location near the Brewery Market and with views of the harbour.", "title": "What a pleasant surprise", "helpfulness": 6, "user": "Aparticulartguest", "date": "October 27, 2007", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 10381248, "likes": {"liked": "— comfort of room", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "We were very happy with our choice of the Courtyard Marriott; previous positive reviews helped us decide to make this our choice for the start of a 14 day trip through Nova Scotia. We stayed four nights (over a weekend) during the Busker Festival, so the location, a street across from the waterfront, was more than ideal. The location itself was ideal for city itself, since it was a short walk anywhere for restaurants, shopping, nightlife, attractions or the waterfront. The location is safe in PM walking from waterfront and city area. Valet parking only (very efficient, we used it the last few days) and this is a stop if you use the Airporter shuttle service from the airport (which we did).", "title": "Good choice. Enough said.", "helpfulness": 1, "user": "kasey363", "date": "August 27, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 38991347}, {"rating": 3.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "The rooms were spacious (we had king with sofa bed); plenty of drawers for clothes, a large closet (be advised no safe, so use safety deposit boxes at front desk), very large windows (ours looked over the courtyard and Keith’s Brewery building), adequate desk space, and a spacious bath with double sinks. Water pressure was excellent in large shower and extra large bathtub. There is a good size refer and microwave, with a small counter space also. Property overall is in fine condition, with a small workout room (but adequate), small pool, bar area and a restaurant (which we didn’t use at all since we never ever eat at the hotels in cities beacause there are so many other choices) Cleaning was excellent, extra towels left on request, and front desk staff was very helpful and always pleasant.", "title": "Staff and location were great! Elevators and hot tubs not-so-much...", "user": "ottawa0191", "date": "August 10, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 37282658}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "Rooftop terrace area is great. Fairly large, overlooking the waterfront area, with a few large tables on each side to have your own happy hour. Very peaceful and a great place to spend sometime relaxing.", "title": "It was perfect, AGAIN", "user": "FussyTraveller4", "date": "August 10, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 37236743}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled solo", "text": "Hotel connected (seemingly so) to Keith’s Brewery Building which is great option for food, music and beer. Also, the adjacent building houses some shops and a deli (good breakfast option, also noticed some good takeout for a picnic etc) and Chinese restaurant which we went to late one night and was excellent - was also very crowded when we passed during normal evening hours (so that usually means food is good and it was). The best part was Mary’s – around the back of a non-descript hallway (although you could follow the awesome aromas) for great cinnamon rolls, awesome cookies and treats (breads, carrot cake, brownies etc) and homemade bread, croissants etc. Definitely was hidden, but there is a chalkboard sign street side – so don’t miss it! This building houses the abundant farmers market on Saturday – that itself was great. Good artisans and awesome food (to eat) and buy (produce!) for (obviously) locals – but very tourist friendly for picnics, homemade lunches, munchies for the waterfront. Across the driveway there is also a upscale Italian restaurant, with out door seating, that was very popular - although we didn't have time to try (basically cause we didn't pack upscale clothes on this trip...).", "title": "Very nice hotel, great staff", "user": "Amaklo", "date": "June 17, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 32542813}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled with family", "text": "Location was great, accomodations clean, new and service was efficent and very hospitable. Recommended choice when in Halifax.", "title": "clean, great service, nice location", "helpfulness": 1, "user": "luvztravel", "date": "May 1, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 4.0, "rooms": 5.0}, "id": 29150752}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "I booked a room here for a weekend getaway to Halifax. It was my first visit there, and all I knew was that I wanted to be at a property that was close to the historic harbor and Citadel. As it turned out, I could not have done much better with this selection.", "title": "Excellent location and comfortable stay", "helpfulness": 1, "user": "Generic90", "date": "July 16, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 17960963, "likes": {"liked": "— Centrally located, close to attractions, quiet, safe, and superb service"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "The property appeared to be relatively new. It was situated in a development next door to the historic Brewery Market. The facility was immaculate throughout. The rooms were very spacious, comfortable, and quiet. Even though I did not have a view of the harbor, it ultimately did not matter. Available parking is valet only, but their system makes the process very quick and painless. Their morning breakfast service is not spectacular, but it is quite delicious, the portions more than ample, and it is prepared quickly. There are a couple of solid fine dining establishments on site as well for dinner options.", "title": "No Place Else", "helpfulness": 2, "user": "bigredjohn", "date": "July 8, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 17670773, "likes": {"liked": "— attractiveness", "disliked": "— everything was fine"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled on business", "text": "The customer service and general attitude of the staff throughout - from the valet to front desk staff to servers to housekeepers - was superb. Everyone was pleasant, made sure to at least say \"hello\", and seemed more than willing to try to make certain that customer needs were resolved quickly. From my observations, they were very consistent with this outstanding service with everybody. Even when I had a 5am checkout on Sunday morning to catch an early flight out at the airport, the valet was quick, and the front desk staff was very pleasant and talkative.", "title": "Great Hotel in Halifax", "helpfulness": 5, "user": "Loews", "date": "May 27, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 16448101, "likes": {"liked": "— Rooms modern, clean and new - General Mgr was very helpful !", "disliked": "— no concerns"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled on business", "text": "The property is ideally situated in relation to many of the attractions in downtown Halifax. It is about two or three short blocks to the Maritime Museum of the Atlantic, a 10-15 minute walk to Pier 21, a 5-minute walk to the Grand Parade area, and about a 10-minute walk up the hill to the Citadel. This makes it easy for the traveler to see a lot in a short amount of time.", "title": "A waterfront gem!", "helpfulness": 5, "user": "AlbertaTraveller17", "date": "April 17, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 15108554, "likes": {"liked": "— The waterfront location and the service", "disliked": "— The complimentary no-name toothpaste"}}, {"rating": 4.0, "title": "Great", "text": "Overall, I would highly recommend this facility to anyone traveling to the Halifax area. It seemed ideal for solo travelers or families of all ages.", "helpfulness": 4, "user": "Simonadamien", "date": "January 25, 2008", "id": 12989097}, {"rating": 5.0, "stay_parameters": "Stayed February 2009, traveled solo", "text": "The Courtyard is in an ideal downtown Halifax location, within walking distance to everything. There isn't much in Halifax to begin with, so you really want to be right there. Very spacious rooms, nice harbour views, great value! I don't think I'll go back to Halifax (I was slightly bored there), but if I do, I'll definitely stay at the Courtyard again!!!", "title": "Excellent hotel in the best location", "helpfulness": 1, "user": "PanSW7", "date": "February 19, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 24819674}, {"rating": 4.0, "title": "Great place downtown", "text": "I stayed here for 5 nights in early October. The property is right downtown on the waterfront. Great views from most rooms and the 8th floor outdoor terrace is nice to sit and watch the boats pass by. I was really impressed with the overall feeling of the hotel. I've stayed in a lot of Courtyard's and this was definatly the newest/nicest. The rooms are larger than normal, with comfortable beds and a great shower. The staff was also really friendly and helpful with sugestions.", "user": "Mugsydogg", "date": "October 6, 2008", "id": 20667017}, {"rating": 2.0, "stay_parameters": "Stayed October 2008, traveled on business", "text": "Only con I can think of is a $20/day parking fee. .. Kinda steep.", "title": "Outstanding front desk staff, not-so-good housekeeping", "helpfulness": 1, "user": "Saskia80", "date": "October 6, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 1.0, "value": 3.0, "location": 5.0, "rooms": 5.0}, "id": 20666272, "likes": {"liked": "— Outstanding front desk staff", "disliked": "— Lack of cleanliness of the room"}}, {"rating": 2.0, "stay_parameters": "Stayed September 2008, traveled with family", "text": "Overall, I felt that this Courtyard was a lot more upscale than most, and a good value for the price paid.", "title": "Shabby with a touch of grubby.", "helpfulness": 2, "user": "Margolit", "date": "September 18, 2008", "detail_rating": {"front_desk": 2.0, "service": 2.0, "cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "location": 4.0}, "id": 20182256, "likes": {"liked": "— The manager was very accommodating and pleasant to deal with", "disliked": "— uncomfortable beds, lack of cleanliness"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "We were here for a total of 3 nights. The front desk and valet parking was simply outstanding: always ready to help and a friendly smile ready. Location of the hotel is great as well: right down town and close to just about everything.", "title": "Excellent hotel for being relatively new", "user": "Brian90212", "date": "August 23, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 19276094, "likes": {"liked": "— Secured parking garage, close to the harbor, good view of harbor from balcony, 24 hour complimentary coffee/ tea, brand new hotel", "disliked": "— swimming pool"}}], "location": {"country": "Canada"}, "stars": 3, "variance": {"poor": 3, "average": 21, "very good": 77, "terrible": 6, "excellent": 175}, "aka": "Courtyard Halifax Downtown Hotel Halifax", "slim_ranking": 0.115384615385, "description": "Whether your visit to Halifax is all business or just for fun, your stay at the Courtyard Halifax Downtown hotel puts you in the midst of all that Halifax has to offer. Located at The Brewery Square the hotel offers a view of the gorgeous Halifax harbour. The hotel is located within minutes of business, meeting and conference facilities and is within steps of popular Halifax attractions, shopping, restaurants, museums, theatre and more.As Halifax bustles along outside, through our hotel doors you are welcomed with first-class hotel services and amenities. Our spacious guest rooms feature complimentary wireless high-speed Internet. Our fireside lounge, incredible restaurants, 24-hour fitness centre and indoor heated pool add to your enjoyment."}