{"user_rating": 4.0, "review_count": 48, "name": "Courtyard by Marriott Detroit Southfield", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed May 2011", "text": "Although the staff was amazing, and the room very clean and updated, there is no wireless Internet in the room- nor very many sports/entertainment channels on the television. Not even fox sports detroit! There aren't vending machines or soda machines either. Not very \"three star\" in my book.", "title": "Amazing staff. No Wireless. No vending machines. No FSD.", "user": "Sailingakate", "date": "May 10, 2011", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 5.0, "rooms": 2.0}, "id": 107602308}, {"rating": 4.0, "stay_parameters": "Stayed February 2011, traveled with family", "text": "The bed was comfortable, had King with pullout sofa, fridge in the hall, bathroom shower had alot of water pressure. Only here for one night, noticed alot of people getting into the pool and hottub but not me on this trip, too busy.The front desk and housekeeping staff were very friendly. Easy access to I-696. Good restaurants nearby but not in walking distance.", "title": "Looking for a clean comfortable experience", "user": "clpOhio", "date": "February 20, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 97353718}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "We travelled to Michigan from Ontario to do some shopping. We've stayed at the Courtyard Southfield twice now and both times were not disappointed. The hotel is clean, quiet and convenient to the highway. Breakfast was excellent. My only complaint was that housekeeping ignored the \"do-not-disurb sign\" and banged on our door shortly after 11am - and we weren't scheduled to check out that day. Otherwise, a perfect stay.", "title": "Comfortable and Convenient", "user": "Bindy5London_Ontario", "date": "October 25, 2010", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 84777694}, {"rating": 4.0, "stay_parameters": "Stayed May 2010, traveled on business", "text": "The Courtyard Southfield was conveniently located making it easy to get on and off Northwestern Highway. The staff was courteous, allowing for early check-in. The lobby is aesthetically appealing, open and airy. Breakfast was included in the rate and it was worth it. The food was fresh tasting and the staff breakfast person was friendly. The room was clean and had all the 'basic' cable channels one might want. The mini fridge was useful but didn't get really cold. Ask for an inner courtyard room if you want a functioning balcony. There is a gazebo in the courtyard which is an excellent place to spend time reading the morning news and sipping on their delicious coffee. There is a computer kiosk in the lobby area and most guests were good at not hogging the system. The hotel is located in a residential area so it's surrounded by sidewalks which made it extremely convenient for long distant walks prior to meetings. And, if you feel adventurous, explore the interesting dirt 'river walk' type trail near the intersection of Civic Center and Telegraph.", "title": "Nothing to complain about", "user": "slowee08", "date": "May 12, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 64002284}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled on business", "text": "I travel almost every week to the Southfield, MI area and this property was recently recommended by a work colleague. I have now stayed here two weeks in a row and can give it a solid, positive recommendation. I plan to switch from my \"old\" hotel to this one.", "title": "Clean, remodeled property with excellent rates", "user": "brian796", "date": "March 5, 2010", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 2.0}, "id": 57796147}, {"rating": 3.0, "stay_parameters": "Stayed November 2011, traveled with family", "text": "We often stay in the Southfield area near Telegraph and 12 Mile Rd, and had not stayed in this Marriott Courtyard before. It's a fine place, good location, well maintained and nice rooms. Two downsides compared to some other hotels in the area are:", "title": "Nice", "helpfulness": 1, "user": "dkmr", "date": "December 21, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 121950876}, {"rating": 4.0, "stay_parameters": "Stayed December 2011", "text": "No wireless internet in the rooms; there is wired internet, but the absence of in room wireless is a gap these days.", "title": "Basic corporate lodging", "user": "Happytraveler099", "date": "December 6, 2011", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 121473459}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled on business", "text": "A charge for breakfast (I think it was $7.99 for the cold buffet and something more for hot). Again, in this era of free breakfasts at similar hotels, this is a gap.", "title": "Consistently good", "helpfulness": 2, "user": "slowee08", "date": "September 21, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 118423335}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled on business", "text": "This is s good basic hotel that appears to cater to the business traveler. The room was clean, spacious, in very good condition with a few really well thought out features. I liked the shelves in the shower. So much nicer than trying to balance shampoo bottles on the edge of the tub. Having the mirrored closet across from the sink vanity makes packing, unpacking and staying organized much easier for the solo traveler. I am not sure I would like this layout if I were sharing the room. Last, but not least the bed was very comfortable.", "title": "Good business destination or pleasure", "user": "Scott S", "date": "August 31, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 3.0, "service": 3.0}, "id": 117517706}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "I would definitely return.", "title": "Never Disappoints", "user": "SandSunDancer", "date": "August 12, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 4.0}, "id": 116613995}, {"rating": 4.0, "stay_parameters": "Stayed January 2010, traveled with family", "text": "Very clean, looked like all the rooms had a patio or a balcony. The room was average, and a very nice staff. They have a 24 hour little market where stuff is not too badly overpriced. Mini fridge in room. The breakfast was not free but very nice , you pay 5 dollars upfront for two adults and you can choose to eat from the buffet or order something from the menu. They seat you and serve you, nice eating area. The outside seemed very beautiful with a gazebo , although it was winter time. Indoor pool and jacuzzi (it made the water brown when we turned on the jets). But that was our only complaint about this hotel.", "title": "Great breakfast", "user": "jennie09", "date": "January 16, 2010", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 53601814}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "It may be the smaller of the Marriotts in the area, but it is the best. We had a family reunion at the Marriott next door and staying at the Courtyard was a nice retreat from the crowd. The staff give A plus service from front desk to housekeeping. Breakfast was great and room was very clean!", "title": "SOUTHFIELD'S FINEST", "user": "Brunchgirlz", "date": "August 11, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116576101}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled on business", "text": "All participants at the AWC Convention enjoyed their stat at the hotel, rooms were properly cleaned up daily with all facilities well attended to. The morning free buffet was great, food was awesome. The hotel staff especially Darlyn was very friendly. The group rate for the rooms was peerless. AWC will certainly use Courtyard when next we return to Michigan.", "title": "Afenmai World Congress 2011 convention guests loved it and the hotel staff was excellent and accommodative.", "user": "AWC2010", "date": "August 5, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116306771}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "I was in Detroit for a family function. I'd travelled too many miles for the occasion to stay in a dumpy hotel. So I chose this one based on the reviews and I'm happy to say I made a good choice. The hotel was quiet, the room was clean and updated, and I had a great time. The only problem I had was not being able to stay longer. Stay here. You won't be sorry.", "title": "Would stay here again in a heartbeat", "user": "Phoenix4", "date": "July 25, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115770914}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled on business", "text": "I have stayed at this property off and on over the last ten years through frequent business travels. Although I wasn't unhappy with Marriott, I became weary of the same ol', same ol' and a few years ago transitioned most of my business to the Hilton Garden Inn. Recently I decided to try the Courtyard again and am glad that I did. The gentleman at the front desk was extremely helpful and courteous. He offered to upgrade my stay to a King Suite at no extra charge and the room on the 5th floor was excellent. The two room suite contained two large flat screen televisions, a large bathroom, a small balcony overlooking the courtyard, refrigerator, and most importantly, a very comfortable bed. I encountered several staff members during my stay and each and every one was cheerful, helpful, and customer service oriented.", "title": "Super Staff", "helpfulness": 1, "user": "TallBlonde", "date": "July 15, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 5.0}, "id": 115404009}, {"rating": 2.0, "stay_parameters": "Stayed May 2011", "text": "Only negatives to this Courtyard Marriott is no wireless in the rooms (although there is wired internet and it's fast and easy to use), and location of the only elevator in the back of the hotel is inconvenient for many of the rooms.", "title": "Very clean. No wireless. No vending machines. But! Amazing staff.", "user": "Sailingakate", "date": "May 10, 2011", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 5.0, "rooms": 2.0}, "id": 107602546}], "location": {"country": "United States", "city": "Southfield"}, "stars": 3, "variance": {"poor": 4, "average": 8, "very good": 24, "terrible": 0, "excellent": 12}, "slim_ranking": 0.210526315789, "description": "Experience a fresh take on travel at Courtyard by Marriott Hotel in Southfield, Michigan. Our Southfield, MI hotel embodies the amenities and services that both business and leisure travelers desire. Business travelers will enjoy staying at a quality hotel convenient to many corporate offices, while leisure guests will enjoy our proximity to great shopping, Detroit tourist attractions, Comerica Park, Ford Field and MGM Casino. Our Southfield, Michigan hotel is centrally-located in the Metropolitan Detroit area, where I-696 meets Michigan Highway 10 and Telegraph Road (U.S. 24). We are located right on Oakland County's \"Automation Alley\" - near Henry Ford Museum, Greenfield Village, and convenient to many other Detroit points-of-interest. This Marriott hotel near Oak Park MI features a breakfast buffet with eggs cooked-to-order at Courtyard Cafe, free wired high-speed internet access, and an indoor pool. Your stay at the Courtyard by Marriott Detroit Southfield hotel will energize you for the day during your time in the Detroit Southfield area."}