{"user_rating": 4.0, "review_count": 327, "name": "Courtyard by Marriott Venice Airport", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "This hotel is obviously geared for the traveler, airline employees, business and tourist alike. It's quite clean and modern with nice facilities for food, considering it's a hotel. The free shuttle is a major plus. If you stayed at any Marriot Courtyard, you'll feel like deja vu with the exception of lots of foreign languages being spoken. No major surprises which I really like. I wouldn't stay here and use it as a base to tour Venice but then it's not intended for that. Wouldn't hesitate to stay here again to take advantage of it's airport proximity.", "title": "Worthy stop over to and from airport", "helpfulness": 2, "user": "scottderrick", "date": "July 11, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 134127475}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "Stayed at the courtyard for 2 days before a cruise (actually at checkout I think the entire hotel were also going on the same cruise!).", "title": "Great base for seeing Venice", "helpfulness": 5, "user": "adesmith", "date": "July 11, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 134078795}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "The hotel is 5 mins from the airport and there is a courtesy bus available from and to the airport. Its a small hotel but nice and modern. The reception area was nice and the staff very helpful especially when enquiring about where to go and what to do in Venice.", "title": "Great airport hotel", "helpfulness": 2, "user": "TwoRetiredFolk", "date": "June 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 133133672}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "The room was nice and especially clean as my wife pointed out quite a lot to me.", "title": "pleasantly surprised", "helpfulness": 1, "user": "nuggetshow", "date": "June 22, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 132560521}, {"rating": 3.0, "title": "OK but.....", "text": "It has a basic gym but it was good enough for the 2 days I was there.", "helpfulness": 2, "user": "billyboy39", "date": "June 21, 2012", "id": 132463228}, {"rating": 4.0, "title": "A very nice airport hotel.", "text": "The hotel is about a five minute drive to the airport with a free and very punctual shuttle service. The rooms are nice with just enough amenities to get you through the night.The beds are comfortable and the air conditioning worked well but was noisy. I don't like paying for internet at 10 EUR for 24 hours of use and do not understand why hotels continue charging you for this service. The restaurant is actually quite nice and the breakfast offered a lot of choices though not enough to charge 15 EUR. In short, a nice, convenient hotel for a one night stay but the extras can get pricey.", "helpfulness": 1, "user": "noelle75", "date": "May 26, 2012", "id": 130628302}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "Very good service, with pleasant rooms that are clean, well-prepared and welcoming. We stayed in one of the executive rooms.The room was quite spacious with a modern bathroom.", "title": "Pleasant airport hotel", "user": "FredBramble", "date": "May 22, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 130414919}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "The room at the hotel was quiet and aircraft noise was well-suppressed. Generally, the hotel is a little pricey but it is no more so than the other hotels in the area and definitely cheaper than staying in Venice. Bed was comfortable.", "title": "Airport Hotel Venice Italy", "helpfulness": 5, "user": "YKJewel", "date": "May 18, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 130192995}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "Easy access to Venice itself by the bus that stops immediately facing the hotel. Tickets are a very reasonable 2.60 Euro, round trip. The bus leaves every 15 minutes.The ride takes 20-30 minutes, depending on the time of the day. Mid-morning, the bus stops at every stop, but the evening bus was much faster.", "title": "Great location to airport", "helpfulness": 1, "user": "NorCal-traveler08", "date": "May 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130133503}, {"rating": 3.0, "stay_parameters": "Stayed April 2012, traveled on business", "text": "Overall, obviously convenient for the airport (with htoel shuttle) but also not a bad place to stay for a day or two visiting Venice.", "title": "Average Courtyard", "helpfulness": 3, "user": "WorldTraveller550", "date": "April 26, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 2.0}, "id": 128628673}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "The Courtyard Marriott is perfect if you want to stay close to the Airport on the mainland, its just 5 minutes away & you can take a public bus or the free hotel shuttle. The bus stop is right across the street, there are a few eateries & shops close by. Pretty basic, enough for the essentials. Price doesn't seem too high, & you can't hear the planes coming & going. The food is good too. The rooms are large, clean & comfortable & the staff is helpful & friendly.", "title": "Perfect for the Airport", "helpfulness": 2, "user": "masifk", "date": "June 5, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 131329964}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "We spent two days here and chose the airport location for price and convenience. I got a good deal on the room. The people at the reception were very helpful and we even bought our bus tickets there. We had 2 romantic weeks in Italy, I didn't care about being in Venice so much. I am glad I made that decision, because we had an early flight and we watched so many people hauling their luggage across cobblestones and bridges to try and catch water taxis. What a hassle! Bus number 5 stopped about every 15 min across from the hotel and it was a 15 min ride to the station in Venice on a clean air conditioned bus. We noticed several restaurants near the hotel and when we walked through the bar/restaurant we thought the food looked very good. However, for breakfast those were the worst eggs ever. I am not that picky either, they tasted sour. Oh well, the thing I worry about in airport hotels is noise, and I didn't hear any plane or traffic noise. It was quiet, clean and comfortable. It also had a decent workout facility. I was very happy that we selected this hotel and we had no shuttle issues.", "title": "Nice Hotel and staff", "user": "LLindaC", "date": "June 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 132323897}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "It's a Courtyard right next to the airport. Totally functional and nothing special. It's very new and clean, but it's a Courtyard and you're in Venice. Why stay here unless it's your last night in town and you need a place right next to the airport. It wasn't cheap, that's for sure. There were no complaints about the place, but again, it was a purely functional stop.", "title": "It is what it is", "user": "grlantrn13", "date": "June 18, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 132244712}, {"rating": 2.0, "stay_parameters": "Stayed May 2012, traveled on business", "text": "Used this hotel as an overnight stop in Venice.", "title": "Wouldnt be my future business travel choice", "user": "Dushyantha", "date": "June 8, 2012", "detail_rating": {"service": 2.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 2.0, "location": 4.0}, "id": 131527831}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "Except for the breakfast everything else was unsatisfactory.", "title": "Very Near VCE - Nice Facility", "user": "KennewickGuy", "date": "June 7, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 131482098}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "We booked the room online and everything worked perfectly - the room was priced right, the front desk staff was friendly & extremely helpful, the convenience to the bus station across the street was great, and the shuttle to airport couldn't have been quicker or better. While staying IN Venice may be nice for some, watching people drag suitcases down long streets did not look like fun. I would much rather take the bus into Venice, enjoy the day and get away for a while. We would definitely stay here again. If I had any suggestion for improvement, the food prices were a bit high in the restaurant compared to what what we paid in othe places all throughout Italy...especially for no \"Italian\" atmosphere.", "title": "Overnight stay was perfect", "helpfulness": 1, "user": "terielliott8", "date": "July 16, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 134492493}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled on business", "text": "Location is super-convenient to the airport AND to bus service to \"downtown\" Venice. Bus stop is directly across the street and the bus runs frequently to the bus station which connects to the water taxi services which take you anywhere you might want to go. Hotel runs a complimentary shuttle to/from the airport which allows you to turn in rental cars night before flights. Also convenient to the autostrade if you wish to use this as a base location for day trips in the region. Hotel itself is modern, well appointed, and well run. Staff is extremely helpful and more than willing to get you bus tickets, etc. AND -- do try the restaurant and bar. Their food is REALLY good and service is excellent. I stayed here twice (late July and early August) and will do it again.", "title": "THE place to stay in Venice!", "helpfulness": 3, "user": "EJPVA", "date": "August 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 136428417}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "The front desk personnel were extraordinarily accommodating and friendly. They arranged transportation for my husband and me, discounted breakfast for 2 days upon request, and went out of their way to answer any and all of our questions. The location was further away from the city of Venice than we had expected, but we navigated the miles via terrestrial and water buses well. We made several trips in and out of the city times without incident, as the transportation was frequent and reliable. The room was a good size and very clean, but the bathroom was small for two people, with only one sink and the toilet tucked behind the door. We used Marriott miles for the first 2 nights and took advantage of a special Cruise Package on the third, which included breakfast and a transfer to the cruise terminal, so we were satisfied with the value. However, we felt the $200++ price tag for the one paid night was high for the less than opulent room and property. Overall, though, we had a positive experience!", "title": "Marriott Miles to Venice", "helpfulness": 1, "user": "Lynn S", "date": "August 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 136334532}, {"rating": 5.0, "title": "I like it very much", "text": "Doing this review whilst waiting to check out of this hotel. Very good and convenient for airport. I went to buffet breakfast very early, it was good but some of the food was not out for the early opening. The food was good though.", "helpfulness": 1, "user": "naej", "date": "July 28, 2012", "id": 135595211}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled on business", "text": "Very good hotel for Italian standards", "title": "Perfect for travellers coming by plane to Venice", "helpfulness": 1, "user": "bogdantache", "date": "July 26, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 135400042}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "Recently stayed here overnight pre-cruise and it worked extremely well. We had a package that included breakfast and transfer to the ship. I thought it was marginally overpriced but was very satisfied overall.", "title": "Comfortable and convenient", "helpfulness": 2, "user": "travguy", "date": "August 17, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 137434310}], "location": {"country": "Italy", "region": "Veneto", "continent": "Europe"}, "stars": 4, "variance": {"poor": 15, "average": 58, "very good": 145, "terrible": 6, "excellent": 103}, "aka": "Courtyard By Marriott Venice Airport Hotel Tessera", "slim_ranking": 0.75, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "description": "Marco Polo Venice Airport is the third passenger landing terminal in Italy. Courtyard by Marriott Venice Airport is the nearest branded accommodation. Our Hotel, conveniently located just 900 mt from Venice Airport and only 12 km from downtown Venice, offers the perfect solution for either Business or Leisure travelers arriving or departing from Venice."}