{"user_rating": 5.0, "review_count": 99, "name": "Courcelles-Parc", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "I had to share the bathroom. The key was troublesome. But It is near the Metro station. I walked back from the Arch of Triumph. The room was sophisticated. The owner was heart-warming. The juice was fresh at breakfast. I want to stay here again.", "title": "Good Location", "helpfulness": 1, "user": "Yoko617", "date": "August 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 136022554}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "I really enjoyed my stay at Courcelles-parc. The place is gorgeous, and the location is very convenient. Phillipe was very helpful and kind. Breakfast was hot and fresh each morning. I'd stay here again.", "title": "Very nice place", "user": "bubblykiki", "date": "August 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 135979298}, {"rating": 5.0, "stay_parameters": "Stayed July 2012", "text": "We started our honeymoon at this B&B.", "title": "Great location and warm hosts!", "user": "jenyan826", "date": "July 27, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 135575931}, {"rating": 5.0, "title": "Gorgeous elegant boutique B&B", "text": "The room felt like a bedroom away from home, very comfortable and clean! Each morning we had a delicious breakfast with fresh squeezed OJ, coffee, and pastries, along with yogurt. Philippe and Nathalie are genuine, sincere and helpful hosts. We had great conversation everyday and looked forward to talking and laughing with them!", "user": "Abigail T", "date": "July 19, 2012", "id": 134852983}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "Thank you so much for a truly amazing stay!!", "title": "The best accommodation in our entire trip!", "helpfulness": 3, "user": "Francine H", "date": "July 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 134507945}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "I was traveling with my family and we stayed at Courcelles-Parc for 7 nights. We had two rooms that shared a bathroom and worked perfect for us. The rooms are really nice; the beds are very confortable with nice beddings. The breakfast was delicious. Everything was nice from the point of view of a hotel, but what made a difference were the hosts, Phillip and Natalie were welcoming, professional and warm. For my next trip to Paris I will save time searching for a hotel, I will absolutely come back!!", "title": "Great place!", "helpfulness": 2, "user": "Heidy H", "date": "January 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 149395814}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled on business", "text": "This experience significantly exceeded my expectations for a place to stay in Paris, on a trip involving extensive business travel within and out from Paris. Philippe was an exceptional host, helping me with guidance, suggestions, and metro schedules. Location couldn't be more convenient to Metro. Quiet and comfortable, and after a couple of days it felt like my apartment in Paris. Walking distance to many locations. Breakfasts with Philippe and Nathalie were wonderful. Book well ahead of time, as this property will become more in demand with time. My only regret was having to leave after a 4 day stay.", "title": "Perfect", "helpfulness": 2, "user": "cooncat123", "date": "November 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 146458384}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "We were in Paris for 5 nights in August, with another couple. My husband and I stayed in the Champs Elysees suite and were delighted with the beautiful decor, the size of the suite and the very comfy bed. So glad we chose this B&B over a hotel. The hospitality from host Phllippe was exceptional. He was warm and welcoming and went out of his way to make our stay comfortable and enjoyable.", "title": "Wouldn't stay anywhere else", "helpfulness": 4, "user": "Cunninghams2", "date": "November 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 144706623}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "This was our first time in Paris and having someone provide local knowledge of great places to dine, and sites to see, was fantastic. This was not just a job for Phillippe, he is funny, passionate about his Paris and his country and quite obviously loved people. We got to see the best side of Parisians. Breakfast each morning was one of the highlights of our day.", "title": "Highlight of my trip", "helpfulness": 5, "user": "Shara959", "date": "October 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 143845206}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "Loved the area too, although not in the \"heart\" of Paris, public transport was at the doorstep and it was a pleasant walk along the Boulevard to the Arc de Triomphe and Champs-Elysees. It was the best way to enjoy the architecture, tree lined streets and beautiful Park Monceau.", "title": "Fantastic!", "helpfulness": 1, "user": "SageySA", "date": "October 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 142687077}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "A wonderful, spacious and modern B&B spread over 2 floors. Phillipe is friendly, helpful and will do his best to point you in the right direction. We love to walk when we are on holiday and its quite easy to walk from here to the centre of Paris, however, the Metro is directly next door so its quick to get around (also very easy fro Eurostar if you are coming from London). The rooms are large and have everything you need and the breakfast was lovely. Would reccomend this.", "title": "Believe the reviews - wonderful B&B", "helpfulness": 1, "user": "busastep", "date": "February 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 152608368}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "Our family of four stayed seven nights in two rooms with a shared toilet/bathroom. This B&B represented very good value for Paris given it's location. Phillippe was very entertaining and he was always attentive to our needs without being in our face. Having visited Paris many times before we did not have to bother them too much with seeing the place although their restaurant recommendations were very good. Book early because there aren't too may like this in Paris and demand is high. I would happily recommend this outfit to people looking for a very comfortable stay at a very reasonable price. While you're there the hairdresser situated to the left as you exit the building is very good.", "title": "Good alternative to a hotel", "helpfulness": 2, "user": "desi17", "date": "January 31, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 151080011}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "My husband and I stayed at Place De La Tour Eiffel in early Jan 2013. As this is our first European trip, I wanted to experience Paris like the locals. So we decided to stay in a bed and breakfast and off I went reading review by review on TA before choosing to stay Courcelles parc based on the postive reviews.", "title": "Had a really pleasant stay", "helpfulness": 1, "user": "VerliS", "date": "January 30, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "location": 4.0, "service": 5.0}, "id": 150986596}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "Staying here was one of the highlights of our trip. Phillipe and Natalie are excellent hosts and very accommodating. Breakfast was always interesting as Phillipe and Natalie were always chatting with us and We also met and chatted with other guests staying at the B&B. We learned a bit more about Paris from the eyes of a local and other visitors at the same time. I also love the fresh pastries, fresh fruits and the fresh juice served at breakfast.", "title": "Can't Recommend it More", "helpfulness": 3, "user": "Meltem G", "date": "January 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 150807209}, {"rating": 5.0, "title": "Short but great stay", "text": "The B&B is located on a main road, however, our room was very quiet when the windows are closed. The room was comfortable and had lovely French decor. The only thing that I found inconvenient was the toilet (although it was clean and dedicated for our use only, it Is located opposite our room, while the shower and wah basin is inside the room. The overall stay was awesome that I would definitely stay here again on my next visit.", "helpfulness": 2, "user": "sherlock23", "date": "January 23, 2013", "id": 150459738}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "We have not stopped talking about this place since we left Paris. It was the perfect place to celebrate our 2nd Wedding Anniversary! We stayed in the Champs Elysees room. Beautifully decorated and maintained rooms and fantastic location. The best thing about Courcelles-Parc is Phillipe & Nathalie; the owners. Each morning they invite the guests into their home for breakfast, they give quality advice and directions around Paris and really made us feel that we were staying with locals rather than in a random hotel as tourists. The morning we left it felt like we were saying goodbye to family! Our stay in Paris was perfect thanks to this amazing accommodation. We have already recommended it to everyone we know!", "title": "Just like staying with family", "helpfulness": 3, "user": "Miller26", "date": "October 4, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 141976517}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "We would recommend this b'n'b without doubt. The room was exquisitely decorated thanks to the artistic expertise of the hosts, it looks exactly as the photos do. The bed was very comfortable, the breakfast was delicious and it was conveniently located next to the metro station.", "title": "A treasure in paris", "user": "Katie F", "date": "September 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 140777152}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "The higligh though was the knowledge and warmth of the owners who gave us great recommendations for restaurants and attractions.", "title": "Warm in every way", "helpfulness": 3, "user": "Alex F", "date": "September 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 140159849}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with friends", "text": "We will definitely stay there again and recommend it to friends and family!", "title": "Stop looking - Stay here!", "helpfulness": 3, "user": "jeweltraveller", "date": "August 31, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 139010822}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "We rarely stay in Hotels and B&B's as we mainly travel the world as \"home exchangers\".", "title": "Amazing!!!", "helpfulness": 3, "user": "Ysa F", "date": "August 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 137055940}], "location": {"country": "France", "region": "Ile-de-France", "continent": "Europe", "city": "Paris"}, "variance": {"poor": 0, "average": 0, "very good": 0, "terrible": 0, "excellent": 99}, "slim_ranking": 0.00826446280992, "description": "Our guest rooms are situated in an hausmannian building in a very lively district in the center of Paris. On your door step:the parc Monceau, close to the “Champs-Elysées”. We are located at equal distance from “l’Arc-de-Triomphe”, “the Opéra” and the main department stores and also “Montmartre”…A dreamed place for all the visitors for” the city of Lights. You will be under the spell of this charming Parisian place."}