{"user_rating": 4.0, "review_count": 103, "name": "Courtyard by Marriott Newport News Airport", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled with family", "text": "Spent two nights here while in town visiting CNU with my daughter. The hotel more than met our expectations. Everything is new, fresh and modern. The room was very big, as was the bathroom, and the beds were very comfortable. We booked a promotion that included breakfast, and the food was very good. The hotel has a lovely patio area that we sat out at and enjoyed. If our daughter decides to attend CNU, we will definitely stay here!!", "title": "Why stay anywhere else?", "user": "everson420", "date": "April 12, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 61153171}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled on business", "text": "This Hotel is by far one of the nicest that I have stayed in, the staff is really GREAT. I'm a Military Service Member and is currently staying in this Hotel till Dec 8 and i've been here since Sept 21 for school, I am completely satisfied. They really try to make your stay very comfortable, house keeping is wonderful. Always asking\" How can make your stay beter\". The Bistro has a lovely atmosphere for a romanic evening in.", "title": "Military Traveler", "user": "Military-TravelerE6", "date": "October 16, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 47045920}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "Spent two nights here during a tourist loop through Virginia. This hotel was nice and new, roomy, excellent in-hotel amenities and a great deal at $101/night. You have several restaurants near by (Carabba's was good) . The Interstate in quite close but had no impact on our room from noise. We found the staff friendly and helpful. If you are a runner, ask for the directions to area paths (the Maritime Museum 5 mile loop is outstanding) . The courtyard cafe and amenities are great. We especially appreciated the boarding pass print-out area.", "title": "Cannot ask for more for the money", "user": "Maplehawk", "date": "September 7, 2009", "detail_rating": {"cleanliness": 3.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 40015497}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "My family (husband/wife, 2 girls ages 13 and 10) stayed here at the beginning of July and LOVED IT!!! A little hard to find at first (make sure you use their instructions for your GPS). Everything is state-of-the-art: the decor, the \"business center\" (the girls loved the PCs with the huge screens and wireless mice), and the rooms were very nicely appointed with very comfy beds.", "title": "A GEM!!!", "user": "CaptaintripsMitch", "date": "July 14, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 34754902}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled with family", "text": "I am here at this hotel now. It is very nicely decorated....very modern. Nice sitting areas. Staff is friendly. Rooms are clean. Bar/refreshment area in the lobby. Can order a mixed drink to take to your room. Plenty of beers to choose from as well. ALso have Starbucks and snacks available. Convenience store as well.", "title": "Very nice hotel. Modern and updated!", "helpfulness": 1, "user": "jamulb", "date": "June 7, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 31763386}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "I am a Platinum Preferred member, so am not easily impressed. Really nicely designed and furnished hotel that is centrally located to Norfolk, Williamsburg, and Virginia Beach (depending upon I64 tunnel traffic). Staff is pleasant, drinks and food are good. Good value.", "title": "Was like a full-service Marriott Hotel", "helpfulness": 1, "user": "FrequentlyTravel96", "date": "July 5, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 69779371}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "This Courtyard Marriott is apparently pretty new. The decor is fresh and clean, and our room was as well. We were attending the Hampton Jazz Festival and there is easy access to I-64 to get to Hampton, Williamsburg or Virginia Beach, and we visited all three places. However, at times, the traffic was terrible on I-64. If you're going back and forth to Williamsburg, consider using Route 143 or Route 60. But back to the hotel. The lobby area is very nice, and it has a nice snack bar that also serves alcohol. The happy hour prices are very good, but some of the food items are a bit pricey, eg, the $11 chicken ceasar salad. The only small glitch we had was that housekeeping only left one wash cloth after cleaning the room. The front desk promised to bring more cloths, but never did so. I had to go down later that night and get them because the guy at the desk was apparently alone and couldn't leave. Otherwise, I have no complaints and would return to this hotel in the future.", "title": "Almost Perfect", "helpfulness": 1, "user": "fwy", "date": "June 27, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 68859927}, {"rating": 1.0, "stay_parameters": "Stayed May 2010, traveled solo", "text": "I booked this room for my CNU Graduation ceremonies. I was in such a hurry to get to the ceremonies that I left my purse, with my new engraved ipod touch inside, among other things. Well.....needless to say.......when I went back to the hotel to retreive my purse, housekeeping had already cleaned the room. The housekeeper did not turn anything in to the front desk, except my phone charger that I left plugged in the wall outlet. My purse was a limited edition \"COACH\" that cost me $475 and my ipod touch cost me $200. This weekend COST ME A FORTUNE !! My advise to you.........DON\"T LEAVE ANYTHING BEHIND BY MISTAKE.........it won't be there when you get back !!!", "title": "Don't leave anything behind by mistake........", "helpfulness": 3, "user": "coachtim1", "date": "June 1, 2010", "detail_rating": {"service": 1.0}, "id": 66085283}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled on business", "text": "Wow - I hadnt stayed in a Marriott Courtyard in years - this hotel was fantastic. The rooms are all very clean and comfortable. Air conditioner is quiet and beds are perfect so it was perfect for sleeping after a long day at work. There is a small coffee area downstairs that serves sandwiches at night and a few restaraunts nearby. The room was fairly large and included a refridgerator. There is a huge lobby and business center.", "title": "Perfect Stay - Fantastic Hotel", "helpfulness": 1, "user": "travelweeklyforwork2", "date": "May 22, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 65022018}, {"rating": 3.0, "stay_parameters": "Stayed May 2010, traveled on business", "text": "I would definitely recommend this hotel.", "title": "nice hotel, except the security, a lots of drinking in lobby, pool, room", "helpfulness": 2, "user": "gttoy", "date": "May 11, 2010", "detail_rating": {"service": 1.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 63839792}, {"rating": 5.0, "title": "Loved the Courtyard Marriott NN/Wmbg Airport", "text": "Stayed here for a couple of nights and absolutely loved this hotel. It is almost new and the decor is very modern, contemporary and comfortable. Rooms were clean, furniture and electronics new and in great condition, and the beds and pillows were very comfortable. Bathroom was very clean, spacious with granite, ceramic tile and a walk-in shower, which would have been perfect except the door was installed incorrectly and it leaked at the bottom.", "helpfulness": 2, "user": "SpencerLV", "date": "March 16, 2009", "id": 26283810}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled on business", "text": "Courtyards are generous with free amenities, and this one was no exception. It provided free WiFi, free coffee and tea in the lobby, free copies of USA Today and the Wall Street Journal, and lots of magazines and reading material. The lobby was large, spacious, and had plenty of comfortable seating areas. The business center was located in the lobby seating area, very convenient, with three computers with large LCD monitors. There were also two separate airline boarding pass terminals, which was a nice touch and eliminated the wait-for-the-pc-to-be-free annoyance when checking into a flight (all the guests I saw were very good about not monopolizing the biz center pc's). There was also a convenient bistro with food and drinks, as well as a small lobby shop for (pricey) essentials. My only gripe with the bistro is that the attendant was in absolutely no rush at all to serve you and didn't seem to notice or care that you had better things to do than wait forever for a muffin and a coffee.", "title": "Great New Hotel in Chesapeake, Va", "user": "nanniex2", "date": "January 6, 2009", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 2.0, "rooms": 5.0}, "id": 23326272, "likes": {"liked": "— it was clean and the bed comfortable", "disliked": "— didn't get to stay longer"}}, {"rating": 2.0, "stay_parameters": "Stayed September 2008, traveled solo", "text": "The lobby is done in the new Courtyard style with laptop hookup stations and booths, and the decor throughout the hotel was a very nice contemporary style. Even the hallways were nice and bright and the carpeting wasn't aged, tired, old, or that hideous \"what's it hiding\" dark blue older hotels have.", "title": "Please Provide Proper Training for Housekeeping", "user": "SuiteTimes", "date": "September 22, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 3.0, "cleanliness": 2.0, "value": 2.0, "location": 3.0, "rooms": 4.0}, "id": 20284490, "likes": {"liked": "— The business center", "disliked": "— poor housekeeping"}}, {"rating": 3.0, "stay_parameters": "Stayed December 2010, traveled with family", "text": "First of all, I am a Marriott Gold Elite, so I have seen LOTS of Marriotts, just to give you a frame of reference for my credibility. Check in was pleasant. The smiling desk attendant was kind as were any other staff we encountered at the hotel. So that is a plus. Upon entering the room, the first thing I do (and I recommend this to everyone) is check the bed for bed bugs because of the hysteria in the media. I did this and found that there were no bugs, but I did notice a distinct red blotch, fingernail sized, on both the top (flat sheet) and the bottom fitted sheet as well. My wife said it looked like blood, like someone might have had a slight cut or something. I asked if it could be lipstick but we both came to the conclusion that it was blood. So we called downstairs and asked for a linens change. The desk attendant apologized and sent up someone to change the linens out. This was done swiftly and professionally. And when we went downstairs later, the desk attendant (who might have also been the manager?) asked if the problem was resolved. I told him that it was. I am a very easy going guy and am not a finger pointer or anything, so I was pleased with how they handled the situation. But I would recommend that anyone who stays here request a linen change upon arrival. The reason is that there is a chance that the day room cleaners might be taking a few shortcuts. You might find that the sheets are not crisp and have a distinct \"slept in\" look. Or you might find that the rug looks like it wasn't vacuumed because it didn't look that bad, etc... This is more a management issue than anything, as in most Marriotts you will find that there is a feel of greater supervision over the housekeeping staff. It is admirable that they are willing to react in a professional manner to room problems, but why not focus on making sure that no room problems are present to begin with. So get on the ball and check behind your staff manager! So in conclusion: nice hotel, with very friendly staff, but rooms are a bit hit or miss with cleanliness. Location is walking distance to Johnny Carrabas, and Cheeseburgers in Paradise.", "title": "Nice Employees but Insist on a Linens Change Upon Arrival", "user": "candle1", "date": "December 28, 2010", "detail_rating": {"service": 5.0, "cleanliness": 1.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 90881039}, {"rating": 3.0, "stay_parameters": "Stayed November 2010, traveled with family", "text": "Convenient location and lobby & other amenities were well appointed; however, room was not in the best shape. The carpet was stained & looked dirty, the towel rod in bathroom was bent and the room had a slightly musty odor.", "title": "Average hotel", "user": "acmath", "date": "November 30, 2010", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 88674642}, {"rating": 4.0, "stay_parameters": "Stayed November 2010, traveled on business", "text": "I was very impressed with this Marriot. The lobby area was just beautiful. My co-worker and I sat in the lobby to catch up on email. We were totally relaxed here and didn't feel like we were even working! The room was even better than the lobby, which is saying a lot! I absolutely loved the decor. Everything in the room was of high quality and very functional. I do have one issue with the bathroom however. I think this has more to do with the cleaning people than the hotel itself. The shower had signs of hard water buildup and maybe mildew in the grout. The bathroom is the most important room in a hotel to keep clean. It can really make or break the experience. The shower is large with bench seating and looks to be very newly renovated. Such a shame it hadn't been cleaned properly! The bed was the cherry on top of my experience. I hadn't slept that well away from home in maybe a year I think. I didn't want to get up to go out of the room! We didn't eat anything in the hotel but the food smelled good. I would recommend this hotel to anyone, as long as the cleaning crew steps it up!", "title": "Most restful sleep!", "user": "Dearly2000", "date": "November 4, 2010", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 85978451}, {"rating": 5.0, "title": "Great Hotel - Clean, Cool Lobby and wonderful \" French Toast \"", "text": "What a great hotel....love the open layout of the lobby; cool computer area, nice seating areas for meetings, eating, high tech TV’s. Really nice design! Hope the Marriott redesigns the other Courtyards like this. Rarely come out of my room after settled in for the evening. I came downstairs every morning and evening to swim, eat and chat a little with the warm staff. Nice clean room with comfortable beds and free internet. \"The French toast with fresh strawberries is a must\"", "user": "A TripAdvisor user", "date": "September 30, 2010", "id": 81652277}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled solo", "text": "Easy to find off of I-64, although I came in from 173/143 and found it just as easily. The surrounding area is home to several strip malls, a shopping mall, and restaurants -everything you could want is close by. The lobby has a Starbucks, business area, and Internet area. Check in was swift and the clerk was very friendly and helpful. The room was fabulous, even though it was on the small side due to the king bed and multiple pieces of furniture. Two people would be comfortable, though. The bed linens were good quality and the bed, although on the firm side, was quiet comfortable. I enjoyed a very peaceful night's sleep. The bathroom was really cool. No old outdated bathtub with slow drainage here. This bathroom has a glass enclosed shower that could actually fit two people (although there's only one shower head). I found a more than ample supply of towels and washcloths, that looked nice, but were on the thin side. The room also had the cutest little \"bar\" area that housed the coffee maker, glasses, and the mini fridge. Flat screen TV, quiet air conditioning system that you control, clean and inviting hallways, well-lit and ample front side parking - a gem in this growing area of Newport News. I just hope that this property maintains it present-day standards in the coming years.", "title": "The hotness!", "user": "ms90", "date": "September 19, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 80223951}], "location": {"country": "United States", "city": "Newport News"}, "stars": 3, "variance": {"poor": 7, "average": 12, "very good": 25, "terrible": 5, "excellent": 54}, "aka": "Courtyard By Marriott Newport News Airport Hotel", "slim_ranking": 0.210526315789, "description": "With an ideal location near the airport, attractions, universities and shopping, the Courtyard Newport News is ideal for business or leisure travel. You'll find perfect accommodations in Hampton Roads with functional work space in each guest room, complimentary wireless Internet, and a 24-hour food market. Our sleek lobby bistro offers opportunities to eat, drink, and connect with others or online throughout your day. After meetings or sightseeing, unwind in our indoor pool and whirlpool or stay fit in our fitness center."}