{"user_rating": 4.0, "review_count": 108, "name": "Courtyard by Marriott Atlanta Perimeter Center", "reviews": [{"rating": 5.0, "title": "Highly Recommend!", "text": "What a great find! This was our first stay at a Courtyard & we will definitely back next time we go to Atlanta. The staff were wonderful & very friendly. We arrived before check in & were gladly offered a room right away. And a courtyard room to boot! So we had a pool view with a little patio. The room was extremely clean & very large compared to other hotel rooms. It had 2 beds, a chair, a desk that had a pull out piece also, and another chair for working. It also had a refrigerator, which we were surprised. The bathroom was very large also. The entire hotel was extremely clean & wonderful all around. The free breakfast was great too- muffins, turnovers, cereal, bagels, english muffins, toast, fresh fruit, yogurt, coffee, milk & juices. The pool was clean as was the hottub, which was actually hot!! There were towels to use in the area of hot tub. There was a fitness center, but we didn't even go to it.", "user": "abcsoaps", "date": "July 23, 2007", "id": 8222923}, {"rating": 5.0, "title": "Wonderful Courtyard", "text": "I stayed in this hotel for one night (Feb 12th). The hotel is relatively new and nicely decorated. The room was nice and clean and the front desk staff was friendly. I was pleased to find a “store” at the front desk that had snacks and other items for sale. The free cookies in the evening are also a nice touch. I had no problems at all with this hotel. The FREE internet was easy for me to access. The full service restaurant was also appreciated… I only had breakfast but it was good. If in the area again, I will DEFINITELY stay here!", "user": "business&pleasure", "date": "March 2, 2007", "id": 6901460}, {"rating": 4.0, "title": "very nice!", "text": "Stayed here for two nights in the fall of 2004....hotel was immaculate and the beds were very comfy...rooms well appointed. Would stay here again most definately. Also its in a nice neighborhood, great for walking/jogging.", "user": "fjnovak1", "date": "January 10, 2007", "id": 6572832}, {"rating": 4.0, "title": "Above average hotel", "text": "I stayed at this hotel for 5 nights due to corporate training in the area. The hotel itself is nice, clean, the staff is friendly, and the rooms are nicely decorated (except that navy blue carpet that if you stare at it for a while, you seem to get lost on its patterns).", "user": "Spurs_Rock", "date": "March 30, 2006", "id": 4822774}, {"rating": 3.0, "title": "Nice when traveling alone", "text": "I had no overall problems with the hotel except with its internet access. Granted, Marriott does not provide the internet access, they outsource it to an Internet Service Provider called iBahn. However, it was pretty annoying that every day that i powered on my laptop, it kept asking me to pay for a service that was already included in the price of the hotel (Marriott advertises free wireless/wired access in this hotel).", "user": "A TripAdvisor user", "date": "February 8, 2005", "id": 3169350}, {"rating": 3.0, "title": "Good average courtyard", "text": "This is a nice average Marriott Courtyard. Pleasent and clean. Seems to have a lot of families on weekends so be prepared for kids. Lots of hotels in the area.", "user": "BeenaroundRj", "date": "September 26, 2004", "id": 2602261}, {"rating": 4.0, "title": "Fab in Dunwoody", "text": "While the rooms were not incredibly spacious, the decorating was really cool. The first floor rooms open up to the pool via a mini patio. The hot tub was big. When I was there, it wasn't crowded so we pretty much had free reign of the pool as well. It was a nice change from other hotels I've stayed in when visiting the city.", "user": "A TripAdvisor user", "date": "May 7, 2004", "id": 1880522}, {"rating": 2.0, "title": "Okay but a Few Minor Problems", "text": "I stayed here in March 2008 for a week and a half while I attended 2 SAP classes. The hotel is just your standard basic hotel. Nothing fancy with no frills. For the most part it was clean however I had a few problems with the housekeeping staff. The first problem was when the housekeeper left the bolt on the door sticking out which left the door open the entire day while I was gone in class and my laptop was sitting on the desk the entire day! I complained to the front desk and they gave me several free buffet breakfast coupons and said they would talk to the housekeeping supervisor. The other problem I had was apparently this hotel does not remove coffee mugs and replace with new clean ones when used. I would eat instant oatmeal in the morning using the coffee mug with hot water out of the coffee maker to make it. I would generally clean/rinse the mug when I was done and leave it sitting up next to the coffee machine. The next morning when I went to do this again and I turned over the coffee mug there was dried up powder oatmeal residue around the side of the mug. I was generally surprised that the housekeeper would just turn the mug back over and not replace the mug or in the very least clean it! Another incident was ice in the ice bucket which had melted and it took the housekeeper 3 days to empty and give me a new ice bag. The housekeepers would also throw away the newspaper if it was just sitting anywhere in the open in the room. I resorted to hiding it each day so that I could read it in the evening when I got back from class. The rest of the room seemed clean. The beds were comfortable and clean and the bathrooms seemed to be cleaned each day. The buffet was good and the staff was friendly. The gym had updated equipment and generally was empty. I used it several times while I was there. Overall the hotel was okay, the room was roomy enough but the housekeeping staff could use some training. I took some pics because I noticed that there really was no previous pics taken.", "user": "shelieg34", "date": "April 13, 2008", "id": 15012308}, {"rating": 2.0, "title": "OK, but minor complaints", "text": "The hotel is pretty standard for a Courtyard, nothing special but clean and cozy. I was staying for a little over a week on business and I needed to do a load of laundry. The market in the lobby was out of laundry detergent. A few times the maid decided to throw away the newspaper I had on the desk before I had a chance to read it. (Hint for any maids out there, only throw out whats in the trash, unless its a wrapper.) The doors close very hard and loud, so when someone down the hall is getting early start they wake everyone up when the door closes.", "user": "chromeo", "date": "February 22, 2008", "id": 13753091}, {"rating": 4.0, "title": "Nice place, but getting sloppy", "text": "I stayed here while on a business trip with the company across the street. It is a nice propery, and the staff were very pleasant and cordial. I had a good rate, so I would return", "user": "AVisitor80126", "date": "February 1, 2008", "id": 13182670}, {"rating": 3.0, "title": "Nice hotel", "text": "But there were a bunch of minor things that were drawbacks.", "user": "Amanda P", "date": "December 19, 2007", "id": 11688031}, {"rating": 5.0, "title": "Heck Yeah!!!! Book it Today!!!", "text": "> The printer in the business section never worked during my two day stay. They did try to help though.", "user": "what180", "date": "November 21, 2007", "id": 10963931}], "location": {}, "stars": 3, "variance": {"poor": 8, "average": 21, "very good": 41, "terrible": 1, "excellent": 37}, "aka": "Courtyard By Marriott Atlanta Perimeter Hotel Atlanta", "slim_ranking": 0.19689119171, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.0, "rooms": 4.0, "location": 4.5}}