{"user_rating": 4.0, "review_count": 156, "name": "Courtyard by Marriott Kingston", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "My wife and I just finished our stay in the Courtyard Marriott here in Kingston. Overall we slept well. The room was clean and the bed was comfortable. I don't really have any complaints about the interior of the hotel. Like others have said, it is located in a parking lot with a Target next door. However, this also means you're removed from the freeway so there really isn't any outside noise. This was our first stay in a Marriott and I was a bit disappointed they charge you $7 each for a simple breakfast. This is my only complaint about Marriott in general, but seems to be the policy of the chain in general so I can't hold it against this hotel. Just be aware that you have to pay for breakfast, unlike most other hotels in this category.", "title": "One night on weekend", "helpfulness": 1, "user": "MaddieMii", "date": "March 7, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 3.0, "service": 4.0, "rooms": 5.0}, "id": 25746309}, {"rating": 5.0, "stay_parameters": "Stayed February 2009, traveled on business", "text": "Pretty standard courtyard. This one however, had very nice rooms and great staff! The location is a little strange, but acually nice because it is close to shopping.", "title": "Great Staff and Nice Rooms", "helpfulness": 1, "user": "dmann887", "date": "February 28, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 3.0, "service": 5.0, "rooms": 5.0}, "id": 25350969}, {"rating": 5.0, "stay_parameters": "Stayed January 2009, traveled on business", "text": "This Marriott is exactly what I expected from a high end brand. The management here obviously knows what they are doing because everything was in working order, clean, and the staff was very pleasant. I will certainly stay here again.", "title": "Very Nice!!", "helpfulness": 1, "user": "Business_GuyMe", "date": "February 1, 2009", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 24088516, "likes": {"liked": "— Spacious Rooms", "disliked": "— Little hard to find"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled on business", "text": "This was one of the nicest courtyards that I have ever seen. The staff was very professional and the hotels overall condition was nearly perfect.", "title": "Excellent!!", "helpfulness": 1, "user": "TravelQueen889", "date": "December 1, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 22356765, "likes": {"liked": "— Clean Clean Clean!!!!!", "disliked": "— Everything was actually good."}}, {"rating": 4.0, "stay_parameters": "Stayed August 2008, traveled on business", "text": "We stayed at this hotel for one night a couple of weeks ago. It was a little difficult to find and had to call the hotel to get directions which were okay but still confusing.", "title": "Good place for an overnight", "user": "Longwood Traveler", "date": "September 5, 2008", "detail_rating": {"front_desk": 2.0, "business": 4.0, "service": 3.0, "cleanliness": 5.0, "value": 5.0, "location": 3.0, "rooms": 5.0}, "id": 19778583, "likes": {"liked": "— Clean, spacious rooms", "disliked": "— uninformed staff"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2007", "text": "The rooms were nice and comfortable. The bathrooms were particularly nice. The staff there was extremely friendly and accommodating.", "title": "Nice, Friendly", "user": "FooBarPa_Usa", "date": "February 25, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 2.0, "rooms": 5.0}, "id": 13832267, "likes": {"liked": "— staff", "disliked": "— location (in a mall)"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled with family", "text": "The views (a mall and traffic) weren't anything to write home about. It was a bit difficult to get in/out of the hotel parking lot due to HUGE amounts of holiday traffic at the mall. (The hotel is actually IN the mall parking lot.)", "title": "Excellent Hotel", "user": "OutOfOffice4Good", "date": "February 25, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 13828162, "likes": {"liked": "— Pool / Room"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled with family", "text": "Stayed here overnight and went skiing to Belleayre (about 30 minutes away) the next day. The kids (5 and 4) loved it. The pool and hot tub were great. The room was very nice. There were lots of restaurants nearby (The hotel is located in the middle of a huge shopping mall area) Definitely recommended. The only drawback was it was a little bit hard to find, and I did hear the trains at night as other reviews have mentioned. No big deal though.", "title": "A Second Stay at the Courtyard Kingston", "user": "Holly4", "date": "February 21, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "rooms": 5.0, "location": 5.0}, "id": 13740981, "likes": {"liked": "— The beds are soft and the rooms were very clean.", "disliked": "— The pool temperature was chilly, and they make you pay for breakfast."}}, {"rating": 4.0, "stay_parameters": "Stayed February 2008, traveled with family", "text": "Another great stay at this hotel!", "title": "Excellent Choice", "user": "raincheck10", "date": "February 19, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 3.0, "rooms": 5.0}, "id": 13674699, "likes": {"liked": "— Large rooms"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "Initially I had tried to get a room for $60 on priceline, but I kept getting shut out - I think it might be because I stayed on a Tuesday night this time around. I ended up changing my criteria and getting a reservation for the Days Inn in Poughkeepsie instead. Fortunately, the Days Inn AND priceline screwed up the reservation and caused me all sorts of problems, so priceline ended up refunding my money. I'll never use them again.", "title": "Wonderful Hotel in a Strange Location", "helpfulness": 2, "user": "andi9", "date": "January 5, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 3.0, "rooms": 4.0}, "id": 12366696, "likes": {"liked": "— staff", "disliked": "— Weird location"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "We chose this hotel as a midpoint during a long journey -- spending two nights here before traveling on... The choice was made after reading a lot of bad reviews for other places. The good reviews outweighed the bad ones on this hotel. Everything went smoothly -- just a typical place to sleep. I'm disabled and used my magnetic room key to open an exterior door for closer access to my room. The water was hot. No strange noises or smells to report. We spent most of our days out sightseeing, shopping and having nice meals (Went to our first SONIC Drive-in meal nearby and also had dinner at a close by Red Lobster another night) We'd go back here on a repeat trip in the future.", "title": "Comfortable Stay -- Good Travel Choice", "user": "dickmullin", "date": "December 25, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 90691220}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled with family", "text": "My experience with the Kingston Marriott was wonderful. The staff was friendly and helpful. The room was immaculate. The ambiance was quiet. It had a great location .restaurants and stores were easily accessible. Would highly recommend this establishment.", "title": "Excellent accomodations, clean and quiet. Great location", "user": "chloe102", "date": "October 3, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 81957284}, {"rating": 2.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "Went to New York for my friends graduation from West Point and her wedding. WE had a very busy weekend and needed sleep after driving all the way from North Carolina to New York. The staff when we checked in was mediocre. It was about 9:30 pm and we were exhausted and the woman who checked us in treated us as if we were more of an annoyance than a guest. Got to the room and the individuals above us were stomping around and making a ton of noise as if they were moving furniture. Exhausted and frustrated I called the lady at the desk and asked to be moved to a different room and she said she couldn't, but she would send somebody up to the room. I had to call back down to the desk to see if she had made any progress (she did not call me back) and she said that she could not hear anything. So needless to say, I spent the next 3 nights absolutely exhausted from a horrible nights sleep, without the staff helping me out in any way.", "title": "Not the best Hotel to stay in while visiting Kingston, NY", "helpfulness": 1, "user": "BuggieMB", "date": "September 13, 2010", "detail_rating": {"service": 1.0, "cleanliness": 5.0, "value": 3.0, "sleep": 1.0, "rooms": 1.0, "location": 3.0}, "id": 79428851}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled on business", "text": "This hotel is located near many shopping options and restaurants. The staff was very pleasant and helpful. My room was clean and comfortable. The bathroom could been a little cleaner. No big complaints about this hotel.", "title": "Great Location - Good Stay - Clean Hotel", "user": "jooksing", "date": "August 30, 2010", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 77470776}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled on business", "text": "Although this hotel is a bit pricey, it is pretty new so the decor is modern. Room was nice with mini-fridge. A/C was quiet and thermostat worked fine.", "title": "Good, modern Courtyard", "user": "mjd50", "date": "August 20, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 76082184}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled on business", "text": "I stayed at the Kingston Courtyard by Marriott last week on business. As another reviewer said, this is a fine example of the chain. Check-in was a breeze, the room was beautifully decorated and clean, and the bed was comfortable. My room had a view of the mountains, which was just fantastic! Yes, there is a train, but I was not really bothered by it since it's a couple of blocks away. Our group had paid for complimentary breakfast which was served buffet style. There was a good choice of items (cereal, bagels, fruit, scrambled eggs, bacon and sausage), and everything was cooked very nicely. The breakfast staff was very eager to please.", "title": "Very pleasant hotel that's a little hard to find", "user": "Bandlady", "date": "April 25, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 62421672}, {"rating": 2.0, "stay_parameters": "Stayed November 2009, traveled on business", "text": "It would be difficult for someone who did not have explicit directions like I did to find this hotel. As others have said, it's in a mall area, between Target and Toys R Us. However, there was no sign on the main road for the hotel (even though the stores had signs). At least, I didn't see one the 3 times I drove there. Since you can't see the hotel from the", "title": "Slow Train Coming", "user": "PhillyTomcat", "date": "March 13, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 1.0, "rooms": 3.0, "location": 1.0}, "id": 58514973}, {"rating": 4.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "road I'm surprised they don't have a big sign.", "title": "Great option in Kingston - in very good condition", "user": "EMBMaryland_DC", "date": "December 4, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 50629925}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled on business", "text": "Other than that, my stay was very pleasant and I'll definitely stay there again if I'm in the Kingston area.", "title": "Solid Marriott Courtyard with stores close by", "user": "togel", "date": "October 21, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 47447824}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled with family", "text": "Don't be fooled, the Amtrak train is not near by, but a local train line is near this hotel. About a mile a half mile or so away. And the train comes by every couple of hours and the whistle is loud!! The place is surrounded by big box retailers and roads. Feels like this was the last piece of buildable land in the area, so they decided plop a hotel here. If you are a heavy sleeper, you will do fine here. I am a lighter sleeper, so I had issues. The staff will tell you there is no train noise here, but that is not true. The Hampton Inn is closer to the train line. Avoid this area for hotels. Maybe try a discounted B&B in the off season. Good luck!!", "title": "Ben Folds Concert Stay", "user": "racole", "date": "October 11, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 3.0, "service": 5.0, "rooms": 3.0}, "id": 46534710}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "I had a friend book this over the internet while I was driving. Room was immaculate. Front desk person- Gasper I believe called our room to be sure everything was ok 10 minutes after we checked in. Nonsmoking on the property was fantastic!!", "title": "More than I expected.", "user": "savannahsgram", "date": "July 27, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 72646698}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled on business", "text": "The location of the hotel is very nice. Right near a mall, other shopping and tons of places to eat. The room was average and very clean. The pool area was very nice and well maintained. For the location, it is worth staying here.", "title": "It Was A Nice Stay", "user": "asualumni87", "date": "July 20, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 71623278}, {"rating": 2.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "The bed seemed to be made of foam or was just so worn that I sank in towards the middle. The carpet was damp, and the sofa in the room was old and worn. The television, which was old and had no pay movie options) was placed in a position on the desk that made it very difficult to watch from bed. And, the hotel appeared to have only two luggage carts, which were never around when we needed them. The hotel also had only one small elevator that was slow. I used to love Courtyards, but this one was a great disappointment -- and it was no bargain. The Hampton Inn across the street seems to be a much, much better option.", "title": "Unpleasant stay; hotel showing its age.", "helpfulness": 1, "user": "jmmlimited", "date": "July 5, 2010", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "sleep": 2.0, "rooms": 2.0, "service": 2.0}, "id": 69819336}, {"rating": 2.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "Pros = Near the mall and supermarket. Clean, fairly new and spacious rooms. Fitness room and indoor pool with jacuzzi tub.", "title": "Find another hotel far from the tooting trains", "user": "fung1964", "date": "June 4, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 2.0, "sleep": 1.0, "rooms": 4.0, "location": 1.0}, "id": 66476702}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "A dependable place in a very convenient location. Close to all the franchise type places to eat and shop, on a main road but manages to be quiet. Staff very nice. Only a couple small glitches -- no forms at the desk to join the frequent stayer program, breakfast was slow but there is a buffet so if you don't order anything that's got to be prepared you won't lose any time. Easy ride to Woodstock area and there are fun things to do in Kingston and Saugerties areas. Hotel has lots of info in the lobby re: local things to do. Don't miss Opus 40!", "title": "Convenient, clean, well located", "user": "wotanleroy", "date": "September 26, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 44816269}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "A very good choice if you are looking for a good quality hotel at a reasonable price. The location is not great, although it would suit people that wanted to do some shopping, as it is near a few malls. The staff was very friendly and helpful, and the rooms are very large, clean and well kept. The swimming pool and Jacuzzi are very good, and the Gym is adequate. They offer complimentary Wi-Fi, and the staff was very helpful in giving ideas for restaurants. I would certainly go back if in the Kingston area.", "title": "A Very Good Choice", "helpfulness": 1, "user": "Lord_Gin", "date": "August 28, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 3.0, "service": 4.0, "rooms": 5.0}, "id": 39053299}, {"rating": 4.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "We booked this hotel because we got a good one nite only AAA rate and Kingston is just across the Hudson from the Rhinebeck area where we wanted to spend a couple days. The room we got was fine for us - roomy, clean, everything functioning and in the updated Marriott layout (built-in funiture with mini fridge, coffee maker, etc.) The front desk was friendly and the hotel peacefully quiet - perhaps because there was no Bard graduation crowd or the Memorial Day wkend tourists had just gone. The only thing I couldn't figure out was how the bath water switched from tub to shower (the ring around the tub spout) but my husband is an engineer so we did not have to call the front desk. Some reviewers on Tripadvisor noted the hotel is hard to find and it is - our car's nav system put us on the correct road but neither the hotel nor the mall was anywhere in sight - in fact there's nothing there. I remembered a reviewer mentioned that a Target was right across from it so you have to look for the main mall with Macy's etc and then look for the Target Store.", "title": "Good place to stay in Kingston", "helpfulness": 1, "user": "contheroad", "date": "May 26, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 3.0, "service": 5.0, "rooms": 4.0}, "id": 30858314}, {"rating": 4.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "I booked the hotel at the last minute and got a very good rate through Orbitz. We just need a place to stay to get an early start on the next day. The hotel is smack in the middle of this huge shopping complexes. The staff was friendly the room was very nice and clean. Our GPS took out of our way, You should call and ask for directions from the exit. The only disappointment was there was no restaurant and bar. Thought there were plenty of the chain restaurants near by. The staff recommended a nice restaurant in the old part of Kingston; which was excellent.", "title": "A Good Night's Sleep", "user": "BearBrooklyn", "date": "May 18, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 2.0, "rooms": 5.0}, "id": 30197276}, {"rating": 4.0, "stay_parameters": "Stayed April 2009, traveled with family", "text": "Stayed for one night. Convenient location. Rooms are nice size with small sitting area. Bathroom was very roomy. Clean, pretty new hotel. Everything worked just fine. We enjoyed the pool and hot tub. Very comfortable. Would definitely stay again.", "title": "Nice rooms", "helpfulness": 1, "user": "clhimes", "date": "April 14, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 4.0, "rooms": 5.0}, "id": 28010428}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "I stayed here recently for a family wedding. The rooms were quite spacious, well kept & clean. The outside seating & fire pit were great for family gatherings. You're close to all the major big box stores like Target, Walmart, Walgreens, etc. The downtown area is only a 5 minute drive away.", "title": "Convenient Location & Free Wifi", "user": "RotterME", "date": "June 7, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 112075678}, {"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "We were in Kingston for family funeral. My husband arrived early and stayed 2 nights at Rodeway Skytop where they were extremely rude and even argumentative with their guests. When I arrived I refused to stay there so we stayed at Marriott Courtyard. Obviously much more expensive, but my husband thought he had gone to heaven after his experience at the other hotel. Clean, comfortable, nice people. Well worth the extra cost. The only negative was the room was a little small by Marriott standards. But after 2 nights at the Skytop, who cares.", "title": "Typical good Marriott", "user": "ksemmes", "date": "April 13, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 103961790}, {"rating": 4.0, "stay_parameters": "Stayed February 2011, traveled with family", "text": "We were here for one night, after doing some snow tubing / skiing.", "title": "Typical Courtyard By Marriot- no problems.", "user": "AC2002", "date": "February 28, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 98387947}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled with family", "text": "Room was large- regular width but quite long. Seems to be recently renovated. Hot beverages downstairs are available 24/7 as well as 2 public access computers, + free wireless internet.", "title": "Execellant place to stay", "user": "yojoyce", "date": "February 21, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 97507597}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled with family", "text": "Breakfast is extra, that's not a big deal for business travelers but for a family you might consider eating out (we found the McDonalds just 2 minutes away). We stayed on points. Not sure how much rooms go for around here - Rooms are little pricier than I expected for this type and area, but- overall, a good stay.", "title": "Consistently reliable", "user": "LIETraveler", "date": "January 23, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 94145764}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "We've stayed in a lot of Marriott Courtyard hotels and this one was definitely the nicest. Very nice lobby, excellent breakfast buffet - with omelet station and bake-your-own Belgian waffles etc. The room was not very large but very well laid out with spare electrical outlets everywhere - including the nightstands. Everything looked brand-new and clean and service from the front desk and housekeeping was excellent.", "title": "Best Courtyard ever - except for the bed.", "user": "JohnAndTheresa", "date": "July 6, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 3.0, "value": 3.0, "service": 5.0}, "id": 115089091}, {"rating": 5.0, "stay_parameters": "Stayed June 2011", "text": "Two quibbles - the bed sagged in the middle making sleep uncomfortable. We reported it after the first night and maintenance installed a bed board that afternoon. Improved the bed substantially, but it still wasn't the most comfortable bed I've slept in.", "title": "The Best in the Area", "user": "munchkin80", "date": "June 24, 2011", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 3.0, "service": 5.0, "rooms": 5.0}, "id": 114712469}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "Also, the hotel gives you an address to use in a GPS on it's website. That address takes you to a mall entrance (Look for JCPenney, Macy's, etc) with no sign of a Courtyard hotel. Drive up the mall driveway and look to your left to find the hotel.", "title": "Wonderful staff and stay", "user": "island-gal-in-NJ", "date": "June 17, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 4.0, "service": 5.0}, "id": 114118346}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "My husband's idea of a hotel room is just somewhere to sleep and he could sleep anywhere. My idea is that the room has to be more than just a bed to crash in, as you never know when you'll be spending more time in the room than expected. Like today. We flew into LaGuardia yesterday from Palm Beach after a 2.5 delay; then took a ridiculously insane trek through Harlem, all the way up Broadway, across the GW Bridge into Jersey then finally onto the NY State Thruway (thanks to the wonderful new little GPS my kids got me for Christmas - I really miss my big brick Magellan that never mislead me) arriving at our destination - New Paltz - and what could be described as a trip equivalent to Mr Toad's Wild Ride (it wasn't operator error, I have an excellent sense of direction - just not in Manhattan :). My family are locals so, I've never paid for a room \"in town\" - New Paltz - other than during one of my few stays at what I could only describe as a resort that should be on everyone's \"bucket list\" - Mohonk Mountain House. The Marriott Courtyard is located in the Target/local mall parking lot; one exit north of New Paltz. Coming from South Florida, when somebody tells me that my hotel is one exit up, I think real close. However, these are \"country miles\", so the exits are about 20 miles apart. Regardless, the Marriott Courtyard is worth the trip, even if your business or day trip is in New Paltz. The staff has been most accommodating, the room is excellent - clean, well appointed, roomy, nice/big bathroom with my favorite - the curved shower curtain (sorry, I hate it when you spend your time in the shower trying to get a shower curtain unstuck from your body because they have a straight rod curtain holder), mini fridge, etc. The price of the breakfast buffet ($8.99 ?) doesn't kill you like some other properties. There is free wi fi and computers/printers located in the lobby (handy for printing boarding passes while traveling), very comfortable sitting area in the lobby, along with concierge service (who knew). I don't remember ever staying at a Courtyard, but this location has absolutely sold me on the brand. The room was pricey, I only booked a week in advance, but the manager cut me a break, because my room request had not been filled as reserved. The price might be high due to a popular car show (Good Guys?) being held in Rhinebeck and a horse show in Saugerties; or maybe its a little pricey because (from what a relatie told me) its the newest hotel in the area. The initial reservation price was higher than the hotel I will be staying at in Times Square in a couple of days; but again, that price dropped. Regardless, it's worth the price to stay in a room where you don't worry about cleanliness or safety. Location - right off the Thruway/other highways, so it's accessible. Let's get to today - son threw up this morning at breakfast, so I am getting to spend a little longer in the room than I ever expected (great argument for not staying in a dive); plus I could walk over to Target and buy cola syrup/pepto bismol, ginger ale, etc. Not exactly how I thought I would be spending one of four days in NY, but what can you do. Nobody expects to go on a trip and get sick. So, regardless - I will (without heistation) make the trek up one exit to the Marriott Courtyard if I ever need a hotel room when I'm visiting relatives - it's definitely worth it!", "title": "Our go-to place in the Hudson Valley", "user": "velocitytime", "date": "June 15, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 113571030}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "We stayed here 4 nights for a local event. The hotels in the area were fully booked and we originally had 2 reservations. The first for 2 queen beds for the first 2 nights and the second reservation was for 1 king for the remainder of the stay. Even though the hotel was completely booked, the front desk staff was very patient in checking for any cancellations for us, and in the end, we were able to stay in the 2 queen room!! When we got to the room, I was concerned since the elevator was 2 doors away - but it turned out to be a non-issue and we did not hear a thing! The housekeeping staff kept our room nice and clean, and the afternoon cookies at the front desk were a welcomed treat when we returned to the hotel after being out all day.", "title": "FANTASTIC, GREAT SERVICE, REALLY COMFORTABLE", "user": "Mitzvahzoe", "date": "June 11, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 112669707}], "location": {"country": "United States", "city": "Kingston"}, "stars": 3, "variance": {"poor": 11, "average": 19, "very good": 66, "terrible": 5, "excellent": 55}, "aka": "Courtyard By Marriott Kingston Hotel", "slim_ranking": 0.222222222222}