{"user_rating": 4.0, "review_count": 110, "name": "Courtyard by Marriott Houston Medical Center", "reviews": [{"rating": 5.0, "title": "Great internet speeds", "text": "I used to stay at this Marriott and the one on Fannin Street. Even though the one on Fannin Street is fancier, I actually prefer this Courtyard Marriott more because the internet speed is so much faster. For business purposes and for work that needs to be done at the hotel, this was a better option for me. I think the business of the Fannin Marriott caused the internet speeds to be a little slower. In addition, this Courtyard Marriott has a small eating area (open for breakfast and dinner too) and a small convenience store.", "user": "Tunaidi", "date": "August 6, 2013", "id": 171032999}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled on business", "text": "The facilities and cleanliness of this Courtyard are what you would expect. What makes it so special is the outstanding customer service. Going to MD Anderson (as many guests are) can be very stressful. The front desk staff and especially Anna know that fact and are as kind and personable as they are professional and helpful. Male shuttle driver Stacey motherly suggested I bring a sweater, as the hospital can be as cold as Houston is hot. The shuttle not only provides service to the various hospitals, but to a five mile area that includes shopping and restaurants, making a rental car unnecessary. For whatever reason you are in this part of Houston, this is the place to stay.", "title": "Best customer service when you need it most", "helpfulness": 1, "user": "ravenstokes", "date": "August 1, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 170370492}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "My son and I stayed over the 4th of July weekend as he checked into University of Houston. From the first person to greet us to the driver the arranged to take me to the airport this Courtyard is far above the rest. While all courtyards I have stayed in are clean and well managed, this one is a cut above the rest. I plan on being in Houston for a series every month during baseball season and this is where I will stay. thank you so much for a most enjoyable stay Well Done!", "title": "Nicest staff ever", "user": "Debi D", "date": "July 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 168740246}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled on business", "text": "The hotel must have been recently updated. My room and the lobby smelled and looked new. Everything was very clean. The staff was extremely helpful. 2 of my business associates and I used the lobby as our meeting center for 2 days. Even though the lobby bar wasn’t scheduled to open until 5:00pm, they started waiting on us at 3:00pm. There was no Diet Mt Dew in the market fridge and they found me 2 bottles so I would have some in the morning. There was a washcloth pet in my room when I checked in. Many of the courtesies were services I only expect when staying at a full service Marriott. The alarm clock shines the time on the ceiling, which saved me from rolling over. The water was hot in the shower and the pressure was good. This will be my home away from home when I am working in the Houston area.", "title": "Great home away from home in Houston", "user": "Toni H", "date": "July 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 168075823}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "We stayed at this hotel due to the fact it was within walking distance to the Houston Stock Show & Rodeo. But the hotel provided transportation every hour to and from it. Upon checking in I noticed this place was pretty much new where the interior still smelled fresh. Out check in process was quick and easy and the staff were very friendly.", "title": "Hidden Gem", "user": "HornFan", "date": "July 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 167238322}, {"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled with family", "text": "all 3 stays, so far...all went better than I expected", "title": "Almost hate to review to let the secret out--what a great place to stay!", "user": "SharonInAVolvo", "date": "September 23, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 178370445}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "I've stayed 2 times with my husband & 1 time on my own", "title": "Pretty decent", "user": "f1999308", "date": "September 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 177154093}, {"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled with friends", "text": "We found the discount rate online all 3 times", "title": "Walkable location to Reliant Stadium", "user": "okietravelgirl", "date": "September 11, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 176805397}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled on business", "text": "Let me tell you we've traveled often--inside the states & overseas", "title": "Clean, comfortable hotel", "user": "Cubagal82", "date": "August 8, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 171336417}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "This was a pleasant surprise to stay here & great value I think for the price", "title": "Best place to stay in Houston", "user": "OKWorldVacationer", "date": "August 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 171179649}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "We were happy and comfortable during our stay. There seems to be a shortage of parking, so we tried not to come back late. Easy access for the Medical Center. Would like a little more lighting in the elevator area. Did not expore the dining portion of the hotel. Staff were very courteous and helpful during my telephone calls and during check in/out. Would stay here again. My husband would have liked an ottoman or low table, as he sometimes need to sleep sitting up.", "title": "Happy Stay", "user": "Lassiter500006", "date": "June 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 165704372}, {"rating": 4.0, "stay_parameters": "Stayed May 2013", "text": "This is one of the nicest Courtyards I have stayed at. It had a very large lobby area, friendly front desk staff, and a decent in house restaurant. I had to cut my trip short, but would have enjoyed staying a few days at this location. It is close to the hospitals, reasonably priced, and there is good shopping and nice restaurants close by.", "title": "One of the higher end Courtyards.", "user": "Samacat", "date": "June 27, 2013", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 165477881}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled on business", "text": "This hotel is only rated a 2 star but I found it to be very comfortable, the room was excellent and a very cool retreat from the heat. It was well located for both downtown, the Medical Center and southern Houston. Parking is free too.", "title": "Houston Business", "user": "Nicos41", "date": "June 27, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 165452968}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled on business", "text": "The staff are very accommodating and allowed me to check in early as I had to get ready for a meeting.", "title": "Comfortable and friendly", "helpfulness": 1, "user": "Explorer_Gene", "date": "June 21, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 164744728}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "There was a small problem with the plug not staying down in the sink and whenever you switch the shower on for the first few seconds the water is brown! But this does clear quickly - I was told that this was an issue they were aware of and it happened in several rooms and they were in the process of fixing it.", "title": "Great deal!", "helpfulness": 1, "user": "andy b", "date": "June 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 164501372}, {"rating": 3.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "Stayed at this Courtyard over the holiday weekend. Overall, the property is okay. The lobby has been updated but the rooms, especially the carpets, need some attention.", "title": "Great staff but the location could be better", "user": "bizandfun", "date": "June 2, 2013", "detail_rating": {"service": 4.0, "cleanliness": 2.0, "value": 3.0, "sleep": 3.0, "rooms": 2.0, "location": 2.0}, "id": 162783597}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "One of the oddest thing was the color of the water from the tub spout. Every morning or when it has not been used for a little while, the initial water that comes out is brown. Upon letting it run for 30 seconds or so it eventually turns normal. Not sure why this was happening.", "title": "Great hotel! Great Workout Facilities", "helpfulness": 1, "user": "RussandAnne", "date": "May 27, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 162005883}, {"rating": 4.0, "title": "Pleasant stay. Excellent staff", "text": "There's a Marriott Residence Inn right next door and their pool area faces the Courtyard. If the pool area is busy then you'll get some of the noise from there but it's not that bothersome.", "helpfulness": 1, "user": "Zacharyb B", "date": "May 5, 2013", "id": 159684102}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled on business", "text": "Overall, the stay was fine. Nothing spectacular but nothing terribly wrong. I would consider another location for my future trips.", "title": "Exactly what you expect from a Courtyard...", "user": "Gobux927", "date": "April 29, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 159178548}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled on business", "text": "We chose this location because it was close to Rice University where our son was graduating. The rooms were impeccably kept. While we were there, we had the opportunity to use the workout facility, which is much better than many hotels. The workout room was large with plenty of equipment. The temperature in the workout room was comfortable too. Each machine in the workout room was equipped with a TV. In addition, we spent time by the pool and in the jacuzzi. This area is beautiful with a lounge area on an elevated level above the pool. Perhaps the only downside of our hotel room is the fact that the hotel uses a dish network. During heavy storms we lost the TV signal several times and were not able to check in on the weather. Still, we had an enjoyable, relaxing stay at the Courtyard and would definitely visit it again.", "title": "Awesome!", "user": "11_CB_11", "date": "April 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 158796459}], "location": {"country": "United States"}, "stars": 3, "variance": {"poor": 3, "average": 14, "very good": 46, "terrible": 6, "excellent": 41}, "aka": "Courtyard Houston Medical Hotel", "slim_ranking": 0.13769751693}