{"user_rating": 4.5, "review_count": 120, "name": "Courtyard by Marriott Jacksonville Flagler Center", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "This hotel is right next to Baptist South Hospital which was the best place for us to stay to visit our loved one in the hospital. You can walk across the parking lot and do not even have to move the car. Very clean and friendly. I would stay there again.", "title": "Nice hotel and convenient location", "user": "bgreenley", "date": "August 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 136376193}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "We had a pleasant one night stay at this location while traveling in Florida a few years ago and decided to stay here once again. Great stay....fairly comfortable bedding, over-sized room for 5 fit our family's needs, very clean, good cooling, conveniently located for us on our return trip home.", "title": "Second stay here in the last couple of years.......", "helpfulness": 1, "user": "abcjjl", "date": "August 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 135991041}, {"rating": 5.0, "stay_parameters": "Stayed July 2012", "text": "We chose once again to pay an additional $10 or so in our rate and enjoyed their made to order breakfast with our kids eating for \"free\". Hot cooked to order eggs are never a bad thing. The kid's love getting pampered by ordering hot chocolate even though the outside temps for the day are in the 90's.", "title": "Wonderful stay", "user": "LanierGolfer", "date": "July 25, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 135384377}, {"rating": 5.0, "stay_parameters": "Stayed July 2012", "text": "Another great stay for our family at this lovely Marriott property.", "title": "Very nice hotel with reasonable rates", "user": "Redseapedastrian", "date": "July 21, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 134995327}, {"rating": 5.0, "stay_parameters": "Stayed July 2012", "text": "Great room, clean pool and whirlpool spa, friendly staff (who gave my son a toy when he walked in the door), wonderful comfy bed. This hotel did it right. We stayed in a 2room suite which was perfect for 3 adults and 1 child while stopping over to come home to Atlanta.", "title": "This is one of the best in jacksonville!!", "user": "cmastr1", "date": "July 21, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 134992662}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "We stayed here on our way home from Sanibel Island. After the bad experience we had on the Sanibel resort, this hotel was refreshingly clean and new. The staff were particularly friendly when we arrived late at night.", "title": "Clean and new", "helpfulness": 1, "user": "pamandmac", "date": "July 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 133644547}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "Decided to stop here on our way to a cruise -- price was right and it was only a couple hours drive to the port in the morning. The hotel itself is clean and the rooms nice. There's a shopping mall just down the road which makes picking up necessities quite easy and plenty of places nearby to eat. No breakfast for us ... not sure if we missed it, or just weren't looking in the right place. We were in a hurry to get going in the morning, so we just grabbed a bite to eat at the McD's just down the road before hopping on the highway.", "title": "Stopover on the way to Port Canaveral for a cruise ...", "helpfulness": 1, "user": "Lasagna329", "date": "July 2, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 133241955}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "We spent the weekend at this hotel for a 3 v 3 soccer tournament at Davis Park. We reserved a King room with sofa bed for three guests. I booked through Priceline and got a great rate (about $30 under the hotel website price) but the staff never treated us poorly and our room was perfect for the entire stay. I was amazed at how spotless the hotel was both inside and out, especially since they were fully booked with families attending both softball and soccer tournaments in the area. Additionally, the staff was very friendly and helpful. The unlimited coffee in the lobby was delicious, and the business area with computers was a great benefit. The hotel offered a very nice hot breakfast bar, but I thought $8.50 per person was a little steep for kids. We hit the local McDonald's just down the street for breakfast instead. There is also an Applebee's within walking distance and a large variety of restaurant options within a 10 mile radius. The hotel was convenient to I-95, restaurants and grocery stores.", "title": "Nice Stay", "helpfulness": 3, "user": "LAD6363", "date": "June 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 131758917}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "My family and I had an awesome experience at The Courtyard By Marriott on Old St. Augustine Rd. The hotel was clean, comfortable, and the breakfast buffet was delicious. The staff was wonderful and friendly. We had a wonderful time and I can't wait to come and stay there again.", "title": "An Awesome Experience!", "helpfulness": 2, "user": "Tricia J", "date": "June 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 131558315}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "Very clean property, rooms are good size with queen bed and pull out couch for the kids, Most negative aspect of the marriott is that breakfast does not start until 7am and when you are playing in baseball tournaments, you have 8am games and practice starts at 7am, so no hotel breakfast. very well kept and very secure facility and parking lot. For the women, its not too far from great shopping at the Town Center.", "title": "Very good place to stay when you play baseball games in Rivertown", "user": "bamafutbal", "date": "June 5, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 131373821}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled on business", "text": "Most would agree there's nothing better than a new hotel. Clean. Modern appointments including comfortable beds and furniture. Spacious designs. Fast internet. And certainly this property meets all those qualities.", "title": "#1 in Jacksonville?", "helpfulness": 2, "user": "Chase71", "date": "September 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 140435467}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "But a hotel is also measured heavily by it's nearby competition. At check in I noticed this very new Courtyard was equipped with a breakfast buffet serving and sitting area. Very nice. Until my head turned and I saw a sign on the front desk counter offering a \"breakfast buffet for $8.95.\" I realize Courtyards aren't typically known to throw in a free breakfast but for a longer term business traveler this fee can add up over time. Nor do I have the time or desire to divert to the drive through at a fast food on the way to work. On a work day I want to leave my room, have breakfast quickly and drive off to work.", "title": "How Nice Can it Get?", "helpfulness": 2, "user": "20_Miles_A_Day", "date": "September 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 140180705}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled on business", "text": "Back to the competition. Close by on the west side of I95 is another super new clean, modern, hotel of similar type from another equally large chain that throws in a free hot breakfast -at the same rates- and also happens to have a nice view as well that is very worthy of your consideration.", "title": "Pleasant Surprise at the Courtyard", "user": "Aimee-Marie1221", "date": "August 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 138530995}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled on business", "text": "As it stands this hotel is very nice. Located In a very modern and clean suburban area. And like its competitor it's a breath of fresh air from the multitude of old and dated hotel properties concentrated in an area just 5 miles north between I-95 and I-295.", "title": "Superb Hotel", "user": "Lesley L", "date": "August 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 138165254}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "I have never stayed in a larger hotel room than the Courtyard Inn Flagler Center. I only wish it could have been for more than one night. The room was about as perfect as it could be. I did happen to notice on the hotel room chart posted on the door that not all rooms were as big as this one.", "title": "Tip top shape and service", "user": "OhioScot", "date": "August 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 136769780}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled with friends", "text": "My husband and I stayed at this property June 2 -4, 2012. We were in town for an anniversary party and this location was closest to the house of our friends. The hotel was clean and well appointed with microwaves, mini fridges, and coffee pots in each room. The bathrooms were very spacious. Best feature has to be the full cook-to-order buffet breakfast they offer for $8.95. It is right off of I-95, one exit up from International Golf Parkway. There is a Starbucks and Applebee's right next door (walking distance) and a Khols and small shopping center right across the highway.", "title": "Good Stay in Jacksonville", "user": "NeedHotelTime", "date": "June 5, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 131368856}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "My only complaint would be that the front desk people were not always visible. There was a \"Be Back in 5 Minutes\" sign that seemed to be up a lot. However, if you would call, they always answered right away.", "title": "Secluded But In The Middle of Everything", "helpfulness": 1, "user": "cokeguy72", "date": "May 22, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 130424928}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "Nice hotel with excellent staff. Conveniently off I-95 and just south of I-295 intersection. No complaints during our recent 4-day stay. Front desk staff very helpful and had good knowledge about all nearby attractions. Service staff very diligent about cleaning rooms and keeping hotel in good, clean condition. Internet connection in the lobby was very slow - could use a boost here! Location provided easy access to: TPC Sawgrass, World Golf Village, St. Augustine Beach, San Marco neighborhood & downtown Jacksonville, and St John Town Center retail development. Plenty of golf, beach, big city and all sorts of dining within 20-30 minutes!", "title": "Good choice", "helpfulness": 1, "user": "Mike49673", "date": "May 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 129804603}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled on business", "text": "Made a stop with the family on our way to Orlando. Clean hotel. Very spacious and clean rooms. They have a great breakfast area with omelettes, waffles, etc., not just your standard 'continental' breakfast you see at other hotels. Got the room rate that included breakfast for an extra $10 per night. Great value for a family of 4. Friendly staff. Starbucks next door and decent amount of fast food in the area.", "title": "Wonderful Marriott", "helpfulness": 1, "user": "Mira15", "date": "May 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 129428101}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "Remote control's batteries were old. No Disney channel for the kids. Beds were more firm than what I'm used to. Nothing to be upset about. Happy we chose to stay here.", "title": "Good Courtyard property", "user": "Duane B", "date": "May 3, 2012", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0}, "id": 129329012}], "location": {"country": "United States", "city": "Jacksonville"}, "stars": 3, "variance": {"poor": 3, "average": 5, "very good": 37, "terrible": 3, "excellent": 72}, "aka": "Courtyard By Marriott Jacksonville Flagler Hotel Jacksonville", "slim_ranking": 0.174242424242, "description": "The award-winning Courtyard by Marriott Jacksonville Flagler Center is taking extraordinary steps to stay ahead of the changing needs of hotel travelers and will be undergoing a renovation to make improvements to enable our guests an experience that promises greater comfort and enhanced productivity. We will be taking great strides during this time to ensure all guests are comfortable, can function with ease and will remain in control of their experience at the hotel.This Jacksonville, FL, hotel is 10 minutes from downtown Jacksonville and a quick 20-minute drive to Jacksonville beaches. While staying with us, take advantage of our close proximity to St. Augustine, JT Butler Boulevard, Deerwood business district, Baymeadows Road, Baptist Hospital, Mayo Clinic, Ally, Citi, Allstate and world-class TPC golf! Outfitted with plush bedding and contemporary furnishings, comfort and convenience are guaranteed at our hotel in Jacksonville, FL! Complimentary high-speed wireless Internet ensures you are never out of touch. Our Jacksonville, FL, hotel’s meeting room allows for affordable events, and our attentive staff will deliver true Marriott hospitality. Courtyard Café serves a bountiful breakfast buffet with a la carte options daily. Relax in our trendy lobby bar with a light fare dinner menu and cocktails."}