{"user_rating": 4.0, "review_count": 709, "name": "Courthouse Hotel", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled on business", "text": "Guest service at the hotel was excellent. Sahil at the Front desk was outstanding in his attentiveness and guest relations skills. However, the breakfast offerings at the restaurant for Diamond members were limited and not particularly tasty. (I was expressly informed that only continental breakfast was applicable!). Sadly also, while the hotel advertises that it offers wifi, the wireless internet was either painfully slow or nonexistent. For the first few hours of my first night's stay i was without internet until a pleasant employee - Bilal kindly came up to the room and assisted. For the final night of my stay, there was NO wifi whatsoever. My complaints were met with responses that the hotel has been having problems with their service provider for a while. This was not particularly helpful especially when one considers that the hotel's \"business centre\" is really a closet behind the concierge desk with only 2 workstations.", "title": "Quality Service...wifi nah!", "user": "Kenn_P", "date": "October 17, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 119396905}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled with friends", "text": "Overall the hotel is decent; the rooms are clean and comfortable (room 617 is fantastic!) and the staff very helpful and attentive. Wifi and meals need improvement.", "title": "Great Location, Great Staff, Large and Clean Rooms", "user": "littleamen", "date": "October 13, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 119245197}, {"rating": 3.0, "stay_parameters": "Stayed October 2011, traveled with friends", "text": "On my trip to London I've stayed in two different hotels (this one and the Crowne Plaza on Buckinham Gate) and the Doubletree was hands-down my favorite.", "title": "Groupon champagne tea deal", "helpfulness": 2, "user": "RobCroydon", "date": "October 10, 2011", "detail_rating": {"value": 4.0, "service": 3.0}, "id": 119132663}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled on business", "text": "The hotel is in a great location with LOADS of shopping, pubs and restaurants within a short walk. The rooms are clean, large, comfortable and modern.", "title": "great location and staff!", "helpfulness": 1, "user": "Antonio F", "date": "October 9, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119115040}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "The staff is first-rate. Always friendly, always very helpful. We stayed on Hilton Points yet still received all of the normal perks for Hilton Honors members at my level (free breakfast, free wifi, room upgrade, etc).", "title": "Second time around and much better than before.", "user": "Liam1962", "date": "October 8, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 119077680}, {"rating": 1.0, "title": "This hotel has mice... Fact!", "text": "Well, my 3rd stay at this hotel ended in disaster. We were getting into bed at1am when I noticed a mouse shooting out of the bathroom, it ran under the bed, under the tv table, back under bed and back into bathroom. We were screaming! I rang reception who very kindly moved us to another room, above a bar with banging music! Again they moved us to another room, making us feel as if we were too much trouble. The third room had a bathroom which smelt of sewers but by this point we were tired and 'put up with it'.", "helpfulness": 3, "user": "Claire C", "date": "October 8, 2011", "id": 119061876}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "The next morning we complained to the reception manager who offered us free breakfast, we didn't want to eat in the hotel, especially not when he informed us someone had noticed a mouse in the bar too! After lengthy negotiations we were offered a 50% reduction on the room. £150 for a hotel with mice? A hideous solution, considering our dramas. I thought they would've happily wavered the charge entirely. A little tip for you...... If this happens to you make sure you catch the mouse as evidence you might just get a more sympathetic offering! We stayed here on 1st October 2011. Be warned!", "title": "Private Cinema at The Courthouse :)", "helpfulness": 4, "user": "AngelLondon_UK", "date": "October 7, 2011", "detail_rating": {"value": 5.0, "location": 5.0, "service": 4.0}, "id": 119029367}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "I bought 2 vouchers from Travelzoo (£15 each) for a private cinema screening at The Courthouse Doubletree - what a great offer. For starters, I never knew that there was a private cinema in this hotel! Part of our deal was entrance to a Saturday film of your choice, a cocktail in the Hotel's bar, tub of Haagan-Dazs, fresh bucket of popcorn and a bottle of still mineral water. Every Saturday they show a film (old / new / black&white). The hotel used to be a court hence the name and has retained some of it's original features which was cool. The bar was sophisticated and had kept the old prison cells and made them into seating areas. Staff were conscientious and polite. Our cocktails were so good, we ordered a couple more different ones to sample before the film. The cinema was luxurious (beats your local Odeon anyday), it was small and intimate, nicely decorated and chairs large and extremely comfortable. A very enjoyable evening and for such a great price too!", "title": "Interesting place to stay", "helpfulness": 1, "user": "ccbozard", "date": "October 6, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 118992028}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled with friends", "text": "The history of this building makes this an interesting place to stay. The rooms are very large by Euopean hotel rooms size standards. Staff was very helpful in helping us find whatever we asked for. The breakfast was good, everything was clean and interesting. I have it a 4 instead of a 5 only because it isn't 5 star luxery. But it IS a great place to stay.", "title": "A great way to end our vacation!", "helpfulness": 4, "user": "bighairvicki", "date": "October 2, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 118860255}, {"rating": 3.0, "stay_parameters": "Stayed September 2011, traveled on business", "text": "In the last couple of nights of our vacation to the UK, we were booked to stay at the Courthouse Doubletree on Great Malborough Street off Regent Street and a hop, skip and a jump to Soho. The Courthouse is aptly named as it used to be one, and therefore the property sports some interesting features, not the least of which is the ground floor bar where one can reserve booths in the old prison cells. Definitely worth a beverage and photograph! The decor is very welcoming, and the large downstairs open lounge is perfect when you want to relax and use the free Wi-Fi. We reserved a table on the rooftop terrace. In sunny or crisp weather it's the perfect way to wind down, but definitely reserve if you want to experience it - the London business folk are in the know and they tend to make their way up there after work. The mojitos and twist on the Long Island Iced Tea are delicious - I speak from personal experience. Our room was a twin - a good size with a nicely designed bathroom, complete with bidet and large tub. When you first sit on the beds you might find them firmer than you're used to, but I'm here to tell you that they are all kinds of comfortable. Both of us had a great night's sleep. The only thing that we might have liked would have been a wider selection of TV channels. I'm sure people think \"Why would you want to watch TV when you're in one of the most vibrant cities in the world?\" When you finally get back to your room, you want to watch something other than the news - there are limited choices. There are pay movies, but there were many more free channels available when we visited smaller town hotels outside of London. The drink service in both bars was also a little slower than we would have preferred. It could be that they need more staff on when it's busy, or that the fancy drinks require longer to prepare. Both of these comments are minor points and certainly did not lessen the enjoyment of our stay there. A shout out to Zoltan at Concierge who went completely out of his way to look after us. This hotel is SO well located! Visit the shops, bars and restaurants of Soho - so close that you could do it in stilettos and not worry about your feet killing you at the end of the night. You can also wander up and down Regent Street, or turn the corner to Oxford Street to shop, shop, shop! Would definitely recommend staying here.", "title": "Location perfect - some minor annoyances", "user": "666-HIM-666", "date": "September 25, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 118564340}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "Thanks to the Courthouse for another great stay, this is the second time I've been back and it won't be the last. Our room was beautifully decorated and very comfortable. It was the biggest and most comfortable bed I've ever had the pleasure of sleeping in! The service was brilliant, reception staff were incredibly helpful and professional and room service was spot on. We also had drinks in the bar on Saturday night, not very often you get to drink delicious cocktails in such unusually glamorous surroundings. Great hotel in a great location, you can't ask for more in central London. Fantastic!", "title": "Fantastic!", "helpfulness": 1, "user": "Explauragibb", "date": "November 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 145058572}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "My girlfriend and I recently stayed at the Courthouse on a Saturday night. We had booked the \"King Large Guestroom\".", "title": "Top Notch!", "helpfulness": 1, "user": "1Curzon", "date": "November 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 145029666}, {"rating": 2.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "The room was perfect. The bedroom was large and warm with nice detail. The king size bed was very comfortable. The interactive TV was easy to use. Besides the bedroom there was a compact lounge area, with comfortable seating, table and television. The bathroom was quite grand and finished in marble. It looked and felt very luxurious. Everything was immaculate and we were very pleased.", "title": "Seriously disappointing", "helpfulness": 1, "user": "SJM222", "date": "November 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 1.0, "sleep": 3.0, "rooms": 1.0, "location": 5.0}, "id": 144884052}, {"rating": 2.0, "stay_parameters": "Stayed November 2012, traveled with family", "text": "The staff were great, on arrival and departure. We ordered room service (a late lunch) and we had to wait no time at all for it to arrive at our room.", "title": "Afternoon Tea", "helpfulness": 1, "user": "downley64", "date": "November 6, 2012", "detail_rating": {"value": 2.0, "service": 4.0}, "id": 144742848}, {"rating": 1.0, "stay_parameters": "Stayed November 2012, traveled with friends", "text": "We ate out that night and had breakfast in the Hotel the next day. The quality and selection of breakfast foods was very good indeed.", "title": "worst champagne afternoon tea I have ever had.", "helpfulness": 2, "user": "PatchesLondon", "date": "November 5, 2012", "detail_rating": {"value": 1.0, "service": 3.0}, "id": 144686224}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled with family", "text": "Obviously excellent location. No problems to report as due to the nice location you spend most of the time outdoors. Staff was friendly and room was comfortable enough. As a hotel is not anything exciting thus keep your expectations low and you will have a good time", "title": "Good package", "user": "Solomon64", "date": "November 25, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 146120610}, {"rating": 3.0, "stay_parameters": "Stayed November 2012, traveled on business", "text": "Expectations:", "title": "Nothing special", "user": "jonashomaa", "date": "November 22, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 145944839}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled on business", "text": "Considering the price I expected an above average hotel for a business stay.", "title": "Location, location, location...", "user": "Hildur O", "date": "November 14, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 145382126}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "Hotel:", "title": "Loved every minute of it!!!", "user": "Mark H", "date": "November 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 145367298}, {"rating": 2.0, "stay_parameters": "Stayed November 2012, traveled with family", "text": "Nice from the outside. Great location. OK decor etc.", "title": "Very funny - worst tea experience ever!", "helpfulness": 1, "user": "WarwickshireMog", "date": "November 13, 2012", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 4.0, "service": 2.0}, "id": 145324600}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "My husband and I stayed here for 5 nights in May. It's a great location for shopping since it's at the top of Carnaby Street but that also makes the neighborhood a bit congested. It was a short walk to the tube station which allowed us to get to many places in London easily. The staff was helpful with directions. The breakfast was very good. At least 3 mornings I would run down to Hyde Park for my morning run. I really loved how close it was to the park. The room was great and super clean. It's an excellent location for exploring London.", "title": "Great Location for London Shopping", "user": "LizzChicago", "date": "November 2, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 120065872}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled with friends", "text": "This is the place to stay at! The location was absolutely perfect; very central to everywhere in London---- stay here!! The hotel is charming and very clean! It was such a cute hotel compared to some of the bigger HIltons that are out there-", "title": "Perfect location; great hotel with amazing service", "user": "travelgirl6877", "date": "November 1, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120027913}, {"rating": 2.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "The service was really great- Tiago at the front desk was so helpful and the Ladies at the Sanook spa were so nice! Monica at the bar was friendly too! Everyone including the maid staff was wonderful----truly a great staff at this hotel! I will be back!", "title": "Not a great experience", "user": "Rachel B", "date": "October 19, 2011", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 2.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 119469386}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled with friends", "text": "Great location - if you don't need to stop outside to unload your luggage as there is no bay outside for offloading vehicles and we were advised that there are camera's monitoring the road which could see you ending up with a fine.", "title": "Outstanding service", "user": "Michael H", "date": "October 18, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 119454976}, {"rating": 5.0, "stay_parameters": "Stayed October 2011", "text": "The room - no air conditioning, television picture was terrible, the kettle had to be plugged in on the floor in front of the front door, the marble threshold to the bathroom stood high and could cause a nasty injury if you didn't pick your foot up high enough (trip hazard) and the shower thermostat didn't work giving us a cold, warm, hot, cold, hot, warm shower!", "title": "Great Hotel, fantastic location!", "user": "Mariocuomo", "date": "October 17, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 119409127}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "Stayed here with my husband for a nights stay. There was a warm welcome and a warm cookie which was avert nice touch. The staff were very friendly and helpful, making sure we had an umbrella for the rain.", "title": "Great stay, great staff", "user": "johnsonclan", "date": "November 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 144637650}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled on business", "text": "The room was amazing as was the breakfast in bed. The bar area is very nice and relaxing, bar food and cocktails were of a very high standard.", "title": "Heck of a deal and a very pleasant surprise", "user": "NYCguy71", "date": "November 5, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 144593479}, {"rating": 2.0, "stay_parameters": "Stayed June 2012, traveled on business", "text": "The location is excellent with shopping, restaurants and bars within walking distance.", "title": "Disappointed", "helpfulness": 1, "user": "Argiro F", "date": "November 2, 2012", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 2.0, "sleep": 2.0, "rooms": 3.0, "location": 5.0}, "id": 144290759}, {"rating": 3.0, "stay_parameters": "Stayed October 2012", "text": "Thank you to all staff in making this an enjoyable and relaxing stay.", "title": "5 Star Hotel ??", "user": "gruberhanz", "date": "October 29, 2012", "detail_rating": {"cleanliness": 4.0, "location": 5.0, "rooms": 3.0}, "id": 143977881}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled on business", "text": "We will definitely pass on this hotel as a must stay for anyone visiting London", "title": "Very nice location, very friendly service, warm cookie", "user": "Dicksan", "date": "October 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 143845865}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "What a great location: right at the top of Carnaby Street (for your breakfast, fun and pubs); a block from Oxford Street (for shopping) and a block from Oxford Circus Tube (for your transport). Pret et Manger and Starbucks right across the road. We chose the hotel based on Honour Points availability and were very pleasantly surprised by the location and quality of the hotel.", "title": "Great Location, Good Hotel", "user": "The_Lewis", "date": "November 28, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 146373774}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "Room was not large, but have stayed in smaller for a similar price in London (as hard as that may be to believe). During our stay, new 40 inch TVs were installed which answered perhaps the only criticism. Good heating, hot water and water pressure.", "title": "Hilton Courthouse Regent Street", "helpfulness": 2, "user": "GLOBEVISITOR", "date": "November 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 146283692}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled with friends", "text": "The Front Desk and Concierge desk were pleasant and helpful.", "title": "Lovely spa experience", "user": "Realist71", "date": "November 26, 2012", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 5.0}, "id": 146240334}, {"rating": 2.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "Stayed on the 23rd to the 25th of November 2012.", "title": "Did not have the 'wow' factor", "user": "Peter Mills", "date": "November 26, 2012", "detail_rating": {"value": 2.0, "location": 4.0, "service": 3.0}, "id": 146229795}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "Stayed in standard room before and it's too small for me. Stayed in Executive room 221 on the second floor this time. Much bigger and comfortable and very very quiet. I think road facing will be noisy from the traffic.", "title": "CLEAN-COMFORTABLE-CONVENIENT", "user": "northantsshiner", "date": "November 26, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 146226257}, {"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "We really enjoyed our stay in London. I've been many times, but it was my husbands first trip to the UK. The location could not be better! The staff was so friendly and the charm of the hotel is unbeatable. For European standards, this room is much much larger and comfortable. While the bed was a little on the hard side, it was spacious and clean. The bathroom was great as well!", "title": "Fantastic Location, Great Room", "user": "MTravels13", "date": "September 21, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 118431915}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled on business", "text": "Only negative would be that this place could use a much better English breakfast. Other than that, we're excited to go back and stay at the Doubletree again very soon!", "title": "\"Excellent service.Fantastic spot.\"", "helpfulness": 1, "user": "Simone S", "date": "September 16, 2011", "detail_rating": {"value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 118197705}, {"rating": 2.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "What a great hotel. Fantastic position right in the middle of the city. Stones throw to anything the shopper/partier/tourist may want. The service was very personal and outstanding. The pricing was as you would expect for a top quality property in such a location but still very reasonable, I thought. The beds are excellent and the bathrooms are also very good. I will definately be staying next time I am in London.", "title": "A poor second visit!", "user": "CLW_Highwinds", "date": "September 14, 2011", "detail_rating": {"value": 1.0, "location": 5.0, "service": 5.0, "rooms": 1.0}, "id": 118101916}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled with friends", "text": "Stayed August 2011, travelled as a couple", "title": "Cinema at The Courthouse - Fantastic evening", "helpfulness": 1, "user": "Stephanie J", "date": "September 11, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "service": 5.0}, "id": 117947036}, {"rating": 1.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "We stayed at the Courthouse last September on a great deal and thought it a great hotel so we naturally decided to book again for our recent trip. It definitely has a great location, with great staff however the standard is far from acceptable for the price we paid for a 5 star hotel. Rooms are very very tired, finishes in the bathroom falling apart. No hot water in the shower when we first arrived and had to call maintenance twice. One saving grace is the Carnaby Resturant - on both trips the food was wonderful, with pleasant staff and we were remembered from our last visit.", "title": "Location is the only good thing in this hotel", "helpfulness": 3, "user": "Khaled_10", "date": "August 31, 2011", "detail_rating": {"cleanliness": 1.0, "sleep": 2.0, "value": 1.0, "service": 3.0}, "id": 117492797}], "location": {"country": "United Kingdom (UK)", "continent": "Europe", "city": "London"}, "stars": 5, "variance": {"poor": 66, "average": 111, "very good": 239, "terrible": 52, "excellent": 241}, "aka": "The Courthouse Doubletree By Hilton Hotel", "slim_ranking": 0.407063197026, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "description": "Set in the heart of London’s bustling shopping and theatre district, the Courthouse offers a great location for business and leisure travelers. The Hotel is situated in an old Grade II Listed Magistrates Court, retaining much of its original historical features with a modern twist. While staying with us you can enjoy a meal in Silk restaurant who has been converted from the old Number One court, relax in Sanook Spa or enjoy a cocktail on our roof terrace or in one of the cell in the bar..."}