{"user_rating": 4.0, "review_count": 84, "name": "Courtyard Newark Downtown", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled solo", "text": "First be aware that the airport shuttle runs only once an hour. As of now it departs the Hotel Shuttle area P4 at 40 minutes after each hour. Hotel check-in was friendly, and fast. Beautiful lobby, bar and dinning area. The lobby is located on the second floor. Elevators and hotel room doors are accesible by your key card. Rooms are very nice, large bed, flat screen TV, free wifi, nice bathroom which was spotless. There is a Bistro and bar on the lobby level, light meals can be purchased and the one I had for dinner was very good. Check-out was also quick and the shuttle left right on time, which as of this review on the hour. The street that the hotel is located on is not an area that I would recommend walking around at night, this street may be going through redevelopement, but at this time it is a distressed sight to see.", "title": "New, Nice, and Enjoyable", "helpfulness": 1, "user": "yvr1", "date": "March 19, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 2.0}, "id": 155066438}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled on business", "text": "I had the pleasure in staying at the new \"Coutyard\" hotel in Downtown Newark. The Hotel is well laid out, very nice spacious room, and a wonderful staff. I checked in Friday afternoon. I decided to take the train into NYC. The Front Desk staff told be the route, advised me on where to go, etc. At one point, I left my cell phone charger @ home, and the girl at the Front desk lent me hers!", "title": "Great Hotel and staff", "user": "Canuckwilltravel", "date": "March 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 154944825}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "Check in was a breeze. The hotel is new and very nice. The rooms are very nice as well. Fridge, coffee maker, and iPod docking station in the room. I placed an order from the Bistro and the server was friendly and accommodating because I needed my smoothie to be non-dairy. One thing to note is you do have to walk out of the parking garage and around the corner to the hotel but it takes about 2 minutes. There is no inside bridge connecting the hotel and parking garage. I called for extra pillows and a blanket and it was delivered right away. Housekeeping staff was very nice as well.", "title": "Great Option", "user": "Lyoness815", "date": "February 21, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 152725882}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled solo", "text": "I stayed here just one night in mid-January 2013 as a stopover in between flights from Berlin to Vail. The Courtyard offers an airport shuttle to EWR, which I believe runs once an hour, leaving the hotel on the hour. I was lucky and didn't have to wait long for pickup at the airport. Upon arrival at the hotel I was welcomed with a scratch-off card and won a free item from the small food shop and chose a $9 sandwich. The check-in guy was friendly and efficient. My room was spacious, modern and clean and had a coffee maker and free wifi, which worked without a hitch. After a quick nap I walked to Newark Penn Station to take a Path train into Manhattan ($4.50 roundtrip, 45 minutes each way). The station is about six blocks away (12-minute walk). Leaving the hotel I felt like I was the only white guy among about a hundred people on the main street, but after I turned the corner and went towards the sports arena, it was again a different world with a typical city mix. Downtown Newark is kind of boring with a poor selection of retail establishments, but it was nice to be so close to the Path train and not have to pay at least $25 to take the other trains into NYC. There was no free breakfast, but there is free coffee in the lobby as well as Internet. The check-out woman on Sunday wasn't as friendly as the guy, but it was fast and problem-free, just like check-in. I will probably stay here again in the future.", "title": "good value and convenient for Newark airport stopovers", "helpfulness": 3, "user": "polyglotandy", "date": "February 17, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 152384426}, {"rating": 2.0, "stay_parameters": "Stayed February 2013, traveled with friends", "text": "I stayed here February 9th. Property is obviously brand new. Staff, not so much. Front desk reception, rude. Guy that sits at the front door had headphones in the whole time and if we tried to ask directions or anything, he said that wasn't his job! Room was clean and simple. No complaints there. Not happy with staff at all. Not staying there again.", "title": "Not my first choice", "user": "kacy d", "date": "February 11, 2013", "detail_rating": {"service": 1.0, "cleanliness": 5.0, "value": 1.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 151890329}, {"rating": 1.0, "stay_parameters": "Stayed November 2012, traveled with friends", "text": "Talk about a disappointment! The only thing going for this hotel is how close it is to penn station.", "title": "Not worthy of the name Marriot", "helpfulness": 2, "user": "Jennieve01", "date": "December 10, 2012", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 1.0, "sleep": 3.0, "rooms": 1.0, "location": 4.0}, "id": 147149655}, {"rating": 2.0, "stay_parameters": "Stayed November 2012, traveled with family", "text": "If you are thinking of staying here just don't do it!", "title": "Lousy Room Design Leads to Interrupted Sleep", "helpfulness": 4, "user": "tdh42", "date": "November 26, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 1.0, "rooms": 4.0, "location": 3.0}, "id": 146255282}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled with family", "text": "The amenities are non existent. The complimentary toiletries consist of soap, shampoo and conditioner.", "title": "Great Hotel!", "helpfulness": 1, "user": "YvetteCee", "date": "November 24, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 146115797}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled solo", "text": "The staff is negligent at best and rude at worst. When we called for a bell man they brought a cart to our room and left.", "title": "excellent!!!", "user": "ncnyc1126", "date": "November 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 146055338}, {"rating": 3.0, "stay_parameters": "Stayed November 2012, traveled with friends", "text": "I could hear conversations from other rooms through the vents.", "title": "Good choice for Pru Center events.", "user": "intlV", "date": "November 12, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 3.0}, "id": 145263419}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with friends", "text": "I needed a room near NYC the weekend of New Years Eve and the hotels in the city were impossibly expensive. I found this hotel and decided it was worth the risk as I'd never been to downtown Newark and was a bit worried about the city's reputation.", "title": "Found my new New York City secret hotel", "helpfulness": 1, "user": "PassTravelF00l", "date": "January 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 148757348}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled solo", "text": "What I found was a great hotel in a neat area with excellent and easy access to NYC. The hotel is a quick five minute walk to Newark Penn Station and that is just a one stop on NJTransit into NYC Penn Station. The hotel is behind the Prudential Center and the neighborhood is rebounding quickly with new restaurants and shops.", "title": "Convenient and attractive", "user": "Alextheplanner", "date": "December 30, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 148394273}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled solo", "text": "The hotel is new and clean, the staff friendly and helpful and the internet fast and reliable. I'll be back to visit NYC and Newark again and I'll certainly make this hotel my top choice!", "title": "Excellent", "helpfulness": 1, "user": "Sween12345", "date": "December 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 147744648}, {"rating": 4.0, "title": "Great If You're Going To \"The Rock\"", "text": "I used to work near the hotel, and I am very familiar with the neighborhood and its gems, like the awesome shop 2 blocks away that sells great coffees, nuts, dried fruits, etc (Ward's Coffee and Teas) and the funky health food store next door, where the ladies running the place dish some attitude while making your organic soy and seitan wrap. I was in town to check up on the house I still own in the area, and selected the hotel since I saw it getting built before I relocated out of state.", "user": "A TripAdvisor user", "date": "December 17, 2012", "id": 147629991}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled with family", "text": "I was impressed. The room is attractively decorated and laid out. The lobby has a nice atmosphere, and the neighborhood is really turning around with some funky, urban things mixed in with new brew pubs and sports bars. I asked for a room facing Broad Street because I like the lights and energy when I'm waking up.", "title": "Excellent Location for Prudential Center event", "helpfulness": 1, "user": "Marykatesmom", "date": "December 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 5.0, "location": 3.0}, "id": 147233779}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled on business", "text": "Overall I was pleased by this hotel. Staff was very friendly and helpful, good food choices in the Bistro, nice gym layout and equipment.", "title": "Good location, great staff", "user": "Brad B", "date": "February 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 151637095}, {"rating": 5.0, "stay_parameters": "Stayed February 2013", "text": "Only drawbacks are what appear to be some sloppy work from a construction standpoint, tub faucet loose, missing caulk, etc. and one weird anomaly. Intermittently, I could hear phone conversations and music coming from the vent above the bed.", "title": "Great hotel", "helpfulness": 2, "user": "A3754w", "date": "February 7, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 151621229}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled on business", "text": "Had business in Newark and stayed at this hotel. It was very clean and very nice. I think it's a fairly new hotel and the staff is trying to keep it as beautiful as possible. The only thing I didn't like was that there's really nothing to do around there. Penn Station Newark is close and the hotel runs a shuttle there every hour.", "title": "Pleasant Experience", "user": "nickelman4243", "date": "January 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 149881873}, {"rating": 5.0, "stay_parameters": "Stayed January 2013", "text": "I would definitely stay there again.", "title": "Great choice in downtown", "helpfulness": 1, "user": "TuckerHost", "date": "January 10, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 149375543}, {"rating": 4.0, "stay_parameters": "Stayed January 2013", "text": "What a very nice property in the middle of downtown Newark, NJ. Very new, extremely clean, well decorated, pleasant rooms and friendly staff. What more is there to say. If again in this area for business I would definetly stay at this property. If you wanted you can walk to Penn Station Newark, and take the train into NYC.", "title": "Very clean and friendly stay... Brand new.", "helpfulness": 3, "user": "Sabi5150", "date": "January 4, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 3.0, "service": 5.0, "rooms": 5.0}, "id": 148785725}], "location": {"country": "United States", "city": "Newark"}, "stars": 3, "variance": {"poor": 3, "average": 9, "very good": 38, "terrible": 1, "excellent": 33}, "slim_ranking": 0.047619047619}