{"user_rating": 4.5, "review_count": 98, "name": "Crestwood Suites Lakeland", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "This is the best motel I have ever stayed in and I have traveled alot. The motel is the most friendliest, cleanest, most accomodating, beautiful, relaxing and the pool is like an oasis! The only thing missing is a waitress bringing you a pina colado but I am sure that if you requested a drink, the excellent staff would find a way to accomodate! As you can see, I have the highest regards for this motel and everything about it. Our first visit here a few years ago was so exceptional and inviting, we came back for a few more years, they are still so exceptional that we are now moving to the area! With living here, I belive that I may just have to take a vacation back to this motel once in awhile since I know I will be treated like a queen!", "title": "The absolute BEST-Don't even bother going anywhere else!!!", "user": "amoswi", "date": "September 27, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 45066187}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled on business", "text": "I have to say I was very impressed with the hotel my cousin chose for me to stay during her wedding. I was very hesitant at the beginning as I have never heard of the Crestwood Suites before. The hotel has a very contemporary vibe to it! The room was amazingly beautiful and extremely clean.I will recommend this hotel to all my family and friends. I think my cousin made a great choice!!", "title": "Best Hotel Experience", "user": "trav_09PPines", "date": "September 22, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 43651408}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled with family", "text": "Excellent place to stay. I love the staff. Even have breakfast for you! Lots of parking! Even allows pets.", "title": "great place to stay", "user": "g8rruler", "date": "September 8, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 40179050}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled on business", "text": "* Close to different restaurants and gas stations", "title": "Extremely Nice, Clean, Friendly and Affordable", "user": "bayviewresidents", "date": "September 4, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 39795146}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled with family", "text": "* 7 to 10 miles away from Downtown Lakeland", "title": "what a deal for such a beautiful hotel and staff", "user": "hvyd", "date": "September 4, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 39780515}, {"rating": 3.0, "stay_parameters": "Stayed February 2010, traveled with family", "text": "This hotel was good, but not top notch for the cost/expectation, particularly the current Trip Advisor #1 ranking in area. The staff was very friendly, but not knowlegeable enough to make area restaurant recommendations. The breakfast buffet (complimentary) should be upgraded. They were out of stock of certain cereals and fruit most of the week and the selection was very limited; no yogurt offerred.", "title": "Good but not great", "helpfulness": 2, "user": "Travel10Michigan", "date": "February 21, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 56671610}, {"rating": 4.0, "stay_parameters": "Stayed January 2010, traveled with friends", "text": "The internet was free, but very slow and continuously went down. My son repeatedly called their front desk and internet provider, with minimal success in improving the internet service. The in room flat screen TV was excellent; well positioned and top notch. Showers were very good.", "title": "Above my expectations", "user": "rmwhitte", "date": "January 14, 2010", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 3.0}, "id": 53477623}, {"rating": 5.0, "stay_parameters": "Stayed January 2009, traveled on business", "text": "Note that room service is limited to only changing towels and emptying garbage daily. Not full service room cleaning.", "title": "A great play to stay in Lakeland", "user": "Lobini", "date": "January 13, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 53418323}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "The location is good to visit the Detroit Tigers for spring training and midway to downtown (few local restaurants) and chain restaurants in the other direction. Easy off from the highway.", "title": "The staff were very friendly and helpfull", "user": "Jazzy_10", "date": "January 11, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 53193771}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "I was in town for wedding on what was the coldest weekend since the 1970s in central Florida! The staff of Crestwood Suites was so friendly and accomodating at every moment. From giving 6 bridesmaids in one suite a ridiculous amount of requested towels and blankets, to having a left behind cell phone shipped out immediately to Virginia! We really enjoyed our stay and especially enjoy the continental breakfast that included waffles each morning...this really exceeded our expectations!", "title": "Very Nice Place to Stay!!!!!!", "user": "colton88", "date": "October 12, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 46669108}, {"rating": 3.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "Summing up in advance..... It's ok if there's nothing else available, but I would recommend looking elsewhere for a room in Lakeland. They're disorganized, bare bones and they took a copy of my drivers license when I checked in. The drivers license issue is the number one reason why I won't go there again. Everything just struck me odd for a hotel. As my mother would've said \"this would be a good place to open a hotel\"! Sorry for the long review ...... I had a lot to say! :)", "title": "meh.....", "helpfulness": 2, "user": "KarenSMichigan", "date": "March 23, 2010", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 59357011}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled on business", "text": "Here's my story....", "title": "Great Stay Very Pleased", "user": "yousif1", "date": "March 23, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 59352915}, {"rating": 4.0, "stay_parameters": "Stayed December 2009, traveled with family", "text": "I made reservations on Feb. 5 with Jameson Inn for March 4 and 5. Nine days prior to our arrival, I received a phone call from them asking if we would agree to be moved to Crestwood Suites (across the street from the Jameson) due to an \"overbooking situation\". Crestwood is their \"sister\" property. After checking on TripAdvisor and knowing that between spring training and spring break, it might be difficult to find somewhere else to stay, we agreed to the move.", "title": "We were quite satisfied...", "user": "WanderingPencil", "date": "March 15, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 58670308}, {"rating": 2.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "After checking in (more on that topic below), there was a problem with our room. As we entered our room, we realized we'd been given a smoking room (I had reserved a non-smoking room with the Jameson Inn). I called the front desk and they did have a non-smoking room available, but it was a double queen room, not a king as I had reserved. Not a big deal and actually may have worked to our advantage as the non-smoking queen room seemed a little bigger than the smoking king room. Anyway, they quickly came up with our new keys and apologized profusely. They said that it had been a little crazy and so hectic because of all the folks being sent over by the Jameson. My first thought was that I was aware of being moved from the Jameson to Crestwood nine days ago - seems they would've been aware of the \"overbooking situation\" and prepared accordingly.", "title": "No Room Cleaning Service", "helpfulness": 4, "user": "dcallan", "date": "March 2, 2010", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 57562853}, {"rating": 4.0, "title": "Clean-great staff.", "text": "Pros: The room was fine.... nicely furnished and the sectional sofa was great.... the bed was comfortable.... the location was very good in relation to Joker Marchant stadium..... Cracker Barrel right across the street ..... It was cheap (we were given the Jameson rate of $65 a night.... not sure what the actual rate for Crestwood would've been).", "user": "mom51", "date": "February 22, 2010", "id": 56748463}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "I travel to FL quite often visiting friends and this is the first time I stayed at Crestwood Suites. When I walked into my room, I was quite surprised at how nice it was! All new furniture, nicely decorated, and everything you need to feel just like home. We have cooked in every night that we've been here. The service is also great and very timely with all your needs. Great location too. I'd definatly recommend this to anybody coming into the Lakeland area.", "title": "There is a place like home", "user": "Crystalm1023", "date": "September 3, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 39697725}, {"rating": 2.0, "stay_parameters": "Stayed February 2009, traveled solo", "text": "Just returned from a 3 night stay at the Crestwood Suites. Lobby is clean, hotel is relatively new and check-in a breeze. Suites small but sufficient with a kitchenette with large refrigerator, microwave, stove and dishwasher Upon arriving back in my room one evening, I found my room exactly as i left it in the morning. Called downstairs to complain and was told that the hotel does not offer daily cleaning service, just towel replenishment! I was shocked. Cleaning your own room, bathroom, etc. would require the purchase of cleaning supplies I imagine, not to mention the kitchen. I would not stay here again because of this.", "title": "convenient but offers no daily room cleaning service!", "helpfulness": 2, "user": "bluemichel", "date": "February 25, 2009", "detail_rating": {"cleanliness": 2.0, "value": 3.0, "location": 3.0, "service": 1.0, "rooms": 3.0}, "id": 25141615}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "When looking for a hotel in the Lakeland area, there were several choices. As budget-minded travelers, we try to find the best deal but also a really nice place. We are not always successful. But I have to give my wife credit for finding this gem!", "title": "Stellar Place! Would Stay There Anytime!", "user": "DaveLD", "date": "November 19, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 22008156, "likes": {"liked": "— New and clean!", "disliked": "— No complaints!"}}, {"rating": 5.0, "title": "Great Hotel", "text": "The rates are very reasonable. The hotel is located right off the interstate. Several restaurants are nearby.", "user": "AllysonH61", "date": "April 22, 2008", "id": 15247167}, {"rating": 4.0, "stay_parameters": "Stayed February 2008, traveled with family", "text": "The Crestwood is pretty new, opening in the last few years. It is obvious from the time you pull into the parking lot that it is new. It is just a very clean and well-appearing hotel. The lobby is very nice with a flat screen T.V. The business center has two computers (although only one was working during our stay) and a printer. There is a pool, fitness room and laundry room. We did not have time to use those amenities but they appeared to be very nice. The staff was courteous and always willing to help.", "title": "My daughter felt like a princess", "user": "reneeshorses", "date": "March 5, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 14069173, "likes": {"liked": "— room layout and comfort", "disliked": "— no cell phone reception due to the building being new and solid concre"}}], "location": {"country": "United States"}, "stars": 2.5, "variance": {"poor": 6, "average": 9, "very good": 17, "terrible": 3, "excellent": 63}, "aka": "Crestwood Suites Lakeland Hotel Lakeland", "slim_ranking": 0.09375}