{"user_rating": 5.0, "review_count": 17, "name": "Cromwell House", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "What a lovely little Gem of a place! I stayed for the weekend with my mum as a girly weekend away. The place is absolutely spotless and very tastefully decorated. Rooms are cosy and have everything you need - fluffy towels, toiletries, tea and coffee making facilities and a tv should you want it. Lovely choice of cereals, fruits and cooked breakfast items all served to order. The owners, Neil and Sue, are so welcoming and friendly and will go out of their way to make sure you have a comfortable and relaxing stay. They are also great at recommending local restaurants - our 2 favourites were the Belgian Cafe (Belgian Themed, nice for a treat) and Dolce Vita (excellent value Italian). There is also an option to have your evening meal in the hotel in peak months, just ask and you will be catered for! Really glad we chose this place, we had a really lovely time and thoroughly enjoyed our stay.Thanks, and keep up the good work!", "title": "Possibly the cleanest and friendliest B&B ever!", "user": "FayeW", "date": "July 26, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115815692}, {"rating": 5.0, "stay_parameters": "Stayed July 2011", "text": "We have just got back from Cromwell House...Me and my Boyfriend wanted a peaceful break and this is just what we got what a lovely well kept place it was first class...Cromwell House is a credit to the owners Neil and Sue..And in a wonderful location close to the sea...Trust me we looked at some of the other place we could of stayed..This place knocks spots of them all...We would Defo recommend this Place and will Defo go back...Thankyou Neil and Sue for making our weekend an enjoyable stay.", "title": "First Class.", "user": "Sassiechick", "date": "July 11, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 115262894}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled with friends", "text": "My friend and I stayed in room number 2. The room was very bright and cozy, lovely and clean. Nice bathroom as well, and just everything was spotlessly clean. The owner was very friendly and welcoming. Close distance to the seaside and the town center, less than 10 min walk from the station. Great breakfast too. Everything was just perfect!!! We thoroughly enjoyed our stay here, and would definitely stay again.", "title": "Fantastic", "user": "katty232", "date": "April 24, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 105312826}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "This is a lovely B&B in a great location of Eastbourne. The rooms and bathrooms are perfectly adequate and the breakfast was delicious. Sue and Neil are very friendly and make you feel very at home. We've stayed here a couple of times now and will definitely be going again.", "title": "Just like staying with friends", "user": "stevebee", "date": "September 5, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 78343724}, {"rating": 5.0, "stay_parameters": "Stayed August 2010", "text": "This is a reasonably priced hotel within easy walking distance of the rail station, town centre, and seafront (the pier is just at the end of the road!). The couple who run it are very freindly, the rooms clean and well decorated, the en suite bathroom is very clean (some may find it a bit small but it is perfectly adequate) and well stocked. Vegetarian cooked breakfast provided upon request, or full english, as well as cereal, yogurt & fruit. Evening meal available upon request when booking.", "title": "Lovely hotel in great location", "user": "whitbyabi", "date": "August 15, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 75331397}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "It was just great and so relaxing! First of all it was much more than what we expected from a B&B and at such a fair price! The room was very spacious and very clean. and Neal and Sue are brilliant hosts! They put so much care and attention to details!", "title": "Best B&B in Eastbourne!!", "user": "giulietto75", "date": "August 8, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 74255095}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "stars": 4, "variance": {"poor": 0, "average": 1, "very good": 1, "terrible": 0, "excellent": 15}, "slim_ranking": 0.506849315068}