{"user_rating": 3.5, "review_count": 84, "name": "Crossland Economy Studios - Tacoma - Puyallup", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed September 2012, traveled on business", "text": "First of all - this is a budget hotel. You get what you pay for. The bed in my basic room was small (full sized, not queen) with a cheap (hard) mattress. The room is fairly small. I didn't use the TV so can't comment on it. I wish that the heater/AC unit had separate fan/temperature settings (I like to keep the fan running to block out random noises). But the room was very clean, and it does have a small kitchenette and a decent bathroom (shower only). It is near the railroad tracks; the trains didn't wake me up but again, that is why I keep a fan running. I was on my own; two people in the same space might seem a bit cramped, especially with the small bed.", "title": "Average at best but clean", "user": "PrincessKatja", "date": "September 17, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 3.0}, "id": 140524833}, {"rating": 1.0, "stay_parameters": "Stayed August 2012, traveled with friends", "text": "I didn't have much interaction with the staff apart from checking in, but the woman on duty was very pleasant and efficient. Good enough for me.", "title": "Checked in - Checked back out!", "user": "sajmoore", "date": "August 26, 2012", "detail_rating": {"service": 3.0, "cleanliness": 1.0, "value": 2.0, "sleep": 1.0, "rooms": 1.0, "location": 3.0}, "id": 138419815}, {"rating": 2.0, "stay_parameters": "Stayed August 2012, traveled with friends", "text": "I dont know what hotel these pictures are of but it's not of this one. Im not super picky. Im all about a budget, but this place was one of the worst rooms I've ever booked. It looked nothing like the pictures I saw when I booked it. The bed was the equivalent of concrete, the carpet filthy, and furnishings from Goodwill. Five minutes after I checked in, I took my keys back to the desk and checked out. And of course since I booked through Travelocity there is no refund but oh well. Live and learn. My advice, go elsewhere.", "title": "Average Motel", "user": "aahshley", "date": "August 7, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 2.0}, "id": 136497563}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled solo", "text": "I was here August 3 to August 5, 2012 for Warped Tour in Auburn. All hotels closer to the venue were booked, so we stayed here. We got the room at a cheap price, which was a bonus ($85 per couple for 2 nights.) As I was traveling with another couple, we chose to share a \"suite\" room. The girl at the front desk was friendly and approachable. Upon checking in, we inquired into the room amenities, specifically cookware and table settings, as there is no breakfast area here so we brought our own. We were informed that there was only enough dishes for 2 people, which was an inconvenience, but there were 2 glasses and 2 mugs so at least we had enough cups. There were only 2 towels in the bathroom when we got to the room, but when we asked for more at the front desk, they were provided without hassle. Before coming here, I read a review by a woman who said that the shower was too small, but I am also 5'6 and 125lbs (the smallest of my travel mates,) and none of us had a problem with the shower size. One small complaint would be that there was no counter space in the bathroom and only 1 mirror. Although the room had two beds, it wasn't really suitable for 2 couples to share. The beds were kind of hard, but I had a comfortable enough sleep. On another note, it was next to impossible to locate the vending machines despite confusing signage, and we didn't see an ice machine anywhere.", "title": "Staff Review", "user": "Angel S", "date": "July 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 5.0}, "id": 134418528}, {"rating": 3.0, "stay_parameters": "Stayed June 2012, traveled on business", "text": "Overall, my stay here was decent. The hotel is right off the freeway kind of in the middle of nowhere, but the rooms were quiet and there was free wifi (although it cut out every few minutes.) I asked travel mates for their input, and we agreed that the hotel is a 2-2.5 out of 5. It's not the worst place I've stayed.", "title": "Depends on what you're expecting.", "user": "ldbugbee", "date": "June 4, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 131308324}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "We stayed at Crosslands for one night; Everything was in perfect working order, staff was very courteous. The bed squeaked a bit but that did not prevent us from having a sound sleep. Had problems connecting to the Wifi from Linux.", "title": "Top notch", "helpfulness": 1, "user": "kjub", "date": "August 28, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117376098}, {"rating": 1.0, "stay_parameters": "Stayed June 2011, traveled on business", "text": "If you are looking for a low budget place, cigarette burn holes in your sheets, no room service but once a week then if you want room service other days you have to pay, pick up your own towels then be told there is none you have to wait for them to be laundered because housekeeping didn't do them before they left for the day, dirty laundry facilities that you have to put a ton of quarters to get your clothes to finally dry, smelly hallways (Big trash cans are kept inside the building hallway for you to dump your trash from your room) and last but not least train track that is near by so you can't sleep at night. THEN THIS IS YOUR PLACE TO STAY :)", "title": "YOU GET WHAT YOU PAY FOR", "helpfulness": 3, "user": "Cocoa360", "date": "August 28, 2011", "detail_rating": {"cleanliness": 1.0, "sleep": 1.0, "value": 1.0, "service": 1.0}, "id": 117337570}, {"rating": 1.0, "stay_parameters": "Stayed March 2011, traveled on business", "text": "if you don't want clean towels,(unless you pay $3.00), garbage emptied, beds made, 1 coffee packet--just no service at all, then this is the place for you. When I made the reservations I was not aware that I would not be receiving any room service. And then to have to pay $3.00 for clean towels!! If I am paying to stay at a motel, I expect some service with out any extra charge.", "title": "NEVER AGAIN", "helpfulness": 2, "user": "funnyface3", "date": "March 6, 2011", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 1.0}, "id": 99184061}, {"rating": 1.0, "stay_parameters": "Stayed January 2011, traveled on business", "text": "We were booked here for 5 nights for the Sportsmen's Show in Puyallup. We left after one night. Stairwell was filthy..looks like no one has cleaned the steps for a long time. Stainless steel on elevator, etc. all dirty. Office doesn't stay open for the night. While the rooms have kitchenettes, etc. free internet, the rooms are like an old hotel. Spaces around main front door of room make noise from outside really loud. Can hear folks talking on phones, luggage being wheeled to other rooms, heard next door room noises, people walking in room above. No shampoos etc...have to go to office (if it's open) to get amenities. Paper thin towels. Hair on back of toilet, ugh. Blankets on bed were dirty, huge black marks all over, not sure what it was. We even checked under mattress for bed bugs, it was pretty nasty. And beds were rock hard, no nice mattress covers. Pillows were well used. Car in parking lot had been there so long it had 4 flat tires. Nope...won't ever do this one again, even tho the price was only $55. Not worth it. Pay another $15 on hotwire and get a nice Holiday Inn Express in Sumner, only 5 miles from Fairgrounds.", "title": "Icky, icky, icky...you get what you pay for.", "helpfulness": 2, "user": "AlaskaSheri", "date": "January 31, 2011", "detail_rating": {"service": 5.0, "cleanliness": 1.0, "value": 2.0, "sleep": 1.0, "rooms": 1.0, "location": 3.0}, "id": 95123589}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "We spent Christmas in Puyallup with our son and wife. This is a very nice, secure, very clean and quiet hotel with the needed amenities... iron and ironing board now included in the room.... kitchenette very handy now with toaster. When we go back, we'll stay again.... We loved the firm beds..We opted for taking the towels down for exchange, even got extra hangers. The office even printed our boarding passes for us.", "title": "Great stay - we've stayed before and chose to go back", "user": "sisnokmail41", "date": "December 29, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 91020408}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled solo", "text": "This is a good economy hotel. Rooms are small, but were clean & come with a nicely equipped kitchen. Bed was a liitle firm, but I slept fine. I had a bottom floor room & had no trouble with noise from above. This is a good choice hotel if you need a room with a kitchen for a low price. Convienent to Tacoma, I-5 & Mount Ranier area.", "title": "Good economy hotel.", "helpfulness": 1, "user": "TravlinNole", "date": "February 22, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 125011229}, {"rating": 3.0, "stay_parameters": "Stayed January 2012, traveled with family", "text": "I usually like extended stay but this was not a good place to sleep. The beds were very hard, the floor would have been softer. The staff was helpful and nice. The rooms were small but clean. It would be a good place if they got new beds.", "title": "Looks nice from the outside", "helpfulness": 1, "user": "Bmnme", "date": "January 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 4.0}, "id": 123376219}, {"rating": 1.0, "stay_parameters": "Stayed December 2011", "text": "Worst mattress I've been on in a motel since the 70's. No shampoo or hair dryer. Stained carpet and torn bed spread. Neighbor's bath fan makes MUCH more noise than the in room heater. Except for the fact of a stove and fridge, much less than any Motel 6 I've been in in a long time. The reviewer that liked the hard mattress must be brain dead. Avoid.", "title": "Pay less, get more elsewhere", "helpfulness": 1, "user": "wakbot", "date": "December 26, 2011", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 3.0, "service": 3.0, "rooms": 2.0}, "id": 122096262}, {"rating": 1.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "Don't stay here pay another 20 per night at the Red Lion down the street. The room we requested to see had bed bug and a spider hanging from the main light and cobwebs to boot. We made the mistake of booking online without much research. We also paid in cash, and when discovering the bedbugs asked for our money back and they said they couldn't do that because all cash goes to corporate and we would have to wait a few weeks to get our money back. This didn't go over well and by the end we left with our cash but were grossed out by the dirty, dark and buggy room that we really felt very badly treated when all was said and done. I would Not ever stay here and would not recommend anything else but the Red Lion.", "title": "Bed bugs and a spider", "helpfulness": 1, "user": "ja2era", "date": "December 21, 2011", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 1.0}, "id": 121948217}, {"rating": 1.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "We stayed here one night and it was the worst motel i have stayed in. The bed was hard as a rock. The room was very small. Barely enough room to turn around. No shampoo. There was no way we could have stayed here for an extended time. (we needed to be out of our house for a week).", "title": "hard as a rock bed", "helpfulness": 2, "user": "Laurieinwa", "date": "December 21, 2011", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 3.0}, "id": 121942399}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled solo", "text": "Good size rooms with a kitchenette, that are well kept and clean , the entire staff greets you with a smile and are very professional.... conveniently located near freeways which gives easy access for daily travels , family and pet friendly , with prices that keeps them ahead of the rest !!", "title": "\"Great experience at the Tacoma Crossland \"", "user": "Ron S", "date": "May 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 130148365}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled solo", "text": "I was here for three weeks and the staff and service were great. There's a bit of a mildew problem and a few other maintenance issues, but the staff is working to improve the facilities. Five stars to Matt, Abou, Nichole and Katrina! Facility is pet-friendly and guests tend to be quiet and considerate -- no drunken parties or rudeness.", "title": "Great service, facilities so-so.", "user": "valssister", "date": "April 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 5.0, "sleep": 5.0, "rooms": 3.0, "location": 4.0}, "id": 127842090}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "We have been staying at the Crossland Economy Studios for a few months now and it has been nothing but a wonderful experience. Originally we came to Crossland temporarily, but after being here we have decided to extend our stay. The rooms are very accomodating, clean, and the kitchenette is fully equiped. The staff is nothing short of superb. They are very respectful, helpful, kind, and they truly care about your stay. For example, we forgot to extend our stay, and that weekend happened to be fully booked. So when we called around and all the hotels were either sold out or had unreasonable rates we became frantic. We told the assistant manager our circumstances that we forgot to extend our stay, we had alot of stuff, and that we couldnt find another hotel within our budget. Being the helpful, caring person he is; he was able to extend our stay even though they had been sold out. I was so thankful and relieved. So if youre looking for a great atmosphere, and wonderful hospitality whether your staying for an extended amount of time or a short amount of time, I would recommend staying at the Crossland Economy Studios. Its the best and most reasonably priced place to stay in the area.", "title": "Great Extended Stay Hotel", "user": "Adam K", "date": "April 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 127824288}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "This is a very good economy hotel with away from home conveniences. The hotel staff is great & always there to help you with your needs. Not to bad for an extended stay!!! Also there is not alot of hotels around where you can have the convenience of a kitchenette. The rooms are also clean.", "title": "Adl777", "helpfulness": 1, "user": "Alicia L", "date": "April 12, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 3.0}, "id": 127774684}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "I could not find the listing for the Crossland Economy Studio on Hosmer Street in Tacoma. This was the nearest location. This is a great economy hotel. It is a nice home away from home. The staff is very friendly and the customer service is excellent. The rooms are always very clean. The office staff is always eager to help and efficient. I would recomment this establishment to any of my friends or family. Overall the experience was wonderful and I would always make the Crossland my first choice.", "title": "Review for Crossland Economy on Hosmer Street in Tacoma, WA", "user": "Jackie377", "date": "April 4, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127265444}], "location": {"country": "United States", "city": "Puyallup"}, "stars": 2, "variance": {"poor": 8, "average": 11, "very good": 21, "terrible": 18, "excellent": 26}, "aka": "Crossland Economy Studios Tacoma - Puyallup Hotel", "slim_ranking": 0.714285714286}