{"user_rating": 4.0, "review_count": 1450, "name": "Crowne Plaza Rome St. Peter's", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled solo", "text": "This is a standard tourist hotel. Rooms are not very big and show some wear, but adequate and clean. A free shuttle to St Peter's square (20min) is the major transportation to city center attractions. There is not that much around the hotel (quite residential). Several buses stop in front of the hotel and you can use them (and subway) to go to the city center too. The buffet in the restaurant is fine, not fancy but not pricey either. Staff is very friendly and willing to help. The hotel rate is quite attractive (and I got a buy1 get 1 free rate) and seems to be used by quite some travel agencies - I saw several bus loads of US travelers during my 4 days there.", "title": "Standard tourist hotel", "user": "lizzylizzy", "date": "August 31, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 5.0, "service": 4.0}, "id": 117497765}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "We booked two inter-connecting rooms for ourselves which both had two comfortable double beds. The rooms were clean and well furnished with a balcony with a small table and a couple of chairs. The rooms were a pretty good size for two with a reasonable bathroom with bath and a good shower. They had a/c and all the usual facilities - TV, mini-bar, tea making, room safe, good soaps etc.", "title": "An good choice for a family City Break with a nice pool", "helpfulness": 2, "user": "Saint7650", "date": "August 29, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 4.0}, "id": 117422670}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "We particularly chose the hotel because it had an outdoor pool which was essential in the August heat. The pool was a good size and very nice and not too crowded with sunbeds and a pool bar serving drinks and food, although this was quite expensive. (2 cokes, a glass of wine and a small beer - 20 euros. Toasted sandwich or burger - about 9 euros each).", "title": "Fantastic!", "helpfulness": 1, "user": "CandGEngland", "date": "August 29, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 5.0, "value": 4.0, "service": 4.0}, "id": 117385971}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "Staff were generally very helpful and friendly. There is also a cashpoint at the hotel.", "title": "exactly what we were hoping for!", "helpfulness": 1, "user": "jodie114", "date": "August 28, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 5.0, "value": 4.0, "service": 4.0}, "id": 117344181}, {"rating": 4.0, "stay_parameters": "Stayed August 2011", "text": "Buffet breakfast which we payed for in advance when booking was good with a wide choice and served from 6.00-11.00 am which meant that you could eat late and skip lunch if you wanted to.", "title": "The pool is great, very big and with temps topping 34 C, a big hit with the kids", "user": "milly094", "date": "August 27, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 117327088}, {"rating": 5.0, "stay_parameters": "Stayed August 2011", "text": "Super family room. Great pool. Free shuttle into Rome in 10 minutes. Restaurant expensive, so eat in Rome. Good parking. Lovely area.", "title": "Perfect hotel for visiting Rome.", "user": "Pythonicus", "date": "August 21, 2011", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 117030626}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "My family of 5 stayed at the Crowne Plaza for three nights while visiting Rome. This hotel accomodations are spacious and extremely comfortable, The free shuttle bus for getting to the Vatican (mornings) and Rome city center (afternoon) was also a nice feature. However, by far the highlight of our Crowne Plaza stay was the unsurpassed service provided Rafaeli, the restaurant Maitre d', and his staff. Thank you, Rafaeli!", "title": "Best Restaurant Service in Italy", "user": "Jim K", "date": "August 20, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 116994476}, {"rating": 2.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "This hotel is so far away from everything. If one only has three days to visit the city, it would take much of one's precious time for traveling to the city. The hotel provides free shuttle to the city, but the waiting time is not worth it. There's nothing to walk to.", "title": "Watch out for your belongings", "helpfulness": 1, "user": "Tienschneider", "date": "August 19, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 3.0, "value": 3.0, "service": 1.0}, "id": 116955159}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled solo", "text": "As soon as I checked in my room, I took my earrings of to go down for a swim, no more than 30 minutes later, I came back to my room and my earrings disappeared after the extra bed was set up. I called the front desk and was told that they have to talk to the housekeeping and will call me back tomorrow since it was after 8PM. The next day, no one called me so I called the front desk again, and was told the same thing, again, no calls. The situation was repeated every day until the day i checked out, I was told by the manager to go to a police station and report the theft and that they cannot do anything to help me. I left without my $500 earrings.", "title": "IDEAL.", "user": "Martin C", "date": "August 19, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 5.0, "value": 4.0, "service": 4.0}, "id": 116936302}, {"rating": 5.0, "stay_parameters": "Stayed August 2011", "text": "I have stayed here a number of times, both with my wife, and with friends.", "title": "Lovely hotel", "user": "KidFlavio", "date": "August 19, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 116925809}, {"rating": 5.0, "stay_parameters": "Stayed August 2011", "text": "Fantastic hotel!!! Fantastic staff!!! Room was very clean, much better service than other hotels I have stayed. Ive been to different hotels and the staff here looked out for your every need. I would highly recommend the Crowne Plaza to anyone who wanted to visit Rome and we will certainly be using this hotel again.", "title": "YES!!!", "user": "Robyfla", "date": "August 18, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 116898685}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "Excellent hotel, lovely gardens, pool, food and room. Room very spacious for family of three.", "title": "Fantastic holiday", "helpfulness": 1, "user": "Julie M", "date": "August 16, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116808331}, {"rating": 1.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "Used free shuttle bus and metro to get to Rome. We would definately stay here again.", "title": "Check in personnel as skilled as a New York scam artist", "helpfulness": 2, "user": "Ray G", "date": "August 15, 2011", "detail_rating": {"cleanliness": 1.0, "sleep": 2.0, "value": 1.0, "service": 2.0}, "id": 116761310}, {"rating": 2.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "I had trouble checking in to this hotel because the hotel claimed they did not receive my booking through a hotel broker. Oh, they would give me a room alright but ...\" you will pay more if we don't get the booking confirmation\" even though I had a confirmation of the booking. They claimed that it was only a confirmation from the booking agent and did not confirm that I had a booking with them. ( Wha...?, Hellooooo!) These guys really could work the streets of New York and get rich. Come to think of it... maybe they are already. Stayer, beware!", "title": "Warning!! Do not stay here, even for the pool!", "helpfulness": 5, "user": "Dalia E", "date": "August 14, 2011", "detail_rating": {"cleanliness": 1.0, "sleep": 2.0, "value": 1.0, "service": 1.0}, "id": 116701500}, {"rating": 3.0, "stay_parameters": "Stayed March 2011, traveled on business", "text": "My family and I stayed here from August 10 to 13th, 2011. We had two rooms, one for myself, wife, and two children, and another for my parents. Everything from check-in until departure was definitely not up to standards. The front desk staff was rude and unhelpful. They attempted to charge us more than the booking price (through Hotel.com). Their only response was, \"You must pay extra!\" They offered no alternatives. Lobby is littered with trash. The food in the restaurants and room service was HORRIBLE and overpriced. Better food was obtained by street vendors in Rome! The entire decor of rooms, lobby, hallways, and restaurants was circa 1970's and dirty. The hotel is extremely far away from anything meaningful, and the surrounding area is not safe! Crime is everywhere just outside the hotel grounds. Not only is this hotel not up to standards for a Crown Plaza, but is pales in comparison to even budget hotels in U.S. such as Red Roof Inn! The outdoor pool is decent, but even this cannot make up for a very bad hotel. You are WARNED!", "title": "Good stay, probably visit it again", "user": "SkyE5", "date": "August 12, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 4.0, "value": 3.0, "service": 3.0}, "id": 116608398}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "We chose the Crowne Plaza mainly because it has a pool, the idea being a nice cool dip after a hectic day sightseeing, this proved a very good idea due to the heat at this time of the year (August). It is positioned a little out of the city centre but this did not pose a problem. There is a taxi rank on site, the hotel runs a shuttle bus into the vatican area am and the city centre pm. If you book tours at the hotel the tour company will pick up and return. The hotel was excellent in most respects, the restaurant was spoilt by the lack of vision shown on the menu, (for instance one night it was all fish dishes) fortunately there is an excellent restaurant next door, five minutes walk. But all in all we found the hotel to be excellent, the staff were very helpful, friendly and there were no language problems. Rooms were spacious and comfortable and we would have no hesitation in returning there.", "title": "Excellent", "helpfulness": 1, "user": "longhair9", "date": "August 27, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 117326751}, {"rating": 3.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "The hotel has seen better days though it is still a good hotel. Excellent swimming pools. We liked our stay they had free buses to the Vatican City in the morning and to the centre of town in the afternoon.", "title": "A little tired but still a good hotel to see Rome from", "user": "BarBarYPartRIdGe", "date": "August 25, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 4.0}, "id": 117232271}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "Staff are friendly and very helpful. We had a bad experience with the restaurant one evenoing the food took a very long time in coming and did not all come at the same time. One of the dishes we ordered was truely bland and I mentioned it to the waitress. To be fair to her she talked to the manager and inspite of my protestations they did not charge us for the meal.", "title": "Great for getting out of busy Rome", "user": "vivedetravel", "date": "August 24, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 4.0}, "id": 117190332}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "The shuttles to and from airport great. Took advantage of city shuttle if it worked with our schedule, if not only 12 euro to get in city, not far at all. I loved getting out of busy Rome and into a huge great pool and relaxing on property. Had a great work out in their gym, wonderful breakfast. Absolutely no free Internet though. This hotel is ranked right where it needs to be. Taxis right outside the door for immediate assistance.rooms clean and bedding nice.", "title": "Perfect for a city break with children!!!", "helpfulness": 1, "user": "rjhmt", "date": "August 23, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 5.0, "value": 4.0, "service": 4.0}, "id": 117128704}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "We have just returned from a few days in Rome and found this hotel to be exactly what we were expecting having read all the reviews on trip advisor. Yes, its a little dated and some of the furniture is slightly worn in areas but the bedrooms were spotlessly clean and beds were lovely. We checked in very easily and were given inter-connecting rooms which we had previously requested and the lady at the desk was very polite and friendly. Rome was heaving and extremely hot so the pool was an absolute god-send - very large for a city hotel and wonderfully refreshing after a morning of sightseeing - our children absolutely loved it. We never used the free shuttle but taxis were always readily available and cost just over 10 euros to get in to the city centre. By joining their loyalty programme on arrival we also received free internet access. I would definitely return to this hotel if ever coming back to Rome!!", "title": "We will definately be back", "user": "Robert D", "date": "August 22, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117076220}], "location": {"country": "Italy", "region": "Lazio", "continent": "Europe", "city": "Rome"}, "stars": 4, "variance": {"poor": 93, "average": 241, "very good": 542, "terrible": 26, "excellent": 548}, "aka": "Crowne Plaza Rome St. Peter`s Hotel Rome", "slim_ranking": 0.188188976378, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.5, "rooms": 4.0, "location": 3.5}, "description": "Stay at Crowne Plaza Rome-St Peter s hotel and experience the new look of our rooms recently awarded as the best IHG refurbishment in 2008. Located in a residential area on Via Aurelia Antica, walking distance from the luxurious parks of Villa Pamphili and Villa Carpegna, the hotel is just a short ride from the Vatican City. After conducting business in Rome or a tiring tour of the eternal city, relax at our St Peter s Spa offering complimentary indoor heated pool, sauna, Turkish bath, gym along with a wide range of treatments for your wellness. During summer take advantage of our complimentary 25m length outdoor pool and enjoy the great weather of Rome on our comfortable deckchairs while sipping one of the many delicious cocktails on offer at the Pool Bar. If you feel like hitting the town make use of the scheduled free courtesy bus which will take you straight to the heart of the city in just a quick hop. Don t go home without trying our excellent and mouth watering Italian cuisine available in our restaurant Osteria open all day. For your meetings Crowne Plaza Rome-St Peter s hotel boasts a modern conference centre with natural daylight and free parking facilities. No matter how far from home or office you are, WiFi and wired highspeed internet connection will always allow you to be just a click away from your world at any time."}