{"user_rating": 4.0, "review_count": 719, "name": "Crowne Plaza Seattle Downtown Area", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "The Crowne Plaza Seattle is a very nice and comfortable hotel in a great location. It is just off interstate 5 --which make it very easy to find. It is also within walking distance of almost all the downtown locations. Qwest field is about a 15 min walk, Pike Market about 10, and The Space Needle about 20-25. So unless you plan on traveling out of town there is little need for a rental car.", "title": "Solid hotel in a great location.", "helpfulness": 8, "user": "icem2829", "date": "January 8, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 6564949, "likes": {"liked": "— Location and views.", "disliked": "— Not much."}}, {"rating": 4.0, "stay_parameters": "Stayed December 2006, traveled with friends", "text": "Upon check in the front desk clerk asked us if we would like a high floor with a nice view of the mountains, which worked fine with us. Outside of clouds and fog the view was great. The rooms were a decent size, nothing huge but big enough, and tastefully decorated. The bathrooms fit the profile of a 4 star hotel. They were clean and came with plenty of amenties. Room service was excellent. Fast with great service. The selection could be expanded slightly though. We briefly checked out the hotel bar, which was very classy although expensive.", "title": "Pretty Decent", "helpfulness": 4, "user": "wpack99", "date": "January 1, 2007", "detail_rating": {"front_desk": 5.0, "service": 3.0, "cleanliness": 3.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 6534730}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled with family", "text": "All in all we were very satisfied with the Crowne Plaza. If you get a decent rate I would strongly reccommend it.", "title": "Good experience", "helpfulness": 4, "user": "StevenGerrards", "date": "November 26, 2006", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 6177518, "likes": {"liked": "— Location", "disliked": "— Restaurant"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2006, traveled as a couple", "text": "Room was nice and comfortable. The bar was terrible. Expensive drinks, bartender was awful. Had limes for drinks but did not want to cut them. He was stealing the place blind by charging for drinks but not ringing them up on the register. He added gratuity to the bill on the first night and did not mention it until I saw the receipt and commented. I have never seen an automatic gratuity added to the tab at a US bar. We didn't let our bar experience ruin our stay. The check in staff was outstanding and friendly. We liked Silver expecially.", "title": "Great Hotel for a City Break", "helpfulness": 6, "user": "Meet-the-Furkids", "date": "November 21, 2006", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 6160416, "likes": {"liked": "— Room with a great View", "disliked": "— Wireless Intermet charges"}}, {"rating": 5.0, "title": "Really Perfect!", "text": "Would stay here again. $85 one night and $130 for NYE. A bargain.", "helpfulness": 1, "user": "hotel2006av", "date": "October 19, 2006", "id": 5970938}, {"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled with friends", "text": "The location of the hotel is good and convenient; within walking distance of everywhere. We had a room on the 34th floor (Club Level) facing the water, and the view was spectacular. Room was large, newly furnished, marble bath with a very comfortable king bed. Elevators were fast (although there are only 3). The lounge is small and drinks rather pricey. Service was average, and check-in and out was prompt and courteous. Club Level includes continental breakfast, which was a money and time-saver in the mornings. It was a good experience and the hotel experience is similar to other Crowne Plaza hotels. My one gripe: since I did not make the reservation directly with the hotel, I was told my stay was \"non-qualifying\" for Priority Club reward points. That is an annoying and silly rule, and will make me think twice about booking at this hotel group again. Crowne Plaza hotels (unlike Marriott hotels) still have smoking rooms available. If you are a smoker, that is good news, if not, be sure to request a non-smoking room!", "title": "Pleasant experience", "helpfulness": 2, "user": "Flaesb", "date": "October 11, 2006", "detail_rating": {"front_desk": 4.0, "business": 1.0, "service": 3.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 5943782, "likes": {"liked": "— Large, high floor room with view of city and harbor.", "disliked": "— $10/day charge for internet access. That is a shameful way to extract more money from guests."}}, {"rating": 4.0, "stay_parameters": "Stayed August 2006, traveled on business", "text": "There were three of us traveling so we tried to book suites at in every city. We were having trouble finding a decently priced suite until we found the Crowne Plaza.", "title": "Great location!", "helpfulness": 1, "user": "Travelkidd", "date": "October 11, 2006", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 5938126}, {"rating": 1.0, "stay_parameters": "Stayed August 2006, traveled on business", "text": "The suite itself was a decent size with great views of the city. The king size bed and all the sleeping amenities made for a great sleep.", "title": "They forced us to stay in handy-capped room instead of King Bed Room.", "helpfulness": 2, "user": "sushi-suki", "date": "August 21, 2006", "detail_rating": {"front_desk": 1.0, "business": 2.0, "service": 2.0, "cleanliness": 4.0, "value": 2.0, "location": 3.0, "rooms": 2.0}, "id": 5689581, "likes": {"liked": "— front desk, very slow elevators,"}}, {"rating": 2.0, "title": "An attempt at an up-scale hotel", "text": "The staff at the front desk were friendly and helpful.", "helpfulness": 2, "user": "Julie9409", "date": "August 14, 2006", "id": 5610791}, {"rating": 3.0, "title": "Beds hard, need new mattresses", "text": "The hotel is a very short walk from the city centre and a few seconds from strips of great shops. The location is great for walking downtown and getting out of the city and back to the airport.", "user": "talulla45", "date": "August 1, 2006", "id": 5536390}, {"rating": 4.0, "stay_parameters": "Stayed March 2006", "text": "I treated my husband to a weekend getaway and paid just $79 per night - a rate special that I found through Travelzoo. As a Priority Club member (which you can join at no charge on the web), you can ask for a room upgrade on check-in, which I did. We were upgraded to a city view room on the 30th floor with a king size bed, and with all the amenities described in previous reviews. All of the service staff were friendly and helpful; the concierge called shortly after our late afternoon check-in to ask if we needed any dinner reservations, recommendations, anything she could help with as she was finishing her workday at 6 pm. The valet parking is expensive, $27 for 24 hours, but you can come and go as many times as you like. Yes, you can find a cheaper day rate elsewhere, but we didn't see any lots in the area that charged less than $22 for 24 hours. There is so much to explore within walking distance from the Crowne Plaza, we just left the car with the valet all weekend. We ate breakfast in the hotel both mornings. The service was good but the food was mediocre. And given that Seattle is home to Starbucks and many other coffee suppliers, the coffee was dreadful. There are surprisingly few restaurants that serve breakfast close by that aren't in hotels, and at least by eating at ours it was convenient and fast. This hotel is very well located for exploring downtown-wonderful window and high end shopping, and bargain shopping at Nordstrums Rack and Ross. It only takes about 15-20 minutes to walk to the Space Needle and Seattle Centre where Experience Music Project, the Aquarium, and Science Centre are located. Exploring EMP can take an entire day, especially now that there is a new Science Fiction Museum there. One evening we went to Teatro Zinzanni, a circus/KitKat Club- style dinner theatre that was really entertaining. This tent theatre is also near the Space Needle, just a $5 cab ride from the hotel and a pleasant walk back. I would definitely stay at the Crowne Plaza again for location, good service and really comfy beds.", "title": "Seattle's Crowne Plaza- a great homebase for exploring downtown", "helpfulness": 11, "user": "PaulineJM", "date": "March 7, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "service": 5.0}, "id": 4591556}, {"rating": 5.0, "stay_parameters": "Stayed December 2005", "text": "The Crowne Plaza is an excellent hotel in downtown Seattle. The rooms have been updated with down comforters and nice furniture. The view from the upper floors is spectacular; the best view of the city. I highly recommend staying on the Club Level. They have a complimentary breakfast and appetizers (which you could make a meal of) in the evenings in the Club Lounge. The elevators are fast and the restaurant in the hotel is good and affordable as well. The location is about four blocks from all the action but walking up Fifth or Sixth Avenue is no big deal and is a nice area of town. My wife and I felt totally safe walking late at night. We checked out a couple of other hotels that are similar like the Red Lion and the Westin and we like the Crowne Plaza better; it was also a better value. The Westin is old and while closer to everything, it feels like it is in a run-down area. My only complaint is the ridiculous charge for parking at $26 a day and no free Wifi (did pick up a network with computer on window ledge which was large enough for laptop to rest on. Nothing like browsing from the 32 floor.)", "title": "Superb! Should be 4 star!", "helpfulness": 6, "user": "USTraveler", "date": "February 25, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 4519985}, {"rating": 4.0, "title": "Great Hotel at a Great Price", "text": "Even though only one of our three requests were met, we still had a great experience at the Crowne Plaza booking through Hotwire. The staff was friendly and efficient, the room was great, and the location of the hotel made it extremely accesible to all of Seattle's highlights. I couldn't see myslef paying $150 a night for this room, but through Hotwire, $73 was more than acceptable. The only negatives; I understand parking is ridiculous in downtown Seattle, but the $27 valet parking fee should be made clear when making the reservation. As for the requests we made; We wanted a non-smoking room but wound up with smoking. Not too bad though considering the smell was not very noticeable. Our friends who stayed in the inter-connecting room next door (our only request that was granted) were not as lucky. They are non-smokers as well, but the room they were in was definately not. My friend's girlfriend actually got a headache because the stench was so overpowering. (The hotel allowed them to switch to a non-smoking room for the second night of their stay.) The last request that was denied was not too big of a deal. My lady and I wanted one queen bed, but ended up in a room with two doubles. We remedied this by pushing both of them together. All in all I was happy with our stay at Crowne Plaza. I would recommend booking through hotwire if you are the kind of person that can go with the flow even if not getting exactly what you request, i.e. non-smoking, # of beds, etc. The money we saved on the room allowed us to be less frugal when enjoying downtown Seattle.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "February 13, 2006", "id": 4457279}, {"rating": 4.0, "stay_parameters": "Stayed February 2006", "text": "Just stayed at the Seattle Crowne Plaza from Feb 11-13. We got a great rate of $65/night through Hotwire. We checked in on Saturday afternoon at around 1pm. We got a room on the 23rd floor, directly across from the Elevators. However, we didn't really hear too much noise from the hallways or elevators because the air conditioning was pretty loud and covered the outside noise. We had a 2 double bed room, with a nice view of I-5. My son loved the view because he could see the cars on the freeway.", "title": "Close to Convention Center", "helpfulness": 5, "user": "waiomaogirl", "date": "February 13, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 3.0}, "id": 4457024}, {"rating": 4.0, "stay_parameters": "Stayed December 2005", "text": "We asked for a King Bed, but the lady at the front desk said they didn't have any available. I'm also wondering if people who book through Hotwire get the rooms by the elevators? Because my mom also was assigned a room by the elevator and she booked through Hotwire.", "title": "A Great Weekend", "helpfulness": 1, "user": "Haigh1970", "date": "December 28, 2005", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "service": 3.0}, "id": 4308595}, {"rating": 2.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "First time in seattle and choose to stay at CP since I have platinum priority club status. Never again. My status meant very little. They placed me in a regular room which was dirty, small and had a terrible odor. At that point I insisted on an upgrade and was given a club floor room. Club access is not on par with other CPs. Great views but food was so so and booze came at a fee. The hotel nickel and dimes you for everything including wifi. Elevators were also very hard to come by, had to leave 10 minutes early to get downstairs in order not to be late. The only redeeming aspect of the hotel was the location, otherwise it is very overpriced and terrible value.", "title": "Mediocre at best", "helpfulness": 2, "user": "happy kappy", "date": "July 23, 2006", "detail_rating": {"front_desk": 4.0, "business": 1.0, "service": 2.0, "cleanliness": 3.0, "value": 1.0, "location": 5.0, "rooms": 3.0}, "id": 5501949, "likes": {"liked": "— location"}}, {"rating": 1.0, "stay_parameters": "Stayed July 2006, traveled on business", "text": "We booked a nonsmoking room online several weeks in advance of our stay at the Crowne Plaza in downtown Seattle. Upon our arrival, the front desk staff asked if we would consider a smoking room. This was completely unacceptable to my family and we clearly stated that no, we would not consider a smoking room due mainly out of concern for our infant daughter's health. This particular staff member went to speak quietly with another front desk staff member and they both agreed on a particular room for us. When we entered the room, the smell of cigarette smoke was very apparent, and yet we could not imagine that the front desk staff would intentionally put us in a smoking room without informing us. Two days later, we discovered an ashtray and matches and checked with the front desk to discover that in fact we had been put in a smoking room intentionally because they had not kept our reserved nonsmoking room for us. All our clothes and other belongings as well as our baby reeked of cigarette smoke.", "title": "Worst Hotel Experience Ever", "helpfulness": 5, "user": "dissatisfiedguest", "date": "July 21, 2006", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 3.0, "value": 1.0, "rooms": 2.0, "location": 4.0}, "id": 5494106, "likes": {"liked": "— location", "disliked": "— appalling treatment by staff"}}, {"rating": 1.0, "title": "Not Happy, never going back!", "text": "In addition to this appalling lack of concern for our health and wishes, our room was not serviced during our three night stay. When I asked the front desk manager why our room had not been serviced, he checked with housekeeping and informed me that we had had a do not disturb tag on our door so they did not disturb us. This was not the case (the tag was on the inside of our door the entire time) and I had anxiously been awaiting staff to empty our garbage of dirty diapers and replace our towels.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "June 17, 2006", "id": 5355412}, {"rating": 5.0, "stay_parameters": "Stayed May 2006", "text": "The front desk manager offered us the pathetic compensation of a complimentary hotel breakfast for my family being exposed to carcinogenic cigarette fumes for days and not having our rooms cleaned. This was our first and will definitely be our last stay at any Crowne Plaza Hotel.", "title": "Good as always...", "helpfulness": 3, "user": "VicGirl", "date": "May 24, 2006", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "service": 4.0}, "id": 5205381}, {"rating": 4.0, "stay_parameters": "Stayed April 2006, traveled on business", "text": "We booked our reservations 6 months in advance. 34th floor/view/2 double beds. When we arrived our room wasn't available so they put us on the 27th floor with no view. Also I had to request that I not be charged the 34th floor rate (as it was more). Also, didn’t receive our “packaged” continental breakfast.", "title": "Average for a 4 Star", "helpfulness": 14, "user": "CookieGuru", "date": "May 1, 2006", "detail_rating": {"cleanliness": 3.0, "rooms": 4.0, "service": 4.0}, "id": 5022786}], "location": {"country": "United States", "city": "Seattle"}, "stars": 3.5, "variance": {"poor": 49, "average": 126, "very good": 295, "terrible": 19, "excellent": 230}, "aka": "Crowne Plaza Seattle Downtown Area Hotel Seattle", "slim_ranking": 0.440860215054, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.5, "rooms": 4.0, "location": 4.5}, "description": "The Crowne Plaza Hotel - Seattle offers a superb location in Downtown Seattle, close to everything great in the Pacific Northwest. A few blocks from the Crowne Plaza Hotel - Seattle, you can explore the historic Pike Place Market or the new Seattle Central Library; catch a Mariners game at Safeco Field or a Seahawks game at Qwest Field in Pioneer Square. Walk two blocks from the Crowne Plaza Hotel - Seattle to your meeting at the Washington Convention & Trade Center, then indulge yourself at hundreds of downtown stores, including Westlake Center and Pacific Place shopping malls. Explore the local waterways on an Argosy Cruise or on any of the major cruise lines. Click on the Packages tab for some great options to help you see it all!The Crowne Plaza Hotel - Seattle also puts you in the heart of the city s amazing arts scene, including the beautiful 5th Avenue and Paramount Theatres, Seattle Art Museum, and Benaroya Hall. The Space Needle stands just minutes away, casting its long shadow over Key Arena, the Pacific Science Center, the Experience Music Project and McCaw Hall, home of the Seattle Opera and the Pacific Northwest Ballet. Plus, the Crowne Plaza Hotel - Seattle is just four miles from the University of Washington with its Meany Hall and Husky Stadium."}