{"user_rating": 4.0, "review_count": 163, "name": "Crowne Plaza Hotel Pensacola Grand", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled on business", "text": "Just re-opened after renovations for 2 years, really nice with plasma TVs in every room, close to Seville Quater for nightlife and Maguires for great steaks. BUT, there a is a train that runs within 30 yrards of the hotel and a few light sleepers in my group were awakened 3-4 times throughout the night by the train, so temper you selection with that info, other wise very nice. Military rate was hard to beat, at $88 with no tax.", "title": "great hotel, nuless you're a light sleeper", "user": "Herk_Driver", "date": "November 20, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 3.0, "rooms": 5.0}, "id": 6156076, "likes": {"liked": "— very nice hotel, new and shiney", "disliked": "— train running next to hotel at 3AM"}}, {"rating": 5.0, "title": "My home", "text": "rangeland4@houston.rr.com", "user": "A TripAdvisor user", "date": "February 24, 2006", "id": 4499949}, {"rating": 5.0, "title": "Great! Great! Great!", "text": "I lived at the Crowne Plaza for two weeks in October, 2004. From check-in to check-out I was treated extremely well. I will always stay there when I am in town. Imagine my surprise when I saw that this was only a 3-star hotel. Somebody messed up, I rate it a 5.", "user": "A TripAdvisor user", "date": "July 13, 2004", "id": 2294235}, {"rating": 5.0, "stay_parameters": "Stayed June 2004", "text": "Crown Plaza-Pensacola Grand Hotel", "title": "Had a great stay!", "user": "BJK2010", "date": "June 15, 2004", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 2191076}], "location": {"country": "United States"}, "stars": 3.5, "variance": {"poor": 11, "average": 28, "very good": 62, "terrible": 7, "excellent": 55}, "aka": "Crowne Plaza Pensacola", "slim_ranking": 0.245901639344, "description": "Welcome to the Crowne Plaza Pensacola Grand Hotel, Pensacola s premier upscale hotel! Our hotel is located on the site of the Historic L&N Railroad Passenger Depot , which was built in 1912. The depot has been restored and now houses our lobby, CAVU lounge, 1912 Restaurant, Pandora's Skin & Beauty studio, The Tea Party gift shop, meeting rooms and the Grand Ballroom; creating charming ambiance. Our fifteen story, glass, guest room tower attached to the train depot offers breath taking views of Pensacola Bay and Historic Downtown Pensacola . We are pleased to offer the Crowne Plaza Sleep Advantage package in every room featuring comfortable new beds, guaranteed wake-up calls and sleep amenities. The Crowne Plaza Pensacola Grand Hotel is just off of I-110, Gregory St. in the prestigious downtown district, just 10 minutes away from Pensacola Regional Airport (PNS) and conveniently located next door to the Pensacola Civic Center . Ranking 7th in Overall Customer Satisfaction in all of Crowne Plazas-worldwide; we know that you will be thrilled with the service you will receive. Businesses near hotel: Solutia, International Paper, Gulf Power, Andrew s Institute Attractions near hotel: Pensacola Beach, Naval Aviation Museum, Seville Quarter/Seville Square"}