{"user_rating": 3.5, "review_count": 160, "name": "Crowne Plaza Phoenix", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed March 2009", "text": "This is a very accurate description of this hotel. The rooms were GREAT! Clean, no smoking smell, good temparature. Bathroom has drop acoustical ceiling tile which is king of funky. The indoor and outdoor pools are small and COLD. Jacuzzi was nice. All are kept clean. The free shuttle was a LIFE SAVER. Shuttle drivers are an asset t o the property. Made some great recommendations for dining in the area and were spot on every time. The food in the bar was above average, the breakfast in the dining room was below average. Besides the overall cleanliness of the room and the pools, this property is very tired and in need of some upgrades. Hallways, low ceilings, and vending/ice areas show much wear and tear. For the price, you can't beat it. It's a decent place to lay your head at night. I'd stay there again for a couple of nights. Would NOT go there with my family for extended vacation.", "title": "It's a solid 3* no more no less", "helpfulness": 3, "user": "kentbrad4d", "date": "April 3, 2009", "detail_rating": {"cleanliness": 3.0, "value": 5.0, "location": 2.0, "service": 4.0, "rooms": 4.0}, "id": 27358118}, {"rating": 3.0, "stay_parameters": "Stayed December 2008, traveled as a couple", "text": "Okay, we've stayed here 3 times now and mostly b/c I have been too lazy to look for any other place but no more. This last time with the moist, humid air in the hotel from the pool and the air conditioner barely working and the horrilbe double beds (I mean, who does double beds instead of queen sized beds anymore-honestly!). This was the last time. I always make the reservations from the hotel website to get points and the price you pay is not worth what you get. With the economy the way it is, I am asking for more now for what I usually pay and the places that will endure will have to innovate.", "title": "Been there, done that", "helpfulness": 1, "user": "HawaiianChick", "date": "March 22, 2009", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 4.0, "service": 3.0, "rooms": 3.0}, "id": 26594805}, {"rating": 2.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "I usually associate this hotel chain with upscale properties. Sadly, this hotel has passed it's prime.", "title": "Once grand, now mediocre. Doesn't live up to it's name", "helpfulness": 2, "user": "jsdive", "date": "February 23, 2009", "detail_rating": {"cleanliness": 1.0, "value": 2.0, "location": 4.0, "service": 4.0, "rooms": 2.0}, "id": 25043768}, {"rating": 2.0, "stay_parameters": "Stayed February 2009, traveled on business", "text": "the carpets are DIRTY, and threadbare in places. (There was a patch under the desk in our room that was actually coming unsewn).", "title": "Awful Odor", "helpfulness": 1, "user": "SherryTucson", "date": "February 20, 2009", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "location": 5.0, "service": 4.0, "rooms": 1.0}, "id": 24870114}, {"rating": 4.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "the poor maintence man had to come to our room three times for a clogged toilet. (I know: don't say it!)", "title": "Great Bed, Great Value", "user": "marc1976", "date": "February 19, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 24800377}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled on business", "text": "It was my first trip to Phoenix and I wanted a hotel that was close to everything in Phoenix. This hotel the best looking from the outside but was close to the freeway and easy to find. When my boyfriend and I drove up, we were thinking this place was questionable but we loved our stay there. The staff was nice and the rooms were quite comfortable and clean. My boyfriend forgot his shaver so the front desk was quick to deliver him shaving cream and a razor. We also received a free copy of the newspaper every morning.", "title": "Great hotel with a great price", "user": "comengetit", "date": "November 20, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 22047597, "likes": {"liked": "— Great price.", "disliked": "— none."}}, {"rating": 3.0, "stay_parameters": "Stayed October 2008, traveled with family", "text": "Overall, we enjoyed our stay there and would stay there again.", "title": "Odd hotel...mostly good.", "helpfulness": 2, "user": "Kenbob", "date": "November 7, 2008", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 3.0, "rooms": 2.0}, "id": 21633257, "likes": {"liked": "— Sleep CD and linen spray left on the bed.", "disliked": "— Lack of wireless internet"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled on business", "text": "The hotel has very odd public spaces. Most rooms surround an inner courtyard containing an indoor pool. It resembles a motel more than a first-class hotel.", "title": "Southwest Style Hospitality", "helpfulness": 1, "user": "2_Travel_Smart", "date": "October 29, 2008", "detail_rating": {"front_desk": 2.0, "service": 2.0, "cleanliness": 5.0, "value": 3.0, "rooms": 5.0, "location": 5.0}, "id": 21382691, "likes": {"liked": "— Pool, Food, Ambiance", "disliked": "— Air Conditioning, Decor of restaurant, lapses in houskeeping service"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "My room was mostly good. A recent refurbishment has led them to replace a number of things but certainly not all of them. My room for example, had a good and what seemd like new bed, new wallpaper but the original carpet and furniture (a bit worn).", "title": "Great service and friendly staff.", "helpfulness": 1, "user": "KATSanClemente", "date": "July 2, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 17454795, "likes": {"liked": "— Friendly staff", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled on business", "text": "The bathroom was almost competely new except for old and broken faucets on the sink and a drop ceiling with stains from an apparent water leak.", "title": "Great hotel", "helpfulness": 1, "user": "travelilady", "date": "June 28, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 17305626}, {"rating": 3.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "the hotel was just a medium hotel. i mean a 3 * nothing more nothing less. the room was clean and nice - see photos - i do not liked the public spaces.", "title": "just a place to sleep", "helpfulness": 2, "user": "marco.to", "date": "November 24, 2009", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 3.0, "service": 2.0, "rooms": 3.0}, "id": 49942652}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled on business", "text": "I was having problems at the airport getting the car I wanted and finally the gave me what I ordered. I know when I got to the hotel I was not in the best of moods and I think Patti at the front dest could see that. She was absolutely amazing from the time I arrived till I checked out. I just want to say that all the staff was wonderful. Great Stay and Service.", "title": "GREAT SERVICE!", "user": "Beachfourus", "date": "October 20, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 47354833}, {"rating": 3.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "i walked in right had problems service sucked front desk m ngr rude and no anwers went to room no internet than was told service tech would be up there he got there and told me to call wayport as i called wayport there internet provider phone line was destorded. service tech still in room i ask him well [CANT HERE HIM] TECH RESPONSE NOT MY PROBLEM.Well my response is yea it is cause im your guest i payed money for the room that advertises the internet. called front desk we can get you another room no im in hurry to another destanation i dont want to be tied up my time with fixing internet right now ill deal with this when i get back so i get back call way port for one hour i deal with way port tech and no sulution. On net problem agian conversasion is choppy i no theproblem it the phone line done with internet and go to swimming pool were swimming and low and behold were back in the room to find i have fault shower handle and it goes on there is more out let spark as go to plug in i stop no im worried i might have fire in my room spark are caused buy bad grounding the wireing so i go outside to check around 4 trays that were delverd in the morning were still there at 900 pm i arived at 100 pm and on my way out in the morning low and behold trays still out there 1200 same trays and same wine glass.that a total of 16 hours trays wih food on it sill mee bread ad of salad", "title": "worst", "helpfulness": 1, "user": "badandgood", "date": "August 17, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 2.0, "rooms": 5.0}, "id": 37967278}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled on business", "text": "Once again, I was initially weary seeing other's reviews of this hotel. Once again, I should have known that many having reviewed this hotel, were slightly off the mark. I stayed at the Phoenix Crowne Plaza for one week for a business trip. I booked my room on Priceline.com for $33.00 a day. Let me repeat that folks...$33.00 a day!!! What a deal! Upon arriving, I was afraid I was going to be stuck in a double room. At 6'2, that isn't always the most comfortable situation. When I explained this to the front desk staff, she told me about renovations going on and not having many rooms. I was a little taken back because there were maybe 8 cars in the parking lot. I made nice with the clerk, smiled and what do you know, an upgraded room! Not that the clerk was initially nasty, but just needed some warming up with compliments, etc. After that, every person from the housekeeping staff, to the bartender to the concierge were amazing. Never a problem at all with the room.", "title": "Great Stay, Great Price", "user": "tucsoncop", "date": "July 25, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 3.0, "service": 5.0, "rooms": 4.0}, "id": 35742869}, {"rating": 3.0, "stay_parameters": "Stayed November 2008, traveled on business", "text": "Decor: The outside looks as if it had been recently remodeled. New paint, and it looked pretty nice. Inside looked the same way. Very nice remodel. I walked to the conference center to take a look and more of the same. Very nice, clean and no problems. The bar was extremely clean, well kept and comfortable. There was an outdoor and indoor pool, neither of which I used, but they seemed to both be nice places to visit. The hallways of the interior section of the hotel seemed a little dingy. Not to say they weren't up to the standards of a 3 star hotel, but if I had to ding them on anything, I would have to put it with the hallways. Dark, carpets seemed a little worn and just something about the feel of them. Again, nothing to distract anyone from staying here.", "title": "Crowne Plaza just O.K.", "helpfulness": 1, "user": "birdog28", "date": "May 18, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 3.0, "rooms": 3.0}, "id": 30216764}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled on business", "text": "We returned from Phoenix last week from our stay at the Crowne Plaza. We had an amazing stay - the staff went out of their way to accomodate us. The indoor pool was a godsend as the temperature outside reached into the low 100's. Hotel is close to shopping and the hotel shuttle offered to bring myself and the kids to an amusement park down the street! My husband was delighted at the fun we had and that he was able to bring us. We had a great time!", "title": "Fun in Phoenix", "user": "momoftwoBrentwood", "date": "June 12, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 3.0}, "id": 16879508, "likes": {"liked": "— worked for both my husbands business needs and the family"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "Despite a musty smell that permeated throughout the hallways of the fourth floor, this hotel was extremely comfortable, accommodating, and attentive to each of my needs. I arrived close to midnight and a staff member was there to great me and get me checked into my room within a ten-minute time frame. The king-sized bed was extremely comfortable and provided me with an excellent night's rest. Check out was a snap with the staff member taking less than five minutes to complete my transaction.", "title": "Comfortable, Accommodating, and Attentive...", "helpfulness": 1, "user": "gambari", "date": "April 1, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 14713146, "likes": {"liked": "— The bed, pillows, and staff", "disliked": "— The musty smell throughout the fourth floor hallway"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "Overall, this hotel impressed me and it would most definitely be high atop my list of places to stay for future visits!", "title": "I would definetly Return", "helpfulness": 1, "user": "luckyclovers", "date": "March 30, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 4.0}, "id": 14663805, "likes": {"liked": "— Comfort of the Beds"}}, {"rating": 1.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "I booked this place at a great deal from priceline and than read some of the reviews here on tripadvisor so I was weary, but went ahead with my stay. I'm glad I did; the front desk supervisor was attentive and friendly, the room was clean and well appointed and room service was typical for a chain hotel. The pool did have the chlorine smell, but it's indoors so somewhat expected for the AZ heat.", "title": "Never again!", "helpfulness": 4, "user": "RoadTripMan", "date": "August 16, 2007", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 5.0, "cleanliness": 2.0, "value": 3.0, "location": 2.0, "rooms": 1.0}, "id": 8436113, "likes": {"liked": "— Friendly staff", "disliked": "— Poorly maintained facility, lousy air-conditioning."}}, {"rating": 1.0, "stay_parameters": "Stayed July 2007, traveled on business", "text": "First the good: The staff (except for manager, see below) is attentive, friendly and helpful.", "title": "Awful", "helpfulness": 4, "user": "barcodetech", "date": "July 22, 2007", "detail_rating": {"front_desk": 3.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "location": 2.0}, "id": 8217860, "likes": {"liked": "— nothing", "disliked": "— maid service"}}], "location": {"country": "United States"}, "stars": 3.5, "variance": {"poor": 6, "average": 43, "very good": 46, "terrible": 16, "excellent": 49}, "aka": "Crowne Plaza Phoenix Hotel Phoenix", "slim_ranking": 0.45197740113, "description": "Crowne Plaza Phoenix has recently completed a multi million dollar renovation on our guest rooms and they look amazing. The Crowne Plaza is easily accessible off Interstate 17 with several dining and shopping options within walking distance. Just 20 minutes from Sky Harbor Airport and 3 miles from the new light rail. Make the Crowne Plaza your hotel of choice when visiting Phoenix."}