{"user_rating": 4.5, "review_count": 1025, "name": "Crowne Plaza Copenhagen Towers", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with friends", "text": "I really liked this hotel. The room was a very nice size. The beds were comfortable. The service was excellent. The television in my room did not work and the front desk staff moved me to another room immediately. They also gave me some free drink vouchers without my asking for anything. All of the staff (front desk, wait staff, bar staff, concierge) were excellent and spoke English very well. The breakfast was excellent. A wide range of choices. The metro takes you into the heart of Copenhagen in approximately 10 minutes. You can buy tickets at the hotel. I would definitley not hesitate to suggest this hotel to anyone staying in Copenhagen. I got a good rate (breakfast included) considering how expensive Copenhagen is for hotels in the heart of the city.", "title": "Very nice hotel in a convienent location", "user": "DeanCalgary_Alberta", "date": "July 17, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115458840}, {"rating": 3.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "We were rally not sure about this hotel. We booked it as we needed to park our car and we could not find a central Copenhagen hotel that had any parking. It is located in a very new build area of Copenhagen (20 mins to central via walk and Metro). There is nothing to do in the immediate vicinity, other than a large shopping mall about 5 mins walk away. This means if you can't be bothered getting the metro (or £30 taxi) to the centre, you will need to rely upon the hotels facilities, which are minimalist both in option and design -basically a Bar / Cafe, located to the left of reception (there is a restaurant, but it was closed). It is very, very concrete minimalist, which did not aid the atmosphere. Service was pretty poor, (here did not appear to be enough staff) Our Room was fine. General service was patchy, either friendly and great or a strained service with a grimace.", "title": "Not Sure. More a corporate venue", "user": "NW6_Traveller", "date": "July 17, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 3.0, "value": 4.0, "service": 3.0}, "id": 115457064}, {"rating": 3.0, "stay_parameters": "Stayed July 2011, traveled solo", "text": "New hotel, nothing to complain about. Helpful and friendly staff. Comfortable, clean and well equipped rooms. Easy access to trains and metro. Public areas are austere and minimal and not especially welcoming, but ideal stop over hotel close to airport and trains for city centre.", "title": "Austere but comfortable", "user": "Lewis_England_9", "date": "July 17, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 3.0, "service": 4.0}, "id": 115445470}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "stayed here for a week in july with my family. booked a family room and in fact wass given two large connecting reviews.first small quibble i booked a breakfast rate but was told that as a platinum club member was entitled to free breakfast anyway in the club lounge it would have been nice to have known this. also the website offers discount tivoli tickets the reception staff i soke to had no knowledge of this. also the main restaurant was closed for one month and a limited choice was available only in the bar. however ther is a shopping centre with plentyu of food options adjacent. there is an excellent rail and metro connection to the city however like everything in denmark if you do not buy a pass or a ten trip card it can be very expensive the ticket machine wil only accept cards or credit cards.the staff are mostly very nice and helpful when i had a problem with the computer it was sorted out immediately also there is a free shuttle to the airport. this hotel compared to others in other countries may seem expensive but represents good value here.", "title": "a few hiccups but generally high quality", "user": "CleethorpesGtfcfan", "date": "July 16, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 3.0, "service": 5.0}, "id": 115429979}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled on business", "text": "I travel a few times each year to Copenhagen on business and have now stayed here more than other hotels. The best thing about the hotel is its extremely comfortable rooms. On three of my visits I've been upgraded to a deluxe room, which is slightly larger than the standard rooms, but in reality both are very comfortable and spacious. The Club lounge is pleasant - snacks and drinks in the evening and a reasonable breakfast in the morning. The staff are all polite and helpful. Breakfast in the restaurant is good and on the one occasion I've had food in the bar it was also good. The free wireless internet is adequate - I've never felt the need to ugrade to a faster speed.", "title": "Four stays and counting", "user": "Hampshire-resident", "date": "July 16, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 4.0}, "id": 115424980}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "Went for a weekend getaway with boyfriend and the good thing about not being in the centre of Copenhagen is that you can view it from here. Fairly easy access to city center by metro but great being back in the evenings. Enjoyed great food in room with fantastic view - doesn´t get much better that :-)! Breakfast was voluptuous with chef making eggs and pancakes. The rooms where great and staff very friendly.", "title": "Nice rooms and excellent food", "helpfulness": 2, "user": "MsRomance", "date": "February 4, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 55194382}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled on business", "text": "Stayed for one night in the newly opened Crowne Plaza Copenhagen Towers, and will surely stay there again next time I am in Copenhagen.", "title": "I will be back :-)", "helpfulness": 1, "user": "Jacobsen_2", "date": "January 27, 2010", "detail_rating": {"cleanliness": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 54502534}, {"rating": 3.0, "stay_parameters": "Stayed December 2009, traveled on business", "text": "Everything the room to the service was excellent.", "title": "Just opened and very promising, not quite there yet though", "helpfulness": 1, "user": "OrdR", "date": "December 8, 2009", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 3.0, "service": 3.0, "rooms": 4.0}, "id": 50868409}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled with family", "text": "Good tip: the hotel has a free airport shuttle", "title": "Fantastic stay", "helpfulness": 3, "user": "tivoli_girl", "date": "November 30, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 50328940}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled with friends", "text": "Honestly, this was not my original first choice for my 4-night stay in Copenhagen, basically because of its distance from town.", "title": "Wonderful hotel expereience", "user": "JJB", "date": "April 7, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 60625870}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled on business", "text": "After our stay during Easter 2010, I can assure you that I am most satisfied. Like fellow travellers have commented, the room and bathroom are spacious, beds extremely comfy, simple but delightful Danish design furniture, clean, safe, and is in fact very convenient for sight-seeing. We have had breakfast for 2 days and the food was just great. The freshly-made pancakes were among the best I have ever had.", "title": "Tremendous Hotel Experience", "helpfulness": 1, "user": "JTFLORIDA", "date": "March 19, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 58997555}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "In terms of transport, the metro and train are in fact co-located, with the metro on the upper level and the train lower. We arrived after 10pm direct from the airport with 1 big suitcase and have had no probelms whatsoever finding and walking to the hotel. Take the train, not the metro, to Orestad from the airport. Look up and you can't miss the hotel building, which is under 200 metres from the train station.", "title": "Excellent stay and great value for money", "helpfulness": 2, "user": "Tripster02", "date": "March 16, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 3.0}, "id": 58700057}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled on business", "text": "Perhaps we just had 2 minor points to make - perhaps due to our strange way of making reservations (we wanted to try sth different for breakfast for the 2nd & 3rd day of our stay and had therefore made 3 separate bookings with 1 day BB, 2 days bed only and then 1 day BB). We were actually checked-in 3 times (though we did not have to move out of our room). Perhaps for this reason, our room was not made up on the 2nd and 4th day of our stay. We were quite tidy people and could put up with no room-making for a couple of nights. If we had called probably they would send someone up quickly, given our impression with the very nice reception.", "title": "Great, modern hotel close to the Bella Center (but not much else)", "user": "bonbun", "date": "March 11, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 58292861}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "Secondly, on one morning we had all 3 presumably most energy-consuming appliances (i.e. TV, hair-dryer and tea-maker) running at the same time, and the electricity went out. We called the reception (luckily the phone was still working) and they swiftly sent someone up and get the matter resolved. We found it a bit strange for a new hotel (and we did not have any personal items plugged in). Guess it's only an odd incident.", "title": "New og modern hotel", "helpfulness": 1, "user": "tigerkatHolte", "date": "February 8, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 55440378}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled on business", "text": "Great stay in a great country, very impressive modern construction, has a very clean new look. FREE wireless internet throughout the hotel. Room was great, quite spacious with an impressive view of the surrounding area. You can see the mall and the train station from the room, it's about a 5 min walk to both. Lobby area is spacious with generous seating areas and also a restaurant area that serves a great breakfast, if you have the priority platinum membership, the lounge is worth it, free drinks (including FREE beer, wine, and hard liquor), finger food, and deserts. The gym is small but has a decent amount of workout equipment, the standard stuff, treadmill, bikes, etc. Service was exceptional, concierge pointed me in the right direction to eat and to see the sights. Overall very impressed.", "title": "Perfect", "helpfulness": 1, "user": "StevoA", "date": "July 10, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115210082}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "We flew into Copenhagen and arrived at 9:30am. When we finally made it to the hotel we were exhausted and so pleasantly surprised when the girl at the front desk said we could go to our room. We fell into bed, which was very comfy and slept for 3 hours. The room was very clean and very pleasant. It was cheap and easy to ride the metro into the city center on the modern metro with a station practically across the street. There was also a mall there where you could get food. This hotel had an ice machine across from our room.. You have to use your room key to operate the elevator which was a plus for safety. We were lucky to have booked a room after the end our cruise as well. They offer pick up and drop off between the hotel and airport. The taxi fare to the cruise ship and back is about $53 each way. We would highly recommend the Crown Plaza Hotel.", "title": "Great location and great hotel", "user": "crcarol119", "date": "July 5, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 4.0}, "id": 115068875}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled on business", "text": "I stayed here overnight between flights. I should have called ahead to find out about the shuttle -- tried the metro first, but realized that the hotel sits on a different line than the airport. 5 minute shuttle ride, great check-in staff, the lounge in nice, as are the rooms. Nice view of the city, seascape, and windmills on the horizon, but it's pretty far from the city. Did not try the metro as they were fixing the line the night I was in town.", "title": "Great option near CPH", "user": "nomad462", "date": "July 3, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 114998879}, {"rating": 3.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "Perfect place to stay next to the airport.", "title": "Great architecture, comfy beds -- but the service needs to be improved", "helpfulness": 2, "user": "liljuhvit", "date": "July 3, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 3.0}, "id": 114986410}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "We stayed here for two nights in July 2011.", "title": "Perfect. Close to airport, metro, train", "helpfulness": 2, "user": "Hoff-dk", "date": "June 24, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 114717076}, {"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled with friends", "text": "good pickup from airport.", "title": "nice place", "user": "vitreoretina", "date": "June 23, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 3.0, "service": 3.0}, "id": 114681524}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "rooms ok", "title": "great deal", "user": "ja45", "date": "June 21, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0}, "id": 114606963}, {"rating": 3.0, "stay_parameters": "Stayed June 2011, traveled on business", "text": "train services near hotel - fantastic", "title": "I was neither impressed nor disappointed by the property", "helpfulness": 1, "user": "dfisch891", "date": "June 19, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 3.0, "service": 4.0}, "id": 114333281}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled on business", "text": "- very very helpful guys at reception !", "title": "Good Hotel but more reception staff needed", "helpfulness": 2, "user": "steve1708", "date": "June 15, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 4.0}, "id": 113766918}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "breakfst buffet - good", "title": "Great place for pre-cruise and a base to see Copenhagen", "user": "kbrobeil", "date": "June 13, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 113280611}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "I was looking for a hotel that was close to the airport for a short stay between cities. My daughter and I were very impressed with the looks of the hotel. The location was a perk. They have free pick-up at the airport. You just go to the office of Sixt whcih is a car rental place. There is a desk with information that can direct you. We met another couple that were doing the same thing as I so we ended up riding back to the hotel together.", "title": "Great Place to Stay!", "user": "sparkyygirl", "date": "July 15, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115399831}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "you can walk to a mall and the metro and trains from the hotel. It took 5 minutes to walk to both. The hotel has transportation tickets that you can purchase and charge to your account. There is a Tyme machine in the mall and food places to eat.", "title": "wonderful stay", "user": "snshahmd", "date": "July 14, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 115364075}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "The rooms are fresh and modern looking. They had complimentary snacks and water. They also had a scent that you could spray on your pillow for a better nights sleep. The lady we checked in with was very business like. The morning staff were great and very personable an d friendly. I booked the night pre-paid and had a better rate this way. I also saw that they offer rides to the cruise port.If I were cruising out of Copenhagen I would definitely stay here again. Great beds too! Free Wifi! Breakfast is expensive $30.00 US/. The mall has great little places to pick up a breakfast item.", "title": "Almost all was perfect", "user": "comnen", "date": "July 12, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 115295297}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "We were picked up at the Sixt counter Copenhagen Airport after 11PM, eventhough their policy is only upto 11PM. Smooth checkin, clean and modern room with fruits and water at arrival. Good european continental breakfast in the morning. Good location for visiting Copenhagen, it's only a 10-15 minute train ride. Hotel within walking distance to Fields Mall.", "title": "Really good hotel close to the metro and train", "helpfulness": 2, "user": "traveling_peach2", "date": "July 11, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115236452}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "Booked 2 night for the price of 1 (priorityclub offer) and that was a great deal. there is a free shuttle service to/from airport, rooms are spacious, good beds, etc. Everything you can expect from crowne plaza! What I liked most, was the staff - very helpful and friendly. The only drawback was the wifi in our room, the connection was not stable.", "title": "Our new favorite hotel in Copenhagen.", "user": "oregongirl62", "date": "July 10, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115222177}], "location": {"country": "Denmark", "region": "Zealand", "continent": "Europe", "city": "Copenhagen"}, "stars": 4, "variance": {"poor": 20, "average": 90, "very good": 387, "terrible": 5, "excellent": 523}, "slim_ranking": 0.0275229357798, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.0}}