{"user_rating": 4.0, "review_count": 1968, "name": "Crowne Plaza London - St. James", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "My boyfriend and I recently went to London as a last minute trip and we booked this hotel through priceline.com. We got a great deal and I would highly recommend that site to travelers as well! Neither of us knew what to expect upon arrival and were very pleased with our booking when we arrived. The staff was extremely helpful with not only check-in, but helping us identify where all the major tourist sites were in relation to the hotel. The hotel is situated a short walk from Buckingham Palace, Westminster Abbey, Big Ben, Parliament and tons of restaurants! (Try the Bag o’ Nails for their fish and chips with mashed peas! It was so good that we went there twice!) They provided us with maps and even advised which bus/tube we should take to get around town.", "title": "Treated like royalty!", "user": "Boo512", "date": "April 17, 2008", "detail_rating": {"front_desk": 5.0, "service": 3.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 15112093, "likes": {"liked": "— The large size of the room and the clean and really nice bathroom.", "disliked": "— N/A"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2008, traveled on business", "text": "The room we stayed in was not in the main building. It was across the courtyard in the building with the Spa. It has a separate entrance than the main hotel and the lavender aroma of the spa was warm and welcoming. The elevator up to the 8th floor is extremely small! It fits 2 people comfortably. However, add luggage and an escort to your room and it’s a tight squeeze! I’m sure it would have been hysterical to watch 3 grown people and luggage trying to get in and out of the tiny tiny box! We were in room 879 which was non-smoking and very large! In my experience traveling Europe I have encountered many rooms that place 2 twin beds together to make a king. That was not the case here. It was an actual king bed with lots of pillows and a down comforter under the bedspread. The bathroom was exceptionally nice, and clean, with a hot towel rack and roomy shower. This room was great except for the fact that the window was blocked by the outdoor clock so we could not see the view of the courtyard. So if this is a concern to you I would recommend another room.", "title": "Superb location", "user": "George H", "date": "April 16, 2008", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 15087275}, {"rating": 5.0, "title": "Fantastic", "text": "Upon departure from the hotel to the airport I was a little disappointed with the help, or rather lack there of, they provided in helping us find an efficient way to the airport. Apparently there are 4 different ways to get to the airport from the hotel and we were only provided with 2 - taxi and tube. After seeing a bus stop, hours before departure, advertising a shuttle for more than ½ the price of the taxi, I was very disappointed. You need to book the shuttle 24 hours in advance. The final option of getting to the airport was by bus; we were not advised of this either until I complained to the manager about it. They became rude and said that it was not their staffs fault for not providing all the information, but rather us for not asking the right questions to obtain this information. It didn’t and still does not make sense to me.", "user": "nightprowler27", "date": "April 15, 2008", "id": 15046975}, {"rating": 3.0, "stay_parameters": "Stayed April 2008, traveled on business", "text": "Overall, it was a good experience and I would stay there again. Just be wise to their different means of transportation!", "title": "A default hotel", "user": "Joizee_HD", "date": "April 12, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 3.0, "rooms": 3.0}, "id": 14988663, "likes": {"liked": "— The default nature of the place.", "disliked": "— Cost of Internet access."}}, {"rating": 3.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "Close to Buckingham Palace and St James' Park, the Crowne Plaza is an elegant hotel within easy walking distance of St James' tube station and Victoria rail station. The rooms are large and have lots of nice little touches - small dark chocolates, kettle and tea making facilities, and free bottles of mineral water. The fitness centre has good facilities and power showers. My only gripe is that the lifts seem to be in a permanent state of upgrade - in the six months since my last visit one has been renewed and the other is out of service.", "title": "London for a week", "user": "NVRxman", "date": "April 10, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 14945291, "likes": {"liked": "— safe convenient location", "disliked": "— bedding"}}, {"rating": 5.0, "title": "Lovely hotel, tastefully decorated, great staff and excellent restaurants!", "text": "I have a long experience of staying at the Crowne Plaza and using both its restaurants, Bistro 51 and Quilon. The hotel is so tastefully decorated and the food is delicious in both restaurants, with Quilon offering some of the more refined Indian Cuisine in town, while Bistro 51 provides a gastronomic and varied Continental menu.", "user": "Tiz72", "date": "March 5, 2008", "id": 14067312}, {"rating": 4.0, "title": "Great for a weekend break", "text": "The staff are always very helpful which only makes each experience in that hotel more enjoyable.", "user": "niftynotfifty", "date": "February 26, 2008", "id": 13854457}, {"rating": 2.0, "stay_parameters": "Stayed June 2007", "text": "One of the finest places to dine and sleep in London.", "title": "Torn bedding!!! Not good value", "user": "Tripper21", "date": "February 25, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 2.0, "value": 1.0, "rooms": 2.0, "location": 4.0}, "id": 13823795}, {"rating": 5.0, "title": "Fantastic room and service", "text": "We stayed at this hotel for a weekend break in London. The check in was quick and as we had minimal luggage were left to find our own way to room. We had booked a standard room which was adequate in size although not large. We had a pleasant view of the court yard garden and fountain from our two little balconies. The room had everything we needed and was clean and well furnished, although the general style of the room is a little dated we hadn't come to london to stare at the interior of our hotel room. We found it to be convenient for both St James Park tube station and Victoria Station, which made getting around London very easy. We did not dine in the hotel at all, but found the pub at the end of the road did an excellent breakfast for £4.99! I would not pay top price for this hotel but if you spot a good deal then I would go for it.", "helpfulness": 3, "user": "MyReview4u", "date": "February 22, 2008", "id": 13756768}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "Poor value, even for London.", "title": "a hotel in a fantastic location", "helpfulness": 2, "user": "Lisa080", "date": "January 9, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 12460524, "likes": {"liked": "— the location", "disliked": "— the room could have done with decorating and new furniture although it was clean"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "We got a great rate on flight and hotel on our recent trip to London (our first trip there). The Crowne Plaza St. James was in a terrific location just down the street from Buckingham Palace and very close to the St. James Underground station. We bought two Oyster cards and traveled everywhere with great ease on the tube--wish we had the Undergroud here in Vegas!", "title": "Great experience!", "user": "Mark4216", "date": "April 7, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 14863930, "likes": {"liked": "— Location, location, location", "disliked": "— Pricey internet connection fees"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled on business", "text": "With the pound being so strong vs. the dollar, it was wonderful to have daily breakfast included at no extra charge. The wait staff proved attentive and the food was apparently the typical English breakfast of eggs, sausage, potato cakes, beans and mushrooms served buffet style (we had exactly the same meal at Heathrow before we left). Danish, croissants, fresh fruit, and fruit salads completed the meals with all the fresh juice and good coffee we wanted.", "title": "An absolutely wonderful experince.", "user": "seabro", "date": "March 31, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 14692895, "likes": {"liked": "— The staff", "disliked": "— Leaving"}}, {"rating": 3.0, "stay_parameters": "Stayed December 2007, traveled on business", "text": "Now, a few negatives: Only one elevator was running when we were at the hotel--not a big deal for us during the week, but we did notice longer wait times on the weekend. Our room was big enough for the two of us, but the carpet in the room was a bit worn and tattered. Also, you have to keep the bathroom door closed or the steam will set off the fire alarm--didn't happen to us, but we heard alarms periodically during our stay.", "title": "Average", "helpfulness": 1, "user": "Travelrug", "date": "March 27, 2008", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 3.0, "cleanliness": 2.0, "value": 3.0, "location": 2.0, "rooms": 2.0}, "id": 14571661}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "On the plus side, the bathroom was large, had lots of marble and had handy features like a towel heater, a 110v outlet for shavers (or cell phones) and a no-fog mirror. An iron, ironing board and clothes press / butler were all in the closet with a safe and small refrigerator.", "title": "Loved the location!", "user": "lovestotravel17", "date": "March 25, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 14519517, "likes": {"liked": "— the location", "disliked": "— the size of the bed (double)"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled on business", "text": "All in all, we liked our stay at the Crowne Plaza and I would recommend it to anyone wanting a bit more space with a trade off of not being in quite as new a property as some might like.", "title": "Nice place - good locatuion.", "helpfulness": 2, "user": "ferdia35", "date": "March 19, 2008", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 4.0}, "id": 14384907, "likes": {"liked": "— Location nearby Buckingham palace etc.", "disliked": "— The lifts :-)"}}, {"rating": 3.0, "title": "Good location - close to Buckingham Palace", "text": "I stayed two nights at the Crowne Plaza prior to business meetings outside the city. The location was perfect for exploring the city. Good walking location – close to Buckingham Palace and the sites and the tube. The room was ok sized, clean, and overlooked the courtyard which was beautiful. The hotel rooms/halls seem a little old but clean. It was extremely busy hotel but the staff were always polite and tried to help. The restaurant wasn’t anything special but convenient. I’d recommend try something offsite for lunch/dinner for better value and taste. If you take a taxi to the hotel be advised it’s in a congestion zone…I believe you incur an extra fee for drop off? Not really sure what that was about. Overall it was a pleasant first trip to England and enjoyed my stay at the Crowne Plaza.", "user": "Daphne418", "date": "May 23, 2008", "id": 16351872}, {"rating": 3.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "Have stayed here before, and stayed in the annex - which was a better room than this time - 359 in the main hotel.", "title": "Good location, but a tired looking hotel", "user": "Tony_BN", "date": "May 18, 2008", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 4.0}, "id": 16175592, "likes": {"liked": "— Location", "disliked": "— Tired hotel"}}, {"rating": 2.0, "stay_parameters": "Stayed May 2008, traveled with family", "text": "This room felt small for a 4* hotel, and was tired looking - small bathroom.", "title": "Initially not impressed", "user": "Scarysam", "date": "May 11, 2008", "detail_rating": {"front_desk": 2.0, "business": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 15939275, "likes": {"liked": "— The personal touches, Molton Brown toiletries, the concierge in each building.Showers are amazing", "disliked": "— check in, this hotel admit to overbooking, beware and upgrade is not always an upgrade"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "Other reviews say about only one working lift, which is still the issue, and although there is a sign saying the lift is being worked on, there's no sign of when it's going to be sorted.", "title": "Nice but not outstanding", "user": "bec_n_craig", "date": "May 10, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 15897495, "likes": {"liked": "— Location", "disliked": "— double bed, food service staff"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "The location is great - 10 minutes from Victoria station, and near Buckingham Palace, Houses of Parliament etc and local bars and restaurants.", "title": "best hotel best service", "user": "windsorctresident", "date": "April 23, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 15269278, "likes": {"liked": "— The professionalism of the staff and the accomodations", "disliked": "— expensive internet use"}}], "location": {"country": "United Kingdom (UK)", "continent": "Europe", "city": "London"}, "stars": 4, "variance": {"poor": 91, "average": 224, "very good": 715, "terrible": 26, "excellent": 912}, "aka": "Crowne Plaza London - St. James Hotel", "slim_ranking": 0.133953488372, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.0, "location": 4.5}, "description": "We look forward to welcoming you to Crowne Plaza London-St James, a traditional deluxe four star hotel in central London. Close to Buckingham Palace, The Houses of Parliament, the London Eye and Victoria Station, the hotel couldn't be better positioned for your business and leisure needs. This central London four star deluxe hotel offers supremely comfortable accommodation, excellent service and high speed internet access. You'll be spoilt for choice for somewhere to eat at the Crowne Plaza London-St James. The hotel boasts three excellent restaurants, including the Michelin-starred restaurant Quilon serving South-west coastal Indian cuisine, Bistro 51 serving a selection of international cuisines and Bank Westminster which serves classic British fare with a modern twist. This summer enjoy an al fresco dining experience at the Courtyard at 51, London's most secret hidden gem.Spa at 51 is the in-house spa and fitness centre. Unwind with a luxurious Anne Sémonin face or body treatment. The original pioneer of the 'a la carte' spa concept, Anne Sémonin has designed a bespoke treatment menu, fully trained all staff, and provided products and signature finishing touches to the Spa at 51. Alternatively, submit to the rigorous demands of a personal trainer. The Spa at 51 exclusively hosts Osmium for men - a natural grooming range developed especially for men. Afterwards, walk through our beautiful, award-winning, courtyard garden, surrounded by the Victorian buildings of the Crowne Plaza London St James. A peaceful oasis in the centre of London."}