{"user_rating": 4.5, "review_count": 234, "name": "Crowne Plaza St. Petersburg-Ligovsky", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "Stayed there form June 16th to June 19th in rm# 517. Very nice place, all employees are extremely helpful and attentive, especially front desk. We really enjoyed our time especially during this time of the year - so romantic... these nights...", "title": "Crowne Plaza St. Petersburg-Ligovsky is the place to be...", "helpfulness": 2, "user": "Vato84", "date": "June 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 132607344}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "As a priroity club member I was recognized and treated appropriately, bottle of champaigne in the room made our day - thank you, guys!", "title": "Saint Petersburg White nights", "helpfulness": 1, "user": "Banker361", "date": "June 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 132418874}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled solo", "text": "Anyway, Kudos to every stuff member. You are doing your job extremely well! I can surely say that Crowne Plaza Ligovsky is the place to be! I would recommend it to my friends and colleagues for sure.", "title": "Nice modern and clean hotel", "user": "AussieDylan", "date": "June 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 132350917}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with friends", "text": "The hotel is situated next door to the Galleria which closes at 23:00. The staff speak average to good English and restaurant menu has English. The hotel is recently refurbished so everything is new and clean. The rooms have a floor to ceiling electric blind which is vital for sleeping during the white nights.", "title": "Great Hotel in perfect location (مع شطاف في الحمام )", "user": "cm3207", "date": "June 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 132209873}, {"rating": 3.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "I only stayed here 2 nights and was pleasantly surprised. I walked in late after a horrible experience elsewhere and was therefor unable to speak to reservations about the length of stay I really needed, but the very friendly and helpful girl behind the reception desk did her best to find me a room for the first night that had no reservation marked against it on the computer system for the time I wanted. The room was very nice, if a only little cramped, but had a nice modern TV, comfortable bed, coffee making facilities and a nice big shower and sink in the bathroom. I had a room facing out the back of the hotel and while the view was pretty awful really, at least it was nice and quiet; I'm unsure what the rooms facing towards the major shopping center and metro would be like. Had excellent black out curtains and good air-conditioning - a must while traveling during Saint Petersburg's summer white nights. Room service was great, but expensive, but then where is room service not over priced? Laundry service is available but the price is ridiculous. The location is ok, but it depends on what you have come here to see, if you have come to see the main sites like St Isaac's, Peter and Paul's fortress and The Winter Palace/Hermitage etc, your best best would be to find something further west on Nevsky as its a bit of a hike. The one and only real disappointment was the fact that internet access incurred an extra charge (about $20 a day) and a network cable is needed. All in all I would stay here again, but would split my time up between here and somewhere further west for ease of access to everything this wonderful city has to offer.", "title": "Good location but pricey buffet breakfast!", "user": "Tyrone64", "date": "June 10, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 131659940}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "The staff, especially the front desk manager who checked us in are so nice. Friendly, helpful, dedicated to providing excellent service. They took time to explain about the White Nights and how to work the double set of blinds (one electronic).", "title": "A Jewel in Saint Petersburg...", "helpfulness": 2, "user": "ExploringtheEarth", "date": "July 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 134953672}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "The hotel is a jewel tucked into Saint Petersburg. Take a room on the 9th floor for excellent views back across the city and the Church of the Blood. There is an excellent shopping venue nearby. Also, you are walking distance to the sights, the metro, Stockmans Mall, Nevsky Prospekt, etc.", "title": "perfect new hotel ,great location", "user": "welltraveledA", "date": "July 11, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 134125953}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "The hotel rooms are very well appointed. Great attention to every detail. And the rooms are elegantly decorated.", "title": "Amazing Stay!", "helpfulness": 1, "user": "beaqueiroz", "date": "July 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 134121700}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "Great internet service.", "title": "Nice quite hotel with good access to transportation", "user": "2far", "date": "July 6, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 133599473}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "We have only wonderful things to say.", "title": "Crowne Plaza Ligovsky", "helpfulness": 1, "user": "Cheryl P", "date": "June 30, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 133116062}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with friends", "text": "At first glance, the hotel looks just like a hole-in-the-wall in a busy street. When you enter, the lobby is smallish, with the bar, reception, and 2 elevators all crammed in. Never mind. The rooms are great, cozy interiors, fashionable lazy chair, comfortable bed, excellent bath, nice wardrobe. They even provide a sleep aid kit for your convenience. Also, complimentary bottles of water (still and sparkling), unheard of in European hotels. The best thing is the location. Across the street is the Galeria mall. The metro is just one block away and perpendicular to the hotel is the busy Nevsky Prospect shopping street. Within a half kilometer radius are at least 10 coffee shops, 3 fastfood restaurants and several 24-hour convenience stores. Would recommend this hotel to anyone visiting St. Petersburg.", "title": "Five stars", "helpfulness": 2, "user": "drjohnled", "date": "June 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 131646065}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "-Nice location, right next to the big mall 'Galeria'", "title": "Great Hotel", "helpfulness": 2, "user": "ardguieb", "date": "May 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130750056}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "-Cozy rooms - had an adjoining with my parents", "title": "Fantastic rooms, great location, only issue was heating", "user": "lifeisbeaut", "date": "May 22, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130416098}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "-Small lobby area, right next to the bar.", "title": "Great hotel focused on a good night's sleep", "helpfulness": 1, "user": "treasuringlife", "date": "May 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 130247126}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled on business", "text": "-I could smell the smoke from the bar whenever I was using the wi-fi at the lobby", "title": "the staff makes this place special", "helpfulness": 3, "user": "Tobias R", "date": "May 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 130090274}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "Modern, clean, quiet (well our room was but I had requested a quiet room), exceptional service, very good staff. They speak very good English. Has a bar but no restaurant altho one could get breakfast there which we didn't because it's very expensive (but then Russia is not a cheap country). However, it's handy to lots of small cafes and there is a very large shopping mall (Galeria) across from the hotel with lots of restaurants and fast food. Our room didn't face the main street (Ligovsky Prospect) which meant it was quiet but the view was the back of other buildings which weren't pretty so don't expect a good view from this hotel. However, it's handy to local transportation although we chose to walk & Nevsky Prospect is just a short walk away from this hotel. It's not as central as the Radisson but we were very happy with the Crowne Plaza & recommend it highly to others.", "title": "Excellent hotel", "user": "Luvtotravel7", "date": "August 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 136117297}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled on business", "text": "I stayed 4 nights in this hotel, partly for business and partly for leisure. I was pre-informed about the professional staff of this hotel but it was beyond my expectations. The staff is outstanding, from bell boy to housekeeping to front desk. They did everything to make my stay an enjoyable one. I always request a no noise room and they made sure to check all the options they could offer me. After the first night I wanted to switch rooms, this was no problem, once again, they really tried to find a suitable room. And the second room was good. Especially the young lady from 19 years old, who was actually the telephone operator but was now also working behind the front desk (I forget her name, something like Stanislanka, was excellent in providing the best customer service. Also the bell boy, the smaller gentleman, was excellent in providing true service)", "title": "Exceptional customer service, great rooms, good location", "helpfulness": 3, "user": "Database M", "date": "July 31, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 135850815}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "The rooms are convenient, modern and upscale. Good quality beds, and the glass window pane in the shower is beautiful. The rooms are sound proof, however, you do hear noise coming from the hallway and from the next door neighbour. The bathroom is a little bit small, especially for make-up and toiletries. I did not use internet as I have a local sim and remote wifi but if I wouldn't have this, it would have cost me quite some money to get connected in my room (I don't like the \"free wifi in lobby\" concept, I want convenience when I am in a hotel, that means internet in my room)", "title": "Great location and quality", "user": "David G", "date": "July 26, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 135492768}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled on business", "text": "The location is just fine. I do not know why some people complain about the distance, probably people that are not used to walking 25 minutes. And even when you don't want to walk to the major cultural attractions, you can get many (trolley) busses just 5 minute walk from the hotel, that will take you in max 10 minutes to the Hermitage area for only 75 cents.", "title": "Great hotel, Great staff, Good location, Bad Wifi", "user": "anton_barr", "date": "July 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 135398789}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "I will definitely visit this hotel again when I am in St Petersburg.", "title": "Very good hotel", "helpfulness": 3, "user": "Marina T", "date": "July 24, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 2.0}, "id": 135261050}], "location": {"country": "Russia", "region": "Northwestern District", "continent": "Europe"}, "stars": 4, "variance": {"poor": 3, "average": 17, "very good": 91, "terrible": 1, "excellent": 122}, "aka": "Crowne Plaza St. Petersburg-Ligovsky Hotel", "slim_ranking": 0.096}