{"user_rating": 3.5, "review_count": 131, "name": "Crowne Plaza Hotel Cincinnati Blue Ash", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled on business", "text": "I stayed here a lot last summer and now am back to travelling. This place was as good as it used to be. The location is convenient, the hot and cold breakfast is delicious. The staff are very accomodating and friendly. The food in the restaurant near the main entrance is fair at best. Will definitely stay here again!", "title": "Still a great place to stay!", "user": "Shadow09Columbus", "date": "June 20, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 114585113}, {"rating": 2.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "Having never been to the Crowne Plaza Hotel in Blue Ash, Ohio, we fully expected a 3.5 star rated hotel. Our first issue was realized Sincas we turned on the bulky, small, and very OLD television. We had sound, but no picture. After calling the front desk, a young man brought us another very very old television that seemed to work. This was not the case. Within a few minutes, this television also lost its picture. As we'd turn the television on and off, we could get a picture back, but it would black out again within minutes. This was a great irritant. Since we had difficulty with the tv, my daughter tried your fitness center. There too, the theme seemed to be \"old.\" The running machine rattled and shook so much that my daughter worried it might fall apart! There was just one cup of caffinated coffee provided us, so the two of us had to share the one cup! We were awakened by a knock on our door at 9am. A gentleman whose English was difficult to understand spoke to me through the door. I could not understand him, and as a female with my daughter, was nervous to open my door to him. I guessed that perhaps he wanted to clean my room, so told him we'd be checking out a 11. This was a great disturbance to us as we had stayed up late sharing time together, and had planned to sleep late before embarking on our travels. This man was joined by another gentleman, and the two men conversed very louldy for several minutes as they went door to door in their attempt to clean rooms. This made me so nervous that I watch through the peep-hole. My daughter and I were unable to fall back to sleep due to the loud talking of these two employees. Lastly, the drape over the closet door rather than a door simply looks cheap. This is not what I would expect in a 3.5 star hotel.", "title": "Huge Disappointment", "helpfulness": 1, "user": "Momtveler", "date": "June 15, 2011", "detail_rating": {"cleanliness": 2.0, "sleep": 1.0, "value": 1.0, "service": 3.0}, "id": 113766041}, {"rating": 2.0, "title": "Animal cruelty?", "text": "Hotel was average but the breakfast area has a pool with 2 turtles and several koi fish. The turtles looked unhealthy (shells discolored) and they had no place to hide and there was a constantly running waterfall. It appeared they may be clorinating the water! I complained to the operations manager and she said she'd look into it but they really didn't know much about turtles. Called the General Manager to follow up and he seemed very disinterested, even when I suggested who he might call for advice. I'm not usually a complainer and I've never written a hotel review but I would urge other animal-lovers to ask about whether this situation has been resolved before they book a room here.", "helpfulness": 2, "user": "MissyP51", "date": "June 2, 2011", "id": 111088196}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "We stayed at this hotel in 2009 and had a pretty bad visit. This hotel has improved dramatically. The room we had was fantastic - roomy, comfortable, quiet, and clean. Dave, the manager, was great - he upgraded us to the business/executive floor for free, even though we booked through priceline.com. Will definitely stay here again!", "title": "Wonderful stay - huge improvement since 2009", "user": "JenniferTtraveler", "date": "May 29, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 110434257}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled with friends", "text": "We just had our 25th Old Time Radio & Nostalgia convention at the Crowne Plaza Hotel.", "title": "A great place to have a convention", "user": "CintiConvention", "date": "May 24, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 109631631}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with friends", "text": "This was the site for my 45th class reunion. What an absolute perfect place it turned out to be. The staff were all very friendly and professional. I truly felt that they they were invested in our reunion being a success. The food was outstanding, much better than I expected for such an outing. Although I didn't stay there myself I heard nothing but positive remarks from those who did. The location is perfect, easy in, easy out, plenty of attractions close by. I would highly recommend the Crowne Plaza in Blue Ash.", "title": "Outstanding", "helpfulness": 1, "user": "WarrenD171", "date": "July 19, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "service": 5.0}, "id": 115510608}, {"rating": 4.0, "stay_parameters": "Stayed July 2011", "text": "Nice, and above average. They have many components that could make it exceptional but need to pull it all together.", "title": "Nice, exactly what you thought you were getting.", "user": "ChiefPontiac", "date": "July 8, 2011", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 115172494}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with friends", "text": "I had organized our Class Reunion and was very stressed about putting everything together when I arrived. From the time I checked in I was greeted and waited on for my every need. The Crowne Plaza staff will get to know you by name and give you a feeling of family. I've never felt so safe and stress free in a hotel. I thank Vincent, Brandon and Chester for taking the time to stop and say \"how are you?; is there anything more we can do for you?\" This is the most professional staff I've experienced being around in a hotel! They must have a good boss to want to enjoy their job with the guests. Rooms are wonderfully comfortable and beautiful. For me, the free wireless internet access and aminities made me feel so pampered! I didn't have to ask for anything; the staff checked to see if I had what I wanted at all times. I'll always remember the delicious food too. Wonderful 2 day stay and I hope to go back!", "title": "You will love the service and personal attention!", "user": "barbstrip", "date": "July 5, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115065867}, {"rating": 3.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "I’d rate this hotel as 3* - clean rooms, clean bathroom, good enough fitness center, great service during breakfast – not bad selection. We are priority club members so we had our room for free – that’s why our room was right beside some outdoor fan – not sure what it was for - so I can’t say we had quiet sleep but when you pay $0.00 – can’t complain.", "title": "Just Good Hotel", "helpfulness": 1, "user": "sono1helen", "date": "June 29, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 3.0, "value": 5.0, "service": 5.0}, "id": 114871593}, {"rating": 4.0, "title": "Unfortunately, last night for the band", "text": "Hotel was close to amusement park, close to major HWY, 10 min drive to shopping centers – in general we were very happy with it.", "user": "Rob_sails", "date": "June 23, 2011", "id": 114672520}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "This hotel seems older. The halls are narrow and dark. The elevators are a walk around, past the open breakfast area and near the pool that it open to everything.", "title": "Friendly staff, odd layout", "user": "otsthedog", "date": "December 26, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 122109165}, {"rating": 3.0, "stay_parameters": "Stayed August 2011, traveled on business", "text": "But, other than that, it's pretty standard. Check-in is quick and easy and if you belong to their Priority Club, they give you a couple of tickets for free drinks. The front desk staff also made local recommendations for dining options and let us know where the business center and restaurants were located. The room are nicely furnished and an added amenity in the rooms including sheet spray and an eye mask on the bed. There was a separate sitting area with a small couch and coffee table.", "title": "Decent business stay option..", "user": "vebee", "date": "November 12, 2011", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 120502598}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "We had the breakfast buffet and the waitresses were friendly and accommodating, especially when my niece and nephew showed up.", "title": "Great customer service!", "user": "Murray2417", "date": "November 8, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120345569}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "The pool itself is small and not necessarily conducive to swimming laps. But, we were there to swim with my 3- and 6-year old niece and nephew, so it was perfect. Just deep enough to have an element of challenge for them, but not scary!", "title": "Good Stay", "user": "NYTripper088", "date": "September 5, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 4.0}, "id": 117701934}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled on business", "text": "Self parking is easy. And, it's very accessible -- right by the interstate.", "title": "Great hotel... Will go back!", "user": "ikazi", "date": "August 27, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 5.0}, "id": 117318813}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled on business", "text": "The stall is great and friendly Like they want you to enjoy your stay.", "title": "It sounds like you are the only one there You don't hear doors slamming or people stomping great place for a good night.", "user": "Ridge18", "date": "August 25, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117249159}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "My husband and I stayed here for the night and the hotel was awesome! Front Desk staff was outstanding! Always there to make sure there was anything they could do to help us. Lobby Lounge bartender was excellent. Very friendly and knew the city very well. Didn't eat the breakfast, but food smelled really good. The room was clean and well lit. Would definitely stay here again!!!", "title": "Great Stay..would definitely stay again!", "user": "Lynn S", "date": "August 20, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117007904}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "I enjoyed my stay this hotel! The location is great! Central location to lots of shopping, dining and to the Amusement Park \"Kings Island\". The hotel is in good condition! Rooms are very clean, spacious and has everything you would need. The hotel staff is very friendly, always willing to help us out with directions and such. If I were to visit Cincinnati again I would certainly stay at this hotel! I have only been there once and obviously don't know many other hotels in this area, however I was quite plased with my stay and would have no reason to look elsewhere. I would recommend this hotel for sure!", "title": "Good Hotel & Location", "helpfulness": 1, "user": "robrende", "date": "August 19, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 4.0}, "id": 116938153}, {"rating": 2.0, "stay_parameters": "Stayed August 2011, traveled on business", "text": "I agree with the next most recent reviewer: we must have stayed at different hotels. I cannot believe this property received most of its ratings in the \"excellent\" category. The Plaza Hotel in New York, the Savoy in London, the Ritz in Paris are \"excellent\" hotels. This is a dump, something on the lines of a mid-1970's Best Western. It does have a business center and a breakfast on par with an Embassy Suites (which by the way, is down the road and I have stayed there several times and recommend that). The hallways are cinder block, the doors are old metal ones with several layers of paint, and the dead giveaway for its age and cheapness was the 1970's pseudo plastic \"marble\" shower. My clock radio was broken and I had to rely upon a wakeup call (to their credit, they did occur on time). Even if the radio had been operational, the directions were totally for a different model (there is no \"buzzer\" button) and were useless. I couldn't get into my room upon checking in at 10:30 PM because the \"handles stick all the time\". They called maintenance and made me WAIT at that hour rather than simply give me another room. The walls despite being cinder block in the hallway are paper thin and I could hear the barn animals, oops I mean people, next door coughing , clearing their noses, throats, etc. as if they were right in front of me. The bed and pillows were comfortable and after the slobs next door finally shut up and morons stopped calling down the hallways at midnight I was able to sleep well. The restaurant staff is very friendly and efficient. Crowne Plazas in the San Francisco area at least are quite nice, like Hiltons or Sheratons, but this is like they bought a Best Western and stuck their name on it. Gross. AVOID.", "title": "Yes, you and I DEFINTELY stayed in a different hotel", "helpfulness": 1, "user": "Erica K", "date": "August 13, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 1.0, "service": 2.0}, "id": 116641719}, {"rating": 3.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "I have to say I am amazed at all the glowing reviews for this property - and wonder if we stayed at the same place or were transported to a different dimension. I can't say the experience was truly poor, but after our stay, we certainly wouldn't stay here again.", "title": "Did we stay at a different hotel than others?", "user": "nedlyj", "date": "August 3, 2011", "detail_rating": {"cleanliness": 2.0, "sleep": 3.0, "service": 3.0}, "id": 116235112}], "location": {"country": "United States", "city": "Blue Ash"}, "stars": 3.5, "variance": {"poor": 14, "average": 26, "very good": 43, "terrible": 9, "excellent": 39}, "aka": "Crowne Plaza Cincinnati", "slim_ranking": 0.555555555556, "description": "Quality and convenience found at Cincinnati, Ohio hotel! The best of Cincinnati awaits you at the newly renovated Crowne Plaza Cincinnati - Blue Ash, winner of Intercontinental Hotels Group's Renovation of the Year award. While lodging in our Cincinnati hotel rooms, you can enjoy close proximity to many local attractions such as the Reds' Great American Ball Park, the NFL Bengals' Paul Brown Stadium, Kings Island and Beach Water Park. Immerse yourself in the rich history of the area with a tour of the National Underground Railroad Freedom Center, or experience Cincinnati culture with a trip to Newport on the Levee. Our Cincinnati, Ohio hotel is minutes away from Ethicon, Toyota, Procter & Gamble, Siemens, Fifth Third Bank, Cincinnati Eye Institute, Coca Cola and other major corporations in Blue Ash. Our hotel can meet your business and meeting needs with free high-speed, wireless Internet access, a 24-hour business center and more than 12,000 square feet of meeting space with audio/visual equipment. You can have all your needs met at our Cincinnati hotel with amenities that include the Town Square Atrium Restaurant, a lobby lounge, an indoor pool with sky lights, a poolside lounge and a 24-hour fitness center. Our Crowne Plaza Cincinnati - Blue Ash staff look forward to serving you. Book your Cincinnati hotel reservations now and enjoy our excellent hotel deals and rates."}