{"user_rating": 4.0, "review_count": 111, "name": "Crowne Plaza Hotel", "reviews": [{"rating": 1.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "I would like to start this review by saying that we didn’t actually stay in Crowne Plaza hotel but we did use one of their facilities and that’s what happened. During our recent trip to Minsk we were celebrating our fifth wedding anniversary and after a great meal in the restaurant we decided to continue our night in one of the night clubs. As it was a Friday night the choice of venues wasn’t great and one of my friends suggested Next nightclub that belongs to Crowne Plaza Hotel and as it was very conveniently located next to the restaurant, we decided to check it out. Six of us: my husband, myself, my brother and three of my girlfriends, all in the late twenties-early thirties, very well dressed and well behaved entered the establishment at around midnight. This nightclub is very new and none of us has been in it before, so the first thing we’ve asked if it was possible for one person to have a quick look inside just to observe what type of clientele this nightclub had and what type of music DJ was playing. We were refused in that request and were told that if one person wants to come up there is no problem but only after buying a ticket. For the establishment that promotes and positions itself as a high end entertainment venue in Minsk, especially being so new, I don’t think it is an acceptable attitude towards customers. So I decided to buy a ticket and to have a quick look inside. I did like the atmosphere of the club and came back to my friends with the intentions of all of us buying tickets and going inside and enjoying the celebration of our anniversary. But before getting in we had to pass a “face control” – a guy, without name badge and who refused to give us his name, looked at my husband and said that unfortunately he can’t come into the nightclub as he doesn’t satisfy the appearance policy of the club. I was in shock to hear this as all of us were very well dressed and if you saw the attire of some of the girls passing by- you would understand why I was furious. What made me even madder was the actual look that the “face control” guy gave to my husband, it was so humiliating. My husband and I are well travelled people and were never refused admission anywhere around the world. As my husband doesn’t speak Russian I asked to speak to the manager; administrator (supervisor) Victoria Chernaia came down to speak to us (very negative experience, even after her apologies for misunderstanding and inviting us all into the club). I won’t go into any more details but I felt so ashamed for the country I was born in. Only few months ago we stayed in the hotel Europe and had such a great experience, the service was so amazing that it was more like staying somewhere in Europe and that time I said to myself- WOW, Belarus is becoming so much more civilised but this time all my illusions about customer service getting into European level felt apart. Until the likes of Victoria and a “face control” guy are employed in the hospitality sector- Belarus tourism industry has no future. Personally I felt like back into USSR rather than welcome to E.U.", "title": "If you want to feel humiliated…..", "helpfulness": 9, "user": "nadiasmyth", "date": "March 15, 2009", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "location": 5.0, "service": 1.0, "rooms": 5.0}, "id": 26218223}, {"rating": 5.0, "stay_parameters": "Stayed January 2009, traveled with family", "text": "I'm a great fan of Priority Club PointBreaks, so a four night trip to Minsk was too good a deal to resist. Our room was superb, very comfortable, warm, super bathroom with seperate tub and shower. A flat screen TV had channels from most of Europe, one odd thing was all light switches were master switches - even the bedside switches turned everything on and off.", "title": "Great hotel in a magical city", "helpfulness": 3, "user": "CrestaRider", "date": "January 27, 2009", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 23937093}, {"rating": 5.0, "stay_parameters": "Stayed January 2009, traveled on business", "text": "January was probably not the best month to visit Minsk, when temperatures can reach -15, but we loved every minute. The restaurants are super and very varied in style, though sometimes difficult to find. There are very few tourists - especially in January - but everybody made us feel very welcome.", "title": "Smiles Everywhere", "helpfulness": 2, "user": "emandernie", "date": "January 21, 2009", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 23758311, "likes": {"liked": "— Attentiveness of staff", "disliked": "— Poor lighting and wireless cutting out"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2008, traveled on business", "text": "Crowne Plaza has done an excellent job training its staff as everyone seemed to be genuinely interested in whether my stay was okay. The front desk and concierge speak English extremely well or got someone right away to assist if need be. The cleaners were pleasant as well, as were the waitresses and cook in the restaurant. Sounds strange to be commenting on all this but friendliness can be hard to find in ex-communist countries. Rooms are very large and comfortable; the complimentary wireless still has a few bugs in it at times; and everything was very clean. The only complaint is one that can be attributed to most Crowne Plazas and that is poor lighting. This place will be the place to stay at once the gym and pool are completed this spring. I'll be back.", "title": "A nice property - would recommend and stay again", "user": "Jeremy F", "date": "December 14, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 2.0, "cleanliness": 5.0, "value": 4.0, "location": 3.0, "rooms": 4.0}, "id": 22713079, "likes": {"liked": "— Room comfort", "disliked": "— Front desk missing my wake-up call."}}], "location": {"country": "Belarus", "continent": "Europe"}, "stars": 5, "variance": {"poor": 7, "average": 19, "very good": 51, "terrible": 6, "excellent": 28}, "aka": "Crowne Plaza Minsk", "slim_ranking": 0.217391304348, "description": "Hotel opened on 26 May 2008. The Crowne Plaza Minsk hotel is a 5 star international hotel in the heart of Minsk. The hotel, with its unique architecture, is located in the Minsk city centre opposite the Minsk Dynamo Stadium and within walking distance from the Minsk Nezavisimosti Square. Shopping, cultural institutions, attractions of the city and business spots are all within easy reach from the hotel via underground or even walking. The Crowne Plaza Minsk hotel offers 115 elegantly designed rooms including 2 Presidential Suites and Crowne Plaza Club Rooms. All rooms are equipped to the very high standards including wireless internet connection, air-conditioning, a dedicated work area with data-port, satellite large screen LCD television, mini-bar, safe, iron / ironing board, hairdryer and teapot. Indoor swimming pool, SPA, Fitness Centre - opnening soon!"}