{"user_rating": 3.5, "review_count": 259, "name": "Crowne Plaza Los Angeles Harbor Hotel", "reviews": [{"rating": 4.0, "title": "Excellent Pre or Post cruise hotel", "text": "Wonderful location close to the pier. Easy walking distance to several restaurants. Room was very clean and large. The shuttle was only available for the trip to the pier so we used the commuter bus for our visit to Long Beach. The concierge was wonderful and very knowledgeable. Our room overlooked the pool and waterway and we saw a ship leave which was nice. The coffee was expensive and in room was single pods but the last morning we found a coffee shop across the street which was great. I would stay there again because of the cleanliness and convenience.", "user": "IRB33785", "date": "November 7, 2006", "id": 6082175}, {"rating": 3.0, "title": "Mixed experience", "text": "This hotel is now called the Crowne Plaza Los Angeles Harbor", "user": "Mich_12345", "date": "October 29, 2006", "id": 6026713}], "location": {}, "stars": 3.5, "variance": {"poor": 17, "average": 59, "very good": 98, "terrible": 17, "excellent": 68}, "aka": "Crowne Plaza Los Angeles", "slim_ranking": 0.275641025641, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "description": "The Crowne Plaza Los Angeles Harbor Hotel is located just four blocks from The World Cruise Center, the gateway for Royal Caribbean, Norwegian and Princess Cruise Lines. The Crowne Plaza Los Angeles Harbor Hotel & Suites overlooks The Port of Los Angeles! This 10-story hotel offers 244 guest rooms including 56 suites in historic downtown San Pedro, CA.The Crowne Plaza Los Angeles Harbor Hotel is where your Southern California experience begins! All of our guests will enjoy a better sleep with our Crowne Plaza Sleep Advantage bedding, amenities and our complimentary shuttle service to and from Del Amo Mall, Costco and anywhere within a 5 miles radius from the hotel. The hotel has twelve meeting rooms with flexible space for events that can accommodate from 12 to 400 people. Internet access is available throughout the hotel.The Crowne Plaza Los Angeles Harbor Hotel, located in downtown San Pedro, CA offers the perfect place for weddings, receptions, social celebrations and family reunions. In addition, we specialize in corporate meetings, business conferences, company retreats, company training seminars and sales and marketing meetings. Business travelers will appreciate our proximity to Long Beach Convention Center, Trump National Golf Club, Los Verdes Golf Club, Los Angeles International Airport (LAX) and to fine restaurants."}