{"user_rating": 4.5, "review_count": 316, "name": "Crown and Trumpet Inn", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed June 2013", "text": "This is traditional shabby but cosy accommodation in the centre of Broadway. It was booked and paid for as bed and breakfast but as I had to leave by 7.30 I was told I could not have anything and no refund was forthcoming.The upstairs was marred by the smell of stale fat that hung in the air( air fresheners would not go amiss!). However bed comfy and wifi in room amazing.The tiny bathroom lacked toiletries and when I left at 7.30 had to unlock myself out of darkened pub and push keys back . Just not good enough.", "title": "Uses online booking engine but fails to stipulate breakfast times but takes money and refuses refund. Poor value B & B", "helpfulness": 1, "user": "swimcol", "date": "June 11, 2013", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "location": 5.0, "service": 1.0, "rooms": 3.0}, "id": 163722743}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "We recently spent the May Bank Holiday weekend at The Crown and Trumpet and had a very enjoyable stay. From the start everyone we encountered were friendly and helpful and Andrew Scott, the owner, was always on hand to answer any questions about the pub itself and the area. The bedroom was clean and comfortable and the breakfast each morning was excellent with everything cooked fresh. The pub was as a pub should be, very traditional and full of character. Good choice of beers and wines and an extensive food menu all of which were excellent. The pub provided an excellent base for travelling within the Cotswolds and was just off the main street in Broadway itself.", "title": "Tony and Debbie - A great Bank Holiday weekend stay", "user": "Tony J", "date": "May 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 160364070}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled on business", "text": "I recently spent 2 nights at the Crown & Trumpet when visiting the area on business. My room was clean and comfortable - don't expect Holiday Inn style accommodation, I believe the building dates back to the 17th century and the decor is in keeping with the architecture...much better than the sterile environment offered by the Holiday Inn/Travel Lodges of this world in my opinion.", "title": "Excellent all Round!", "user": "Brendan M", "date": "April 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 158207500}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "The hotel's strength lies in the atmosphere created by it's employees. Everyone that I encountered, from the owner (a real Gentleman) to the bar and kitchen staff went out of their way to welcome me. Food was all locally sourced and cooked in the hotel. It's not \"fine dining\", but the portions are hearty and more importantly everything tasted delicious! (noteably, the homemade pies - I had to loosen my belt after my meal!) The real ales were also delicious, of course I had to try them all.", "title": "A proper pub", "helpfulness": 2, "user": "geoffhill1", "date": "April 16, 2013", "detail_rating": {"value": 5.0, "location": 5.0, "service": 5.0}, "id": 157938752}, {"rating": 5.0, "stay_parameters": "Stayed April 2013", "text": "In summary, if you're looking for accommodation or simply a good honest meal and/or a couple of pints, you could do a lot worse than the Crown & Trumpet. I'll be in the area again on business very soon and will make this my first port of call.", "title": "perfect stay", "helpfulness": 1, "user": "CarmelAdamson", "date": "April 15, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 157759438}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "Stayed for a couple of nights in July 2013, recommended by a friend and not disappointed. Made to feel welcome and nothing too much to ask of Andrew and staff. Great location in Broadway, pub provides traditional accommodation which is reflected in decor and furnishings - totally in keeping with the area. Enjoyed breakfast which set us up for the day and also enjoyed spending latter part of evenings in the bar. Would recommend.", "title": "Wonderful short break in Broadway", "user": "Kerzy", "date": "July 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 169161735}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "Great pub. Good clean accommodation and good food. Enjoyed the Jazz. Hospitality excellent. Ollie cat enjoyed it too. Setting is lovely and is a relaxing place to sit outside on a summer evening. Some parking available but main car park is free from 6pm at night until 8am in the morning.", "title": "jazz night", "user": "NBAshtre", "date": "July 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 169149572}, {"rating": 2.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "First up: staff were lovely, and we had a delicious Sunday roast here. Accommodation wise: very disappointing. The most expensive place we stayed in along the Cotswolds Way, and by far the least pleasing. Tiny musky room with the only access to fresh air being to open the window out to the front yard and listen to the locals drinking and burping into the night. Breakfast wasn't served until 9am which is far too late. We needed to make an early start walking but that was 'too bad' - no alternative breakfast arrangements were on offer. Overall, sorry but I cannot recommend this pub as a b&B. great for a Sunday roast though.", "title": "The biggest disappointment on the Cotswolds", "helpfulness": 4, "user": "Thorpe101", "date": "July 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 2.0, "value": 1.0, "sleep": 1.0, "rooms": 2.0, "location": 5.0}, "id": 168335780}, {"rating": 5.0, "stay_parameters": "Stayed June 2013", "text": "I've stayed at the Crown and Trumpet a few times now, as I have been working in the area. It really is a \"home from home\". The village of Broadway is beautiful and the Crown is in keeping with it's surroundings. The staff, what can I say!? I feel like part of the family, Andrew, the owner makes a point of knocking on my door every time I'm there to make sure everything's ok. The staff are wonderful! Always happy to help and great company. The food is fantastic, very reasonably priced, cooked on the premises, the ingredients are locally sourced and the selection of locally brewed beers and ciders is wonderful!", "title": "Just Gets Better", "user": "Brendan M", "date": "July 5, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 166387631}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with friends", "text": "Although I visit the Crown and Trumpet as part of my job, I always feel like I'm on holiday when I stay there. A live jazz band performed in the bar last night...great entertainment and a great mix of locals and visitors in the audience made for a fantastic night!", "title": "Couldn't have been more pleased", "user": "Jane W", "date": "June 25, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "location": 5.0, "service": 5.0}, "id": 165192419}, {"rating": 5.0, "stay_parameters": "Stayed June 2013", "text": "We have just returned from 4 nights at this lovely old original pub. Andrew is a brilliant host - nothing is too much trouble for him. His staff are all very friendly and helpful. Our room was very comfortable and clean with tea, coffee, toiletries and towels all provided. The breakfasts were served almost as soon as we sat down in the morning by a lovely cheerful lady. We also had a meal there every night as we didn't feel we needed to go anywhere else. Thank you Andrew for making us so welcome - we will be seeing you again !", "title": "What a super place !", "helpfulness": 1, "user": "Suzannekendragould", "date": "June 21, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 164731147}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "Just a quick note to say what a great pub the crown is. Just a stones throw from the tourist busy Main Street of broadway liesht e crown. The real ale is a winner, with awards from CAMERA and the food is good at half the price of the other village pubs. The landlord takes a real interest in his customers, is friendly, polite and knowledgeable about his trade. You will not go too far wrong visiting this pub.", "title": "Great old country pub", "user": "AngeEpiskopi", "date": "June 20, 2013", "detail_rating": {"value": 5.0, "service": 5.0}, "id": 164625571}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "Lovely olde worlde inn, with wonderful homecooked food, very reasonably priced(especially for Broadway). The owner and staff made us really welcome and even let our Newfy in. We had a", "title": "Lovely olde worlde Inn/ Wonderful homecooked food.", "helpfulness": 1, "user": "dogshow1", "date": "June 19, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0}, "id": 164488564}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "great nite and will certainly go back next time we are in the area. Food to die for!!", "title": "Leo & Liz", "user": "Leo1234238", "date": "June 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 164264978}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "A traditional pub (unusual in itself) serving excellent food and overseen by the friendliest of staff. Nothing was too difficult. If you have the opportunity to stay overnight on a Thursday, when there is a Jazz group playing you will be in for a real treat. From someone who can take or leave Jazz this was an outstanding evening from musicians who are second to none yet are able to keep up a funny patter throughout their performance. I would highly recommend them to anyone.", "title": "Still a fantastic place..No surprise there !!!", "user": "pete h", "date": "June 16, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0}, "id": 164165560}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "We visited for Sunday lunch. The staff were all very welcoming and friendly. There is a good selection of proper beers and the food was excellent and sensibly priced.", "title": "Welcoming and traditional pub", "helpfulness": 1, "user": "leisure_traveller35", "date": "April 7, 2013", "detail_rating": {"value": 4.0, "service": 5.0}, "id": 156902751}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "The pub itself is quite traditional but comfortable, lovely and warm with an open fire in the bar.", "title": "Lovely traditional Inn", "user": "Julie B", "date": "April 6, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 156768455}, {"rating": 5.0, "title": "Return to one of our favourite traditional pubs.", "text": "Excellent service from the moment we arrived. We stayed Easter Sunday and had a lovely home cooked Sunday lunch, and full English cooked breakfast the following morning. The owner made us feel very welcome and we would stay there again. This is a proper English inn run by a proper English gent.", "user": "Johneaves", "date": "April 5, 2013", "id": 156709250}, {"rating": 3.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "We stayed in room 5 and it was lovely.", "title": "warm welcome, disappointing food", "helpfulness": 1, "user": "Rosemary P", "date": "April 2, 2013", "detail_rating": {"value": 2.0, "service": 4.0}, "id": 156343648}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "What a great little tradional pub this remains. We once again made a slight detour to enjoy a lunch and pint as we were travelling through this part of the country. Warm welcome, great beer and consistently good food make this an ideal stopover. And the village itself is a pleasure to stroll around - albeit in freezing cold weather!! Thanks for keeping this place so traditional. Please dont change.", "title": "Very friendly and welcoming", "user": "Styx58", "date": "April 1, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 156273725}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "variance": {"poor": 14, "average": 13, "very good": 92, "terrible": 6, "excellent": 191}, "aka": "Crown And Trumpet Hotel", "slim_ranking": 0.322580645161, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.0, "location": 5.0}, "description": "Situated just behind the village green of Broadway this traditional 17th-century inn, built in Cotswold stone, with four rooms for midweek and weekend breaks. Free wireless internet connection. Serving Lunch and Dinners all through the week using locally produced ingredients to make seasonally cooked homemade dishes actually cooked on the premises. Open Fire. Jazz and Blues nights. Just off the Cotswold Way, centrally located for touring Shakespeare's Country and the Cotswold and Malvern Hills."}