{"user_rating": 3.5, "review_count": 212, "name": "Crowne Plaza Foster City - San Mateo", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed February 2007", "text": "Enjoyed my stay with upgraded room; bed very comfortable with \"Sleep Advantages.\"", "title": "Nice stay", "user": "bijou2006", "date": "July 20, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 3.0, "cleanliness": 5.0, "value": 4.0, "location": 3.0, "rooms": 4.0}, "id": 8203029}, {"rating": 4.0, "title": "Very nice, semi-swanky hotel", "text": "Free parking. Starbucks nearby. Good Internet connection. Great value for money if you don't have to stay in the city.", "user": "flipperling", "date": "May 28, 2007", "id": 7706486}, {"rating": 3.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "We stayed at this hotel because we got a group rate for a nearby event. Our room was clean, quiet, and spacious, with a large window, a comfortable bed with quality linens, and a large bathroom. The hotel utilizes a lot of natural light in the lobby, hallways, and rooms, which lends it a spacious and open feel. We ate dinner in the hotel restaurant, Cafe Florian, and the food was superb, but the service was poor. The desk staff was helpful and friendly. There is a shopping center with Target and Starbucks, as well as several restaurants, within walking distance of the hotel.", "title": "nice hotel not too far from airport", "helpfulness": 3, "user": "gaupai", "date": "May 23, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "business": 5.0, "cleanliness": 4.0, "rooms": 4.0, "location": 4.0}, "id": 7676308, "likes": {"liked": "— location", "disliked": "— nightclub"}}, {"rating": 3.0, "stay_parameters": "Stayed April 2007, traveled on business", "text": "A nice place to stay at our group rate, but we would probably look for someplace less expensive without it.", "title": "Not what you pay for!!!!", "helpfulness": 1, "user": "smitr2002", "date": "April 19, 2007", "detail_rating": {"front_desk": 3.0, "business": 4.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 3.0}, "id": 7394801}, {"rating": 4.0, "stay_parameters": "Stayed January 2007, traveled on business", "text": "stayed hear for 6 nights in may", "title": "Great bedding puts this hotel a step above...", "helpfulness": 3, "user": "RedSox604", "date": "January 19, 2007", "detail_rating": {"front_desk": 2.0, "business": 4.0, "service": 2.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 6623833, "likes": {"disliked": "— Food, lack of services (valet parking, luggage assistance)"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "I was very impressed with the hotel. The staff was very helpful, the rooms were great and hotel was very clean. One of the Shuttle Van Drivers was particularly helpful. I would definately stay at this hotel again.", "title": "Great Hotel!", "helpfulness": 2, "user": "Mariposa1020", "date": "September 8, 2006", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 3.0}, "id": 5780094, "likes": {"liked": "— The Room and Staff", "disliked": "— Shuttle runs until 10:30 PM"}}, {"rating": 1.0, "title": "Worst Experience Of My Life", "text": "I recently had the unfortunate experience of staying at the Crowne Plaza Foster City. The front desk staff are terrribly rude, especially a gentleman by the name of Pedro. The rooms are comparable to a Holiday Inn, which sums up the quality of the hotel. Save your money and stay at the Marriott nearby.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "July 18, 2006", "id": 5480873}, {"rating": 5.0, "stay_parameters": "Stayed April 2006", "text": "We stay at the Crowne Plaza in Foster City on Chess Drive everytime we fly out of SFO. We have never been disappointed or had a bad room (although some can be noisy near the lobby). There is another \"airport\" Crowne Plaza on Airport Blvd in Burlingame, quite close by and in a similar position from the freeway. It is actually CLOSER to the airport but not as nice. Once we ended up there by accident even though we had previously been to the correct one. The BURLINGAME Crowne Plaza is not impressive. At least one of the previous reviewers and possibly others have confused the two. The Hilton Garden Inn is accross the street from the BURLINGAME one, not the better FOSTER CITY one. Buyers, readers, and reviewers beware.", "title": "resaon for variable reviews", "helpfulness": 1, "user": "CameliaRose", "date": "June 21, 2006", "detail_rating": {"cleanliness": 5.0, "rooms": 4.0, "service": 4.0}, "id": 5372824}, {"rating": 3.0, "stay_parameters": "Stayed April 2006, traveled on business", "text": "I expected an averge hotel based on the star rating and that is exactly what this is. If you want a bed, OK food, a small gym and a bar then this will suit you fine. Even with the refurb the decor looks tired and dated.", "title": "Tired and dated - noisy Sat nights", "user": "Deanio", "date": "May 8, 2006", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "rooms": 3.0, "service": 3.0}, "id": 5041564}, {"rating": 5.0, "stay_parameters": "Stayed March 2006, traveled on business", "text": "Beware the weekends - the hotel is popular for wedding and birthday parties and there are lots of groups making use of the function suites. Sat night I was awake until 01:30 a.m. due to noise. The desk did warn me but I thought they might have a midnight cut-off or similar.", "title": "Just Great!", "user": "Stella", "date": "March 30, 2006", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 5.0, "service": 3.0}, "id": 4822651}, {"rating": 1.0, "title": "Not worth it, even for free!", "text": "We just stayed here for 2 nights this weekend in a suite for free based on the problems we faced holding an event here (see below for details!) Even for free it's not worth the bother staying here.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "October 23, 2005", "id": 4046283}, {"rating": 5.0, "stay_parameters": "Stayed October 2005", "text": "First off the parking situation here is bad, partially due to the fact there are dozens of containers in one of the parking lots for their so called renovation that's been going on all year and was to be completed months ago. The front counter people are rude and unhelpful, the person helping us snapped at us when we let him know we were staying 2 nights instead of the 1 he stated. We had a suite in the executive tower that came complete with dust bunnies on the bed sheet and pillowcase as well as an extra dirty sock in the corner - not to mention the crusty dirty ice bucket.", "title": "Excellent hotel Choice", "helpfulness": 1, "user": "campi", "date": "October 19, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 4.0}, "id": 4036061}, {"rating": 1.0, "title": "You'll need the earplugs they supply.....", "text": "On the last morning of our stay, we were walking back to our room when we saw the maid talking to one of our neighbors telling her she needed to clean the room now. The guest replied checkout wasn't until noon, and asked if she could get some towels since none were left the day before. The maid actually refused to give her any, indicative of the customer service at this hotel.", "helpfulness": 3, "user": "Sapppro", "date": "October 3, 2005", "id": 3986813}, {"rating": 3.0, "stay_parameters": "Stayed September 2005", "text": "One thing we should mention is the poor layout of the meeting rooms and lobby. If you are staying in the executive tower you need to walk through the meeting room lobby to get there, and if there is any type of event going on (as this usually is) you have to claw your way through the throngs of people blocking the way.", "title": "Under Construction", "helpfulness": 2, "user": "dej", "date": "September 19, 2005", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "service": 2.0}, "id": 3924136}, {"rating": 4.0, "stay_parameters": "Stayed September 2005", "text": "So if you like rude staff, dirty rooms and free socks, this hotel is for you. If not, I would look elsewhere.", "title": "Great newly remodled rooms..The Florian NOT good", "user": "carlie1964", "date": "September 6, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3846306}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled on business", "text": "I stayed at this hotel for a friend's wedding nearby. They offered really great rates for a weekend stay. The hotel offered complimentary shuttle service to and from the San Francisco Airport and the driver was great.. he was a character!!! The front office staff were very friendly and seem really knowledgeable about the hotel and all that it has to offer. I also loved their sleep advantage kit... I've never stayed in a hotel that offered relaxing kit! The hotel is in a great location... shopping nearby and great restaurants within walkiing distance to the hotel! Definately a great place for a little getaway and the best hotel I've ever stayed in!!!", "title": "Great Hotel", "helpfulness": 1, "user": "sissy52", "date": "January 4, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6551688, "likes": {"liked": "— Great Staff, Great Location, Great Service!", "disliked": "— none"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2006, traveled on business", "text": "I've stayed here a few times for work and found it so pleasant that I returned when visiting San Francisco for pleasure.", "title": "Great Hotel!!", "helpfulness": 2, "user": "snuppy1", "date": "January 3, 2007", "detail_rating": {"front_desk": 3.0, "business": 5.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 6549445, "likes": {"liked": "— The beds are very comfy, I'm looking into buying one for myself.", "disliked": "— color scheme, I like lighter colors which are in the other tower"}}, {"rating": 2.0, "stay_parameters": "Stayed February 2006, traveled on business", "text": "They do have two different towers that you can choose from depending on what you need. The \"new\" tower has upgraded rooms with physical computers you can use if you need to work when you get back from a full day of meetings. Very useful during my business trips! The \"main\" tower has the basic rooms but they have just renovated with new furniture and it looks very nice.", "title": "could go either way", "user": "gretska", "date": "December 18, 2006", "detail_rating": {"front_desk": 1.0, "business": 3.0, "service": 2.0, "cleanliness": 3.0, "value": 2.0, "location": 1.0, "rooms": 2.0}, "id": 6457130}, {"rating": 3.0, "stay_parameters": "Stayed October 2006", "text": "The hotel works well for me because their internet is free. And printing my boarding pass for free in the business center makes is so easy. I hate going to hotels where I have to pay for one page to print!!", "title": "Staff poor at resolving problems; beware of events; nice bedding", "helpfulness": 1, "user": "zippy47", "date": "November 29, 2006", "detail_rating": {"front_desk": 1.0, "business": 5.0, "service": 2.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 6305731, "likes": {"liked": "— The bedding", "disliked": "— The front desk staff"}}, {"rating": 1.0, "title": "Why do you think they give you ear plugs?", "text": "Their Japanese restaurant has great prices for dinner and the name still makes me giggle. I'm not a sports fan but when my boyfriend travels with me he practically lives in the sports bar. They have over 20 big screens...crazy. It is a very busy bar on the weekends that I have not tried, I think they play top 40, not sure. I'm too tired to check that out when I'm in the area for work.", "helpfulness": 3, "user": "dreamonixx", "date": "October 1, 2006", "id": 5897832}], "location": {"country": "United States", "city": "Foster City"}, "stars": 3.5, "variance": {"poor": 18, "average": 50, "very good": 71, "terrible": 16, "excellent": 57}, "aka": "Crowne Plaza Foster City - San Mateo Hotel Foster City", "slim_ranking": 0.5, "description": "Our beautiful Crowne Plaza Hotel in Foster City is centrally located on the San Francisco Peninsula between Downtown San Francisco, San Jose, and the East Bay. Our property is just 7 miles from San Francisco International Airport and 22 miles from downtown San Francisco. Our unique building design has a beautiful atrium lobby filled with koi ponds, waterfalls, and palm trees that will provide a relaxing setting on your next visit. Some of our features include:* Complimentary Internet access in all guest rooms, lobby, all restaurants, and pool area* Three different varieties of restaurants, room service, and a sports bar* Complimentary SFO airport shuttle* Complimentary parking* Complimentary shuttle leaving 3 times daily to The Hillsdale Shopping Mall* Conveniently located next to The BridgePointe Shopping center* 24 hour business center with complimentary use of three computers and a printer* Relax in our indoor heated pool jacuzzi* Use of Fitness center* Executive Club Level rooms include Dell XP desktop computers with DVD drive, flat screen monitors and Continental Breakfast, Monday-Friday.* 16,000 square feet of flexible meeting space"}