{"user_rating": 4.0, "review_count": 875, "name": "Crowne Plaza Niagara Falls - Fallsview", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "Hotel was built in 1929 so do not expect large rooms. The rooms were nice enough. The resort fee does come with extras like daily bottle water and bus passes ($14). There is a really good bus system which travels around Niagara. Brings you to all of the attractions and they are frequent - every 20-30 minutes. The location is great. You are a short walk to the falls. Take the bus if you prefer. Around the corner is Niagara's version of Disneyland - plenty of amusements for the kids and plenty of places to eat such as the Hard Rock, Planet, Outback, etc. Suggest eating dinner at the Rainbow Club on the top floor. Great Fall views and hotel guests normally get a $40 discount. Things are pricey due to where you are. Take the Maid of the Mist ride. The Canadian side is the better side although the better walk down to the bottom of the falls is best on the American side (walking distance from hotel). The best places to exchange money are the casino cages. One casino did a dollar for dollar exchange with no fees. The one connected to the hotel gave $99 Cn for $100 US with no fees. Took the Purple Bus to the Bus Station - 15 minutes - and picked up Megabus to Toronto. Worked out really easy and very cheap. The room had nice bed and linens, etc. It was a nice place with a great location. Be careful how you tip. Bills come with a 13% HST tax - pays for schools and healthcare. You may find yourself tipping the tax. Places up the bill 5% if you pay in American Dollars. Some credit cards charge a Foreign Transaction Fee. Some waive the fee if you upgrade. Need to check.", "title": "Great Location", "user": "gonefishing85", "date": "August 1, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 170333961}, {"rating": 2.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "Purchased 2 night stay on Groupon for $189 per night. Canadian taxes, undisclosed \"resort fee\" and parking added about $135.00 to our 2 night stay. This is NOT a resort. Small, outdated rooms and bathroom had hair stuck to the walls. We were on the 9th floor and had a decent view. Unique lobby. Creepy swimming pool. Matress needed replacing. Overall, there are definitely better choices in Niagara Falls.", "title": "Over priced, small rooms.", "user": "Mommyc3", "date": "July 30, 2013", "detail_rating": {"service": 2.0, "cleanliness": 1.0, "value": 1.0, "sleep": 2.0, "rooms": 1.0, "location": 3.0}, "id": 170038944}, {"rating": 3.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "Just repeating what others have already said...book a room in Niagara falls through Hotwire and mind you a three and a half star one...you get the smallest possible room in the Crowne Plaza imaginable. The time spent in the room was occupied by trying to navigate around each other. To be fair to Hotwire we had a wonderful one bedroom condo in Williamsburg Va last month that we paid way less for.", "title": "Teeny tiny room booked through Hotwire.", "user": "Ladiedy", "date": "July 30, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 4.0}, "id": 170021199}, {"rating": 1.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "The room came with a double bed that gave me about a foot of space with the husband sleeping there too. It's hard when you are used to a king bed but hey a queen would not have even fit in the space. The bathroom was very small...also could not have been smaller. The room was clean and pretty with an updated TV. We had a nice view of the parking garage and giant fan (sarcasm).", "title": "Booked fallview room but was in a corner blocked by building", "user": "mitchieyy", "date": "July 30, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 1.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 169990483}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled on business", "text": "The hotel itself is beautiful and the pool and hot tub were nice. You have to take two elevators...one to the rooms and the other to a parking garage.", "title": "Great location", "user": "loveholidaysKelowna", "date": "July 30, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 169979725}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "Went away for a couple nights with the wife - great escape at a great hotel. Service at the Crowne was exceptional from the guy who checked us in, to the bellman, to the restaurant staff, everyone we came across was very friendly and accommodating. Our room was great, quite spacious, and the king bed was super comfortable, Jacuzzi in the room and a view of Niagara Falls. Location put us in the middle of everything so we could walk to the Casino, Clifton Hill, Maid of the Mist and just stroll along Niagara Falls. We enjoyed dinner in Massimo Capras Rainbow Room one night with a coupon from the hotel. Food was great and another great view at night with the lights on the falls. Will definitely come again.", "title": "Great night away", "user": "Larry M", "date": "August 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 171252447}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "Location: Across the river from the American Falls. We had a falls-view room and were face-on to the American falls (9th floor) and looking down the way you could make out the horseshoe falls. I would say the location was great for accessing the street, viewing falls, etc. No complaints at all.", "title": "Great location. Nice view. Old, small rooms.", "user": "Suydam", "date": "August 6, 2013", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "location": 5.0, "service": 5.0}, "id": 171009653}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "Price: Expensive. But then again it was summer in Niagara Falls and we were looking across the river with a nice view. Expensive was to be expected.", "title": "Weekend Getaway", "user": "TravelinBev", "date": "August 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 170998156}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "Rooms: This is a really old hotel. It has history. It has character. It has really old rooms (as you might expect). Old hotels have small rooms. As long as you know that going in, you'll be fine. We were fine with it and thought some of it added character (the bathroom has some seemingly-original fixtures... very interesting to look at, clean, functioned flawlessly). The carpet in our room was buckled up in one spot but it was fine. There was no musty smell or anything else you might get from a really old hotel.", "title": "Absolutely Charming", "user": "Adelaide_Hills", "date": "August 5, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 170958180}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "Food: Breakfast buffet was too expensive. Should have just ordered from the menu. Nothing spectacular to eat, but the view from the restaurant was incredible.", "title": "Beautiful view", "user": "KarenB1219", "date": "August 4, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 170682288}, {"rating": 2.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "A very old hotel - our room was small, the bathroom was tiny - the bath was useless and it took a while to get the hot water through for a shower. The main room smelt musty. We were told we had a \"special room\" - so disappointing when we saw it. Two lifts to get to the 12th floor - the second lift must have come from the 1950's. The air conditioner did not work properly. Walls are paper thin, carpets are old, wallpaper is lifting.", "title": "\"Never Again\"", "helpfulness": 2, "user": "Geoff B", "date": "June 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 1.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 164103714}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "This hotel does not appear to have had any upgrades for many years. I would never stay there again.", "title": "Our Hotel stay", "user": "Jane C", "date": "June 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 163633763}, {"rating": 2.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "On the positive - the staff were very helpful and we had a good breakfast in the dining room.", "title": "Old Hotel in a Good Location", "helpfulness": 2, "user": "Cherrie C", "date": "June 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 1.0, "value": 3.0, "sleep": 2.0, "rooms": 2.0, "location": 4.0}, "id": 163625182}, {"rating": 1.0, "stay_parameters": "Stayed June 2013, traveled with friends", "text": "My first negative review of any hotel - I paid $760.00 for two nights - a disappointing result.", "title": "Terrible experience", "helpfulness": 2, "user": "Melissa H", "date": "June 10, 2013", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 1.0, "sleep": 3.0, "rooms": 1.0, "location": 3.0}, "id": 163552061}, {"rating": 2.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "In May my husband and I took a couple of days away at the Crowne Plaza in Niagara. The mini vacation was called the Ultimate Couples package and was booked directly with the hotel. We arrived earlier than check-in but were met with very friendly staff who were more than willing to check us in. I happened to mention to the clerk that my husband and I had stayed at the hotel on our wedding night 39 years ago and were pleased to be back. She welcomed our return and immediately upgraded our package for which we are truly grateful.", "title": "Needs Renovation.", "user": "HarisonR", "date": "June 10, 2013", "detail_rating": {"service": 3.0, "cleanliness": 1.0, "value": 1.0, "sleep": 2.0, "rooms": 1.0, "location": 4.0}, "id": 163537252}, {"rating": 1.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "We traveled with a group and they used this hotel. Without exception none of the large group were happy with their rooms here. The foyer and staff are nice but the rooms are not great. Our room was so noisy, all night a vent or some other racket was outside and it was like trying to sleep in a factory. Cups etc dusty in room. Glad we only spend one night here.", "title": "Room 930 so noisy", "helpfulness": 2, "user": "HMoo", "date": "June 23, 2013", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 3.0, "sleep": 1.0, "rooms": 1.0, "location": 4.0}, "id": 164907236}, {"rating": 4.0, "title": "Beautiful Views", "text": "Excellent food in the restaurant with amazing views of the falls. The balconies on the 11th floor provide a place to relax and watch the falls. Lots of children on adjoining streets, family oriented. Staff all very friendly and helpful.", "user": "Calvin B", "date": "June 22, 2013", "id": 164804204}, {"rating": 3.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "I stayed in this hotel for one night for my birthday. I booked a 2 room suite about a month before my arrival date. I was sent a confirmation number with the right room and then the day before check in I was sent another confirmation with the same confirmation number with a different room. I had to call the hotel to confirm what room they had me in. The room they had me in was the correct room, so I didnt worry about the second room.", "title": "Not as nice as expected", "helpfulness": 1, "user": "Sunshintuna", "date": "June 21, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 164707352}, {"rating": 3.0, "stay_parameters": "Stayed June 2013, traveled on business", "text": "I checked in around 6:00pm and it was quick. I had no trouble with that.", "title": "old world charm in need of updating", "user": "Bez009", "date": "June 20, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 5.0}, "id": 164618248}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "I was given the room key and told where to go. Well in this building the 12th floor is only accessible from certain elevators. I had to take the roomier main elevator to the 9th floor and then wait and wait for the less roomy and far older elevator that goes to the 12th floor. This elevator to me had a very horror movie vibe.", "title": "Highly Recommended!", "user": "FunInTheSun761", "date": "June 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 164309866}, {"rating": 3.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "My husband, brother and I stayed at the Crown Plaza memorial day weekend of 2013 and it was honestly a bit disappointing. The hotel has quite a bit of history and is one of the first hotels in the area, even Marilyn Monroe stayed in room 810! Its location cant be beat. When I reserved the room, they asked for my credit card to hold the room, I mentioned to them several times not to charge my credit card and that it was only to hold the room we would be paying with a different card. Come to find out upon check in without telling me they charged my card for the total time we were there, plus the daily parking rate of $20 and $75 per night liability. I was at a restaurant and was informed my card was declined, called my bank to find out the hotel had charged me without informing me. I spoke to the front desk and they said that was standard procedure and that when we check out they will release the hold and I can put it on another card as I wish. Well, when it was time to check it out, they did charge another card but then tell us the release of funds will take 8 - 10 days! Another disappointment is the fact they charge for wireless internet it doesn't come included, in this day and age what hotel does that?? Finally, the rooms are extremely in need of renovation, the bathrooms are old and doesn't give it a feel that it is worth what you pay. The only upside is the location and views.", "title": "A bit dissapointing", "helpfulness": 2, "user": "Hodei S", "date": "May 27, 2013", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 2.0, "sleep": 4.0, "rooms": 2.0, "location": 4.0}, "id": 162046189}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "This hotel has been there since Pluto was a pup, but it is still 1st rate. Changing elevators to get to the upper rooms was interesting. The staff was very friendly and courteous. The little window that you could open let in the sound of the falls.", "title": "Old style but comfortable", "helpfulness": 1, "user": "Dan M", "date": "May 22, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 161538244}, {"rating": 2.0, "title": "Disappointing", "text": "I stayed at the Crowne Plaza from Thursday April 4th to Sunday April 7th for a weekend trip with my husband. It was a beautiful hotel, excellent location and for the most part a nice place to stay. I have stayed here before and have recommended it numerous times to friends, family and colleagues - especially those with kids as the waterpark is excellent.", "helpfulness": 5, "user": "Chantal S", "date": "May 21, 2013", "id": 161451920}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "But this visit had some disappointment attached to it.", "title": "Excellent Hotel, Great vacation!!!", "helpfulness": 1, "user": "tony q", "date": "May 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 161308060}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "The hotel room was incredibly hot. I got up numerous times on Thursday to try and bring the temp down and nothing worked. On Friday I called down and was told someone would be right up. After waiting over 40 minutes, we went out but let the front desk know we still wanted it looked at. When we came back, nothing had changed. I called again and was told that they had been, but someone would be back up. This time a man came with a fan and said there was nothing to be done. That the air was not on, to the temperature control (which I had set to 60) would not work. He suggested keeping the balcony door open, which is something we did at times - but the balconies are all connected and not a solid fence - meaning someone could go between balconies. While unlikely, not a way I waned to sleep. So we tried the fan, which didn't help.", "title": "Old Renovated Hotel Charm for Economic Traveller", "user": "Phillip N", "date": "May 14, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 160698531}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "Got this on a groupon. Good view of the American falls. Unless you are on the 11th floor (you get the balcony), you'll have to work a little harder to view the horseshoe falls. Windows in regular rooms are somewhat smaller, so it's not like the Sheraton where you get ceiling to floor windows. The rooms are small (I believe the hotel is quite old). Beds are small. Matress wasn't the best I've ever had. But you can see everything fine from your room. It's right across from the Rainbow bridge which is good if you plan to walk across to the US side. It's a pretty long walk down to horseshoe falls.", "title": "Old, small, but good", "user": "pnwtoc", "date": "July 30, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 169968674}, {"rating": 2.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "One thing I can say is that the staff couldn't be better. They are truly phenomenal. I went back to my room to get something when the cleaning staff were all out working in the hall and they all went out of their way to greet me and were ultra polite.", "title": "Charming rooms and views with hidden fees", "user": "Michelle E", "date": "July 30, 2013", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 2.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 169901504}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "We stayed here with a Groupon deal on July 25, 2013 in an Upper Fallsview room. The room was nice: small, like others have noted, but it was quite charming with pretty tiles in the bathroom, old photos of the falls on the walls, and a nice view of the American falls through a small window (you could also see the Canadian falls if you looked at the window at an angle). We were right by the elevator and seemed to be sharing the floor with a lot of children but didn't notice a lot of noise from inside of our room. The window opened, which was great, as you could hear the noise of the falls at night.", "title": "Great Hotel and Excellent staff", "helpfulness": 1, "user": "Lorraine P", "date": "July 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 169805735}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "The location was also good - it's in close proximity to the entertainment, restaurants, and you can get to the casino from inside the hotel. It's just a short walk down to the viewing area and parks in front of the falls, and it's easy to get back on the freeway from here, too.", "title": "Vow Renewal - Couldn't have been any better!", "user": "kkc904", "date": "July 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 169525245}, {"rating": 3.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "Now, onto the poor aspects of the hotel: all of the fees! Now, we were aware that we'd be charged tax and parking with our Groupon. We later found out in the casino that free parking was available with your player's card, so if you are going to the casino, you probably could avoid the $20 parking fee at the hotel - that felt a little misleading, but oh well.", "title": "Great Location, Rooms Nothing Special", "user": "DCH_in_Canada", "date": "July 28, 2013", "detail_rating": {"service": 4.0, "cleanliness": 2.0, "value": 3.0, "sleep": 3.0, "rooms": 1.0, "location": 5.0}, "id": 169380182}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "First off I want to say we had an amazing three days!!! I used a voucher from dealfind I bought.", "title": "Gorgeouss Gem!!", "user": "Jessica S", "date": "June 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 163457751}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "The hotel was verrrry pretty. Location is perfect!!", "title": "One night stay at a gem", "user": "naomilc", "date": "June 8, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 163369309}, {"rating": 4.0, "stay_parameters": "Stayed May 2013", "text": "Coming from about 3 hrs away, we arrived a bit early, around 2:15, (check in is at 3) No problem checking in early at all, laddies at front desk were very nice, and helpful. Check in went smoothly. Also asked for a late check out right away, witch we got pushed from 11 to 2pm, perfect!! We were in room 1215 :) we had to take the elevator to the 9th floor, then get on the old elevator and up to the 12th floor, at first I was kinda sketched out from the old elevator, as it makes lots of noise, but got used to it after a few times.Our room was small, but very cozy with a king bed. Was clean, there was nothing wrong with it at all, smelled good, was tidy. We had a full washroom but the tub would be kinda hard to take a bath in. After we unpacked we probably called the front desk about 10 times lol just asking questions about attractions and about water park, the lady was very helpful and always told us what we were looking for.", "title": "Absolutely gorgeous", "user": "JDuke T", "date": "June 1, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 162649880}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "Our first day we realised the water park was going to be closed the next two days we were there, so we changed our plans up a bit and headded straight to the water park, it was pricey for a few hrs, but worth it! The last hour it was empty so my boyfriend and I had the entire park to out selves.BONUS!", "title": "Our room was small but cozy", "helpfulness": 1, "user": "Gladys13", "date": "May 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 162228567}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "That night we went to the Rainbow room!! First of all it was an amazingg view!!!!Our waiter was very nice. The food was amazing! Honestly the best food I ever had, so much flavor & the presentation was gorgeous! We did not have time to use the spa or the pool. We had so much to do!! But deff will next time!", "title": "Niagara Falls", "helpfulness": 1, "user": "Abouturn", "date": "May 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 162213680}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled with friends", "text": "We stayed her for one night in a 2 bedroom suite. The bedrooms were large, comfortable and each bedroom had its own bathroom. The sitting room was very spacious. We had 2 glasses in the room but 4 people. When I called they had 2 more glasses delivered within 5 minutes.", "title": "Great location-Good customer service", "user": "jamaicaluver", "date": "August 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 172378088}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "We were comfortable and had a great view of the American falls. Beds were comfortable and we got a great nights sleep. The oom and bathrooms were very clean.", "title": "Loved it!", "helpfulness": 1, "user": "Joe B", "date": "August 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 172089519}, {"rating": 1.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "We had dinner and breakfast in the restaurant on the 10th floor. Food was delicious and the view was amazing!", "title": "Buyer Beware", "helpfulness": 1, "user": "CMKSmith", "date": "August 12, 2013", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 1.0, "sleep": 3.0, "rooms": 1.0, "location": 4.0}, "id": 171985874}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with friends", "text": "I also dislike hotels that add resort fees but we did use the internet so I didn't complain. Most hotels now provide free wi-fi but it is what it is.", "title": "A nice hotel to stay at Niagara Falls", "helpfulness": 1, "user": "WandererBo", "date": "August 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 171980049}, {"rating": 3.0, "stay_parameters": "Stayed August 2013, traveled on business", "text": "We unfortunately had neighbors who came back to the room fighting with each other then proceeded to take the fight into the hall. When I called security they quickly had someone up to the room to talk to them. Once security left, they quieted down for a bit but started slamming in and out of the room. We called again but were exhausted and went to bed. The second time was the charm because we heard nothing after that.", "title": "Very accommodating staff", "user": "Mellayella", "date": "August 11, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 171720280}], "location": {"country": "Canada", "city": "Niagara Falls"}, "stars": 3.5, "variance": {"poor": 78, "average": 138, "very good": 232, "terrible": 69, "excellent": 358}, "aka": "Crowne Plaza Niagara Falls - Fallsview Hotel", "slim_ranking": 0.217391304348, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.5, "location": 4.5}, "description": "Classic elegance at the Falls. The AAA/CAA rated 3-Diamond/4 Star fallsview hotel is located directly across from Niagara Falls, in the heart of the tourist district. The Crowne features indoor connections to Casino Niagara, Fallsview Indoor Waterpark, and the attractions, entertainment and dining options located on the 20 acre Falls Avenue Resort. A getaway at the Crowne is a rewarding experience in part a result of first class amenities, spectacular fallsview guestrooms & suites, and exquisite fallsview fine dining at The Rainbow Room by Massimo Capra."}