{"user_rating": 4.0, "review_count": 934, "name": "Crystal Cove", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "We really loved this hotel. When we arrived we were greeted with a rum cocktail which was delicious. We were then shown to our room. The staff went to so much effort. Our towels were laid in the shape of a swan and they had scattered rose petals on our bed. The food was of excellent quality. You can only get wine by the glass for dinner and if you want a bottle of wine you have to pay for it. The waitress service is fast when it comes to serving food however when it comes to topping up your glass with wine they are a little slow. They dont want you to get drunk he he he. But we found a way, we slipped into the cave bar just outside the restaurant and refilled our glasses there!", "title": "Amazing . . . loved it!", "helpfulness": 6, "user": "funsunseekerkent", "date": "March 27, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 26937740}, {"rating": 4.0, "stay_parameters": "Stayed February 2009, traveled solo", "text": "I would say the average age range of residents staying at the hotel was about 50 ish although there were some young couples.", "title": "Nice Hotel and Nice People", "helpfulness": 1, "user": "Darrentones", "date": "March 22, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 26597322}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled with family", "text": "We decided to have one evening meal at Sandy Lane Hotel. Crystal Cove were great they arranged our taxi. We had a lovely meal there. Sandy Lane of course is very elegant and sophisticated and a litle too formal for us. But it was an experience we would recommend it you are curious about how the other half live! No celebrities that night but we found some famous cricketers staying at Crystal Cove! Apparently the restaurant 'The Cliff' is about a 5 minute walk from the hotel which has an excellent reputation.", "title": "Fantastic, relaxed hotel on an amazing island.", "helpfulness": 9, "user": "Danniiram", "date": "March 17, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 26356636}, {"rating": 5.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "We really like the atmosphere of Crystal Cove. It is so relaxed and friendly. You can be approached by Bajan's selling there wares on the beach. They are okay you just need to be firm that you don't want to buy what they have to sell.", "title": "Super", "helpfulness": 3, "user": "JudgeNutmeg", "date": "March 17, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 26316864}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "We decided to go into bridgetown. Take plenty of money!! They have some excellent jewellery stores. Also a very good department store Cave Shepherd on Broad Street. The hotel organises a mini bus. They cram the maximum people in this vehicle and it is so uncomfortable we decided to get a taxi. It is about 15 mins drive.", "title": "Absolutely Fantastic!", "helpfulness": 4, "user": "MandJLondon", "date": "March 16, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 26286238}, {"rating": 1.0, "stay_parameters": "Stayed December 2005", "text": "Why has no other reviewer mentioned the noise at Crystal Cove? We stayed there last week and every night they had a band play very loudly until 11pm at night. I accept that we were unlucky to have a room so affected by the noise that we couldn't even watch TV while it was going on but we were not alone. There were quieter rooms but as you cannot prebook which room you have,it is a complete lottery as to where you end up - you have been warned! Also I accept that 11pm is not too late but if you are coming from the UK this is actually 3am by your body clock for at least the first couple of nights. And if you have young children with you it is a complete nightmare. We begged with management to help us by moving us or turning the noise down a little but they were spectacularly unhelpful!! It was such a shame that an otherwise okay hotel (but definitely 3* not 4*) was spoilt by this situation, which apparently goes on every night all year long.", "title": "Noisiest Hotel in the World", "helpfulness": 10, "user": "sjwoolnough", "date": "January 2, 2006", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "rooms": 3.0, "service": 2.0}, "id": 4316623}, {"rating": 3.0, "title": "They try really hard but can't overcome the lack of a decent beach", "text": "As for other points by reviewers - they are true, the place is a little shabby, the food can be quite limited in choice and poor quality. The sea is rough and that and the coral made swimming very difficult.", "helpfulness": 7, "user": "Susan5", "date": "December 30, 2005", "id": 4311457}, {"rating": 5.0, "title": "Brilliant holiday at Crystal Cove - including great service!", "text": "Overall, ignoring the insanity of noise, a mediocre place which is quite overpriced. Do not stay here if you are coming from Europe with young children!!", "helpfulness": 24, "user": "A TripAdvisor user", "date": "December 21, 2005", "id": 4255040}, {"rating": 1.0, "title": "Worst service of any Hotel I have stayed in", "text": "Our daughter, aged 7, loved the Childrens Club here and gave it top marks.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "December 20, 2005", "id": 4253115}, {"rating": 5.0, "stay_parameters": "Stayed December 2005", "text": "The food is very good for everyone. Lots of choice and variety. Good quality all the time.", "title": "Fantastic return visit", "helpfulness": 5, "user": "colleys", "date": "December 19, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 4250692}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "My husband and I stayed here for 9 night this March. The hotel is lovely. We really like the fact it's small (only 88 rooms) and the gardens were lush and the pools inviting. We arrived at midday, 3 hours before checkin, and were greeted with a smile and a cocktail. Our room wasn't ready so we had lunch in reflections and relaxed. We had booked a garden view jr suite but when they took us to our room it was actually a one bed suite with two bathrooms and two balconies. We could also see the sea. The room was clean, airy, good ac, nice view, comfortable double bed and cable tv. The only negative was the bathrooms which are in need of a refurbish. They were clean and the sinks and toilet appear new but the bath and shower were old.", "title": "lovely", "helpfulness": 2, "user": "KDEngland", "date": "March 16, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 26262225}, {"rating": 5.0, "stay_parameters": "Stayed February 2009, traveled with friends", "text": "We ate in both restaurants. The food was good. Really enjoyed the BBQ buffet on the first night. Breakfast was good with lots of choice. Also had out breakfast delivered to our room one morning and ate on the balcony. Lunch was buffet in Drifters or set menu/ buffet in Reflections. You can also order room service up untill 9 pm all included. All drinks included and tried loads of cocktails. Alcohol was premium brands and service was good and friendly. One night i was eating my bread roll and I found a piece of broken plate in side. The bread rolls were not made at the hotel but they were very concerned it had happened and the management sent a bottle of champagne to our table.", "title": "Could not have been better", "helpfulness": 2, "user": "mariners07", "date": "March 5, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 25624020}, {"rating": 5.0, "stay_parameters": "Stayed February 2009, traveled with family", "text": "The beach is beautiful. Water warm and clear. Lots of loungers on the beach but not so many round the pool. We used the free watersports loads. Did sailing, kyaking, doughnuts, buggyboards, water sking and wake boarding.", "title": "Exceeded our expectations", "helpfulness": 3, "user": "Barbarella", "date": "March 1, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 25388204}, {"rating": 5.0, "stay_parameters": "Stayed January 2009, traveled as a couple", "text": "The evening entertainment was a little boring as it was always music. We would have liked to see a few shows, perhaps dancing or fire eating, something like that.", "title": "We loved it - just the tonic - and we missed the snow!", "user": "Skippy49", "date": "February 24, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 25093064}, {"rating": 2.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "We had good weather and a great time. Hired a car for the day and the hotel will organise a packed lunch and drinks for the day.", "title": "This was not what we were expecting!", "helpfulness": 1, "user": "SkiingAquaMan", "date": "February 22, 2009", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "location": 5.0, "service": 1.0, "rooms": 1.0}, "id": 24972685}, {"rating": 1.0, "title": "where not to go", "text": "We just returned from 9 days at the Crystal Cove resort (all inclusive) in Barbados. What a rip off!", "helpfulness": 9, "user": "A TripAdvisor user", "date": "December 5, 2005", "id": 4163687}, {"rating": 5.0, "title": "Crystal Cove a lovely hotel", "text": "The all inclusive is absolutly TERRIBLE.In 9 days we never saw any beef, shell fish or for that matter anything above one star quality food. If there's a way to do it on the cheap they've found it. Half the time the alla carte retaurant became buffet with little or no choices.Example your choice of salad dressing for tonight is french or french.I even saw something I've never seen before and that was refilling the liquor bottles with bulk alcohol.As a result we decided to go out for dinner (remember this was all inclusive)WOW what a shock; dinner for two with a bottle of wine $250.00 US.As a result of our experiences we definitely will never return to Barbados as every other Caribean island we've ever visited has far better quality and is much less expensive.", "helpfulness": 12, "user": "A TripAdvisor user", "date": "November 23, 2005", "id": 4139238}, {"rating": 5.0, "title": "Excellant - Just as we rememberd!", "text": "Having read some of the negative reviews, I wonder if those people stayed at the same hotel as my wife and I.", "helpfulness": 14, "user": "A TripAdvisor user", "date": "November 17, 2005", "id": 4124260}, {"rating": 1.0, "stay_parameters": "Stayed August 2005", "text": "As an Airline Manager I get to stay in many hotels and therefore when it comes to my own leisure ( and my own money!) I expect the best. I certainly was not disappointed.", "title": "Dire place", "helpfulness": 6, "user": "lawrenceb", "date": "November 14, 2005", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "rooms": 2.0, "service": 1.0}, "id": 4110587}, {"rating": 4.0, "stay_parameters": "Stayed August 2005", "text": "From the moment of arrival to the moment of departure, the Crystal Cove did everything to make our stay enjoyable.", "title": "\"Great time\"", "helpfulness": 14, "user": "lawrenceb", "date": "November 14, 2005", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "rooms": 2.0, "service": 1.0}, "id": 4110307}, {"rating": 4.0, "title": "Great Holiday!", "text": "My husband and i have recently returned from 2 weeks in Crystal Cove and had a really great time.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "September 24, 2005", "id": 3935463}, {"rating": 2.0, "title": "No Way 4*!!! very disappointed!", "text": "There are (as with most holidays) aspects of the hotel that could be improved but overall the holiday was fabulous, albeit I would not rate the hotel as a 4*+ more a 3*+.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "September 22, 2005", "id": 3931534}, {"rating": 4.0, "stay_parameters": "Stayed September 2005", "text": "The welcome you get on arrival is really good. You're greeted with a fruit or rum punch before being shown to your room. Our room (Ocean View) was clean, freshly decorated, reasonably spacious and had nice views of the sea. Although the decorating did look as though it had been finished in a rush as we had to wipe dust of the shelves in the wardrobe, remove poly filler from the plug holes and peel off some forgotten masking tape.", "title": "Excellent time", "helpfulness": 9, "user": "Bananatyke", "date": "September 17, 2005", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 4.0, "service": 4.0}, "id": 3911215}, {"rating": 5.0, "title": "Lovely hotel, would definitely go back.", "text": "The food was slightly disappointing. They tried to hard to be fancy and it didn't work. The best meals we had were either the buffets or the themed nights at Drifters beach bar. The Table D'Hote meals should really be abandoned and replaced with better quality simple meals. We have previously stayed at a lower rated hotels in Barbados where the food was considerably better mainly cause they kept it simple and fresh. Providing a carvery option almost every night. Despite what the last reviewer said, food was available from breakfast through to 9.30pm, either in one of the two restaurants during set meal times or via room service at all other times. We had some really lovely room service meals when we returned to our room in the afternoon. The food was delivered quickly, hot and was very tasty.", "helpfulness": 11, "user": "A TripAdvisor user", "date": "September 16, 2005", "id": 3909116}, {"rating": 5.0, "stay_parameters": "Stayed August 2005", "text": "If you do get bored of the food and fancy a change, I would HIGHLY recommend The Cliff restaurant and Tides. Both are absolutely fantastic, beautiful settings, first class service and remarkable food. Although a bit pricey, well worth it in my opinion.", "title": "Wedded and Chilled", "helpfulness": 11, "user": "woodc", "date": "September 15, 2005", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 3907132}, {"rating": 4.0, "title": "Very good value for money", "text": "This was our first all-inclusive for many years, and it represented very good value. The hotel itself delivers in all respects and is generally well maintained - pretty gardens, pools cleaned every morning, patios hosed off. Food was excellent on table d`hote nights - acceptable on buffet nights. Room service was available and within the all-inclusive package.", "helpfulness": 2, "user": "sumal", "date": "February 12, 2009", "id": 24506179}, {"rating": 5.0, "stay_parameters": "Stayed January 2009, traveled as a couple", "text": "The entertainment was average to good, with dancing, when it didn`t rain - but the weather is not the fault of the hotel. But more seating for wet weather in order to enjoy the entertainment would be a good idea.", "title": "Chilling in Barbados", "helpfulness": 4, "user": "Duck4360", "date": "February 10, 2009", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "rooms": 3.0, "location": 4.0}, "id": 24436632, "likes": {"liked": "— All inclusive food and drink and nice, friendly service"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2009, traveled as a couple", "text": "Our room was spotless, well maintained, and very comfortable.", "title": "Very Friendly Staff", "helpfulness": 4, "user": "JackieBLondon", "date": "January 15, 2009", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 3.0, "value": 4.0, "location": 4.0, "rooms": 3.0}, "id": 23576267, "likes": {"liked": "— The air conditioning and large bed", "disliked": "— Tired-looking bathroom"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2008, traveled with family", "text": "There`s a very good gym, and a business centre with free interet access which we really appreciated.", "title": "Needs some TLC", "helpfulness": 5, "user": "littlenicci", "date": "January 12, 2009", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 23487840, "likes": {"liked": "— Location right on the beach", "disliked": "— Needs refurbishing asap"}}, {"rating": 2.0, "stay_parameters": "Stayed January 2009, traveled as a couple", "text": "The watersports were great.", "title": "Not 4 Star", "helpfulness": 1, "user": "ROSE4460", "date": "January 12, 2009", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 1.0, "rooms": 2.0, "location": 2.0}, "id": 23487748, "likes": {"liked": "— Leaving it", "disliked": "— Hearing next door's TV"}}, {"rating": 3.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "Hopefully the title sums up our report!", "title": "Really lovely, but with a few problems.", "helpfulness": 2, "user": "MatthewGreen", "date": "May 15, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 2.0, "rooms": 4.0}, "id": 30047999}, {"rating": 2.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "We were wowed by the hotel on arrival with lovely reception staff and a strong rum punch. Then we were shown to a stunning room (244) which was at the back of the resort, but raised up so we had view across the gardens and out to sea. I'm certain we were upgraded as the room had a separate sitting room and bedroom, each with it's own balcony and own bathroom. We had plenty of space and sitting out on the balcony in the evening with a cocktail and a good book whilst listening to the twittering of the tree frogs was pretty close to heaven.", "title": "Lovely hotel, beautiful rooms, beware of the buffet!!!", "helpfulness": 4, "user": "Ladytravel121", "date": "May 6, 2009", "detail_rating": {"cleanliness": 2.0, "value": 3.0, "location": 3.0, "service": 3.0, "rooms": 4.0}, "id": 29488710}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled with family", "text": "The physical resort itself is superb (although we did hear that some guests had maintenance issues with their rooms). The free form pools are stunning and the gardens are lush and full of tropical blooms and wildlife (humming birds and monkeys included). The beach was clean and offered plenty of space with no other resorts on either side of the hotel.", "title": "exceeded all expectations", "helpfulness": 2, "user": "happy40Uk", "date": "May 5, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 29404378}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "For swimming in the sea there are sandy areas but be aware that there is a lot of rocky coral immediately infront of the hotel, which is great for snorkelling but not so great for general swimming. Facing the beach with the resort behind you turn to the right and walk a minute or two and you'll find the sea has a sandier bottom. The only negative is the jet skis sometimes come far too close to the shore at high speed. This happens all along the west coast unfortunately. There is a roped off swimming area but it is far too small and not in a particularly nice spot.", "title": "Spectacular Vacation", "helpfulness": 5, "user": "drichr", "date": "April 25, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 28772447}, {"rating": 4.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "We made use of the inclusive watersports which was a big bonus. Virtually everything even water-skiing is included.", "title": "Great Boutique All-Inclusive in paradise!!!", "helpfulness": 6, "user": "TropicalPrincessLea", "date": "April 2, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 3.0}, "id": 27307103}, {"rating": 2.0, "stay_parameters": "Stayed July 2005", "text": "We stayed at the Crystal Cove in July this year. Myself, husband and 2 friends. On the whole I found the standard of the Crystal Cove to be poor. The food was awful, especially the buffet lunches served in the beach bar. The staff that worked in the beach bar restaruant were incredibly rude. Out of the ten nights that we stayed there we only ate in the restaruant twice because it was so bad!", "title": "Very Dissapointing", "helpfulness": 3, "user": "clare56568", "date": "November 9, 2005", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "rooms": 3.0, "service": 2.0}, "id": 4101135}, {"rating": 1.0, "title": "Dont go to this hotel its a rip off", "text": "The pool was nice and clean and it was great having a bar that you could swim up to, however the quality and choice of the cocktails was poor. There was no cocktails list (we were told that they were working on it. I think this is the standard answer) and all the drinks were always served plastic glasses. It was also very difficult to get served in the evening as there was usually only one staff member serving.", "helpfulness": 20, "user": "daddiesboy", "date": "October 20, 2005", "id": 4038393}, {"rating": 1.0, "title": "Ignorance is Bliss at Crystal Cove", "text": "We had problems trying to organise the watersports as there always seemed to be some sort of excuse as to why we could not go out. Usually this was becuase the rescue boat was not available as it was also used as the water taxi (which was also very elusive).", "helpfulness": 16, "user": "A TripAdvisor user", "date": "October 14, 2005", "id": 4022741}, {"rating": 5.0, "title": "Fantastic, Best Holiday Ever!", "text": "The beach itself was ok. The swimming area is roped off and was fairly small. The sun beds however were disgusting. They were very dirty and covered in bird mess. They did not get cleaned once whilst we were there.", "helpfulness": 11, "user": "A TripAdvisor user", "date": "October 4, 2005", "id": 3988042}, {"rating": 2.0, "title": "Disappointing", "text": "On the positive side the staff on reception were very helpful and the rooms basic but clean.", "helpfulness": 6, "user": "Joanrich", "date": "September 26, 2005", "id": 3939054}], "location": {"country": "Caribbean"}, "stars": 4, "variance": {"poor": 49, "average": 68, "very good": 275, "terrible": 36, "excellent": 506}, "aka": "Crystal Cove Saint James", "slim_ranking": 0.333333333333, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.0, "location": 4.5}, "description": "\"An enchanting blend of vitality and Caribbean charm.\"A colorful and vibrant beachfront all-inclusive property with 88 rooms offering a seductive Caribbean charm that will make you feel at home from the moment you arrive. Crystal Cove's warm, relaxed ambience and friendly service which includes all-inclusive accommodation as well as a Supervised Kids Club (for children aged 3-11) appeals to families and couples of all ages, many of whom return there year after year."}