{"user_rating": 4.0, "review_count": 494, "name": "Crystal Plaza Hotel", "reviews": [{"rating": 3.0, "title": "Every Room Has A Chandelier!", "text": "This was a very nice hotel, by European standards. Good sized if sparsely furnished room, sizeable bathroom, tv with movies. And yes, every room has a crystal chandelier! Location great, everything walkable. Staff very helpful. Complementary breakfast has many items (try the waffles!). Would stay again without hestitating.", "helpfulness": 2, "user": "PaulaRuth", "date": "June 5, 2004", "id": 2155103}, {"rating": 4.0, "title": "Lovely hotel", "text": "Stayed at the Crystal Plaza for 2 nights during April. Kept an open mind about the hotel prior to arrival due to the small amount we were paying for our stay. What a pleasant surprise we had. Excellent location, rooms a very good size which isn't always the case in a City.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "April 15, 2004", "id": 1786368}, {"rating": 5.0, "title": "Great place", "text": "The staff were so pleasant and helpful and we had everything we could have wished for. The breakfast was lovely and you didn't have to wait for a table. Our room was cleaned and beds made up and we were only out of the room for about 15 minutes!", "helpfulness": 5, "user": "A TripAdvisor user", "date": "January 17, 2004", "id": 1555039}, {"rating": 5.0, "title": "A real jewel", "text": "Would definately recommend this hotel and if we were to return to Stockholm, this would be our choice of accommodation.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "August 10, 2003", "id": 1221300}, {"rating": 4.0, "title": "Beautiful Hotel", "text": "I read on the tripadvisor that the breakfast was great in this place.", "helpfulness": 9, "user": "A TripAdvisor user", "date": "July 28, 2003", "id": 1150206}], "location": {"country": "Sweden", "continent": "Europe"}, "stars": 3, "variance": {"poor": 33, "average": 101, "very good": 233, "terrible": 4, "excellent": 123}, "aka": "Crystal Plaza Stockholm", "slim_ranking": 0.360248447205, "description": "Traditional Hotel housed in an historic, turn-of-the-century building dating from 1895."}