{"user_rating": 4.5, "review_count": 165, "name": "Crystal Paradise Resort", "reviews": [{"rating": 5.0, "title": "Fantastic Family Eco-lodge!", "text": "Lifetime memories. Awesome hosts. Idyllic setting. Spectacularly accommodating.", "user": "Tiffany C", "date": "March 7, 2008", "id": 14113173}, {"rating": 5.0, "title": "Heaven in Belize", "text": "Our holiday at Crystal Paradise gave us significantly more than we expected. This is a family owned and run hospitality center, run by one of the kindest, most nurturing and honestly caring families you will ever encounter. Our airport pick up was flawless and the journey to the resort included a lunch stop at the 'famous' roadside restaurant near the Belize zoo. Once we arrived, Jeronie helped insure our accommodations met our families needs and that our excursions were well coordinated.", "user": "Jim_the_bug_man", "date": "January 14, 2008", "id": 12606836}, {"rating": 5.0, "title": "Hospitality of the best kind", "text": "The hand-built thatch-roofed huts offer plenty of space for everyone. You are unplugged from the frenzied pace of life in the States without feeling isolated. While the offerings of excursions are varied and authentic, many guests opt to enjoy the peace and quiet of the jungle ranch with reading, siestas and nature walks. Our family was invited to explore the beautiful landscape around the ranch on horseback with youngest son Andy as guide.", "user": "4ladies55", "date": "January 14, 2008", "id": 12601025}, {"rating": 5.0, "title": "What a wondeful family!", "text": "Miss Teresa, the matriarch, expertly prepares (from scratch) all the meals. Tasteful and healthy, these authentic local dishes are served family style in an open air pavilion complete with stocked bar and refrigerated drinks. We were most impressed with the honor system used to tally drinks.", "user": "Jena P", "date": "January 2, 2008", "id": 12276987}, {"rating": 5.0, "title": "Great place!", "text": "Our family includes small children and Mr. Viktor and Miss Teresa were keenly aware of our desire to expose them to the beauty of the region, while maintaining a comfortable level of security. On our daytrip to Tikal, we were escorted to the Guatemalan border, through passport control and received by a reputable guide. At the end of the adventure, again, we were escorted through the boarder and greeted by another member of the Tut family to return to Crystal Paradise.", "user": "17fan", "date": "December 28, 2007", "id": 12023178}, {"rating": 4.0, "title": "Enjoyed Crystal Paradise", "text": "We just returned from Belize. 7 days at Blackbird Caye and then two days at the Crystal Paradise. It isn't a resort and that was exactly what we wanted. A peaceful getaway far out of town. The dining area and lounging deck just lovely and relaxing. It is aso nice because you eat family style with your fellow travelers. I thought it was a good deal since they took us all the way to and from Belize City and also included all food except lunch. Jeroni and Eric, two of the family hosts can pick out any bird from a mile away and Jeroni took us birding one morning and picked out every bird in sight. They have parrots that come to their orange trees every morning and evening. We took a tour from there to Tikal. I also thought this was a good deal because they took us all the way to the Guatemalan border, carefully handing off to the driver on the other side so we were always being watched over and felt comfortable. I don't know anywhere on earth that you could get two hours each way to somewhere, a driver and a guide, lunch and entrance to a wonder of the world for $200 ($100 pp). The only thing I wish we had done was ask specifically about the tour because the guide nearly killed us running us around. We were with four other people who joined us from another resort once we were there so we had no choice but to keep up. We would gladly have paid for our own guide so we could have set our own pace. It didn't occur to me to ask in advance so I wish the Crystal Paradise had asked us what kind of tour we wanted. The food was the best we had in our eight days in Belize. It was almost like staying with friends who personally wanted to make sure you had a good time.", "helpfulness": 5, "user": "Thorspecken", "date": "November 14, 2007", "id": 10807961}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "Having just got back from our trip to Belize, we quickly decided one of the first things to do was to go to tripadvisor.com and sing the praises of Crystal Paradise (CP) and all that they did to make our trip to the inland an unforgettable experience.", "title": "Full eco-tourist experience at great price!", "helpfulness": 1, "user": "motie-mates", "date": "September 3, 2007", "detail_rating": {"value": 5.0}, "id": 8614781}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled with family", "text": "First things first, CP is not a resort. It is not the kind of place to lounge about all day, sipping drinks with umbrellas, and basking in the sun. If that is what you are looking for, it would probably be best for you to spend your time on the coast. It is more like a jungle lodge, meant to be a comfortable place to stay, in-between your adventures in the Cayo.", "title": "A great Belize vacation at Crystal Paradise", "helpfulness": 1, "user": "nature-adventurer", "date": "July 14, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 8115883, "likes": {"liked": "— the thatched cabanas and the setting, hammocks on the porch", "disliked": "— a.c But I didn't expected it in an eco lodge"}}, {"rating": 2.0, "stay_parameters": "Stayed November 2005, traveled as a couple", "text": "We stayed in a thatched cabana, with two queen beds and a twin, which provided us an ample choice of where to sleep. We did have a slight bug problem on our last couple of days, but that was due to our neglect at keeping the front door shut (We live in the Pacific Northwest, where bugs aren’t much of an issue. In Central America, they are everywhere-- something you have to get used to). The food was simple and tasty, served in good sized portions and was described to us as normal Belizean fare. Victor greeted us every morning, quick with a laugh and a great cup of coffee. The area is very beautiful; well tended and filled with a wide variety of birds, lizards, and other wildlife.", "title": "Not really jungle luxury", "helpfulness": 1, "user": "RosieSFO", "date": "May 27, 2007", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 4.0, "cleanliness": 3.0, "value": 2.0, "location": 2.0, "rooms": 2.0}, "id": 7703925, "likes": {"liked": "— The personal attention", "disliked": "— The personal attention, room quality, isolation from town"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "We booked an 8-day stay with them, filled with trips to Mountain Pine Ridge, Tikal, Actun Tunichil Muknal (ATM), cave tubing, and canoeing. All of these trips were either guided by a member of the Tut family, or completely arranged by them (I mean completely), so that we did not have to do any of the song and dance involved in putting a trip like this together.", "title": "Most Excellent Vacation!", "helpfulness": 3, "user": "tbean", "date": "April 27, 2007", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "rooms": 3.0, "location": 4.0}, "id": 7477475, "likes": {"liked": "— Common dining area, camaraderie, Tut family, beautiful grounds"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled solo", "text": "This is one of the best places you can possibly stay in while in Belize. It is authentic, the family is wonderful, the setting is beautiful. While Belize is filling up with all kinds of resorts, many of them expensive, run by expats, and in it \"for the business,\" Crystal Paradise is like a breath of fresh air. Belizean run, enthusiastic, naturalists who after more than 15 years of working with tourists, and running ecotourism and birding tours, still maintain energy, laughter and give you an experience of what Belize is really like, both its people and the nature.", "title": "Fantastic!", "helpfulness": 2, "user": "atoness", "date": "April 10, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7327937, "likes": {"liked": "— the family", "disliked": "— I Liked everything"}}, {"rating": 2.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "I highly recommend staying here!!", "title": "Not paradise", "helpfulness": 1, "user": "CaboGirl", "date": "March 30, 2007", "detail_rating": {"front_desk": 2.0, "service": 2.0, "cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "location": 2.0}, "id": 7253770, "likes": {"liked": "— Very pretty grounds", "disliked": "— The horribly uncomfortable bed, dated room and dirty floor,"}}, {"rating": 4.0, "title": "Simply Paradise", "text": "Anna Toness", "helpfulness": 8, "user": "jruth", "date": "February 7, 2007", "id": 6752675}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "My boyfriend and I are in our early 30s and we stayed at Crystal Paradise in March of 2007 for one night during a week's stay in Belize.", "title": "Great!", "helpfulness": 3, "user": "Greyth", "date": "November 13, 2006", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 3.0}, "id": 6122492, "likes": {"liked": "— The Family & Rooms", "disliked": "— The Valley View"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "We loved Belize and absolutely would go back. However, we did not like this property and would not stay here again, nor would we recommend this lodge to our friends – mainly because of the room. We paid over $100 for our room (a \"garden view\") for one night. The accommodations seemed more like what you would expect from lodging at half that price. Don’t get me wrong – we stayed elsewhere in Belize and paid more, and were happy to do it because we felt the other accommodations were worth the money. Crystal Paradise was NOT.", "title": "crystal paradise review", "helpfulness": 6, "user": "rdnje", "date": "November 6, 2006", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 3.0, "location": 2.0, "rooms": 3.0}, "id": 6061350, "likes": {"liked": "— the staff", "disliked": "— limited access to town unless you have your own car"}}, {"rating": 5.0, "title": "Absolutely stunning pleace!", "text": "This place could be described as heaven in more ways than one. The location is stunning, the accommodation is authentic and homely, the food was marvellous and the people were so warm and welcoming we didnt want to leave!", "user": "backtoback", "date": "April 20, 2008", "id": 15156209}, {"rating": 5.0, "title": "Aweome Family Vacation - Great Hospitality", "text": "They took care of everything for us, from airport transfers to our trips making sure we were ok and always had a smile on their face.", "user": "islandhopper102", "date": "April 4, 2008", "id": 14794384}, {"rating": 5.0, "title": "A Birding Paradise", "text": "We are a family with two teenage daughters. We did the Jungle and Sea package, and had a blast. The Tut family and the guides they employ were incredible. We learned so much about Mayan culture, the rainforests, and the country of Belize. We also had a ton of fun! Horseback riding, caving, canoeing, hiking, and splashing in the local rivers. The Tuts made sure that everything happened just as planned, with genuine smiles on their faces.", "user": "newbirdwatcher", "date": "March 26, 2008", "id": 14543184}, {"rating": 5.0, "title": "Authentic Experience & Great Value!", "text": "We just returned from a week at Crystal Paradise and are already planning to return as soon as possible. We have travelled to Belize twice before and Crystal Paradise is our favorite spot. The Tut family is so gracious and welcoming, you feel relaxed and part of the family from the first minute you meet them at the airport.", "user": "GWFoster", "date": "March 24, 2008", "id": 14477980}, {"rating": 5.0, "title": "\" 8 Butts Up\" in Belize", "text": "The Tut brothers were terrific birdwatching guides, each with a friendly and unique personality. We really enjoyed meeting the other guests and felt like we'd all become part of the extended family by the time we left.", "user": "A TripAdvisor user", "date": "March 7, 2008", "id": 14116571}], "location": {}, "variance": {"poor": 3, "average": 8, "very good": 33, "terrible": 4, "excellent": 117}, "aka": "Crystal Paradise Hotel", "slim_ranking": 0.275862068966, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.0, "rooms": 4.0, "location": 4.5}, "description": "This beautiful Belize jungle lodge is located in the lush jungles and along side the beautiful Macal River. Owned and operated by the Tut family, using the ancient art of palm-thatched roofs that blend with the natural beauty of Belize. Combine this exotic atmosphere with genuine Belizean family hospitality and the result is a rare encounter between culture and adventure. . We provide our guests with the opportunity to explore the country's many wonders while staying in comfort that reflects Belizean culture. Your base for all your adventures in Belize whether it be caving, birding, visits to archeological sites such as Caracol, Tikal Xunanunich and many other Belize Maya ruins."}