{"user_rating": 4.0, "review_count": 405, "name": "Crystal City Marriott at Reagan National Airport", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed August 2012, traveled on business", "text": "To make sure I cover the relevance I want to start saying that the room was nice and clean. The staff are VERY helpful and accomodating. The loccation is good. What I did no like was", "title": "Very limited choices in their Restaurant and small gift shop", "helpfulness": 1, "user": "Patricia M", "date": "August 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 137369425}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "that I was there for one week for training and I have hip issues so during my one hour lunch break I could not afford to walk somewhere else so I had lunch every day there and some evening s as well (I did not rented a car).", "title": "Wonderful staff, great location, and clean rooms!", "user": "victorkomd", "date": "August 13, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 137095359}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "1) The food was very limited and not that great at all", "title": "Beautiful hotel, very modern", "helpfulness": 1, "user": "beachgoer42", "date": "August 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 136342133}, {"rating": 2.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "2) the bar closes at midnight and they will not sell you anything after that", "title": "Marriott? Really?", "helpfulness": 3, "user": "Franco61", "date": "August 5, 2012", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 2.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 136268709}, {"rating": 4.0, "title": "Easy metro access", "text": "3) The gift shop was smaller than a bedroom closset and I could not find energy drinks there.", "user": "jaszysmommy", "date": "July 30, 2012", "id": 135822336}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "We did a family trip to DC and relied on public transportation. This hotel is connected to metro and plenty of shops close by, for everyone’s convenience. The staff is very friendly and helpful. The breakfast is awesome. I recommend booking directly the hotel website, for deals. I am very big on claniliness and this hotel meet expectations.", "title": "This is the place stay!", "user": "kxk", "date": "September 9, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 139850429}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled on business", "text": "I have stayed here on business many times in the last 5 years. The rooms are always clean and comfortable. The staff is always helpful and efficient. Meeting rooms are comfortable and convenient. It is especially easy to go anywhere in the area because the Metro is just downstairs from the hotel. You can go anywhere in the area from this hotel in a matter of minutes. The concierge has helped me get bargain tickets to Kennedy Center and other performances around the city as well. I have stayed on the concierge floor a few times and it was worth the extra fee. They also have a shuttle from National Airport which is a very nice perk. My only suggestion for improvement would be to extend the business center hours a bit longer in the evening. That being said, I'd stay here anytime!", "title": "Always treated well; convenient for touring D.C.", "user": "dmwy", "date": "September 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 139703728}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled solo", "text": "This was my first time visiting Washington DC and overall the trip was very good.", "title": "Loved DC & Nice Hotel", "helpfulness": 2, "user": "Damian-Bluee", "date": "September 6, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 139585783}, {"rating": 4.0, "title": "Nice hotel, but don't recommend for weekend stay", "text": "The Shuttle:", "helpfulness": 3, "user": "Nordie200", "date": "September 2, 2012", "id": 139207180}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "I arrived at the airport, went to the shuttle pickup point, and the shuttle arrived about 4 minutes later, score. The shuttles are on a fixed schedule so I my timing just happened to be right. The hotel was really close to the airport so it was a short shuttle trip.", "title": "Nice place to stay and good location!", "user": "GeorgiaRetired", "date": "August 30, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 138920202}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled on business", "text": "I stayed one night at this hotel on a business trip and had a great stay. The reception staff was friendly and efficient. The common areas of the hotel are nice and the location is good - at a Metro station and the Crystal City Shops, plenty of restaurants within easy walking distance. Being close to the Metro, I was able to easily take Metro to and from the airport and to my meetings.", "title": "Very nice hotel", "user": "november_moon", "date": "September 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 140857920}, {"rating": 5.0, "stay_parameters": "Stayed September 2012", "text": "My room was very comfortable - good work space, nice bathroom, very comfortable bed. The only thing that caused me to give a rating of 4 rather than 5 is that the AC unit in the room was rather loud - esspecially when it came on during the night.", "title": "Friendly and Comfortable", "user": "ProfJosh", "date": "September 15, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 140338330}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "I don't know that I would choose this hotel as a tourist, but for business, it was great.", "title": "Great location getting our DC", "user": "kelinkansas", "date": "September 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 140200624}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled on business", "text": "Another example: The following morning my wife went downstairs to get a cappuccino from the coffee bar. Instead of a cappuccino, she was given directions to the nearest Starbucks. In hindsight, I wish we had been given directions to another hotel.", "title": "Peaceful", "user": "Roma739", "date": "July 28, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 135625103}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled on business", "text": "Bottom line is this hotel is ungodly expensive anyway and would not have been worth the money even if the service had been outstanding.", "title": "Very nice place for business or pleasure", "helpfulness": 1, "user": "jeff r", "date": "July 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 135198090}, {"rating": 3.0, "stay_parameters": "Stayed August 2012, traveled with friends", "text": "The hotel was in a decent part of town and close to restaurants and shopping. The renovated rooms are an ok size, very clean and the decor was nice. The bathroom was really tiny but clean too. The hotel was really quiet and the beds were just ok. The people at the front desk were nice and that's where the customer service stops. The maids take forever to clean your room but thats because they really clean everything and change the bedding. It takes about an hour to clean a room. Ugh!! The ladies that ran the bar lacked customer service skills as well as the ability to make a decent drink. They handed drinks over the bar to us when we weren't even sitting at the bar but at a table so we had to get up. How Rude!! The buffet in the restaurant was definitely not worth the $18.00. On the up side, loved the underground mall. It's right under the hotel and accessible from the elevator that leads to the room.", "title": "Confessions From A Natural Hair Chick", "user": "boojeegirl", "date": "August 24, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 3.0}, "id": 138166591}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "We just got back from a three day trip to DC and had a wonderful stay at the Crystal City Marriot. The staff was unbelievable friendly and treated my 3 year old like she was a rock star. The beds were soft and comfortable and the water pressure was decent in the shower. The indoor/outdoor pool was handy as was the metro right below the hotel. The restaurant in the hotel was tasty and reasonable enough for in-house dining. The breakfast buffet was very tasty and had some healthier options than most others. I was really happy to see they had milk produced without hormones. The rooms were clean, as was the hotel. The valet parking was helpful and very efficient. We never heard one plane, which is surprising since we were very close to the airport. I cannot speak for street traffic noise as we were on the 18th floor, but if we didn't hear air traffic, I'm assuming street traffic was minimal too. I do agree that free Wifi should be included but I understand why it's not.", "title": "Great hotel in a perfect location.", "user": "HistoryTravelers", "date": "August 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 137729946}, {"rating": 3.0, "stay_parameters": "Stayed August 2012, traveled on business", "text": "The hotel is a pretty much standard Marriott with nice large clean rooms EXCEPT for NOISY A/C systems. The staff was very helpful and accommodating. Wifi in the rooms (paid) and free (lobby) - this is bad. Wifi should be really a standard amenity like heating. Good location in Crystal City with direct underground passages to shops, restaurants and metro", "title": "OK business hotel", "user": "stanho", "date": "August 18, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 3.0}, "id": 137548847}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled on business", "text": "The Room:", "title": "Good location for Metro and dining", "user": "rtwrtwrtw", "date": "August 30, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 138891363}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "The room was really nice and clean (see pics) due to the recent renovations, score. The bed was extremely comfortable, double score. There were some guess there for a family reunion so it was kind of loud at times but not all night. Evidently this is the family reunion hotel because when I researched this hotel on tripadvisor, there was another reviewer that mentioned it. The pool and hot tub was nice after a long day of site seeing. My room faced opposite of the airport so I didn't hear any planes taking off and landing, score.", "title": "Great place to stay!", "user": "Dianna-Michael", "date": "August 27, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 138546716}, {"rating": 3.0, "stay_parameters": "Stayed July 2012, traveled on business", "text": "This hotel was very convenient to travel as the subway is accessible under the hotel along with the Crystal City mall, so there are plenty of restaurants and shopping . I stayed in a king room, didn't have a great view, but the room was very clean and very well taken care of. Ate the first evening in the restaurant in the hotel, way overpriced for my taste.", "title": "Nice hotel could be a great hotel", "helpfulness": 1, "user": "MI_TravelFreq", "date": "July 22, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 135061154}, {"rating": 2.0, "title": "Going downhill fast...", "text": "I stayed at the Crystal City Marriott while on a business trip to the D.C. area. It's a nice place, and I would stay here again. However, there are a few things that I would improve if I were king for a day. The hotel itself is beautiful, it's one block from the Metro, and there are many options for shopping and dining nearby. The fitness center is well-maintained and has plenty of newer, state-of-the-art equipment. The restaurant and bar area, located just off the lobby, are immaculate and stylish. The staff is helpful, friendly, and always seem to be smiling. The Concierge lounge, found on the Mezzanine level, is newly rennovated.", "helpfulness": 4, "user": "Navytravel", "date": "July 21, 2012", "id": 135014456}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "However, the cooling system in the room is noisy and the temperature fluctuates dramatically. It made sleeping difficult because I was alternating between being cold and hot throughout the night.", "title": "Great base for exploring DC area", "user": "somename", "date": "July 18, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 134748972}], "location": {"country": "United States", "city": "Arlington"}, "stars": 3.5, "variance": {"poor": 19, "average": 58, "very good": 174, "terrible": 11, "excellent": 143}, "aka": "Crystal City Marriott At Reagan National Airport Hotel Arlington", "slim_ranking": 0.375, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.5}, "description": "Located by the Reagan National Airport, this hotel offers hotel suites and rooms for business and leisure travelers. Nearby Crystal City offers many shops, restaurants and DC attractions for visitors."}