{"user_rating": 4.0, "review_count": 102, "name": "Cumbria Park Hotel", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled with friends", "text": "I stayed here on saturday night, we only booked it the night before as we were heading to see Jake Bugg and decided we maybe wouldnt make the last train home so luckily this hotel was available. Was a great location for the sands centre where the gig was, we had a nice walk down then went out in town. The hotel was ideal for what we were looking for, clean and spacious and staff were really friendly. I never had breakfast but my friend did, he said it was perfect for what he needed to start the day. All in all good hotel and will stay again.", "title": "comfortable", "helpfulness": 1, "user": "missxtx", "date": "April 4, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 156563503}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled with friends", "text": "We arrived at this hotel saturday evening on a group travel tour having had the main reason for our tour cancelled, that was the Settle to Carlisle train. Feeling disappointed, cold and tired we checked in to a warm comfortable room on the ground floor(as requested). The evening meal and the breakfast was excellent and the staff very friendly and helpful. Look forward to our return trip.", "title": "Saved the Day!", "user": "SAH64", "date": "March 27, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 2.0, "rooms": 4.0, "location": 4.0}, "id": 155795783}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled on business", "text": "Stayed for one night on a business trip. The place was like a labyrinth with little corridors & up & down stairs which I found quite quaint. My room (138) was immaculate, warm & cosy (& I dont mean it was small). I had dinner in the bar area which was very nice & good value for money. Staff were extremely helpful & pleasant. Breakfast was also very nice & cooked to order. I'd definately stay here again. The only drawback was that I couldn't connect to the free Wi-Fi from my room which was disappointing.", "title": "Labyrinth", "user": "Blueyedgirl1965", "date": "March 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 155730607}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "I have stayed here a few times - with the main reason being location. Just a short walk into the town centre and also a short drive to the motorway. While the hotel is obviously not trying to be 4* or 5*, my room had everything I needed, and was warm, comfortable and quiet. Free WiFi was a bonus. The cooked breakfast was hot and freshly cooked to order. The staff were friendly and helpful. There are a few shops nearby which are useful if you need to stock up before heading home - Sainsburys, Spar and Morrisons. Fuel at Morrisons was the cheapest I've found. I would stay again.", "title": "Comfortable and friendly", "user": "Digbert29", "date": "March 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 155618501}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with friends", "text": "We only stayed one night but was enough to show us what a very good hotel this was.", "title": "Vey good value for money", "user": "Allan V", "date": "March 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 155606417}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "Have stayed here on several occasions. The rooms are clean and of a good standard. Prices for rooms are very reasonable with breakfast included. There is a large car park at the rear of the hotel. When my wife and I were here at Easter, although busy the members of staff had time to cope with all queries and took time to help out with a query I had. The bar meals are of a good standard and reasonably priced. I would recommend this hotel to anyone, who is visiting Carlisle.", "title": "Good Value", "user": "Colin G", "date": "April 22, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 158505214}, {"rating": 5.0, "stay_parameters": "Stayed April 2013", "text": "Spent 1 night in Cumbria Park on our way to Harrogate. The double room was beautiful and very clean. We had a brass bedstead with matching glass side tables and a Laura Ashley style canopy over the bed head with wall lamps under. The bed was very comfortable indeed. The ensuite bathroom contained a jacuzzi bath with shower over and a toilet and bidet, .There were club chairs a table and flat screen tv over and above the usual furniture in the room..Tea and coffee and biscuits provided. The Breakfast was full English or Continental lavish and lovely served by a very pleasant very competent supervisor.. We have booked another night at the end of the week on our return home.Alll of the above for £65.00 per night Fantastic.", "title": "What a bargain", "helpfulness": 1, "user": "chris-hugh", "date": "April 9, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 157230641}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "We met up with friends, so didn't explore the location, very well placed for exploring the Borders or Lake District. Room very clean and well maintained with a very comfortable bed. Although being on the main road, our front facing room wasn't noisy. Corridors a little twisty due to it bring a converted row of Victorian terraced houses.", "title": "A good choice", "user": "Demdike", "date": "April 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 157045889}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "Breakfast was self service with a hood selection of cooked and continental choices.", "title": "A very pleasant stay", "user": "holidaysrus19", "date": "April 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 156914039}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "Couldn't get wifi in the room, but fine in the public areas, others of our party had no trouble so we must have been on the cusp of the signal (room 143).", "title": "Brilliant time", "user": "rewbyrew", "date": "April 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 156866851}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "The wife and I were in town last week-end for one night to attend the races/Madness concert night, as were many other guests. Booked the hotel late on and did not really know what to expect through mixed reveiws. But what the hell, we are only there for one night and for most of the day we will be out. We had a twin room which was excellent, a bit dated but clean and tidy and all we wanted. We had a long day and had one of the best sleeps we've had in a hotel for ages, quiet and cool. I must book twin rooms again! Staff very friendly and helpful and just a short walk into town, so excellent location. Would definitely stay here again if I had the misfortune to have to visit Carlilse again. Dreadful selection of pubs and lack of real ales, but that's a personal choice! So go ahead and give it a go, better location and cheper than the surrounding Premier inns with a bit of character.", "title": "Nice hotel in great location.", "user": "royahassett", "date": "July 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 167382853}, {"rating": 5.0, "stay_parameters": "Stayed June 2013", "text": "We have stayed at this hotel twice now and I can not recommend it highly enough. The staff are wonderful and friendly. The rooms comfy, just a really pleasant place to stay. We will be coming again in November.", "title": "Brilliant hotel and wonderful staff", "user": "arsenaldeb", "date": "July 11, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 167217896}, {"rating": 3.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "my partner and i stayed for 1 night in the cumbria park. reception staff friendly, showed us to our room no. 8 through several rooms and passage ways. we were in formed that there was easy access to our room for later that evening rather than walking through a golden wedding party which was going on. as it happened the access was not available as no one answered the intercom system when rang so we did end up walking through the party celebrations, {i do apologise to whoever was having the party.} room was small and dated but beds and bathrooms were clean. overall this isnt our first choice of hotel in carlisle, but due to the races being on it was our only option as the price we paid was very reasonable. the hotel did its job.", "title": "you get what you pay for.", "helpfulness": 1, "user": "enncle", "date": "July 7, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 166591029}, {"rating": 3.0, "stay_parameters": "Stayed July 2013", "text": "Just got back after a 1 night stay booked through Trivago @ £45 room only. When booked I specified a quiet room and followed this request with a phone call to confirm. On arrival we were greater by nice receptionist who allocated us our room, 139, I think.", "title": "Not a good night's sleep.", "helpfulness": 1, "user": "powbug", "date": "July 6, 2013", "detail_rating": {"cleanliness": 2.0, "value": 4.0, "location": 4.0, "service": 3.0, "rooms": 3.0}, "id": 166523414}, {"rating": 3.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "Initial thoughts on room were as others have stated before, needs updating but appeared clean. However as our stay progresses as did the reality of the room being dirty, stained or unchanged duvet cover and sheets too small for bed. Nice hot shower but again dirty/mouldy and outdated.", "title": "Good value hotel", "helpfulness": 1, "user": "Darghan", "date": "July 4, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 166235993}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "Mostly this hotel is average; its clean; the rooms are adequate; its reasonably near the city centre and it is good value. What made the difference to us were the pleasant and helpful staff. We only ate breakfast - which was excellent - so cannot comment on the evening meals. be very happy to stay there again.", "title": "Good staff make the difference", "helpfulness": 2, "user": "AndyShand", "date": "June 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 164722378}, {"rating": 3.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "We stayed as a party of 10 so varying experiences of this hotel. There is nothing wrong with it apart from being tired and lacking those little extras. However at £65 per night it is very good value. The breakfast was very good and plentiful. If you are looking for a straightforward, central and clean hotel then this will fit the bill. Rooms at the back of the hotel are a lot quieter.", "title": "Functional and central", "user": "YvieC", "date": "June 18, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 164431617}, {"rating": 1.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "My stay here was ruined by the woman organising breakfast. She screeched across the room that I could not go to the table as I was aiming fo. It was totally unpleasant and then after putting me elsewhere came across and started to berate me as I did not want tea or coffee. She informed me that to decline was rude.", "title": "Unpleasant breakfast", "user": "ErnieGodalming", "date": "June 7, 2013", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 163272347}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "I shall not be back.", "title": "Fantastic stay", "user": "tatty36", "date": "June 1, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 162623431}, {"rating": 2.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "This was a hidden treasure booked at the last minute. The receptionist was really welcoming and all the staff without exception were beyond helpful.", "title": "Bank Holiday Communication Breakdown", "helpfulness": 1, "user": "DaveMortimer", "date": "May 27, 2013", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 4.0, "sleep": 2.0, "rooms": 3.0, "location": 4.0}, "id": 162026800}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "stars": 3, "variance": {"poor": 10, "average": 20, "very good": 38, "terrible": 5, "excellent": 29}, "aka": "Carlisle Best Western", "slim_ranking": 0.65, "description": "The Cumbria Park Hotel is a privately owned hotel and has been established for over 40 years. Located 1.5 miles from the M6 J44 and a 10 minute walk from the town centre. We have a leisure club and 6 conferences rooms. The menu is a mix of modern and traditional. A warm, friendly atmosphere awaits you."}