{"user_rating": 4.5, "review_count": 365, "name": "Cypress Inn", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "Well where do i start, the location is perfect, close to the beach an to ocean ave, just 1 block away from all the shops. The staff was great the room was nice but the bathroom was very small. At night the court yard partyers went on till past midnight, didn't say anything to the staff so i take blame for a bad night sleep. The breakfast buffet was the best that I have had in some time! Would I stay there again -no- unless the price came down some The robes in the rooms was nice but that kind of stuff does not help me choose a hotel. I did see lots of dogs with there owners at the hotel we have a dog but she stayed home with my father in law. .", "title": "loud at night", "helpfulness": 1, "user": "rickhimm", "date": "September 12, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 2.0, "location": 5.0, "rooms": 4.0}, "id": 8703640, "likes": {"liked": "— breakfest", "disliked": "— thin walls"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007", "text": "I had finished chairing a conference in Santa Cruz and drove down to the Cypress Inn. From the moment my bags were taken from the car, I was pampered and felt cared for. My room was lovely...had a patio that looked out on a little church across the street. It was impeciably well kept and comfortable. The gym has a \"reformer\" pilates machine...very thoughtful. They serve a morning breakfast, and the server made me a lunch to take hiking in Point Lobos. There were well behaved and cared for dogs (cats?) everywhere. They did not get in the way, but instead, added to the overall ambiance. A friend brought her dog at tea time which we shared in the patio. I loved the fireplaces and the staff was so kind and helpful.", "title": "Lovely quaint inn...animal friendly and people friendly as well....", "helpfulness": 3, "user": "Frani1", "date": "August 28, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 8522737, "likes": {"liked": "— very lovely and comfortable", "disliked": "— a bit small"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "I am not an easy person to please, so believe me, this place is the real thing...I thank Doris Day for all the joy she brought me as a singer/actress...and especially for her love of animals and it's embodiment at the Cypress Inn.", "title": "Delightful Visit!", "helpfulness": 2, "user": "LlillieB", "date": "August 9, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 8379974, "likes": {"liked": "— Unique and classy ambiance, welcoming and polite staff. Lovely room, generous hospitality, both in room and at breakfast. Pet friendliness", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "My daughter and I were looking for a return to the charming and classy visits we had previously enjoyed at the Cypress Inn, when we booked a visit a few days ago. We were not disappointed! We had the pleasure of staying in a new, bright and charming room off the street , which we loved, both for its size and for the convenience of walking Lili-our pug. As we walked into the room we were delighted with the decor - from the little elegant bar area sink and glass shelves above , to the large marble bathroom, inviting bed and window seat- under the large picture window, (which offered more privacy than one might expect, as the heads of those walking by seldom looked toward our direction.) The room had all the advantages we could ask for in comfort and amenities. We felt pampered as we relaxed and enjoyed the hospitality of fruit and drink provided for our pleasure. (Anything edible consumed by the guest in most hotels-will be added to your bill!) We woke to just the kind of breakfast I love the most! A vast assorment of pastries, fruit, juice ,ceral, yogurt and more. Lovely trays allowed us to carry our coffee mugs and food back to our room where we started our breakfast fest. We wound up enjoying more coffee and fruit in the dining area with Lily (and other pooches.) before we started off for our walk to the beach.", "title": "Lovely stay in a great location", "helpfulness": 2, "user": "Mme_X", "date": "July 31, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 8267392, "likes": {"liked": "— Lovely ambiance in great location, great service", "disliked": "— Drawers in armoire that stick"}}, {"rating": 1.0, "title": "Beware before booking!", "text": "For animal friendly places to go, we vote Doris Day' the top visionary anywhere. And the staff exemplifies her vision. On our arrival, the welcome at the desk was so friendly and helpful. Later we had occasion to chat with Nancy, the manager of the Inn, who is wonderfully personable and gracious. We felt like we were personal guests of hers. Our pug was treated like the queen she truly believes she is.", "helpfulness": 1, "user": "carrie2MiamiBeach", "date": "July 30, 2007", "id": 8261666}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "We have stayed several time at the Cypress Inn and have always been pleased. Best of all we brought our little puppy Phoebe.", "title": "Stayed and will stay again", "helpfulness": 2, "user": "Girlson998", "date": "January 4, 2008", "detail_rating": {"cleanliness": 4.0, "front_desk": 4.0, "location": 4.0, "value": 4.0, "rooms": 4.0}, "id": 12341160, "likes": {"liked": "— I could bring my puppy", "disliked": "— Construction noise but it will be done soon"}}, {"rating": 2.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "Thank you Doris Day! (She owns the Cypess Inn).", "title": "Wonderful location, staff not very helpful", "helpfulness": 3, "user": "SFtraveler2008", "date": "January 2, 2008", "detail_rating": {"front_desk": 2.0, "service": 2.0, "cleanliness": 5.0, "value": 2.0, "rooms": 4.0, "location": 5.0}, "id": 12268558}, {"rating": 5.0, "title": "A great experience", "text": "I recently stayed at the Cypress in for 3 nights after Christmas. We had a fireplace room facing an interior court yard. The room was cozy and had a wonderful spa tub.", "helpfulness": 5, "user": "bean66", "date": "November 21, 2007", "id": 10961207}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled on business", "text": "The hotel was very crowded with people and dogs vacationing after the holiday. Although the location in wonderful and the hotel's public rooms are beautiful, the most disappointing part about our stay was the indifferent, and sometimes inept service of the hotel staff.", "title": "Quaint, unique & delightful!", "helpfulness": 6, "user": "MexicoChica", "date": "October 22, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 10242581, "likes": {"liked": "— It's charm, decor, history, staff, dogs, size, location.", "disliked": "— Noise from the courtyard"}}, {"rating": 3.0, "stay_parameters": "Stayed October 2007, traveled on business", "text": "First, we wanted to make reservation for tea for one afternoon of our three night stay at the hotel. When we inquired at check in the front desk staff said that we needed to flag down the bar manager to make a reservation. When we found the bar manager he said that tea was booked for the next 2 days and would not take our name or room number in case someone canceled. Instead, we were told to keep checking in to see if there were any cancellations. Given the price the room for a night (over $400 dollars), I would have expected a little more customer service and to at least be added to a wait list for cancellations.", "title": "Average Accommodations for Historic Property", "helpfulness": 6, "user": "kdonnh", "date": "October 22, 2007", "detail_rating": {"front_desk": 3.0, "service": 2.0, "cleanliness": 4.0, "value": 2.0, "rooms": 2.0, "location": 4.0}, "id": 10231125, "likes": {"liked": "— historic building & convenient location", "disliked": "— parking problems"}}, {"rating": 2.0, "title": "Too much for too little", "text": "The Cypress Inn positives:", "user": "csjnd", "date": "August 11, 2008", "id": 18844671}, {"rating": 5.0, "title": "Cypress Inn - Delightful!", "text": "1) pet friendly (they charge $30/night for pet)", "user": "JT907", "date": "August 5, 2008", "id": 18639872}, {"rating": 5.0, "title": "Our favorite place to stay in Carmel", "text": "2) beautiful building, nice common areas", "user": "CalKat", "date": "July 26, 2008", "id": 18287819}, {"rating": 4.0, "title": "Great spot for Afternoon Tea", "text": "3) nice pastries with free continental breakfast", "user": "Shaymur", "date": "April 25, 2008", "id": 15359651}, {"rating": 5.0, "title": "Wonderful experience, our favorite hotel in Carmel", "text": "4) central location in Carmel by the Sea", "user": "winecat", "date": "February 19, 2008", "id": 13685167}, {"rating": 1.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "Having stayed at this hotel before we were looking for another wonderful stay. Since their \"supposed reconstruction\" the hotel is dirty, dark, expensive, has rude staff, smells, no charm remains whatsoever. Their bar is now noisy and not cozy. Restaurant charges outragious prices for how and what it serves. This was the complete opposite experience as we had had in the past when we also stayed for three days.", "title": "Once a chraming hotel- now a dump with dirty, noisy rooms and rude staff", "helpfulness": 4, "user": "lucy6232", "date": "July 28, 2007", "detail_rating": {"front_desk": 3.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "location": 1.0}, "id": 8246957, "likes": {"liked": "— leaving", "disliked": "— the room and manager"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "We booked about a month or so in advance - so this was not a last minute thing. After reading some of the recent negative remarks we decided to call and check on just what room we were booked into- as a writer had vehemently complained about room 104. Well, guess what-- the last room for that time (middle of the week) for three days was room 104.", "title": "Very Charming...", "helpfulness": 1, "user": "laurenlovesparis", "date": "June 30, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 8030437, "likes": {"liked": "— Location, friendly and helpful staff, rooms"}}, {"rating": 4.0, "title": "This is like a wonderful club for dog owners", "text": "My husband called and spoke to Nancy the \"manager\" -- trying to obviously fill the room, she assured us that the room was quiet and \"many people ask for it especially!\".", "user": "cambria", "date": "June 9, 2007", "id": 7819085}, {"rating": 1.0, "title": "Will not return to this Hotel", "text": "Nancy was useless as we came to find out and never apologized for uselessness.", "helpfulness": 3, "user": "Curly64", "date": "May 15, 2007", "id": 7626527}, {"rating": 3.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "Our room -- smelled, was on the street right where people unload their baggage so heard every word everybody said, the other window went along side the maintaince and delivery alley . all of the drawer and doors on the armoir and nighstands were warped and wouldn't open or close properly ( remember supposedly they are newly renovated!) and some type of wind chimes chimed outside our window all of the time! So, we either heard all the cleaning staff or deliveries being made at all times of the day. Inside the room, they didn't even have solid bathroom doors so you could here everything that anybody was doing in the bathroom. Not exactly pleasant. Nancy's response to this complaint was \"well we tried to keep it in the older style\"! Hearing others going to the bathroom in this day and age is not charming! There was no monitoring of many of the dogs -- like the two large labs that went running down the hall about 10:00 in the evening -- oh by the way - TV channels don't come in clearly. Just a small thing for some of us that like to relax and actually see a program.", "title": "Great location, dogs, dogs, dogs and a bit noisy", "helpfulness": 4, "user": "MarinMom", "date": "April 9, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 3.0, "value": 3.0, "rooms": 2.0, "location": 5.0}, "id": 7302526, "likes": {"liked": "— Breakfast and location", "disliked": "— Noise and inconsiderate per owners"}}], "location": {"country": "United States"}, "variance": {"poor": 14, "average": 30, "very good": 96, "terrible": 16, "excellent": 209}, "aka": "Cypress Hotel", "slim_ranking": 0.142857142857, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "description": "Approaching the Cypress Inn, just steps away from Ocean Avenue, the beautiful Mediterranean façade offers visitors a warm welcome. As our hotel staff greets you, the charming garden courtyard and tastefully detailed atmosphere beckon you to relaxation. Come and experience the wonderful hospitality at this perfect retreat in Carmel-by-the-sea."}