{"user_rating": 3.5, "review_count": 56, "name": "Daddy O Hotel and Restaurant", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "This hotel is great. It is very clean. It has a very friendly and attentive staff. The continental breakfast is plentiful and delicious. The outside area with tables is so pleasant. Also the sundeck up top is great for sunning or having a drink at night. I stayed in a Queen Suite room. The room and bathroom were individually very large and clean. The location is great. It is only 5 houses from the beach. Also, it is in a great location to restaurants and recreation. I will never stay anywhere else. I am already planning from trip back for next year! My only complaint is that there is no Wireless Internet access in the hotel rooms as advertised on their website. The wireless is available in the lobby but the connection is very very weak.", "title": "Great hotel!!!", "helpfulness": 2, "user": "devilmebettie", "date": "July 17, 2008", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 17978867, "likes": {"liked": "— The location", "disliked": "— Bad Internet connection strength"}}, {"rating": 1.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "If you are unfortunate enough to choose to stay at this self-proclaimed “boutique” hotel, do yourself a favor and specifically request not to be assigned room 207 at the time of booking. Even though this room is specifically mentioned as being very small and noisy in two other reviews on this site, I did not take heed and was placed in this prison cell for a two day stay in June. Without exaggeration, this room is barely larger than the queen size bed which is essentially its only furnishing. There is no chair, no table, no desk, and the closet was too small to accommodate a standard carry-on suitcase. Additionally, the room slanted noticeably, so that the head of the right side of the bed was lower than the left, which left me sleeping with my head considerably lower than my feet, and struggling not to roll onto the floor. The room’s two shuttered windows only views were of a rooftop crowded with several air conditioner handlers and other assorted machinery that provided a non-stop hum.", "title": "A Very Disappointing Experience", "helpfulness": 4, "user": "Travel6405", "date": "June 16, 2008", "detail_rating": {"front_desk": 1.0, "business": 2.0, "service": 2.0, "cleanliness": 4.0, "value": 1.0, "location": 5.0, "rooms": 1.0}, "id": 16973893, "likes": {"liked": "— Location", "disliked": "— Value for money"}}, {"rating": 2.0, "stay_parameters": "Stayed July 2007, traveled with friends", "text": "Had my stay been during a full-capacity holiday weekend, maybe I could understand being placed in this room. However, on the two nights that I was in residence, I was advised by the hotel that I was their only overnight guest. It is unbelievable that this hotel would choose to place a guest in what must be their most substandard room – at a weekend rate of $325 per night – when I was their only paying customer. This total lack of respect for their guests’ comfort is probably why the place was a ghost town during a beautiful June weekend at the Jersey shore. It should be noted that both customers and staff members were in short supply, as one needed to wait for someone to assist with everything, such as checking in/out, obtaining beach chairs and towels, etc. In fact, it was possible to enter and exit the hotel repeatedly during the day and never actually come into contact with any hotel staff, including front desk personnel, as the desk appeared to never actually be staffed.", "title": "Daddy Uh-Oh", "helpfulness": 5, "user": "trampette", "date": "August 31, 2007", "detail_rating": {"front_desk": 1.0, "business": 4.0, "service": 2.0, "cleanliness": 3.0, "value": 2.0, "location": 4.0, "rooms": 2.0}, "id": 8591445, "likes": {"liked": "— the location", "disliked": "— the rooms and the owner"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "On the plus side, the property is well-maintained, clean and modern, and is located on the beach block.", "title": "Perfect Location, bring earplugs", "helpfulness": 2, "user": "FrankandEstelle", "date": "August 19, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 4.0, "rooms": 3.0, "location": 5.0}, "id": 8454305, "likes": {"liked": "— Location", "disliked": "— Water pressure and noise outside"}}, {"rating": 2.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "We stayed here with 2 other couples for four nights, paying a hefty holiday-weekend premium (after being quoted a lower rate which went up as we tried to book). We were first shafted with Room 207 which was half the size of our friends' rooms, though the same overpriced rate. Then we were \"upgraded\" to their \"quietest\" room -- 205, which was only slightly larger because it's a handicapped room with wheelchair access -- and also a sink without faucet handles (no cold water) and a too-low closet rod. When one opened up, they finally moved us to a room closer in size to our friends' rooms, but by then we felt totally ripped off. They shouldn't charge the same amount for their smaller rooms. The owner and staff were unapologetic and offered no concession. Also, rooms 205 and 207 are the *least* quiet rooms! They are noisy, right by the elevator, overlook the HVAC system and, when we were there, assorted construction materials and trash that had been left behind. So when we got moved to a street-side room, it was quiet and had a lovely view in comparison. However, in this last room there was no way to keep the air conditioner from cycling loudly on and off all night, which woke us up with each cycle change. One bar of soap per room is ridiculous and stingy at these prices. Many corners were cut in the remodel -- peeling wallpaper, sinks that don't fit the counters properly and so on -- but the style is very nice.", "title": "Not worth the expense", "helpfulness": 3, "user": "BeachBumNJ13", "date": "August 14, 2007", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 2.0, "cleanliness": 2.0, "value": 2.0, "location": 3.0, "rooms": 3.0}, "id": 8421395, "likes": {"liked": "— Close to the beach", "disliked": "— Expensive"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "Stayed the night at Daddy O and it was great! The room was awesome and the bar was amazing! Great service, clean room, good location. The hotel has a rooftop sun deck with great furniture. The lobby, hotel and the bar are decorated really well - kind of swanky! Food is excellent and a great value. It is about the same cost as some of the ocean front motels on the island but soooo much nicer even though its a block from the beach. No pool which is a bummer but the shower is fabulous! Very nice place and I plan on returning!", "title": "Loved Daddy O! Great place!", "user": "beachgirl74", "date": "July 10, 2007", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 4.0}, "id": 8090980, "likes": {"liked": "— The rooms were great!", "disliked": "— no pool"}}, {"rating": 3.0, "title": "Mixed Review", "text": "My husband and I recently stayed at Daddy O for a weekend in June. The hotel still seems to have quite a few kinks, we arrived at 9pm Friday night and it took us about 20 minutes to find someone to come to the front desk to check us in. The front desk guy is also the concierge, he was very nice once he came but it seems like they could use 2 people at the front. The bathrooms are lovely but the rooms itself are nothing too special. It seems like an old motel given a face lift, the walls are paper thin, for some reason you cannot open the windows which is too bad when you prefer sleeping with the fresh ocean air then a noisy air conditioner. The price also is extremely high we paid $285 for a weekend night (not including tax). The nice thing is they give you beach chairs/towels and passes so you do not need to bring them with you. The bar and restaurant are nice as is the convenience store. If the hotel was $100 less I would say it is great, but for the price you pay (and I realize the weekend price is more) I am not sure it is worth it.", "user": "Imerika", "date": "July 4, 2007", "id": 8055530}, {"rating": 3.0, "title": "Not a Good Value", "text": "Daddy O needs to provide more value for the rates that it charges. At over $350 a night, our room was beautiful - - hard edge, modern and large. But, no robes, no coffee machine in the room and no coffee service in the lobby before 8:30 am, no turn down service, no room service, only one hand towel for 2 people, and only one piece of soap that had to be moved back and forth from the sink to the shower. There may not be any alternative if you want to go to Long Beach, but there are plenty of other beautiful beaches to go to instead.", "helpfulness": 2, "user": "jscottjoplin", "date": "June 24, 2007", "id": 7976860}], "location": {"country": "United States"}, "stars": 3.5, "variance": {"poor": 10, "average": 8, "very good": 13, "terrible": 5, "excellent": 20}, "aka": "Daddy o Hotel", "slim_ranking": 0.333333333333, "description": "Daddy O Restaurant and Boutique Hotel is Long Beach Island's first upscale accommodation. We feature full service restaurant, bar and take out store. Our hotel boasts all the amenities the modern traveler is accustomed to and is within a block from the ocean."}