{"user_rating": 4.0, "review_count": 84, "name": "Daintree Rainforest Retreat", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "This is a good location for exploring the Daintree area and the owner, Eric gave us a good map and highlighted the things to see, do, and eat in the area which was great. Ringing a gong for service is odd and you'll ring it until you're blue in the face if the owners happen to be away. Note, this place is \"off the grid\" so light and water is rationed, which adds to the whole experience. I was with a group of five and we got the Cassowary Room, which suited us fine. It was a bit cramped for five adults, but we made do. We bought some groceries and grilled on their BBQs one night. There is a nice little grilling and patio area, although covered with spiderwebs, which I suppose is unavoidable. The place was pretty empty in May, which was nice, it felt like we had the whole place to ourselves. You really feel like you are deep in the rainforest, there is little open space--big trees surround you. It truly feels like a retreat. After sundown there's not much to do and very few TV channels, not to mention no wi-fi or data connection. Kind of nice to sit back and relax without technology. We had a pleasant two-day stay. It is a unique place, reasonably priced. I would recommend it.", "title": "unique rainforest stay", "user": "packhawk", "date": "June 12, 2012", "detail_rating": {"cleanliness": 4.0, "location": 4.0, "value": 4.0, "rooms": 3.0}, "id": 131848858}, {"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "Very individual rooms with personal touches. Shower room needed a bit of up-dating but at the time of our stay Eric was doing just that to surrounding units! Saw a cassowary from the kitchen window - amazing! Had a meal in the restaurant on the first night - we were the only diners, the food was excellent and it was a magical experience surrounded by the sounds of the rain forest.This is a property in a wonderful location - totally unspoilt. Really enjoyed our stay.", "title": "Unique location!", "user": "LancashireLass21", "date": "March 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 126149605}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "Judy and Eric were very helpful during our 5 day stay. They are knowledgeable but not pushy and through them we booked a crocodile boat trip, and a 4-wheel-drive trip to Cooks Town. We stayed in a non self-catering room that was nicely decorated, and we ate breakfast in the open air restaurant that over looks a well stocked pond and lots of lush plants and exotic flowers. The building is very much in the rainforest and we saw a cassowary! There is a small pool and the rooms are arranged along a veranda that looks onto a small lawn.", "title": "Helpful Hosts, comfortable rooms in attractive surroundings", "helpfulness": 3, "user": "Stclaptonuk", "date": "December 27, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 122149206}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "There is food available in the evening that you need to choose in the morning. It was all fresh and nicely cooked.", "title": "A great place to stay - if you want to be in the middle of the rainforest.", "user": "portisheadblue", "date": "December 22, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 121973327}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "There are self-catering rooms that appeared a little larger and if we went again we would use these as at the moment everything in Australia is expensive to us Brits, and in the Daintree the costs seem even higher to eat out every night. There's no decent supermarket so buy food before reaching the Daintree Forest.", "title": "Judy very helpful with local advice", "user": "Jane M", "date": "November 3, 2011", "detail_rating": {"sleep": 4.0, "service": 4.0}, "id": 120107307}, {"rating": 2.0, "stay_parameters": "Stayed September 2012, traveled solo", "text": "I had really anticipated this one-night trip to the Daintree area, which I had planned for several months, and was initially pleased to see it, nestled in amongst the dense forest. I arrived about Noon, and my room was not ready yet, so the hostess suggested a very nice little restaurant near the ocean about ten kilometers away. Fair enough. She was also very friendly, although not responsive when I indicated that the price seemed a little high. There is also a small pub/hotel directly across the road which offers decent meals.", "title": "Over-priced, older property...not what I expected from the reviews!", "helpfulness": 1, "user": "maestrolms", "date": "September 20, 2012", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 2.0, "sleep": 4.0, "rooms": 2.0, "location": 4.0}, "id": 140805962}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "The price, however, ($175/night) seemed steep for what I got. The rooms were rather small and dated. The kitchen window shutters would not close all of the way, so for privacy at night I needed to jam a blanket into the space underneath the shutters. The lighting was rather poor, the only way I could read at night was to sit at the kitchen table with all lights turned on....the two small bed-lamps did not provide nearly enough illumination.", "title": "Very nice place but make dinner plans before you go", "user": "mr_sutts", "date": "September 4, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 139430469}, {"rating": 4.0, "title": "Helpful Owners, Needed some TLC", "text": "The bed was comfortable, and the cable TV worked well; however, there was quite a bit of noise outside from some other visitors, with laughter and loud voices continuing until about 11:30 PM, so I was put in a rather bad mood to go to sleep.", "user": "whisky_doctor", "date": "August 19, 2012", "id": 137661242}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "Finally, the price did not even include breakfast. The office did not open until 9 AM, so I was unable to share my opinions, as I had to get an early start back to Port Douglas. I will NOT return here on a future visit.", "title": "Well worth the drive!", "helpfulness": 1, "user": "Bonnietru", "date": "August 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 137228374}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "We stayed here for just one night as we made a quick stop of in the Daintree Rainforest and went up to Cape Trib the next day. This is a very nice place in an amazing setting.", "title": "Clean and Cosy", "user": "monique t", "date": "June 22, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 132492367}, {"rating": 3.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "This hotel is quite unique and rather nice and perfect if you wish to relax, read a good book and listen to the rain and rainforest creatures. There is not really a restaurant and breakfast is a little disappointing as there is a full menu in the room information folder but this is not available. Obviously it does not have the facilities of a large hotel as it is only run by a couple but this does make you a little uncomfortable not wanting to offend the host. We stayed too long and I would recommend 1 night only at the most in the Daintree unless you have lots of money to spend on activities, otherwise a day trip to the area is sufficient. On our last night in Cairns we managed to get a room at a top class hotel for the same price.", "title": "Nice Place to Read a Book", "helpfulness": 5, "user": "Zeedonk", "date": "September 15, 2011", "detail_rating": {"value": 2.0, "location": 3.0, "service": 3.0, "rooms": 4.0}, "id": 118174278}, {"rating": 1.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "We chose to stay at this place due to the recommendations on Trip Advisor. However, it is not at all what we expected and can't fathom some of the positive reviews. We had chosen a package that included a dinner at the so called \"restaurant\" and when we arrived that night were told that we didn't have any choice for dinner and would be served frozen beef stew. Needless to say when it arrived, it looked like dog food and didn't taste much better. Because we had paid for the meal we took a risk and ordered the desert which was reheated from frozen apple crumble which was just a mash of yuck as well. We were hoping breakfast might improve - given it was advertised as a \"tropical breakfast\" . Turned out to be bottled concentrated juice (served in plastic cups), canned peaches, and dried prunes. Very tropical indeed! This place is below average and the manager was quite defensive and somewhat hostile when challenged on the poor service. I would avoid this place if I were you. Not recommended at all.", "title": "Disappointed - Misleading", "helpfulness": 5, "user": "ontheroad205", "date": "September 12, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 2.0, "value": 1.0, "service": 1.0}, "id": 117961951}, {"rating": 1.0, "stay_parameters": "Stayed August 2011, traveled with friends", "text": "We stayed here a while back and found the overall vibe of the place and managers to be oppressive and stingy. Be cautious of all the good reviews on Trip Advisor - we wish we had been. One word of criticism to the managers and you are in their bad books for the rest of your stay - they can't stand any critique and won't take responsibility for their poor services. They can be very defensive and abrasive.", "title": "Traveller beware!", "helpfulness": 6, "user": "AustraliaBeware", "date": "September 8, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 2.0, "value": 1.0, "service": 1.0}, "id": 117823809}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "We're a family of 5 and it is sometimes quite difficult to find reasonably priced, adequate accomodation for all of us. This place was a little bit on the expensive side compared to similar hotels/lodges we stayed at during our holiday in Australia. Having said that, it's a great location and we thoroughly enjoyed it. There is an excellent BBQ area available and free parking provided. Being right in the forest, the experience was well worth it including the wild life you get to see and hear. The owner was very friendly and there is also a lovely pool available. Reommended.", "title": "Nice place. Would use again.", "user": "Gilles V", "date": "September 1, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 3.0, "service": 5.0}, "id": 117536973}, {"rating": 5.0, "stay_parameters": "Stayed August 2011", "text": "We had a lovely couple of days, our hosts were helpful and friendly. Judy's home cooking was delicious and our room was clean, lovely and very comfortable. Great location in the heart of the Daintree and Eric booked our night walk in the rainforest and crocodile tours both of which we loved! Thanks to Eric and Judy for our short 2 night stay. We'll stay longer next time!", "title": "Friendly, clean, great home cooking and fab location. Helpful & knowledgeable.", "user": "JaineA", "date": "August 14, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 116696201}, {"rating": 1.0, "stay_parameters": "Stayed November 2010", "text": "We stayed there in The summer of last year and I have to say it was the worst ever retreat I have ever stayed at. When we first arrived we were greeted by the owner Eric who at first seemed nice until, his wife also part owner shouted at our kids complaining that the dinner waitress might slip on the way back from the pool. He also said we had to PAY Over double the PRICE than he had earlier said because apparently his wife made a mistake and we refused to pay. After we left to get back at us he took over 100 pounds. We managed to get it back but the cheek of it is unreal", "title": "The phantom owners", "helpfulness": 7, "user": "bbcradioqw", "date": "October 24, 2011", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 2.0, "service": 1.0, "rooms": 3.0}, "id": 119677659}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "We stayed at this awesome place for 2 days and wished we'd stayed for longer. A true piece of paradise which both Eric and Judy should be very proud of.The complex is very natural and the rooms are presented in a way that are spotless and each room is themed with tasteful decor inspired by Judy and Eric's passion for their surrondings. We stayed as a family of 7 with two rooms and cannot say enough about the fantastic experience and service provided by both Eric and Judy. The pool area is set in a tasteful rainforest garden and a great place to cool down and relax in peace while the wildlife noises surround you. It is a real experience. The meals were divine and you cant leave the dinner table without trying Judy's Apple and Rhubarb crumble. Eric and Judy thank you for the wonderful service and experience you gave our family we will most certainly be back soon.", "title": "Wildlife Wonderland", "helpfulness": 1, "user": "Schultze", "date": "October 24, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 119650085}, {"rating": 5.0, "title": "Loved it!", "text": "We had a blast staying at the Daintree Rainforest Retreat! The rooms are well-kept and the property is beautiful. Judy was such a sweetheart, and more than hospitable. The service here is impeccable. We are looking forward to staying here again!", "user": "Kellymustgroove", "date": "October 22, 2011", "id": 119580601}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "We enjoyed our stay in the Retreat,we were there for couple of nights and we did eat at Retreat and therefore cannot really comment on this subject (just read lots of nasty reviews about it below so this is why I am putting this comment in).", "title": "Good relaxing stay", "user": "pacyf", "date": "October 16, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 119340987}, {"rating": 2.0, "stay_parameters": "Stayed September 2011, traveled with friends", "text": "The motel was clean, very quiet and have a lovely surroundings.. This is exactly what we were after. Owner showed us a map and pointed out all the attractions around the place - free and paid - and this definitely helped our overall stay in Cape Tribulation. The rooms were clean and had nice personal touches which is not what you usually get in motels, although a bit dark - but, with rainforest around and surroundings you cannot really expect a sunny, full of light rooms. For me the test is always in asking a question whether I would stay again and I have to say that I would for a simple reason that I found the stay very relaxing in a lovely surroundings...", "title": "Not great", "helpfulness": 7, "user": "wanderermelbourne_11", "date": "September 19, 2011", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 118343344}], "location": {"country": "Australia", "continent": "South Pacific"}, "stars": 3, "variance": {"poor": 7, "average": 2, "very good": 25, "terrible": 7, "excellent": 43}, "aka": "Daintree Rainforest Retreat Hotel Cow Bay", "slim_ranking": 0.5, "description": "The Daintree Rainforest Retreat is a small family owned boutique, home away from home in the Daintree Rainforest!The Retreat is set amongst award winning gardens in the natural Rainforest.The recently renovated rooms reflect the area in which we live with original artwork, cloud comfy beds, private ensuite bathrooms, executive linen, flat screen cable TV and large windows to take in the view."}