{"user_rating": 4.0, "review_count": 506, "name": "Danesfield House Hotel And Spa", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled with friends", "text": "We were there for a girly spa weekend. First impression - lovely grounds and beautiful architecture (pity about the scaffolding which was there when we stayed). Staff was attentive - concierge spotted us as we arrived and promptly helped with our luggage. Food was OK - breakfast was better than dinner. We had dinner in the Orangery. Generally the food was tasty but the portions were small. Spa and treatments were amazing. Overall, a very relaxing weekend. Room was a good size and well-heated.", "title": "We liked it", "user": "ucelle", "date": "December 29, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 122230570}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "WOW - What an absolutely beautiful hotel and grounds. Wonderful opportunity to relax for my fiance's birthday.", "title": "Danesfield House Hotel & Spa - Pure Relaxation Birthday Treat", "user": "WestSussexBungle", "date": "December 13, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121707370}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled on business", "text": "Very warm welcome from reception and concierge. The room style was in keeping with the hotel, comfortable sofa, luxurious bathroom with two sinks and jacquizzi bath, lovely little dressing and study area, large fireplace and a gigantic four-poster bed with thick rich tapestry materials. The views across the garden were stunning - What more could you want?", "title": "ultimate charming castle", "user": "hartmanz", "date": "December 11, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 121626404}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled on business", "text": "We had a lovely three course dinner in the Orangery and service was impeccable and we then went through to the bar area for coffees to finish of the evening.", "title": "Lovely architecture, great food", "user": "mmoriarty63", "date": "December 6, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 121463953}, {"rating": 1.0, "stay_parameters": "Stayed November 2011, traveled with friends", "text": "On both days we used the spa swmiing pool, jacquizzi, sauna and steam rooms, and there were plenty of beds available. Changing room facilities were 5*, very clean and plenty of robes, slippers and towels freely available.", "title": "Appalling Room & Service", "helpfulness": 3, "user": "Phillip C", "date": "December 5, 2011", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 121409061}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "My wife and I had a 2 night break at this hotel just after new year, we like to splash out two or three times a year on a 5* or better break but this time were looking for something of a high, as opposed to luxury, quality but slightly cheaper.", "title": "Very pleasant weekend break", "user": "enjaybee", "date": "January 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 123020459}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "We compared numerous hotels but my wife found a special offer on offpeakluxury.com which looked almost too good to be true.", "title": "Second time around at Danesfield - top marks.", "helpfulness": 1, "user": "S M", "date": "January 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 122704512}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "It turned out to be great value, the package included breakfast on both mornings, dinner on the first night and 15% off spa treatments.", "title": "Our Anniversary at Danesfield", "helpfulness": 1, "user": "JasS86", "date": "January 4, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 122533110}, {"rating": 3.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "Our room, a standard, was pretty small! but had a lovely comfortable king size bed. Tea and coffee making facilities were complementary and the TV had a reasonable selection of channels, according to the on screen guide certain Sky channels were available but we couldn't get these to show.", "title": "New year eve party", "user": "darren b", "date": "January 1, 2012", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 1.0, "sleep": 4.0, "rooms": 2.0, "location": 5.0}, "id": 122351759}, {"rating": 1.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "The bathroom was again on the slightly small side but included a bath with nice overhead shower.", "title": "Noisy room, inedible food and no offer of recompense", "helpfulness": 2, "user": "Michael C", "date": "December 29, 2011", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 1.0, "sleep": 1.0, "rooms": 2.0, "location": 4.0}, "id": 122235229}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "Our overall experience was very positive - the hotel is located in Tudor-style castle dating from 1901, amid a vast well-maintained park on a hill above Thames and with a view over Chiltern Hills. Hotel personnel is super friendly and super helpful - they cater for all, even smallest needs and make you feel like home. The hotel needs a serious investment into soundproofing (being in rooms you can hear what happens in corridors and vica versa), beds and pillows (feels like they remained since 1901).", "title": "Great countryside spa hotel...some modernisation needed", "user": "MaxLondon1976", "date": "January 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 2.0, "rooms": 4.0, "location": 5.0}, "id": 123251014}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "We had a wonderful stay at Danesfied Hotel and Spa, Marlow. The weekend was a Christmas gift from one of our daughters and we had a really lovely stay. The room had a view down over the garden to the river beyond. The staff were courteous and helpful in all areas of the hotel. Food first rate and a particular member of the dining staff went out of his way to inform us of the history of the hotel. Would we go again, definitely.", "title": "Gift for 2", "user": "gillbutler49", "date": "January 18, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 123248086}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled with friends", "text": "As they say - Its 3pm and everything stops for tea - and so it should especially accompanied by a glass of champagne for that 'special' celebration or just to enjoy being alive !!! The selection of teas were excellent and the scones were to 'die' for . . . . The staff were first class, friendly and attentive whilst letting you relax and enjoy the wonderful view over the tiered gardens from the Orangery. Currently undergoing an external decoration programme which although only half completed - has truly transformed this magnificent building of great architectural quirkiness !!", "title": "Champagne Afternoon Tea", "user": "Julie R", "date": "January 17, 2012", "detail_rating": {"location": 5.0, "service": 5.0}, "id": 123200432}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled on business", "text": "The Danesfiled House highly recommended for conferences such as management meetings. The facilities are unique and yet fit modern needs (internet etc.') and the service was friendly and professional.", "title": "Recommendation for events", "user": "Sagit O", "date": "January 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 123167548}, {"rating": 2.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "The building is absolutely beautiful; the view from the manicured gardens is stunning; the restaurant is clearly good although we didn't eat there and the pool is incredible. The room we stayed in seemed very nice at first although we have stayed in better. It turned out that the room was noisy at night, incessant banging which sounded like furniture being moved meant we couldn't get to sleep, when checking out we complained and the clerk just apologised and took no action. Also room service took an hour and ten minutes to bring a plate of sandwiches and this was after 2 phone calls. We might eat there next time we are in the area but an overnight stay is out of the question.", "title": "Eat here and use the spa but don't sleep here...", "helpfulness": 1, "user": "Peter S", "date": "January 14, 2012", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 3.0, "sleep": 1.0, "rooms": 2.0, "location": 5.0}, "id": 123077478}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled solo", "text": "The room was comfortable and spacious. The fitness area was great, with a large gym and pool. Staff were friendly. I didn't like the breakfast selection very much. A nice enough property, but somehow it lacked the wow factor for me. It's more a 4 star property than a plush luxury hotel. But then I guess that is reflected in the room rates. So I will give this hotel a 4 rating, as I think my expectations were not set at the right level.", "title": "Had a nice enough stay, but go elsewhere for a 5* experience", "user": "CM002", "date": "January 29, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 123771734}, {"rating": 3.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "We stayed at Dansfield Hotel and Spa for a weekend as a wedding present treat. We had a voucher for one night including taster menu in Adam Simond's restaurant. We booked the second night in the same apartment to extend our stay. The stay was pleasant and the staff both, at the restaurant and hotel was very helpful and friendly. The spa offers quite basic facilities, some of the gyms have better equipment, however, for the two days stay it was all we needed. My only disappointment was two spa treatments i.e., manicure and skin polish. The latter turned out to be a simple application of an exfoliating lotion on my body, which I could have easily done in a bath myself. The manicure sadly lasted only for two days and flaked away afterwards. Both treatments overpriced and of poor quality. On a positive note my husband was quite pleased with a deep tissue massage that he received.", "title": "Overall a pleasant stay experience, some spa treatments not value for money", "user": "Karen B", "date": "January 26, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 123646451}, {"rating": 2.0, "stay_parameters": "Stayed December 2011, traveled on business", "text": "The hotel is located in picturesque scenery which adds to its value. The afternoon tea was markedly overpriced. Otherwise the food served in both restaurants was nice.", "title": "Unhelpful event manager, poor food and very pricey", "helpfulness": 2, "user": "Melissa M", "date": "January 24, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 1.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 123570220}, {"rating": 5.0, "stay_parameters": "Stayed January 2012", "text": "I organised our work Xmas party here for 70 people and 50 staying over; we spent a lot of money with them, yet the event manager was very unhelpful and tried to squeeze as much money out of us as possible. It made the task very awkward. On the night the hotel staff were very good and attentive, and the rooms were quite nice, if somewhat pricey. However the biggest disappointment was the meal, it was cold, bland and some of it uncooked. This place is supposed to have a michelin star! The worst bit was when asked for feedback after the event, I told the event manager exactly what I have said here and instead of getting back to me with an apology or some way of turning it around, she simply ignored me.", "title": "Ouststanding service & 'quintessentially' British'!", "user": "Welshstirk", "date": "January 24, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 123535376}, {"rating": 5.0, "stay_parameters": "Stayed January 2012", "text": "All hotels of our Nation should take a leaf out of this ones book. Located next to SAS Marlow, it does have a James Bond feel- right down to the cocktails! My husband & I had a child free stay & some peaceful and luxurious 'Adult' time here- we shall definately return! The spa, the food, the furnishings, the decor, the rooms, the gardens, the beautiful surroundings & the service were faultless. It is slightly expensive, but you pay for what you get; outstanding quality!", "title": "Simply magical 'mini-moon' destination", "user": "Tom083", "date": "January 18, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 123268604}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "stars": 4, "variance": {"poor": 52, "average": 81, "very good": 135, "terrible": 34, "excellent": 204}, "aka": "Danesfield House Hotel And Marlow", "slim_ranking": 1.0, "description": "Danesfield House Hotel and Spa is an award-winning, luxury 4-star country house hotel located between the fashionable boutique shopping towns of Marlow and Henley-on-Thames in beautiful, rural Buckinghamshire. Privately owned, we represent a quintessentially British establishment overlooking acres of manicured gardens and the River Thames. Located near the M25, M4 and M40 motorways, just 45 minutes from the centre of London and 35 minutes from fashionable West London we are the ultimate Buckinghamshire Hotel to escape to. Each of the 86 rooms offers unique charm and character with the most enchanting traditional British interiors exquisitely combined with classical design. Our awards include: One Michelin Star awarded in Michelin Guide Great Britain and Ireland 2011AA, 4 Red Rosettes for Culinary Excellence, 12th Top UK Restaurant 2012 awarded by Good Food Guide 2012, Most Relaxing Spa UK 2011 awarded by Natural Health Magazine Spa Awards."}