{"user_rating": 3.5, "review_count": 204, "name": "Danfords Hotel & Marina", "reviews": [{"rating": 1.0, "title": "Noisy and Poor Service", "text": "This is a large old inn with a restaurant/bar on the water. I arrived on a Saturday night and the place was hopping. Checking in was OK but I had to ask the staff to help me find my room and get my bags up 2 sets of staircases (this is not a disabled or elderly friendly hotel). My room was OK but overlooked the ferry area, so between the bar noise/music (which lasts on the weekend until midnight) and the ferry that runs at 5-6 am, sleeping did not happen. I did ask for a quiet room and was told this was the only room available. The closet was a joke, it was in a small cubby hole and you had to crawl in to put your clothes in and the hangers were attached to the rack (did they think I was going to steal their hangers). I asked for more towels and had to call twice in 30 min to get additional towels. My room was not cleaned, the bed was made and the bathroom was not touched in 3 nights.", "user": "MarianaG", "date": "June 13, 2011", "id": 113201823}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with friends", "text": "The small town Port Jefferson is a tourist town stop. The restaurant, Steamers, across the street is very good for fresh seafood.", "title": "Let's Party!", "user": "iamaliz123", "date": "June 12, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 112972545}, {"rating": 2.0, "stay_parameters": "Stayed May 2011", "text": "A 16th Birthday Party is a big deal. While looking for party venues, I came across Danfords because it was local and had an excellent reputation already. My party theme was colors and each person invited was assigned a certain color to match the table at which they sat. I provided the flowers, party favors, and candle holder; while Danfords did the rest. When meeting with the event planner, her sincere interest in my party and my wishes, blew me away. Continuously she proved to me that she wouldn't stop until my party was everything that I wanted and more. I ended up booking a room in the hotel where I could get ready and retire after the party. Not only was the room right next the gorgeous Brookhaven Room, where my party took place, but there was never a problem with finding a room with 2 double beds. The room alone was clean and cheery, with a lovely side deck and chairs. Inside the AC was at a very comfortable temperature and the bathroom was stalked with fresh towels, shampoo and conditioner. The party however, by far stole the show. Everything was beautiful! The extremely capable staff at Danfords took my idea and made it not only possible, but over the top and simply amazing. The staff managing the buffet was always alert and engaging as each guest got there food. Overall there wasn't a person there who wasn't polite or professional. I highly, highly recommend Danfords Hotel & Marina to other birthday girls and guys because my experience was truly so much fun. Everyone was so impressed and over and over again was I told that my party was the best so far. There is no way that any of it would have been possible without Danfords!", "title": "Not for families!", "user": "4JETS", "date": "May 9, 2011", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "location": 3.0, "service": 2.0, "rooms": 2.0}, "id": 107476042}, {"rating": 2.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "Stayed here for two nights over mothers day weekend. If we were 21 again it would have been great but alas we are mid 30s with two small children. Our door was constantly being banged on by groups of teenagers who would knock then run. Our room was right next to the entrance to 2nd floor rooms so that door was constantly opening and closing. We called the front desk who really didn't seem to care. It appears they are more concerned about functions going on at the place. As fro the bar restaurant, way over priced. For a nice family water marina view get away stay away from danfords. Only positive was right next to ferry to get away from it.", "title": "Old and carpeting was dirty", "helpfulness": 1, "user": "helch", "date": "April 23, 2011", "detail_rating": {"service": 1.0, "cleanliness": 2.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 4.0}, "id": 105145820}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "First time in all my travels that I had something taken from my room by staff. I lost my Louise Green's head band/bow. Did report it to security. Ice machine was not even in the building but in a building arcoss the street. No coffee in the morning. No liners for ice containers. One facecloth and two towels unless you asked. Roof leaked into our room during a rain storm.", "title": "Outstanding, classy and fun,", "user": "Floridahollywood", "date": "February 14, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 96628752}, {"rating": 2.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "My boyfriend and I decided to take a mini-stay-cation to visit family and friends in Long Island instead of going away. He is an avid fishermen, with family live close by, so Danford's seemed to be a perfect fit. Unfortunately, we were greatly disappointed. Upon check-in, the lobby area (even though recently renovated) had a horribly musty smell. We got to our room, changed, and quickly rushed off to meet friends for dinner at a different location. When we returned, both exhausted, my boyfriend went to use the bathroom and realized the toliet was not operating properly. He quickly called the front desk for assistance. After nearly a 20 MINUTE WAIT, a security guard came to our room... AND HANDED MY BOYFRIEND A PLUNGER AND LEFT!!! We were both shocked that an engineer or house keeper was not sent to remedy the situation. How romantic it was to see my love plunging a toliet, water overflowing at this point, on what was supposed to be a romantic getaway! When we checked out the next morning, we addressed the matter with a front desk agent, and he graciously informed us that he would comp our room, and even went to far as to offer us a free upgrade the next time we returned. We were pleased with this, even though our night was a bit of a mess. We had full intention of returning again in the summer. Days after our stay, we noticed an unauthorized mysterious charge from the hotel on the credit card. I called to find out what it was, was transferred to a voicemail, and never got a response. Days later, I decided to call again. They told me (after being on hold for entirely too long) that after we checked out, an engineer \"investigated\" the bathroom, and determined that there was no problem with the toliet, so they only discounted my room (instead of comping as promised) and charged the card for the balance!!! We were outraged! They charged us without proper authorization and went back on their word that they would comp the room! NOTE: they gave us a receipt indicating that the room had been comped!!! To say we were outraged is an understatement! After expressing my extreme disappointment with the deceiving matter that they handled this, and being put on hold AGAIN, they finally agreed to reverse the unauthorized charge. The fact of the matter is that if they had simply told us they would discount the room at check-out, we would have gladly paid for the room, but to find out after the fact that they went back and charged us without a legitimate authorization is simply unacceptable. Whether or not we return for our \"free upgrade\" is still up for debate... after all... how do we know they won't go back and change their minds on this as well!", "title": "Disappointing and Deceiving", "user": "TravelHeart914", "date": "May 5, 2010", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 63317759}, {"rating": 5.0, "stay_parameters": "Stayed April 2010", "text": "Danfords is a gorgeous place. They have great food and very friendly staff. The rooms are beautiful and the view is fabulous. It's a great little getaway!", "title": "Danfords is a gorgeous place. They have...", "user": "ItalianPrin87", "date": "April 28, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 62669097}, {"rating": 5.0, "title": "Great Service and Guest Rooms", "text": "My boyfriend and I live on Long Island but were looking for a nice little getaway. When we went to check in we had a complimentary upgrade. The room had a beautiful view of the water and were very comfortable. Room service was great and there was breakfast the following morning. I would definitely stay there again.", "user": "ElleMonster", "date": "March 15, 2010", "id": 58684650}, {"rating": 2.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "woke up at 3 in the morming with a young couple fighting over something stupid. Every curse work being yelled for approximately 30-40 minutes outside my bedroom window. The hotel took no aciton what so ever. When I advised managment the next momring and inquired why no aciton was taken, I was advised it was a Friday night and that was to be expected. \"People just getting their fustration out\" Well, they will not see me again. Let the fustrated people reserve the next room.", "title": "Re: A scene for the fustrated", "user": "tdc7787", "date": "March 8, 2010", "detail_rating": {"service": 1.0, "cleanliness": 5.0, "value": 1.0, "sleep": 1.0, "rooms": 4.0, "location": 5.0}, "id": 58087114}, {"rating": 2.0, "stay_parameters": "Stayed July 2009, traveled on business", "text": "I went to the Danford's in for a 2-day business meeting with a group of colleagues. It was truly an awful exerperience -", "title": "TERRIBLE experience - location nice but rooms/cleanliness are a D-", "user": "MoonlightRainSO", "date": "February 5, 2010", "detail_rating": {"service": 3.0, "cleanliness": 1.0, "value": 1.0, "sleep": 2.0, "rooms": 1.0, "location": 4.0}, "id": 55237600}, {"rating": 4.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "Danfords has A LOT going for it, not least of which is the setting, which cannot be beat. Clearly no expense was spared in architectural detailing, walkways, lighting -- the big stuff. That being said, a few details within the room(s) were very annoying and not on par with what I would have expected at this price and location. Cheap toilet seats that went crooked so you fell off; toilet tissue dispenser broke and fell off wall; hot/cold water that took literally minutes to come to temperature. Worst problem was VERY inadequate heating system (forced air) which caused us to change rooms twice in an attempt to achieve room temp above 60 degrees, which proved impossible. The temp outside was single digits - but really now - let's install heat that works in this climate. I sincerely hope some of these problems are addressed because I would love to return for a more carefree stay in the future. The view is THAT GOOD.", "title": "Very very close to being an outstanding property", "helpfulness": 1, "user": "laurie-ellen1973", "date": "January 25, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 94427313}, {"rating": 2.0, "stay_parameters": "Stayed November 2010, traveled on business", "text": "This is a nice, clean, charming hotel on the waterfront in Port Jefferson, New York, on outer Long Island. The room was very comfortable. Alas, it has fallen for that awful trend in upscale hotels to eliminate bathtubs. The front desk says that none of the rooms have bathtubs! This weary road warrior likes to soak his tired bones in the tub. Shower-only places are for Motel 6, not upscale places like this. Everything else was great.", "title": "NO BATHTUBS!", "helpfulness": 1, "user": "investroll", "date": "November 24, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 1.0, "location": 5.0}, "id": 88084289}, {"rating": 1.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "After searching online for a weekend trip at Port Jefferson area, I came across Danford's Inn. From the pictures provided and the reviews, I was sure that I was going to have a great weekend. I ended up paying $250 per night. As I checked into the Inn, I've noticed that the room they put me in was facing the street with construction of a retail store next door. That didn't bother me too much until I heard hammering and drilling that went on unitl late hours of the night. THIS IS THE WORST ACCOMODATION I'VE EVER STAYED IN. As I contacted the front desk, they responded that the noise coming from the construction site next door would end shortly which did but only after 9:00 PM on a saturday. I WOULD STAY AWAY FROM THIS PLACE. YOU'RE BETTER OFF STAYING AT A MOTEL 6.", "title": "Never again", "user": "ThomasYSH", "date": "October 8, 2010", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 5.0}, "id": 82577236}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "My wife and I were married here. The place is beautiful, great location, great rooms, great food, great bar, and downtown Port Jeff is awesome. Definitely recommend to anyone.", "title": "Wonderful!", "user": "Crappyshoes", "date": "September 1, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 77760665}, {"rating": 3.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "At Danford's you pay New York City prices. Its just about the only viable option within Port Jefferson town, so I suppose they have the market cornered. Despite this, it is only a bit above average as a hotel and one can get the same services /amenities at any standard Hampton Inn for a lot less money. Too bad there arent any other decent hotels in the center of Port Jeff because this place needs some competition.", "title": "Best Port Jeff Location, Poor Value", "helpfulness": 1, "user": "donnico1", "date": "August 25, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 2.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 76838196}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "Danford's Inn is top notch. The rooms are perfect, location amazing. Absolutely no complaints from a person that tends to complain", "title": "I'll be back - Many special memories were created at Danford's", "user": "12letsgo", "date": "August 2, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 73508288}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "We stayed at Danford's for a wedding. It is more of a compound with a collection of historic buildings all in a small area and that was surprising to us.", "title": "Wonderfully comfortable beds", "user": "aprilaurora", "date": "July 6, 2010", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 69876795}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "The a/c did not work in our first room (there was a light out in the bathroom and the sink drain was a funky contraption, too), so we switched rooms. That room was smaller, and not as cute, but comfortable. The beds are great!!!! We had two wonderful nights of sleep!!! We were with many friends from work and everyone's room was different. I was annoyed that we were staying for two nights, but didn't get the benefit of a balcony room overlooking the marina. Everyone paid the same rate, but the amenities were vastly different for each of us. If you stay there, make sure that you ask for a room with what you want. It is a great location because of the nightmare parking situation in Port Jefferson. Some of the guests stayed in the Holiday Day Inn and had to be shuttled to and from the wedding. I would not have liked that no matter what the savings was. It was fun being close to the town. We dined in the outdoor restaurant that had great live music. Food was fine.", "title": "It's worth the trip.", "user": "trixie96", "date": "May 26, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 65376519}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "Danford's is a great place to stay. It has a small town intimate feel. I loved it. My husband and I celebrated out anniversary there and it was perfect. I was concerned when we checked in because the lobby was very busy with attendees of a wedding that was being held in the hotel. I thought it might be a big party scene but after checking in I never even noticed them. The food in the Wave restaurant, located in the hotel, was very good. However, the town has many restaurants, shops and bars to choose from (all in walking distance).", "title": "Beautiful hotel in a beautiful town", "user": "sharze1", "date": "May 22, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 65009262}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "I checked in on Thursday night for my friend's Stony Brook graduation. The front desk staff was very friendly and accommodating - easy and quick check in. Had a gorgeous view of the Sound from my balcony and a great meal at their restaurant, The Wave - great service and delicious seafood! Even though I didn't have the opportunity to take advantage of everything the hotel and town had to offer (I was busy with graduation activities), I would highly recommend this hotel for weekend getaways. Overall great stay!", "title": "Great hotel with nice views", "user": "olegan4", "date": "May 10, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 63782458}], "location": {"country": "United States", "city": "Port Jefferson"}, "stars": 3.5, "variance": {"poor": 26, "average": 27, "very good": 55, "terrible": 19, "excellent": 77}, "aka": "Danfords Hotel And Marina", "slim_ranking": 0.333333333333}