{"user_rating": 4.5, "review_count": 277, "name": "Daphne Inn Veneto", "reviews": [{"rating": 4.0, "title": "Noisy but Nice rooms, great location, abrasive owner", "text": "What a wonderful time we had in Rome! This was our second trip to the eternal city and Mimi could not have been more gracious and helpful. She made us feel welcome. The B&B is clean and the breakfast scrumptious. However, the walls are paper thin and you can hear everything in the other rooms, right down to the brushing of teeth and the sounds of people getting undressed, even putting their change on the dresser. We also had an unpleasant experience with the owner Alyssa. She made us feel that we were intruding and unwelcomed. The computer connection on our floor had not been working so we were told that as long as the door to the 4th floor was open we could go up there. The door was opened but when we proceeded to try to use the computer Alyssa briskly and rudely ushered us out and back down to our own floor stating that we should try the computer again. She is brash and unfriendly. It is best if she sticks to the inner workings of B&B business and leaves the people business to Mimi or Alessandro her husband. Because of Mimi, the cleanliness, and location, I would stay there again provided I bring my earplugs, and avoid interaction with Alyssa.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "July 27, 2005", "id": 3702993}, {"rating": 5.0, "stay_parameters": "Stayed June 2005", "text": "My husband and I stayed in early June and the whole experience was nothing short of superb. The accommodation very central tucked up a small side street (no problmes with noise) with easy walking access to all the sights as well as underground and buses (2 mins walk). The room was spotless and had the vital air con - temps reached low 30's. We arrived late and Mimi on reception advised us of a restuarant close by with good food and it didnt disappoint. First thing next morning we sat down with Mimi and a map and she advised us on a route to take in the main sites and recommendations for everything from coffee, lunch and wonderful galeto (ice cream). This happened every morning and each day was wonderful, we didnt once have a bad experience and the recommendation for food in the evening were superb, little traditional restaurants that were tucked down little alleyways that we would never have found, never mind eaten in.", "title": "Superb", "helpfulness": 14, "user": "Tyrees4", "date": "July 12, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3659575}, {"rating": 4.0, "stay_parameters": "Stayed June 2005", "text": "My advice if you stay here is to speak with Mimi and take all her recommendations and you will have a wonderful, wonderful time.", "title": "Great B&B", "helpfulness": 18, "user": "watraveler", "date": "July 11, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 2.0, "service": 5.0}, "id": 3655587}, {"rating": 4.0, "stay_parameters": "Stayed June 2005", "text": "Enjoy!", "title": "Nice hotel, but know your stuff!", "helpfulness": 19, "user": "Paul14", "date": "July 9, 2005", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "service": 4.0}, "id": 3652583}, {"rating": 5.0, "stay_parameters": "Stayed June 2005", "text": "The Daphne Veneto is a lovely B&B! Mimi and Nicole were very gracious and helped us plan our 4 days in Rome. They gave wonderful suggestions regarding tours and restaurants. The Daphne is in a great location, as we were able to walk everywhere. In addition, they had 24hr access to the internet to check e-mails which was great. The only problem we had with the Daphne was that one of our two rooms had a \"horrible\" mildewy-sewer\" smell.", "title": "Loved it", "helpfulness": 10, "user": "drebutters", "date": "July 6, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 3639853}, {"rating": 5.0, "stay_parameters": "Stayed August 2005", "text": "Stayed at the Daphne Inn Veneto for two nights and it was wonderful. The rooms were very clean, well furnished and air conditioned! Staff were incredibly helpful; they booked tours and transfers for us, recommended restaurants and places to shop and seemed genuinely interested in ensuring we had a great stay.", "title": "Fabulous place to stay", "helpfulness": 5, "user": "anushka", "date": "September 1, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3835886}, {"rating": 5.0, "title": "Absolutely perfect!", "text": "Internet access is free and convenient and the breakfast was very good, especially the cappuccino. Location also very good.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "August 24, 2005", "id": 3805148}, {"rating": 5.0, "stay_parameters": "Stayed May 2005", "text": "Would definately stay here again.", "title": "wonderful stay at Daphne Veneto", "helpfulness": 4, "user": "outandabout", "date": "August 24, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3802185}, {"rating": 5.0, "stay_parameters": "Stayed December 2004", "text": "We stayed at the Daphne Inn Veneto in Rome after reading an article in Conde Nast Traveller and then reading reviews on this site. It certainly didn't disappoint!", "title": "A wonderful place", "helpfulness": 2, "user": "aussieabroud", "date": "August 18, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 3782481}, {"rating": 5.0, "stay_parameters": "Stayed May 2005", "text": "The location was literally a one minute walk from the Barberini metro stop down a quiet side street and was very walkable to all the sites (10 mins Spanish Steps / Trevi fountain, 25 mins colosseum). We even walked to the Vatican but that was a tough 45 minutes in the August heat!", "title": "Daphne Veneto is a Gem", "helpfulness": 3, "user": "Susanne942", "date": "August 8, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 3746811}, {"rating": 5.0, "title": "Daphne is the best in Rome!", "text": "We stayed at the Daphne during the last week of June, and it was a wonderful experience. Their staff is very friendly and extremely knowledgable. In a city that attracts a lot of tourists, the staff took time to map out wonderful \"off the beaten path\" sites and they also recommended some great establishments for everything from dinners to gellato! The rooms are very nice and the beds really are very comfy. I would recommend this place to anyone who plans to vaction in Rome!!", "helpfulness": 11, "user": "A TripAdvisor user", "date": "July 6, 2005", "id": 3639775}, {"rating": 5.0, "stay_parameters": "Stayed June 2005", "text": "Understated elegance, comfort, linens to die for - the Daphne Veneto is truly a home away from home. From the initial contact with staff, to the last remaining crumb of bread at the continental breakfast, our stay at the Daphne was memorable to say the least. As first-timers in Rome, the extent of the staff's hand-holding was impeccable, and I don't believe you'll find the amenities that you get at the Daphne anywhere else. They provide a cell phone and free internet access for those few moments you may feel homesick (and they are few!).", "title": "The Daphne Rocks!", "helpfulness": 17, "user": "ChattyCat", "date": "July 1, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 3628268}, {"rating": 5.0, "title": "Feeling at home in Rome", "text": "Located at the heart of everything, simply walking out the door every morning is an adventure. The shaded streets of the Via Venetto, the free (literally) flowing water fountains everywhere, Piazza Barberini, ATMs, cafes, pharmacy, bus and metro stops - it's central to everything - and at a reasonable price.", "helpfulness": 13, "user": "A TripAdvisor user", "date": "June 20, 2005", "id": 3583448}, {"rating": 5.0, "stay_parameters": "Stayed October 2005", "text": "I do not normally use superlatives, but here goes. The Daphne which is located near Bernini Piazza is wonderful....not because of the room alone, but because of everything that goes with it.", "title": "What a great place....Oct 9 - Oct 12, 2005", "helpfulness": 3, "user": "barrycher", "date": "November 1, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 3.0, "service": 5.0}, "id": 4077664}, {"rating": 5.0, "stay_parameters": "Stayed October 2005", "text": "First, they arranged for a driver from the airport at a very reasonable rate. He was late, but that's traffic. We got to the hotel and left our bags and went to get a bite to eat (it was too early to check in). We were recommended a little place around the corner, which was very good. When we got back, our bags were in our room. The two hostesses were very gracious and helpful. We were given a cell phone to use while in the city (the rates were cheaper than my phone card and my int'l cell); I used it a lot.", "title": "The Best!", "helpfulness": 5, "user": "lysaf303", "date": "October 29, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4071021}, {"rating": 5.0, "title": "Great Staff, Great Advice, Great Location", "text": "The room is quaint and comfortable. The bed and linens were very fine. Now on to the bathroom....ok, so I'm a 300 giant and I found the shower cramped until I learned how to move both of the corner sliding glass doors. Speaking of cramped, the elevator is built for 2 and no bags (we were on the main floor). The elevator was used to get to breakfast on the 4th floor. It is a very nice spread and the hostess (who's English is strained) is verrrry cordial. If you are going out before breakfast is served, they'll fix you a togo bag.", "helpfulness": 9, "user": "A TripAdvisor user", "date": "September 27, 2005", "id": 3943225}, {"rating": 5.0, "title": "Julie, where's my next activity?", "text": "The owners are amazing. My Vatican guide cancelled at 9:30PM for the next day; so I called the emergency number on the cell phone and got the owner, who, within 1/2 hour got me another at the same rate (they had not booked the one who cancelled). Then I had to call our friends at another hotel to tell them what time to meet us and I couldn't get info to help me; so I called the emergency number and the owners connected me to the hotel. WOW....well the next morning I got to meet him (the owner) and we were talking about how to take the subway to the Vatican. They were explaining to me how and he said, just wait a moment. The next thing I know, he has raced off to the corner, bought 4 one hour and one way tickets for my wife and I and races back to the hotel with them.", "helpfulness": 8, "user": "A TripAdvisor user", "date": "September 17, 2005", "id": 3911888}, {"rating": 5.0, "title": "OUTSTANDING GREAT LOCATION", "text": "If you don't stay at the Daphne, you're missing a wonderful experience. I will never stay anywhere else if that coin in the Trevi Fountain thing works!!!", "helpfulness": 8, "user": "hankster51", "date": "September 2, 2005", "id": 3838597}], "location": {"country": "Italy", "region": "Lazio", "continent": "Europe", "city": "Rome"}, "variance": {"poor": 1, "average": 5, "very good": 50, "terrible": 3, "excellent": 218}, "aka": "Daphne Inn Veneto Hotel Rome", "slim_ranking": 0.0594841930116, "description": "Daphne is a new way to stay in Rome. We combine elegant accommodations with personalized service and affordable rates to give you a more complete travel experience. We offer spotless, air-conditioned rooms and really comfortable beds, wonderfully located in the historic center, minutes on foot from Trevi Fountain. You will find fresh fruit and pastries with your coffee in the morning, wireless Internet service, and a cell phone to use during your visit with us."}