{"user_rating": 5.0, "review_count": 636, "name": "Dar Silsila", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "Lovely place with very welcoming staff and faultless service. Hidden down a narrow alley - as are most of the small riads in the city - but relatively easy to locate and very conveniently situated a few minutes walk from the main square and with all the main sights of the Medina within easy walking distance. Breakfasts limited in choice but very good quality and served on the roof terrace. Evening meals provided when ordered in advance and well worth having - we only had one during our stay, as we like to try different places, but it was easily the best. If you're used to big hotels where everything is predictable and you are anonymous amidst all the other guests, then Dar Silsila might not be for you. But it has real charm and style and does what it does as well as anyone could. Thankyou Mohamed, Jean Patrick and all the team for helping to make our stay in Marrakech so enjoyable.", "title": "Highly recommended", "helpfulness": 1, "user": "Steve-G23", "date": "April 13, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 27942630}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled with family", "text": "I spent 5 glorious days at Riad Dar Silsila to celebrate my mothers 60th Birthday. We wanted a special, memorable holiday and the staff at the Riad made sure that was what we recieved. Thank you so much to Fouad and and the rest of the staff for looking after all of us so well and ensuring that my mother and the rest of our party had a great holiday. I have no doubt that we'll be back again soon - you were all great!", "title": "Amazing place with excellent service", "helpfulness": 1, "user": "Sunny78Sussex", "date": "April 5, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 27448186}, {"rating": 3.0, "stay_parameters": "Stayed March 2009, traveled with family", "text": "A Beautiful setting with wonderfully friendly and attentive staff - thank you.", "title": "Comfortable stay", "helpfulness": 1, "user": "MountainsDenver", "date": "April 4, 2009", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 4.0, "service": 3.0, "rooms": 2.0}, "id": 27380466}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "We had a great stay marred only by the fact that we were quoted one price via email whilst still at home and told that only cash was accepted. With that in mind, I brought the exact cash and paid the bill on the first day. Or so I thought.... a day before we left I asked for a bill to cover the dinner and ham mam and was given this bill with more room charges on it. When I showed them the email ( fortunately I had brought a copy of it), I was told that was their mistake and that bill was not correct. The problem was twofold: there was no apology and they take only cash which put us in quite a bind. Fortunately, we managed because we were going back home and sacrificed on some shopping but it could be a big problem if this is only one of your stops in a vacation.", "title": "Excellent Riad", "helpfulness": 1, "user": "rennatian", "date": "March 25, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 26808702}, {"rating": 5.0, "title": "An Oasis of Tranquility", "text": "Also, the reason for our visit to Morocco was to celebrate my daughter's birthday and I thought a little something could have been done to make her feel special. Instead, calls from grandparents could not be received because there are no telephones in the rooms and I was bothered by the fact that we were asked to keep our voices low ( 9am!!) as we took pictures of the birthday girl in the courtyard because some guest at some point of time had written here that the hotel could be quite noisy. I thought that was very inconsiderate to the present guests.", "helpfulness": 1, "user": "spinzrme", "date": "March 24, 2009", "id": 26731573}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "We're a young couple, and stayed 3 days at Dar Silsila and LOVED it. We're overall very low maintenance, but the service here was spectacular, and the staff was so kind. When we mentioned we needed to go to the train station to buy our train tickets to Fez, Jean Patrick offered to take care of it, saving us several hours to explore. Mohammed is a delight to talk to, and answered questions and even made phone calls to find out exactly what time the belly dancers would perform at our bar of choice. The dinner we had there on our first night was the best we had in our 1 week in Morocco. Would return to Marrakech to stay at Dar Silsila! It was fabulous!", "title": "SO charming, delightful stay", "helpfulness": 1, "user": "gringa220", "date": "March 23, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 26709766}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled with family", "text": "We didn't expect to find an oasis in Marrakech but we did and its name was Dar Silsila. Marrakech is a teeming city with so much interest but only about 5 minutes walk away from the centre is this haven of calm, quiet, comfortable hospitality. The end of February saw us making our first visit to Marrakech and Dar Silsila was our initial introduction to Morocco. The owner Jean-Patrick had already arranged our airport transfers in his comfortable minibus and the welcome we received when we arrived was very walm - the mint tea and small cakes were wonderful! Jean-Patrick, his assistant Mohammed and all the staff were very kind and helpful and nothing was too much trouble for them. There were four of us in our party and we all had a marvellous week here, walking (and sometimes taking the very cheap taxis) to visit the many architectural and decorative gems remaining from the Moorish times and then returning to the comfort of Dar Silsila.", "title": "An oasis...........", "user": "Oasisfinder", "date": "March 22, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 26593033}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "Once again, Dar SIlsila has managed to be the most peaceful and lovely haven in the midst of Marrakech. The decor and layout are gorgeous, but what REALLY makes Dar Silsila one in a million is the personalized and hospitable service guests receive. I was really sick when we arrived at Dar SIlsila, and Jean Patrick insisted on dropping everything he was doing and personally taking me to a pharmacy, and then sticking around to make sure the pharmacist understood what I needed. We travel extensively, and I have never had anyone do such a thing for me before. Also, Mohammed, the PM host, is wonderfully kind and welcoming, and goes out of his way to make guests feel at home. We can't wait to return next year, and wouldn't think of staying anywhere else in Marrakech. The rooms are beautiful, the breakfasts delicious and filling, the common spaces comfortable and chic, and most of all, the owner and his staff are remarkably professional, kind, charming, and welcoming.", "title": "Stay here---it's heaven!", "user": "didigirl", "date": "March 17, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 26357320}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled with friends", "text": "The location is ideal---a 4- or 5-minute walk from the Djema el Fnaa, with little shops selling mineral water, etc just at the alley to the hotel. Entering the riad from the dusty, chaotic streets is like entering an oasis of calm (and even better, an oasis where you will be served mint tea and cookies, and treated like a dear friend.)", "title": "Best Riad in Marrakech!", "user": "dc1uk", "date": "March 15, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 26197282}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "Superb staff! wonderful Riad - excellent bedrooms, seating areas, outdoor terraces and location. Jean Patrik, Mohammed and the \"girls\" couldn't have been more helpful or friendly. Would recommend to anyone visiting Marrakech and we'll certainly be back! This was a second visit to Marrakech and it beat, the first, more expensive Riad hands down.......", "title": "Lovely place for a romantic getaway", "user": "Caveman_8", "date": "March 15, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 26188332}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled on business", "text": "Staying with Jean Patrick and his 'crew' at Dar Silsila is always a pleasure and fulfilling experience. I have stayed here for leisure and business and I find no matter what I am trying to achieve in my day, life is always made easy staying here. It is an escape from the bussle of Marrakech but holds all the finer details of the Moroccan experience. The architecture is immaculate, the roof garden devine and tranquil. It's location allows easy access to the main souks (if you manange to make sense of the small alley ways), and the modern city. I'll be back soon!! Thanks to all.", "title": "I'll be back!!", "user": "nixiestix", "date": "March 13, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 26114068}, {"rating": 5.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "We spent 3 days in Dar Silsila. Jean Pattrick and Mohammed were really helpful with suggestions of what to see and where to eat to make the most of our short stay.", "title": "Delightful Riad with very friendly staff", "user": "hollingtonb", "date": "March 9, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 25876866}, {"rating": 5.0, "stay_parameters": "Stayed February 2009, traveled with family", "text": "The Riad itself is lovely (as was our room) and it is very well situated for sightseeing.", "title": "Wonderful..............", "user": "Purplespin", "date": "March 9, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 25850846}, {"rating": 5.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "We have already recommended it to two of our friends.", "title": "A great stay in a wonderful hotel", "user": "Samuel100", "date": "March 8, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 25819134}, {"rating": 5.0, "stay_parameters": "Stayed February 2009", "text": "We stayed for a week at the end of February and cannot speak highly enough of this little gem. Only 5 minutes walk from Djemaa El-Fna yet quiet and peaceful. Jean-Patrick and his staff were wonderful - very attentive without being 'in your face'. The ladies who clean the rooms were always smiling and everyone seemd genuinely pleased to look after us. Jean-Patrick emailed us before our arrival to ask if we'd like like an airport transfer and a meal on our first evening (we'd recommend both). He booked several trips for us, including a trip to the Ourika valley and 2 mornings in the city with an official guide. At 200 dh (about 16 GBP) for 4 of us, plus 10dh (80p) each for admission into Saadian tombs, Bahai and Al-Badi palaces on our first morning and a little more for the Ibn Yusef Medrassa (Koranic school) and Museum of Marrakech on the other, this was money well worth spending. Ali told us not only about the places we were visiting but lots of extra information as we walked between them. And as for the beds in the riad - probably the most comfortable in any hotel I've ever stayed in. Thanks once again to you all.", "title": "A wonderful riad in Marrakech", "user": "walterandrea", "date": "March 1, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 25384089}, {"rating": 5.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "We could not have been made more welcome by Mohammed and his friendly staff, or helped any more by the delightful owner Jean-Patrick. Every opportunity was taken to ensure our stay in Marrakech was the best. Many,many thanks.", "title": "A delightful experience", "user": "keenexplorer09", "date": "March 1, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 25367140}, {"rating": 5.0, "stay_parameters": "Stayed February 2009, traveled with friends", "text": "My husband and I have just returned from a short break in Marrakech. We stayed at Dar Silsila where we were really well looked after by Jean -Patrick and his staff. The riad was very clean and beautifully decorated, providing a little oasis in the middle of the dusty medina. Although we only had breakfast at Dar Silsila we could have eaten there in the evening if we had wanted to. The food cooked for other guests certainly smelt and looked delicious and if the homemade biscuits we were offered on arrival were anything to go by then I'm sure it tasted good too. Jean- Patrick's local knowledge was invaluable and helped us to make the best of our trip. I would definitely stay there again if we go back to Marrakech.", "title": "Great host and accommodation", "user": "BerkshireTravelbug", "date": "February 28, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 25332643}, {"rating": 5.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "There's a reason that so many people have given this hotel a 5* rating, and that's because it's quite simply amazing.", "title": "Wonderful, Fantastic, Amazing...", "user": "Bergs", "date": "February 24, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 25099780}, {"rating": 5.0, "stay_parameters": "Stayed February 2009, traveled with family", "text": "Jean Patrick was the perfect host; very helpful, very friendly and intent on making sure we had a delightful stay. He clearly cares about the standards his hotel sets and his staff very much share the same ethos.", "title": "Top marks for service, location, food and charm", "user": "DJP065", "date": "February 22, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 24978977}, {"rating": 5.0, "stay_parameters": "Stayed January 2009, traveled as a couple", "text": "We stayed in the standard room and were more than happy with what it offered - it was clean, definitely large enough for 2 people and very quaintly decorated. The water can be very hot though, so be careful to put the cold tap on before you jump in the shower! The criticism on here from the American customer was frankly ridiculous, why would you not want a room befitting a Riad while in Morocco? The rooms are full of character and perfectly in keeping with the surroundings.", "title": "The place to stay in Marrakesh", "user": "Avenel", "date": "February 21, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 24892566}], "location": {"country": "Morocco", "region": "Marrakech-Tensift-El Haouz Region", "continent": "Africa", "city": "Marrakech"}, "stars": 4, "variance": {"poor": 4, "average": 9, "very good": 54, "terrible": 5, "excellent": 564}, "aka": "Dar Silsila Hotel", "slim_ranking": 0.112334801762, "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.5, "location": 5.0}}