{"user_rating": 3.0, "review_count": 70, "name": "Darwin YHA", "reviews": [{"rating": 3.0, "title": "Fine for a night", "text": "Arrived late, left early- fine for a night though could have taught our dorm mates some etiquette, my goodness. Helpful, friendly staff. To be honest we came here as the place we wanted to stay was booked out. There are a lot clustered around Mitchell St so you shouldn't have any probs finding somewhere to crash. Dorm facilities were fine, concrete bunker style units, clean, 4-beds, bathroom to each dorm, largish kitchen, big shared areas, central.", "user": "NZEmma", "date": "June 22, 2011", "id": 114634371}, {"rating": 1.0, "stay_parameters": "Stayed January 2011, traveled solo", "text": "during my stay at the yha in Darwin i was talked to like im scum by the manager (Dave), i was blamed for a reoccurring bed bug problem which i later discovered was there long before me, the rooms were fumigated but the same blood encrusted mattresses were give back without anyf orm of treatment for the bed bugs and i was told that it was me living in my own filth that caused the problem, and the free wash cycles for my bags and clothes were never given to me i had to pay for this myself costing me $16. me and a friend i made at the darwin yha cleaned up after a small cyclone being told we would recieve a few extra days accomodation but we never recieved even a thank you. the hostel staff did NOT assist in the clean up. upon my departure my friends who visited for a quiet farewell were told to leave for no reason at all and the night i left i was not allowed to stay on the premises between 10pm (when the staff finish) and soon after 11pm when my airport shuttle arrived and was made to wait by the road for the shuttle despite the fact that i had 3 bags and had stayed there fom xmas until february 25th. other than some non senior staff the customer service was unbelievably pathetic and i will never stay at another yha thanks to my time in Darwin. when my food was stolen from the fridge i was condesend too by a senior staff member saying \"thats terrible\" in a blatently sarcastic tone and no effort was made to find the culprit despite a cctv camera very close to the fridge which had the fridge in plain view. the staff in the bar on the same premises were equally rude banning me from service because i was seen talking to a young lady the manager had a crush on, i was told i was barred because i was seen checking other peoples betting slips and was refused the option of seeing the cctv footage to clear my name the excuse for this being (in the mangers words) \"i cant be bothered\" this happening whilst the manager was doing absolutely nothing! this bar is a seperate buisness but on the same premises and is called \"Globies\"", "title": "worst hostel ever", "helpfulness": 1, "user": "conanarmstrong", "date": "May 24, 2011", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 3.0}, "id": 109679150}, {"rating": 1.0, "stay_parameters": "Stayed May 2011, traveled solo", "text": "I came to Darwin thinking the YHA hostel would be good as its part of the YHA system and i have had a good experience so far with them.", "title": "Waste of money", "user": "Mattheww23", "date": "May 7, 2011", "detail_rating": {"service": 2.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 3.0}, "id": 107194873}, {"rating": 3.0, "stay_parameters": "Stayed February 2011", "text": "But i was mislead and should have looked at reviews first.", "title": "Nice and quiet", "user": "Snibbug", "date": "February 27, 2011", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 4.0, "service": 4.0, "rooms": 3.0}, "id": 98169344}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled solo", "text": "This place really needs major renovations!", "title": "Stay away from here, rude staff!! Bad bugs everywhere too!!", "user": "Andreanord", "date": "February 24, 2011", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 2.0}, "id": 97786872}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled with friends", "text": "Stayed here for one night, and one day before flying to Bali. I'm suprised with all the bad reviews, as I found it to be good hostel. It's a converted hotel so each room has its own ensuite bathroom, and the room was clean and safe. the kitchen was small, but there actually is another one upstairs!. There's a nice common room with TV and comfortable couches, and a nice pool and patio area. The location is great with lots of bars and restaraunts nearby and you can walk to Mindil Beach as well. Because of our late night flight, we stayed one night and check out but used the hostel for the day with no day use fee! Good value for the money.", "title": "Good location, good value!", "helpfulness": 1, "user": "lovebeachtravel", "date": "December 5, 2011", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 121440478}, {"rating": 3.0, "stay_parameters": "Stayed November 2010, traveled solo", "text": "I mean really, for a hostel, what else can you expect that it's clean, safe and fills your basic needs such as kitchen, shower and comfortable bed.", "title": "Very plain and basic but no problems staying here again!", "user": "restlessbrit", "date": "September 24, 2011", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 118527160}, {"rating": 1.0, "stay_parameters": "Stayed July 2011, traveled solo", "text": "The staff were very helpful at the hostel which is always a bonus too.", "title": "third world hostel", "user": "Charles G", "date": "September 15, 2011", "detail_rating": {"value": 1.0, "location": 3.0, "service": 2.0, "rooms": 1.0}, "id": 118174142}, {"rating": 4.0, "stay_parameters": "Stayed December 2010, traveled with friends", "text": "I stayed here for 4 nights all in all. the first two nights was in a 4share room which was very plain and basic, had a fridge in the room and a shower and 2 bunk beds, really basically filled my needs for what i was after. the 3rd night i had a double room as i met up with my friend, again just used for sleeping and showering so what else do you need? Went on a trip to Kakadu for 3 days so when we came back I stopped again in an 8 share dorm this time and then set off very early in the morning to get my flight back to sydney,", "title": "friendly, helpful and relaxed staff made the trip", "user": "Trips698", "date": "September 11, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 4.0}, "id": 117930109}, {"rating": 2.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "I really cant think of anything to say bad about this hostel. Overall it was an easy pleasant stay and it served my purpose.", "title": "not up to YHA standards", "user": "Jandy88", "date": "September 9, 2011", "detail_rating": {"cleanliness": 2.0, "sleep": 4.0, "value": 2.0, "service": 3.0}, "id": 117851781}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled solo", "text": "YHA Darwin is a nice place. The rooms were all en-suit, clean and spacious. Staff were good too. The TV room, was a good place to chill out in. The kitchen was a bit small.", "title": "nice place", "user": "Dan C", "date": "August 16, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 4.0, "value": 4.0, "service": 3.0}, "id": 116793215}, {"rating": 2.0, "stay_parameters": "Stayed July 2011, traveled solo", "text": "This hostel is pretty honestly ranked by YHA, 5 star it is not. But clean rooms and bedding, so a good start. Hostel was very open, so often rooms open, and its very easy for anyone to walk around the hostel, which I personaly didn't like. Especially as there is a not very backpackery sports bar downstars with plenty of locals in. Who could look into the pool area that was behind a wooden screen, which was also where the pub and hostel toliets too. Not fantastic when sitting by pool.", "title": "I think this was good by Darwin standards!", "user": "NorfolkTom", "date": "July 31, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 3.0, "value": 2.0, "service": 4.0}, "id": 116056342}, {"rating": 2.0, "stay_parameters": "Stayed August 2010", "text": "Kitchen was small and hot, with very few pots and pans and only 4 terrible gas hobs.", "title": "Service was the only positive", "user": "SgtHatred", "date": "July 30, 2011", "detail_rating": {"cleanliness": 1.0, "value": 2.0, "location": 3.0, "service": 5.0, "rooms": 1.0}, "id": 116015449}, {"rating": 3.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "But rooms did all have en-suits! No lockers in rooms.", "title": "Friendly staff, basic rooms and a very smal kitchen", "user": "BartMarleen", "date": "July 14, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 3.0, "value": 3.0, "service": 4.0}, "id": 115355883}, {"rating": 1.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "Great staff as usual for YHA", "title": "Absolute DISGRACE!!", "helpfulness": 1, "user": "StephandLawse", "date": "June 24, 2011", "detail_rating": {"cleanliness": 2.0, "sleep": 1.0, "value": 1.0, "service": 2.0}, "id": 114698451}, {"rating": 1.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "I stayed at the YHA with my girlfriend her sister and her boyfriend for 4 nights, I really wish I had not bothered!!!", "title": "STAY ANYWHERE ELSE BUT HERE!!!!!!!!! TOTAL DIVE", "helpfulness": 1, "user": "lewis096", "date": "October 14, 2010", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 2.0, "sleep": 2.0, "rooms": 1.0, "location": 4.0}, "id": 83419202}, {"rating": 3.0, "stay_parameters": "Stayed October 2009, traveled with friends", "text": "Where do I start............ the hostel is in the style of a 70's American motel which looks like it has not seen any decor since it was first built!! We stayed in a 4 bed dorm with an ensuite. I would not shower my dogs in this shower! The cleaners come in daily to mop the floors but manage to miss round the door stops and corners every time and there is dirt piling up inces high!! When they do come in they don't bother to knock on the bathroom door they just walk straight in! The kitchen is terribly equipped and is a total sweat box. The staff are all rude any very unhelpful! I went to the reception on the first day to put a $10 deposit down for a kitchen set. I gave the man at reception a $20 note but he claimed that I gave him a $10 note. We argued for a few seconds then he rung his manager who I assume is another room elsewhere on sight to play back the CCTV camera. Who concluded that I was right and that I gave him a $20 note. To make matters worse there was another man hangging around who also claimed that I gave him a $10 note. I belive this to be a scam that they try and pull off on a regular.", "title": "basic - but good craic!", "user": "irishbackpacker101", "date": "April 26, 2010", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 5.0}, "id": 62478487}, {"rating": 1.0, "title": "Booked money from my account but we payed cash", "text": "I have been travelling for the past 6 months round Oz, New Zealand and Asia and I can say that this is by far the worse hostel that I have ever stayed in!", "user": "Nira10", "date": "April 18, 2010", "id": 61852707}, {"rating": 1.0, "stay_parameters": "Stayed August 2009, traveled solo", "text": "I would recommend that if you are to stay in Darwin then stay at Banyan View which is a bout 500m down the road.", "title": "A dump", "helpfulness": 5, "user": "GoannaSydney", "date": "August 4, 2009", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "location": 5.0, "service": 3.0, "rooms": 1.0}, "id": 36666577}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled solo", "text": "Stayed here while working in Darwin, I really got to enjoy it. Definately due a re vamp! not really anywhere to relax in the aircon other than the room. But the pool area is pretty good for meeting new people if you are a solo traveller..", "title": "A good place to stay", "user": "julieboomer", "date": "July 21, 2009", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 35332792}], "location": {"country": "Australia", "continent": "South Pacific"}, "variance": {"poor": 10, "average": 23, "very good": 19, "terrible": 12, "excellent": 6}, "aka": "Darwin Yha Hotel", "slim_ranking": 0.351351351351, "description": "Located in the heart of the Northern Territory's tropical capital, Darwin YHA offers all the essentials you would expect of a YHA, plus air-conditioning in all rooms, outdoor pool, and lively bar that opens out onto popular Mitchell Street in the city's entertainment precinct. The hostel's tour desk can help you find the best tours and travel options to the Top End's Tiwi Islands, Nitmiluk, Kakadu National Park and Arnham Land."}