{"user_rating": 4.5, "review_count": 720, "name": "David Citadel Hotel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "The location of this hotel is amazing- a short walk to the old city and within walking distance to many sights of Jerusalem. The rooms are well-proportioned and impeccably mantained. The decor is nice and modern- definitly on par with other 5 star hotels. The view from the hotel's resteraunts and lounges is unparalleled. Service is what could be expected from a hotel in Israel- adequate but not outsatnding or exceptionally accomadating. Overall, this hotel is beautiful, clean and well mantained with an unbeatable location.", "title": "Incredible Location, Nice Rooms", "user": "Eli7isme", "date": "February 8, 2010", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 55458371}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled with family", "text": "We have just returned from a two-week vacation in Israel; five days spent in Jerusalem, staying at the David Citadel. We found the service of the entire staff to be flawless and our rooms immaculate. The concierge was exceedingly helpful and thorough. This property enjoys a prime location - just a few minutes walk through the adjacent new and fashionable Mamilla Mall to the Jaffa Gate of the Old City. The shops and restaurants on Ben Yaduda and Jaffa Streets are also within easy walking distance. This hotel is definitely worthy of it's 5-star rating.", "title": "Location, location, location and stellar service!", "user": "BarbiG", "date": "February 3, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 55080871}, {"rating": 2.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "At these prices, we expected better! One must not expect the service in Israel to be great, however one shouldn't feel uncomfortable in a (supposed) 5 star hotel. When I asked the manager why there was no clock, ironing board or coffee maker in the room, she told me that the first 2 things are only available upon request. What she fails to realize is that the staff make you feel like asking them a question is a interruption to whatever else they are doing and make it rather unpleasant to interact with them. We opted not to ask them, just to avoid further interaction.", "title": "3.5 star at best", "helpfulness": 1, "user": "Loves_good_things", "date": "January 26, 2010", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "location": 5.0, "service": 1.0, "rooms": 3.0}, "id": 54419042}, {"rating": 3.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "Our room was quite small and had a view of a dirt wall and part of a playground. We were staying for 6 nights, so we asked if it was possible to get a better view. We explained that we didn't need a bigger room, we just preferred not to look at a dirt wall for 6 days! On our first attempt to change rooms the guy at the front desk cut my husband off and told him that we could change rooms for an extra $250/night! We tried to tell him that we would pay a little more for a better view, but they didn't want to listen.", "title": "disappointment", "user": "jaamir", "date": "January 26, 2010", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 4.0, "service": 3.0, "rooms": 4.0}, "id": 54413692}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "After making the same request to 4 different people who clearly didn't care, we gave up.", "title": "Very good hotel.", "user": "Aion", "date": "January 26, 2010", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 5.0, "rooms": 3.0}, "id": 54412179}, {"rating": 4.0, "stay_parameters": "Stayed May 2010, traveled on business", "text": "Let me preface this review by saying that this is the fanciest hotel I have ever stayed in so I don't have anything else to compare it to. I was incredibly impressed. Many of the other reviewers of this hotel seem to be used to luxury hotels but for the average joe this place was awesome. The service was GREAT. The hotel is almost totally run by young Israelis which gives it a cool vibe. Front desk staff is multi-lingual and very helpful. The location is perfect, a ten minute walk to the Old City (ie: Jaffa Gate, Bazaar, Tomb of Jesus). Very safe location. Rooms are furnished nicely. Lots of restaurants and cafes in close proximity. Nightlife starts at 11pm .. get there any earlier and it will be empty. Try to get a local to take you somewhere as the clubs are a little difficult to find. I had access to the Executive Lounge on the 10th floor .. a great place to grab a snack and a soda (or cocktail) during the day. There is one computer and printer up there which was usually available, had no problems using it (except for a paper jam on the last day). Business center downstairs isn't bad but be prepared to pay for the time you use the computer. The huge breakfast buffet is reason alone to stay at the hotel - they have the biggest spread ever. The pool is beautiful, heated and gives a beautiful view of the city.", "title": "Amazing Hotel in the Old City.", "user": "juelles99", "date": "May 8, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 63557130}, {"rating": 3.0, "stay_parameters": "Stayed April 2010, traveled on business", "text": "Cons:", "title": "Not for business-worst Internet ever", "user": "SolaGo", "date": "May 7, 2010", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 1.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 63471565}, {"rating": 3.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "They charge exorbitant prices for things like laundry, minibar, room service (just like every other hotel).", "title": "Gateway to the Old City", "user": "29grapes", "date": "May 3, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 63164098}, {"rating": 3.0, "stay_parameters": "Stayed April 2010, traveled with friends", "text": "The in room-wifi is expensive and you do have to login multiple times during a session .. it's a pain.", "title": "Average hotel in a great location", "user": "NYCBeachLover", "date": "May 1, 2010", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 2.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 62916686}, {"rating": 5.0, "stay_parameters": "Stayed March 2010", "text": "The heater in the rooms didn't work .. even cranked up to the highest setting the air still came out cold. I called downstairs to have it fixed, it worked for two days and then went back to cool air.", "title": "No Complaints here", "user": "Bachacookies", "date": "April 20, 2010", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 62016694}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled with friends", "text": "We checked in to a service of juice and scrumptious brownies. The amenities in the room were very high quality, and the turndown service included some fresh towels and yummy chocolates. A newspaper on the door each morning started the superb breakfast. We don't eat much, but the cereals and fresh fruit- with just a little cheating on the pancakes- made us smile. A huge buffet was popular with everyone.", "title": "Great location, elegant setting.", "helpfulness": 1, "user": "hisim", "date": "May 19, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 64773243}, {"rating": 1.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "One concierge was exceptional, one was somewhat snooty.", "title": "only stay here if you are a celebrity or with a tour group", "helpfulness": 4, "user": "jessieo73", "date": "May 16, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 1.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 64302188}, {"rating": 2.0, "stay_parameters": "Stayed May 2008, traveled solo", "text": "Comfortable beds and pillows, nice darkout curtains - nothing negative except the lack of an alarm clock. I worry about wakeup calls.", "title": "Overrated with poor management", "helpfulness": 2, "user": "dYquem", "date": "May 16, 2010", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 2.0}, "id": 64297122}, {"rating": 3.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "I stayed here with my husband and feel this hotel is a rip off. We were given a small room with no view . We asked for an upgrade as the hotel was only half full aqccording to the bellboy. We were told it would cost more money even though we had stayed here before. We were quite angry as we were paying close to $400 a night. We met people staying here on a tour group and their room rate was half of we were paying. We were told by one of the workers at the hotel that they cater to dignitaries of governments and celebrities and gouge everyon else who is not part of a tour. We will never stay here again and can't wait for the new hotel across the street to get completed and open.", "title": "Great location but disappointing for such a lovely hotel", "helpfulness": 1, "user": "Divas_NY", "date": "May 12, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 2.0, "rooms": 3.0, "location": 5.0}, "id": 64001473}, {"rating": 4.0, "stay_parameters": "Stayed April 2010, traveled with friends", "text": "It's a real shame that this hotel is not a realistic substitute for staying at the overpriced (albeit vastly superior) King David. The main criticisms are: (i) the staff, including senior management, who just seem not to care; (ii) the total (and I mean total) lack of atmosphere in the hotel which, while architecturally interesting, is void of any soul (it feels like being in an aircraft hangar); and (iii) the pool area, which is like Ben Yehudah St (full of loud and obnoxious American students, most of whom aren't even staying in the hotel) only with a small pool in the centre and the most atrocious restaurant (with the rudest staff) in any five-star hotel in Jerusalem. New Yorkers may indeed love this hotel, which is probably why I don't...", "title": "Contemporary oasis in a stronghold of Antiquity", "helpfulness": 1, "user": "Limahuli", "date": "May 11, 2010", "detail_rating": {"service": 2.0, "cleanliness": 5.0, "value": 2.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 63840699}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled with family", "text": "I am astonished by the criticisms leveled against this fantastic hotel. This is, in my opinion, the best hotel BY A LONG SHOT, in Jerusalem. Quite comparable to higher-end US hotel chains, this is a lovely, western hotel in every sense of the word. While this is not a true 5 Star Hotel on the level of the Four Seasons, Ritz, or the St Regis), it is head and shoulders nicer than the “faded beauty” that is the King David (think the Plaza or the Waldorf). Having hosted a group of 50 New Yorkers and Bostonians, I can confirm that all were thrilled. The rooms are clean, spacious, airy, well maintained, nicely air-conditioned and comfortable. The staff could not have been nicer. The pool was glorious and the food delicious. Ok, so maybe the breakfast at the King David is a bit better, but having stayed at the King David many times, I would (and do) take the David Citadel whenever I am the one making the hotel decision.", "title": "THE hotel in Jerusalem", "user": "JMSBoston", "date": "April 12, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 61125508}, {"rating": 1.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "this hotel, although it has a great location is a rip off. I stayed there many times when it was a Hilton hotel but since Hilton left it's a disaster. We asked for a clock in the room and were told there were no clocks. The room was very warm and we asked to have air conditioning and were told it was not turned on yet. We then asked for a fan and were told there were no fans in the hotel. When we complained to the front desk, we were told we could go elsewhere if we were unhappy. Our room was over $300 and was quite small with a view of a back street. I will never stay here again.", "title": "a big waste of money", "helpfulness": 4, "user": "peteramargate", "date": "April 7, 2010", "detail_rating": {"service": 2.0, "cleanliness": 5.0, "value": 1.0, "sleep": 4.0, "rooms": 1.0, "location": 5.0}, "id": 60696412}, {"rating": 4.0, "stay_parameters": "Stayed March 2010", "text": "I just returned from a 9 day tour of Israel. We stayed at The David Citadel Hotel for four nights. First the PROS:", "title": "Beautiful hotel, BUT...", "user": "ToughCritic4Sure", "date": "March 2, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 57569115}, {"rating": 5.0, "title": "Very nice 4-5 star hotel", "text": "1) Location - can't beat its close proximity to the Old City of Jerusalem. Just out the front doors, just to the right you can walk directly to the Jaffa Gate via the Mamillion Outdoor Mall. It's probably 7 minutes (tops) from the hotel to the Jaffa Gate.", "user": "Loretta360", "date": "February 21, 2010", "id": 56699705}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled on business", "text": "2) Rooms - hotel is quite new and well-appointed. It's definitely on the high end of luxury, especially for Israel.", "title": "An A+ Experience", "user": "ViequesVacationer", "date": "February 19, 2010", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 56538121}], "location": {"country": "Israel", "continent": "Middle East", "city": "Jerusalem"}, "stars": 5, "variance": {"poor": 31, "average": 63, "very good": 143, "terrible": 26, "excellent": 457}, "aka": "David Citadel Jerusalem", "slim_ranking": 0.0561797752809, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 5.0}, "description": "The David Citadel Hotel, with a majestic view of the Old City, is within walking distance from the city center and is situated directly across from the Alrov Mamilla Avenue and other major attractions. The hotel boasts 384 impeccably designed suites and guestrooms, fine cuisine, a luxury gym and a holistic innovative spa, year-round heated pool, and private Executive Lounge. The hotel's exquisite modular banquet halls and reception rooms host a variety of social and business gatherings."}