{"user_rating": 3.0, "review_count": 318, "name": "Days Inn Seattle/Sea-Tac International Airport", "reviews": [{"rating": 1.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "We chose this hotel because of its proximity to the airport and the fact that it provided shuttle service. We should have taken the hint that this wasn't going to be a pleasant experience when we called the hotel twice and still waited 45 minutes for a shuttle to come pick us up (less than a 5 minute ride away!). Once we were finally dropped off, our room still wasn't ready, despite calling the hotel two hours earlier receiving confirmation that they would have a room ready when we arrived. The lady manning the front desk said it would be another hour or hour and a half before our room would be ready and that we should go shopping or something (?). My husband was ill so I told her we'd wait in the lobby instead. Within 5 minutes she found us a room. Amazing!", "title": "Noisy and Run Down", "helpfulness": 1, "user": "BabyDuckOhio", "date": "August 20, 2007", "detail_rating": {"front_desk": 1.0, "business": 1.0, "cleanliness": 2.0, "value": 1.0, "rooms": 1.0, "location": 2.0}, "id": 8460292, "likes": {"liked": "— It was really noisy. Like living in a dorm room. The front desk staff was uncaring and never gave us a straight answer. This place has seen better days."}}, {"rating": 1.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "The front desk staff appears to be overworked, at least I would like to attibute her uncaring attitude to this reason. We tried to use the computer in the lobby to check the net and when we couldn't get a connection, she replied, \"it's down.\" Duh! My husband took the initiative and rebooted it. Problem solved.", "title": "Sleepless in Seattle", "helpfulness": 1, "user": "pcchicago", "date": "August 16, 2007", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 1.0, "cleanliness": 2.0, "value": 2.0, "location": 4.0, "rooms": 2.0}, "id": 8435213, "likes": {"liked": "— Nearness to airport", "disliked": "— Shabbiness, noise"}}, {"rating": 2.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "After we finally got into the room, we noticed that our window was open and wouldn't shut, obviously pushed too far from either the maid or the previous guest. The front desk did send someone to fix it. While the maid did the best she could cleaning the room, the wallpaper was coming off the walls and had marks on it as well as the carpet raveling at the seams. This hotel has seen better times in the past...", "title": "Wouldn't stay here again", "user": "tmi007", "date": "August 8, 2007", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 2.0, "value": 2.0, "location": 3.0, "rooms": 2.0}, "id": 8373457, "likes": {"liked": "— free shuttle and close to the airport", "disliked": "— It felt like I was back in college. Dorm room atmosphere and lousy customer service"}}, {"rating": 1.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "We had a 6:45 a.m. flight the next morning. After telling us the shuttle ONLY runs on the hour and half hour we decided to get a wake up call at 3:30 am so we could take the 4:00 shuttle. We arrived at the front desk at 3:50 a.m. to see the same lady who was there the morning, afternoon, and evening when we arrived still at the front desk! The shuttle was gone already! When we confronted her with the rules about shuttle times that she gave us the day before, she said, \"Well, the van was in an accident.\" Ok, but I still didn't see the relevance to the van leaving early. When the van finally arrived, it was the same van as yesterday, with the same dent in the door as yesterday. Any answer to get us off her back, I guess! Thank heavens we planned well and had plenty of time to get thru the airport security, etc.", "title": "Not a 3 star", "user": "jparet", "date": "July 19, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 1.0, "value": 1.0, "location": 3.0, "rooms": 1.0}, "id": 8184179, "likes": {"liked": "— the staff", "disliked": "— dirty hotel"}}, {"rating": 1.0, "title": "Absolutely HORRIBLE!!", "text": "The biggest problem with this hotel is that it's like living in a college dorm room. You can hear every person in the hallway and every door being open or shut. It's EXTREMELY noisy! On top of this, I believe the hotel is situated at the end of an airport taxi way or run up area because all night we could hear loud blasts from plane engines. I expected to hear general take off noise since we were close to the airport, but this was ridiculous! Needless to say, we did not sleep at all... Next time we will pay a few dollars more and get an upgraded hotel!", "helpfulness": 2, "user": "cozywintersnow", "date": "July 3, 2007", "id": 8043645}, {"rating": 2.0, "stay_parameters": "Stayed March 2007", "text": "We booked this hotel as part of a package without reading reviews. This hotel is located close to the airport, on the same street as the airport. The hotel is plagued by parking troubles, so look out if you are going to rent a car/need car parking. The hotel managers/management try to make some extra bucks by offering hotel parking as park and fly/long-term parking. Guests ended up parking their cars in fire lanes and in handicap spots.", "title": "Look elsewhere", "helpfulness": 2, "user": "TXKast", "date": "March 28, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 2.0, "value": 2.0, "location": 4.0, "rooms": 2.0}, "id": 7238000, "likes": {"liked": "— Proximity to airport", "disliked": "— No parking. Smelly rooms."}}, {"rating": 1.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "Rooms are basic. No microwave/refrigerator in rooms. The TV only showed basic local channels (no CNN etc.). Staff is very friendly and go out of their way to make you feel comfortable. Lobby has a computer with internet to use.", "title": "Last Hotel On Earth", "helpfulness": 2, "user": "rorus", "date": "November 29, 2006", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 1.0, "value": 1.0, "location": 2.0, "rooms": 1.0}, "id": 6233175, "likes": {"liked": "— LEAVING", "disliked": "— HAVING TO STAY"}}, {"rating": 3.0, "stay_parameters": "Stayed July 2006, traveled with family", "text": "If you are looking for an airport hotel, there are other options in similar price range.", "title": "it's ok", "helpfulness": 1, "user": "jessy79", "date": "September 1, 2006", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 3.0, "rooms": 3.0}, "id": 5760512, "likes": {"liked": "— wireless internet", "disliked": "— it looks a bit sober"}}, {"rating": 1.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "Smelly carpets, smelly corridors, smelly linen, suspect stains on the headboard. Stayed in Jacuzzi room. Could hear my wife going to the toilet not pleasant. This place needs to be bulldozed it's awful. And just to make sure we stayed another 2 nights here before we went home. uuughaahha. sends shivers down the spine. On the plus it's very close to airport and staff are friendly and shuttle service is grand. But, when you learn what we learned when you get there that is there is about 20 other hotels in short walking distance to this hotel surrounding it. They can't be any worse than this dump. Only that I live so far away in Ireland. I would actually start a campaign to get this hole of a place shut down. AWFUL AWFUL AWFUL AWFUL. Oh! and did I say that this place is AWFUL!! because it is.", "title": "Aweful!", "helpfulness": 5, "user": "Insearchof", "date": "August 31, 2006", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "location": 4.0}, "id": 5731522}, {"rating": 1.0, "stay_parameters": "Stayed July 2006, traveled with family", "text": "You may think how can a place be so bad. Find out at your own Peril.", "title": "Keep on driving!", "helpfulness": 3, "user": "dearsue", "date": "August 15, 2006", "detail_rating": {"front_desk": 3.0, "value": 1.0, "location": 4.0, "business": 3.0, "rooms": 2.0}, "id": 5615148, "likes": {"liked": "— Nothing", "disliked": "— Cleanliness"}}, {"rating": 3.0, "stay_parameters": "Stayed March 2008", "text": "We stayed here 2 nights - once on arrival and night before leaving Seattle. While I wouldn't say it was a nice hotel, it wasn't bad either. I didn't feel unsafe and the room was acceptable - it wasn't dirty or anything. The hallway did stink of smoke, but the room was fine (one side of hallway is smoking, other side non-smoking). It does have free parking, free wireless internet, and free breakfast (toast, bland waffle, 2 types of cereal, juice/milk). It was an acceptable motel if you arrive late into SEA or have an early flight. We didn't use shuttle so can't comment on that. It was odd having them run your credit card and having that be your receipt - can't say I have seen that ever at a motel. If you want something nicer in the area, be prepared to spend at least $40 a night more than this place.", "title": "Acceptable stay near airport", "helpfulness": 2, "user": "robstrash", "date": "March 28, 2008", "detail_rating": {"value": 3.0}, "id": 14608913}, {"rating": 1.0, "title": "Never again if I can help it.", "text": "One of the worst I've ever stayed in. Arrived at 12:00 noon to a desolate hotel with an empty parking lot and was told that no rooms were available until 2pm. Exterior of the hotel is in need of significant repair especially side facing International Blvd. Hotel is also directly under the flight path of SeaTac Airport and rooms appear not to be soundproofed. Room is old and dated. No closet, only a metal bar with hangers. Work desk was a wobbly and squeky table with a chair that was too low to the ground, and didn't contain a phone. Wall mounted aircon/heat noisy. Hotel claims free wofi, but signal is very week and it tool forever to establish a connection. Only pros are in-room microwave and fridge. \"Gym\" was a converted guest room on the first floor with three pieces of equipment, one of which didn't work.Blanket on bed was fraying around the edges and so thin you could almost see through it. Unless you get a very good deal bidding on Priceline, search elsewhere.", "helpfulness": 1, "user": "craig_traveler", "date": "March 9, 2008", "id": 14150572}, {"rating": 4.0, "stay_parameters": "Stayed January 2008", "text": "We needed a one-night stopover near Seattle's Seatac Airport. While this hotel was nothing special, the front desk staff was helpful and courteous, and the place was clean, comfortable, affordable, and more than adequate for our purposes. We had a large group, and the shuttle bus driver made extra trips to accommodate us, which really helped.", "title": "Suitable as an airport hotel", "helpfulness": 2, "user": "Soccer0Team0Manager", "date": "January 30, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 13126054, "likes": {"liked": "— Close to the airport, with airport shuttle and breakfast included.", "disliked": "— Ugly neighbourhood"}}, {"rating": 3.0, "stay_parameters": "Stayed October 2007, traveled solo", "text": "My first visit to a Day's Inn in 25 years. I got this one on", "title": "Whoa Nelly", "helpfulness": 2, "user": "bobemac", "date": "October 26, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 3.0}, "id": 10352470, "likes": {"liked": "— price, location, and service", "disliked": "— na"}}, {"rating": 1.0, "stay_parameters": "Stayed August 2007", "text": "Hotwire, and was upset based on TA's reports.", "title": "They overcharged and tried to get over on me", "helpfulness": 2, "user": "serenajones", "date": "October 23, 2007", "detail_rating": {"value": 1.0, "service": 1.0}, "id": 10246180}, {"rating": 4.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "Stayed at the Days Inn on arrival in Seattle at the end of July 06. It's a cheap airport hotel but our experience was good. Yes, you could hear planes taking off but that’s what you get when you stay minutes away from a runway.", "title": "Suprised by the breakfast", "helpfulness": 2, "user": "fatboytom", "date": "August 10, 2006", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 2.0, "cleanliness": 3.0, "value": 4.0, "location": 4.0, "rooms": 3.0}, "id": 5597010, "likes": {"liked": "— close to airport, breakfast"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2006", "text": "We were welcomed with a warm friendly smile upon arrival although we had to catch a cab (only $5) because the shuttle bus only runs ever 30 minutes.", "title": "Better than expected", "helpfulness": 4, "user": "TravelerFL", "date": "May 15, 2006", "detail_rating": {"cleanliness": 4.0, "rooms": 4.0, "value": 5.0}, "id": 5071506}, {"rating": 3.0, "stay_parameters": "Stayed August 2005", "text": "Room was clean and spacious with all the facilities you need after a 16-hour flight. Unfortunately the TV didn't have all the channels it promised but that’s a minor complaint!", "title": "Servicable", "helpfulness": 3, "user": "richnindy", "date": "September 1, 2005", "detail_rating": {"cleanliness": 3.0, "rooms": 3.0, "value": 4.0}, "id": 3837077}, {"rating": 1.0, "title": "Forget about this one", "text": "Breakfast was great, we went down expecting just a pre-packaged muffin and bad coffee so fresh fruit, pastries, cereal, waffles and juice were a pleasant surprise!", "helpfulness": 4, "user": "A TripAdvisor user", "date": "July 11, 2005", "id": 3658563}, {"rating": 2.0, "title": "terrible service... could work in a pinch", "text": "Would recommend the hotel for those looking for a cheap bed after a long flight rather than travelling straight into Seattle.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "July 11, 2005", "id": 3655374}], "location": {"country": "United States", "city": "SeaTac"}, "stars": 2, "variance": {"poor": 45, "average": 98, "very good": 99, "terrible": 36, "excellent": 40}, "aka": "Days Inn Seattle/Sea-Tac International Airport Hotel Seattle", "slim_ranking": 0.5}