{"user_rating": 1.5, "review_count": 94, "name": "Days Inn Cincinnati East", "reviews": [{"rating": 5.0, "title": "Great Value!!", "text": "Great Hotel. Has everything...Free Breakfast, pool, Restraunt/lounge (Live Bands), Micro/fridge, and the TV's were huge...27\". The staff was very freindly and helpful...The best was the rate....I got a King for only $39 bucks.Good area...lots of restraunts in area and right off the highway....it was only 15 min. from downtown.I'd recommend this place if your needing a place to stay in the cinci area!!", "user": "A TripAdvisor user", "date": "April 28, 2003", "id": 984826}, {"rating": 5.0, "title": "Best value hotel in Cincinnati", "text": "One of the better Days Inn that i have stayed at. Great", "user": "A TripAdvisor user", "date": "April 1, 2002", "id": 495978}, {"rating": 1.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "This Days Inn is one of the worst we have ever stayed at. The room was filthy and smelly, the beds bouncy and the nearby freeway kept us up all night.", "title": "Worst customer service - stay here at your own risk!", "user": "cowlumbus", "date": "July 14, 2008", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "location": 1.0, "rooms": 1.0}, "id": 17865359, "likes": {"liked": "— N/A", "disliked": "— Management, front desk staff, room, amenities"}}, {"rating": 1.0, "stay_parameters": "Stayed May 2008, traveled on business", "text": "The management of this hotel is some of the worst we have ever dealt with. Upon arrival, we were told that our confirmed reservation had been deleted from the system and that no room could be given to us. This franchise operates as a rogue property with no regards to corporate policies, so stay here at your own risk!!!", "title": "All the above is true! Beware", "helpfulness": 1, "user": "ChristineMinneapolis", "date": "June 24, 2008", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 2.0, "cleanliness": 1.0, "value": 1.0, "location": 3.0, "rooms": 1.0}, "id": 17195917, "likes": {"liked": "— Leaving it", "disliked": "— mold"}}, {"rating": 1.0, "stay_parameters": "Stayed June 2007, traveled with family", "text": "I was in town to do a show and arrived very late after driving 12 hours. The worker at the front desk seemed bothered to have to help me. She was busy talking on the phone. We checked in and yes the rooms open to the streets and parking lot. there were seedy folks hanging outside and at the bar.", "title": "sleep in your car", "helpfulness": 1, "user": "greenengineer", "date": "February 29, 2008", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 2.0, "cleanliness": 1.0, "value": 1.0, "location": 2.0, "rooms": 1.0}, "id": 13937359, "likes": {"liked": "— I got to leave eventually", "disliked": "— everything"}}, {"rating": 1.0, "stay_parameters": "Stayed June 2007", "text": "we got to the room and were shoched by the conditions. Very dirty, falling down wall paper, mold growing all over. The beds were shabby,,,,like covered boxes. If it had not been so late...I would have run away. This place should be closed down. I don't think they could pass a heath code. Three out of four lights were broke and the T.V. was out. We ttried to call the front desk....no one answered. I should have gotten every penny back but did not know how to ask. After I checked out...someone else did as well and demanded their money back. I will always read reviews first before booking. Yikes...........", "title": "Don't Stay Here", "helpfulness": 1, "user": "crewmomseattle", "date": "July 3, 2007", "detail_rating": {"front_desk": 2.0, "business": 2.0, "service": 2.0, "cleanliness": 1.0, "value": 1.0, "location": 2.0, "rooms": 1.0}, "id": 8051192, "likes": {"liked": "— nothing", "disliked": "— everything"}}, {"rating": 1.0, "stay_parameters": "Stayed June 2007", "text": "Christine in WI", "title": "Stay somewhere else!", "helpfulness": 2, "user": "MikeDSeattle", "date": "June 27, 2007", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "location": 1.0, "rooms": 1.0}, "id": 8002347, "likes": {"liked": "— nothing", "disliked": "— See notes"}}, {"rating": 1.0, "stay_parameters": "Stayed September 2006", "text": "A block of rooms were reserved for us--we were out of town wedding guests. Several in our party left after the first night, and switched to the nearby Hampton Inn.", "title": "Never have stayed at a worse, more filthy place!", "helpfulness": 5, "user": "MITravelerMI", "date": "October 9, 2006", "detail_rating": {"front_desk": 2.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "location": 2.0}, "id": 5931660, "likes": {"liked": "— Proximity to where we needed to be, but other hotels are, too, and I would recommend those instead.", "disliked": "— Everything--filthy, disgusting, falling down, ill-repaired, nasty! Should be torn down!"}}, {"rating": 1.0, "title": "FILTHY, UNSAFE, SMELLY", "text": "I have traveled extensively, both at luxury inns, as well as staying at budget inns. Let me state this clearly for Days Inn: \"Budget\" does not mean guests should have to reside in filth.", "helpfulness": 1, "user": "fussymom", "date": "May 15, 2006", "id": 5071508}, {"rating": 1.0, "stay_parameters": "Stayed April 2006", "text": "The rooms smelled of some god-awful funk! After the \"cleaning\" crew came through, it smelled as though they sprayed some sort of perfumed cover-up in the room--and they certainly hadn't cleaned it! There were horrible rust stains on all the LAMPSHADES! How the lampshades got wet in the first place, I honestly do NOT want to know. The carpet was frayed, and in some places, bare to the concrete. The bathroom was covered in mildew, including the ceiling. Many walls had had holes punched in them, and there was a patching over them, but the holes were never completely repaired. The sink-stopper was broken, and in the down position. My husband got it to come out, and it was covered with hair and mildew-brown gunk. The blanket smelled horrible, and was filled with holes. We pushed it out of our way, and just used the sheet, which, being white, we hoped at least had been in some bleach recently. There were dust balls and gobs of hair stuck to where they stack up your \"clean\" towels/washcloths, so that when you pulled one out to use, it had dust and hair stuck to it. There were smears of something (again, I don't really want to know WHAT) on the bedside table. There was a gap in the door frame which emitted light from outside, so much so, that it illuminated our room as though we had lights on.", "title": "Beware Please!", "helpfulness": 1, "user": "graymace", "date": "April 24, 2006", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "service": 2.0}, "id": 5003237}, {"rating": 1.0, "title": "Don't stay here even if your life depended on it!", "text": "Why did we stay the 2nd night? Honestly, we were out so much for the wedding events that it might not have been worth the time to complain/switch. But we definitely will be sending on these comments to Days Inn corporate, and hopefully, some travelers will read this/these review(s) before booking, and choose not to stay at the Days Inn East. Horror, horrid, horrible!", "helpfulness": 2, "user": "A TripAdvisor user", "date": "March 28, 2006", "id": 4742248}, {"rating": 1.0, "title": "Hotel should be shut down ", "text": "I was a chaperone with a large high school group booked into this hotel. For starters, our group was required to give a 50% deposit with our initial reservation. When we arrived and saw the deplorable conditions, I understood why. We were locked into this location, as they wisely secured our money up-front. For 20 rooms, we paid $90/night. The rooms all smelled terrible, carpet frayed, filthy bathrooms, one room missing a telephone, several deadbolts didn't work on the doors, a window fell off when an adult opened it, no screens on the windows. It was absolutely disgusting. After several parents inspected their kids room (they were at a different hotel), they wanted to take their kids with them! I will write Days Inn corporate and red flag this hotel. To add insult to injury, the front desk and manager didn't address any of our concerns and wouldn't reduce the rate. There are several clean hotels two exits to the north at Eastgate (Holiday Inn, Hampton Inn, Fairfield Inn). Do not stay at this hotel!!!", "helpfulness": 4, "user": "A TripAdvisor user", "date": "July 8, 2005", "id": 3648594}], "location": {"country": "United States", "city": "Cincinnati"}, "stars": 1.5, "variance": {"poor": 18, "average": 11, "very good": 6, "terrible": 56, "excellent": 3}, "aka": "Days Inn Cincinnati East Hotel", "slim_ranking": 0.92}