{"user_rating": 4.0, "review_count": 1093, "name": "Days Inn Chicago", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed April 2012", "text": "Unlike the 1 to 2 stars all Days Inns are this is a 5 star hotel! Nice area too. Great staff.", "title": "Gets better every time I am here.", "user": "Stampdad1", "date": "April 21, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 3.0, "service": 5.0, "rooms": 5.0}, "id": 128258197}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "I have never written a review while still IN the hotel before but I feel compelled by the nature of the place and the staff, Quite clearly the negative comments of 5 years ago spurred the owners into life and they really have made a silk purse out of a sow's ear! I have never had a hotel room in a capital city at such a reasonable price for such high quality. Sure, it hasn't got a pool...big deal, Lake Michigan is a couple of blocks away if swimming is what you go to a hotel for. I go for comfort, security, friendly staff and access to the main attractions. All these are available without question. From reception greeting me on arrival (thank you, Albert), through to any question I had, be it ever so trivial, I was treated with total courtesy and respect...and the guys on the desk actually know what they're talking about. This hotel should be the flagship of Days Inn, it's nothing fancy to look at but everyone is there for your satisfaction. Rooms immaculate, comfortable beds, adequate breakfast, free wi-fi and buses into town outside your door. I agree, if I had a car, valet parking is expensive but this is a big city....the car is not welcome, there is no space! Come on, try it, for the money you won't be disappointed and if you are then they will want to know about it - they really care!", "title": "This is real value for money!", "helpfulness": 4, "user": "Busmantoo", "date": "April 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 128083545}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "This is a very clean, friendly, well-located hotel. Latasha was extremely patient and kind through many emails as I wanted know all I possibly could about the hotel and the area. We used the valet parking (at $22 a day with in-out privileges it's a bargain here or any other big city) and we were treated wonderfully, which made for an excellent first impression. Check-in was quick and easy and the desk and bell staff were friendly and professional. Our room was a two-queen business class, with a microwave, refrigerator, big closet. and very clean and inviting. We usually do not have housekeeping done when we stay for an extended period of time, except for fresh towels, but this Days Inn insists on cleaning the room after three days, which we thought was an indication of its dedication to cleanliness. The free continental breakfast was fine, no eggs or meat, just pastries, bagels, juice and coffee, and the breakfast area was pleasant. Most of all, we really appreciated the location and the helpfulness of the staff. We normally stay at Marriott properties and have been unimpressed with other Days Inns, but we recommend the Days Inn Chicago. It is in a lovely building in a great neighborhood with a wonderful staff. We did get what we thought was a good deal by booking in advance.", "title": "Great location-great staff-great value", "user": "SYLVIATOPEKA", "date": "April 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127984218}, {"rating": 3.0, "stay_parameters": "Stayed April 2012", "text": "Parking was expensive. No hot tub or pool. Rooms where great.", "title": "Just ok", "user": "Kdann31", "date": "April 13, 2012", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 3.0, "rooms": 5.0}, "id": 127839426}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "Top class hotel in a really vibrant uptown location, close to the L Train. The Days Inn Chicago far exceeded our expectations and the staff were more then willing to go above and beyond to assist you. The room includes a free continental breakfast which is somewhat limited but it's free!", "title": "Great hotel at a great price", "user": "ET8", "date": "April 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 127800686}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "Wonderful arrangement with nearby Fitness Center; Great breakfast offerings; missed having refrigerator in the room; water and ready-made coffee should be available 24/7 -- in the lobby, maybe?", "title": "Wonderful arrangement with nearby Fitness Center; Great...", "user": "Celmia V", "date": "April 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 158989850}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled on business", "text": "Overall, we had a very nice stay at Days Inn. Room was nicely appointed and housekeeping kept it spotless. Comfortable bed with excellent mattress. A small safe was in the closet. Internet connection was important to me and always worked fine. Friendly, courteous staff. Better than average hotel breakfast. Great shops and restaurants within two blocks. Noise was the problem. One night a staff guy was getting ice from guest ice machine down the hall - enough to fill a big cooler - and it was louder than our TV. Hotel is near the corner of busy streets and there was a lot of siren, garbage truck, and car horns. I expected to be able to use guest laundry machines but they were out of service. I had to buy new clothes to last through our stay. I hope these problems will be resolved. I'll try this place again on another trip to Chicago. I recommend you use taxi, bus, and train when in Chicago. Parking is tough to find and when you find it, it's quite expensive. You save money by using public transportation.", "title": "Great value", "user": "Iowan4", "date": "April 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 158961486}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled on business", "text": "Seeing that this is one of the cheapest hotels there is relatively close to the centre, I was expecting it to be only just ok. In fact, it was much better than that. The rooms are big and modern, beds very comfortable, bathroom spotlessly clean and new. OK, so the noise levels are rather high if your windows are facing the busy street outside but other than that there's absolutely nothing at fault with Day's Inn. Perfect location for Lincoln Park. I'd stay here again!", "title": "Surprisingly good", "user": "Applefee", "date": "April 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 158808917}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled on business", "text": "Location, cleanliness, courteous and knowledgeable staff. Price comparable to other lodgings in the area. Breakfast could use some type of protein instead of all carbs.", "title": "Lincoln Park Days Inn", "user": "William B", "date": "April 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 158755419}, {"rating": 3.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "The hotel I thought was in a good location and easy to get to. The rooms were nicely done but the bathroom was extremely small. The lobby and breakfast were great! They do need to work on keeping it more quiet in the halls at night. Both nights we had trouble with loud people in the halls. I did not like the fact that you had to stay nights on the week ends.", "title": "Visiting Family", "user": "Sheryl R", "date": "April 23, 2013", "detail_rating": {"cleanliness": 4.0, "sleep": 1.0, "location": 3.0, "value": 2.0, "rooms": 3.0}, "id": 158632190}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with friends", "text": "We much appreciated the free room upgrade offered on check in. The staff were all very friendly, helpful and professional. The rooms were spotless. We loved the neighborhood with its wide variety of good bars and restaurants. Easy to get around using the mass transit system (CTA) . The location is really good and great value for money. Liked the do it your self breakfast waffles a lot. Hope to return.", "title": "VERY GOOD, CLEAN HOTEL, FRIENDLY STAFF IN GREAT NIEGHBORHOOD", "user": "bris2", "date": "May 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 159634730}, {"rating": 5.0, "stay_parameters": "Stayed May 2013", "text": "I bought reasonsbly priced lodging. I got comfort, very clean room, nice staff, great valet parking, good morning meal. My wife and I were very happy. Trader Joes across the street. Plenty of good eating places in walking distance.", "title": "Great stay st Days Inn Chicago", "user": "Gteam106", "date": "May 3, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 159548528}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "I always feel so welcomed at the Chicago Diversey Days Inn from the curb to my room. The staff is delightful! Great location for shopping, dining, and people watching. Jobs well done!", "title": "Days", "user": "Deb D", "date": "May 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 159430835}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled with friends", "text": "I'm going to rate this hotel a little higher than I normally would just because it is such an outstanding property for a Days Inn. It's a little disconcerting to see ear plugs offered along with the rest of the amenities but we didn't hear any noise even though the property was fully booked. When we stayed, it was over 90 degrees out and humid by our standards. The room was quite small but the air conditioner had a hard time keeping the room cool and dry. It also was positioned so it blew right on me at night which was pretty annoying.", "title": "Best Day's Inn I've seen", "helpfulness": 1, "user": "CouleeCat", "date": "June 3, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 131172870}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "That's about all the negative I have to say though. Bed, pillows and shower were good, large in-room safety box handy and the breakfast had a nice variety.", "title": "Enjoyed our stay", "helpfulness": 2, "user": "04GLP", "date": "June 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 131094014}, {"rating": 5.0, "stay_parameters": "Stayed May 2012", "text": "The location was wonderful for walking to the Cub's game and Lincoln Park with interesting architecture and neighborhood restaurants along the way.", "title": "Great Place to stay in Chicago. Great Restaurants & Stores nearby. Train station 3 blocks away.", "helpfulness": 2, "user": "Rauln702", "date": "May 31, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 131023758}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with friends", "text": "I went to Chicago too see a Cubs game with my girlfriend. We chose the Days Inn because it is close to Wrigley Field. We stayed at the there from May 29 to May 31. The hotel was clean and comfortable. It is in a nice location with many independent stores and restaurants nearby. The complimentary breakfast was a nice touch. It was cool making our own Belgian Waffles.", "title": "Great place to stay!!", "helpfulness": 2, "user": "W B", "date": "May 31, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 131023462}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "The Days Inn staff was great. They were very helpful in giving us directions to the places we wanted to go to, even giving us directions and maps. They also gave us advice on weather it was better to take a cab or the bus. They even told us where to get bus passes at.", "title": "Great hotel and location", "helpfulness": 1, "user": "Dalmas4U", "date": "May 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130923988}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "After a horrible visit to a Days Inn in Philly 4 years ago I swore to never stay at another Days Inn. The Days Inn Chicago has changed my mind. The hotel was clean, the staff was helpful, and the hotel was located near the bus line which made getting around town very easy. Also an affordable place to stay. We will definitely stay here again.", "title": "Pleasantly surprised", "helpfulness": 1, "user": "Adfg10", "date": "April 12, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 127777218}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "Great location (close to metro). Friendly and fast staff. Internet and rooms were great. Breakfast was really nice too.", "title": "Best hotel during our US travels so far", "user": "AJSprietsma", "date": "April 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127663452}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "Wish every hotel had been like this!", "title": "Excellent Hotel!!", "user": "abl1228", "date": "April 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 127618932}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled solo", "text": "We stayed here last week during our vacation to Chicago. We loved this hotel and will defintely stay here again! It was very clean, comfotable bed, LOVED the walk in closets! Staff was wonderful very nice and extremely helpful with everything! We got a great price through yahoo travel! It was in a good location we were able to walk to Wrigley which was our whole point in going to Chicago. Took cabs to the pier and downtown cost about $15.00.Had a bus stop right outside the door even though we never took the bus. Parking is $22.00 a night and the Valet were very nice and got our car quickly also helped us get cabs. Felt very safe. Loved how you have to swipe your key to get on the elevator. I would recommend this hotel to anyone and our next Chicago trip we will be staying here!!", "title": "Great value, great location", "user": "Frances S", "date": "April 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 127610942}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "I spent a great four nights here in March/April 2012. Fantastic value for money, very friendly and helpful staff. My room was just grand for a single traveller. No view and limited daylight but at the price I was paying in a city where hotel rooms are often at a premium I had no complaints about this. The room was spotless and very comfortable and had everything I needed. I loved the location - everything you could need pretty much on your doorstep but also interesting bars restaurants and shops to investigate. I could go for a run in Lincoln Park in the mornings (great views)and the hotel had a deal with a gym next door which (although in need of some upgrading) gave me access to a lap pool, steam room and spa pool - great for the jet lag. All of this made it an unbeatable option for the price. I left some items behind and the housekeeping staff arranged for them to be sent to me in the UK. All in all great stay - will definitely be back.", "title": "Good and Convenient!", "user": "katie m", "date": "April 10, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 127572829}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "My girlfriend and I stayed at the Days Inn Chicago for two nights while on a road trip from Pittsburgh. I read the reviews online first and decided this was a good choice and I am glad i chose this one. The hotel is in Lincoln Park, which is a great neighborhood to walk around in and relax. Most importantly the hotel is close to the elevated train line, the brown line i believe and at least 3 bus routes to downtown run right in front of the hotel.", "title": "Close to downtown and in great neighborhood", "helpfulness": 1, "user": "Pat T", "date": "May 20, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 130298390}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "I booked through Wyndham because i am a Wyndham employee but i would pay full price for this room. The manager who helped me, Neil was very friendly and upgraded us to a gigantic bed on the 4th floor. The room was very clean and the room even included a fridge and microwave.", "title": "We enjoyed 5 days", "helpfulness": 1, "user": "FloridaGator086", "date": "May 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 130075993}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with friends", "text": "The stay included a continental breakfast which was sufficient for starting the day. I would definitely recommend this to anyone looking for a nice hotel in a great area close to downtown. Note: parking in Lincoln Park is not free and street parking is metered. The two choices are valet for $22 a night or park in the garage for $22 a night. I chose the garage but valet looked capable.", "title": "Value and location", "user": "Shelley K", "date": "May 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 129676886}, {"rating": 3.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "We really enjoyed this hotel for 5 nights. We opted for this Hotel about 4 miles from the loop because we wanted a place with good restaurants nearby and a feel of small town. The hotel is well situated and the area that you pass through on the way to the loop is very nice.", "title": "It was fine but...", "user": "Alicia S", "date": "May 3, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 1.0, "rooms": 2.0, "location": 4.0}, "id": 129276480}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled solo", "text": "The lobby is first class as are the desk clerks and bell hops. The maids are hard to communicate with. I understand that they are Polish and do not read or speak English for the most part. The beds are very comfortable and once my wife got the duvet covers made up correctly we had no other problems with the maids. The room is somewhat small but adequate. It had a small refrigerator and microwave. The toilet was installed on a raised 2 inch block that was a toe thumper. Every time you turned around you were hitting a toe on one side or the other.. A very negative point was a severe safety problem due to a lack of any handhold in the shower. If you loose your balance you are a goner. Another needed improvement were the towels and wash cloths which felt like scrub brushes. My wife thought that they would be improved by a fabric softener but I think it was poor quality. In spite of these two things I am glad that we stayed here. There was a nice grocery across the street and a Panera Bread a few doors away.", "title": "Pleasantly Surprised!", "helpfulness": 2, "user": "SoCaArgentino", "date": "April 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 128551247}], "location": {"country": "United States", "city": "Chicago"}, "stars": 2, "variance": {"poor": 27, "average": 131, "very good": 449, "terrible": 22, "excellent": 464}, "aka": "Days Inn Chicago Hotel", "slim_ranking": 0.271084337349, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.0, "rooms": 4.0, "location": 4.5}, "description": "2012 Days Inn Property of the Year (>126 rooms)! This is the third time this hotel has won this award!! Days Inn Chicago is located in the heart of bustling Lincoln Park/Lakeview, just two miles north of downtown Chicago. Guests are within walking distance of dining, shopping and theaters as well as Wrigley Field and Lincoln Park Zoo. A short cab ride will take you to DePaul University, Michigan Avenue, McCormick Place, Millennium Park and Navy Pier. The hotel offers guests free Wi-Fi, a deluxe complimentary breakfast, on site fitness room and free access to LA Fitness next door, valet parking and upgraded bedding. Days Inn Chicago has also been called Rock and Roll Days Inn because it has been a home away from home for many known bands. You can follow us on Facebook at \"Days Inn Chicago\" or on Twitter as \"DaysInnChicago.\""}