{"user_rating": 3.5, "review_count": 472, "name": "Days Inn Maui Oceanfront", "reviews": [{"rating": 3.0, "title": "Great bargain and good location", "text": "This was our second trip to Maui, and we were traveling on a smaller budget this time so we booked the Days Inn. The rooms are on the small side and in need of some updating, but it provided the basic accommodations we needed - a place to shower and sleep. The beds were memory foam and very comfortable. We had some issues with regulating the temperature on the A/C unit. Our options were either freezing cold or an air temperature fan. Most of this didn't bother us though since we didn't spend much time in our room. The property is located right on the beach so it's just steps away from your room. The Days Inn is located at a quiet end of the main strip in Kihei , next to Wailea. Restaurants, shopping, and more beaches are a short 5 minute drive down the street in either direction. For the money, this place is a bargain with a good location.", "user": "HonestAbeChicago", "date": "October 13, 2011", "id": 119270563}, {"rating": 4.0, "title": "A Nice Place with a Great Beach", "text": "This is our second time to stay at this place. The first time we stayed there it was a Best Western. The rooms are very small but the location is great. The rooms are clean. The daily maid service is fair. If you are someone that does not spend the day in the room, it works fine. They have a nice Tempurpedic queen bed in the rooms. They have free high speed wireless internet. They have a great beach!!! For the price, it is hard to beat. We will stay there again if we go to Maui again.", "user": "DJH2010", "date": "September 30, 2011", "id": 118790686}, {"rating": 2.0, "title": "Location, location, location", "text": "The location of this hotel is wonderful. Unfortunately, that's the only thing wonderful about Days Inn Maui Oceanfront. Although the room was clean, it was extremely small, dimly lit, and the furnishings are outdated, including the TV. The biggest problem was that there was no WiFi available except in the hotel lobby.", "user": "fancynanc85", "date": "September 28, 2011", "id": 118713671}, {"rating": 4.0, "title": "Great hotel, fantastic price", "text": "The staff was helpful and friendly, and worked to accommodate our needs. The laundry facility doesn't have a change machine, and surrounding merchants don't want to give change. The machines should be updated to accept cards.", "user": "jmal08", "date": "September 23, 2011", "id": 118492623}, {"rating": 4.0, "title": "Modest price, perfect location", "text": "There's no pool, but the beach area in front of the hotel is one of the nicest in Kihei.", "user": "TanMcK", "date": "September 22, 2011", "id": 118467157}, {"rating": 3.0, "stay_parameters": "Stayed September 2011, traveled solo", "text": "If you want a decent, no-frills hotel right on a gorgeous stretch of Maui coastline, this is the place for you. The rooms are small, the bathroom tiny, The A/C didn't work great, but the beach is priceless. The price is awesome for the location.", "title": "Hotel: C+, Beach:A+", "helpfulness": 2, "user": "KSchmidt", "date": "January 1, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 122358982}, {"rating": 1.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "I'd take all the good reviews on this place with a grain of salt. My wife & I have done a decent amount of travel; we expect to get what we pay for, and nothing more, are generally happy with our accommodation as much of it is researched on TripAdvisor, but Days Inn would have to rank as one of the worst places we've ever stayed.", "title": "One of our worst experiences ever", "helpfulness": 9, "user": "tcdev", "date": "December 31, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 1.0, "sleep": 2.0, "rooms": 1.0, "location": 2.0}, "id": 122340975}, {"rating": 4.0, "stay_parameters": "Stayed December 2011", "text": "I won't bore you with the details of our experiences with water running into our room under the adjoining door and soaking a laptop bag and a camera bag. To be fair, that was probably a spill or wet swimming gear left by the occupants, but did nothing to endear the place to us.", "title": "Best value", "user": "Saltek", "date": "December 31, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 122337194}, {"rating": 3.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "As others have said, small and 'cozy'. Well, that's an understatement, as I can only think of two rooms I have ever stayed in that have been smaller. You have to move the table to open the window! The room was as dark as a dungeon, and smelled the part! The bathroom fan roared like a jet engine, and the AC wasn't much better. Thankfully in December there's little need for it at night. The walls are paper thin, and our bed head was under the wooden staircase, and we heard every stomp of people going up and down day and night. It was simply unpleasant to be in, and completely unsuitable for a 'base' for a beachside holiday. You can't eat a meal in there. You can't even open a beer. This place is an overnight truck stop, and nothing more. After 3 days we couldn't wait to leave, and even considered leaving earlier! I pity the poor guys we heard checking in for an 8 night stay!", "title": "Comfortable but small", "helpfulness": 4, "user": "Hola4876", "date": "November 23, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 2.0, "location": 3.0}, "id": 120974032}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "The service was friendly enough, to a degree, but three things really stood out from our stay:", "title": "Dated hotel at good beach in S. Kehei", "helpfulness": 2, "user": "Harry S", "date": "November 21, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 120892404}, {"rating": 3.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "The location cannot be beat. The beach area was great. Unfortunately, the front office staff was indifferent, almost whiny that they had to do something though we were staying only one night. Room is TINY, old, and totally uninviting. Almost no lighting to read by. We booked via Expedia and the staff made it clear that \"those rooms\" were the worst ones; that should have been in the ad!", "title": "Great Location", "user": "Gl0bal_guru", "date": "September 14, 2011", "detail_rating": {"value": 4.0, "location": 5.0, "service": 2.0, "rooms": 2.0}, "id": 118118994}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "Great Location. Very close to south Kihei beaches, restaurants on kihei road and also a convenient location to other attractions in east and west maui. Cannot connect to the internet from the room. have to go to the lobby for internet access. Also no ocean view from the rooms but once you are at the parking lot you can get beautiful views of the ocean. The room was small but has all the necessary amenities including microwave and refrigerator.", "title": "Great Location and decent stay", "user": "APLuvTrav", "date": "September 7, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 5.0}, "id": 117808545}, {"rating": 3.0, "stay_parameters": "Stayed May 2011, traveled solo", "text": "It was a good deal in that the motel is right on the beach. I did not have a view of the beach...but who needs a view when you're outside on the beach most of the time??? The evening receptioninst behind the front desk is very friendly and helpful. If I'm traveling by myself again and don't plan on being in my hotel very much this is a really good deal. This is a great place to stay if all you need is a place to stay for the night or a few nights. The internet access isn't very good. The rooms are small but clean.", "title": "Reasonable...great friendly staff!", "user": "Brenda W", "date": "September 7, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 3.0, "value": 3.0, "service": 3.0}, "id": 117780659}, {"rating": 3.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "My daughter and I chose to stay at the Maui oceanfront due to the price. Once we arrived, we found the hotel staff to be friendly. The room, however was extremely small and outdated. After the toilet overflowed and people woke us in the night partying at 2Am we chose to leave for a more quiet, spacious room at the hotel next door. This hotel is situated on a beautiful beach that has a great snorkeling reef. If budget is your main concern and you will spend all of your time outdoors then this is the place for you. If you like to stretch out and relax, like to take baths, or swim in the pool go somewhere else. Not very comfortable at all but decent for the price.", "title": "Ok for a short stay", "user": "LUVMEXCalifornia", "date": "September 2, 2011", "detail_rating": {"cleanliness": 2.0, "sleep": 2.0, "value": 5.0, "service": 5.0}, "id": 117568019}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "We just returned from our honeymoon on Maui and, after paying for a large wedding, we were on a strict budget. I was a little skeptical going in but the Maui Oceanfront met and exceeded all of my expectations. Here is the real deal~ The beds are SO comfy, absolutely wonderful, there is an amazing beach just in front of the hotel and is one of the only places you can stay in Kihei where you don't have to cross the main road to get to the beach. There is a big resort next door that offers concierge services if you need them and they also have a wonderful restaurant. We were not able to try Sorentos but heard great things. The rooms were clean and cozy. I was expecting them to be smaller based on all the reviews I read but they were definately sufficient. We did not spend much time in our hotel room but what time we did spend there was great. There were a few minor issues (and I mean very minor). Housekeeping was slow and a couple of days our room didn't get cleaned until 4pm but it was very clean when they did get to it. The front lobby area was very tiny but sufficient and they seem to have some drainage issues in the walkways between buildings. There was always standing water in our hallway which proved dangerous considering I almost slipped twice but I quickly figured out how to avoid it. The parking is limited but there is a lot behind the hotel that had plenty of parking and we only had to use it one night. All in all, the hotel itself is amazing! It is very cute, clean and perfect if you are on a budget and just want a nice comfortable hotel without all of the frills.", "title": "AMAZING hotel with great beds in an awesome location!", "helpfulness": 2, "user": "Idahocouple_05", "date": "August 2, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116188778}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "We recently returned from our 2 week vacation in Maui . We absolutely enjoyed every aspect !", "title": "great value for the price!", "helpfulness": 2, "user": "melissa j", "date": "November 17, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 120715382}, {"rating": 4.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "Our stay at Maui Oceanfront was exactly what we hoped for we booked a Oceanfront Suite and we had a beautiful view from our suite and Lanai . The rooms are small but they were clean and had 2 bathrooms which my husband loved . We were extremely happy with how close we were to a excellent beach ! and to a lovely restaurant ! With the savings of our room booking we were able to stay twice as long ...2 weeks for the cost of 1 at other hotels ! For travellers spending the majority of there visit on the Beach this was a great deal .", "title": "Good hotel for a good price.", "helpfulness": 2, "user": "kurzew", "date": "November 17, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 120698891}, {"rating": 1.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "We have stayed one day in Days Inn. It was the only one hotel in the area with free rooms that night. Staff was very kind and helpfull. Parking was free. Our room was small but very clean and tidy. Bathroom also. Fridge in the room was a nice bonus. I would not stay there for a long period of time but for one night was perfect. No free Wi-Fi in the room. Days Inn is situated 20 minuted walk from Kihei town center and just few minutes walk from the beach. Accesible from the main road.", "title": "Not Recommended", "helpfulness": 6, "user": "Jack S", "date": "November 5, 2011", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 1.0, "sleep": 2.0, "rooms": 1.0, "location": 4.0}, "id": 120199667}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled solo", "text": "We chose this hotel because of it's location and price. We knew it wouldn't be very nice, but it was worse than we expected. Tiny rooms and bathrooms. Old decor. Small stairways. No elevator. Poor lighting. Slippery sidewalks on grounds. My wife slipped and fell and I almost did many times. Tiny parking lot. Noisy AC unit. Peeling shower walls. Housekeeping did a poor job of restocking supplies. Crappy old TV. We were so disappointed we left this hotel with 4 days remaining in our 9 day stay and moved to the Maui Coast, which was divine. Of course they offered no refund for our remaining pre-paid nights. I'm sure Scott their GM will come on here and apologize and tell us how sorry he is that we didn't enjoy our stay, blah blah blah....Scott, you had a chance to make it right and you passed. Don't bother. You didn't even ask why we were leaving early. The bottom line is that although this place is cheap and on the beach, it's not worth it. Spend a little more and stay at the Maui Coast.", "title": "Good value", "helpfulness": 2, "user": "MuttToronto", "date": "October 25, 2011", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 5.0, "sleep": 5.0, "rooms": 2.0, "location": 5.0}, "id": 119709075}, {"rating": 3.0, "stay_parameters": "Stayed October 2011, traveled with friends", "text": "It is what it is. I stayed here for a week in October. If you are looking for a resort type of holiday this is not for you. If you want a basic, affordable but clean room with a very comfortable bed on a great beach and are the type that wants to explore this place is perfect.", "title": "not much of a complainer type...but better properties in the area", "helpfulness": 2, "user": "travelman45", "date": "October 18, 2011", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 2.0, "sleep": 1.0, "rooms": 2.0, "location": 3.0}, "id": 119454951}], "location": {}, "stars": 2.5, "variance": {"poor": 63, "average": 121, "very good": 176, "terrible": 41, "excellent": 71}, "aka": "Days Inn Maui Oceanfront Hotel", "slim_ranking": 0.666666666667, "detail_rating": {"service": 3.5, "cleanliness": 3.5, "value": 3.5, "sleep": 3.5, "rooms": 3.0, "location": 4.5}, "description": "Set on a splendid stretch of sand 2 miles from Kihei, this low-rise hotel is 3 miles from the championship golf courses of Wailea Resort; Maui Ocean Center is 8 miles away.With louvered shutters, tiled floors, ceiling fans, and island accents, all 87 guestrooms offer compact refrigerators, complimentary local calls, premium channels, coffeemakers, and in-room safes."}