{"user_rating": 3.0, "review_count": 224, "name": "Days Inn Hampton", "reviews": [{"rating": 1.0, "stay_parameters": "Stayed August 2004", "text": "Had the misfortune to stay at the Day's Inn in Hampton, Va. I don't know how they got a AAA rating! Room was dirty, including the bathroom. Filthy carpet, bad smell, and the outside wasn't much better. Do yourself a favor, stay somewhere else...", "title": "Will not stay there, ever again", "helpfulness": 6, "user": "outtatown", "date": "September 27, 2004", "detail_rating": {"cleanliness": 1.0, "value": 3.0, "rooms": 1.0, "service": 2.0}, "id": 2602832}, {"rating": 2.0, "title": "Won't stay again!", "text": "Recently stayed here 3 nights. Moved here from across the street hoping for improvement, and it was a speck better but still would not stay there again. The room LOOKED nice with the new furnishings (no table typically found in motel rooms though)but there was a smell about the whole place we found very unpleasant. Also the carpet was so dirty our feet/socks were practically black! On a positive note we found the micro and fridge a convenience, they do offer a continental breakfast and the staff was pleasant enough. Would stay somewhere else next time though for about the same price...Extended Stay. They have full kitchens, a recliner and don't smell!", "helpfulness": 2, "user": "A TripAdvisor user", "date": "July 11, 2004", "id": 2289086}, {"rating": 1.0, "title": "Horrible Experience", "text": "This place is not safe to stay, I was told that it is newly renovated under new management. The room looked old, the headboard fell on my head and the sink faucet was leaking. It is a motel so the rooms are open to outside, there was lot of activity around motel at night I could hear people cursing from my room.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "June 29, 2004", "id": 2228416}, {"rating": 4.0, "title": "Bang for the buck", "text": "I was here for a friend's wedding. Real good service - the new management wants to make you happy. Very accommodating. And they're newly renovated too. Pretty good rates, and a very nice Days Inn.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "December 8, 2003", "id": 1510811}, {"rating": 1.0, "title": "Disappointed", "text": "The outside looks okay, but our room was very uncomfortable. The carpet was dirty, the walls were dirty, the room had an odor and the bedding looked old and unclean. There was no matress cover, just a thin sheet on one bed. The pillows had stains and were so bad that I went to Target just up the street and bought new pillows to sleep on. Then there were the late night parties in the parking lot. The first night of our 2 night stay we had to call the front desk because at 2 AM someone was blasting music from the jumbo speakers in the trunk of their car and partying in the parking lot. I could not believe this was allowed to go on where people were trying to sleep! I will never stay there again. There were so many hotels in the area that you would think they would be a little more competitive but I guess they are the least expensive and don't have problems getting business because of the price, but I would rather pay extra for a clean, comfortable room.", "user": "A TripAdvisor user", "date": "June 28, 2006", "id": 5407061}, {"rating": 1.0, "title": "Cheap--unsafe--terrible", "text": "Constant trouble with access to rooms-had to go to desk frequently after attempted entries---overheard cleaning staffer say \"they can't afford to fix system\"--and----Desk gave permission for us to take breakfast tray to room of ill 87 year old with us but we were literally screamed at by some jerk who kept saying he would not allow it!!! Desk said he was night auditor???? He would not render his name except to say he was the BOSS!!!!!! Apparent homeless people hanging around --walking in and out, perhaps doing chores for a meal or two -seemed to be friends of obnoxious woman setting up breakfasts-- Very noisy at night --Days Inn merely sent routine form letter to us after we complained. Hope never to stay at Days Inn again if they have franchises like Hampton in the system. So much for a convenient location.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "April 2, 2006", "id": 4828428}, {"rating": 2.0, "stay_parameters": "Stayed October 2005, traveled on business", "text": "This is not a fancy hotel. If you are looking for a place to sleep for a cheap price, stay here. If you're looking for a nice hotel, this is not it. We recently moved to the area and needed somewhere to sleep the night before we could get into our apartment. We stayed here because the rate was $50/night. (We had previously stayed here for a week while researching the area). It is close to everything but is in a heavily commercial area. Go in knowing this. There is a refrigerator in each room. The rooms are rather small. We never had a problem but it is truly more of a motel. If you want a good rate on a room, this is it.", "title": "Not a hotel, more like a motel", "helpfulness": 1, "user": "chrelaine", "date": "December 4, 2005", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "rooms": 2.0, "service": 2.0}, "id": 4161249}, {"rating": 1.0, "stay_parameters": "Stayed November 2005, traveled on business", "text": "The hotel is surrounds by lots of places to eat and things to do. Most of the staff where helpful and friendly. As far as a place to sleep, don't count on getting any and the rooms smell horrible and keep on your shoes. We bought plug-ins just to get through our stay. They are cheap enough. But you get what you pay for.", "title": "Will never stay here again", "helpfulness": 2, "user": "elierkaya", "date": "November 15, 2005", "detail_rating": {"cleanliness": 1.0, "value": 3.0, "rooms": 1.0, "service": 2.0}, "id": 4119077}, {"rating": 5.0, "title": "I really liked this place!", "text": "I've seen some bad reviews for this place, and I can't understand why...", "helpfulness": 3, "user": "A TripAdvisor user", "date": "August 22, 2005", "id": 3795601}, {"rating": 2.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "Do not expect too much of this motel. Be prepared for a major headache upon arrival, as you will not be able to open the room doors - guaranteed! In fact, their lock system is so broken that they need to send up a maintenance person whenever someone checks in... The matresses were cheap, the beds squeaky, and the shower tub has seen better days. It was ok for a one-night stay, but I would not recommend this place for anything more than that.", "title": "Below average", "user": "cowlumbus", "date": "September 6, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 2.0, "cleanliness": 1.0, "value": 2.0, "location": 1.0, "rooms": 2.0}, "id": 8664740, "likes": {"liked": "— Free continental breakfast", "disliked": "— Quality of room"}}, {"rating": 1.0, "stay_parameters": "Stayed June 2007, traveled with family", "text": "This hotel is the WORST hotel I have EVER stayed in. It is FILTHY, it seems to be located next to the projects and there was pretty much nothing available for the breakfast. Do not stay here, it is awful.", "title": "Beware", "helpfulness": 1, "user": "dupont_cs", "date": "July 30, 2007", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "location": 1.0, "rooms": 1.0}, "id": 8261468, "likes": {"liked": "— Nothing", "disliked": "— The Neighborhood"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled with family", "text": "My family and I enjoyed our stay at Days Inn Hampton. The front desk staff were very nice and atentive to my requests. The entire staff made us feel very welcome and comfortable. Both of our rooms were clean and the showers hot. The continental breakfast was outstanding. My children enjoyed the fresh hot waffles. We will definetly stay at this above average Days Inn when we return to this location.", "title": "Above average", "user": "kbkc1", "date": "December 10, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 6357842, "likes": {"liked": "— staff", "disliked": "— exterior property"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled on business", "text": "Days Inn in Hampton, VA, at first glance, was an expensive hotel. Water fountains in the lobby, a meeting room, breakfast room, the people at the frontdesk were friendly and cheerfull. The outside of the property was beautifully landscaped and clean. The rooms were clean and spacious, and included a micro-fridge, (which can really cut back on going out to eat). The housekeepers come every morning to clean your room, and they are courteous, giving you towels, soap, whatever you want. You can really have a $100. stay for under $100. here. The location is convenient to food, shopping and entertainment, but is a quiet and peacefull stay.", "title": "Comfortable living away from home !!", "helpfulness": 1, "user": "Rutledge05", "date": "December 2, 2006", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 6317140, "likes": {"liked": "— staff"}}, {"rating": 1.0, "stay_parameters": "Stayed August 2006, traveled with friends", "text": "Please don't stay here unless you want your car towed!", "title": "Days Inn Hampton towed our car!", "helpfulness": 4, "user": "oceanman7", "date": "September 27, 2006", "detail_rating": {"front_desk": 3.0, "service": 1.0, "cleanliness": 2.0, "value": 1.0, "rooms": 1.0, "location": 4.0}, "id": 5881842, "likes": {"liked": "— Days Inn Hampton is in close proximity to Hamptom Coliseum.", "disliked": "— Days Inn Hampton has the worst customer service that I have ever delt with."}}], "location": {"country": "United States", "city": "Hampton"}, "stars": 2, "variance": {"poor": 48, "average": 59, "very good": 41, "terrible": 46, "excellent": 30}, "aka": "Days Inn Hampton Hotel", "slim_ranking": 0.592592592593}