{"user_rating": 3.5, "review_count": 621, "name": "Days Inn Hollywood/Universal Studios", "reviews": [{"rating": 3.0, "title": "Convenient location, nice accomodations", "text": "I checked out of this hotel yesterday (4/6/2007) after a wonderful five day stay. The room is on the small side, but it was very clean, the maids did a great job, they even cleaned my coffee pot each morning. The pool looked nice and it's heated, but i didn't go swimmming because the weather was too cool. There are sliding glass doors in the rooms on the first floor that face the pool, but you can't access the pool from the room because there is a planter with flowers right in front of it, and there is a sign that says you can't jump over the planter, you must access the pool from a hallway door. If I stay here again, i would stay on the second floor so i could sit on a chair on the balcony facing the pool..", "user": "jacal", "date": "April 8, 2007", "id": 7294804}, {"rating": 1.0, "title": "Stay Away", "text": "The continental breakfast consists of pre-packaged pastries, bagels, toast, cereal, oatmeal, and fruits. which was enough for me, I was happy with it.", "user": "A TripAdvisor user", "date": "July 10, 2006", "id": 5448929}, {"rating": 2.0, "title": "Not a nice hotel...would not recommend", "text": "The staff is very nice and helpful, one employee even looked up locations on the internet for me when he didn't know the directions.", "user": "A TripAdvisor user", "date": "June 27, 2006", "id": 5394627}, {"rating": 3.0, "stay_parameters": "Stayed May 2006", "text": "There is garage parking at a $5.00 a day fee.", "title": "Not bad at all", "user": "jess98ac", "date": "May 31, 2006", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "rooms": 3.0, "service": 4.0}, "id": 5288138}, {"rating": 4.0, "stay_parameters": "Stayed March 2006", "text": "There is no access to the garage, elevator, or hallways without a keycard.", "title": "Great location- but don't leave things in your room", "user": "flyingkiwis", "date": "March 28, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 3.0}, "id": 4739414}, {"rating": 3.0, "stay_parameters": "Stayed March 2005", "text": "My Husband and I stayed two nights last March. We paid 50.00/night and were happy with it.It was a standard hotel room, nothing fancy but our room was clean (bug free :O), the pool was nice. Parking was good. It is close enough to walk to Hollywood Blvd- actually closer than we had thought...I would guess about 5 minutes or so and we felt safe. The staff was very nice and helped us figure out the evening hotspots and other must see areas and also the places to avoid. Really good experience- We enjoyed our stay and the budget price. We are intending to stay again this spring :O)", "title": "Good stay at the Days Inn", "user": "zoey9797", "date": "January 8, 2006", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "rooms": 3.0, "service": 4.0}, "id": 4332185}, {"rating": 3.0, "stay_parameters": "Stayed December 2005", "text": "~Zoey", "title": "Clean and Comfortable", "user": "jlowry24", "date": "December 13, 2005", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "service": 4.0}, "id": 4237968}, {"rating": 4.0, "stay_parameters": "Stayed August 2005", "text": "I stayed at this Days Inn for one night last week and thought it was fine, especially given some of the negative reviews here. The clerk at the front desk was friendly and helpful, even after I somehow managed to lose my room key before getting to the room. The room itself was small-ish but clean, with a fridge, microwave and coffee maker. The only problem I had was with noise. The window from my room looked out on an internal hallway, so I was woken up a couple of times by people talking as they walked by. If you're a light sleeper request a room at the back of the hotel I guess. I had to leave early so didn't have a chance to check out the pool or continental breakfast, but overall I would recommend this hotel if you're looking to stay for one or two nights in the Hollywood area.", "title": "Excellent location and accomodation for the cost!!!", "user": "sh204", "date": "October 12, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 3.0}, "id": 4018134}], "location": {"country": "United States", "city": "Los Angeles"}, "stars": 2, "variance": {"poor": 38, "average": 152, "very good": 288, "terrible": 41, "excellent": 102}, "aka": "Days Inn Hollywood/Universal Studios Hotel", "slim_ranking": 0.316293929712, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.5, "rooms": 3.5, "location": 4.5}}