{"user_rating": 4.0, "review_count": 395, "name": "Days Inn Biltmore East", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "We stayed at this hotel, along with 10 others, during April 2012 as part of a 17 day road trip across GA, NC, SC. By giving the star rating I am not saying the hotel is a 5 star but whether it was clean and value for the money and to an extent we have compared then to the other 10 hotels we stayed at.", "title": "One king is better than 2 queens", "user": "Globe-spanner", "date": "May 3, 2012", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "location": 3.0, "value": 5.0, "rooms": 5.0}, "id": 129284529}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "Unlike some others this Days Inn was more like a proper hotel were you park as near the reception as possible and take your luggage through the reception to a lift to your room. This felt much safer to us than the motel types were your room door is accessible to all from the street.", "title": "capitol travels", "user": "Sr M", "date": "May 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 129206078}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "On arrival we were allocated room 104 which was, as requested, a one king size bedded room. having this instead of 2 queen sized beds. This gave a lot more space in the bedroom.", "title": "good value on short notice", "user": "mouskamouse", "date": "April 27, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 128724189}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "The room was clean, clean towels, lots of hot water and seemed well maintained. Unusually for this price range there was a safe in the room.", "title": "Nice, Friendly Clean Stay!", "user": "christine h", "date": "April 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 128522321}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "The included breakfast was good with the usual offerings of cereal, toast, waffles, fruit, yogurt and coffee.", "title": "Great hotel for the price", "user": "mntbikebabe", "date": "April 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 128486996}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "I was definitely impressed with my stay at this hotel. It is clean and pet friendly. I would recommend this hotel to anyone for a comfortable stay.", "title": "Great Place...Great Price", "user": "cara j", "date": "March 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 125489253}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled solo", "text": "I frequently stay at Days Inn and although most are pleasant, the Days Inn Biltmore East is by far the nicest I've had the pleasure of visiting. The rooms are spacious, clean, and well decorated. There are many choices offered for breakfast, even waffles! All the food was fresh. I would definitely stay there again when I'm in the area.", "title": "Days Inn Biltmore East", "user": "Sharon728", "date": "February 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 124542221}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled with friends", "text": "Days Inn was very conveniently located, with a clean room, good mattress and decent quality bed linens, Continental breakfast was decent, and the fresh Belgian waffles took it up several notches from the usual freebie breakfast! To top it all off, I got the room for under $50/night!", "title": "Great place for an awesome price!", "user": "Marcia B", "date": "February 6, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124228703}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled with family", "text": "We stay at this hotel frequently when we visit family in the area......it is a clean & comfortable hotel in a convenient location. It is close to Asheville, the Biltmore House and the Blue Ridge Parkway. I like the fact that it is on several levels with quiet rooms. They also have a great breakfast!", "title": "Good value & great location", "user": "Marsha J", "date": "February 6, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 124224637}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled with family", "text": "Great location for many sight seeing destinations and for visiting a Warren Wilson Student. Everything you could ask for in an INN. Clean, Quiet and Convenient! Outstanding breakfest. Much better than at the INN we stayed at in KY on our way home.", "title": "Warren Wilson Drop Off", "user": "David H", "date": "January 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 123808918}, {"rating": 3.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "Extensive exterior construction, but did not interfere with visit except for a few lost parking spots. Very good breakfast. Clean room with no problem areas at all. Biggest problem, and it is a cause for concern, make sure to get a room that faces the road. The rear of the motel is less than 100 feet from a well used railroad track, and even though the train itself is not a problem, the engineer lays on the horn as he passes two motels, all night, and all morning long. The management is aware of the problem, and there is no reason for the train horn because there are no crossings within a mile of the motel. Well priced, and I would stay there again though.", "title": "Good Days Inn", "user": "Arsenal-PA", "date": "April 19, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 2.0, "rooms": 4.0, "location": 4.0}, "id": 128200205}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "Biltmore East has been our choice hotel for many visits to Asheville ( 3 or 4 times a year for the past 5 years or more). We have never been disappointed with our room, service or cleanliness during any stay. This April the hotel is undergoing outside and inside renovation with little or no inconvenience to guests.We have sent several friends to this hotel and all were very satisfied with rooms and price. We will continue or visits to Asheville (we have season passes to Biltmore) for many years to come and will continue to stay at Days Inn East.", "title": "Great Value in Asheville", "user": "DianaJ1943", "date": "April 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 128168348}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "My wife and I stay at this Days Inn every year....From Check in to Check out the personnel that work their are always friendly, courtious and professional...if we need something they are always eager to please the customer....I highly recommend to anyone visiting the Asheville NC area to stay at this hotel....", "title": "Our Stay at the Days Inn Biltmore East", "user": "Stephen S", "date": "April 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 128021621}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled solo", "text": "This Days Inn was good for an overnight stop. Clean, a pretty good bed, efficient and pleasant check in, and good breakfast in the morning with lots of choices. Room size wasn't huge, but it wasn't pokey either. The TV was quite good, being a newer widescreen LCD model with a wide selection of channels, but the guide provided was out of date so just had to scroll through all the channels. The aircon/heater system was acceptable. Security seemed fine.", "title": "Pleasant night's accommodation", "user": "Boxing_Kangaroo", "date": "April 12, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 127707690}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled solo", "text": "On the downside it was a fair drive into downtown Asheville, although it was right at the turnoff from the expressway and also just a short skip to the Blue Ridge Parkway and near Biltmore Estate, so good for those things. The sink plug in my room was faulty, needing to be chocked open, which was annoying. The shower was OK, but had a bit of a strange showerhead so wasn't the best I've had recently. They are currently going through a refurbishment so there is a bit of work going on.", "title": "Great place to stay", "user": "Jay P", "date": "April 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127561168}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "This Days Inn was superb! The room was clean and large, and had a refrigerator, microwave, coffee maker, flat screen TV AND the wireless internet connection was strong! I got the AAA discount which lowered the bill to $62 per night. Nice and close to the Biltmore Estates which is a great sight to see! The area is convenient to highways, gas stations and restaurants, not to mention the beauty of Asheville! Highly recommend!!", "title": "visit to Asheville", "user": "kathy p", "date": "April 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127381924}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "By husband accidentally booked this Days Inn on Tunnel Rd. We had previously stayed twice on the Tunnel Rd. Days Inn and liked it for its easy access and convenience to downtown Asheville. This particular property is about 4 miles further from the downtown. That said, it is very convenient to the Folk Art Center and Blue Ridge Parkway. Our room was very clean, looked like it had been recently painted and the bathroom was nicely tiled and clean. The flatscreen tv was nice, and the room had a microwave and fridge. We also had lots of choices at the complimentary breakfast, although I do not recommend the hardboiled eggs as they had absorbed water and were watery and shrunken. My first complaint was that I could not get any Wyndham rewards because my husband had booked the room on the Internet and not directly with Days Inn. I have been a Rewards member for over 10 years and I don't remember that every happening, but the front desk insisted that was the policy. The clerk was also pretty curt when she told us our room wasn't ready and we would have to wait an hour. We said fine, we would wait in the lobby and the room was ready in 20 minutes.", "title": "Be careful, there are TWO Days Inns on Tunnel Road, Asheville", "user": "Thea2", "date": "April 5, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 127311075}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "the hotel was clean and quiet. We have stayed at Days Inn on our travels across the US and all are clean and comfortable. The price is also great, The check-in person was very helpful.", "title": "recommend highly", "user": "Sandy F", "date": "March 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 126283799}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "I was very pleased with my stay at this hotel. My husband and I reserved a room with a fridge in it and when we checked into our room it wasn't there. We simply talked to the front desk and they upgraded us and all was good. We also got wonderful service at the complimentary breakfast every morning.", "title": "Would recommend to family & friends", "user": "R W", "date": "March 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 126009439}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled with friends", "text": "Stayed March 9, 2012. Price was under $75 and Heather,who checked us in, was very helpful and knowledgeable as well as professional. I asked if they had ever had a bed bug report and she said no, not since she had been there and said we were welcome to check out the room, which we did, and it was fine. I always check first because of all the reports. I would recommend this hotel to anyone.", "title": "Awesome Price....CLEAN", "user": "PatKohl", "date": "March 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 2.0, "rooms": 5.0, "location": 5.0}, "id": 125914681}], "location": {"country": "United States"}, "stars": 2.5, "variance": {"poor": 27, "average": 77, "very good": 147, "terrible": 21, "excellent": 123}, "aka": "Days Inn Biltmore East Hotel", "slim_ranking": 0.586206896552}