{"user_rating": 3.5, "review_count": 167, "name": "Days Inn Pottstown", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed November 2012, traveled with family", "text": "We had to stay here due to a week long power outage from Hurricane Sandy. A hotel in Pottstown would never be my choice for a vacation. If I were travelling for work, or needed an emergency place as we have over the last week, I would definitely go again.", "title": "Decent place. Surprised me.", "user": "Hussyband", "date": "November 5, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 144545436}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "Front desk staff was uniformly helpful and friendly. Housekeeping, etc were a friendly bunch. The room was clean, we had a non smoking floor, and minimal noise (one exception was the elevator, but that may not be an issue for most. I could hear the ding when it hit all the floors it seemed).", "title": "best days inn", "helpfulness": 1, "user": "Barbara M", "date": "October 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 143786526}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "We enjoyed our 2 night stay at this Days Inn. The hotel is clean and the staff was very friendly, especially Robert. He is an asset to this hotel! Our room was clean and the bed was great. The only reason I didn't rate this 5 stars is because the fan in the bathroom was very noisy and annoying and the door into our room didn't seem to fit properly because there was light from the hallway that shined in all the way around at night. We did not report these issues because honestly, we spent very little time in the room. We didn't take advantage of the free continental breakfast so I can't comment on it but the space looked very well stocked. Overall we had a great stay and we would definitely recommend this hotel to family and friends. The price was great too!", "title": "Great stay!", "helpfulness": 1, "user": "rosemary1951", "date": "October 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 143465938}, {"rating": 3.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "We were very pleased with our stay . Average hotel but clean and helpful staff. We would stay again if in area.", "title": "Good hotel for price !", "user": "KAREN K", "date": "October 20, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 143278989}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with friends", "text": "Clean, well-managed, just right for what my friend and I needed. Had a microwave, small refrigerator, hair dryer, nice television. The only thing I would like would be some task lighting. Beds were nice and firm.", "title": "Nice Stay at Days Inn", "helpfulness": 1, "user": "BARBARA S", "date": "October 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 143231395}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled with friends", "text": "Nice friendly hotel but really the linens are awful. Try to imporove on them. Other than that the stay was fine, but the bed is the most important part of a hotel.", "title": "Overview", "user": "MARY G", "date": "October 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 5.0, "sleep": 2.0, "rooms": 3.0, "location": 5.0}, "id": 142923350}], "location": {"country": "United States", "city": "Pottstown"}, "stars": 2, "variance": {"poor": 24, "average": 32, "very good": 62, "terrible": 14, "excellent": 35}, "aka": "Days Inn Pottstown Hotel Pottstown", "slim_ranking": 0.6, "description": "The guest rooms at the Days Inn Pottstown offer beautifully appointed furniture, a comfortable and well lit work workspace and all include 32 inch flat screen TV, complimentary wireless internet access, microwaves and refrigerators, and coffee makers. Hair dryers, irons and ironing boards are also provided in every guest room for your convenience. We invite you to take advantage of other amenities including a seasonal outdoor pool, fitness center, and business center. Join us in our lobby every morning for a complimentary deluxe continental breakfast. There is ample parking for cars, trucks, and buses. Meeting and banquet space is also offered for your next business function or family gathering. We proudly welcome your pets on our property. Call us today and ask about our wedding and shopping packages."}