{"user_rating": 3.0, "review_count": 158, "name": "Days Inn Hicksville", "reviews": [{"rating": 3.0, "title": "Not that bad -- good for a short stay", "text": "This isn't terrible. My ONLY complaint with this hotel is with the pillows on the beds. The rooms are relatively small, but if you won't be staying in the hotel room I don't see why that will be a problem. They provide free cable and wireless. The bathrooms and rooms are relatively clean. The hotel's in a safe area in Long Island. You could do a lot worse.", "user": "chicago44", "date": "February 18, 2007", "id": 6808097}, {"rating": 2.0, "title": "Below Average", "text": "I'd recommend this hotel for a 2-3 night stay. For the money, it's well worth it. Although I would repeat what others have said here and say that I wasn't happy with the lumpy pillows (which hurt my neck on my last night there).", "user": "Traveller_mom2", "date": "March 27, 2006", "id": 4737505}, {"rating": 1.0, "title": "Unbelivable uncomfortable", "text": "After calling several hotels and motels, I found this Days Inn (Hicksville) which was considerabbly lower priced than all the others ($83 compared to $140). Considering that we really only needed a place to sleep, we chose the Days Inn.", "user": "HellzKitten", "date": "January 23, 2006", "id": 4372405}, {"rating": 3.0, "title": "What do you expect?", "text": "We got there and I already knew not to expect anything but below average. It is really one of those rundown type of hotels that is barely keeping up to date.", "user": "VA_Girl", "date": "December 6, 2005", "id": 4164714}, {"rating": 1.0, "title": "will never go back", "text": "The front desk is in a small little room. We could hear music blaring from a bar that is connected to the hotel so I went to check it out and I honestly felt so badly for those sleeping in the rooms next to the front desk (if you are staying there, ask for rooms near the other end like room 120 to 140).", "user": "A TripAdvisor user", "date": "March 14, 2004", "id": 1724193}, {"rating": 2.0, "title": "Not what I expected", "text": "I am from a place where most hotels are a lot cheaper than this one. I thought that at 90$/night, I would be getting more than I usually pay for. Although this may be the going rate for New York, it was really surprising to me. When I got there, I discovered that they do not take checks. The hotel bar/restaurant is attached to the lobby area, but it is far enough away so that it will not be overly loud. The room itself was very small and mostly cinderblock. It felt like a dormitory. Not the best, but protected from the elements. My room was separated from the adjacent room by a door, and it was very loud. I did not feel as comfortable there as I normally do, but it was not terrible. The staff was very helpful. Also, word to the wise for out of towners, rent a car. I wasn't sure about that when I went, and so I just took a cab, and it would have been much cheaper. Also, this town is much more spread out than some of the more urban areas of New York, so you will need your own form of transportation.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "March 10, 2004", "id": 1718297}, {"rating": 4.0, "title": "Worth It!!!", "text": "My stay at the Days Inn was great. For the reasonable price, the room was clean and spacy. My boyfriend and I go there as a weekend get-a-way! I would recommend it!!!", "helpfulness": 4, "user": "A TripAdvisor user", "date": "November 4, 2002", "id": 739434}, {"rating": 3.0, "title": "Pretty good choice for the area", "text": "Ok.. I have stayed here and anyone who knows the area, knows that there is limited choice around. Let me start by saying this place is pretty good for what it is. It is exactly an old 1950s travelodge/motel with a restaurant/bar and office up front. The rooms have been renovated, the place is clean, bathrooms just fine. They have a pool in the center outside in the summer. I paid about 75 dollars to stay here.. and it was a good deal. Days in has free continental breakfasts also.", "user": "pamelaroad", "date": "October 17, 2008", "id": 20960803}, {"rating": 2.0, "title": "Lax weekend", "text": "I would stay here again, instead of the HoJos down the street which was just the pits.", "user": "baikey", "date": "July 25, 2008", "id": 18248218}, {"rating": 3.0, "title": "I would stay here again", "text": "Again, clean, renovated, basic accomodations with a bar/restaurant, so if you know what to expect then it is perfectly acceptable.", "user": "PONYRCR", "date": "June 30, 2008", "id": 17357267}, {"rating": 1.0, "title": "No Place to stay when it's cold outside", "text": "I stayed here the one weekend in July 08 .. i don't want to kill the place and at the same time can not glow about it either.", "user": "gcram399", "date": "March 5, 2008", "id": 14080272}, {"rating": 4.0, "title": "Low cost, fun, friendly staff, exceeded expectations, very nice stay", "text": "upon check in i waited a long time with only one clerk working.", "user": "TonyBaloni", "date": "November 21, 2007", "id": 10965629}], "location": {}, "stars": 2, "variance": {"poor": 25, "average": 60, "very good": 41, "terrible": 18, "excellent": 14}, "aka": "Days Inn Hicksville Hotel Hicksville", "slim_ranking": 1.0, "detail_rating": {"service": 3.5, "cleanliness": 3.5, "value": 3.5, "sleep": 3.0, "rooms": 3.0, "location": 3.5}}