{"user_rating": 3.0, "review_count": 217, "name": "Days Inn Calgary South", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "Stayed here for 3 nights in a business room. The room itself was very good -- newly renovated, duvets on the beds, and an in-room computer with free Internet. The air conditioning functioned well but was very noisy so bring your earplugs. The hotel itself is in need of a major update / cleaning. The elevator is filthy and run-down, and so are the lobby and the guest laundry. Free breakfast is provided each morning in a common area, and the offerings are very good -- waffles, toast, cereal, fruit, muffins, juice. There is a pool and hot tub but no changing area or restrooms in the pool area. Parking is adequate. There is no restaurant on site (a pity). Overall, not a bad place to stay -- close to the Zoo, shopping centres, downtown Calgary.", "title": "Nice, new room; hotel itself needs major updating / cleaning", "user": "WBinBC", "date": "July 29, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 3.0, "cleanliness": 2.0, "value": 3.0, "location": 3.0, "rooms": 4.0}, "id": 8252910, "likes": {"liked": "— In-room computer and duvets on the bed.", "disliked": "— Dirty and run-down elevator and lobby."}}, {"rating": 3.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "We were in Calgary for the Stampede and this hotel is within walking distance (20mins) or you can take the train from two blocks away. The staff were friendly. The room was quite dated but I think they are starting to upgrade the rooms. We had a window but it was frosted so we couldn't see the wall view ! All ok and it was reasonably priced considering the stampede was on but quite expensive compared to what we had paid for better standard of accomodation around Canada.", "title": "Great location for the Stampede!", "user": "Frills999", "date": "July 21, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 2.0}, "id": 8213033, "likes": {"liked": "— Location", "disliked": "— Room felt quite dated"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled with family", "text": "I went on-line to try and find the most reasonable hotel I could find as we were en-route to another destination so I was just hoping for a clean room. As in turned out the room was clean, hotel staff were friendly, good with kids, gave a gift bag to our kids, housed our bikes for us, gave us coupons for breakfast and helped us with our tent trailer parking needs. I got the feeling they would do anything for us and that was special. Another surprise was the breakfast - when they say continental, you think cold cereal and old muffins but I found my kids down there making there own beautiful waffles and the spread of food was great!!! I was sad to have to leave the next day.", "title": "Couldn't have been better!", "helpfulness": 1, "user": "nteslaEdmonton_AB", "date": "July 17, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8131413, "likes": {"liked": "— the outstanding value", "disliked": "— the location"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "This is a very nice, even upscale, hotel for a Days Inn. It is on a busy street in a busy area of Calgary. It is very clean and comfortable, except that our nonsmoking room smelled a bit like smoke, so I believe they needed to clean more thoroughly. It is now a completely non-smoking hotel, which we like, but evidently they had recently made this change. Good internet access.", "title": "Nice hotel", "helpfulness": 1, "user": "dbeauc", "date": "July 9, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 8083830, "likes": {"liked": "— Cleanliness and helpfulness of staff", "disliked": "— Room still smelled somewhat of smoke even thought it was a non-smoking hotel"}}, {"rating": 5.0, "title": "gem of a place", "text": "My wife and I had the pleasure of staying at this gem of a place my father in law booked us in when we came over from Scotland for the stampede we were very nervous this was our first time abroad but all our worrys were sorted out by the desk staff they really put us at ease very helpful gave us a lot of help with any problems we had big thanks to Joel for all his help imagine a Taff in Calgary the location was fantastic close to a pub and plenty of places to get food just a stroll away loved it so much we will be going back in 2008 and my inlaws were so impressed they will be staying there aswell 5 star treatment at fantastic prices", "helpfulness": 2, "user": "beagle316", "date": "February 16, 2007", "id": 6803403}], "location": {"country": "Canada", "city": "Calgary"}, "stars": 2, "variance": {"poor": 38, "average": 40, "very good": 59, "terrible": 44, "excellent": 36}, "aka": "Days Inn Calgary South Hotel", "slim_ranking": 0.680412371134, "description": "Welcome to the Days Inn Calgary South. Our hotel offers 134 Guestrooms and Suites, Meeting Facilities, Heated Indoor Salt Water Pool/Hot Tub and Fitness Centre. We offer Complimentary Continental Breakfast including Belgium Waffles, Free High Speed Internet Access, Free Parking, and Free Local Calls. A Valid Credit Card is required at Check In. All of our rooms have Iron and Ironing Board, Cable TV, Hairdryer and Clock Radio. Refrigerators are available in upgraded rooms upon request. Microwaves are available in upgraded rooms upon request. Pets allowed in some rooms for nominal fee. We offer a shuttle service for nominal fee. The Transit system is within 1 Block of the hotel. The Atlantic Trap And Grill Pub is located on site."}