{"user_rating": 4.5, "review_count": 441, "name": "De L'Europe Amsterdam", "reviews": [{"rating": 4.0, "title": "Prima Room", "text": "Nice rooms and large bed. Nice finish to things. It is certanly the best hotel in town. Friendly staff but they are slightly cocky they forgott to bring me coffee at breakefast when ordered. Listed the wrong roomservice meny when asking.", "helpfulness": 1, "user": "Tobbis78", "date": "July 27, 2012", "id": 135539480}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "Charged me twice for the room and when contakting them they gave back 32â\u0082¬ so i had to contakt them twice to corekt them. But this is the best hotel i have stayed and i Will come back soon, the staff is trained good and are polite.", "title": "Magic on the Amsterdam Canals", "helpfulness": 1, "user": "Lightofhope", "date": "July 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 135500417}, {"rating": 3.0, "stay_parameters": "Stayed July 2012", "text": "We recently stayed at the recently renovated L'Europe in Amsterdam. This timeless hotel overlooking the river and canals is a gem. All the flair and beauty of 19th century with a modern 21st century interior and amenities. Our room had a balcony overlooking the river. It was just perfect. Staff are just wonderful and in my opinion, are the best in Amsterdam. I loved the terrace for lunch and the cocktail bar after a day wandering around the city. Room service was literally instant and everything hot ! We will be passing through Amsterdam in a couple of months time so we will stay here again for sure.", "title": "Beautiful hotel needs to address a few issues", "helpfulness": 2, "user": "agnes9971", "date": "July 24, 2012", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 4.0, "service": 4.0, "rooms": 3.0}, "id": 135265837}, {"rating": 5.0, "title": "Very Nice!", "text": "I arrived early after an exhausting flight from NY knowing the room may not be ready. My luggage was stored for me while i went to walk around. I returned around 2pm, and the room still was not ready which was disappointing. Finally, i was shown my room after a brief tour only to find it very small. It has a nice view of the canals from one small window. The staff did follow my request for a quiet room, away from elevators. This is probably the smallest room i have ever slept in and i find it hard to accept in such a high level hotel. The bathroom is very luxurius and large with heated floor but no double sinks. There is a Nespresso coffee machine which is great and the iPad is great too. The Concierge by the name of Eel, correct my spelling, is superb, warm, helpful and wonderful. He guided me on some wonderful walks, recommended places to eat, lent me books of Amsterdam etc. Other staff is great but not as helpful as that man. Now, problems..... On my first day in the hotel, i found 4 flies in my room. They were going crazy above my head. How could housekeeping allow this to happen? Called front desk and was told to wait or someone. After several min, i called back bc noone showed up. This is when the wondeful Concierge showed up and managed to get rid of 2 flies. He arranged for an insect zapper or me so i could kill the remainng flies. The room is clean but not as it should be. Wood floor areas are dusty and dust balls stuck to my suitcase. Tables are dusty also. Housekeeping is inconsistent. On my first day, i had no bath mat, dont dusturb sign, hand cream and body scrub. On second day, i got some of the bath amenities but not all and the room was cleaned very late at 2pm. On the 3rd day, i got all the amenities and finally the dont disturb sign. In this level hotel, housekeeping should be superb. In all, i think this hotel is overpiced so beware of the high prices especially for the tiny rooms.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "July 19, 2012", "id": 134802568}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "Great friendly staff, yummy food, centrally located and walking distance from just about everything! We were upgraded to a deluxe suite and it had heated marble floors!!! Wow! Staff was very accommodating, and helpful. We would stay here again!", "title": "very nice place", "user": "ALMARZOUQI", "date": "July 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 134754754}, {"rating": 5.0, "title": "What a fantastic experience", "text": "While booking my 'normal' room over the phone I explained the staff that the stay we had was to celebrate our fifth wedding anniversary. While checking in we got a fantastic surprise; we got a serious upgrade to the fantastic suite with a view over Amsterdam, a bubblebath and fantastic interior. What a great start of our stay. The staff is extremely friendly, professional and guest focused. After a nice breakfast with very friendly personnel we could use the 'hotel bikes' to cycle through Amsterdam. We have had two fantastic days in this great hotel. Compliments for the design, interior, the art and most important great staff. Customer service at the highest degree! The location is fantastic since it is in the center but very close to the Jordaan (what we prefer over the city center) and close to musea and concert venues. We will for sure come back.", "helpfulness": 2, "user": "B v", "date": "August 29, 2012", "id": 138808497}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "My husband and I just returned from our European vacation and this hotel was by far the best place we stayed. We had a junior suit with a balcony. We arrived early Sunday morning and was very tired from our 8 hour flight. The bed was so comfortable and had the biggest pillows I have every seen. The bedroom was quiet and dark so no problem sleeping during the day. Room service was very accommodating bringing up anything we needed. When we got up we sat out on our balcony and had the best time watching everyone passing by on their boats. They were having a blast. Family's and friends had pot luck style dining, drinking and did not have a care in the world. So much fun. The room was amazing. The bathroom had the best tub I could have relaxed in it all day. The location was perfect walking distance from shopping and the square. Everyone was very helpful and so nice. I did not get to try out the spa, but it looked really nice. If you want a romantic place to get away to for the weekend to relax and have a lot of fun this is the perfect place for both.", "title": "People watching", "user": "Teri F", "date": "August 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 138770511}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled solo", "text": "I recently stayed in a beautiful junior suite facing the canal and the room was beautiful, quiet and spacious. The hotel itself is in a wonderful and charming location but there were several service issues that I encountered during my stay and then again when a friend and I went to dinner on Sat. night at the Hoofdstad Brasserie. I had already had one meal there by myself sitting on their wonderful terrace but it was a less busy night and the service was fine and the meal delicious. I went back on Sat. night and the service was terrible and disorganized and our waiter's excuse was that there was a private party of 14 that was causing the delays. We had asked for a table by the window since it was supposed to rain and they would not let us continue to sit outside but then once seated, they made us move again saying that table was reserved already. So, we sat at a less than desirable table but no one did ever show up for that window table and then our main course arrived a full hour after our starter course. The restaurant seemed to be very short staffed and our waiter was frazzled and not very service oriented.", "title": "Lovely hotel but service needs polishing", "helpfulness": 1, "user": "moremiles", "date": "August 28, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 138725356}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled on business", "text": "The front desk personnel were friendly and helpful but again, there seemed to be some disorganization as requests made prior to arrival were not on record.", "title": "Great location great hotel", "user": "peterlybeer", "date": "August 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 138626911}, {"rating": 3.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "I loved the hotel itself and can recommend it but don't expect 5star service in every area.", "title": "Unwelcome 'visitors' in our room", "user": "kobe22", "date": "August 25, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 4.0}, "id": 138327455}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "Taking the old and smashing it with the new, this hotel is modern, warm, and a happy place to be. Amsterdam was a strange city to me, but the moment I entered our room my jaw dropped. My favorite color is mustard, yea appalling to some, but it's a happy color people and out room was a bronzy mustard color with rembrandts on the wall, a stunning terrace over the canal and a modern as you can get purple bathroom. The interior designer deserves huge props to pull off such a task in such a tasteful manner. The concierge booked us dinner at two restaurants of which I will never forget. De Vief Viejen (well, something like that, English: the five flies) was the first and it was drop dead yummy. It's Dutch food made at it's best. The best experience and food I have ever eaten came from Le Rive at the intercontinental. Nothing on any continent has touched it, and I was a vegetarian at the time and the chef created an entire pre fixe menu of 5 courses which was actually like 20, and course on top of course topped the next. When you stay at hotel de l'europe, which you should, get them to book you a dinner at Le rive with drinks afterwards at the secret unmarked bar that was like hogwarts gone achy. (the concierge will instruct you on how to get in). Have fun and enjoy the tulips!", "title": "This is how you do Amsterdam", "user": "RyFy", "date": "August 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 138258303}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled with friends", "text": "Very commercial location, although on a canal. Beautiful room, poor service at front desk and restaurant. Just too big - would have preferred smaller boutique hotel on more residential canal. Just sorta misses!", "title": "Slightly disappointing", "user": "5807tripper", "date": "August 21, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 137869813}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "From the moment you arrive until you check out you are aware that you are in a first rate old world hotel. Every amenity is available. The staff is elegant and professional and ready to assist in whatever you need. Restaurant and staff are worthy of 5 stars. Friendly, not stuffy atmosphere, but with elegance and style. Perfectly and centrally located. We look forward to returning!", "title": "World Class", "user": "kandeeb", "date": "August 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 136865572}, {"rating": 2.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "I made a booking for 2 deluxe rooms, both were very disappointing for a 5 star hotel. The first room, number 432, had an unacceptable smell of sewerage - which was very odd as it wasn't from the bathroom and the room is well above the canal. Opening the tiny attic window did nothing to clear the smell. I asked Robert, the staff member who showed us to our room, for another room. He agreed that it was necessary said he would deal with it straight away. The second room reserved for us was also unacceptable. Number 322 looked into a glassed-over central courtyard giving a very claustrophobic feeling. Very little natural daylight or view of the sky and no chance to open the window for fresh air.", "title": "Smelly room - not acceptable", "helpfulness": 1, "user": "Milouxxx", "date": "July 30, 2012", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 2.0, "sleep": 2.0, "rooms": 3.0, "location": 4.0}, "id": 135784268}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled on business", "text": "We waited for a hour then called reception to ask them for an update on changing rooms. The front desk did not know about our request but told us that as the hotel was fully booked we could not move rooms unless we were willing to pay and additional 150Euros per room per night. Confusing and contradictory. The hotel were not willing to send someone to check the problem with the smell in the room nor were they willing to move us from an unacceptable room at their cost. Not what you expect from a 5 star hotel. The staff should feel ashamed that they treat customers so badly. I won't ever return to this sub-standard hotel.", "title": "great location", "helpfulness": 1, "user": "MisterMec", "date": "July 28, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 135604337}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "I booked this even though it wasn't highly rated with Trip Advisor. (The Holiday Inn had a higher rating, seriously?). The property is Leading Hotels, which in our travels, rates highly. I'm glad I was here. Expensive? Yes, about $450 a night, but for this I was upgraded to a Junior Suite on the canal. It was beautiful. Had cocktails at the Terrace, which was wonderful, outside, looking at all the boats going past, and had dinner in the Brasserie, very simple soup and salad, which for us in the evenings is a lot of food. The other meals we saw looked very good. All-in-all, L'Europe impressed me, and I would come back.", "title": "Very Impressive", "user": "grapdad", "date": "September 4, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 139324775}, {"rating": 4.0, "stay_parameters": "Stayed September 2012", "text": "A fusion of traditional and modern that works quite well, although a little too much red going on for my liking! Booked a standard double which was immaculate but very very compact, beautiful marble bathroom but no bath! Beware they want to charge your card with a €150/day security deposit even when we prepaid the room, we objected and they took €150 cash for the 3 day stay!! Bar prices are high and the service a little slow. Nice terraced area at side of the canal, and lovely smoking lounge area. Great location, but quite alot of gay bars in the immediate vacinity of Rembrant Square. All in all, about as good as it gets in Amsterdam, but it's certainly no George CInq!!!!", "title": "Great hotel......certainly NOT World Class", "helpfulness": 1, "user": "drewLeeds", "date": "September 3, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 139306267}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "Thoroughly enjoyed our stay. We were upgraded to a Jr Suite and it was marvelous having been renovated within the last year or two. Bathroom was huge, even by American standards. Bed comfort was superb. The integrated lighting system, of all things, takes some getting used to and can be frustrating, perhaps the only complaint we had of the room. The staff is friendly and helpful.", "title": "Another Excellent Property", "user": "David G", "date": "August 31, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 138994397}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "The lobby is beautiful and engaging, perfect for afternoon tea or cocktails. Freddy Heineken's bar (attached) is a totally different atmosphere, sort of clubby, and fun as well. Don't miss dining alfresco by the canal. Food is very good and ambiance, on a cool summer night, is truly what vacation brochures try to capture. At this property, it's real. Restaurant service is good for Europe, but not exceptional (and one must remember we travel to Europe because it is different). I was fine with it.", "title": "Grand Old Lady", "user": "Grapeman1", "date": "August 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 138899107}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "We loved Amsterdam and will book at this fine property again for our next visit.", "title": "Wow - we had the best room in the Hotel", "helpfulness": 1, "user": "Kenwal38", "date": "August 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 138846142}], "location": {"country": "The Netherlands", "continent": "Europe", "city": "Amsterdam"}, "stars": 5, "variance": {"poor": 9, "average": 26, "very good": 81, "terrible": 10, "excellent": 315}, "aka": "De l`Europe Amsterdam Hotel Amsterdam", "slim_ranking": 0.0205882352941, "detail_rating": {"service": 4.5, "cleanliness": 5.0, "value": 4.5, "sleep": 5.0, "rooms": 4.5, "location": 5.0}, "description": "Landmark Hotel with Victorian exterior, located opposite Flower Market in the City Centre, overlooking Amstel River & Munt Tower."}