{"user_rating": 3.5, "review_count": 334, "name": "De Vere Village Swansea", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "A last minute trip to Swansea so a late ish booking to this hotel. Found it ok and there was lots of free parking but had to run the gauntlet of Smokers at the door which was unpleasant. It seems to be a wedding hotel so lots going on on both days with parties but the noise ws managable.", "title": "Comfortable, quiet and a great breakfast", "user": "Caroline M", "date": "May 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 160399015}, {"rating": 2.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "Check in was really smooth and staff were really relaxed and helpful. I Requested a quiet room away from the lift and thats what we got, floor 5 facing the water rather than the road. The room was big and reallly clean, only a double bed rather than a king :( a bit of a moan was that the bed moved I leaned on it to get something and the bed shot over to the wall when you sit up to read it moves away. so scored a bit lower on the sleep quality I thought the bathroom was a bit dark and putting on makeup was tough but then I noticed there was a light out - which I reported so hope it is changed", "title": "disappointing", "helpfulness": 1, "user": "Angela L", "date": "May 6, 2013", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 1.0, "sleep": 2.0, "rooms": 3.0, "location": 4.0}, "id": 159776479}, {"rating": 1.0, "title": "Families are now second class guests at De Vere Village Hotels", "text": "The carpeted halls mean when people are walking around there is little noice althought the usual fire doors bang every time someone leaves there room", "helpfulness": 2, "user": "Jonathan298", "date": "May 1, 2013", "id": 159372423}, {"rating": 3.0, "stay_parameters": "Stayed April 2013, traveled on business", "text": "We went out for a run in the morning and came back in for breakfast, again staff were really helpful. The cooked breakfast was one of the best I have had in a hotel in a while. The Scrambled eggs were awesome :) The whole thing was Really yummy, I went for a 4 mile run so I could sit and really enjoy it and it was worth it! Yum.", "title": "Nice pool and gym - watch the room", "user": "OsborneWork", "date": "April 30, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 3.0}, "id": 159216343}, {"rating": 3.0, "stay_parameters": "Stayed April 2013", "text": "We did not use any of the spa facilities so can't comment on them but with the amount of people heading in and out it is clearly popular with locals. all and all a a good stay.", "title": "Business trip", "user": "Gipeg", "date": "April 23, 2013", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 4.0, "service": 3.0, "rooms": 3.0}, "id": 158607262}, {"rating": 3.0, "title": "Poor breakfast", "text": "Room a good size but TV old fashioned and whole hotel is outdated and needs a makeover. Window frames have mould around them when opened. Cobwebs in corners of room by curtains. Heating switches itself off overnight. Only one customer lift so be prepared to wait or use the stairs (we stayed on the fifth floor). Breakfast poor, queued to wait to be seated, seemed short staffed. Hot breakfast was not very inviting with over cooked burnt sausages and no bacon. Chef serving had no voice to assure customers hot fresh items were available and would be served. Paid £69 saver rate which included 2 breakfasts, I would not consider paying the standard rate of £100+ for this hotel. Premier Inn 200 yards away is much cleaner and better value for money with a great Beefeater restaurant also!", "helpfulness": 2, "user": "Colin O", "date": "April 3, 2013", "id": 156530847}, {"rating": 2.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "Let's start with the positives!!", "title": "Noisy hotel", "helpfulness": 1, "user": "Eveswellcat", "date": "April 3, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 2.0, "rooms": 3.0, "location": 2.0}, "id": 156526341}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "Reception staff are friendly and helpful. Our room was clean and TV was a good size.", "title": "Lovely clean room, modern decor, slightly noisy", "user": "SRD1994", "date": "April 2, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 3.0}, "id": 156372555}, {"rating": 2.0, "stay_parameters": "Stayed March 2013", "text": "The food at breakfast was varied and plentiful - but tables are not cleared and queues buld up. We had to ask for coffee 4 times on our second morning.", "title": "Noisy!", "user": "MattPeach", "date": "March 25, 2013", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 4.0, "rooms": 2.0}, "id": 155637743}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled with family", "text": "There is only one lift servicing five floors and again there is often a long wait.", "title": "Pleasant Sunday lunch with family and friends.", "user": "Gowergal", "date": "March 24, 2013", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0}, "id": 155492579}, {"rating": 3.0, "stay_parameters": "Stayed March 2013, traveled on business", "text": "Nice room, though heating did seem to have a mind of its own and spent most of the night very cold.", "title": "Very average but good food", "user": "Misterfrostie", "date": "March 22, 2013", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 155323947}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "Room service menu didn't state anywhere what number to call so I phone reception and they put me through and gave me the number. After a long period ringing it went though to the answerphone so I called back. Got the answerphone again. Decided against room service and went down to the restaurant and found them standing around ignoring the ringing phone. Ordered room service at the restaurant reception and went back to my room. The food arrived quickly and was very good. The prices were very reasonable too.", "title": "Great Hotel, great voice of food and a lovely place to stay in Swansea", "user": "Carol S", "date": "March 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 154857733}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "I used the gym during my stay, it was well equipped and in pretty good condition.", "title": "The Village Swansea", "user": "Lucy60_12", "date": "March 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 154784100}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled on business", "text": "Breakfast was nice, a hot buffet, cereals, fruit etc.", "title": "sofa bed in every room - price is per room - avoid 2nd floor", "user": "gingdotta", "date": "March 1, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 153470019}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled with family", "text": "Checkout was slow, one member of staff on and about 6 people in the queue in front of me.", "title": "A great over-night stay!", "user": "Louise B", "date": "March 1, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 153428820}, {"rating": 4.0, "stay_parameters": "Stayed March 2013", "text": "Stayed for 2 nights. We had an upper deck room. Room was nice, clean and modern. Good location. Had food in the victory pub was actually quite nice! Would probably book again, no complaints apart from the price!", "title": "Nice hotel but expensive", "user": "Mgeo866", "date": "April 21, 2013", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 158349658}, {"rating": 3.0, "stay_parameters": "Stayed April 2013, traveled on business", "text": "W spent two nights at the de Vere Village in Swansea. Our room was on the second floor and we were overlooking the waterfront. The room was comfortable and a good size. Thanks for the different tyoes of pillow. Much appreciated. The welcome tray was adequate - but no biscuits. The bathroomm was a decent size but the toiletries were very simple - a soap dispenser for the basin and a body wash and shampoo dispenser for the bath. I find this a little disappointing now. The hotel has a good sized car park so no issues there. I walked into the shopping area in about 15 minutes from the hotel passing all the new apartments and flats being built. Near the hotel there is very little - a Beefeater, a small Tesco and tht's about it.", "title": "good pool - good gym.", "user": "Neptune24", "date": "April 16, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 3.0}, "id": 157967974}, {"rating": 1.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "We stayed on a room with breakfast basis so we can not comment on the restaurant in the hotel. To us it seemed very casual. The reception area was always very busy as it is the hub point probably for the conferenc erooms etc. There was free wifi there but also in the rooms. The breakfast was typical hotel fare. I felt that there could have been more choice of bread available. My husband felt disappointed that the cooked breakfast was not freshly cooked to order and was help your self from the buffet but when I looked at the items they seemed of a reasonable standard.", "title": "Nice Modern Hotel", "helpfulness": 1, "user": "kelly_554", "date": "April 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 157174135}, {"rating": 3.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "I would use the hotel again as I liked the gym. I went at a quiet time about 10.30am and stayed until about noon. The pool is a good size and there were only ever 3 or 4 people swimming. It was possible to do serious swimming in lengths. There was a jacuzzi, a spa pool, a steam room and a sauna. The well equipped gym had an extensive range of equiplent from rowing machines, two types of bikes, running roads, vibra plate, weight lifting etc. This was a plus point for the hotel.", "title": "Bit of a mixed bag", "user": "johnhewinson", "date": "April 8, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 156976062}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "Nice hotel... Health spa with pool...Italian restaurant... Bar.. Clean rooms... Option to upgrade to the upper deck suite.. Only extra you really get is sky.. Didn't really notice the different in the actual bed or bathroom.. So you pay £20 a night to watch sky... Didn't use the Health suite so cannot comment... Bar slightly over priced on food and drinks and not much to choose from food wise...didnt try the restaurant but smelt nice.. would recommend breakfast.. Help yourself to full English breakfast buffet.. Cereals and pastries also available... About a 20 min stroll to main town.. £5 in a taxi...if was to visit Swansea again would return to this hotel... Very much like a premier inn..", "title": "Room with a view", "helpfulness": 2, "user": "Welshlearner", "date": "April 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 156701145}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "stars": 3.5, "variance": {"poor": 34, "average": 102, "very good": 119, "terrible": 19, "excellent": 60}, "aka": "Village Swansea Hotel Swansea", "slim_ranking": 0.769230769231}