{"user_rating": 3.0, "review_count": 737, "name": "De Vere Venues Wokefield Park", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "We did not pay for this trip as my partner won a nights free stay here in a competition. The staff were helpful and polite on checking in. The hotel is split into 2 different buildings - the mansion and the executive building - they both have a restaurant and bar. The choice of food in both restaurants was very limited - each had a set menu! The room we were given (104) was in the mansion house and was stunning! Beautifully decorated, a spacious bathroom with large bath and enormous seperate walk-in shower, lovely view from the window, large comfortable bed (maybe too firm for some), temperature controls, free internet access and ironing facilities in the room. The room also had a LCD wall mounted tv but only had a choice of 6 channels which was disappointing and no radio. The air conditioning vent also made some noise which kept my partner awake for a while and the room service meal we had was not the best i've ever had but as these are the only complaints we had i consider this hotel to be one of the best i've stayed at. The unlimited free tea and coffee stations were welcome and fresh fruit and nibbles were also provided! Breakfast in the maple restaurant - buffet style - was plentiful and tasty and was available until 10.30 am on the Sunday. The swimming pool and leisure suite were located in the 2nd building so we walked over enjoying the view of the golf course and mansion house as we went. The executive building is more modern and not as plush and elegant as the mansion house and is very corporate with BMW products in situ. The bar here was livelier than the mansion house bar which was quieter and more relaxing. The pool was clean and warm and situated with a jaccuzzi and sauna. Plenty of clean large towels were supplied for use in this area. The location is a bit rural and difficult to get to by public transport but if you drive it is in a ideal location for visiting Reading and the surrounding area", "title": "Bit too corporate but stunning location", "user": "crisp-lover", "date": "March 22, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 3.0, "service": 4.0, "rooms": 5.0}, "id": 26618621}, {"rating": 4.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "I've just stayed at this hotel for 2 nights, booked as part of a promotion running just after Christmas and paid 19 pounds per night. Arrived at 7pm on Friday, check in was swift, receptionist explained where everything was and instructed us on how to get to our room, which was 160 in the new building.", "title": "bargain stay", "helpfulness": 1, "user": "shelleybean", "date": "March 1, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 25403500}, {"rating": 3.0, "stay_parameters": "Stayed February 2009, traveled with family", "text": "Room was clean and well equipped with tv, iron and ironing board, kettle and hairdryer. Bathroom was spotlessly clean, as was the bedroom. It was situated in the new part of the hotel and had a french door which opened onto an area of grass. As other people have mentioned there are posh coffee makers in the lobby, water dispensers and free internet and printer. There is a nice bar, where the staff are helpful and a restaurant upstairs, which was reasonably priced although we did not eat there. Breakfast is offered, although we went into Reading both days so did not try it. The grounds of the hotel are beautiful and we went for a walk each morning. It has a golf course which is very popular, as well as a small swimming pool and gym. There was a long queue to check out, but our bill was correct and the process was painless once we reached the front of the queue.", "title": "OK if you get a cheap deal but service quite basic and definitely more styled towards the corporate venue market.", "user": "WelltravelledMum", "date": "February 22, 2009", "detail_rating": {"cleanliness": 3.0, "value": 5.0, "location": 4.0, "service": 3.0, "rooms": 3.0}, "id": 24953594}, {"rating": 4.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "I must admit that I was apprehensive after reading the reviews here, but I was very impressed. All the staff that we dealt with were friendly and efficient, the hotel was spotless and in beautiful countryside. The only downsides were the poor signposting and distance to Reading centre. I plan to stay again over the Easter break with my children and I can't understand where the poor reviews are coming from as this hotel was excellent value for money, all staff were professional and cleanliness was a high standard. Indeed I have paid a lot more for a far inferior break. Hotel is highly recommended as we had a great stay.", "title": "wokefield park promo rate", "user": "robotters", "date": "February 17, 2009", "detail_rating": {"cleanliness": 4.0, "front_desk": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 24671195, "likes": {"liked": "— huge bedroom and big bed", "disliked": "— kept awake by noise in corridor - no sound proofing"}}, {"rating": 2.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "I stayed here with my husband and 2 children (6 and 9) for a Friday and Saturday night in February 2009. We booked one of their cheap deals, and paid £30 per night, room only, for a four-person family room. On the plus side, we got exactly what we requested - a large family room with one double bed, and two singles in a quiet part of the modern conference complex, with a good size en suite bathroom. The room was nicely decorated in a contemporary style, and had good blackout-lined curtains. This said, the facilties in the room were pretty basic.", "title": "Unorganised & v.poor customer service in a nice hotel. Dissapointing!", "user": "Jimmy006", "date": "February 16, 2009", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "location": 2.0, "service": 1.0, "rooms": 3.0}, "id": 24629515}, {"rating": 3.0, "title": "Very corporate, very \"golfy\" but absolutely fine for if you need somewhere to stay near Reading", "text": "We were there because we were going to a friends party nearby, and we used a corporate rate so had a premium room in the Mansion House.", "user": "A TripAdvisor user", "date": "April 6, 2009", "id": 27502703}, {"rating": 2.0, "stay_parameters": "Stayed March 2009, traveled on business", "text": "The pool area is pretty useless just like another reviewer has said. Vaguely reminded me of swimming lessons in my school pool 30 years ago. So don't pack your trunks unless you plan on using the Spa. Our premium room was very nice, better than expected really. Tastefully decorated, comfy bed and pillows. lovely sheets and towels (no robe). I love all the \"things\" you get in hotel bathrooms, but in this instance - nothing of any note. Some non descript shower gel/shampoo. So no lovely smelly things. Shower was nice - powerful and very hot. We had a spectacular view of the grounds and surrounding countryside and a window that opened. Aircon was easy to control (we switched it off).", "title": "Seminar - but not here again!", "user": "Delbertmaltbug", "date": "April 1, 2009", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "location": 4.0, "service": 2.0, "rooms": 2.0}, "id": 27233858}, {"rating": 3.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "Had breakfast in the Mansion House. OK Buffet Style. Pretty similar to other De Vere hotels. Ask if you want a poached egg, I did and one arrived a few moments later. Only slightly downmarket thing was the bread/toast and jam selection. No yummy stuff, just your standard robertsons strawberry jam (always a disappointment) - you could say I'm just being picky of course.", "title": "Bargain for £10!", "user": "chiken", "date": "March 31, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 3.0, "rooms": 2.0}, "id": 27191959}, {"rating": 3.0, "stay_parameters": "Stayed March 2009, traveled with family", "text": "So overall, it's fine", "title": "An 'ok' venue if you can get a special offer!", "user": "mrs1983", "date": "March 30, 2009", "detail_rating": {"cleanliness": 3.0, "value": 5.0, "location": 3.0, "service": 3.0, "rooms": 2.0}, "id": 27077105}, {"rating": 4.0, "stay_parameters": "Stayed March 2009, traveled solo", "text": "We stage seminars around the country as part of our business, inviting exhibitors and delegates to partake of an event where they arrive the evening before with one night's accommodation.", "title": "Great facilities, ideal for a short break", "helpfulness": 1, "user": "paullegate", "date": "March 30, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 3.0, "service": 4.0, "rooms": 4.0}, "id": 27072966}, {"rating": 5.0, "title": "Superb Service", "text": "Just returned from a Saturday night £10 a room stay at the Wokefield.My self,Wife and 3 boys 3,5 and 9 yrs.The rooms were spotless,tidy and warm.The staff were great and nothing was too much trouble.A nice touch having water and tea/coffee machines available on all floors and lots of them.We all had two swims(towels included) in quite a large pool.", "user": "HertsDave", "date": "January 26, 2009", "id": 23911518}, {"rating": 3.0, "stay_parameters": "Stayed January 2009, traveled as a couple", "text": "Breakfast was excellent value and lots of it (kids eat free)", "title": "Conference Hotel", "user": "Debbie007", "date": "January 25, 2009", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 5.0, "value": 3.0, "rooms": 5.0, "location": 5.0}, "id": 23895762, "likes": {"liked": "— The old Mansion House and ground setting", "disliked": "— The quality of the Breakfast"}}, {"rating": 3.0, "title": "great value", "text": "If you are looking for a nice hotel in Reading ...look no further you've found it.", "user": "stumbletrip", "date": "January 19, 2009", "id": 23699618}, {"rating": 1.0, "stay_parameters": "Stayed January 2009, traveled as a couple", "text": "The hotel is located about 7 miles from Reading town center, in a lovely quiet location. The grounds include the golf course, main conference hotel, the Mansion House and BMW training academy.", "title": "Very Disappointing", "user": "reedy007", "date": "January 15, 2009", "detail_rating": {"cleanliness": 1.0, "front_desk": 3.0, "location": 4.0, "value": 2.0, "rooms": 1.0}, "id": 23577832, "likes": {"liked": "— The bar and golf course", "disliked": "— the room"}}, {"rating": 3.0, "title": "Overall Good stay", "text": "We stayed in the Mansion house. The main reception staff lacked the personal touch and we were annoyed to have to wait 30 minutes for our room to be cleaned, even though it was an hour after check in time. We were though able to wait in the cafe area, where you were able to help yourself to free tea & coffee (& biscuits / baked cakes!!). The room we had was newly decorated and clean, and the bed was extremely comfortable. The room was slightly small and lacked any nice view of the grounds.", "user": "FamilyOPoole", "date": "November 25, 2008", "id": 22162085}, {"rating": 5.0, "stay_parameters": "Stayed February 2009, traveled with friends", "text": "My friend and I recently stayed at Wokefield Park and thought the place was fantastic.", "title": "Bargain!!!", "user": "EJS27", "date": "February 3, 2009", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 24168672, "likes": {"liked": "— Rooms - huge clock and the ease to get into Reading", "disliked": "— No biscuits for my tea :0) Very minor!!"}}, {"rating": 3.0, "stay_parameters": "Stayed January 2009, traveled as a couple", "text": "The reception were very friendly and happily organised our taxi into town. The room was spotless and very comfortable.", "title": "Great for golfers on company conferences, not so great for anyone else.", "user": "MrR0bin", "date": "February 3, 2009", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 2.0, "rooms": 3.0}, "id": 24167128}, {"rating": 2.0, "stay_parameters": "Stayed January 2009, traveled with family", "text": "I cant comment on the restaurant but we did have room service and the food was very good.", "title": "Freezing air con in January!", "user": "bathtravellerUk", "date": "January 30, 2009", "detail_rating": {"front_desk": 5.0, "service": 2.0, "cleanliness": 2.0, "value": 2.0, "rooms": 2.0, "location": 3.0}, "id": 24038795, "likes": {"liked": "— Cost", "disliked": "— Cold dining room"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2009, traveled as a couple", "text": "We will def be using this hotel again :0)", "title": "Room 601", "user": "WhydWeGoThereAgain", "date": "January 30, 2009", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 24034621, "likes": {"liked": "— Nice, clean room", "disliked": "— Noise"}}, {"rating": 1.0, "stay_parameters": "Stayed January 2009, traveled as a couple", "text": "We booked a short ‘getaway’ weekend at this Business/Conference orientated hotel and stayed for a couple of nights in a Premium room. The hotel building is an amalgamation of an old mansion house which has plenty of character, historic paintings, large rooms, tall ceilings and fireplaces all over the place joined to a modern concrete annex which housed some more guest rooms, conference suites, the restaurant and bar and spa facilities. It is situated in a park with a golf course in the arse end of nowhere, about 30 mins drive from Reading. On the same site is a BMW Academy and another large company training building (KPMG I think)", "title": "AWFUL!", "helpfulness": 2, "user": "Happyholidaymaker19", "date": "January 29, 2009", "detail_rating": {"front_desk": 4.0, "service": 1.0, "cleanliness": 1.0, "value": 2.0, "rooms": 1.0, "location": 4.0}, "id": 24008320, "likes": {"liked": "— The location", "disliked": "— The Room!!"}}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "stars": 3.5, "variance": {"poor": 148, "average": 190, "very good": 214, "terrible": 86, "excellent": 99}, "aka": "De Vere Venues Wokefield Park Hotel", "slim_ranking": 1.0, "detail_rating": {"service": 3.0, "cleanliness": 3.5, "value": 3.0, "sleep": 3.5, "rooms": 3.5, "location": 3.5}, "description": "The Mansion House has 87 luxury bedrooms each with unique features and Wellington Lodge has 40 modern en-suite bedrooms. All refurbished accommodation features en suite, free high speed internet access, LCD TV with Sky Channels, DDI telephones and hospitality tray. Meeting & Syndicate Rooms: 18 meeting rooms & 36 syndicate rooms with main rooms offering natural daylight and a maximum capacity of 450. Leisure-time: Indoor pool, mini-gym, fishing, ropes course, golf - 18 hole championship course, driving range, pro shop, putting green."}