{"user_rating": 3.0, "review_count": 603, "name": "Deer Lodge", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "Stayed here for a night just before Christmas 2012. Lots of snow; a winter wonderland. Good spot for winter activities that is less expansive than staying in the nearby Fairmont Chateau Lake Louise (and is a 5-minute walk away). If you are skiing or taking advantage of the activities on and around Lake Louise, it is a nice base. We did not try the restaurant unfortunately, as we have heard it is good. The room is on the rustic side, but for the price in that location it was fine. Hallways are a little noisy due to wood construction. Would be wonderful in the", "title": "What a setting", "helpfulness": 4, "user": "mr_kuiper", "date": "December 30, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 148389974}, {"rating": 4.0, "title": "Winter wonderland", "text": "We stayed 2 nights here and for us it was enough. Don't get me wrong we loved this hotel but if you are not skiers there is not a lot to do. We came here to see snow and boy, did we get snow! It is breathtakingly beautiful and I didn't tire of looking at the scenery. It is a very short walk walk to the Fairmont which has a bit more to do there..ice skating, snow shoeing etc. We ate at the restaurant at Deer Lodge and the food was wonderful especially the Christmas dinner. It is a lovely quaint hotel and if you are into snow sports or relaxing then this is the place for you.", "helpfulness": 3, "user": "Paul_and_Marnie", "date": "December 26, 2012", "id": 148093431}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "I recently worked out west, and decided to stay at the deer lodge before starting my work at a close hotel. The location is perfect. you dont have to spend the crazy amount to stay right on the lake with the Fairmont, when you can stay a 2 minute walk away, maybe even less at this hotel. The room that I stayed in with my mother, had 2 single beds. It was quite small really, only had the beds and the bathroom and a desk. But then i went over to my uncles room and saw how big it was. It had a nice little sitting room, and a lovely queen bed. So it all depends on what room you are looking for and how much you want to spend. Dont get me wrong, i loved our room, it was cute, but if you want something bigger it is available. We ate breakfast at the hotel as well, and it was not included, but was delicious. I had a meal that had a whole bunch of different meats to try. Yum. One thing to remember is that they always have coffee available free in a different room, so dont waste your money buying it at the restaurant. also, one of my favourite things is the hot tub. It is located on the roof outside and gives you a view of the mountains and lake.", "title": "Family travels", "helpfulness": 5, "user": "jenna t", "date": "December 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 147976145}, {"rating": 5.0, "title": "Quaint Mountain Lodge", "text": "This place is a gem! Surrounded by the proverbial \"Winter Wonderland\" we were shown to our authentic 1920's Tower Room. No lifts but a lovely staffer bounded up the stairs with our 2 big bags. And speaking of staff we were attended to at every turn by excellent people - the 3 who looked after us were all from Australia. We parents in Australia have done a good job with our exodus of 20 something's who have migrated to Canada for the Winter work! Thanks Samantha & the boys from Adelaide. Gavin, you're doing an excellent job at Deer Lodge. Whatever you're doing, keep it up!", "helpfulness": 7, "user": "coolyback", "date": "December 11, 2012", "id": 147208062}, {"rating": 3.0, "title": "Pleasant stay", "text": "The rooftop spa in the minus 10 temps was a treat as well.", "helpfulness": 2, "user": "Sara_and_Paul", "date": "November 27, 2012", "id": 146310705}, {"rating": 5.0, "title": "Cozy Lodge", "text": "Great Lodge experience, clean , friendly, great views, close to ski hills, lots of character, good value, ski shuttle, good internet, room was renovated,if your looking for a different hotel experience then your every day Deer Lodge is a good choice, you can appreciate the histrory of the hotel", "helpfulness": 3, "user": "733Neil_L", "date": "February 20, 2013", "id": 152647142}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled with friends", "text": "Lake Louise isn't Vegas and the Deer Lodge isn't Mandalay Bay. If you're staying in Lake Louise for the skiing, the DL provides clean, warm accommodations. It's definitely an older building, but the Heritage wing provides comparable accommodations that you would get at a modern chain hotel. Staff is friendly and welcoming.", "title": "Nice Lodging for a ski stay", "helpfulness": 2, "user": "10mish", "date": "February 16, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 152257629}, {"rating": 4.0, "title": "Something different with Character", "text": "The lack of TVs in the rooms is at first disappointing, but the defined common areas provide enough entertainment to pass the evenings. If you're more of a private person and would prefer staying in your room, bring a laptop. We found that the WiFi was fast and certainly enough to stream youtube videos.", "helpfulness": 3, "user": "Lee W", "date": "February 11, 2013", "id": 151891677}, {"rating": 1.0, "stay_parameters": "Stayed January 2013", "text": "My only criticism was the restaurant. At premium pricing, the food was average at best. It felt like we were getting the last prep prior to a new shipment coming in (browning fruit, aging bread and rolls). Edible, but inferior to your average Denny's or Smitty's experience.", "title": "Mister, mister, get me outta here!!!", "helpfulness": 2, "user": "Nathan36", "date": "February 2, 2013", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "location": 5.0, "service": 2.0, "rooms": 1.0}, "id": 151237628}, {"rating": 4.0, "stay_parameters": "Stayed December 2012", "text": "Overall, the Deerl Lodge provided exactly what we were looking for, clean, convenient, friendly accommodations to rest our heads for a weekend of skiing.", "title": "Lovely Lodge at Lake Louise", "helpfulness": 3, "user": "Wendy M", "date": "January 28, 2013", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 150802779}, {"rating": 1.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "I have never written a review before especially a bad one but I feel very strongly about this matter and I am quite sad...I recently spent a night (December 30, 2013) at the Deer Lodge with my husband and 17 month old son. I forgot my son's Christening blanket - I was hand crochet by my mother. I called from the car on my way home to Calgary to tell some that I forgot it on the bed - explain the sentimental attachment but was told they were very busy and someone would get back to me. I then called again and once again...on the third try I asked for the General Manager who returned my call three days later and said he would speak with housekeeping ...that was January 11, 2013 - I still haven't heard back. I have called since then too!", "title": "Unresponsive", "helpfulness": 5, "user": "serene123", "date": "January 25, 2013", "detail_rating": {"value": 1.0, "sleep": 1.0, "rooms": 1.0, "service": 1.0}, "id": 150626711}, {"rating": 2.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "I still cannot believe no one has responded...I am going to visit my parents next week (back in the states) and sadly I will not be able to use the blanket my mother worked so hard on. I know it is my fault for forgetting it but I cannot believe this was not resolved easily. I have forgotten things in the past and the hotel has always responded and has even sent the item to me at no cost.", "title": "Details missing and lots of things broken...", "helpfulness": 1, "user": "Aivers", "date": "January 24, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 150541079}, {"rating": 4.0, "stay_parameters": "Stayed January 2013", "text": "Deciding to get out to Lake Louise for a few days of skiing, we couldn't stay out at our favourite rustic location because they weren't open on Wednesdays. The Deer Lodge got on our short list because it looked rustic and was well reviewed. What sold us was the outdoor rooftop hot tub.", "title": "Wayyyy better than the Fairmont!", "helpfulness": 2, "user": "Julia1990222", "date": "January 23, 2013", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 150426975}, {"rating": 3.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "Unfortunately the hot tub was closed for the rest of the day on Thursday when we got back from skiing. In addition to this, their shuttle bus was out for repair, the in room safe was locked open, the bed sheets we not clean and waitress in the restaurant couldn't open a bottle of wine. The shower nozzle barely functioned, the wireless Internet was spotty and heat was unbearable in the room and throughout the hotel.", "title": "Picturesque mountain lodge", "helpfulness": 2, "user": "2travelgeeks", "date": "January 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 5.0}, "id": 150196763}, {"rating": 5.0, "stay_parameters": "Stayed December 2012", "text": "I think the staff are doing the best job possible but the owners/management just aren't willing to put the time and money into this property.", "title": "The best", "helpfulness": 4, "user": "KLBudvarson", "date": "January 2, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 148624586}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with friends", "text": "We arrived at Deer Lodge at around 11 in the morning and were told check in not until 4pm but thankfully we were given our room earlier. The rooms are small and bathroom tiny but the common area's well and truly make up for this. We were not skiers so not a lot to do but soak up the character of this lodge. We had dinner in the restaurant, I tried the Carribou very nice.", "title": "Enjoyed our Stay", "helpfulness": 1, "user": "Susanna61", "date": "March 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 2.0, "rooms": 2.0, "location": 5.0}, "id": 154888108}, {"rating": 1.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "Had a few red wines by the open fire and because no Television we got to meet some really lovely people and had some great laughs.", "title": "Buyer Beware", "helpfulness": 2, "user": "kla122968", "date": "March 17, 2013", "detail_rating": {"service": 2.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 4.0}, "id": 154858465}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled solo", "text": "The hot tub on the roof is beautiful nice and warm with the snow falling around us.", "title": "4 Stars if You're in the Mood for Rustic", "helpfulness": 2, "user": "Mark M", "date": "March 7, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 153978184}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled on business", "text": "Restaurant staff are very friendly.... .", "title": "Perfect stay at lake Louise", "helpfulness": 2, "user": "Amy M", "date": "March 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 153919401}, {"rating": 5.0, "stay_parameters": "Stayed February 2013", "text": "This hotel has a lot of potential, but buyer beware.  There is a reason there is about an even split between good and bad reviews.  It truly seems to depend on what day you are there and what room they give you.  But overall, the property is very run down and can be left understaffed and thus is unable to reliably deliver an as-advertised product.  You might be ok, and you might have a nightmare.  Over two nights, we had both.", "title": "Spectacular", "helpfulness": 2, "user": "Dirtdogg", "date": "February 22, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 152801527}], "location": {"country": "Canada"}, "stars": 3, "variance": {"poor": 116, "average": 131, "very good": 184, "terrible": 83, "excellent": 89}, "aka": "Deer Hotel", "slim_ranking": 0.833333333333, "detail_rating": {"service": 3.5, "cleanliness": 3.5, "value": 3.5, "sleep": 3.5, "rooms": 3.0, "location": 4.5}}