{"user_rating": 4.0, "review_count": 260, "name": "Deetjen's Big Sur Inn", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "My wife and I spent three nights here based on a friend's recommendation. The food in their restaurant was consistently delicious and satisfying. Deetjen's service was excellent! They have a nicely chosen wine list with reasonable prices. Besides looking forward to the meals we loved our accommodations. It wasn't fancy but it was comfortable and unique. Our room, The Faraway Room, had it's own wood burning fireplace and enough space to sit around, read and relax. We felt \"faraway\" from the busy life of a city. The rooms are like little cabins nestled in a small canyon with ample parking and easy access. Deetjens is located just a few miles from several state parks and a couple of much fancier resorts. Those are fun to visit to compare and to take in their view(s) of the foothills and ocean. Those places are hundreds to over a thousand dollars more per night and aren't that much different than other resorts in that category. Deetjens and The Big Sur Inn is totally a one of a kind experience. The locals seemed to go there for breakfast or to meet for a glass of wine in the evening. It feels like a bit of history is being preserved and it's not about to change. We also laughed at the comments written in the journals/diaries left for that purpose in our room. Every room has eight to ten diaries going back about ten years. Guests may write about their experience and they vary from being philosophical to \"naughty\". I highly recommend staying here if you're willing to look for perfection in imperfection. It was a wonderful stay and we look forward to staying again.", "title": "Deetjens was wonderful!", "helpfulness": 5, "user": "topazhorse", "date": "January 3, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 52470277}, {"rating": 3.0, "stay_parameters": "Stayed December 2009", "text": "Deetjen Big Sur Inn is in a beautiful place and has an award wining restaurant which we enjoyed very much. However, if you stay there during the winter, understand that all the attention to detail in the restaurant is not true for the lodging which is just a step above camping. Also, there is limited service in case of a problem. Our heater did not work for two days in 40 degree temp and it was hard to get help to fix it. In addition, there was a mouse living in my room. There was no one on duty to discuss an adjustment in my rates and, after returning home, I called. The best they would do was a $150 credit for my next visit - frankly, with this treatment, I would decline going again to anything but the restaurant. Just want people to be prepared if you go and it is cold.", "title": "Just so you know before you book this hotel....", "user": "flyfishercakes", "date": "December 28, 2009", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 5.0, "service": 2.0, "rooms": 2.0}, "id": 52017487}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "We stayed in two different rooms at Deetjen's because we loved it so much, we extended our stay. The first room was the \"honeymoon\" room - it had a beautiful private garden patio and a wood-burning stove inside. It was beautiful and extremely romantic. The second room we stayed in was a walk away from the main inn, under the redwoods - I think it was called \"faraway.\" This room wasn't quite as gorgeous, but had a lovely porch under the trees and was right near a stream that we could hear from our bedroom. Both rooms were beautiful in very different, rustic ways - we really liked the antique feel of the whole place. We also loved the restaurant - it was so romantic in the evening, the dinner was delicious, and the brunch was incredible. I thought that Deetjen's added a level of magic and romance to our few days in Big Sur that we would never have found in one of the more modern hotels in the area. I would recommend this inn to anyone who like things a little bit off of the beaten path - it was really an unforgettable experience.", "title": "magical experience at Deetjen's", "user": "ptw12", "date": "December 26, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 51906877}, {"rating": 1.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "Just spent a 3 day weekend (San Simeon, Big Sur & Carmel by the Sea) with a stay at Deetjens. We didn't quite understand the lack of hospitality - painfully forced when we did have any. I don't know if the 'not for profit' sham - Oh I'm sorry I meant, not for profit status, had anything to do with it. For us, our sanity and money, I would probably stay at Treebones or just spend the day in Big Sur and go up to Carmel by the Sea (only 29 miles away). In Carmel by the Sea we stayed in a luxurious 3 room suite, with fireplace, bathtub and king bed with down comforter and feather bed topper. Oh yeah, the service and hospitality we received in Carmel by the Sea was light years away from the bitter atitude we experienced with the Big Sur hippy ladies!", "title": "Atitude & Service Needs Improvement", "helpfulness": 4, "user": "paulmurphyhomes", "date": "November 17, 2009", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "location": 4.0, "service": 1.0, "rooms": 2.0}, "id": 49416575}, {"rating": 4.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "Loved Deetjens. Had just stayed in chain motel with no character whatsoever and Deetjens was the opposite. Its made up of various log cabins surrounded by trees, flowers etc. Our room was small but charming with lovely old furniture and the breakfast fabulous.", "title": "Lovely inn packed with character", "user": "WestEndTravellers", "date": "November 15, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 49253208}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "I was seeking to revisit my past travels in the Big Sur. The Inn made me feel that I had never left. My husband immediately hated the Inn and then fell in love with it.", "title": "Deetjens and the Big Sur Remain True to Self", "helpfulness": 1, "user": "travelerseattle", "date": "September 23, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 80765519}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled solo", "text": "I prefer to stay in places of interest and this did not disappoint. The rooms are rustic and therein lies the charm. There are no locks on the doors. Our neighbors were friendly, quiet and helpful with suggestions of things to do.", "title": "Can't wait to return", "helpfulness": 1, "user": "ccwww591", "date": "September 23, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 80740358}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "Journals are amazing and very addictive. I would like to see some of them published.", "title": "Magical!", "user": "Zimbonomad", "date": "September 19, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 80108018}, {"rating": 3.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "I bought the Inn's book and it is a beautiful inspiration.", "title": "Unique - good for a night", "user": "Stephen_and_Anna", "date": "September 13, 2010", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 1.0, "sleep": 4.0, "rooms": 2.0, "location": 5.0}, "id": 79411290}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "Don't miss the Esalen baths and Nepenthes.", "title": "Wonderful place to stay.", "helpfulness": 3, "user": "jmsubscriber", "date": "September 5, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 78349971}, {"rating": 2.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "I liked the concept of Deetjean's, but not the reality. For nearly $200/night, the carpet should not be stained, the curtains and window screen should not be torn, the bedspread should not be dirty, and the mattress should not be lumpy and without a box spring. None of these things would cost very much to repair or replace, but have been neglected.", "title": "Rundown and seriously overpriced", "helpfulness": 4, "user": "natasha96", "date": "August 26, 2010", "detail_rating": {"service": 3.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 4.0}, "id": 76901507}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "Those looking for peace and quiet should also look elsewhere--Deetjean's is located right on the highway and you will hear traffic from Hwy 1 all night long.", "title": "Cosy wooden cabins in a beautiful location", "helpfulness": 1, "user": "Bowbutcher", "date": "August 17, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 75686089}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "I grew up on the coast of Northern California and understand the concept of quaint country living, but this this hotel is not worth more than $100/night max.", "title": "Wonderful extraordinary experience", "helpfulness": 1, "user": "cinchbald", "date": "July 29, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 72802219}, {"rating": 4.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "Stayed here with husband and 12 yr old daughter in the Antique apartment cabin and we loved it.", "title": "An amazing experience in a beautiful location", "helpfulness": 1, "user": "David56W", "date": "June 7, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 66725774}, {"rating": 3.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "I liked the fact that all of the cabins are different, each with individual style-some small and cosy for couples, others like little houses suitable for larger families or groups.", "title": "Rustic and romantic but too noisy and expensive", "user": "Chocolate74", "date": "May 7, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 63514233}, {"rating": 4.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "Went on a 24 night honey moon trip across the USA and we stayed 1 night in this hotel. It was recommended by my brother and I stayed in a cabin with a bathroom but no fireplace. It took a while to reserve as you cannot do it online, you have to call. My experience was that I had to call about 6 or 7 times in a row before I got through.", "title": "highly recomended, very romantic, great restaurant, dotty staff", "helpfulness": 1, "user": "skinnydipping", "date": "April 19, 2010", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 2.0, "sleep": 1.0, "rooms": 5.0, "location": 5.0}, "id": 61911556}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled on business", "text": "Overall the place is great, I have never stayed in a wooden cabin before so it was a great experience. We were so taken by the place when we arrived that I asked the girl at “reception” whether we could stay another night. I think the girl is called Hannah, she noted down our interest and said we would be told the next day whether we could stay an extra night.", "title": "Fabulous", "helpfulness": 1, "user": "Josietravels", "date": "April 18, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 61857112}, {"rating": 4.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "The cabin we stayed in was an isolated little cabin right at the end of the property, it was very small with tiny bathroom and tiny double bed –this made it all the more cosy and enjoyable. In spite of this I have to confess that it was one of the worst nights that I have had. This is not the fault of the owners or the hotel, but due to constant rain smacking on the low roof and glass window in the ceiling which meant that I was continually woken up all through the night.", "title": "A once in a lifetime experience", "helpfulness": 2, "user": "MBelleDublin", "date": "March 18, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 58921767}, {"rating": 4.0, "stay_parameters": "Stayed February 2010", "text": "We had dinner in the restaurant, I had crab cakes and sea bass and my wife soup and pasta, I have to say that the pasta that my wife had was possibly one of the best pastas I have ever tried (and I’ve frequently been to Italy: Venice, Florence, Rome, Naples with my Michellin guide). The Restaurant in this place is great with an exceptionally romantic ambiance, and the lady that served us recommended a good and well priced red.", "title": "Rustic Beauty- Fantastic Food", "helpfulness": 1, "user": "suncia", "date": "March 8, 2010", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 58066417}, {"rating": 5.0, "stay_parameters": "Stayed February 2010", "text": "Alas, the next day we were told that we could not stay another night. The way we were told this was a bit strange as the man at “reception” could not find any notes that we had requested another night and had to slip away up some stairs to consult with someone and returned to say that we could not stay –it was a bit strange and added to my feeling that the place is a bit cultish or clique. Breakfast, by the way, was excellent, one of the best breakfasts I had in the US.", "title": "An oasis of calm", "user": "Freakboy", "date": "February 2, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 55036536}], "location": {"country": "United States", "city": "Big Sur"}, "variance": {"poor": 13, "average": 27, "very good": 72, "terrible": 12, "excellent": 136}, "aka": "Deetjen`s Big Sur Hotel", "slim_ranking": 0.625}