{"user_rating": 5.0, "review_count": 377, "name": "Delfino Blu Boutique Hotel", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled with family", "text": "We have just got back from a week at the Delfino. What a great place to stay, the hotel is on the beach with a fantastic pool and super friendly staff that will go out of there way to make your stay memorable. A lovely place for families (our son is 19 months) also couples who just want some time out!!", "title": "Would go back again!!", "helpfulness": 1, "user": "ladyt26", "date": "September 7, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 78653549}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "The first thing you notice in this hotel is the view. It is located right on the sea-front and so from most places (pool, dining area and most rooms) you can enjoy the sea and beautiful sunsets.", "title": "Beautiful and romantic hotel, in an authentic Greek location", "helpfulness": 2, "user": "MrsTigerLily", "date": "September 5, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 78389173}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled with family", "text": "The staff are very nice and are always around to help. The food is delicious; the breakfast buffet is full of variety with choices for everyone and dinners are beautifully presented with generous portions, the servers make you feel very much taken care of - remembering my sons personal preferences every morning.", "title": "Just perfect!", "helpfulness": 2, "user": "isa_maette", "date": "September 5, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 78383727}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "The local people are very friendly and the rustic yet pretty town is full of great restaurants, with plently of shops to buy souvenirs from. Spiro from the local '4 Seasons Travel' provided us with fantastic boat trips to neighbouring islands and other parts of Corfu, which included the nice touch of being picked up and dropped off at our hotel.", "title": "The most perfect hotel with 5* + treatment. A truly wonderful holiday", "helpfulness": 1, "user": "Suz303", "date": "September 3, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 78165612}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "+ Very friendly staff", "title": "Best end for our Corfu holiday", "user": "salvavigo", "date": "September 2, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 78034363}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with friends", "text": "We just returned from five days in heaven at Delfino Blu. We were looking for a small, intimate oasis for four couples to celebrate a longstanding friendship, in Greece, away from commercialism but with enough options for everyone to be entertained. From the minute we arrived we knew we had done our internet surfing well. It is even more gorgeous than the photos. The owner and staff made us feel like a part of their family. All of the services and amenities were personal and there was maximum attention to detail. We enjoyed lovely breakfasts and dinners on the dining terrace in the moonlight, the breakfast was the best we had seen travelling through Italy and Greece, and we were presented with a wonderful five course dinner every night, each unique. During the afternoons, we enjoyed being catered to at the pool and beach bars, parasailed, rented boats, rented Vespas and walked the beach. So much to do and see, we all plan to return as soon as possible. Thanks to Kostas, Yvette and the great team at Delfino Blu..", "title": "Better than we imagined!", "helpfulness": 1, "user": "Groupof8", "date": "September 1, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 77861197}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "The hotel is beautifully laid out, the attention to detail is first class and the standard of service without exception places this as one of the top 3 hotels we have ever stayed in!", "title": "Small is beautiful!", "user": "bclose2", "date": "August 30, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 77442183}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "This hotel is superb and rivals some beautiful hotels we've stayed in within the Far East. The rooms & public areas are spotless, the food is excellent, the staff are friendly and nothing is too much trouble. The views are fantastic, the main pool is large enough for the size of the hotel & the children's pool next to it was great too. There was no rush to get a lounger around the pool. The beach is adjacent to the beach bar at the bottom of the hotel and was excellent and deserves its blue flag award. It has both powder sand and for our young children, sand suitable for sandcastle building. The beach shelved very gradually and was a dream for children. Before we left we booked again for 2 weeks next year; that says it all. If you want a holiday to remember whether as a couple or family it's perfect.", "title": "Perfection!", "user": "Tucks4", "date": "August 26, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 77007943}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled with friends", "text": "One thing though; beware of the rogue doughnut seller on the beach. He alters his prices depending on the person and tries to appease with free fruit; he's a con.", "title": "Best hotel I've ever stayed at!", "user": "i_konst", "date": "August 24, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 76652095}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "We had the garden view suite. This hotel is a dream. A family owned hotel with an incredible owner and family. Amazingly friendly and nice staff. Was served a nice refreshing welcome drink. Room was stunning, with fresh fruit, bottles of water and a bottle of wine waiting for us to drink. It included almost a full kitchen with a coffee maker and even a panini maker! There is a jacuzzi in the bathroom as well. From the veranda we could see the amazing sunset which the owner's family enjoys watching daily. The hotel a great pool (closes at 7 or 8pm though for cleaning) and has free sunbeds down the stairs at the stunning crystal blue water beach of Agios Stefanos (only downside you have to walk a while till the water is deep enough to swim). There is also a beach bar of the hotel down the stairs. The restaurant of the hotel was great and the food was great! Amazing view of the sunset from the Restaurant and the hotel in general. There was nice live music too. We did not do breakfast at the hotel so we cannot comment on that. The hotel has free wifi, and impressively enough, powerline internet via a powerline/ethernet adapter. The price for the room was really great for the quality of the room and service we received. Will most certainly come back again soon.", "title": "a wonderful hotel with the personal touch", "user": "linandal", "date": "August 4, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 73802319}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "As we got back from a week at the Delfinoblu, there had been written some 130 reviews from this gem in San Stefanos, Corfu. Believe me, it is all true. For us the friendly atmosphere in the place made all the difference in the world. There is really nothing more to say. Thank you to Kostas, Yvette, the boys in the restaurant and everyone in the \"blu\" heaven...", "title": "Awesome!", "helpfulness": 1, "user": "GiroNorway", "date": "September 18, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 79999814}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "We also agree with the good reviews for this hotel. We stayed there for a week in early September and we really liked it. What makes this hotel so memorable is the 5-star service mentality of the staff. It was very obvious that the owners make a special effort to ensure that the hotel is well-run and to hire the right staff. It has only about 15 rooms which creates a relaxing atmosphere during meal times and around the pool, as opposed to the 'mass process' and hectic ambience many big hotels have especially during breakfast - it really has a genuine 'boutique' feel. The rooms are spacious and very clean and the beds are comfortable. We would recommend the hotel both to families and couples. We ate at the hotel restaurant every evening, the food is unpretentious and the ingredients of good quality . There aren't any other interesting options for dinner in the village but Delfino's restaurant offers a very big and varied menu, so we did not get bored eating there every evening - the views from the restaurant are also wonderful and there is a romantic ambience despite the many families dining there. The only criticism we have is that they should be a bit more relaxed about the beach towels. Thank you very much Delfino staff for a lovely holiday!", "title": "Excellent hotel just steps from a beautiful beach", "user": "Christina074", "date": "September 17, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 4.0}, "id": 79921442}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "Having so many Greek islands to choose from, my husband selected Corfu and then Delfino Blu based on other tripadvisor comments. It was everything I could have wanted for my 30th birthday. The staff was incredible, all smiles and eager to please - they even surprised me with cake and champagne on my birthday. Our beach front room was cozy and offered great views of the pool, sea and colorful sunsets. Our rate included half board - breakfast & dinner, but we chose to sample some island food as well. Come to find out, Delfino Blu had the best of it all. It was one of those vacations where you spend the whole time saying, \"when do we get to come back?\"", "title": "Charming hotel offered the perfect get away.", "helpfulness": 1, "user": "brooke4pr", "date": "September 17, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 79867052}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "The service and friendliness of the staff was exemplary and more than met our expectations. Everyone seemed to take a genuine pride in ensuring that we had a fantastic weeks stay. We were warmly welcomed by Kostas and the 'lovely Yvette' was always around to offer helpful advice and information", "title": "Our 'Blu' Heaven", "helpfulness": 2, "user": "wendy41", "date": "September 14, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 79551960}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "The location was perfect and the design and decor of the hotel was spotless, tasteful and charming with some lovely and thoughtful individual touches. Our bedroom was spacious and the large terrace had a fantastic view of the sea and some amazing sunsets.", "title": "Absolutely Fabulous", "helpfulness": 1, "user": "monina66", "date": "September 9, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 78899416}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "We stayed at Delfino Blu for one week in July with four children - 2 teenagers and 2 young children. It was perfect for us. As everyone says, the hotel is immaculate from the rooms to the landscaping. For us, staying in a small hotel is ideal. We did not need to worry about our younger children getting lost. They could wander from beach to pool, from beach bar to sea without any worries. The staff are fantastic, so welcoming and always smiling. Having no road between the hotel and the beach is a big plus point. We have already booked for next year.", "title": "A perfect relaxing holiday", "helpfulness": 1, "user": "devonlady45", "date": "August 2, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 73347875}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "Upon arrival, we got a warm reception from Kostas, the owner who was truly amazing and really made you feel like you were at home.", "title": "Most perfect hotel ever!!", "helpfulness": 2, "user": "Italyl0ver", "date": "July 31, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 73154173}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "The level of service we encountered was unprecedented: the service is exceptional and there is a generosity of spirit evident in little touches (a small 'good night' card left every night on the bed!) and a real desire for the guest to have a relaxing time. The staff is extremely friendly to the point that you feel you are staying with friends.", "title": "Top quality hotel with really helpful staff and fantastic views of the sunset .", "helpfulness": 1, "user": "KeithLouise", "date": "July 26, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 72439594}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "Our daughter was sick and Kostas was very helpful and friendly: he was very kind and made every effort to help until she was better.", "title": "Breathtaking Experience", "user": "Moonraker1", "date": "July 25, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 72214094}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "The rooms and grounds of the property are spotless. I feel the need to repeat this to emphasize the cleanliness . SPOTLESS.", "title": "Paradise", "helpfulness": 1, "user": "flossy88", "date": "July 20, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 71661413}], "location": {"country": "Greece", "continent": "Europe"}, "stars": 3.5, "variance": {"poor": 0, "average": 0, "very good": 20, "terrible": 2, "excellent": 355}, "aka": "Hotel Delfino Blu Boutique", "slim_ranking": 0.2, "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "description": "Delfino Blu is a small boutique hotel that will bewitch you with its beautiful simplicity. It is amphitheatrically built at the foot of a hill by one of the most beautiful beaches of the island. Particular attention has been drawn to details and aesthetics, combining Corfiote tradition with modern living."}