{"user_rating": 3.5, "review_count": 794, "name": "Delle Nazioni Hotel", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed February 2006", "text": "Stayed at this hotel for 3 nights in Feb.", "title": "great value hotel", "helpfulness": 6, "user": "grenadier", "date": "March 1, 2006", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 4566105}, {"rating": 4.0, "stay_parameters": "Stayed February 2006", "text": "The location is a great plus for transpotation around the tuscany area and trains to other parts of italy. The 2 min. walk to the train station with connected small supermarket was very convienent for short trips to surrounding Pisa & Lucca. Accross the street from here is also access to the SITA bus terminal for excursions to Sienna & San Gimignano (a must!!)", "title": "Very Convenient- Nice Hotel", "helpfulness": 7, "user": "ldub33", "date": "February 25, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 3.0, "service": 4.0}, "id": 4519205}, {"rating": 5.0, "stay_parameters": "Stayed February 2006", "text": "There are very good restaurants in close proximity to the hotel and just a pleasant short walk to the center of town & museums.", "title": "Location Location Location", "helpfulness": 3, "user": "PipLongsox", "date": "February 10, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 4450341}, {"rating": 4.0, "title": "Great location", "text": "The rooms were large for italian standard and adequately furnished. Bathrooms were a bit crowded and the shower temp. was unregulated. The air temp in the room was cold trough-out our rainy stay.", "helpfulness": 2, "user": "Roineval", "date": "January 22, 2006", "id": 4369674}, {"rating": 4.0, "stay_parameters": "Stayed January 2006", "text": "The breakfast was very good with a nice selection of food and differnent types of coffee. The 6 terminals with free internet access in the lobby were helpful, and an added bonus for checking train & bus schedules.", "title": "Pretty good hotel except the bathrooms.....", "helpfulness": 3, "user": "SanFranExplorer", "date": "January 19, 2006", "detail_rating": {"value": 4.0, "rooms": 4.0, "service": 3.0}, "id": 4361851}, {"rating": 4.0, "title": "Better than expected", "text": "Having had this hotel recommended by a friend, I was slightly put off when I read some negative reviews of it on this site. The Delle Nazioni turned out to be better than I expected. The hotel was fully refurbished inside with friendly English speaking staff. The room was basic, but modern and clean. The bathroom was again clean, however quite basic, with no shower holder. Breakfast was simple but perfectly edible. The only drawback was the area being close to the train station and busy road. At night there were many youths hanging around this area, however we did not encounter any problems and felt safe.", "user": "A TripAdvisor user", "date": "January 3, 2006", "id": 4320932}, {"rating": 3.0, "stay_parameters": "Stayed December 2005", "text": "My daughter and I stayed at the Delle Nazioni for five days booked through \"-----\". We were more than happy with our stay. The hotel is very conveniently located as you can walk to just about anywhere in Florence. Upon arrival by train we were able to locate the hotel by following directions from a prior posting. We were in room 426 and it was better than we expected. We had a balcony that had a nice view of the hills above Florence and it was nice to be able to leave the door open during the night. Be sure and keep the curtains closed cause we did get a couple of mosquitoes in the room. The bathroom was very clean with the shower curtain around the floor drain which we found worked just fine for us. All the linen was changed daily and the room was very clean. The continental buffet was very good and they had two coffee machines that you could make your own cup of coffee, expresso, capucchino, etc. The buffet included various breakfast rolls, eggs, sliced ham & cheese, cereals, yogurts, etc. We did not feel the least bit uncomfortable with the people on the streets around the hotel. You must remember that this is a large city and you should't expect it to be like your \"hometown\"! The 24 hr internet access was great!", "title": "Good experience!", "user": "murphy-hupp", "date": "December 11, 2005", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 3.0, "service": 4.0}, "id": 4232388}, {"rating": 3.0, "title": "Good for Price", "text": "Loved the location (close to the termini), had internet for free in the lobby. The room was a decent size. My biggest problem was the bathroom. It was oddly arranged with the toilet close to the shower and a large person would have some problems with the spacing. We stayed there for 70 euro a night for 2 nights. But we also stayed at Hotel Ambasciatori for one night and though it was about 20 euro more it was a LOT nicer. So if you are willing to pay more I would recommend that hotel.", "user": "A TripAdvisor user", "date": "November 21, 2005", "id": 4129722}, {"rating": 2.0, "title": "some problems", "text": "I was immediatly turned off by the stained, dirty looking carpet. It was very warm even though it was in Nov. We opened the windows but the mosquitos swarmed in. The shower was a hole in the floor in the corner of the bathroom with a shower curtain. The beds were clean, at least I think they were. When the carpet is so dirty it makes you wonder. There were clean towels (they were like tablecloths but did the job) each day & the breakfast was good but please fix that carpet!", "helpfulness": 1, "user": "A TripAdvisor user", "date": "November 15, 2005", "id": 4112510}, {"rating": 4.0, "title": "Safer than expected", "text": "Having read some reviews of this hotel we, as pensioners, were rather apprehensive about tales of \"dodgy characters\" and \"threatening transients\" in the vicinity of the hotel. However we have just returned from 6 days at the Della Natione and at no time did we feel unsafe or threatened, we also found the Duomo to be a 7 minute walk away not 15 and we are in our 60's.", "helpfulness": 8, "user": "Timjen", "date": "September 27, 2005", "id": 3941665}, {"rating": 4.0, "stay_parameters": "Stayed July 2006", "text": "This hotel was located basically across the street from the train station in Florence which made it extremely convenient for us as we were arriving by train. We were pleasantly surprised by the hotel's updated decor (seemed to have been recently renovated) and the rooms were a clean, albeit a bit spartan. Our room was quite large and faced the side of the hotel, which made it extremely quiet. The room had air condition (thank goodness, since it was insanely hot outside), which I guess can be a rarity in the area. A few major positives for me were the free breakfast which was included as well as free Internet access (both wireless and workstations were provide) - we have stayed at quite a few hotels in Europe and Internet access is defintly hard to come by (especially free access), which made this big plus. All in all, a great hotel which was very conveniently located in the heart of Florence.", "title": "Great Location, Free Internet Access!", "helpfulness": 6, "user": "figgynewton", "date": "July 7, 2006", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 3.0, "service": 4.0}, "id": 5435290}, {"rating": 5.0, "stay_parameters": "Stayed May 2006", "text": "Close to the train station, it was an easy walk for us, we're in our 70s, with our luggage (we travel light). The front desk staff was most accomodating in assigning our room and we found it quite adequate. Warm, the air conditioning worked well. We had a room on the street side, but the windows kept the noise to a minimum - no problem sleeping. The bar area was very pleasant. Service was good. The food - breakfast - was excellent. Questions we asked were quickly and pleasantly answered. And we liked having a laundromat just two blocks away!", "title": "It surprised us!!", "helpfulness": 4, "user": "demmyjohn", "date": "June 12, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 3.0, "service": 5.0}, "id": 5336266}, {"rating": 5.0, "stay_parameters": "Stayed May 2006", "text": "We have just returned from this hotel. Literally only four days ago. The location is excellent.", "title": "Excellent Value For Money", "helpfulness": 5, "user": "Gallers", "date": "June 2, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 5293702}, {"rating": 4.0, "stay_parameters": "Stayed May 2006", "text": "We arrived at Pisa airport and took an extremely cheap (return fare) bus to Florence Railway/Bus Station, walked for about 3 minutes and we were there! The staff were helpful, the rooms were very clean, the bed was changed three times during our four night stay, the shower was good. The breakfast was good. No bad comment to make at all. We were on the main road and there was no noise at all (we stayed for a Saturday evening). There are excellent restaurants on the same side of the road as the hotel. Excellent value for money we found.", "title": "it was lovely", "helpfulness": 4, "user": "b_5London_UK", "date": "May 28, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 5230270}, {"rating": 5.0, "stay_parameters": "Stayed May 2006", "text": "It was very pleasing to be able to take a very short walk to the bus station and book a sightseeing bus. Again, excellent service and value for money and we would rate this as \"not to be missed\"", "title": "Loved our room and loved Florence!!!", "helpfulness": 6, "user": "clayandtt", "date": "May 15, 2006", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 5075815}, {"rating": 5.0, "title": "i will never forget", "text": "Me and my friend booked the hotel at last minute, I honestly did not expect the hotel to be this good. Starting from the crew, lobby, location (very closed to the Duomo and two blocks from train station) , breakfast, bar....was great!!!!! our room had one queen and one twin bed and xt space for a large dinning table. The bathroom was large and clean, free internet service that was super convinient (we found it really coplicated to find cybercafes in europe) , plus xt computers in the lobby. I will totally come back to this hotel, and i'm refering it to all my friends!!!", "helpfulness": 3, "user": "Glogluxx", "date": "May 4, 2006", "id": 5033134}, {"rating": 3.0, "title": "Great location", "text": "They really made us feel comfortable!", "helpfulness": 3, "user": "A TripAdvisor user", "date": "May 4, 2006", "id": 5032553}, {"rating": 4.0, "stay_parameters": "Stayed April 2006", "text": "*you can see pics of the hotel and rooms from the web site, what you see is what you get.", "title": "Happy with Our Stay", "helpfulness": 2, "user": "rdr49", "date": "April 28, 2006", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "rooms": 3.0, "service": 4.0}, "id": 5016282}, {"rating": 4.0, "title": "Fabulous Location! Great Room! Great Value!", "text": "good luck!!!", "helpfulness": 8, "user": "A TripAdvisor user", "date": "March 20, 2006", "id": 4694979}, {"rating": 4.0, "title": "Great Location-Lovely Staff", "text": "This is a good 3 star hotel which as previous reviewers have said is in a fantastic location for the station, and buses to Siena, San Gimignano etc - and not far away at all from the sights in Florence. The staff were helpful and the the hotel has a large and spacious breakfast room.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "March 17, 2006", "id": 4628973}], "location": {"country": "Italy", "region": "Tuscany", "continent": "Europe"}, "stars": 3, "variance": {"poor": 73, "average": 189, "very good": 313, "terrible": 31, "excellent": 187}, "aka": "Hotel Delle Nazioni", "slim_ranking": 0.410869565217, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.5, "rooms": 3.5, "location": 4.5}, "description": "The Hotel Delle Nazioni in Florence is located right next to Florence's main railway station Santa Maria Novella. All of the major attractions are only minutes walk away. Free high speed wi-fi internet, buffet breakfast and recently renovated rooms with private en suite bathrooms and LCD TV mean that you are guaranteed cheap, comfortable and central accommodation in Florence."}