{"user_rating": 4.5, "review_count": 418, "name": "Delton Grand Resort & Spa", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "We spent a week in a 3 bedroom condo. The resort was on the lake away from the hustle and bustle of the busy main strip - yet very close all of the attractions, restaurants and activities. We were unable to get the lake front unit we wished for, but our condo was nicely decorated, very spacious and clean. The mattresses were average - not a painful night's sleep - but not all that comfortable either. The resort's pool was not much to speak of and there is no fitness facility as advertised. Apparently they were renovating and haven't set it up yet. The resort has an arrangement with a nearby company to rent boats. They will delivery the boat to the dock at the condo - very convenient way to spend the day fishing! Other guests were friendly and very quiet.", "title": "Great location away from the chaos", "user": "TinaAndStu", "date": "September 23, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 80762597}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled with family", "text": "All the luxuries that you have at home. We stayed in the 1-bedroom lakefront villa on Lake Delton. The view of the lake from the balcony was great. There was a spa and an indoor pool that we didnt use but it look very clean. The location is perfect, right in the heart of the main road with all the attractions. There were a couple of stainless grills outside that you could use at your leisure. The decor was ok, there were 2 lcd tv's with built -in dvd players, stainless appliances, no washer or dryer. The bathroom was a good size, shower only but the shower had 4 shower heads. If you want to escape the commotion of the waterparks and looking for luxury this is the place.", "title": "Best Kept Secret in the Dells", "user": "cliffcheek", "date": "September 13, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 79311105}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "The condo we stayed in was amazing! It was excetionally clean and comfortable, and the view was incredible! Very quiet, we could not here any of the people in any of the other units. I was very happy to have stayed there, and the prices were quite resonable. we usually to go Wisconsin Dells every couple of years, and this is the place I will be staying at for now on. They really have outdone themselves!", "title": "the best place I have ever stayed", "user": "sleepygirl_10", "date": "September 8, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 78852504}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "We stayed for a week here with children and grandchildren in a courtyard 3 bedroom 2 bath condo. It was clean and very spacious and very close to the indoor pool. The condo is well situated in Lake Delton, being near water parks, attractions and restaurants. We especially liked that we could enjoy breakfast together before heading out for a day of touring. Definitely a good value...would stay again. Would have like to have secure wifi but it really wasn`t necessary...being on vacation we needed to put our computers away!", "title": "Great for extended family stay!", "user": "JetTraveller", "date": "September 4, 2010", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 78259258}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with friends", "text": "The resort is a great relaxing place quiet and relaxing. The Spa is even better, they catter to your needs very well.", "title": "A Leisure and relaxing trip.", "user": "sonyalutz", "date": "August 30, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 77595950}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "This was our first time at Wisconsin Dells. I looked into a variety of hotels there and wanted a place that was quiet, overlooked the lake, and relaxing and not alot of noise with kids since it was just the two of us. The Rhapsody was the place. The room descriptions on the website matches the room perfectly....the massage showers are NICE! The one thing that is advertised at the resort was wireless internet. I was not able to connect to the internet with my laptop. Also the bed was not very comfortable to sleep in. The counch was actually more comfortable than the bed. If you planning on doing more relaxing than being out, that might be something you want to consider before booking there, but overall a very nice clean comfortable hotel.", "title": "very nice clean quiet relaxing resort...would recommend it", "user": "teetop11", "date": "August 22, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 76380893}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "The Rhapsody resort and spa is truly a treasure. My whole family loved it, including my teenage sons. It is beautiful, clean, and really really spacious. It is one of the best places I have ever stayed and I am a hotel snob. I booked a 3 bedroom courtyard online and got a very nice deal, however, when we got there, we were upgraded to a huge 4 bedroom courtyard. We were thrilled but unfortunately weren't able to stay in the room due to an allergy problem. Aga was so accommodating and understanding and moved us to a 3 bedroom gorgeous lakefront, which I would recommend spending the extra money. It is so cool to be on the lake watching the boats and people water skiing and tubing. Eating breakfast in the am on the patio makes you feel like you are truly on vacation.", "title": "One of the best places we have ever stayed.", "user": "Leeny48", "date": "August 21, 2010", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 1.0}, "id": 76190460}, {"rating": 3.0, "title": "Decent \"resort,\" unacceptably shabby condo", "text": "Overall Rhapsody has so many positives - it is clean, the rooms are huge and the furnishings and decorations are updated, the shower is to die for like everyone says, the private indoor parking is nice, the grounds are gorgeous, it is off the beaten path, but close to everything, the kitchens are fabulous, my sons loved the massage chair in the unit, so much storage space, nice to have washer, dryer, iron, hair dryer, flat screen tvs, even the products they use (shampoo, etc.) were fantastic, having two piers are nice to just and relax or even fish off of, which my sons did. I also like how they enforce quiet time after 10:00 pm so it's not too rowdy. It is a wonderful wonderful place to stay. I will recommend it to all my friends.", "user": "A TripAdvisor user", "date": "August 20, 2010", "id": 76116939}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "The only negatives are they might want to think about adding a fitness center in the future. My whole family was really bummed they didn't have one and when I was in the office a couple of times (checking in and out), 3 different people came in and asked if there was a fitness center. Also, like I read on other reviews, AT&T service up there really doesn't work, but it didn't seem to work in most of the Dells so that is a problem with AT& T I think.", "title": "Great Getaway!!!", "user": "rahrahh", "date": "August 9, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 74445259}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "I don't think you will be disappointed if you go there. I am really picky and this place was the absolute bomb!", "title": "UNBELIEVABLE Resort and Spa!", "helpfulness": 2, "user": "Olivehan", "date": "August 8, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 74368927}, {"rating": 4.0, "title": "A quiet place on Lake Delton - NOT a resort", "text": "We stayed in the 2 bed/1 bath unit right on the waters edge. It was very clean and inviting inside. Our boys loved the bunk beds and pinball machine in the second bedroom. A wall mounted TV in each bedroom and the living room. The shower in the bathroom was a hit with everyone. Even the kids loved the four-headed shower. All units had a balcolny/patio overlooking the lake.", "user": "FSHR5", "date": "August 8, 2010", "id": 74337273}, {"rating": 5.0, "title": "MUST STAY HERE. I will not consider staying anywhere else.", "text": "The full kitchen was handy too. A full size fridge, oven, microwave and dishwasher was great for meals we had on the property. There is also five grills spread around the property.", "user": "murphychicken", "date": "August 2, 2010", "id": 73500379}, {"rating": 5.0, "title": "Loved this place and will be back!!!", "text": "We didn't use the pools (they were pretty small). We did rent a pontoon boat one afternoon and went swimming and grilled dinner while watching a water show in one of the coves on Lake Delton.", "user": "Tally18", "date": "August 2, 2010", "id": 73333086}, {"rating": 5.0, "title": "Our Honeymoon @ The Rhapsody", "text": "Noah's Ark waterpark is within walking distance of Rhapsody. We ended up driving there anyway since parking was free. I'm glad we did since we spent most of the day there and were tired of being on our feet by the time we left.", "user": "dsmidwyf", "date": "July 30, 2010", "id": 72994356}, {"rating": 5.0, "title": "Shhhh....this is top secret! A perfect getaway with friends.", "text": "One thing we didn't like was no maid service during your stay. I asked the girl behind the counter about extra towels and she told me there was a washer and dryer in each building but couldn't tell me where! I never did locate them.", "user": "Sharejoi", "date": "July 22, 2010", "id": 71965052}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "Very nice place to stay. Close to downtown. Clean, nicely furnished condo. With a great view sunrise.", "title": "Very Nice", "user": "iceal", "date": "October 15, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 83576947}, {"rating": 3.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "My husband and I stayed at this \"resort\" in a themed suite. (we had London Bridge). My parents stayed on the other end of the hall in the \"Asian Flair\" room. When we initially walked in, we thought how beautiful! Our room was nice, but my parents room had some \"issues.\" If you book the London Bridge or \"Surfs Up\" Rooms, you will have a private bathroom. If you book any of the other suites, be prepared to see your partner through an open window that goes from the bathroom to the living/bed area. It's ok if you don't mind seeing someone else shower, but if someone is on the stool, it might be a bit uncomfortable to look out! The rock flooring in the Asian Flair room was nice, but it was coming up in three different spots. It needs to be repaired. There are nice little wine chillers in the room, but no glasses..so bring your own! Just as a FYI- if you have AT&T, you cannot get any reception at all in your themed suite. You must step out of the room and there are no longer phones in the rooms at all. My husband and I booked a massage while we there, and I agree with another post... you get a weird \"truck driver\" sounding guy on the phone.. which made me a bit hesitant, but when we got there.. we had two very nice, professional gals that gave us a couple's massage in the room of the spa that overlooks the lake. When we checked out, they acted like they might need the \"truck driver sounding guy\" to do the credit card, but they ended up checking us out ok. That whole part was just kind of odd. The one big problem with this resort is the quiet factor. You can hear EVERYTHING through the walls. At the massage, we heard kids yelling outside, people cleaning the yards etc. When we walked down to knock on my parent's door in the morning, you could clearly hear that there was some \"action\" going on in the \"Hogs Alley\" Room. LOL The hotel is nice, but for the high price... I might check out another place. Check out the site: http://rhapsodyresort.com/themes/theme-suites.html. It truly shows what the \"themed suites\" look like...", "title": "Nice theme room, but a bit odd", "helpfulness": 1, "user": "beachfun4us07", "date": "October 12, 2010", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 83230099}, {"rating": 2.0, "stay_parameters": "Stayed October 2010", "text": "Found resort online. Booked a three bdrm two bath waterfront. Overall it is in a great location. Beautiful condo.", "title": "Nice place but noise levels ruined the stay", "user": "Windycity21", "date": "October 10, 2010", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 3.0, "rooms": 5.0}, "id": 82918085}, {"rating": 2.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "Bedrooms are roomy with lots of closet space, laundry room with iron and ironing board,washer dryer.", "title": "NOT A SPA, ROOM INFESTED WITH FLIES", "user": "DoctorSR", "date": "October 7, 2010", "detail_rating": {"service": 2.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 2.0, "location": 3.0}, "id": 82385557}, {"rating": 2.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "Kitchen was fully stocked utensils and pantry, stainless steel appliances.", "title": "Skip This One", "helpfulness": 1, "user": "Sojo_Grrl", "date": "September 28, 2010", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 3.0, "sleep": 1.0, "rooms": 2.0, "location": 5.0}, "id": 81415563}], "location": {"country": "United States", "city": "Wisconsin Dells"}, "stars": 3.5, "variance": {"poor": 12, "average": 18, "very good": 49, "terrible": 7, "excellent": 332}, "aka": "Rhapsody Resort On Lake Delton Hotel", "slim_ranking": 0.0555555555556, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 5.0}, "description": "Delton Grand Resort & Spa is a 60+ unit condominium resort located on the shores of beautiful Lake Delton in Wisconsin Dells, Wisconsin. Just a few blocks from all attractions, the resort features 1, 2, 3 and 4 bedroom luxury condominiums from 900 to 3700 square feet. Each villa is professionally decorated and furnished. Amenities include indoor and outdoor heated pools, whirlpool, sauna, beaches, piers, boat slips, outdoor grills, firepits and more. Professionally managed and impeccably maintained, the resort enjoys top ranking at Trip Advisor."}