{"user_rating": 4.5, "review_count": 81, "name": "Dennen's Victorian Farmhouse", "reviews": [{"rating": 5.0, "title": "Loved it!", "text": "This was the first time my husband and I stayed at a Bed & Breakfast, and we could not have picked a better one. Our innkeepers, Fred & Jo were gracious hosts, making sure we were comfortable and satisfied with our accomodations and meals. Our room was the Victorian Suite w/ a two person soaking tub that we used nightly. The room was clean, nicely decorated and had a separate entrance that made the room perfect. The breakfast was absolutely delicious and the grounds were beautiful, that of a country cottage. Would definately stay again.", "helpfulness": 1, "user": "Catlover4", "date": "September 6, 2005", "id": 3846199}, {"rating": 5.0, "title": "Luxuriously Comfortable", "text": "My Husband and I have now stayed at Jo and Fred's Inn on three weedend trips, each of which have been such a treat. We have enjoyed three rooms starting with Creekside, Sunrise and the newly remodeled Victorian Suite. On our next trip we hope to stay longer and book The Quail Cottage.", "helpfulness": 1, "user": "livingattheranch", "date": "April 24, 2005", "id": 3401584}, {"rating": 5.0, "title": "Cozy, relaxing rooms and warm, personal service", "text": "Our stays have been wonderful. Each time it is so nice to have breakfast brought to our room, so we can lounge and not worry about getting dressed to go to a Dining Room on a fixed schedule. The breakfast Jo serves is truly gourmet and it seems She never runs out of recipes. She always prepares something different and delicious from streudels, fretattas, quiche and it all comes with the best coffee.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "February 11, 2004", "id": 1645039}, {"rating": 5.0, "title": "Quail Cottage", "text": "After breakfast we go for a walk at the Cove or shopping in the Village or see the sights. For dinner there are several great restaurants in the area and Jo makes sure we have reservations.", "user": "A TripAdvisor user", "date": "February 3, 2004", "id": 1626580}, {"rating": 5.0, "title": "Excellent experience - Great service!", "text": "In the evening after our night out, we always look forward to returning to our room. We light a fire in the fireplace, relax in the soaking tub and then fall into the most marvelous featherbed. It is truly luxuriously comfortable.", "user": "A TripAdvisor user", "date": "January 31, 2004", "id": 1622643}], "location": {"country": "United States"}, "variance": {"poor": 1, "average": 2, "very good": 9, "terrible": 2, "excellent": 67}, "slim_ranking": 0.714285714286, "description": "Escape to our romantic bed and breakfast in Mendocino County. Sit back and experience amazing ocean views, beautiful scenery, and gracious service at our Mendocino Coast Inn. Rooms at our Mendocino B&B feature custom furnishings and luxurious linens, some with private decks, fireplaces and Jacuzzis. Enjoy an unforgettable gourmet breakfast in bed, complimentary Wi-Fi, and special packages at our inn in Little River, CA, only minutes to the picturesque village of Mendocino."}