{"user_rating": 4.0, "review_count": 130, "name": "Denver Marriott South at Park Meadows", "reviews": [{"rating": 5.0, "title": "Bernadette is the best!", "text": "The hotel is very nice. Great location, easy access, close to tech center, mall, and restaurants. Friendly staff. They even cleaned the snow off the cars! But Bernadette in the Concierge lounge in the evening is the best. She recognizes you as an old friend. Her customer service is superb.", "user": "SusanCouncilBluffs", "date": "May 2, 2013", "id": 159431963}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled on business", "text": "I want to give 5 stars to Bernadette for her extreme dedication in provifding great sevice to us business customers in the evening hours in the 6th floor concierge area. She is more helpful than anyone I have met at other hotels. She makes you feel very welcome and provides a very personal service experience away from home.", "title": "Concierge Service", "user": "Buzz872", "date": "April 30, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 159305498}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled on business", "text": "We had our annual banquet at the hotel and the banquet facilities were excellent and the food was delicious. I found the room to be nice and clean, not very large, but just what I needed. I did notice the hall noise but luckily there was not a lot of traffic during the night. Overall I would highly recommend this property.", "title": "Nice Banquet", "user": "SusanBeams", "date": "April 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 158877910}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled on business", "text": "Stayed there last night on a business trip and it was a very nice place. Great location if you are doing business in South Denver. Staff was great and the on-site restaurant and bar were excellent. Highly recommend it.", "title": "Really nice place", "user": "Keith L", "date": "April 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 158819204}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "Only negative was that the Concierge level group room was a little messy. Not sure if the lady handling the room that night was just too busy but a number of tables needed to be cleaned. I decided to skip this and go downstairs for a drink.", "title": "Wonderful Place!", "user": "Kim F", "date": "April 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 157087908}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "We stayed at the hotel for a few nights and could not have been more pleased. The staff was super friendly and helpful and the property is super clean, newly renovated, safe, quiet, and just outstanding. The exercise room has new treadmills, elipticals, recumbent bikes, weights, etc. The hotel is also close to I-25 and C-470 and is convenient to shopping and dining. We ate the breakfast buffet and it was very good and nicely done. We will definitely be staying here again in the future.", "title": "Newly Renovated, Clean, Quiet, Great Staff...", "user": "OscarColorado", "date": "April 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 156654734}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled with friends", "text": "We stayed at the Marriott South at Park Meadows it is a very nice hotel the staff is wonderful very, convenient to the light rail and many shopping and restaurants in the near area that their shuttle is more than willing to take you to. I defiantly would stay there again. there was 19 of us there to for a Volleyball tournament and we had no problems with anything.", "title": "BEAUTIFUL COLORADO", "user": "TBVOLLEY", "date": "March 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 154650855}, {"rating": 2.0, "stay_parameters": "Stayed February 2013, traveled with family", "text": "My family has stayed at this hotel several times a year while visiting my sister's family in Parker. When we began staying here, we were pleased with the service and amenities and satisfied with the concierge lounge. Over the years, all of this has declined, especially the lounge. This is a premium amenity, and in every other hotel it is treated as such. At this Marriott, it is treated as a way to dispose of left over food from the hotel restaurant. The food was obviously old, in one case we were served cups of moldy fruit, and seemed like it had been stuck in a microwave and thrown in a warming tray. One night \"hors d'ouerves\" consisted of floppy, lukewarm fried foods that had been served the day before at a banquet. I brought my sister up for drinks from the honor bar one night while waiting for the rest of our party to arrive for dinner, and the evening concierge (who in general was quite nice and fawned over my daughter) commented loudly to another group that it was inappropriate to bring guests in who were not staying on the concierge floor and they really needed to do something about that. I am fine with this, however I don't understand why this couldn't have been said to me, privately rather than passive-aggressively gossiped to other people. I have been a patron for many years and would expect at least that much courtesy. There was a smell of backed up sewage on the top two floors for several hours one night. Aside from the lounge, a pizza we ordered from room service was completely inedible, (cold and hard as a rock) and twice a maid came while I was in the room, said she would come back later, and never came back. We visited the pool twice, and both times had to go to the front desk and ask for towels, then wait 45 minutes for someone to bring them. Internet access isn't free, common to the high end chains but ridiculous when you get it for free at most McDonalds. In the positive category: The staff in general is very polite, the view from the concierge lounge is beautiful, the pool area is nice and warm. However, I could go down the street to the Hampton and get the same service, free breakfast, free wi-fi, and comparable amenities for a fraction of the price. The only thing that keeps me at the Marriott at this point is my huge surplus of rewards points.", "title": "This hotel has gone downhill", "user": "emiller4060", "date": "March 9, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 5.0}, "id": 154115223}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled on business", "text": "Stayed 3 nights for a conference. The hotel was spotless and the food was quite good, including made to order omelettes in the breakfast buffet. The staff was friendly and attentive, especially Taylor during check in. Nearby restaurants and shopping at Park Meadows Mall were a plus.", "title": "Good location, attentive staff", "user": "ColoradoBoomermom", "date": "February 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 151350063}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled on business", "text": "This was my third stay here. Front desk here is always very very good. Lobby is very cool.", "title": "Another very successful, professional, comfortable business stay", "user": "Belvederian", "date": "February 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 151232743}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled on business", "text": "I have stayed at the Denver Marriott South at Park Meadows a few times for business. It is one of the few hotels that I look forward to return. The room is exactly what you expect at a full scale Marriott. No surprises. What makes me look forward to returning is the service and quality of food at the restaurant. I’ve travelled with my team and offered to take them to a different place for dinner and they often want to stay in because they have favorites on the menu.", "title": "Typical Marriott - Exceptional Restaurant", "user": "EduardTravels", "date": "June 16, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 164137604}, {"rating": 2.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "The stay at the Denver Marriott South was ok, but did want to point out some low points that i experienced:", "title": "You might have better luck, but be aware", "helpfulness": 1, "user": "PhoenixRising7", "date": "June 14, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 164002156}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled on business", "text": "- The hot water did not work, apparently the boilers went down, on Wednesday morning...this was not happy", "title": "Convenient Location", "user": "Jnjtiger", "date": "June 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 163388553}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "- The internet was sporadic on one evening...i was connected and disconnected several times and had to reapply to get access each time", "title": "Excellent Hotel and Extremely Helpful Staff", "user": "Gavin_NYC", "date": "June 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 3.0}, "id": 163001174}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "- Did not receive a copy of my receipt the morning when i was leaving, so i went to the front desk to confirm i was checking out this morning...and it was confirmed just didn't get the receipt under the door", "title": "A Nice Surprise...", "user": "frontrangesojourner", "date": "June 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 162782960}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "I spent two nights at the Marriott, in a guest-level double room. The room was comfortable and clean, with two very firm double beds, desk, armchair, average-size TV. No fridge or room safe but plenty of pillows, hair dryer, and toiletries (shampoo, conditioner, moisturizer). The air conditioner was easy to control and kept the room at a cool, even temperature. The sound level was excellent--I went to bed early one night and slept in one morning and was not disturbed by outside noises. If you want a view, ask for it--my second-floor room overlooked a wall and rooftop. The lobby staff were extremely friendly and helpful, as was the bartender (but drinks were very expensive). I had an excellent breakfast (the farmer's omelet, loaded with layers of eggs, cheese, bacon, and potatoes). There's free internet access in the room, though I didn't try it. Free shuttle service to a shopping mall a couple of miles away. All in all, a very pleasant stay.", "title": "Nice stay for out-of-town wedding", "user": "CatskillsWriter", "date": "May 30, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 162468507}, {"rating": 5.0, "stay_parameters": "Stayed April 2013", "text": "Every single person working at the front desk are AMAZING! They always remember your name and try to get you the ungetable. Sonoma'z which is the inhouse restaurant is really good. Might be a bit pricy considering that the service is not the best. Food is incredibly good. The rooms are ultra clean and really allow you to rest. The facility's internet access might be better but it gets the job done. This is a pretty hotel for business travelers. THANK YOU Marriott SPM, even when I struggled with my credit card, you guys did everything to make me feel welcome and I appreciate that. Hope I can visit you guys again.", "title": "Just a word WOW!", "user": "Adamsfco", "date": "May 26, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 161915283}, {"rating": 3.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "Stayed two nights on a business trip to the area. The room and lobby all appear to be freshly renovated, and they are all very attractive. The room was clean and well furnished. However, during the renovation someone placed the room thermostat directly below the air conditioning supply air vent. I'm sure this made for easy wiring, but it is about the worst possible location. The room would not get cool at night, and there is nothing worse than a hot room for sleeping. Someone needs to re-examine the placement of these devices.", "title": "Pretty Hotel - Nice Stay - Some Problems", "user": "Swamilama", "date": "May 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 2.0, "rooms": 4.0, "location": 3.0}, "id": 161348397}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "The lobby with the two sided fireplace is a very nice feature, and the area makes for a nice place to sit and visit or read. Front counter staff was friendly and extremely helpful. The hotel is located in an area that looks like it will experience a great deal of future growth...the drawback being that nothing is within a short walk. Plan for a mile plus one way if you want to walk to your meal or to a store.", "title": "Mother's Day Brunch", "user": "jlucas1016", "date": "May 13, 2013", "detail_rating": {"value": 5.0, "service": 4.0}, "id": 160517578}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "One final note - this was perhaps the poorest concierge lounge I have experienced at any Marriott. They were constantly out of bottled water, and there even appeared to be a shortage of hors d'oevres. The place is locked up outside of the normal concierge breakfast and hors d'oeuvres hours. Every other lounge that I have been to allows guests to use the room during “off’ hours. Is the added expense that great?", "title": "Five-star staff and Bernadette", "user": "violinist26", "date": "May 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 160212976}], "location": {"country": "United States", "city": "Littleton"}, "stars": 3.5, "variance": {"poor": 7, "average": 16, "very good": 37, "terrible": 4, "excellent": 66}, "aka": "Denver Marriott South At Park Meadows Hotel Littleton", "slim_ranking": 0.545454545455, "description": "The newly-renovated Marriott Denver South makes getting to and around Denver easy and convenient. Located in the Park Ridge Corporate Center and minutes from Park Meadows Mall, Centennial Airport, and Sky Ridge Medical, Coors Field, and Invesco Field at Mile High. This Denver South hotel features warm, modern decor, on-site restaurant, concierge lounge, indoor pool, fitness center & 12,000 sq. ft. of flexible meeting space."}