{"user_rating": 5.0, "review_count": 271, "name": "Desmond House Kinsale", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "The Desmond House was wonderful, as was Kinsale. Michael is an outstanding host. The room was large, comfortable, clean and beautiful with nice views. The Desmond House is convenient to the center of town which made our stay great and breakfast was spectacular. The only slight negative for us was that the mattress was a little hard, but we found that at every B&B we stayed at in Ireland, so it may just be us.", "title": "Wonderful Stay", "user": "Windlassie", "date": "September 1, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 39499633}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "Please meet Michael. When you push his door there he welcomes you. Charming with his white beard and sparking gaze. You enter his warm world of comfort, and friendliness. He'll make your stay a exquisite experience of Kinsale. The en suite room he had prepared for us was large and cosy (one immense bed plus a single bed for our teenager of son), the bathroom was clean and well equipped. Breakfast is the best we've ever had in Ireland specially prepared by Michael with so many details showing his deepest sense of pleasing his guests (I recommend the smoked salmon). It was sad to leave Michael and his house to continue with our trip for we all felt Michael had become a friend.", "title": "An exquisite stay", "user": "Chrischautard", "date": "August 20, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 38217623}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "It is said that, in Ireland, you can experience four season in a day. It's true. In this B&B, you can enjoy and feel four sensations: Ireland is a wonderful country, Kinsale is an impressive town, the people is friendly, and Desmond House is unforgetable. Since the first e-mail to the end, all was different with this B&B. Michael is the best host ever, very pleasant, and I will never forget his excellent attention. The only way to feel these sensations again is... repeating.", "title": "Lovely, friendly... unforgetable.", "user": "Dominiummundi", "date": "August 15, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 37758999}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled with friends", "text": "Recently I stayed at Desmond House with two friends. This place is excellent - the rooms are spacious, quiet and have everything one requires, and more! The breakfast is something not to be missed. Most importantly, it has a warm, friendly atmosphere. I can't wait to return.", "title": "I want to keep this place a secret!", "user": "deesinjrsy", "date": "August 10, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 37275933}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled with friends", "text": "Two friends and I stayed at Desmond House for two nights and had a fantastic experience. Michael was an excellent host and we enjoyed everything about our stay. The room was spacious and comfortable, the breakfasts delicious and Michael was always helpful and welcoming.", "title": "A Pleasure", "user": "NorthernIrelandRosie", "date": "August 7, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 36999968}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "The Desmond House is a wonderful Georgian home with four spacious guest rooms. The rooms offer timeless comfort with modern amenities. The house is on a quiet street very close to the heart of Kinsale. Michael set the standard for hospitality during our travels in Ireland. He is charming, helpful and has a gift for sharing his knowledge of history and culture in a captivating manner. It may be a small point, but the smoked salmon we had for breakfast was the best we tasted in Ireland. By the time we left, we felt like Michael was an adopted member of our family. We will return to Desmond House on our next trip to Ireland.", "title": "The Standard for Irish Hospitality", "user": "GentleGiant7", "date": "July 29, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 36147537}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled with family", "text": "great locale...interesting history...michael a great host...just a wonderful find...we slept in one morn and we were walking out the door past posted breakfast hours and michael would not let us leave without eating first...great stuff!!!", "title": "great charm and character...", "user": "stopint", "date": "July 27, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 35935350}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "The Desmond House in Kinsale was probably the BEST bed & breakfast stay during our entire trip to Ireland. We were greeted by Sarah (daughter of Michael the innkeeper). Sarah was friendly and showed us the ropes. The Desmond House is above and beyond your typical bed and breakfast. In fact, it's more like a small, fancy hotel; but it was a nice change from the normal style. PERFECT LOCATION and Michael's photo-by-photo directions on their website regarding how to get to the parking lot are right on! Michael is a wonderful host, the breakfast in the formal dining room was superb; and it was one of our most enjoyable stays!", "title": "SIMPLY THE BEST!", "user": "ShebaM123", "date": "July 27, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 35911940}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled with family", "text": "We spent 2 nights at Desmond house and couldn't have imagined a more welcoming host couple or more personal attention anywhere! Michael and Anne were wonderful hosts from beginning to end. We had to make an unexpected trip to the hospital in Cork with our teenage daughter and they took it upon themselves to call Old Head golf course and alert them that we wouldn't make our tee time, and offered to help us in any way they could with transportation or any arrangements. Our rooms were lovely, spotless and so comfortable. Our breakfasts were THE BEST, and Michael was a joy to talk with each morning. We would recommend Desmond House to anyone staying in Kinsale and we hope to return someday. Thank you Michael and Anne!", "title": "Personal care above and beyond!", "helpfulness": 1, "user": "pjmom", "date": "July 2, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 33768683}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "We had the pleasure this week in staying with this lovely couple in their lovely B&B. I would just like to say in our opinion it is the people that make your experience really worth it. This couple have the most carasmatic and typically \"Irish\" style hopspitality we have encountered. The rooms are stunning of a georgian period elegance with a breakfast to fuel an Irish bounty ship bound for American shores. M, the Gent host has a grace and warmth taking a special part in assisting you with any questions you have about your trip or helping you to simply plan what is suitable for \"you\". Excellent location and advised us to Dine at a fabulous restaraunt in town - Jolas just one a few tips.When you pass through this little Green Gem of a town, be sure not to miss this one.......To be sure to be sure :)", "title": "What a special experience", "helpfulness": 1, "user": "travellingwilburys09", "date": "June 20, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 32752418}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "Desmond House is as good as it gets when it comes to B&Bs. Michael, the proprietor, is warm and welcoming. He can help point you in the right direction, vacation-wise, and he's an all-around fun guy to chat with over your traditional Irish breakfast. The rooms are all clean, comfortable and well-appointed -- everything from the television to the whirlpool bathtub to the comfy bed.", "title": "Perfect in every way", "user": "jyjyj", "date": "September 24, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 44148070}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "Kinsale a great destination, but staying in Desmond House made it an even more memorable stay on our Irish vacation. We wouldn't think twice about where to stay when we return.", "title": "Fantastic Time - Fantastic Host - Fantastic Place to Stay!", "user": "ATravelingQ", "date": "September 23, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 43817877}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled with friends", "text": "This was a wonderful place to stay and enjoy Kinsale. Kinsale was a darling town, perfect for a couple of days after a hectic week spent driving around Ireland. Michael was always ready to help in every way he could - a wonderful host! Our room did not have a great view, but was cozy and charming and the bathroom provided a perfectly hot shower.", "title": "Should be your first choice for a B&B in Kinsale!", "user": "SilverGirlChicago_IL", "date": "September 22, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 43755608}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled with friends", "text": "A friend and I traveling throughout Ireland were fortunate enough to get rooms at Desmond House. This B&B came highly recommended by friends - I now owe them a favor! Location is perfect, Michael a superior host - makes the best banana bread. The rooms are spacious and truly lovely with bathrooms that are also spacious, state of the art and sparkling clean!", "title": "Very nice, and convenient B&B with excellent service", "user": "GrooveOhio", "date": "September 15, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 41870243}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "We were 4 couples in Kinsale for golf and tourism, so we took all 4 rooms at the Desmond House. The rooms were in excellent condition, with modern private baths. Michael, the proprietor, could not have been a better resource for the group. He helped us understand how/why Ireland has evolved the way it has, gave us a sense of history, and provided excellent breakfasts. He supported us in evaluating restaurants, making helpful suggestions, moving heavy luggage, and mailing some forgotten items. Michael provides an important element of the atmosphere and the positive experience of a very fine B&B. We would all return to the property if/when we return to Kinsale.", "title": "Amazing Retreat", "user": "basketgirl10", "date": "September 5, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 39870257}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "We stayed in Desmond's House in kinsale whilst we doing the Scally Rally. It was recommended by the organizers. Michael the owner was a lovely friendly person which for us makes our stay that little bit nicer.", "title": "Delightful B&B", "user": "Waterloomoo", "date": "October 24, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 47648227}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "Rather than describe the room we stayed in I have posted some photos and that way you can make your own mind up.", "title": "Outstanding!", "user": "nanaskis", "date": "October 18, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 47164236}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "The breakfast was nice home made to order so no cooked food sitting under a heat lamp in a ban marie. 10/10 for that.", "title": "Favorite Stay", "user": "LaliBird", "date": "October 1, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 45619608}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "See you again", "title": "A treat for our final night in Ireland!", "user": "122793", "date": "September 30, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 45533093}, {"rating": 5.0, "title": "One of the Most Memorable Experiences of our Trip", "text": "We just returned from a 10 day trip in Ireland. One of our stops was in the lovely town of Kinsale. We had a wonderful stay at Desmond House. Michael, owner and host, is a lovely and gracious man. He was a wealth of information from restaurants and what to see and do. This B&B is in an excellent location; convenient parking and the ability to walk to everything. Michael maintains his property meticulously and offers a wonderful breakfast. If you are travelling on, he is more than helpful in providing directions and information. We would definitely recommend Desmond House to anyone! Michael also recommended a fine dining restaurant in town - Nola's - a beautiful restaurant, excellent service and fabulous food.", "user": "LynneRGriff", "date": "September 27, 2009", "id": 44956160}], "location": {"country": "Ireland", "continent": "Europe"}, "variance": {"poor": 3, "average": 3, "very good": 11, "terrible": 1, "excellent": 253}, "aka": "Desmond House Kinsale Hotel", "slim_ranking": 0.0566037735849, "description": "Desmond House Kinsale is a lovely old Georgian house in the center of the old part of Kinsale. Huge bedrooms and full bathrooms including whirlpool tubs. Park your car and walk to the award winning restaurants. Only 4 bedrooms so personal attention of knowledgeable owners is available to help with enjoying your stay. Desmond House Kinsale is a great place to stay."}