{"user_rating": 4.0, "review_count": 550, "name": "Devonport House", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "We stayed at this hotel the previous Christmas and the food was awful, we only came back because we had the offer of a free meal, to compensate for the inedible offering we were given.", "title": "Christmas", "user": "seawitch809", "date": "January 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 149916523}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled on business", "text": "This year the hotel is completely different. As soon as we came in the hotel, we were warmly welcomed by the reception staff and given our room early.", "title": "Excellent Value for Money", "user": "sykesc66", "date": "January 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 149899084}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "We ate in the restaurant in the evening. Our table was in a corner, because there were three Christmas parties that evening, but it was beautifully decorated for Christmas. The staff were friendly and efficient. The food was excellent, better than a lot of high class city restaurants. The chef came out to chat with us because we complimented his food so highly. The dessert looked so good we didn't want to eat it - we sat and admired it for ages!", "title": "Excellent Stay - Lovely Staff", "user": "Actingdeedee", "date": "January 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 149795952}, {"rating": 5.0, "title": "5 star service!!", "text": "It must be one of the best De Vere hotels. The management and the staff have done an exceptional job. Andrea especially did a marvellous job looking after us.", "user": "Claresical", "date": "January 15, 2013", "id": 149719184}, {"rating": 5.0, "title": "Second time even better!!!", "text": "Stayed here on business mid-week, hotel location fantastic right next door to Greenwich park and a short walk to the tube station. Room was quite small but warm and cosy and very clean. The staff were excellent especially in the bar, the food was average but there are plenty of restaurants in Greenwich itself. Breakfast was included in my room rate but I was running late so didn't get to sample it. Would definitely stay here again when on business in Canary Wharf as so accessible.", "user": "Teampepps", "date": "January 15, 2013", "id": 149715952}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "We have just returned from a weekend with de Vere at Devonport House - this a hotel in the heart of all the Greenwich attractions and therefore a must for anyone wishing to visit everything on foot.", "title": "Superb location", "user": "SkateMinsteronSea", "date": "February 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 151833027}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "Typically de Vere, the rooms are clean with free wifi, piping hot water and hot radiators if you so wish. Staff are friendly and helpful, breakfast is varied and plentiful and there is free coffee, tea and biscuits in the bar. Parking is also free for residents, in a small but enclosed courtyard.", "title": "Perfect Location", "user": "Diane C", "date": "February 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 151464319}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "We didn't eat here in the evening but having eaten in de Vere venues before I have no doubt food will be good.", "title": "Wonderful New Year's Eve Wedding", "user": "TDD3112", "date": "January 30, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 150996476}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "We had a room overlooking the car park, which gave us a very quiet night.", "title": "A pleasant surprise", "user": "R0100", "date": "January 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 150955966}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "We shall definitely be returning as this hotel is a real find, with easy transport into town, as well as the many attractions in the area.", "title": "COMFORTABLE, CENTRAL HOTEL IN THE CENTRE OF GREENWICH", "user": "Spirite53", "date": "January 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 150908443}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "We stayed for 3 nights on a winter deal which was 3 nights B&B + 1 night evening meal. Excellent value and a great break at sensible prices. We were given a large room at front of building but asked to be moved to a quiet room which we immediately were. Room clean though not as large as 1st room, it didn't bother us. Asked for ice & bucket which was promptly supplied. Changed evening meal to 2nd night as we had tickets for Circque du Soleil and again this was no problem. We enjoyed the meal and a couple of glasses of wine each, so cheap night but good food and service. Breakfast was busy at times but alwasy plenty of food and good variety - again thought they dealt with everything very well.", "title": "Long week end in Greenwich", "user": "RandGP", "date": "February 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 124819088}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "Walked the Thames path right through to Westminster with a good look around Canary Wharf on the way. Excellent way to spend one day. No isues at all with Hotel and easy to get into London on DLR & tube.", "title": "Practical location even for the West End", "helpfulness": 1, "user": "MisterJon_9", "date": "February 16, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 124653660}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "We stayed here for 3 nights and used the hotel as a base for exploring Greenwich and the West End. Very good beds, a nice sized quiet room, with a great view acoss the river from the room. Can't comment on breakfast as we ate at one of the many local cafes in Greenwich. Great transport links, with tube stations nearby, or the bus outside the hotel going as far as Russell Square. Would certainly stay here again, if the price was right.", "title": "De Vere Greenwich", "user": "kellywellywoo1979", "date": "February 15, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 124623241}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "The rooms were very comfortable with a nice hot shower. The staff were friendly and accomodating.", "title": "Excellent base to visit central London", "helpfulness": 1, "user": "penny097", "date": "February 14, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 124569669}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "We've stayed here several times, when we've been visiting central London and have always found it very comfortable. Rooms vary a lot in size, but even the little ones have been been comfortable and spotlessly clean. It's worth keeping an eye on the De Vere website as they offer some excellent deals. Good place to stay and explore Greenwich, which is well worth visiting, but only 5 mins walk from the underground which gets you into central London in approx. 1/2 hr, or if you've got the time take the riverboat & enjoy the sights. Parking's free which is a huge bonus, staff always seem friendly and helpful. Food very nice, but if you fancy something different for breakfast, or if it's not included, cafe rouge is less than 5 mins walk and does a great breakfast!", "title": "Great Location", "helpfulness": 1, "user": "Essexstones", "date": "February 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 124560503}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "We booked to stay here for a trip to London over christmas. The hotel is not far from the railway station, and a nice stroll past some nice shops. The room was lovely and the bath was massive!", "title": "Stayed christmas 2011", "user": "Mark W", "date": "January 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 150806523}, {"rating": 5.0, "stay_parameters": "Stayed January 2013", "text": "We didnt eat here as we wanted to eat locally in London town, so can't advise on that.", "title": "Thoughtful & Kind Staff.", "user": "catdever", "date": "January 24, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 150529319}, {"rating": 4.0, "title": "Nice stay!", "text": "Good price for the room though as we found it on a hotel discount website", "user": "Clare M", "date": "January 22, 2013", "id": 150282968}, {"rating": 3.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "I wish this could be my second home. It's a a charming, welcoming & comfortable place to stay.", "title": "Excellent staff", "user": "Jeyapaul", "date": "January 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 150049766}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "It's a beautiful Georgian House in a perfect setting.", "title": "Excellent Location and Hotel, Shame About Out Last Night", "user": "Grahamditton", "date": "January 18, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 149951016}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "Our 2nd visit to Devonport House and once again we enjoyed our 3 night break. The dining room is pretty chaotic on an evening and quite comical to watch but can be annoying to guests waiting as we saw on a few occasions and also experienced. The contrast is the breakfasts - Very much due to the head waiter who organises all and runs it well. Shame he didn't work on any of the 3 evenings we ate in the hotel. On an evening it appears Chef even prepares the ice creams so when busy everything goes to pot. Reception staff very accomodating. Good on a deal but if we had paid full price I would have complained with evening restaurant service.", "title": "Very Good if you get a deal, Average if not", "user": "RandGP", "date": "February 19, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 152539911}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled with family", "text": "Last year we walked from Greenwich to Westminster on the Thames path on the north side. This time we did the south side. 2.5 hours to Tower Bridge at a steady pace. North side has more interest with Canary Wharf, old buildings, businesses & pubs but it does often stray away from the Thames river side. South side is almost all alongside the river but not quite as interesting. Good map (though don't really need one) on internet - London Walks - Jubilee walk.", "title": "Excellent location for sight seeing", "user": "Alison_Welsh", "date": "February 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 152513454}, {"rating": 3.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "De Vere Devonport House is in central Greenwich and is situated in a great location for sight seeing.", "title": "Disappointed", "user": "Alberdorot", "date": "February 17, 2013", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 5.0, "service": 3.0}, "id": 152374461}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled with family", "text": "The Cutty Sark, Observatory, Queens House and Maritime Museum are all within walking distance.", "title": "Great staff", "user": "Neesie50", "date": "February 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 152188335}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "Arrive and leave your car, there is no need for driving with everything all so close by.", "title": "another fantastic trip", "user": "PETEDAVENTRY", "date": "February 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 151982749}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled with friends", "text": "Arrived to be greeted by 2 staff on reception very efficient and helpful. Lovely bedroom overlooking the front of the Hotel Gardens with the' Cutty Sark' in view warm clean and cosy. Welcoming package and letter from Alan Whitley general Manager [ nice touch ]. Visited the Indoor Greenwich Markets and Naval Museums walked along the Thames path towards O2, arrived back at the Hotel cold, receptionist suggested we have a coffee in the Lounge we were to find out this was complimentary to guests also pastries enjoyed the comfortable surroundings of this room.In the evening we booked the Restaurant service and food very good enjoyed a bottle of wine recommended by the Manager, we were not rushed and the whole meal was excellent. Breakfast very good much busy then the evening but still just as efficient tea and coffee arrived without any fuss. Enjoyed this wonderful weekend will return again a big thank you. Lynn and friends.", "title": "A Wonderful Weekend Break.", "helpfulness": 1, "user": "Lynn S", "date": "February 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 124424754}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "We cannot understand comments about rude staff at this hotel. My wife and I use Devonport House for our annual visit to London for The Boat Show and /or Theatre show/ museums atc. and have never experienced anything but helpful and courteous treatment from all staff from the top down. Nothing has been too much trouble and the service has been super. The Boat Show week-end is one of the busiest periods of the year here due to it's proximity to the show site and so pressure does come on the breakfast operation as most residents want to get off early, but the breakfast manager and staff cope superbly, with admirable good humour, and we put this hotel's breakfast on a par with that at The Hilton London Bridge, where we had to stay once due to Devonport House already being booked up.", "title": "Excellent staff here!", "helpfulness": 3, "user": "wakeymike", "date": "February 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124381479}, {"rating": 3.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "The Hotel is superbly sited for visits to London and it's site in historic Greenwich adds an extra dimension to your visit. It's lovely to return to in the evening and see the lights of London and Canary Wharf across the river and get that slight relief from leaving the hustle and bustle for the night. The rooms are fine for a week-end stay and size wise on a par with most in London. Everything has been in order in our rooms over the course of 4 visits. We tend to use the vast choice of local restaurants and public houses rather than the hotel for evening meals or drinks if we have not eaten 'up town' so can't comment on afternoon drinking provision .... apart from advising the reviewer who struggled to find someone to serve them to get a life and get out there and do something better with there time!", "title": "Great base for London", "helpfulness": 2, "user": "mjmr", "date": "February 7, 2012", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 124238852}, {"rating": 2.0, "stay_parameters": "Stayed February 2012, traveled with friends", "text": "We stayed here for two nights for a family trip to London and had two rooms.", "title": "Not what I would have expected form a hotel in Olympic year", "helpfulness": 2, "user": "english_audrey", "date": "February 6, 2012", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 3.0}, "id": 124188727}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "On arriving it was easy to find and there is parking available for hotel guests.", "title": "Great location", "helpfulness": 2, "user": "beachgirl75", "date": "February 1, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 123979041}, {"rating": 5.0, "stay_parameters": "Stayed January 2012", "text": "This is a conference centre rather than a hotel, so great value at weekends and peak holiday times when conferences are not being held. We had all the advantages of a de vere - great service contributing to a good stay. It's not a hotel - no safe or fridge, small bedrooms, but fantastic location, a real gem! Clean, functional, friendly. Plentry of bars and restaurants within a 5-10 minute walk, loads to see and do.", "title": "Excellent value, de vere service!", "helpfulness": 1, "user": "Anne55England", "date": "January 22, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 3.0}, "id": 123449282}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "My husband and I have just returned from a very enjoyable 2 night stay at Devonport House Greenwich. The check in/out was efficient and all the staff we met during our stay were very friendly and helpful. The room wasn't huge but was clean and perfectly adequate for our stay. There were tea/coffee making facilities ,an iron and ironing board and plenty of hot water! The hotel is ideally situated for a trip into London, the Cutty Sark tube station being just a few minutes walk away . In addition there are plenty of restaurants, bars , shops and a picture house all in walking distance of the hotel. The Maritime Museum is right next door and we would have loved to have stayed an extra day to take a look around it. We ate breakfast and one evening meal at the hotel and were impressed with the quality of the food and the waiter service we received. It was my husbands 50th birthday during our stay which we mentioned to our waitress and when she bought out his dessert there was a lit candle in it, happy birthday had been written on the plate and two of the staff sang happy birthday to him. It was a really nice touch and totally unexpected.", "title": "Great location, Great place to stay", "user": "DAJJER21", "date": "January 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 122938276}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled with friends", "text": "Overall it was a fantastic trip and we would definately recommend this hotel to friends and family.", "title": "Great location, poor bar service.....", "helpfulness": 1, "user": "Hufflepuff33", "date": "January 8, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 122745314}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "Hotel itself was lovely albeit the rooms were a tad on the small size. We asked for a twin room & both the beds were pushed together as there wasn't much room either side although we did manage to separate them a bit.", "title": "Fabulous stay at this excellent hotel.", "user": "tonyw1uk", "date": "January 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 122358028}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "Was out for the day & for dinner - went back to the hotel bar for our nightcap with our 20% off drinks voucher that we received when we checked in. Lady behind the bar didn't know what a black russian was! Explained & more than a nightcap later asked for the bill. She charged us for FULL cokes with our drinks instead of a splash & only took 10% off instead of the full 20%!", "title": "Beautiful, everything needed catered for....", "helpfulness": 1, "user": "Katrina W", "date": "December 28, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 122186552}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled on business", "text": "This is the second time I've stayed at Devonport House. It's beautifully located right next to the Maritime Museum and at the edge of Greenwich Park - the Royal Observatory is at the top of the hill in the park. The Cutty Sark is just down the road, as is the 'stop' for various boat trips on the Thames. I was there for business, but I managed some good walks around the area. There are loads of restaurants and cafes nearby, so we chose to eat away from the hotel in the evening. Had lunch at the hotel as part of the business day though, and it was excellent. There's a seating area on the first floor with tea/coffee machine, which met we could sit and talk in comfort without feeling the need to keep buying drinks at the bar.", "title": "Excellent for business", "helpfulness": 2, "user": "Sosmall07", "date": "January 31, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 123931618}, {"rating": 3.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "My room was very good, though my colleague (on the other side of the building) complained of an alarm waking her more than once in the night.", "title": "Take your own tea bag", "helpfulness": 3, "user": "john t", "date": "January 28, 2012", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 123754383}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled with family", "text": "As a conference venue, it was exactly what we needed. We had very good service from the staff, who set up the extras we had requested before we arrived, and who sorted out technical problems for us very efficiently, even lending us a laptop when one of the delegates couldn't connect to their wifi. Very comfortable bar area for teas and coffees during the conference.", "title": "Very Good Stay", "helpfulness": 1, "user": "SLP76", "date": "January 25, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 123621110}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "Arrived late afternoon on a Saturday. We had stayed before. Our room faced the main road - the windows require attention and they are getting it - there is some very noticeable road noise. There was a notice in the room stating there might be some noise whilst this was done but if it knocks out some of the road noise it would be well worth it. An expensive exercise and sadly somewhere in the De vere finance department they had what they thought was a brilliant idea to save a few pence.", "title": "Very good weekend stay", "helpfulness": 1, "user": "HDGPoole", "date": "January 23, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 123509540}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled with friends", "text": "We decided to have a cup of tea but found only 2 tea bags. Called Reception advised them housekeeping hadn't refreshed the drinks tray. I am afraid we only allocate 2 tea bags per room sir. Are you sure, I am paying £115 per night and I like a cup in the morning. You can come down to the first floor where there is a tea room - do you want to speak to the duty manager. Not about 2 tea extra bags.", "title": "Great Location and Historic building", "user": "daytriplad", "date": "January 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 123489880}], "location": {"country": "United Kingdom (UK)", "continent": "Europe", "city": "London"}, "stars": 4, "variance": {"poor": 22, "average": 78, "very good": 210, "terrible": 2, "excellent": 238}, "aka": "Devonport House Hotel London", "slim_ranking": 0.200743494424, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "description": "Situated on the World Heritage Site in Greenwich and steeped in naval history, Devonport House offers you the perfect way to enjoy the London buzz, without the bustle.Bedrooms: 94 en-suite, complimentary WiFi, flat screen TVs with Sky Channels, DDI Telephones, hair dryer, tea and coffee tray, iron & ironing board, full length mirror and desk space. Meeting & Syndicate Rooms: 14 meeting rooms & 9 syndicate rooms with main rooms offering natural daylight and a maximum capacity of 120 Food & Drink: Restaurant & bar, internet cafe, and a selection of hot drinks available off the coffee menu."}