{"user_rating": 5.0, "review_count": 599, "name": "Dhara Dhevi Chiang Mai", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled with friends", "text": "Wow. Everywhere you look is something else amazing. We were there for 3 day, but would have loved to say for much much longer. Our deluxe villa was so beautiful, and the service was top notch. We never waited more than 2 minutes for the hotel buggy to take us anywhere. The villa pool was wonderful, and the pool staff were so charming (not to mention the yummy cocktails). There is so much to do on this property that you really need a week to take it all in. I would love to go back some day!", "title": "Fantastic Resort!", "user": "poohbear48", "date": "March 11, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 99758498}, {"rating": 3.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "The property is beautiful, although not maintained in the low season, when we went. Foot paths were covered in leaves which hadn't been swept in days and the bathroom at one of the pools wasn't working. However, the serious violation was the very loud noise, akin to the sound of a jack hammer, throughout the property for nearly 6 or 7 hours during one day of our stay. We called the front desk to express our concern but the hotel had already scheduled this procedure to take place. We were very disappointed that the staff didn't at least inform us when we checked in that this would be taking place, as we could have arranged to stay on different days. We expressed our disappointment to the manager after our stay via email; he didn't reply until I contacted the regional office. And we weren't pleased with his response. We have dined at and experienced the spas at several Mandarin Oriental properties worldwide but this was our first experience to stay in the hotel. We likely won’t be staying at one of their properties in the future; the service simply wasn’t on par with most Aman properties or the Four Season’s down the road.", "title": "For service go to the Four Seasons Chiang Mai", "helpfulness": 4, "user": "LuxeCritic", "date": "March 3, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 98742299}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled with family", "text": "I was lucky enough to spend three nights in a deluxe colonial suite over the Macha Bucha long weekend recently. I had not seen the Dhara Dhevi properly for four or five years and although I remember it as quite an incredible place and expected nothing less than five star service from Mandarin Oriental I have to say was really, really impressed by the hotel during my stay.", "title": "Marvellous stay at a magnificent hotel", "helpfulness": 1, "user": "Traveller501", "date": "February 22, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 97539345}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "The room was huge with lots of space for two children to play and do their homework and for two adults to find room to put together bicycles or relax. The hotel provided bikes for the kids so we could all explore and even provide a horse and trap to take them around the hotel grounds (60 acres!!). With two swimming pools, a well organised kids club with activities and games our 6 and 8 year old children literally didn't need or want to leave the hotel in three days which was just fine with us as.", "title": "if you don't stay here in chiang mai you are making a mistake", "user": "lazydaysNyc", "date": "February 20, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 97355125}, {"rating": 5.0, "stay_parameters": "Stayed February 2011", "text": "In short the hotel is an absolute dream and managed to exceed our expectations on every level. The service was impeccable, the food was excellent and perhaps most importantly the hotel has now, I felt, developed its own character and as well as being magnificent, impressive and grandiose it has no acquired a certain style and charm that just makes it even better.", "title": "Magical, beautiful, top end! The Best.", "user": "GelauGEM", "date": "February 8, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 95853699}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled with family", "text": "All the reviews say it - and they're right!", "title": "EXTREMELY PLEASANT STAY", "helpfulness": 3, "user": "davidfisher", "date": "April 26, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 105680081}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled with family", "text": "This is a super hotel, but it's so much more than just that, principally because it occupies more than 55 acres, and is a real delight just to wander round (or cycle round) with its courtyards, hidden amphitheatre, rice paddies, two nice big pools and lazy poolside lunches, two good tennis courts (they provide racquets and balls) - and quite the most interesting gardens tended by a vast team.", "title": "Worth a journey", "helpfulness": 3, "user": "Stabek", "date": "April 22, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 104977991}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled with family", "text": "The breakfasts are memorable, and the Thai and French restaurants excellent.", "title": "Great hotel - felt like we were the only ones there, even though it was fully booked!", "helpfulness": 2, "user": "expats_in_Taiwan", "date": "April 13, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 103876618}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "We were there inbetween the Thai New Year/Water Festival and Easter, so it was quiet (which we enjoy), and having just finished an energetic 2 weeks touring Myanamar we thoroughly enjoyed our few relaxing days at the Mandarin, where the days disappeared all too quickly............", "title": "Unforgettable! Warm welcome and amazing stay!", "user": "VIA_NVV", "date": "March 30, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 102138070}, {"rating": 5.0, "stay_parameters": "Stayed November 2010", "text": "We just left one of the very few paradises on earth. Mandarin Oriental is just “out of this world” for everything that is in this saying and we wanted to return before leaving the gates. The premises are huge and include numerous separate Villas, two large swimming pool areas, a operating rice field, restaurants and a Colonial Complex with large, very comfortable suites. Everything kept in a prompt colonial style and it is just like living in a 18th century novel. It is not to describe – you just have to come here and experience!", "title": "Pure bliss...", "user": "Becky3589", "date": "March 20, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 100895606}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled with family", "text": "A family of 4 arrived for Wednesday for long Thanksgiving weekend. Perfect weather (time) to go. Architecture/complex awed the senses upon arrival. Built in traditional northern Thai style and with plush amenity. Got upgrade to Villa 91 (Ratanapura Suite) located near the Dheva Spa. Suite is more than sweet- it's awesome!!!! Villa is huge with direct access to rice field, own pool, lanai. Service is superb all around. People are genuinely nice. Yoga classes and kids care with all sorted of craft activities scheduled. We even did the rice planting accompanied by 6 staff. Bicycle rental to scoot about and explore the large tranquil complex at own pace. Breakfast buffet is excellent with healthy options. Consulted the ayurvedic specialist before getting Kati Basti and Shirodhara treatments. One of the best spa I have been at. Highly recommended. Overall, hotel is 15 minutes taxi ride from central of town, so we mostly ate out at night. Lots of great gift shopping for the holidays done. Planning a return.", "title": "Heavenly Relaxing", "user": "sofiteme", "date": "November 30, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 88607192}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "My husband and I (young professionals, ages 31&33) spent 2 nights in Deluxe Villa #59 (photos coming). The resort is a sight to behold. The pictures on the website are accurate. Our villa was spacious and beautifully appointed. Bed was comfortable. My only wish was that we could've had a view of the rice paddy fields (like villa #63), but no problem as you can meander through the paddies on your way to the pool or French restaurant. Arriving in the afternoon of the 1st day, we were absolutely content walking the resort grounds and admiring the incredible architecture. The staff is extremely helpful and delightfully service oriented. There is a roundtrip shuttle which will take you to the night street market (a fun place to barter and buy souvenirs).", "title": "Breathtaking resort in a wonderful city!", "helpfulness": 1, "user": "xr_vision", "date": "November 21, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 87781393}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled with family", "text": "The concierge (Ms. Matana) was a huge help coordinating our next fun-packed day of hot air balloon ride at dawn with Sky Adventure, white-water rafting and elephant ride at Maetaman Elephant Camp, lunch, then stroll around Doi Suthep Temple in the Mountains. She got us a taxi driver who stayed with us all day (12.5 hours) for 1,000 bhat (we gave him 1,500 because the trip to Doi Suthep had not been part of the original itinerary). Excursions totaled 23,400 bhat ($780 US) for two people. The night ended at the hotel's gorgeous open-air Thai restaurant with traditional dances and music during dinner. Dinner was excellent, beautiful, tasty, and large portions. The appetizers (prawns and chicken satay) were plentiful enough as to serve as entrees.", "title": "THE MOST MEMORABLE HOLIDAY", "user": "abhinav7", "date": "November 20, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 87648166}, {"rating": 3.0, "stay_parameters": "Stayed November 2010, traveled solo", "text": "This is becoming a very long review... Breakfast room service was excellent. Staff was punctual (including wakeup calls, bag pickup, etc). Will DEFINITELY return for another visit. Next time will visit the incredible spa and try yoga in the outdoor pavilion. Can't say enough about this resort!", "title": "Average Resort but Excellent Spa", "helpfulness": 2, "user": "dimsum", "date": "November 16, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 2.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 87228637}, {"rating": 3.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "we were very anxious to visit chiang mai..a hill station in thailand..i chose to stay at the dhara dhevi on recommendation of a relative...this is the place to luxuriate and the hotel staff is simply superb...i had booked a private pool villa which was spread across 2 floors with 2 jacuzzis and it was the most memorable holiday for me...the hotel has 3 different styled pools and each one is spectacular than the other...food is just amazing...the decor of the hotel is just simply amazing..we stayed at the hotel all four days and could not get out except for 3 hours on one day...i highly recommend this hotel..but it is too expensive during peak season..so a little off season should be better.they have one of the best spas i have ever visited...service of the hotel is extraordinary.", "title": "Not up to expactions.", "helpfulness": 2, "user": "senna1", "date": "November 14, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 2.0}, "id": 87004916}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "Hello, My name is Gaynor and I had simply the most incredible experience at the Mandarin Oriental Dhara Dhevi. We travelled with our three children, my Mum and our nanny. I have stayed in many fabulous hotels around the world but this is the first time I have been moved to write a review.", "title": "The most magical place in the world", "user": "GaynorJaneTurner", "date": "February 5, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 95552272}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled with family", "text": "Mandarin Oriental run the hotel however it was an art collector who concieved the original plan and every surface is adorned with stunning pieces. He scoured thailand, and with amazing vision transported tumbledown temples brick by brick to adorn the gardens, collected tens of thousands of hand made tiles to clad the pathways, imported 40,000 mature trees ( some of which have trunks six feet wide) and somehow made a six year old hotel look as though it had been there for centuries.", "title": "W O W !", "user": "Oldtimer55555", "date": "January 26, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 94451254}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "Travelling with children can be interesting at the best of times, but the staff at the Mandarin made it magical. Every staff member knew their names and took great pleasure in thinking up fun and games. They especially enjoyed kick boxing, and the instructors were so patient.", "title": "Simply Stunning", "user": "NickAtherton", "date": "January 17, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 93392569}, {"rating": 3.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "The food is incredible in all the restaurants but I especially recommend the Peking Duck served with the most delicous pancakes (so fine that you could see through them) in the Chinese restaurant.", "title": "Nice but definitely NOT worth the money", "helpfulness": 2, "user": "daninthecity", "date": "January 6, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 2.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 91984897}, {"rating": 5.0, "stay_parameters": "Stayed January 2011", "text": "Our stay was over far too quickly but I look forward to once again lying in the sun on those wide sunbeds, two steps from the private terrace outside my room, eating beautifully prepared complimentary fruit and listening to the tinkling of tiny bells that hang from the tiny roofs and being completely and utterly relaxed.", "title": "Perfect but", "user": "Trotteglober", "date": "January 6, 2011", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 91961119}], "location": {"country": "Thailand", "continent": "Asia", "city": "Chiang Mai"}, "stars": 5, "variance": {"poor": 5, "average": 17, "very good": 41, "terrible": 2, "excellent": 534}, "aka": "Mandarin Oriental Dhara Dhevi, Chiang Mai Hotel", "slim_ranking": 0.00613496932515, "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.5}, "description": "Dhara Dhevi Chiang Mai is set on 60 acres of verdant tranquil grounds in the historical heartland of Northern Thailand.The resort’s unique design draws from the region’s rich architectural and cultural heritage that flourished during the Lanna period, which lasted from the mid-13th century until the mid-16th century, and enjoyed a further resurgence in the last 200 years."}