{"user_rating": 5.0, "review_count": 202, "name": "Dilly Dally House (LoLo Hale)", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "We spent two wonderful weeks in Kauai for our 25th anniversary this fall. Totally leisure, no business.", "title": "If you think you don't like B&Bs, you need to stay here.", "helpfulness": 3, "user": "robbietravels27", "date": "November 30, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 88673452}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "The first week we stayed at the former Westin, recently upgraded and reopened as the five-star St. Regis in Princeville. It's one of the two to three hottest places to stay in Hawaii right now. It is, inarguably, outrageously expensive, as is everything near it. It also has one of the world's best views, overlooking the fabled \"Bali Hai\" from South Pacific.", "title": "Dilly Dally house is peaceful, picturesque and everything you want in a resort-quality Bed & Breakfast.", "helpfulness": 1, "user": "qha3000", "date": "November 28, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 88483949}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled solo", "text": "For the second week, based solely on tripadvisor reviews, we booked the Suite at Dilly Dally House. It was the better part of the trip, and the most memorable.", "title": "Total relaxation at Dilly Dally House", "helpfulness": 1, "user": "MelloNello60", "date": "November 15, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 87217970}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "They were going through a major transition when we arrived, yet everyone involved is so professional, the guests were never impacted.", "title": "Best B&B ever!", "helpfulness": 1, "user": "annievalene", "date": "November 13, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 86972403}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "Justine was just getting ready to take over the day-to-day operation. We loved her, and I'm thrilled to see that things are obviously going wonderfully with her at the helm, based on the most recent reviews.", "title": "We LOVED Dilly Dally House!", "user": "georgekq", "date": "November 11, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 86784171}, {"rating": 5.0, "title": "Dilly-Dally - an unknown (except for TripAdvisor) gem!", "text": "Reading all the great reviews, I knew this was going to be the place to stay. As my wife and I planned our trip, we found that there were no vacancies the first three nights of our trip, so we went for a deal at the Sheraton Kauai - not bad, but that's another story. We were starting to get a little nervous as no one, even the Photo Tour people in Kapaa, had ever heard of Dilly Dally. I guess what we've learned is if you have an amazing place that sells itself, you don't need to advertise. It lived up to our very high expectations. Justine was wonderful, above and beyond. The location is a little bit of a trek, but it's worth it. Absolutely quiet nights, no road noise, no crickets, it was almost spooky. Met a wonderful group of guests, and it was fun comparing notes each morning over the great breakfasts. If we go back to Kauai in the future, I can't think of any reason I wouldn't want to stay at the Dilly Dally.", "user": "rlatuchie", "date": "March 9, 2011", "id": 99544872}, {"rating": 5.0, "title": "Breathtakingly Perfect!", "text": "The Dilly Dally House and staff exceeded our expectations. This is the best place we have ever stayed and we're already \"homesick\" for the the island, the house and it's spectacular view and tranquil grounds, and for Justine who made us feel like a part of her family (the owners were out of town during our stay). Everything, and I mean everything (from snorkel gear to razors, lotion, bug spray, guidebooks, magazines, an iPad, and DVDs), has been thought of to make you feel at home. The entire house was impeccably clean and inviting with ridiculously comfortable beds (we stayed in two different rooms and loved them both). I cannot even begin to describe how scrumptious breakfast was each morning. I told Justine that I'm a vegetarian and she kindly went out of her way to accommodate my diet, never once making me feel like she was put out by doing so. I cannot say enough fantastic things about our experience here!! Thank you Justine, Binky, Shane, Diane, Pat, JP, and everyone who contributes to making Dilly Dally House the best B&B there is. So much better than a resort!", "user": "Moldahl", "date": "March 6, 2011", "id": 99179696}, {"rating": 5.0, "title": "Only one thing wrong if you want to nit pick.", "text": "-Molly & Jake (San Francisco, California)", "user": "Brukner2", "date": "March 5, 2011", "id": 99009123}, {"rating": 5.0, "title": "paradise with breakfast", "text": "PS", "user": "hyeykysy", "date": "February 25, 2011", "id": 98006768}, {"rating": 5.0, "title": "Dont look any further! Dilly Dally is where you want to stay!!", "text": "You won't find your grandma's doilies at this place. ;-)", "user": "jjjohnsonPlano_Tx", "date": "February 24, 2011", "id": 97888867}, {"rating": 5.0, "title": "Delightful Stay in Everyway!!", "text": "My husband and I were excited to celebrate our 35th wedding anniversary in Kauai. We love the beach so while I was looking for a condo on the beach, I came across the Dilly Dally House website. The reviews were so amazing we decided to book all of our 12 day stay there. Because the entire time was not available, we stayed 4 days in the Studio went away to the beach for a few days, then came back to Dilly Dally House and spent the remainder of our stay in the Cottage", "user": "jscomo", "date": "February 2, 2011", "id": 95326941}, {"rating": 5.0, "title": "Best EVER!!!! Thank you Justine!", "text": "All the outstanding reviews of Dilly Dally House are true! It is wonderful in every way. We stayed in the Studio room first. It is small but exceptionally clean and the bed is so comfortable we just melted every night. The breakfasts prepared by Justine and her mother are 5 star presentation and 5 star delicious!! Breakfast was always fun in many ways. Not only was the food superb, the surrounding mountain scenery gorgeous, but hearing accounts of previous day adventures from other people staying at Dilly Dally House were delightful. Justine and her family were extremely helpful to help plan our day. Justine knows the \"must do\" local places. She is very knowledgeable about hiking trails, helicopter rides, kayaking adventures, or just about anything else you want to know. The B&B has everything you could ever need including sunscreen, ice chest, snorkeling gear, beach chairs, beach towels. Everything is available for you to grill your meals including large gas grill, plates, silverware, and seasonings.", "user": "PortlandORLuv2travel", "date": "February 1, 2011", "id": 95173812}, {"rating": 5.0, "title": "Dilly Dally House makes you feel at home.", "text": "Our stay in the Cottage was so relaxing. It is very roomy and very warm and inviting. The outside shower was a highlight! Waking up and going outside for a shower and hearing the roosters crow got us off to a laughing start each morning. We did not want to leave.", "user": "Tanquerochicago", "date": "January 26, 2011", "id": 94539310}, {"rating": 5.0, "title": "Staying here was paradise!", "text": "We formed a quick bond with many of the other guests. Since most guests like being \"home\" in the evening, we enjoyed sitting together by the pool or at outside tables sipping wine. It was like catching up with old friends.", "user": "Robwens", "date": "January 24, 2011", "id": 94314650}, {"rating": 4.0, "title": "Very, very nice!", "text": "This review is long overdue. Starting from the moment I booked our room the Dilly Dally team was amazing. Answered all my questions and gave us great directions. Let's start with location. The Dilly Dally is about a 10 minute drive from town. I liked being up there secluded it felt like our own little piece of paradise. Upon arriving to the Dilly Dally I feel in love! Then when we found a note from Justine that we had been moved to the cottage I almost died with excitement! Amazing! Perfect little living room/kitchenette flat screen TV in both the living room and AWEsome bedroom. If I wasn't in tropical paradise I would have never left that bed. Walked into the bathroom (gorgeous, and spotless) I see a sink and toilet, where is the shower? Ummm...outside! Ok, I wasn't thrilled with this. My first shower was that evening and I didn't know what lovely wildlife would be joining me out there.....let me just say...I never want to shower inside again. That was a true tropical experience! I loved it. I could go on and on about the room.", "user": "greatoutdoors1", "date": "January 24, 2011", "id": 94306596}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "The garden is wonderful, the pool amazing, the rooms are nice... It's a very nice place to stay.", "title": "Very nice, but not completely charmed by this place", "helpfulness": 1, "user": "Uhu69", "date": "January 23, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 3.0}, "id": 94110552}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "What I liked less was :", "title": "Paradise indeed....", "user": "Ann91910", "date": "January 8, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 92207308}, {"rating": 4.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "- you rather fell like you're staying in a boutique hotel than in a B&B, the owners don't live here anymore.", "title": "Paradise found", "user": "BCCan93", "date": "January 2, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 5.0, "location": 3.0}, "id": 91421090}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "- the lack of intimacy of our room : people could and did pass through our lanai, that means just next to our window. We had to close the curtains.", "title": "Great breakfast & attention to details", "helpfulness": 1, "user": "SDSUGRAD", "date": "December 4, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 88970056}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "Overall a nice place, but not our best memory in Hawaii.", "title": "Absolutely delicious breakfasts and wonderful accommodations.", "user": "cdh137", "date": "December 2, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 88854520}], "location": {"country": "United States"}, "variance": {"poor": 0, "average": 2, "very good": 12, "terrible": 0, "excellent": 188}, "aka": "Dilly Dally House (Lolo Hale) Hotel", "slim_ranking": 0.0526315789474, "description": "First Class all the way. Hot breakfast every morning. Friendly knowledgeable hosts. Snorkeling gear, surfboards, boogie boards, beach toys supplied. Fabulous views. Plush 1000 thread count sheets. Where Kauai feels like home."}