{"user_rating": 4.5, "review_count": 595, "name": "Discovery Kartika Plaza Hotel", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed May 2012, traveled on business", "text": "Participated in an international conference arranged by an Indonesian host organisation. With the reduced rate offered for participants we chose to stay at the venue for the conference. Convenient, time saving, and excellent food and accommodation. But, there is a but. All guests are not alike. Especially not those who stay at the hotel by other reasons than holidays. We always like to see other parts of the country than a beach, a pool, or a restaurant. Therefore we wanted to go to Ubud, which was not so easy, when the bus system is difficult to use (because of language problems and unfamiliarity with foreign tourists). We therefore asked the hotel to arrange a car with driver for us. As we had a wish to see one specific place in Ubud, the driver took us there without any problem. That he happened to pass the Bali Orchid Garden twice was not something astonishing, but when we explained our wish to buy some spices where local consumers by them, strange things started to happen. We were not taken to any local markets or supermarkets, but to one of the very nice Bali Agrotourism sites where coffee, herbs and spices where demonstrated and packed \"as gifts from Bali\" to prices which no local inhabitant can afford. I can imagine foreign tourists staying at Kartika Plaza want this type of excursions, and as we were not protesting clearly enough, the driver probably thought he treated us well. When my wife saw a local shop with nice baskets, she wanted to stop. The driver neglected and said he knew a better place, which turned out to be another \"tourist trap\" with nothing like the local baskets we wanted to stop for. This time we started to be suspicious: Was this a sort of practise the hotel is encouraging? Has the driver commissions from the \"tourist markets\"? For us it was quite disappointing that we were not listened too, as we were the ones paying for the tour. For the hotel, it may be obvious that staff, including its drivers, have to understand that guests are different and would like to be treated differently. Especially not those who aren't staying at the hotel by their own choice, but at the recommendation by a conference host. To add further annoyance, my wife broke her wrist falling on the wet marble floor in the bathroom. There need to be at least some form of rubber mats for elderly people to avoid these type of accidents. In public areas warnings for wet floor were numerous, in bathrooms non existent. In preparing for check-out we had to repeat the same story three times (separate bill for the medical treatment, airport transfer priced in accordance with written agreement at booking). As a grand final, we found ourselves the Pasar Kuta (Kuta traditional market), where we could by the chilli we wanted in Ubud each morning between 5 and 9.", "title": "Luxury resort, if that is what you want", "helpfulness": 4, "user": "ahi-nama", "date": "May 20, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 130271666}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "Very well presented & maintained property. Professionally run, with very good service ethic. Food is good. We had a great time there in May 2012. The pool and spa are very good.", "title": "All about good service", "helpfulness": 2, "user": "AandD255103", "date": "May 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 130246022}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with friends", "text": "My friends and I had lunch at the hotel's cafe by the coast is great when we arrived on the first day. The food is delicious and cocktails are amazingly fresh.", "title": "Best Value 5 Star", "helpfulness": 2, "user": "PierrePrecieuse", "date": "May 16, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 130020809}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled on business", "text": "Staff are friendly and helpful, rooms are clean and nice fittings, breakfast has variety and taste delicious, spa is relaxing and fun to see your friends enjoying it too, pool area is always full of very chatty guests and water games, cocktails are amazingly fresh, kids area looked like it was under control and with lots of activities to keep the little ones busy, and walking distance from everything you could possibly want in a Balinese city...shopping mall, water park, outdoor cinema, themed bars and cafes, romantic restaurants, etc...", "title": "Good luxury hotel.", "user": "catmouse", "date": "May 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 129912426}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with friends", "text": "I would stay here again but book the nicer room because it's not as expensive as the other 5 star hotels.", "title": "What A Life...", "helpfulness": 4, "user": "W0rldTravelAdvis0r", "date": "May 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 129716035}, {"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "Stayed here in May 2008 for 10 enjoyable nights. Great location for shoppers, great pool, great breakfast. Only small prob was that we booked for a late 6pm checkout but the hotel said that was not the case and that it was a 12 noon check out Infinity / Flight Centre had not arranged such. However we negotiated the 6pm so all was well.", "title": "Nice place to discover", "helpfulness": 1, "user": "terryau", "date": "July 8, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 17638060, "likes": {"liked": "— location", "disliked": "— nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2008, traveled on business", "text": "I have stayed at discovery kartika plaza a few times over the last 4 yrs, most recent was 4 nights in june and on night on the way home,", "title": "another visit to kartika", "helpfulness": 2, "user": "mauislick", "date": "June 27, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 17269897, "likes": {"liked": "— quality of whole experiance", "disliked": "— leaving"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled with family", "text": "I'm getting to know the bell staff and the front desk staff since I've been every year for the last 4.", "title": "Great hotel, not so great city", "helpfulness": 3, "user": "Iban-Torontonian", "date": "June 3, 2008", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 4.0, "rooms": 5.0}, "id": 16653990, "likes": {"liked": "— location", "disliked": "— location OUTSIDe of hotel, even just on beach beside the pool"}}, {"rating": 3.0, "stay_parameters": "Stayed April 2008, traveled on business", "text": "They do a great job at the hotel but it may just be me, but I remember just about all the staff saying hello when walking into the front of the hotel, and this year it didn't seem like they were quite as attendive, although it may just be my imagination.", "title": "Good for an overnight stay or two, but no longer", "helpfulness": 2, "user": "Lancsthorn1", "date": "April 16, 2008", "detail_rating": {"front_desk": 2.0, "business": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "location": 3.0, "rooms": 4.0}, "id": 15081050, "likes": {"liked": "— Clean, good views", "disliked": "— Generic resort"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2008", "text": "The hotel seems to be managed by a german company or something as all the senior staff is european/german.", "title": "discovery experience", "helpfulness": 3, "user": "vprimush", "date": "March 24, 2008", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 5.0}, "id": 14489045}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled with family", "text": "This is the 6th -maybe 7th time we have stayed at The Kartika and it seems to get better all the time. It is our home away from home. Very laid back and comfortable. Wonderful staff. The grounds are immaculate and the room- ground floor private garden pool view room- was fantastic. Every thing is close by. The themed buffet nights were great. We took our 4 year old and she loved every minute of it. Pool food was good and you can choose between Japanese or the pool menu or the italian restaurant menu. The sushi was yummy !! The location is the best too. BOOK IT !!!! I am back there again in 7 weeks for a girls 10 nights away-- cant wait.xx", "title": "Awesome Place To Stay- Wonderful", "helpfulness": 8, "user": "truthtellerAustralia", "date": "March 2, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 13973013, "likes": {"liked": "— every thing", "disliked": "— nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "We stayed at the Discovery Kartika Plaza over the New Year for 9 nights. This was our 3rd time at this hotel and I would stay there again if we return to Bali. It is in a great location with a 24 hr mini mart across the road, Discovery Plaza shopping Centre next door and plenty of shopping around the hotel. The pool area is beautiful. The staff were lovely and always make us feel welcome. I would reccommend the hotel to anybody.", "title": "Great Hotel", "helpfulness": 4, "user": "eliza191", "date": "February 18, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 13636895, "likes": {"liked": "— The position and the staff", "disliked": "— Nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "My partner and I have just come back from Bali and stayed 7 nights at the Discovery Kartika Plaza Hotel, South Kuta. We really enjoyed our stay here, comfortable rooms, great pool area (big pool) and close to restaurants, bars, shops & markets.", "title": "Great Stay at the Discovery Kartika Plaza Hotel", "helpfulness": 3, "user": "africa94", "date": "February 16, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 13609232, "likes": {"liked": "— location, great pool area, clean, friendly staff"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "The buffet breakfast at the hotel is excellent, anything you can think of is there. The Kul Kul Pool Bar is also very good, great to relax around the bar with a cool drink on a hot day - reasonable prices too. The pizzas from the Italian restaurant were also brilliant! We shared a pizza and had a couple of cold Bintang beers for lunch (served around the pool) - couldn't be more relaxing than that.", "title": "Amazing Pool Area", "helpfulness": 1, "user": "PerthJade", "date": "February 12, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 3.0, "cleanliness": 5.0, "value": 3.0, "location": 5.0, "rooms": 4.0}, "id": 13510324, "likes": {"liked": "— Pool area", "disliked": "— Rooms"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2008, traveled with family", "text": "We had a couple of massages in the beach hut by the beach, approx AUD$ 27 for 1 hr. Great to relax with a massage and listening to the waves from the sea.", "title": "A great spot for families", "helpfulness": 3, "user": "Koko456", "date": "January 20, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 12806169, "likes": {"liked": "— Location, family suite", "disliked": "— Only one bathroom"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "The Discovery was the first hotel in Bali we stayed in. We arrived on Jet Star at around 10:30pm and it was only a very short trip to the hotel. On arrival the staff were very welcoming and we were soon off to our room. Once there we found they had made a mistake with the room and the only “deluxe ocean view room” had two single beds, we brought this to there attention and asked to be upgraded which was not a problem and we ended up in a room 10 meters from the ocean with the best view of the sunset I had seen in a longtime (ocean front room). We were at the Discovery for 7 nights and in this time my girlfriend and I got engaged. The staff were very helpful in making arrangements for the night and all went very well. We ate in the hotel restaurants a number of times; the meals were very nice and reasonably priced. However if you want some of the best international cuisine you will ever have head next door to the back of the shopping mall (Atmosphere) or to Kuta beach (Rosso Vivo). Conclusion is the room rate is a little more expensive than some of the more remote locations (Nusa Dua) but they do not charge a fortune for drinks and food, also the service charges are all included. The staff are very friendly, pool with swim-up bar is very nice, gardens are large and very well kept and spa services excellent and cheap for a hotel. Excellent Hotel will go back.", "title": "Best Hotel in Kuta", "helpfulness": 5, "user": "Hacha", "date": "September 17, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 8740240, "likes": {"liked": "— Pool and Garden"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled with friends", "text": "The first time we went to Bali we stayed at a hotel over the road from the Kartika.The Kartika hotel looked stunning from the front so my wife and i decided to have a look.We loved it so much we decided to change hotels and stay there for the remaining nights.", "title": "Best hotel in Bali.", "helpfulness": 1, "user": "kangaroorider", "date": "May 4, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 7544647, "likes": {"liked": "— Clean and tidy."}}, {"rating": 4.0, "stay_parameters": "Stayed March 2007", "text": "I am pleased to tell everyone we loved it so much we have been back 4 times and we even got married at the hotel.", "title": "Great Hotel, not for youth", "helpfulness": 4, "user": "jrppb", "date": "March 29, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 3.0, "rooms": 5.0}, "id": 7246822, "likes": {"liked": "— the pool", "disliked": "— the lack of youth"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "The foods great and the staff are tops.", "title": "Nice grounds average room", "helpfulness": 2, "user": "ccham", "date": "November 18, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 2.0}, "id": 6149653, "likes": {"liked": "— Location", "disliked": "— The room was very basic"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "I recommend it to all.", "title": "A Great Place to Relax", "helpfulness": 5, "user": "Doza8", "date": "November 12, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 5.0, "rooms": 3.0}, "id": 6111764, "likes": {"liked": "— Clean, with large beds and the mini bar", "disliked": "— Ask for you safe key when booking in."}}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "Just returned from 10 nights at the Kartika Plaza staying in the Ocean View Deluxe Room. Very happy with the resort grounds, pool, gym, spa, restaurants (you must try the Teppanyaki!!) Friendly staff and best breakfast I have had in Bali (been 5 times - 5 different resorts).", "title": "5 Star Resort with 3 Star Rooms", "user": "PerthTraveller2012", "date": "April 21, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 2.0, "location": 5.0}, "id": 128256586}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "Rooms unfortunately are on the small side and bathroom grout/tiles pretty grubby, we were also put next to the store room and stairwell :( Four hands massage at the spa is a must- cheaper than Australian prices but very expensive for Bali. Hired bikes and rode along the beachpath to Legian, nice ride (early!) Wi-fi drops out alot which is annoying (we were on the 3rd floor). Beautiful resort with great location but I think better value elsewhere in Kuta/Tuban area.", "title": "Great Views!! Great Staff!!", "user": "tonyandnaomi", "date": "April 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 128094095}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "We have stayed at this hotel 3 times now and keep going back because the staff are brillant and the location right on beach is one of the best in Bali. I know lots of people say the rooms are a bit dated which it is but they are very clean and have new LCD tv's and dvd players. The view from ocean facing rooms is just beautiful you look right out over pool and ocean and I love waking up to that every morning. They have also just done up fitness center and spa really nice used both also gym opens at 6.00am which means I can get my workout in before breakfast. Well and the breakfast at the Kartika is OMG!! One of the best in Bali and this hotel price wise to stay at is better than other hotels of the same standard. If you want a really nice place to stay with lovely staff got to the Kartika!!", "title": "Fantastic in so many ways - will definitely visit again !", "helpfulness": 2, "user": "jo1967", "date": "April 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 127791661}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "We (Mum, Dad & 2 teenage boys) have just returned from a 2 week stay at Discovery Kartika Plaza and couldn't have been happier with our choice of accommodation. We booked two deluxe rooms, interconnecting through Asia Rooms. Prior contact with the hotel was promptly dealt with and they accommodated us in a disabled room which was suitable for my husband as he has limited mobility (due to a brain tumour). When we initially checked in (around 2pm) there was a problem with our second room not being ready - this was eventually rectified and the hotel management provided us with a family buffet dinner and airport transfers for our inconvenience - a very thoughtful and much appreciated gesture. Throughout our stay the Balinese staff of the hotel were wonderful - even down to remembering our names on the 2nd day when we walked into breakfast ! A further highlight was the resort providing my son with cake on our arrival as it was his 17th birthday - such a kind thought ! I would not even consider staying somewhere else in Bali after our experience at the Discovery Kartika Plaza and will recommend it to family and friends.", "title": "Great stylish hotel and just loved it", "user": "Chezzbutt", "date": "April 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127355684}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled on business", "text": "In short :-", "title": "Lovely sceneries in the hotel, great staffs and secure room!", "user": "AndyBugis", "date": "April 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127337226}, {"rating": 5.0, "stay_parameters": "Stayed December 2011", "text": "My partner and I have stayed here twice, and can only highly recommend everything about this hotel/resort.", "title": "Perfect service everytime!", "helpfulness": 2, "user": "Amy T", "date": "May 6, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 129447253}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "It is pricier than most hotels in this area - but I believe highly worth it. Their staff are all soo friendly, accommodating and professional! The rooms are always very clean and neat, and lived up to our expectations.", "title": "New favourite!", "helpfulness": 2, "user": "ShelbyT1992", "date": "May 4, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 129340845}, {"rating": 3.0, "stay_parameters": "Stayed April 2012, traveled solo", "text": "As a true beachfront resort in South Kuta, it was perfect for us. Far enough from the drunk tourists in the heart of Kuta - but close enough to walk to most things we wanted to visit. The shopping mall next door, and Waterbom about 300 m away - with markets on either side, couldn't ask for anything more.", "title": "Good hotel for someone with a mild budget", "helpfulness": 1, "user": "AneeshB", "date": "May 2, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 129249317}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "The room cleaning was excellent, and I felt I couldnt tip the cleaners enough - they were excellent! And on the last night arrived in to find a towel elephant on the bed - almost made my whole week!", "title": "Never Look Back", "helpfulness": 5, "user": "cheskilfoyle", "date": "April 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 128580655}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "Pool bar is also one of the main winners for us. Never too crowded, good size, with a great resort feel - with frangipani trees around it. Staff always served great cocktails, and were able to either entertain guests or let them enjoy quietness as required. Pool was always in the sun, so perfect temperature, and could live in there all day & night! Overlooking the sea, was perfect positioning.", "title": "Lovely hotel by the beach but rooms good use a good revamp", "helpfulness": 1, "user": "IamSmitten", "date": "April 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 128570142}, {"rating": 4.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "The Kartika Plaza is an oasis in the hustle and bustle of Kuta. This is our second trip to Kuta and our first stay at the Kartika plaza. We Loved loved loved it. The location is outstanding. Everything is within walking distance. The hotel is just finishing up a renovation. We had a new room. It was fantastic. The view of the ocean and pool is worth the extra dollars and upgrade. The spa services lacked for a 5 star hotel, but we used them and they were just adequate. The breakfast buffet was outstanding. We stayed two weeks and never tired of the breakfast. The restaurants were overpriced and the food was bland ( except breakfast). We ate off site quite a bit. The pool; there are not enough words to rave about it! There was construction on the beach, but it didn't bother us. The ocean is too rough for a relaxing swim, excellent for surfing though. The rooms were clean and fresh with no complaints. Even the grass was swept clean everyday. Great mix of guests. Alot of Australians and Europeans. Don't let the hotel web site turn you away, it doesn't do it justice. While we were there, several conferences were hosted, but did not inconvenience us at all. We will stay there again and recommend it to everyone.", "title": "Paradise in Kuta", "helpfulness": 3, "user": "welovetotravel01", "date": "January 7, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 12396687, "likes": {"liked": "— breakfast buffet, pool and room", "disliked": "— cost of food and alcohol except breakfast"}}, {"rating": 2.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "Upon entering the Kartika Plaza, we were quite impressed. The hotel has great security, which made us feel safe. The lobby is gorgeous, and the gardens are nice enough.", "title": "Overrated- not at all 5 Star", "helpfulness": 4, "user": "kiara_renee", "date": "December 3, 2007", "detail_rating": {"front_desk": 2.0, "business": 4.0, "service": 2.0, "cleanliness": 2.0, "value": 1.0, "location": 4.0, "rooms": 2.0}, "id": 11218138, "likes": {"liked": "— Buffet Breakfast, and the Location", "disliked": "— Mosquitos in the aircon, and overpriced restaurants"}}, {"rating": 3.0, "stay_parameters": "Stayed November 2007, traveled with family", "text": "When we were shown to our room, we were quite disappointed.", "title": "Family Holiday", "helpfulness": 2, "user": "KoutaMelbourne", "date": "November 13, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 5.0, "rooms": 4.0}, "id": 10804645, "likes": {"liked": "— The spacious 2 bedroom suite", "disliked": "— stuck behind a tree so we hadlimited view"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "The room is very small by Bali standards. The furnishings were nice enough, but quite average.", "title": "Fantastic Hotel with Great View", "helpfulness": 2, "user": "Gandy75", "date": "November 10, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 10729224, "likes": {"liked": "— Hotel surroundings", "disliked": "— Nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "Annoying, was the fact that our \"Ocean Facing Room\" (which is more expensive than just a standard room), looked straight into the back of a frangipani tree. No Ocean in sight. (Not even a glimpse!)", "title": "Great Hotel within walking distance to Kuta's night life", "user": "kevinflint", "date": "September 30, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 10023503, "likes": {"liked": "— Location and ambience of the hotel and grounds", "disliked": "— Bathrooms"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "Just returned from our third stay at Discovery. As found in the last two visits the resort continues to offer first class accommodation and service. Its pool would have to be the best in Bali, and we have visited Bali on eight occasions, so we can compare its facilities with other resorts. Highly recommenced for a relaxing stay - we stayed ten days.", "title": "Discovered yet again", "helpfulness": 1, "user": "terryau", "date": "May 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130820209}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with friends", "text": "We did not stay here but we frequently snuck into their pool bar-haha!! The pool is amazing, very large and picturesque surroundings, the bar itself is veryyyy long and has a great selection of cocktails and food. (Great pizza and Mie Goreng!) We also visited the day spa (discovery spa) which would have to be our best spa experience in Bali, the therapists are highly skilled professionals and the facilities are lovely and relaxing. Makes a difference having a massage from someone who knows what they are doing :)", "title": "Best pool bar in Kuta!!", "helpfulness": 1, "user": "missrix", "date": "May 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130714842}, {"rating": 5.0, "title": "Nice hotel great value", "text": "I helped host a major event at this hotel and I was very impressed. The rooms have been updated and are very nice for the price. The restaurants and bars were very good and unusually affordable.", "helpfulness": 1, "user": "flybiz57", "date": "May 25, 2012", "id": 130568627}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "There is an ocean view but not really a beach. The hotel is built around a huge pools that would be great for young couples or families with kids.", "title": "Lovely hotel with top notch service", "helpfulness": 2, "user": "Penndene", "date": "May 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130504758}, {"rating": 5.0, "stay_parameters": "Stayed May 2012", "text": "I'd be glad to stay here again on vacation or business.", "title": "Great hotel and value for money", "helpfulness": 2, "user": "ASK84", "date": "May 21, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 130331610}], "location": {"country": "Indonesia", "continent": "Asia", "city": "Kuta"}, "stars": 4.5, "variance": {"poor": 12, "average": 51, "very good": 185, "terrible": 23, "excellent": 324}, "aka": "Discovery Kartika Plaza Kuta", "slim_ranking": 0.0124223602484, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.0, "location": 4.5}}