{"user_rating": 4.5, "review_count": 148, "name": "Disini Luxury Spa Villas", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "This is an excellent group of villas, situated just off the main road (quiet though) in Seminyak. We had a one bedroom villa, with indoor and outdoor bathroom, kitchen and dining area outside along with a lounge next to our private plunge pool. All of which was of a very good quality.", "title": "Fantastic Villas", "helpfulness": 1, "user": "MattnVic", "date": "May 17, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 30168201}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "Breakfast could be order at anytime, arriving promptly and to a high standard. Delivered and laid out for you on your table.", "title": "So much better than a hotel", "helpfulness": 1, "user": "ozsetter", "date": "April 21, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 28440757}, {"rating": 4.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "Stayed here for 2 nights. Beautiful private villa with your own private pool and nice landscaping. Staff are friendly and helpful, they even gave us a quick go on the Segway- but only in the driveway. We had indonesian friends visit and security on the gate asked for ID, even though my husband greeted our friends at the gate. The bed was huge and comfortable. The TV only had 1 english speaking movie channel with bad reception and UK news and Bloomberg. They did have Japanese channels. There is a DVD player in the room so if you buy DVD's in Bali you could watch these. Breakfast was good and served in your villa at a time that suited you, with a choice of Western Japanese Indonesian and Dusini special- eggs benedict. Our first night we could hear singing but it wasn't loud enough to keep us awake although the resident gecko did. We were staying in villa 1, the closest to reception, but villa is enclosed with its own gate so it does feel very private. I enquired about Spa treatments at Disini and they are expensive and in US dollars, across the road is Ulin villas and spa. Treatments are almost half the price and you don't need to be a guest to use the private spa there.", "title": "Nice stay at a Disini Villa", "helpfulness": 1, "user": "tf1966", "date": "February 15, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 56012712}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "We walked in off the road and asked the price at Dusini Luxury Villa AU$225 per night low season. Worth it! The villa is located away from busy Kuta and Legian but is a short Taxi ride.", "title": "Absolutley Sensational!", "helpfulness": 2, "user": "13marky", "date": "November 16, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 49376969}, {"rating": 2.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "And yes the photos are what you actually get!", "title": "Overated Disini - really not that good", "helpfulness": 1, "user": "agambhir", "date": "October 8, 2009", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 2.0, "value": 1.0, "rooms": 2.0, "location": 4.0}, "id": 46163689, "likes": {"liked": "— nothing", "disliked": "— everything"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "We stayed at Disini for 10 days and had the best time of our life! The villas are beautiful with their own private infinity pool, amazing bed and fitted out with every luxury possible.", "title": "Beautiful Villas Great Service, Best part of our honeymoon!", "helpfulness": 2, "user": "KarishmaK", "date": "September 30, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 45502419}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "The service was second to none. The staff were the most attentive we have ever experienced. Nothing was a problem, everything we needed was arranged with a smile.", "title": "Fantastic Second time around as well !", "helpfulness": 2, "user": "pinktori71", "date": "August 10, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 37215725}], "location": {"country": "Indonesia", "continent": "Asia", "city": "Seminyak"}, "stars": 4.5, "variance": {"poor": 5, "average": 9, "very good": 17, "terrible": 2, "excellent": 114}, "aka": "Disini Luxury Spa Villas Hotel", "slim_ranking": 0.25, "description": "Disini Luxury Spa Villas is an exceptional 5-star quality boutique villa resort nestled within the opulent lifestyle area of Seminyak, consisting of 22 \"Tropical Elegance\" style villa with infinity pool, spacious living/dining area and European kitchen, enclosed within a beautifully manicured garden. Kingsize bedroom adjoints an ensuite spa, marble bath & separate shower room. Each of the Disini Luxury Spa Villas is designed and decorated in elegant Balinese style. Daily gourmet breakfast, 24-hr bulter service and unlimited shuttle drop-off is inclusive."}